[
    {
        "title": "'He was going to kill me': More strangulation cases recorded by police - but many investigations falter",
        "description": "Around 70% of non-fatal strangulation cases in the last year have been dropped due to evidential issues, exclusive data shared with Sky News shows.",
        "url": "https://news.sky.com/story/he-was-going-to-kill-me-more-strangulation-cases-recorded-by-police-but-many-investigations-falter-13380082",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-domestic-abuse-strangulation_6935856.png?20250606133226",
        "type": "Home",
        "Author": "Joely Santa Cruz, data journalist, and Ashna Hurynag, news correspondent",
        "Date Published": "2025-06-06 23:01:00",
        "Headline": "Three years since non-fatal strangulation became an offence in England and Wales, new data sheds light on how the legislation is being used.",
        "Content": "By Joely Santa Cruz, data journalist, and Ashna Hurynag, news correspondent   Around 70% of non-fatal strangulation cases in the last year have been dropped due to evidential issues, exclusive data shared with Sky News shows. It is now three years since it became a standalone offence in England and Wales, in a landmark piece of legislation designed to protect domestic abuse victims. Data from the Institute for Addressing Strangulation (IFAS) shows that police are implementing the offence widely - but outcomes for victims are mixed. Warning: This article contains references to domestic abuse and sexual assault 'Sarah' - whose name has been changed to protect her identity - vividly remembers the first time her ex-partner strangled her, one year into their relationship. She said: \"He was drunk, and he climbed on top me. He put his hands around my throat, and he pinned me down with the strength of his body.\" Terrified, she begged him repeatedly to stop, but he carried on. \n                  Paramedic who survived Israeli attack that killed 15 aid workers describes alleged torture in custody\n                 \n                  Chaos, confusion and killings: How the Israeli-backed aid plan in Gaza is unravelling\n                 \n                  How Elon Musk's mission to cut government spending fell flat\n                 \"I remember I just felt really numb and scared, but it was weird, it felt like an out-of-body experience.\" Afterwards the only words he spoke to her were \"look what you made me do,\" she said, and then when the ordeal was over, he carried on with his day as if nothing had happened. This was the beginning of a pattern of abuse that continued throughout the rest of their relationship, happening on at least 30 more occasions, Sarah estimated. It became so normalised He strangled her when she was pregnant. He strangled her whether her children were in the house or not. It always happened during sex, though Sarah was only later able to recognise that this was rape after talking to the police, because for her it had become so normalised. And, always, he told Sarah it was her fault - that she had somehow 'made' him do it. She later went on to suffer a miscarriage because of the physical abuse. 'A form of control' \"Looking back now I can see it was a form of control he got off on, knowing that he was in control, and he liked seeing me upset,\" she said. \"I thought that he was going to kill me because he used to threaten it to me. It was very, very scary.\" This fear of death is common among victims of strangulation and is a recognised tool of control and intimidation. A US study found that victims of domestic abuse were seven times more likely to be murdered by their current or former partner if there had been an incident of non-fatal strangulation beforehand. But this form of violence often leaves no obvious external signs of injury, meaning in some cases perpetrators could only be investigated for less serious offences like common assault, which did not reflect the severity of the crime. What are the possible effects on health? The potential health impacts are wide-ranging, including loss of consciousness, voice changes, difficulty in swallowing and breathing, bruising, haemorrhages, headaches, depression, post-traumatic stress disorder (PTSD), miscarriage, risk of suicide, and death (including delayed death). Symptoms can arise weeks or months after the event. It is for these reasons that campaigners fought for the introduction of the standalone offence, which came into effect in June 2022. 'Much work to be done' The IFAS has been monitoring the offence since the legislation was introduced and shared its latest report findings exclusively with Sky News. It said there is still \"much work to be done\" to better protect victims of strangulation. New figures obtained by IFAS from the Home Office reveal that over 63,000 crimes of non-fatal strangulation or suffocation were recorded by police in England and Wales in the first two years under the legislation. There were 39,360 recorded crimes in 2023/24, on average 66 offences per 100,000 people compared with 50 per 100,000 the year before, an increase of 20%. \"Survivors who work with us have recognised time and time again how important it is to be able to see strangulation as a standalone offence and have the opportunity to progress with criminal justice proceedings,\" Harriet Smailes, co-author of the report, told Sky News. The volume of crimes recorded suggests that the offence is being widely recognised and reported by police - and the number resulting in charges, at 12%, is high compared to some other offences. However, a significant number of investigations result in no further action due to evidential difficulties. This can happen if police or prosecutors do not believe there is enough evidence to proceed, or if the victim does not support the investigation. This was the outcome in three in five investigations overall, including one in five investigations where the victim did support police action. Outcomes were similar in both years of available data. \"In around half of cases, there are no external, physical, visible signs of injury. That's not to say that there aren't internal injuries that can't be seen just with the naked eye,\" said Ms Smailes, who is a research officer at IFAS. \"It might be that that visible injury isn't present at the time of evidence capture that might develop over time, or because there's a difference in how individuals show bruising, for example those of different skin tones. That can contribute towards there not being enough perceived evidence to be able to progress with a police case,\" she said. In some cases where a victim disengages from police proceedings, it may be that they did not feel supported and believed in the process or felt that there were \"too many obstacles\". On the other hand, not all cases where a victim did not support police action are necessarily negative. \"It might be that initial needs have been met in that instance through reporting to the police, for example, initial containment of the risk of that situation, and referrals to specialist health or mental health services,\" Ms Smailes explained. Police 'determined' to improve  Assistant Commissioner Louisa Rolfe is the National Police Chiefs' Council lead for domestic abuse. She told Sky News that securing prosecutions for strangulation is a priority for tackling violence against women and girls, and a key part of national Domestic Abuse Matters training. \"For us to do well in prosecutions, we need to understand how perpetrators operate, how they use this is a sinister way of controlling their victims. And we also know that many victims are frightened to pursue prosecution,\" she said. Investigators not only have to secure detailed evidence rapidly but also present the best possible case so that prosecutors and juries understand how an abuser is operating, she said. \"That can be a challenging job, for a police service that's under pressure, trying to deal with a myriad of priorities. I know many investigators are passionate about getting this right.\" \"We know we're up against it when it comes to securing convictions, but we're determined to improve,\" she added. Fewer than half were convicted Separate research by IFAS has found that in the first year under the new legislation, only around half of the number of offences charged by police were prosecuted, and less than half of those secured a conviction. Overall, 47% of the 1,437 prosecutions of non-fatal strangulation and suffocation offences in the year to June 2023 resulted in conviction, based on data from the Ministry of Justice (MoJ) from all courts in England and Wales. There are several potential reasons that a prosecution may be unsuccessful, including evidential difficulties or a victim withdrawing from the process. The accused may also have been convicted of a separate offence, but not for the strangulation. Without more detailed data, it is hard to determine to what extent each is contributing to the low conviction rate. Reflecting on the figures, head of policy and public affairs at domestic abuse support charity Refuge, Ellie Butt, told Sky News that victims often face \"huge pressure\" from perpetrators to drop out of the criminal justice process. \"When compounded with lengthy court delays and insufficient support, many survivors are forced to withdraw from the process. Police and prosecutors should be working to build cases that can be taken forward even when a survivor can no longer continue,\" she said. The Crown Prosecution Service highlighted to Sky News that the number of new prosecution proceedings has been consistently increasing, particularly domestic abuse-related strangulation offences. In the latest quarter, 2,000 cases reached their first hearing at magistrates' court. Kate Brown, the CPS national lead for domestic abuse, said: \"Three years on, we have continued to bring more charges quarter on quarter, with over 2,000 seen in court in the past three months. \"This standalone offence has shone a light on those who seek to use these violent acts to exert power over another person and harm them. We are determined to continue bringing abusers to justice for victims.\" A gendered crime  The new data from IFAS reinforces that strangulation is a gendered crime. Around 80% of victims whose gender was recorded by police were female, while 88% of suspects were male. The data also shows that while people from all ages are impacted, most victims are younger, with three in five aged 34 or under. The age profile of suspects was slightly higher, with three in five suspects aged between 25 and 44. 'I want to say it's not your fault' Sarah's case ended in evidential difficulties. Though her case was reported before 2022, when strangulation became a specific offence, she said she did provide substantial physical evidence to the police and she feels \"let down\" by the justice system. She said she has been diagnosed with PTSD, anxiety and other health issues. \"I live with it every day. It can be a song that comes on the radio or a sign or somebody's name and it would just bring everything back to me to that point, that moment,\" she said. \"I want to say it's not your fault. Nobody has the right to control you, nobody has the right to abuse you, rape you, strangle you. \"I would urge anyone to speak out and if you feel like you haven't been heard and your voice has not been listened to, speak out again.\" If you or someone you know is a victim of domestic abuse, support is available. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling, we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Trump says Musk has 'lost his mind' - as president considering selling his Tesla",
        "description": "Donald Trump has said Elon Musk has \"lost his mind\", according to US media, and has no plans to speak with him.",
        "url": "https://news.sky.com/story/trump-says-musk-has-lost-his-mind-as-president-considering-selling-his-tesla-13380118",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-donald-trump_6872205.jpg?20250606165909",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 13:55:00",
        "Headline": "The president is considering selling his Tesla, a source familiar with the situation has told Sky News, in a further sign that no resolution to the explosive bust-up is in sight.",
        "Content": " Donald Trump has said Elon Musk has \"lost his mind\", according to US media, and has no plans to speak with him. In a phone interview with ABC News, the US president was asked about reports that a phone call was scheduled on Friday between Musk and himself. \"You mean the man who has lost his mind?\" he is said to have responded. A White House official said that no phone call was lined up between Mr Trump and his former ally amid a bitter feud between the two. Later on Friday, Mr Trump told reporters aboard Air Force One he had no plans to speak with Musk. It comes as a source familiar with the situation has told Sky News the president is considering selling his Tesla, in a further sign that no resolution to the explosive bust-up is in sight. Mr Trump purchased a Tesla earlier this year, describing the company as Elon's \"baby\".  👉 Follow Trump100 on your podcast app 👈 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 \n                  In a dangerous world, the explosive Trump-Musk bust-up is more terrifying than titillating\n                 \n                  Trade war: US hiring slows but employment resilient\n                 The pair's relationship broke down publicly on Thursday, just days after Tesla and SpaceX CEO Musk left his role as a special government employee. In a fiery exchange, Musk posted a series of messages on X criticising the president's signature tax bill as a \"big ugly spending bill\". President Trump posted on Truth Social that Musk had been \"wearing thin\" and claimed he \"asked him to leave\" his government position, something Musk denied. Elon Musk then hit back, alleging the president \"is in the Epstein files. That is the real reason they have not been made public.\" He gave no evidence for the claim, and it was dismissed by the White House. In a statement, it called the bust-up an \"unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill because it does not include the policies he wanted.\" Read more:Musk says Trump appears in Epstein files as row explodesThe extraordinary spat minute-by-minuteThe big, beautiful bust-up everyone knew was coming  The bill at the centre of the spat was passed by the House Republicans in May and has been described by the president as a \"big, beautiful bill\". The president said to reporters in the White House on Thursday that Musk \"knew the inner workings of the bill better than anybody sitting here\". \"He had no problem with it. All of a sudden, he had a problem and he only developed the problem when he found out we're going to have to cut the EV mandate.\" Musk then denied this, saying: \"False, this bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\" The spat hit Tesla shares, which closed down 14.3% on Thursday, losing about $150bn (£111bn) in value. Musk also said SpaceX will begin decommissioning its Dragon spacecraft \"immediately\" after Mr Trump threatened to cancel government contracts with Musk's businesses. Hours after issuing his threat, however, Musk heeded advice from X users telling him to \"cool down\" and posted: \"Ok, we won't decommission Dragon\". The row between two of the most powerful men in America comes a week after Musk left his position in the government, where he spearheaded a controversial cost-cutting department, DOGE - the Department of Government Efficiency."
    },
    {
        "title": "White House officials to meet Chinese delegation in London for next round of trade talks",
        "description": "Senior White House officials will meet with a Chinese delegation in London on Monday for the next round of trade talks, US President Donald Trump has said.",
        "url": "https://news.sky.com/story/white-house-officials-to-meet-chinese-delegation-in-london-for-next-round-of-trade-talks-13380245",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 19:05:00",
        "Headline": "This follows a \"very good\" hour-and-a-half phone call between Donald Trump and Xi Jinping on Thursday - amid the US and China's ongoing trade war.",
        "Content": "Senior White House officials will meet with a Chinese delegation in London on Monday for the next round of trade talks, US President Donald Trump has said. The meeting comes after a phone call between Mr Trump and Chinese leader Xi Jinping on Thursday, which the US president said was \"very positive\" - lasting about an hour and a half.Speaking to reporters on Friday from Air Force One, the president added that it was a \"good talk\", describing the deal as \"complicated\", but one that \"will bring us a lot of money\". He also said: \"I get along well with Xi and China.\"  Writing on his Truth Social platform, Mr Trump said the upcoming London meeting \"should go very well\" and added that treasury secretary Scott Bessent, commerce secretary Howard Lutnick and trade representative Jamieson Greer would represent the US at the talks. It is unclear who will represent China. The two countries are at an impasse over tariffs and a dispute involving critical rare earth mineral exports, in which China remains the dominant producer. On 12 May, China and the US struck a 90-day deal in Geneva to pause retaliatory tariffs placed on each other since Mr Trump was inaugurated in January. \n                  British man charged over plot to smuggle US military technology to China\n                 \n                  Trump's sweeping tariffs blocked: What happens now?\n                 \n                  Former spy chief on Gaza, China, and cyber warfare\n                 The US president said the move was part of a \"total reset\" in relations. The agreement prompted a global surge in stock markets and US indexes that were in, or approaching, bear market levels.  The temporary deal saw the US reduce its 145% tariff to 30% on Chinese goods. China also agreed to reduce its 125% retaliatory tariffs to 10% on US goods. However, sector-specific tariffs, such as the 25% tax on cars, aluminium and steel, are still in place. Read more from Sky News:Trump says Musk has 'lost his mind'Beckham to be knighted in King's Birthday Honours listMan wrongly deported from US to El Salvador returns to face criminal charges 👉 Follow Trump 100 on your podcast app 👈 The Chinese foreign ministry said the US president initiated the call, and they had asked him to \"remove the negative measures\" in place against China. It also said that Mr Trump said \"the US loves to have Chinese students coming to study in America\". This is despite his administration previously saying it will \"aggressively\" revoke the visas of Chinese students studying in the US. Since Mr Trump's re-election, the president has frequently issued threats of punitive trade measures against US partners, only to backtrack at the last minute."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador has been returned to face criminal charges",
        "description": "A man who was mistakenly deported to El Salvador by the Trump administration has been returned to the US to face criminal charges.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-has-been-returned-to-face-criminal-charges-13380263",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 20:04:00",
        "Headline": "Abrego Garcia's lawyer argues the decision to bring charges \"proves what we've known all along\", that American officials \"had the ability to bring him back and just refused to do so\".",
        "Content": "A man who was mistakenly deported to El Salvador by the Trump administration has been returned to the US to face criminal charges. Kilmar Abrego Garcia was charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US, attorney general Pam Bondi said on Friday. Court records have shown the indictment was filed on 21 May, more than two months after he was deported from the US under a controversial 18th-century wartime law. Appearing in a court on Friday in Nashville, Tennessee, Abrego Garcia was asked if he understood the charges. He told the judge: \"Sí. Lo entiendo.\" An interpreter then said: \"Yes. I understand.\" He will be held in custody until at least next Friday, when there will be an arraignment and detention hearing, the judge ruled. Abrego Garcia's lawyers have called the charges \"preposterous\". \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  Trump and Musk's extraordinary spat minute-by-minute\n                 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 One of his lawyers, Andrew Rossman, said it would now be up to the US judicial system to ensure he received due process. \"Today's action proves what we've known all along - that the administration had the ability to bring him back and just refused to do so,\" he said. Salvadoran Abrego Garcia, 29, was deported from Maryland despite an immigration judge's 2019 order granting him protection after finding he was likely to be persecuted by local gangs if he was returned to his native country. The indictment alleges Abrego Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. On Friday, Ms Bondi outlined the charges at a news conference, saying: \"The grand jury found that over the past nine years, Abrego Garcia has played a significant role in an alien smuggling ring. \"He made over 100 trips, the grand jury found - smuggling people throughout our country... MS-13 [international criminal gang] members, violent gang terrorist organisation members... throughout our country. \"He will be prosecuted in our country, sentenced in our country if convicted and then returned after completion of his sentence.\" Ms Bondi said Salvadoran President Nayib Bukele agreed to return Abrego Garcia to the US after American officials presented his government with an arrest warrant. Read more from Sky News:Trump says Musk has 'lost his mind'Israel warns of new Gaza operation Democrat senator Chris Van Hollen travelled to El Salvador in April to meet Abrego Garcia, arguing his constitutional rights to due process were being ignored. Critics of Donald Trump have pointed to the deportation of Abrego Garcia as an example of the excesses of the Republican president's aggressive immigration policies. US district judge Paula Xinis has opened a probe into what, if anything, Mr Trump's administration has done to secure his return, after his lawyers accused officials of stonewalling their requests for information. Officials responded by alleging that Abrego Garcia was a member of the MS-13 gang - something his lawyers have strongly denied. In a separate statement, Ms Bondi also attacked what she called the \"Fake News Media\" and repeated the - yet unproven - allegations against Abrego Garcia. \"The Justice Department's Grand Jury Indictment against Abrego Garcia proves the unhinged Democrat Party was wrong, and their stenographers in the Fake News Media were once again played like fools. \"Abrego Garcia was never an innocent 'Maryland Man'- Abrego Garcia is an illegal alien terrorist, gang member, and human trafficker who has spent his entire life abusing innocent people, especially women and the most vulnerable.\""
    },
    {
        "title": "Body found in wooded area in search for missing teenager Cole Cooper",
        "description": "A body has been found in the search for a teenager who went missing more than four weeks ago.",
        "url": "https://news.sky.com/story/body-found-in-wooded-area-in-search-for-missing-teenager-cole-cooper-13380202",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-scotland-missing_6929391.jpg?20250602082807",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 16:48:00",
        "Headline": "Cole Cooper, 19, was last seen by a school friend on Wednesday 7 May, in the village of Longcroft near Falkirk, in central Scotland.",
        "Content": "A body has been found in the search for a teenager who went missing more than four weeks ago. Cole Cooper, 19, was last seen by a school friend on Wednesday 7 May, in the village of Longcroft near Falkirk, in central Scotland. Mr Cooper was reported missing by his family on Friday 9 May, sparking a major investigation involving helicopters, divers, digital specialists and hundreds of officers. Police Scotland said a man's body was discovered in a wooded area near Kilsyth Road in Banknock, Falkirk, on Friday afternoon. \"Formal identification has yet to take place however the family of missing man Cole Cooper, 19, has been informed,\" the force said in a statement. \"Enquiries remain ongoing to establish the full circumstances.\" Officers said the last confirmed sighting was at 8.45pm on the A803 at its intersection with Cumbernauld Road, Longcroft, on 7 May. Speaking to Sky News Breakfast earlier this week, his brother Connor said their family felt \"lost\" and described his sibling's disappearance as \"hell... for all of us\". He described him going missing as \"very much out of character\" and said that even if his brother wanted some space or alone time, he would have notified family or friends beforehand - and would never \"put his younger siblings through this\". His mother Wendy Stewart described the situation as \"total heartache\" and was afraid he may have been \"picked up by a car\". \"Is it actually happening?\" she said. \"I have been wanting to wake up and it's just been a big nightmare.\" Read more from Sky News:Bargain Hunt expert jailedYellow thunderstorm warnings issuedRetired vicar reveals role in 'Eunuch Maker' plot During the search, police visited more than 220 properties and trawled through around 1,000 hours of CCTV footage in a bid to find Mr Cooper. Specialist resources from across the country were mobilised, including a helicopter and drones from the air support unit, as well as officers from the dive and marine unit. The force previously indicated there was no suggestion of any criminality."
    },
    {
        "title": "Arrests of illegal migrant workers increase by 51% in year since Labour elected",
        "description": "Arrests of migrants working illegally in the UK have increased by 51% in the year since the general election, after the government targeted restaurants, nail bars, and construction sites. ",
        "url": "https://news.sky.com/story/arrests-of-illegal-migrant-workers-increase-by-51-in-year-since-labour-elected-13380090",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-east-london-london_6935905.jpg?20250606143838",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 23:01:00",
        "Headline": "From 5 July 2024 - the day after Labour won the election - to 31 May 2025, 6,410 people have been arrested on suspicion of working illegally in the UK, according to Home Office figures.",
        "Content": "Arrests of migrants working illegally in the UK have increased by 51% in the year since the general election, after the government targeted restaurants, nail bars, and construction sites.  From 5 July 2024 - the day after Labour won the election - to 31 May 2025, 6,410 people have been arrested on suspicion of working illegally, according to Home Office figures. This is a rise of 51% on the previous year when the Conservatives were in government, the department says. As part of Labour's Plan for Change, enforcement officials have made 9,000 visits to restaurants, nail bars, and construction sites, among other premises, to root out those suspected of working without a visa - a 48% increase in activity during the previous year. Video footage shows the moment 36 people were arrested at a construction site in Belfast's Titanic Quarter where enforcement officials uncovered people breaching their visa conditions and working in the UK having entered the country illegally. In Surrey last month, nine people were arrested at a caravan park after intelligence revealed it was being used for illegal delivery drivers. In Bradford in March, a further nine people were arrested after officers identified a popular pick-up spot for illegal workers. Read more from Sky NewsCancer patients missing holidaysWater bosses' bonuses bannedPrisoners to be moved to lower security jails People traffickers often trick migrants into deadly small boat crossings by promising they will be able to find work in the UK, when in reality, those arrive safely are instead forced into squalid conditions, for no or little money. Employers are supposed to carry out right-to-work checks on all new employees who come from abroad - with those who fail to do so facing £60,000 fines per worker, director disqualifications, and prison sentences of up to five years. 30,000 returned to home countries Alongside the arrests, since Labour came to power, almost 30,000 people who had no right to be in the UK have been returned to their home countries, according to Home Office data. The government says it is also introducing tougher laws, extending right-to-work checks, and targeting particular sectors known to be linked to illegal workers. Dame Angela Eagle, minister for border security and asylum, said: \"For too long, employers have been able to take on and exploit migrants, with people allowed to arrive and work here illegally. \"This will no longer be tolerated on our watch. That's why we are ramping up our enforcement activity and introducing tougher laws to finally get a grip of our immigration and asylum system.\" Eddy Montgomery, director of enforcement, compliance and crime for immigration enforcement, added: \"Our work to tackle illegal working is vital in not only bringing the guilty to account, but also in protecting vulnerable people from exploitation. \"I'm incredibly proud of our enforcement teams across the country for their hard work, skill and cooperation on these often challenging but highly important operations.\""
    },
    {
        "title": "Millions to receive NHS screening invitations and appointment reminders on their phones",
        "description": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones.",
        "url": "https://news.sky.com/story/millions-to-receive-nhs-screening-invitations-and-appointment-reminders-on-their-phones-13380109",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nhs-app-on-phone-department-of-health_6936208.jpg?20250607003247",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 13:30:00",
        "Headline": "It's part of efforts to bring the NHS out of the \"analogue age\" and into a digital one, with physical NHS letters being scrapped.",
        "Content": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones. The government says moving to a more digital-focused NHS will mean 50 million fewer letters need to be sent out by the health service, saving an estimated £200m over the next three years. Instead, under the new plans, millions of people will be notified about appointments and other important notices via the NHS app on their phone or digital device. The app is set to become the go-to method for the NHS to communicate with people, the Department of Health and Social Care said. The changes will be backed by more than £50m investment. It will see a predicted 270 million messages sent through the app this year, an increase of around 70 million on the last financial year, the government announced. Wes Streeting has said this is all about modernising, as the NHS \"feels so 20th century\". The health secretary said: \"The fact that people still get letters through the front door, sometimes multiple letters about the same appointment... The NHS has been stuck in the mud when it comes to the everyday technology we use to organise our lives. And that's why what we're doing with the NHS app is really exciting.\" \n                  The NHS winter crisis is a recurring seasonal theme – tackling it will bring challenges\n                 \n                  Labour vows to tackle 'corridor care' and long waits with almost £450m NHS investment in England\n                 \n                  Plans to tackle mental health crisis 'not ambitious enough', charity boss tells Sky News\n                 Mr Streeting said the app will make using the NHS more convenient, and give patients more control, while saving money. He said these funds can then be invested back into the health service, to bolster things such as frontline care. Using the NHS app should be 'as joyful as Netflix' The modernisation of the NHS will also lead to fewer missed appointments, and therefore save money that way too, it is hoped. In 2023/24, there were around eight million missed appointments in elective care and almost one in three people missed a screening appointment. Currently, around 20 million people have opted in to receive messages from the NHS app.  Pushed on how the government will ensure that nobody is left behind, Mr Streeting said: \"If someone like me is booking my appointment through the app because that's what I prefer to do, [then] that's freeing up a phone line for someone who wants to get through and talk to a person.\" He added that greater use of the app will give people more choice in \"how you want to organise your care\". The cabinet minister also made a bold comparison, saying he wishes that the NHS app is as enjoyable as using streaming giant Netflix. He said: \"The NHS app actually has more subscribers than Netflix. It would be a really wonderful thing if using the NHS app felt - if not as joyful - almost as joyful as using Netflix.\" Read more: Almost £450m invested in NHS in EnglandNHS waiting list increases for first time in months Other features in the pipeline - though not yet available - include being able to add appointments to phone calendars and request help from local GPs on the app. Faster log in methods, such as using Face ID, are also planned."
    },
    {
        "title": "More than 40 'narco-boat' drug smugglers arrested in major police sting",
        "description": "More than 40 people have been arrested after a major drugs raid busted a \"narco-boats\" gang accused of trafficking cocaine into the EU.",
        "url": "https://news.sky.com/story/more-than-40-narco-boat-drug-smugglers-arrested-in-major-police-sting-13380253",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-cocaine-spain_6936137.png?20250606204656",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 19:35:00",
        "Headline": "The gang used \"mother ships\" to transport cocaine from South America to the Canary Islands, with 11 speedboats used to ferry the drugs to shore.",
        "Content": "More than 40 people have been arrested after a major drugs raid busted a \"narco-boats\" gang accused of trafficking cocaine into the EU. The investigation, dubbed Operation Black Shadow, saw police forces from around the world work together to seize nearly 3,800 kilos of cocaine, 69 vehicles and €100,000 (£84,232) in cash. A British national was among the 48 arrested during last Tuesday's raids, the National Crime Agency confirmed to Sky News. The gang used \"mother ships\" to transport cocaine from South America to the Canary Islands, with 11 speedboats used to ferry the drugs to shore. They even turned an abandoned shipwreck into a refuelling platform for the speedboats and boats, according to Spain's Policia Nacional. The criminal network used a \"complex encrypted communications system\" to evade police, including the use of satellite terminals, hard-to-trace phones and a coded language. Read more from Sky News:David Beckham to be knightedRetired vicar admits role in 'Eunuch Maker' ring \n                  Paul Danan: Former Hollyoaks actor died by misadventure after taking cocktail of drugs, coroner rules\n                 \n                  The ins and outs of UK cannabis law - and calls to decriminalise it\n                 \n                  Sadiq Khan says some cannabis possession should be decriminalised\n                 Twenty-nine houses were searched in Fuerteventura, Gran Canaria and Lanzarote. \"The criminal network specialised in smuggling large quantities of cocaine from South America into Spanish territory using high-speed boats, said an NCA spokesperson to Sky News. \"Alongside our international partners, we are relentless in our efforts to tackle drug trafficking across borders, ensuring it's seized before it reaches the UK criminal supply chain.\""
    },
    {
        "title": "Blood test for Alzheimer's disease is highly accurate, researchers say",
        "description": "Researchers say a new blood test for Alzheimer's disease has been shown to be highly accurate in detecting people with early symptoms.",
        "url": "https://news.sky.com/story/blood-test-for-alzheimers-disease-is-highly-accurate-researchers-say-13380314",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-microscope-laboratory_6936209.jpg?20250607013047",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 23:30:00",
        "Headline": "US researchers say their next step is to extend the test to a wider range of patients, including those with early Alzheimer's who do not have any cognitive symptoms.",
        "Content": "Researchers say a new blood test for Alzheimer's disease has been shown to be highly accurate in detecting people with early symptoms. Scientists looked for two proteins - amyloid beta 42/40 and p-tau217 - and found the test was 95% accurate in identifying patients with existing cognitive impairment linked to the condition. The US study involved 509 patients in an outpatient memory clinic in Florida and was published in the medical journal Alzheimer's and Dementia. The test, which has already been approved by the US regulator, was also 82% accurate for specificity, which means it could rule out people without dementia. Dr Gregg Day, who led the study, said the test was as good as existing, but more invasive, tests. He said the next step was to extend the test to a wider range of patients, including those with early Alzheimer's who do not have any cognitive symptoms. Scientists say the two proteins, which they have identified in blood plasma, are associated with the buildup of amyloid plaques. \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 \n                  Football bodies could be forced to pay towards brain injury care costs of ex-players\n                 \n                  Bristol Rovers legend taking legal action against FA over brain condition says he has just years to live\n                 Amyloid protein can be found in our brains, but in Alzheimer's disease, amyloid sticks together and forms abnormal deposits, which are thought to be toxic to brain cells. Dr Richard Oakley, associate director for research and innovation at the Alzheimer's Society in the UK, said the results \"suggest this test is very accurate\". \"Blood tests will be critical to accelerate diagnosis and give more people access to the care, support and treatments they desperately need faster than ever before,\" he added. Read more:Dementia risk link to sleep problemsBrain injury costs for ex-footballersFormer player shares dementia fears In the UK, the Blood Biomarker Challenge is a multi-million-pound research programme supported by the Alzheimer's Society, Alzheimer's Research UK and the National Institute for Health and Care Research.  Its goal is to bring blood tests for dementia diagnosis to the NHS by 2029. Dr Julia Dudley, head of research at Alzheimer's Research UK, said: \"We urgently need to improve how we diagnose dementia and it's great to see international research working towards this goal.\" She said the studies like the Blood Biomarker Challenge are a \"crucial part of making diagnosis easier and faster, which will bring us closer to a cure\". \"The study is testing blood tests, including p-tau217, in thousands of people from sites across the UK,\" she added."
    },
    {
        "title": "Yellow warning for thunderstorms issued for large parts of England and Wales",
        "description": "A yellow warning for thunderstorms has been issued for large parts of England and Wales on Saturday.",
        "url": "https://news.sky.com/story/yellow-warning-for-thunderstorms-issued-for-large-parts-of-england-and-wales-13380067",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-millennium-bridge-weather_6238379.jpg?20230802160806",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-06 11:58:00",
        "Headline": "People in the affected areas are being warned of delays to train services, with some short-term losses of power also likely.",
        "Content": "A yellow warning for thunderstorms has been issued for large parts of England and Wales on Saturday. The Met Office warning covers most of southern England, parts of the Midlands and most of south Wales between 9am until 6pm on Saturday. People in the affected areas are being warned heavy showers and thunderstorms may lead to some disruption to transport services. Find out the forecast for your area Delays to train services are possible and some short-term losses of power are also likely. The UK's weather agency said 10 to 15mm of rain could fall in less than an hour, while some places could see 30 to 40mm of rain over several hours from successive showers and thunderstorms. It has also warned of frequent lightning, hail and strong gusty winds. \n                  UK has warmest spring on record, Met Office says\n                 \n                  UK set for hotter than usual summer and heatwaves, Met Office predicts\n                 \n                  UK has its sunniest spring since records began, Met Office says\n                 Met Office Chief Meteorologist Dan Suri said most places in the warning areas will be hit by showers, although not all will see storms. \"In this case, it's difficult to predict where exactly thunderstorms will hit because they are small and fast changing,\" he said. Read more:The big, beautiful bust-up everyone knew was comingDavid Beckham to be knightedWhy did Reform UK's chair quit? The wet weather comes days after the Met Office said the UK had its warmest spring on record - and its driest for 50 years. Provisional figures showed spring temperatures surpassed the long-term average by 1.4C - with a mean temperature of 9.5C (49.1F). That beat the previous warmest spring recorded in 2024. Temperature records were broken in all four nations in the UK - with 1.64C above the long-term average in Northern Ireland, 1.56C above average in Scotland, 1.39C in Wales and 1.35C in England. In records dating back to 1884, the Met Office said eight of the 10 warmest springs had occurred since 2000 - and the three warmest had been since 2017, in a sign of the changing climate. Conditions were also incredibly dry this spring, with an average of 128.2mm of rain falling in the UK across March, April and May - the lowest spring total since 1974, which saw 123.2mm."
    },
    {
        "title": "'He was going to kill me': More strangulation cases recorded by police - but many investigations falter",
        "description": "Around 70% of non-fatal strangulation cases in the last year have been dropped due to evidential issues, exclusive data shared with Sky News shows.",
        "url": "https://news.sky.com/story/he-was-going-to-kill-me-more-strangulation-cases-recorded-by-police-but-many-investigations-falter-13380082",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-domestic-abuse-strangulation_6935856.png?20250606133226",
        "type": "UK",
        "Author": "Joely Santa Cruz, data journalist, and Ashna Hurynag, news correspondent",
        "Date Published": "2025-06-06 23:01:00",
        "Headline": "Three years since non-fatal strangulation became an offence in England and Wales, new data sheds light on how the legislation is being used.",
        "Content": "By Joely Santa Cruz, data journalist, and Ashna Hurynag, news correspondent   Around 70% of non-fatal strangulation cases in the last year have been dropped due to evidential issues, exclusive data shared with Sky News shows. It is now three years since it became a standalone offence in England and Wales, in a landmark piece of legislation designed to protect domestic abuse victims. Data from the Institute for Addressing Strangulation (IFAS) shows that police are implementing the offence widely - but outcomes for victims are mixed. Warning: This article contains references to domestic abuse and sexual assault 'Sarah' - whose name has been changed to protect her identity - vividly remembers the first time her ex-partner strangled her, one year into their relationship. She said: \"He was drunk, and he climbed on top me. He put his hands around my throat, and he pinned me down with the strength of his body.\" Terrified, she begged him repeatedly to stop, but he carried on. \n                  Paramedic who survived Israeli attack that killed 15 aid workers describes alleged torture in custody\n                 \n                  Chaos, confusion and killings: How the Israeli-backed aid plan in Gaza is unravelling\n                 \n                  How Elon Musk's mission to cut government spending fell flat\n                 \"I remember I just felt really numb and scared, but it was weird, it felt like an out-of-body experience.\" Afterwards the only words he spoke to her were \"look what you made me do,\" she said, and then when the ordeal was over, he carried on with his day as if nothing had happened. This was the beginning of a pattern of abuse that continued throughout the rest of their relationship, happening on at least 30 more occasions, Sarah estimated. It became so normalised He strangled her when she was pregnant. He strangled her whether her children were in the house or not. It always happened during sex, though Sarah was only later able to recognise that this was rape after talking to the police, because for her it had become so normalised. And, always, he told Sarah it was her fault - that she had somehow 'made' him do it. She later went on to suffer a miscarriage because of the physical abuse. 'A form of control' \"Looking back now I can see it was a form of control he got off on, knowing that he was in control, and he liked seeing me upset,\" she said. \"I thought that he was going to kill me because he used to threaten it to me. It was very, very scary.\" This fear of death is common among victims of strangulation and is a recognised tool of control and intimidation. A US study found that victims of domestic abuse were seven times more likely to be murdered by their current or former partner if there had been an incident of non-fatal strangulation beforehand. But this form of violence often leaves no obvious external signs of injury, meaning in some cases perpetrators could only be investigated for less serious offences like common assault, which did not reflect the severity of the crime. What are the possible effects on health? The potential health impacts are wide-ranging, including loss of consciousness, voice changes, difficulty in swallowing and breathing, bruising, haemorrhages, headaches, depression, post-traumatic stress disorder (PTSD), miscarriage, risk of suicide, and death (including delayed death). Symptoms can arise weeks or months after the event. It is for these reasons that campaigners fought for the introduction of the standalone offence, which came into effect in June 2022. 'Much work to be done' The IFAS has been monitoring the offence since the legislation was introduced and shared its latest report findings exclusively with Sky News. It said there is still \"much work to be done\" to better protect victims of strangulation. New figures obtained by IFAS from the Home Office reveal that over 63,000 crimes of non-fatal strangulation or suffocation were recorded by police in England and Wales in the first two years under the legislation. There were 39,360 recorded crimes in 2023/24, on average 66 offences per 100,000 people compared with 50 per 100,000 the year before, an increase of 20%. \"Survivors who work with us have recognised time and time again how important it is to be able to see strangulation as a standalone offence and have the opportunity to progress with criminal justice proceedings,\" Harriet Smailes, co-author of the report, told Sky News. The volume of crimes recorded suggests that the offence is being widely recognised and reported by police - and the number resulting in charges, at 12%, is high compared to some other offences. However, a significant number of investigations result in no further action due to evidential difficulties. This can happen if police or prosecutors do not believe there is enough evidence to proceed, or if the victim does not support the investigation. This was the outcome in three in five investigations overall, including one in five investigations where the victim did support police action. Outcomes were similar in both years of available data. \"In around half of cases, there are no external, physical, visible signs of injury. That's not to say that there aren't internal injuries that can't be seen just with the naked eye,\" said Ms Smailes, who is a research officer at IFAS. \"It might be that that visible injury isn't present at the time of evidence capture that might develop over time, or because there's a difference in how individuals show bruising, for example those of different skin tones. That can contribute towards there not being enough perceived evidence to be able to progress with a police case,\" she said. In some cases where a victim disengages from police proceedings, it may be that they did not feel supported and believed in the process or felt that there were \"too many obstacles\". On the other hand, not all cases where a victim did not support police action are necessarily negative. \"It might be that initial needs have been met in that instance through reporting to the police, for example, initial containment of the risk of that situation, and referrals to specialist health or mental health services,\" Ms Smailes explained. Police 'determined' to improve  Assistant Commissioner Louisa Rolfe is the National Police Chiefs' Council lead for domestic abuse. She told Sky News that securing prosecutions for strangulation is a priority for tackling violence against women and girls, and a key part of national Domestic Abuse Matters training. \"For us to do well in prosecutions, we need to understand how perpetrators operate, how they use this is a sinister way of controlling their victims. And we also know that many victims are frightened to pursue prosecution,\" she said. Investigators not only have to secure detailed evidence rapidly but also present the best possible case so that prosecutors and juries understand how an abuser is operating, she said. \"That can be a challenging job, for a police service that's under pressure, trying to deal with a myriad of priorities. I know many investigators are passionate about getting this right.\" \"We know we're up against it when it comes to securing convictions, but we're determined to improve,\" she added. Fewer than half were convicted Separate research by IFAS has found that in the first year under the new legislation, only around half of the number of offences charged by police were prosecuted, and less than half of those secured a conviction. Overall, 47% of the 1,437 prosecutions of non-fatal strangulation and suffocation offences in the year to June 2023 resulted in conviction, based on data from the Ministry of Justice (MoJ) from all courts in England and Wales. There are several potential reasons that a prosecution may be unsuccessful, including evidential difficulties or a victim withdrawing from the process. The accused may also have been convicted of a separate offence, but not for the strangulation. Without more detailed data, it is hard to determine to what extent each is contributing to the low conviction rate. Reflecting on the figures, head of policy and public affairs at domestic abuse support charity Refuge, Ellie Butt, told Sky News that victims often face \"huge pressure\" from perpetrators to drop out of the criminal justice process. \"When compounded with lengthy court delays and insufficient support, many survivors are forced to withdraw from the process. Police and prosecutors should be working to build cases that can be taken forward even when a survivor can no longer continue,\" she said. The Crown Prosecution Service highlighted to Sky News that the number of new prosecution proceedings has been consistently increasing, particularly domestic abuse-related strangulation offences. In the latest quarter, 2,000 cases reached their first hearing at magistrates' court. Kate Brown, the CPS national lead for domestic abuse, said: \"Three years on, we have continued to bring more charges quarter on quarter, with over 2,000 seen in court in the past three months. \"This standalone offence has shone a light on those who seek to use these violent acts to exert power over another person and harm them. We are determined to continue bringing abusers to justice for victims.\" A gendered crime  The new data from IFAS reinforces that strangulation is a gendered crime. Around 80% of victims whose gender was recorded by police were female, while 88% of suspects were male. The data also shows that while people from all ages are impacted, most victims are younger, with three in five aged 34 or under. The age profile of suspects was slightly higher, with three in five suspects aged between 25 and 44. 'I want to say it's not your fault' Sarah's case ended in evidential difficulties. Though her case was reported before 2022, when strangulation became a specific offence, she said she did provide substantial physical evidence to the police and she feels \"let down\" by the justice system. She said she has been diagnosed with PTSD, anxiety and other health issues. \"I live with it every day. It can be a song that comes on the radio or a sign or somebody's name and it would just bring everything back to me to that point, that moment,\" she said. \"I want to say it's not your fault. Nobody has the right to control you, nobody has the right to abuse you, rape you, strangle you. \"I would urge anyone to speak out and if you feel like you haven't been heard and your voice has not been listened to, speak out again.\" If you or someone you know is a victim of domestic abuse, support is available. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling, we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Body found in wooded area in search for missing teenager Cole Cooper",
        "description": "A body has been found in the search for a teenager who went missing more than four weeks ago.",
        "url": "https://news.sky.com/story/body-found-in-wooded-area-in-search-for-missing-teenager-cole-cooper-13380202",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-scotland-missing_6929391.jpg?20250602082807",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 16:48:00",
        "Headline": "Cole Cooper, 19, was last seen by a school friend on Wednesday 7 May, in the village of Longcroft near Falkirk, in central Scotland.",
        "Content": "A body has been found in the search for a teenager who went missing more than four weeks ago. Cole Cooper, 19, was last seen by a school friend on Wednesday 7 May, in the village of Longcroft near Falkirk, in central Scotland. Mr Cooper was reported missing by his family on Friday 9 May, sparking a major investigation involving helicopters, divers, digital specialists and hundreds of officers. Police Scotland said a man's body was discovered in a wooded area near Kilsyth Road in Banknock, Falkirk, on Friday afternoon. \"Formal identification has yet to take place however the family of missing man Cole Cooper, 19, has been informed,\" the force said in a statement. \"Enquiries remain ongoing to establish the full circumstances.\" Officers said the last confirmed sighting was at 8.45pm on the A803 at its intersection with Cumbernauld Road, Longcroft, on 7 May. Speaking to Sky News Breakfast earlier this week, his brother Connor said their family felt \"lost\" and described his sibling's disappearance as \"hell... for all of us\". He described him going missing as \"very much out of character\" and said that even if his brother wanted some space or alone time, he would have notified family or friends beforehand - and would never \"put his younger siblings through this\". His mother Wendy Stewart described the situation as \"total heartache\" and was afraid he may have been \"picked up by a car\". \"Is it actually happening?\" she said. \"I have been wanting to wake up and it's just been a big nightmare.\" Read more from Sky News:Bargain Hunt expert jailedYellow thunderstorm warnings issuedRetired vicar reveals role in 'Eunuch Maker' plot During the search, police visited more than 220 properties and trawled through around 1,000 hours of CCTV footage in a bid to find Mr Cooper. Specialist resources from across the country were mobilised, including a helicopter and drones from the air support unit, as well as officers from the dive and marine unit. The force previously indicated there was no suggestion of any criminality."
    },
    {
        "title": "Arrests of illegal migrant workers increase by 51% in year since Labour elected",
        "description": "Arrests of migrants working illegally in the UK have increased by 51% in the year since the general election, after the government targeted restaurants, nail bars, and construction sites. ",
        "url": "https://news.sky.com/story/arrests-of-illegal-migrant-workers-increase-by-51-in-year-since-labour-elected-13380090",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-east-london-london_6935905.jpg?20250606143838",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 23:01:00",
        "Headline": "From 5 July 2024 - the day after Labour won the election - to 31 May 2025, 6,410 people have been arrested on suspicion of working illegally in the UK, according to Home Office figures.",
        "Content": "Arrests of migrants working illegally in the UK have increased by 51% in the year since the general election, after the government targeted restaurants, nail bars, and construction sites.  From 5 July 2024 - the day after Labour won the election - to 31 May 2025, 6,410 people have been arrested on suspicion of working illegally, according to Home Office figures. This is a rise of 51% on the previous year when the Conservatives were in government, the department says. As part of Labour's Plan for Change, enforcement officials have made 9,000 visits to restaurants, nail bars, and construction sites, among other premises, to root out those suspected of working without a visa - a 48% increase in activity during the previous year. Video footage shows the moment 36 people were arrested at a construction site in Belfast's Titanic Quarter where enforcement officials uncovered people breaching their visa conditions and working in the UK having entered the country illegally. In Surrey last month, nine people were arrested at a caravan park after intelligence revealed it was being used for illegal delivery drivers. In Bradford in March, a further nine people were arrested after officers identified a popular pick-up spot for illegal workers. Read more from Sky NewsCancer patients missing holidaysWater bosses' bonuses bannedPrisoners to be moved to lower security jails People traffickers often trick migrants into deadly small boat crossings by promising they will be able to find work in the UK, when in reality, those arrive safely are instead forced into squalid conditions, for no or little money. Employers are supposed to carry out right-to-work checks on all new employees who come from abroad - with those who fail to do so facing £60,000 fines per worker, director disqualifications, and prison sentences of up to five years. 30,000 returned to home countries Alongside the arrests, since Labour came to power, almost 30,000 people who had no right to be in the UK have been returned to their home countries, according to Home Office data. The government says it is also introducing tougher laws, extending right-to-work checks, and targeting particular sectors known to be linked to illegal workers. Dame Angela Eagle, minister for border security and asylum, said: \"For too long, employers have been able to take on and exploit migrants, with people allowed to arrive and work here illegally. \"This will no longer be tolerated on our watch. That's why we are ramping up our enforcement activity and introducing tougher laws to finally get a grip of our immigration and asylum system.\" Eddy Montgomery, director of enforcement, compliance and crime for immigration enforcement, added: \"Our work to tackle illegal working is vital in not only bringing the guilty to account, but also in protecting vulnerable people from exploitation. \"I'm incredibly proud of our enforcement teams across the country for their hard work, skill and cooperation on these often challenging but highly important operations.\""
    },
    {
        "title": "Bargain Hunt expert Oghenochuko Ojiri jailed after failing to report sale of artworks to 'Hezbollah financier'",
        "description": "An expert on TV show Bargain Hunt has been jailed for two and a half years after failing to report the sale of artworks to a man suspected of financing Hezbollah.",
        "url": "https://news.sky.com/story/bargain-hunt-expert-oghenochuko-ojiri-jailed-after-failing-to-report-sale-of-artworks-to-hezbollah-financier-13380168",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-oghenochuko-ojiri-court_6911018.jpg?20250509124633",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-06-06 15:21:00",
        "Headline": "A court heard the 53-year-old, who also appeared on the BBC's Antiques Road Trip, sold around £140,000 worth of art to a suspected Hezbollah financier. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n An expert on TV show Bargain Hunt has been jailed for two and a half years after failing to report the sale of artworks to a man suspected of financing Hezbollah. Oghenochuko Ojiri, who has also appeared on another BBC programme Antiques Road Trip, sold around £140,000 worth of art to Nazem Ahmad over a 14-month period between October 2020 and December 2021, the Old Bailey heard. Art dealer Ojiri, 53, who is known as Ochuko, admitted eight counts in May of failing to make a disclosure during the course of business within the regulated sector, contrary to section 21A of the Terrorism Act 2000. Lebanese businessman and diamond dealer Ahmad was described in court as a \"prominent financier\" for Hezbollah, a proscribed terrorist group in the UK. Prosecutor Lyndon Harris said Ahmad has an extensive art collection worth tens of millions of pounds, including works by Pablo Picasso and Andy Warhol, many of which are displayed in his penthouse in Beirut. Ojiri, who owned the Ramp Gallery, which was later renamed the Ojiri Gallery, sent a message to a contact saying, \"I can't risk selling directly to him,\" after Ahmad was sanctioned in the US, the court heard. But Mr Harris said \"that's exactly what he did\" when he sold artworks, which were sent to Dubai, the UAE and Beirut. Ojiri's barrister Kevin Irwin said he was arrested on 18 April 2023 in Wrexham while filming a BBC show and his \"humiliation is complete\" as he appeared for sentencing. Ahmad was sanctioned on the same day in the UK and officers later seized artworks held in two warehouses in the country, including a Picasso and a Warhol, valued at almost £1m. 'Shameful fall from grace' Sentencing Ojiri to two years and six months in prison, with an additional year on extended licence, the judge, Mrs Justice Cheema-Grubb, told him: \"You knew about Ahmad's suspected involvement in financing terrorism and the way the art market can be exploited by someone like him\". She said Ojiri, from Brent, north London, viewed his offences as a \"shameful fall from grace of a public personality and role model for those from an ethnic minority, in the arts and antique sector\". \"Your hard work, talent and charisma have brought you a great deal of success,\" the judge said. \"You knew you shouldn't be dealing with this man. I don't accept you were naive, rather it benefitted you to close your eyes to what you believed he was. \"You knew it was your duty to alert the authorities but you elected to balance the financial profit and commercial success of your business against Ahmad's dark side.\" Read more from Sky News:David Beckham to be knightedRetired vicar admits role in 'Eunuch Maker' ring Commander Dominic Murphy, head of the Metropolitan Police's counter terrorism command, said the prosecution was the \"first of its kind\" and should serve as a warning to art dealers. \"Oghenochuko Ojiri wilfully obscured the fact he knew he was selling artwork to Nazem Ahmad, someone who has been sanctioned by the UK and US treasury and described as a funder of the proscribed terrorist group Hezbollah,\" he said."
    },
    {
        "title": "Millions to receive NHS screening invitations and appointment reminders on their phones",
        "description": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones.",
        "url": "https://news.sky.com/story/millions-to-receive-nhs-screening-invitations-and-appointment-reminders-on-their-phones-13380109",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nhs-app-on-phone-department-of-health_6936208.jpg?20250607003247",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 13:30:00",
        "Headline": "It's part of efforts to bring the NHS out of the \"analogue age\" and into a digital one, with physical NHS letters being scrapped.",
        "Content": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones. The government says moving to a more digital-focused NHS will mean 50 million fewer letters need to be sent out by the health service, saving an estimated £200m over the next three years. Instead, under the new plans, millions of people will be notified about appointments and other important notices via the NHS app on their phone or digital device. The app is set to become the go-to method for the NHS to communicate with people, the Department of Health and Social Care said. The changes will be backed by more than £50m investment. It will see a predicted 270 million messages sent through the app this year, an increase of around 70 million on the last financial year, the government announced. Wes Streeting has said this is all about modernising, as the NHS \"feels so 20th century\". The health secretary said: \"The fact that people still get letters through the front door, sometimes multiple letters about the same appointment... The NHS has been stuck in the mud when it comes to the everyday technology we use to organise our lives. And that's why what we're doing with the NHS app is really exciting.\" \n                  The NHS winter crisis is a recurring seasonal theme – tackling it will bring challenges\n                 \n                  Labour vows to tackle 'corridor care' and long waits with almost £450m NHS investment in England\n                 \n                  Plans to tackle mental health crisis 'not ambitious enough', charity boss tells Sky News\n                 Mr Streeting said the app will make using the NHS more convenient, and give patients more control, while saving money. He said these funds can then be invested back into the health service, to bolster things such as frontline care. Using the NHS app should be 'as joyful as Netflix' The modernisation of the NHS will also lead to fewer missed appointments, and therefore save money that way too, it is hoped. In 2023/24, there were around eight million missed appointments in elective care and almost one in three people missed a screening appointment. Currently, around 20 million people have opted in to receive messages from the NHS app.  Pushed on how the government will ensure that nobody is left behind, Mr Streeting said: \"If someone like me is booking my appointment through the app because that's what I prefer to do, [then] that's freeing up a phone line for someone who wants to get through and talk to a person.\" He added that greater use of the app will give people more choice in \"how you want to organise your care\". The cabinet minister also made a bold comparison, saying he wishes that the NHS app is as enjoyable as using streaming giant Netflix. He said: \"The NHS app actually has more subscribers than Netflix. It would be a really wonderful thing if using the NHS app felt - if not as joyful - almost as joyful as using Netflix.\" Read more: Almost £450m invested in NHS in EnglandNHS waiting list increases for first time in months Other features in the pipeline - though not yet available - include being able to add appointments to phone calendars and request help from local GPs on the app. Faster log in methods, such as using Face ID, are also planned."
    },
    {
        "title": "Teenager killed in Sheffield crash came to UK months ago 'for a better future'",
        "description": "A teenager who died after being hit by a car in Sheffield had recently come to the UK from Yemen looking \"for a better future\", his loved ones said.",
        "url": "https://news.sky.com/story/teenager-killed-in-sheffield-crash-came-to-uk-months-ago-for-a-better-future-13380208",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abdullah-yaser-abdullah-al-yazidi_6936048.jpg?20250606180457",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 17:02:00",
        "Headline": "After arriving in the UK from Yemen two or three months ago, the 16-year-old devoted himself to learning English ahead of starting at college in September, according to his friends and family.",
        "Content": "A teenager who died after being hit by a car in Sheffield had recently come to the UK from Yemen looking \"for a better future\", his loved ones said. Abdullah Yaser Abdullah Al Yazidi, 16, wanted to be \"friends with everybody\" and would \"light up\" people's faces with a big smile\", according to his relatives and friends. After arriving in the UK from Yemen two or three months ago, he had devoted himself to learning English ahead of starting at college in September, they said. His relative, Saleh Alsirkal, runs a corner shop that the teenager popped into just before he was hit by an Audi car on Wednesday. \"His dad brought him over to change his life, to get a better future for his son, but this has happened and destroyed everything,\" said Mr Alsirkal.  Mr Alsirkal said Abdullah was a \"kind boy\" who just wanted to look after his family, including his three sisters and was really enjoying learning English. \"Every time he had a new word to learn, he was so excited about it,\" he said. \n                  XL bully on the loose after being shot at by police in Sheffield\n                 \n                  Police arrest man over alleged firearm possession and bomb hoax after 'challenging' operation in Sheffield\n                 \"It meant a lot to him and he learned quick. Sometimes he would stay in the shop just so he could talk to people. He tried to be friends with everyone.\" \"He wanted to be the main guy for the family. He was 16 years old, but he was a clever man,\" said Mr Alsirkal. Abdullah's friend, Oasmah Thabet, said the teenager \"really cared for his family\". \"You can really tell the character of somebody by the support they give to their family,\" he said. \"To the people who would come around and just say hello to him, he would light up their faces with a big smile. \"I'd like to think that we related in the sense that both our families migrated from Yemen to here. \"The reason our family came here was for a better life - to live the dream. \"For something to happen like this and for your dreams to be cut so short, it's a tragic loss for the family and it's just a shock that can't be described.\" The teenager was walking along Staniforth Road, in the Darnall area of Sheffield, when he was hit by the car. The grey Audi also hit an e-bike, leaving an 18-year-old man with serious injuries, before leaving the scene. Police are still questioning a 20-year-old man on suspicion of murder and attempted murder after he was arrested in Kent on Thursday. Read more from Sky News:Trump says Musk has 'lost his mind'Bargain Hunt expert jailedBody found in wooded area in search for missing teenager A 26-year-old man was rearrested on suspicion of murder and attempted murder, after initially being arrested on suspicion of assisting an offender. \"This is a heartbreaking case in which a completely innocent boy has lost his life,\" said Detective Chief Inspector Benjamin Wood. \"Our thoughts remain with Abdullah's family and our priority is securing justice for them. \"A murder investigation has been launched and we have a team of detectives working around the clock. \"I am renewing our message to not share footage of this incident which may cause further distress to Abdullah's loved ones.\" DCI Wood asked for anyone with footage or information to contact officers and said he was keen to hear from the riders of two electric bikes who were in the area at the time. Two people, a man, aged 46, and a woman, aged 45, arrested on suspicion of assisting an offender, have both been bailed pending further inquiries, police said."
    },
    {
        "title": "Yellow warning for thunderstorms issued for large parts of England and Wales",
        "description": "A yellow warning for thunderstorms has been issued for large parts of England and Wales on Saturday.",
        "url": "https://news.sky.com/story/yellow-warning-for-thunderstorms-issued-for-large-parts-of-england-and-wales-13380067",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-millennium-bridge-weather_6238379.jpg?20230802160806",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 11:58:00",
        "Headline": "People in the affected areas are being warned of delays to train services, with some short-term losses of power also likely.",
        "Content": "A yellow warning for thunderstorms has been issued for large parts of England and Wales on Saturday. The Met Office warning covers most of southern England, parts of the Midlands and most of south Wales between 9am until 6pm on Saturday. People in the affected areas are being warned heavy showers and thunderstorms may lead to some disruption to transport services. Find out the forecast for your area Delays to train services are possible and some short-term losses of power are also likely. The UK's weather agency said 10 to 15mm of rain could fall in less than an hour, while some places could see 30 to 40mm of rain over several hours from successive showers and thunderstorms. It has also warned of frequent lightning, hail and strong gusty winds. \n                  UK has warmest spring on record, Met Office says\n                 \n                  UK set for hotter than usual summer and heatwaves, Met Office predicts\n                 \n                  UK has its sunniest spring since records began, Met Office says\n                 Met Office Chief Meteorologist Dan Suri said most places in the warning areas will be hit by showers, although not all will see storms. \"In this case, it's difficult to predict where exactly thunderstorms will hit because they are small and fast changing,\" he said. Read more:The big, beautiful bust-up everyone knew was comingDavid Beckham to be knightedWhy did Reform UK's chair quit? The wet weather comes days after the Met Office said the UK had its warmest spring on record - and its driest for 50 years. Provisional figures showed spring temperatures surpassed the long-term average by 1.4C - with a mean temperature of 9.5C (49.1F). That beat the previous warmest spring recorded in 2024. Temperature records were broken in all four nations in the UK - with 1.64C above the long-term average in Northern Ireland, 1.56C above average in Scotland, 1.39C in Wales and 1.35C in England. In records dating back to 1884, the Met Office said eight of the 10 warmest springs had occurred since 2000 - and the three warmest had been since 2017, in a sign of the changing climate. Conditions were also incredibly dry this spring, with an average of 128.2mm of rain falling in the UK across March, April and May - the lowest spring total since 1974, which saw 123.2mm."
    },
    {
        "title": "EuroMillions: UK's biggest lottery prize is still up for grabs",
        "description": "There is still the chance for someone to secure the biggest lottery prize the UK has ever seen, after Friday's EuroMillions draw had no winners.",
        "url": "https://news.sky.com/story/euromillions-single-ticket-holder-could-win-uks-biggest-lottery-prize-tonight-13379902",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 05:33:00",
        "Headline": "There were no winners from Friday's draw, meaning the next chance to become instantly richer than Adele and Dua Lipa will be on Tuesday.",
        "Content": "There is still the chance for someone to secure the biggest lottery prize the UK has ever seen, after Friday's EuroMillions draw had no winners. The jackpot had rolled over to an estimated £208m, after Tuesday's £199m draw - which also would have been a record-breaking amount - had no winners. The winner would instantly become richer than Adele and Harry Styles, while also bagging the top spot on the National Lottery's biggest wins list. Housing raffles take UK by storm - how likely are you to win? Andy Carter, senior winners' adviser at Allwyn, said: \"The EuroMillions jackpot is now capped, so any money that would have gone into increasing the jackpot now boosts prizes in the next winning prize tier. \"We could see multiple UK players banking huge prizes for matching just the five main numbers and one Lucky Star.\" The previous largest prize pot was won by an anonymous UK ticket-holder, who took home £195m on 19 July 2022. Read more from Sky News:Musk and Trump row escalatesBeyonce rides into London Just two months earlier, Joe and Jess Thwaite, from Gloucester, won £184,262,899 with a Lucky Dip ticket. At the time, Joe was a communications sales engineer, and Jess ran a hairdressing salon with her sister. Mr Thwaite said he woke up at 5am as usual, and checked his phone to see an email saying, \"Good news, you have won a prize\". But he did not immediately wake his wife, choosing to let her sleep in. \"I saw how much and I didn't know what to do,\" Mr Thwaite said. \"I couldn't go back to sleep, I didn't want to wake Jess up, so I just laid there for what seemed like forever. I spent some time searching for property with no budget limit, which was a novelty!\" When his wife woke up, she assumed the National Lottery app was wrong. Read more:$2bn lottery winner sued by man who claims ticket was stolenMan celebrates £5.2m win with surprising first purchaseTrainee gas engineer, 20, wins £7.5m - but won't quit work  In February last year, Richard and Debbie Nuttall were revealed as the UK winners of a £61m EuroMillions jackpot - who at first thought they had only won £2.60. The couple from Lancashire split the £123m prize with a winner in Spain. This year's biggest prize, of £83m went to a UK winner in January."
    },
    {
        "title": "Archbishop of Canterbury job advert goes live – and for the first time they could be a woman",
        "description": "A job description for the next Archbishop of Canterbury has gone live, seeking a leader with the \"utmost integrity\" - &#160;and, for the first time in the church's history, they could be a woman.",
        "url": "https://news.sky.com/story/archbishop-of-canterbury-job-advert-goes-live-8211-and-for-the-first-time-they-could-be-a-woman-13380161",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-justin-welby-archbishop-of-canterbury_6821876.jpg?20250207005302",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 15:10:00",
        "Headline": "The role, which has been empty since Justin Welby left in January, could be filled by a woman - for the first time in the role's history.",
        "Content": "A job description for the next Archbishop of Canterbury has gone live, seeking a leader with the \"utmost integrity\" -  and, for the first time in the church's history, they could be a woman. Justin Welby left the vacancy in January after resigning following a damning review into the Church of England's handling of an abuse scandal. The archbishop is the most senior bishop and is the spiritual leader of the church and worldwide Anglican Communion. This week, a so-called 'statement of needs' was published by the Diocese of Canterbury, setting out a long list of requirements for the 106th archbishop. These include: • A person with \"theological depth\" who is a strong communicator with people of all ages and backgrounds;• Someone of the \"utmost integrity who is able to speak honestly\" about issues and injustices in the church;• A \"servant leader who shows compassion towards the disadvantaged and marginalised\";• Being \"unapologetic about offering a Christian perspective to local, national, and international dialogue\";• A willingness to ordain and consecrate both men and women, support the ministry of both, and may themselves be male or female;• Having previously \"worked, and will continue to work constructively\" around ongoing discussions around blessing services for same-sex couples, but also someone who can \"embrace\" both those who support and oppose same-sex marriage in the church. Women have been ordained in the Church of England for a number of years, but no woman has ever been in the top role. Read more on Sky News:Trump and Musk's extraordinary spat minute-by-minuteDavid Beckham to be knightedGaza marks start of Eid with outdoor prayers in rubble Candidates have historically already held senior leadership roles. They must be at least 30 years old - and generally younger than 70. Typically, rather than applying, candidates are \"invited\" to take part in the process. Earlier this year, a public consultation with over 11,000 people took place to give people the opportunity to submit candidates and desirable qualities. It is thought the candidate could be announced by the autumn, a year after Mr Welby resigned from the job. Mr Welby announced he was stepping down in November 2024 following failures in handling a church abuse scandal involving barrister and religious camp leader John Smyth QC. He is thought to be the most prolific abuser associated with the church."
    },
    {
        "title": "Tottenham sack boss Ange Postecoglou despite Europa League win",
        "description": "Tottenham Hotspur have sacked their head coach Ange Postecoglou, despite winning the Europa League 16 days ago. ",
        "url": "https://news.sky.com/story/tottenham-sack-manager-ange-postecoglou-despite-europa-league-win-13292599",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-ange-postecoglou-tottenham_6804483.jpg?20250119185416",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-06 15:50:00",
        "Headline": "The Australian, who delivered on his promise of \"always\" winning in his second season, was only the third Spurs boss to taste European success and the first in 17 years to lift silverware.",
        "Content": "Tottenham Hotspur have sacked their head coach Ange Postecoglou, despite winning the Europa League 16 days ago.  The team struggled in the Premier League this season and finished in 17th position, one place above the relegation zone. However, the 1-0 win against Manchester United salvaged the campaign as it secured a place in next season's Champions League. But the European trophy was not enough to save Postecoglou his job, with his sacking coming exactly two years on from his appointment, having joined from Celtic on 6 June, 2023. The 59-year-old Australian, who delivered on his promise of \"always\" winning in his second season, was only the third Spurs boss to taste European success and the first in 17 years to lift silverware. \"Following a review of performances and after significant reflection, the club can announce that Ange Postecoglou has been relieved of his duties,\" a club statement read. \"We are extremely grateful to Ange for his commitment and contribution during his two years at the club. Ange will always be remembered as only the third manager in our history to deliver a European trophy, alongside legendary figures Bill Nicholson and Keith Burkinshaw. \"However, the board has unanimously concluded that it is in the best interests of the club for a change to take place.\" Read more:Spurs beat Man Utd in Europa League in finalLiverpool win Premier League to equal Man Utd's record In a statement, Postecoglou said: \"When I reflect on my time as manager of Tottenham Hotspur, my overriding emotion is one of pride. \"The opportunity to lead one of England's historic football clubs and bring back the glory it deserves will live with me for a lifetime. \"Sharing that experience with all those who truly love this club and seeing the impact it had on them is something I will never forget.\" Sky Sports News understands Brentford boss Thomas Frank, the bookmakers' favourite, is the leading contender to succeed Postecoglou. The Dane has a release clause in his contract, although negotiations are yet to take place with the west London club, SSN reports."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador has been returned to face criminal charges",
        "description": "A man who was mistakenly deported to El Salvador by the Trump administration has been returned to the US to face criminal charges.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-has-been-returned-to-face-criminal-charges-13380263",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-06 20:04:00",
        "Headline": "Abrego Garcia's lawyer argues the decision to bring charges \"proves what we've known all along\", that American officials \"had the ability to bring him back and just refused to do so\".",
        "Content": "A man who was mistakenly deported to El Salvador by the Trump administration has been returned to the US to face criminal charges. Kilmar Abrego Garcia was charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US, attorney general Pam Bondi said on Friday. Court records have shown the indictment was filed on 21 May, more than two months after he was deported from the US under a controversial 18th-century wartime law. Appearing in a court on Friday in Nashville, Tennessee, Abrego Garcia was asked if he understood the charges. He told the judge: \"Sí. Lo entiendo.\" An interpreter then said: \"Yes. I understand.\" He will be held in custody until at least next Friday, when there will be an arraignment and detention hearing, the judge ruled. Abrego Garcia's lawyers have called the charges \"preposterous\". \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  Trump and Musk's extraordinary spat minute-by-minute\n                 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 One of his lawyers, Andrew Rossman, said it would now be up to the US judicial system to ensure he received due process. \"Today's action proves what we've known all along - that the administration had the ability to bring him back and just refused to do so,\" he said. Salvadoran Abrego Garcia, 29, was deported from Maryland despite an immigration judge's 2019 order granting him protection after finding he was likely to be persecuted by local gangs if he was returned to his native country. The indictment alleges Abrego Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. On Friday, Ms Bondi outlined the charges at a news conference, saying: \"The grand jury found that over the past nine years, Abrego Garcia has played a significant role in an alien smuggling ring. \"He made over 100 trips, the grand jury found - smuggling people throughout our country... MS-13 [international criminal gang] members, violent gang terrorist organisation members... throughout our country. \"He will be prosecuted in our country, sentenced in our country if convicted and then returned after completion of his sentence.\" Ms Bondi said Salvadoran President Nayib Bukele agreed to return Abrego Garcia to the US after American officials presented his government with an arrest warrant. Read more from Sky News:Trump says Musk has 'lost his mind'Israel warns of new Gaza operation Democrat senator Chris Van Hollen travelled to El Salvador in April to meet Abrego Garcia, arguing his constitutional rights to due process were being ignored. Critics of Donald Trump have pointed to the deportation of Abrego Garcia as an example of the excesses of the Republican president's aggressive immigration policies. US district judge Paula Xinis has opened a probe into what, if anything, Mr Trump's administration has done to secure his return, after his lawyers accused officials of stonewalling their requests for information. Officials responded by alleging that Abrego Garcia was a member of the MS-13 gang - something his lawyers have strongly denied. In a separate statement, Ms Bondi also attacked what she called the \"Fake News Media\" and repeated the - yet unproven - allegations against Abrego Garcia. \"The Justice Department's Grand Jury Indictment against Abrego Garcia proves the unhinged Democrat Party was wrong, and their stenographers in the Fake News Media were once again played like fools. \"Abrego Garcia was never an innocent 'Maryland Man'- Abrego Garcia is an illegal alien terrorist, gang member, and human trafficker who has spent his entire life abusing innocent people, especially women and the most vulnerable.\""
    },
    {
        "title": "White House officials to meet Chinese delegation in London for next round of trade talks",
        "description": "Senior White House officials will meet with a Chinese delegation in London on Monday for the next round of trade talks, US President Donald Trump has said.",
        "url": "https://news.sky.com/story/white-house-officials-to-meet-chinese-delegation-in-london-for-next-round-of-trade-talks-13380245",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-06 19:05:00",
        "Headline": "This follows a \"very good\" hour-and-a-half phone call between Donald Trump and Xi Jinping on Thursday - amid the US and China's ongoing trade war.",
        "Content": "Senior White House officials will meet with a Chinese delegation in London on Monday for the next round of trade talks, US President Donald Trump has said. The meeting comes after a phone call between Mr Trump and Chinese leader Xi Jinping on Thursday, which the US president said was \"very positive\" - lasting about an hour and a half.Speaking to reporters on Friday from Air Force One, the president added that it was a \"good talk\", describing the deal as \"complicated\", but one that \"will bring us a lot of money\". He also said: \"I get along well with Xi and China.\"  Writing on his Truth Social platform, Mr Trump said the upcoming London meeting \"should go very well\" and added that treasury secretary Scott Bessent, commerce secretary Howard Lutnick and trade representative Jamieson Greer would represent the US at the talks. It is unclear who will represent China. The two countries are at an impasse over tariffs and a dispute involving critical rare earth mineral exports, in which China remains the dominant producer. On 12 May, China and the US struck a 90-day deal in Geneva to pause retaliatory tariffs placed on each other since Mr Trump was inaugurated in January. \n                  British man charged over plot to smuggle US military technology to China\n                 \n                  Trump's sweeping tariffs blocked: What happens now?\n                 \n                  Former spy chief on Gaza, China, and cyber warfare\n                 The US president said the move was part of a \"total reset\" in relations. The agreement prompted a global surge in stock markets and US indexes that were in, or approaching, bear market levels.  The temporary deal saw the US reduce its 145% tariff to 30% on Chinese goods. China also agreed to reduce its 125% retaliatory tariffs to 10% on US goods. However, sector-specific tariffs, such as the 25% tax on cars, aluminium and steel, are still in place. Read more from Sky News:Trump says Musk has 'lost his mind'Beckham to be knighted in King's Birthday Honours listMan wrongly deported from US to El Salvador returns to face criminal charges 👉 Follow Trump 100 on your podcast app 👈 The Chinese foreign ministry said the US president initiated the call, and they had asked him to \"remove the negative measures\" in place against China. It also said that Mr Trump said \"the US loves to have Chinese students coming to study in America\". This is despite his administration previously saying it will \"aggressively\" revoke the visas of Chinese students studying in the US. Since Mr Trump's re-election, the president has frequently issued threats of punitive trade measures against US partners, only to backtrack at the last minute."
    },
    {
        "title": "More than 40 'narco-boat' drug smugglers arrested in major police sting",
        "description": "More than 40 people have been arrested after a major drugs raid busted a \"narco-boats\" gang accused of trafficking cocaine into the EU.",
        "url": "https://news.sky.com/story/more-than-40-narco-boat-drug-smugglers-arrested-in-major-police-sting-13380253",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-cocaine-spain_6936137.png?20250606204656",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-06 19:35:00",
        "Headline": "The gang used \"mother ships\" to transport cocaine from South America to the Canary Islands, with 11 speedboats used to ferry the drugs to shore.",
        "Content": "More than 40 people have been arrested after a major drugs raid busted a \"narco-boats\" gang accused of trafficking cocaine into the EU. The investigation, dubbed Operation Black Shadow, saw police forces from around the world work together to seize nearly 3,800 kilos of cocaine, 69 vehicles and €100,000 (£84,232) in cash. A British national was among the 48 arrested during last Tuesday's raids, the National Crime Agency confirmed to Sky News. The gang used \"mother ships\" to transport cocaine from South America to the Canary Islands, with 11 speedboats used to ferry the drugs to shore. They even turned an abandoned shipwreck into a refuelling platform for the speedboats and boats, according to Spain's Policia Nacional. The criminal network used a \"complex encrypted communications system\" to evade police, including the use of satellite terminals, hard-to-trace phones and a coded language. Read more from Sky News:David Beckham to be knightedRetired vicar admits role in 'Eunuch Maker' ring \n                  Paul Danan: Former Hollyoaks actor died by misadventure after taking cocktail of drugs, coroner rules\n                 \n                  The ins and outs of UK cannabis law - and calls to decriminalise it\n                 \n                  Sadiq Khan says some cannabis possession should be decriminalised\n                 Twenty-nine houses were searched in Fuerteventura, Gran Canaria and Lanzarote. \"The criminal network specialised in smuggling large quantities of cocaine from South America into Spanish territory using high-speed boats, said an NCA spokesperson to Sky News. \"Alongside our international partners, we are relentless in our efforts to tackle drug trafficking across borders, ensuring it's seized before it reaches the UK criminal supply chain.\""
    },
    {
        "title": "Gaza marks start of Eid with outdoor prayers in rubble - as Israel warns of intensive new military operations",
        "description": "Israel has issued a fresh warning to civilians in northern Gaza, saying its military is about to carry out intensive operations there.",
        "url": "https://news.sky.com/story/gaza-marks-start-of-eid-with-outdoor-prayers-in-rubble-as-israel-warns-of-intensive-new-military-operations-13380085",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-eid-al-adha-palestinians_6935926.jpg?20250606150748",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-06 12:34:00",
        "Headline": "Much of Gaza lies in ruins, with men and children forced to hold the traditional Eid al Adha prayers in the open air, and as food supplies dwindle.",
        "Content": "Israel has issued a fresh warning to civilians in northern Gaza, saying its military is about to carry out intensive operations there. It comes after Israel said rockets were fired from the area. Palestinians across the war-ravaged Gaza Strip have marked the start of one of Islam's most important holidays, amid little hope the conflict will end any time soon. Much of Gaza lies in ruins, with men and children forced to hold the traditional Eid al Adha prayers in the open air, and as food supplies dwindle.  Food and aid were blocked from entering the Palestinian territory for more than two months, but a trickle of supplies has been allowed in over the last few weeks. The UN said it cannot distribute much of the aid, due to the risk of looters and restrictions on movement. \"This is the worst feast that the Palestinian people have experienced because of the unjust war against the Palestinian people,\" said Kamel Emran after attending prayers in the southern city of Khan Younis. \n                  Bodies of husband and wife taken into Gaza by Hamas recovered after special operation by Israeli forces\n                 \n                  Hundreds of thousands in Gaza 'catastrophically food insecure', says aid chief\n                 \n                  Gaza aid centres to be closed for day - as IDF warns nearby roads will be 'considered combat zones'\n                 \"There is no food, no flour, no shelter, no mosques, no homes, no mattresses... The conditions are very, very harsh.\" The Islamic holiday begins on the 10th day of the Islamic lunar month of Dhul-Hijja, during the Hajj season in Saudi Arabia. It is the second year Muslims in Gaza have been unable to travel to the country to perform the traditional pilgrimage. Read more:Bodies of husband and wife taken into Gaza now recoveredHundreds of thousands 'catastrophically food insecure'  The war broke out after the 7 October 2023 attack on Israel by Hamas-led militants. Some 1,200 people were killed and around 250 others were abducted and taken to Gaza. Hamas is still holding 56 hostages, with a third of them believed to be alive. The rest have been released in ceasefire agreements, with forces rescuing eight living hostages from Gaza and recovering dozens of bodies.  Israel has killed more than 54,000 Palestinians, mostly women and children, in its military campaign, according to the Gaza health ministry, which does not distinguish between civilians or combatants in its figures. Around 90% of the population of two million has been displaced."
    },
    {
        "title": "Minister 'not going to speculate' on alleged UK involvement in Ukrainian drone attack",
        "description": "A government minister has declined to say if the UK was involved in a Ukrainian drone strike after the Russian ambassador partially blamed Britain for the attack.",
        "url": "https://news.sky.com/story/minister-not-going-to-speculate-on-alleged-uk-involvement-in-ukrainian-drone-attack-13379920",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-igor-kozbev-reuters_6932499.jpg?20250601140548",
        "type": "World",
        "Author": "Will Charley",
        "Date Published": "2025-06-06 06:50:00",
        "Headline": "Steve Reed declines to \"speculate\" on whether the UK had aided the strike, but says the country \"wants to stand alongside Ukraine\".",
        "Content": "\n          Political reporter\n              @WillCharley1\n  A government minister has declined to say if the UK was involved in a Ukrainian drone strike after the Russian ambassador partially blamed Britain for the attack. More than a hundred drones were used to attack sites inside Russia over the weekend, leading to more than 40 warplanes being destroyed. Speaking to The World With Yalda Hakim on Sky News following the attack, Russia's UK ambassador warned it could risk escalating the conflict to \"World War III\". Follow live: Russia hits 'almost all of Ukraine' with more than 400 drones and 40 missiles - Zelenskyy  Andrei Kelin pointed the finger at the UK because of the nature of the strike. \"[This] kind of attack involves, of course, provision of very high technology, so-called geospaced data, which only can be done by those who have it in possession. And this is London and Washington,\" he told Hakim. \"I don't believe that America [is involved], that has been denied by President Trump, definitely, but it has not been denied by London. \"We perfectly know how much London is involved, how deeply British forces are involved in working together with Ukraine.\" Asked if the UK had provided Ukraine with this technology, Steve Reed, the environment secretary, told Sky News: \"I'm not going to speculate on something when I don't know what the facts were.\" He said that \"we as a government, cross-party actually, are standing foursquare alongside Ukraine as they fight - try to defend themselves - against a brutal, unprovoked and illegal attack and invasion\". Mr Reed added: \"We want there to be peace talks. We want this conflict to end. But it's quite right that we should support Ukraine.\" Challenged if this escalation could risk Britain getting sucked into the conflict with Russia more directly, the cabinet minister responded: \"I do know that the people of this country and the government of this country, want to stand alongside Ukraine. \"We need peace to happen in that region, we can't allow Russia to get away with invading any more countries.\" It comes at a time of escalating tensions in the region, with both Russia and Ukraine upping their attacks. Ukrainian President Volodymyr Zelensky said his country's drone strikes at the weekend \"will undoubtedly be in history books\".  Sir Ed Davey has said supports the government's actions \"to back President Zelensky\", but said he would like to see them go further. The party leader said on Friday: \"Liberal Democrats would like the government to give even more support to Ukraine. \"We would like to see the Russian assets that have been frozen in the UK confiscated so we have the resources to support Ukraine even more.\" Sir Ed said people in the UK \"want us to be backing Ukraine with finance and with armaments\" and his calls for the government to go further extend to military support, too. Asked if this might put the UK at risk of walking into a wider conflict, Sir Ed dismissed this, saying he doesn't \"believe that risk is there\". \"I think the Russians will no doubt try to threaten in their way that they've done year after year, but they always back down\", he added. Politics latest: Badenoch says UK's asylum system is 'completely broken' The Lib Dem leader said the Russian ambassador's comment did not surprise him and that Russian officials \"just lie every time\". The blow is seen as one of the most daring of the war so far, though the US estimated only around 10 Russian bombers were blown up - and Russia said none were. Overnight, Russia claimed it downed 174 Ukrainian drones and three cruise missiles across the country. 👉Search for The Wargame on your podcast app👈 Meanwhile, Ukrainian authorities said Russia attacked towns and cities across Ukraine overnight. Mr Zelenskyy said the assault was formed of more than 400 drones and 40 missiles.  US President Donald Trump had urged Mr Putin not to retaliate on Thursday. He told reporters: \"I don't like it, I said don't do it, you shouldn't do it, you should stop it.\" In response to the allegations of British involvement, a Downing Street spokesperson said: \"We never comment on operational matters at home or abroad.\""
    },
    {
        "title": "Three alleged Iranian spies appear at Old Bailey",
        "description": "Three Iranian nationals charged with spying offences have appeared in court.&#160;",
        "url": "https://news.sky.com/story/three-alleged-iranian-spies-appear-at-old-bailey-13380160",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-scotland-yard-police_6909814.jpg?20250508105237",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-06 15:04:00",
        "Headline": "The men are alleged to have targeted journalists working for Iran International, an independent media organisation based in London.",
        "Content": "Three Iranian nationals charged with spying offences have appeared in court.  Mostafa Sepahvand, 39, Farhad Javadi Manesh, 44, and Shapoor Qalehali Khani Noori, 55, appeared at the Old Bailey on Friday, charged with offences under the National Security Act. They are alleged to have targeted journalists working for Iran International, an independent media organisation based in London. They are all charged with engaging in conduct likely to assist the Iranian foreign intelligence service between 14 August 2024 and 16 February 2025. They arrived in the UK between 2016 and 2022 by irregular means, including by small boats and a lorry, and appeared in court via video link. They spoke through a Farsi translator to confirm their identities. Sepahvand, of St John's Wood, is also charged with engaging in surveillance, reconnaissance and open-source research, with the intention of committing serious violence against a person in the UK. \n                  Iran has stockpiled near nuclear weapons-grade uranium, UN watchdog finds \n                 \n                  Could a ceasefire deal in Gaza be close?\n                 \n                  Cannes: Dissident Iranian director wins Palme d'Or at film festival\n                 Manesh, of Brent, and Noori, of Ealing, are additionally charged with surveillance and reconnaissance, with the intention that serious violence would be committed by others against a person in the UK. Read more from Sky News:David Beckham to be knightedLottery winner could bag UK's biggest ever prize The plea hearing for the three men will take place on 26 September, and a provisional trial date has been set for 5 October 2026, according to Mrs Justice Cheema-Grubb. The UK government summoned Iran's ambassador after the men were arrested on 3 May, saying Iran \"must be held accountable for its actions\". The men were arrested on the same day as five other Iranian nationals, who were taken into custody as part of an entirely separate investigation. Four of those men remain in custody and were arrested on suspicion of preparing a terrorist act. A fifth, a 24-year-old man in the Manchester area, was released on bail. Last October, MI5 director general Ken McCallum said the UK intelligence agency had responded to 20 \"potentially lethal\" Iran-backed plots since 2022, warning of the risk of an \"increase or broadening of Iranian state aggression in the UK\"."
    },
    {
        "title": "Trump says Musk has 'lost his mind' - as president considering selling his Tesla",
        "description": "Donald Trump has said Elon Musk has \"lost his mind\", according to US media, and has no plans to speak with him.",
        "url": "https://news.sky.com/story/trump-says-musk-has-lost-his-mind-as-president-considering-selling-his-tesla-13380118",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-donald-trump_6872205.jpg?20250606165909",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-06 13:55:00",
        "Headline": "The president is considering selling his Tesla, a source familiar with the situation has told Sky News, in a further sign that no resolution to the explosive bust-up is in sight.",
        "Content": " Donald Trump has said Elon Musk has \"lost his mind\", according to US media, and has no plans to speak with him. In a phone interview with ABC News, the US president was asked about reports that a phone call was scheduled on Friday between Musk and himself. \"You mean the man who has lost his mind?\" he is said to have responded. A White House official said that no phone call was lined up between Mr Trump and his former ally amid a bitter feud between the two. Later on Friday, Mr Trump told reporters aboard Air Force One he had no plans to speak with Musk. It comes as a source familiar with the situation has told Sky News the president is considering selling his Tesla, in a further sign that no resolution to the explosive bust-up is in sight. Mr Trump purchased a Tesla earlier this year, describing the company as Elon's \"baby\".  👉 Follow Trump100 on your podcast app 👈 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 \n                  In a dangerous world, the explosive Trump-Musk bust-up is more terrifying than titillating\n                 \n                  Trade war: US hiring slows but employment resilient\n                 The pair's relationship broke down publicly on Thursday, just days after Tesla and SpaceX CEO Musk left his role as a special government employee. In a fiery exchange, Musk posted a series of messages on X criticising the president's signature tax bill as a \"big ugly spending bill\". President Trump posted on Truth Social that Musk had been \"wearing thin\" and claimed he \"asked him to leave\" his government position, something Musk denied. Elon Musk then hit back, alleging the president \"is in the Epstein files. That is the real reason they have not been made public.\" He gave no evidence for the claim, and it was dismissed by the White House. In a statement, it called the bust-up an \"unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill because it does not include the policies he wanted.\" Read more:Musk says Trump appears in Epstein files as row explodesThe extraordinary spat minute-by-minuteThe big, beautiful bust-up everyone knew was coming  The bill at the centre of the spat was passed by the House Republicans in May and has been described by the president as a \"big, beautiful bill\". The president said to reporters in the White House on Thursday that Musk \"knew the inner workings of the bill better than anybody sitting here\". \"He had no problem with it. All of a sudden, he had a problem and he only developed the problem when he found out we're going to have to cut the EV mandate.\" Musk then denied this, saying: \"False, this bill was never shown to me even once and was passed in the dead of night so fast that almost no one in Congress could even read it!\" The spat hit Tesla shares, which closed down 14.3% on Thursday, losing about $150bn (£111bn) in value. Musk also said SpaceX will begin decommissioning its Dragon spacecraft \"immediately\" after Mr Trump threatened to cancel government contracts with Musk's businesses. Hours after issuing his threat, however, Musk heeded advice from X users telling him to \"cool down\" and posted: \"Ok, we won't decommission Dragon\". The row between two of the most powerful men in America comes a week after Musk left his position in the government, where he spearheaded a controversial cost-cutting department, DOGE - the Department of Government Efficiency."
    },
    {
        "title": "Trump and Musk's extraordinary spat minute-by-minute",
        "description": "They were once the best of friends, but last night that came to an end - and it all unfolded online as people across the world looked on... and retweeted.",
        "url": "https://news.sky.com/story/trump-and-musks-extraordinary-spat-minute-by-minute-13379913",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-elon-musk-donald-trump_6935672.jpg?20250606085706",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-06 06:19:00",
        "Headline": "The row between Elon Musk and Donald Trump escalates as the pair trade insults in a public feud after the SpaceX billionaire criticises the US president's signature tax bill.",
        "Content": " They were once the best of friends, but last night that came to an end - and it all unfolded online as people across the world looked on... and retweeted. Tension between Elon Musk and Donald Trump had been building for several days after the SpaceX billionaire criticised the US president's signature tax bill. While initially it remained cordial, the president suggested his former backer and adviser missed being in government and suffered from \"Trump derangement syndrome\", leading to a sudden and dramatic deterioration in relations between the pair. They have two of the largest platforms in the world, and last night, they turned them on each other. While much of Europe slept through it, here is every insult and barb as it happened... so far. 6.39pm: 'Big ugly spending bill' Musk tells Trump his \"big ugly spending bill\" will make the economic situation worse. Five minutes later he retweets a video in which he says the bill will increase the US's deficit to $2.5 trillion (£1.85 trn). AT 6.48pm he shares a post about the bill's popularity, simply saying: \"Kill bill\".  👉 Follow Trump100 on your podcast app 👈 6.49pm: Trump's 'body double' Earlier in the evening, Musk reshares a series of posts (dating back to 2012) from Trump's X account, including ones saying deficits should not be allowed. He then reshares a post of someone praising him, adding: \"Where is the man who wrote these words? Was he replaced by a body double!?\" He then retweets a meme, making light of Trump's plan, which links to a poll he had run the previous day. 7.23pm: Back to the bill Musk starts tweeting about the \"big ugly spending bill\" again, saying members of Congress didn't even have time to read it before it was passed. He continues to tweet about this for most of the night, including accusing the government of \"spending America into bankruptcy\". 7.30pm: Who is right? Musk retweets a poll that shows 76% of 1.5 million voters think he is right in his spat with the president. 7.37pm: Elon was 'wearing thin' Trump shares a post on his Truth Social site that accuses Musk of going \"crazy\" after the president took away his EV mandate. Musk responds by sharing a number of former interviews, including a video from 2021 where he says the industry does not need EV tax credits. Trump then shares a post in which he writes the \"easiest way to save money in our Budget, Billions and Billions of Dollars, is to terminate Elon's Governmental Subsidies and Contracts\". 8.10pm: The Epstein 'bomb' Arguably the largest moment in their fight - Musk accuses Trump of being in the Epstein files. He gives no evidence for the claim. White House press secretary Karoline Leavitt dismisses the comment. 9.06pm: Musk 'turning against me' Trump says he doesn't mind Musk turning against him, but adds that \"he should have done so months ago\". He then goes on to voice continued support for his bill, calling it \"one of the greatest bills ever presented to Congress\". Read more:The big beautiful bust up that everyone knew was coming 9.09pm: Decommissioning Dragon Following Trump's statement about terminating his contracts, Musk tweets: \"In light of the President's statement about cancellation of my government contracts, @SpaceX will begin decommissioning its Dragon spacecraft immediately.\" Dragon is the only US spacecraft available to deliver crew to and from the International Space Station. Two minutes later he retweets a post calling on Trump to be impeached, adding simply: \"Yes.\" 9.29pm: Trump's tariffs Musk hits out at Trump's tariffs, resharing a tweet from someone who called them \"stupid\". \"The Trump tariffs will cause a recession in the second half of this year,\" he adds. For the rest of the evening, Musk reshares posts from other users, often adding a laughing face emoji, or the occasional comment, including the words: \"If America goes broke, nothing else matters.\" 2.20am: Musk says he won't decommission spacecraft Just after 2am, an account with a few hundred followers tweets Musk: \"This is a shame this back and forth. You are both better than this. Cool off and take a step back for a couple days.\" In response, Musk agrees he won't decommission the Dragon spacecraft."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador has been returned to face criminal charges",
        "description": "A man who was mistakenly deported to El Salvador by the Trump administration has been returned to the US to face criminal charges.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-has-been-returned-to-face-criminal-charges-13380263",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-06 20:04:00",
        "Headline": "Abrego Garcia's lawyer argues the decision to bring charges \"proves what we've known all along\", that American officials \"had the ability to bring him back and just refused to do so\".",
        "Content": "A man who was mistakenly deported to El Salvador by the Trump administration has been returned to the US to face criminal charges. Kilmar Abrego Garcia was charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US, attorney general Pam Bondi said on Friday. Court records have shown the indictment was filed on 21 May, more than two months after he was deported from the US under a controversial 18th-century wartime law. Appearing in a court on Friday in Nashville, Tennessee, Abrego Garcia was asked if he understood the charges. He told the judge: \"Sí. Lo entiendo.\" An interpreter then said: \"Yes. I understand.\" He will be held in custody until at least next Friday, when there will be an arraignment and detention hearing, the judge ruled. Abrego Garcia's lawyers have called the charges \"preposterous\". \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  Trump and Musk's extraordinary spat minute-by-minute\n                 \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 One of his lawyers, Andrew Rossman, said it would now be up to the US judicial system to ensure he received due process. \"Today's action proves what we've known all along - that the administration had the ability to bring him back and just refused to do so,\" he said. Salvadoran Abrego Garcia, 29, was deported from Maryland despite an immigration judge's 2019 order granting him protection after finding he was likely to be persecuted by local gangs if he was returned to his native country. The indictment alleges Abrego Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. On Friday, Ms Bondi outlined the charges at a news conference, saying: \"The grand jury found that over the past nine years, Abrego Garcia has played a significant role in an alien smuggling ring. \"He made over 100 trips, the grand jury found - smuggling people throughout our country... MS-13 [international criminal gang] members, violent gang terrorist organisation members... throughout our country. \"He will be prosecuted in our country, sentenced in our country if convicted and then returned after completion of his sentence.\" Ms Bondi said Salvadoran President Nayib Bukele agreed to return Abrego Garcia to the US after American officials presented his government with an arrest warrant. Read more from Sky News:Trump says Musk has 'lost his mind'Israel warns of new Gaza operation Democrat senator Chris Van Hollen travelled to El Salvador in April to meet Abrego Garcia, arguing his constitutional rights to due process were being ignored. Critics of Donald Trump have pointed to the deportation of Abrego Garcia as an example of the excesses of the Republican president's aggressive immigration policies. US district judge Paula Xinis has opened a probe into what, if anything, Mr Trump's administration has done to secure his return, after his lawyers accused officials of stonewalling their requests for information. Officials responded by alleging that Abrego Garcia was a member of the MS-13 gang - something his lawyers have strongly denied. In a separate statement, Ms Bondi also attacked what she called the \"Fake News Media\" and repeated the - yet unproven - allegations against Abrego Garcia. \"The Justice Department's Grand Jury Indictment against Abrego Garcia proves the unhinged Democrat Party was wrong, and their stenographers in the Fake News Media were once again played like fools. \"Abrego Garcia was never an innocent 'Maryland Man'- Abrego Garcia is an illegal alien terrorist, gang member, and human trafficker who has spent his entire life abusing innocent people, especially women and the most vulnerable.\""
    },
    {
        "title": "White House officials to meet Chinese delegation in London for next round of trade talks",
        "description": "Senior White House officials will meet with a Chinese delegation in London on Monday for the next round of trade talks, US President Donald Trump has said.",
        "url": "https://news.sky.com/story/white-house-officials-to-meet-chinese-delegation-in-london-for-next-round-of-trade-talks-13380245",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-06 19:05:00",
        "Headline": "This follows a \"very good\" hour-and-a-half phone call between Donald Trump and Xi Jinping on Thursday - amid the US and China's ongoing trade war.",
        "Content": "Senior White House officials will meet with a Chinese delegation in London on Monday for the next round of trade talks, US President Donald Trump has said. The meeting comes after a phone call between Mr Trump and Chinese leader Xi Jinping on Thursday, which the US president said was \"very positive\" - lasting about an hour and a half.Speaking to reporters on Friday from Air Force One, the president added that it was a \"good talk\", describing the deal as \"complicated\", but one that \"will bring us a lot of money\". He also said: \"I get along well with Xi and China.\"  Writing on his Truth Social platform, Mr Trump said the upcoming London meeting \"should go very well\" and added that treasury secretary Scott Bessent, commerce secretary Howard Lutnick and trade representative Jamieson Greer would represent the US at the talks. It is unclear who will represent China. The two countries are at an impasse over tariffs and a dispute involving critical rare earth mineral exports, in which China remains the dominant producer. On 12 May, China and the US struck a 90-day deal in Geneva to pause retaliatory tariffs placed on each other since Mr Trump was inaugurated in January. \n                  British man charged over plot to smuggle US military technology to China\n                 \n                  Trump's sweeping tariffs blocked: What happens now?\n                 \n                  Former spy chief on Gaza, China, and cyber warfare\n                 The US president said the move was part of a \"total reset\" in relations. The agreement prompted a global surge in stock markets and US indexes that were in, or approaching, bear market levels.  The temporary deal saw the US reduce its 145% tariff to 30% on Chinese goods. China also agreed to reduce its 125% retaliatory tariffs to 10% on US goods. However, sector-specific tariffs, such as the 25% tax on cars, aluminium and steel, are still in place. Read more from Sky News:Trump says Musk has 'lost his mind'Beckham to be knighted in King's Birthday Honours listMan wrongly deported from US to El Salvador returns to face criminal charges 👉 Follow Trump 100 on your podcast app 👈 The Chinese foreign ministry said the US president initiated the call, and they had asked him to \"remove the negative measures\" in place against China. It also said that Mr Trump said \"the US loves to have Chinese students coming to study in America\". This is despite his administration previously saying it will \"aggressively\" revoke the visas of Chinese students studying in the US. Since Mr Trump's re-election, the president has frequently issued threats of punitive trade measures against US partners, only to backtrack at the last minute."
    },
    {
        "title": "Trade war: US hiring slows but employment resilient",
        "description": "The US economy saw a slowdown in hiring but no leap in unemployment last month as the impact of Donald Trump's trade war continues to play out.  ",
        "url": "https://news.sky.com/story/trade-war-us-hiring-slows-but-employment-resilient-13380054",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-president_6930903.jpg?20250530072136",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-06-06 11:27:00",
        "Headline": "Stock markets and the dollar rise as the latest official figures do nothing to ramp up fears that the world's largest economy is staring down the barrel of recession.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The US economy saw a slowdown in hiring but no leap in unemployment last month as the impact of Donald Trump's trade war continues to play out.   Official data, which strips out the effects of seasonal workers, showed 139,000 net new jobs were created during May. Market analysts and economists had expected a figure of 130,000 - down on the 147,000 for April. The unemployment rate remained at 4.2% and hourly pay rates rose. Money latest: House price dip expected to be temporary The figures were released as the health of the US economy continues to attract close scrutiny amid ongoing fears of a recession risk in the world's largest economy due to the effects of the US president's trade war. Unlike most developed economies, such a downturn is not determined by two consecutive quarters of negative growth, but by a committee of respected economists. \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  In a dangerous world, the explosive Trump-Musk bust-up is more terrifying than titillating\n                  It's known as the Business Cycle Dating Committee. It uses employment data, as well as official growth figures, to rule on the status of the economy. The threat of tariffs, and early salvoes of, the Trump administration's protectionist agenda were blamed for a sharp slowdown in growth over the first three months of the year.  Economists have found it hard to predict official data due to the on-off, and often chaotic, nature of tariff implementation. As such, all official figures are keenly awaited for news of the trade war's impact on the domestic economy. Other data this week showed a record 20% plunge in US imports during April. Next week sees the release of inflation figures - the best measure of whether import duty price increases are working their way through the supply chain and harming the spending power of businesses and consumers. It's a key piece of information for the US central bank. It has paused interest rate cuts, to the fury of the president, over trade war uncertainty. Read more: What a weakening dollar means for Trump - and the UKThe big problem facing the UK as US trade deal deadline looms A forecast by the Paris-based OECD this week highlighted the chance of consumer price inflation rising above 4% later in the year. It currently stands at an annual rate of 2.3%. Fears of a US recession and trade war uncertainty have combined most recently with increasing market concerns about the sustainability of US debt, given Mr Trump's tax cut and spending plans. US stock markets are largely flat on the year while the dollar index, which measures the greenback against six other major currencies, is down 9% this year and on course for its worst annual performance since 2017. European stocks entered positive territory in a small nod to the employment data, while US futures showed a similar trend. The dollar rose slightly. The reaction was likely muted because the data was well within expectations and seen as positive. Commenting on the figures Nicholas Hyett, investment manager at Wealth Club, said: \"The US labour market has shrugged off the tariff uncertainty that rocked global stock and bond markets in April and May. \"While the Federal government has continued to shed a small number of jobs, the wider economy has more than made up the difference, with the US adding slightly more jobs than expected in May. Wage growth also came in higher than expected - suggesting the economy is in rude health. \"That will be taken as vindication by the Trump administration - which has been clear that the tariffs are aimed squarely at supporting Main Street rather than pleasing Wall Street. \"Less positive from the White House's point of view is that a strong economy and rising wages gives the Federal Reserve less reason to cut interest rates - pushing yields a touch higher and making the fiscal splurge built into Trump's \"Big Beautiful Bill\" that bit more expensive. \"With rate cuts looking less likely, Fed Chair Jay Powell can expect to remain firmly in the president's firing line once the spat with Musk is over.\""
    },
    {
        "title": "Trade war: US hiring slows but employment resilient",
        "description": "The US economy saw a slowdown in hiring but no leap in unemployment last month as the impact of Donald Trump's trade war continues to play out.  ",
        "url": "https://news.sky.com/story/trade-war-us-hiring-slows-but-employment-resilient-13380054",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-president_6930903.jpg?20250530072136",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-06 11:27:00",
        "Headline": "Stock markets and the dollar rise as the latest official figures do nothing to ramp up fears that the world's largest economy is staring down the barrel of recession.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The US economy saw a slowdown in hiring but no leap in unemployment last month as the impact of Donald Trump's trade war continues to play out.   Official data, which strips out the effects of seasonal workers, showed 139,000 net new jobs were created during May. Market analysts and economists had expected a figure of 130,000 - down on the 147,000 for April. The unemployment rate remained at 4.2% and hourly pay rates rose. Money latest: House price dip expected to be temporary The figures were released as the health of the US economy continues to attract close scrutiny amid ongoing fears of a recession risk in the world's largest economy due to the effects of the US president's trade war. Unlike most developed economies, such a downturn is not determined by two consecutive quarters of negative growth, but by a committee of respected economists. \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  In a dangerous world, the explosive Trump-Musk bust-up is more terrifying than titillating\n                  It's known as the Business Cycle Dating Committee. It uses employment data, as well as official growth figures, to rule on the status of the economy. The threat of tariffs, and early salvoes of, the Trump administration's protectionist agenda were blamed for a sharp slowdown in growth over the first three months of the year.  Economists have found it hard to predict official data due to the on-off, and often chaotic, nature of tariff implementation. As such, all official figures are keenly awaited for news of the trade war's impact on the domestic economy. Other data this week showed a record 20% plunge in US imports during April. Next week sees the release of inflation figures - the best measure of whether import duty price increases are working their way through the supply chain and harming the spending power of businesses and consumers. It's a key piece of information for the US central bank. It has paused interest rate cuts, to the fury of the president, over trade war uncertainty. Read more: What a weakening dollar means for Trump - and the UKThe big problem facing the UK as US trade deal deadline looms A forecast by the Paris-based OECD this week highlighted the chance of consumer price inflation rising above 4% later in the year. It currently stands at an annual rate of 2.3%. Fears of a US recession and trade war uncertainty have combined most recently with increasing market concerns about the sustainability of US debt, given Mr Trump's tax cut and spending plans. US stock markets are largely flat on the year while the dollar index, which measures the greenback against six other major currencies, is down 9% this year and on course for its worst annual performance since 2017. European stocks entered positive territory in a small nod to the employment data, while US futures showed a similar trend. The dollar rose slightly. The reaction was likely muted because the data was well within expectations and seen as positive. Commenting on the figures Nicholas Hyett, investment manager at Wealth Club, said: \"The US labour market has shrugged off the tariff uncertainty that rocked global stock and bond markets in April and May. \"While the Federal government has continued to shed a small number of jobs, the wider economy has more than made up the difference, with the US adding slightly more jobs than expected in May. Wage growth also came in higher than expected - suggesting the economy is in rude health. \"That will be taken as vindication by the Trump administration - which has been clear that the tariffs are aimed squarely at supporting Main Street rather than pleasing Wall Street. \"Less positive from the White House's point of view is that a strong economy and rising wages gives the Federal Reserve less reason to cut interest rates - pushing yields a touch higher and making the fiscal splurge built into Trump's \"Big Beautiful Bill\" that bit more expensive. \"With rate cuts looking less likely, Fed Chair Jay Powell can expect to remain firmly in the president's firing line once the spat with Musk is over.\""
    },
    {
        "title": "In a dangerous world, the explosive Trump-Musk bust-up is more terrifying than titillating",
        "description": "Elon Musk posted in February that he loved his president, patron and personal friend, \"as much as a straight man can love another man.\"",
        "url": "https://news.sky.com/story/in-a-dangerous-world-the-explosive-trump-musk-bust-up-is-more-terrifying-than-titillating-13380062",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-donald-trump-elon-musk_6780448.jpg?20241219131241",
        "type": "Business",
        "Author": "Tom Clarke",
        "Date Published": "2025-06-06 11:48:00",
        "Headline": "Elon Musk and Donald Trump's hysterical tit-for-tat on social media might be the stuff of Hollywood tabloids, but its dangers extend far beyond the men themselves.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Elon Musk posted in February that he loved his president, patron and personal friend, \"as much as a straight man can love another man.\" And they had so much in common: colossal egos; mercurial political views; compulsive social media habits. Yet, it was clear to almost all but the most hopeless MAGA romantics that this rocket-fuelled megastar bromance was doomed to fail. But who would have predicted an end this spectacular - their relationship undergoing a \"rapid unscheduled disassembly\" to rival the most explosive of Mr Musk's test rockets.  Their hysterical tit-for-tat on social media might be the stuff of Hollywood tabloids, but its consequences could be grave. The break-up has already had a major impact on Mr Musk's wealth, with Tesla shares sliding 15% on the news. But Mr Musk's social media platform and $250m of political donations played no small part in getting Mr Trump and his supporters into the White House. \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  Trade war: US hiring slows but employment resilient\n                 If that money and influence were to turn against them, it could see them out. And in terms of strategic significance, Elon Musk's SpaceX is no ordinary company. In 2024, it averaged a rocket launch every three days, accounting for nearly 90% of the US orbital launch market and took more cargo into space last year than the rest of the world combined. Read more:Musk says Trump appears in Epstein files as row explodesThe extraordinary spat minute-by-minuteThe big, beautiful bust-up everyone knew was coming Elon Musk already appears to have backed down on his threat to decommission the SpaceX Crew Dragon that ferries astronauts to the International Space Station. Doing so would have risked the lives of the crew on board, leaving the US and its international partners reliant on Russian hardware to take them in and out of orbit.  Nor is it likely Mr Trump would, or even could, take down a company as necessary to US interests as SpaceX. Although the souring of relations will be good news for his up-and-coming rivals like Amazon founder Jeff Bezos's Blue Origin launch company. SpaceX is heavily reliant on government contracts from NASA and the US military. But it could be years before a competitor can rival its near-monopoly on space launches. The two men could, of course, patch things up. It wouldn't be the first time either has said outrageous things on social media that they later shrugged off. But in one way, the damage has already been done. The world has witnessed two of its most powerful people row like teenagers with no evidence of the wisdom, restraint or cool-headedness most would expect of reliable businessmen and heads of state. Given the state of the world right now, what the lurid details of their row says about the two men is more terrifying than titillating."
    },
    {
        "title": "EuroMillions: UK's biggest lottery prize is still up for grabs",
        "description": "There is still the chance for someone to secure the biggest lottery prize the UK has ever seen, after Friday's EuroMillions draw had no winners.",
        "url": "https://news.sky.com/story/euromillions-single-ticket-holder-could-win-uks-biggest-lottery-prize-tonight-13379902",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-06 05:33:00",
        "Headline": "There were no winners from Friday's draw, meaning the next chance to become instantly richer than Adele and Dua Lipa will be on Tuesday.",
        "Content": "There is still the chance for someone to secure the biggest lottery prize the UK has ever seen, after Friday's EuroMillions draw had no winners. The jackpot had rolled over to an estimated £208m, after Tuesday's £199m draw - which also would have been a record-breaking amount - had no winners. The winner would instantly become richer than Adele and Harry Styles, while also bagging the top spot on the National Lottery's biggest wins list. Housing raffles take UK by storm - how likely are you to win? Andy Carter, senior winners' adviser at Allwyn, said: \"The EuroMillions jackpot is now capped, so any money that would have gone into increasing the jackpot now boosts prizes in the next winning prize tier. \"We could see multiple UK players banking huge prizes for matching just the five main numbers and one Lucky Star.\" The previous largest prize pot was won by an anonymous UK ticket-holder, who took home £195m on 19 July 2022. Read more from Sky News:Musk and Trump row escalatesBeyonce rides into London Just two months earlier, Joe and Jess Thwaite, from Gloucester, won £184,262,899 with a Lucky Dip ticket. At the time, Joe was a communications sales engineer, and Jess ran a hairdressing salon with her sister. Mr Thwaite said he woke up at 5am as usual, and checked his phone to see an email saying, \"Good news, you have won a prize\". But he did not immediately wake his wife, choosing to let her sleep in. \"I saw how much and I didn't know what to do,\" Mr Thwaite said. \"I couldn't go back to sleep, I didn't want to wake Jess up, so I just laid there for what seemed like forever. I spent some time searching for property with no budget limit, which was a novelty!\" When his wife woke up, she assumed the National Lottery app was wrong. Read more:$2bn lottery winner sued by man who claims ticket was stolenMan celebrates £5.2m win with surprising first purchaseTrainee gas engineer, 20, wins £7.5m - but won't quit work  In February last year, Richard and Debbie Nuttall were revealed as the UK winners of a £61m EuroMillions jackpot - who at first thought they had only won £2.60. The couple from Lancashire split the £123m prize with a winner in Spain. This year's biggest prize, of £83m went to a UK winner in January."
    },
    {
        "title": "HSBC sounds out ex-McKinsey chief Sneader about chairmanship",
        "description": "A former McKinsey boss is among the candidates being considered to replace Sir Mark Tucker as the chairman of HSBC Holdings.",
        "url": "https://news.sky.com/story/hsbc-sounds-out-ex-mckinsey-chief-sneader-about-chairmanship-13379940",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-hsbc-bank_6572362.jpg?20240603161518",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-06 07:59:00",
        "Headline": "Scottish-born Kevin Sneader, who was voted out of the global consulting firm's top job in 2021, has been approached about replacing Sir Mark Tucker at HSBC Holdings, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A former McKinsey boss is among the candidates being considered to replace Sir Mark Tucker as the chairman of HSBC Holdings. Sky News has learnt that Kevin Sneader, who was voted out of the global consulting firm in 2021 following a string of crises, has been approached about the top job at the London-headquartered bank. City sources said Mr Sneader was one of a number of people being considered by the board nomination committee assembled by HSBC. Money latest: Tesla takes $150bn hit as Musk-Trump row explodes The identities of the other contenders was unclear on Friday. Scottish-born Mr Sneader left McKinsey after it agreed to pay $600m to 49 US states for its role in advising opioid manufacturers. Since then, he has taken a senior role at Goldman Sachs, where he now serves as president of Asia-Pacific, excluding Japan. \n                  Trade war: US hiring slows but employment resilient\n                 \n                  Money blog: Greggs trialling new sandwich - but only in 20 stores\n                 \n                  Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes\n                 He is also a member of the partner ranks of the Wall Street bank. One insider suggested the circumstances of Mr Sneader's exit from McKinsey, as well as the fact he has little experience running or chairing London-listed businesses, could weigh against him as HSBC deliberates over the choice of Sir Mark's successor. On Friday, HSBC said Sir Mark would leave in September, after which he would return to chair AIA, the Hong Kong-based insurance company he previously ran. In the interim, Brendan Nelson, would take over as chair, with senior independent director Ann Godbehere leading the process to find a permanent replacement. As a financial behemoth with deep ties to both China and the US, HSBC is deeply exposed to escalating trade and diplomatic tensions between the two countries. When he was appointed in 2017, Sir Mark became the first outsider to take the post in the bank's 152-year history - and which has a big presence on the high street thanks to its acquisition of the Midland Bank in 1992. He oversaw a rapid change of leadership, appointing bank veteran John Flint to replace Stuart Gulliver as chief executive. The transition did not work out positively, however, with Sir Mark deciding to sack Mr Flint after just 18 months. He was replaced on an interim basis by Noel Quinn in the summer of 2018, with that change becoming permanent in April 2020. Mr Quinn spent a further four years in the post before deciding to step down, and in July he was succeeded by Georges Elhedery, a long-serving executive in HSBC's markets unit and more recently the bank's chief financial officer. The new chief's first big move in the top job was to unveil a sweeping reorganisation of HSBC - that sees it reshaped into eastern markets and western markets businesses. He also decided to merge its commercial and investment banking operations into a single division. The restructuring, which Mr Elhedery said would \"result in a simpler, more dynamic, and agile organisation\" has nevertheless drawn a mixed reaction from analysts. HSBC did not respond to a request for comment."
    },
    {
        "title": "Administrators lined up for UK arm of Microsoft-backed Builder.ai",
        "description": "Administrators are on standby to handle the collapse of the UK arm of Builder.ai, a Microsoft-backed start-up which has filed for bankruptcy protection in the US.",
        "url": "https://news.sky.com/story/administrators-lined-up-for-uk-arm-of-microsoft-backed-builderai-13380080",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-cyber-security-hacker_6125323.jpg?20230418164613",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-06 12:20:00",
        "Headline": "The UK arm of the app-building tech company, which had drawn investment from a Qatari sovereign wealth fund, is lining up Alvarez & Marsal as administrator, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Administrators are on standby to handle the collapse of the UK arm of Builder.ai, a Microsoft-backed start-up which has filed for bankruptcy protection in the US. Sky News has learnt that Alvarez & Marsal (A&M) has been lined up to oversee the insolvency of Builder.ai's UK entities. News of the impending appointment comes days after Builder.ai, which was founded by Sachin Dev Duggal, collapsed in the US. Money latest: House price dip expected to be temporary Mr Duggal stepped down earlier this year. Builder.ai had raised hundreds of millions of dollars from investors, including a Qatari sovereign wealth fund, helping it to achieve a 'unicorn' valuation of more than $1bn. The company said it used artificial intelligence to make the process of building an app \"as easy as ordering pizza\". In recent weeks, however, media outlets including the Financial Times have alleged the company used potentially bogus sales figures to attract investment. Read more from Sky News:US hiring slows but employment resilientBonuses for water bosses banned The newspaper also reported that Mr Duggal had sounded out potential backers to buy the business out of insolvency proceedings. It was unclear on Friday whether any meaningful assets remained within Builder.ai's UK corporate entities. A spokesman for A&M declined to comment."
    },
    {
        "title": "SlimFast owner gets into shape with launch of dieting brand sell-off",
        "description": "The owner of SlimFast has kicked off a sale of the weight loss brand after hiring advisers to orchestrate an auction.",
        "url": "https://news.sky.com/story/slimfast-owner-gets-into-shape-with-launch-of-dieting-brand-sell-off-13380002",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-slimfast-weight-loss_6935726.jpg?20250606110324",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-06 09:53:00",
        "Headline": "Glanbia, the Irish-based company, is working with Houlihan Lokey on the sale of the weight loss business for which it paid $350m in 2018, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of SlimFast has kicked off a sale of the weight loss brand after hiring advisers to orchestrate an auction. Sky News understands that Glanbia, the Irish-based company, is working with bankers at Houlihan Lokey on a process to exit its weight management portfolio. Dubbed Project Lego, a sale would come more than 45 years after SlimFast was founded. Money latest: Tesla takes $150bn hit as Musk-Trump row explodes Glanbia has owned the brand since 2018, when it paid $350m for the business. Announcing the decision to sell SlimFast in February, Mark Garvey, Glanbia's chief financial officer, said: \"We've decided to move on. \"There is a significant change in how weight management is being managed by consumers.\" \n                  Trade war: US hiring slows but employment resilient\n                 \n                  Money blog: Greggs trialling new sandwich - but only in 20 stores\n                 \n                  Musk says Trump appears in Epstein files and $150bn wiped off Tesla's value as row between them explodes\n                 Dieting brands such as SlimFast have been hit hard by the rise of weight loss drugs Wegovy and Ozempic in recent years. Read more:Pregnancy warning for weight loss jabsWhat are the weight loss injections? Sources said that Glanbia's advisers were marketing the SlimFast business based on a pipeline of new product developments and brand positioning. A sale is expected to be finalised later this year, depending upon the price offered by prospective buyers. Glanbia declined to comment."
    },
    {
        "title": "'A policy Labour never liked - but may not be able to scrap'",
        "description": "Labour may announce tweaks to the two-child benefit cap so that it exempts certain families, Harriet Harman has suggested.",
        "url": "https://news.sky.com/story/a-policy-labour-never-liked-but-may-not-be-able-to-scrap-13379606",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-playground-child-benefit_6935661.jpg?20250606082749",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-06 04:00:00",
        "Headline": "The Labour peer says her party may be \"trying to work out\" how to lift the policy, without scrapping it altogether.",
        "Content": "Labour may announce tweaks to the two-child benefit cap so that it exempts certain families, Harriet Harman has suggested. It follows ministers, including the prime minister, repeatedly refusing to rule out whether the government will scrap the policy altogether. The cap means families are restricted so that they only receive benefits for their first two children in most households. It is meant to encourage families not to expand beyond their means and become reliant on welfare. But critics say the cap worsens child poverty by leaving the poorest families with a lack of support. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Sir Keir Starmer avoided answering Kemi Badenoch's questions about whether he is in favour of removing or altering the cap at PMQs on Wednesday. Baroness Harman has suggested the issue is \"not binary\" and that the government might tweak it instead of scrapping it or leaving it as it is. Speaking on the Electoral Dysfunction podcast, Baroness Harman said: \"Labour's never liked this policy. It was a Tory Party policy. \n                  Starmer condemned for telling MP 'she talks rubbish'\n                 \n                  Red Wall MPs should focus on two-child benefit cap rather than winter fuel, Harriet Harman says\n                 \n                  'Shy' Reform voters in Labour areas led to Farage's party winning by-election, Harriet Harman says\n                 \"The question is whether Labour can afford to get rid of it. But actually, it's not binary - 'do Labour keep it or do they scrap it?'\"  Instead, the former deputy Labour leader said ministers may be looking at \"ways they could cut it down\". She continued: \"For example, they could remove the two-child benefit policy for families with disabled children. They could remove the two-child benefit policy for families who are working, or something like that. \"So, it might be that what they're trying to work out is not scrapping it altogether.\" The Labour peer said \"narrowing it down a bit\" might be the policy the government go with, as this would allow them to seem more generous and dedicated to tackling child poverty, while minimising the extra strain on the Treasury. Speaking on the podcast, Sky News' political editor Beth Rigby said she understands that Sir Keir's chief of staff, Morgan McSweeney, is against changing the two-child benefit cap. This is because \"it apparently does poll well, with voters, people, people around the country quite supportive of the policy\", she said. What are the other parties saying on the cap? Kemi Badenoch has ruled out lifting the cap, saying it is \"fair\" and ensures that families receiving welfare make choices within their means. On the other side of the argument, Nigel Farage has called for the cap to be scrapped and has said Reform UK would like to see more people in the UK having larger families. The party leader said lifting the cap would be just one of several measures he would introduce to encourage Britons to have more children. But these suggestions have been roundly criticised by the leaders of both Labour and the Tories for being unfunded policy commitments. Read more from Sky News:Badenoch to launch review into ECHR exit'Farage could become PM - this is how Labour can stop him' On Wednesday, Sir Keir refused to answer questions directly about the spending cap during a visit to a school in Essex. He was in the classroom to drive home the government's expansion of free school meals, which will mean 500,000 children are now eligible for them. He called this a \"statement of intent\" and said he is waiting on his child poverty taskforce, which will report back with recommendations for the government to follow. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Remember, you can also watch us on YouTube!"
    },
    {
        "title": "Minister 'not going to speculate' on alleged UK involvement in Ukrainian drone attack",
        "description": "A government minister has declined to say if the UK was involved in a Ukrainian drone strike after the Russian ambassador partially blamed Britain for the attack.",
        "url": "https://news.sky.com/story/minister-not-going-to-speculate-on-alleged-uk-involvement-in-ukrainian-drone-attack-13379920",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-igor-kozbev-reuters_6932499.jpg?20250601140548",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-06-06 06:50:00",
        "Headline": "Steve Reed declines to \"speculate\" on whether the UK had aided the strike, but says the country \"wants to stand alongside Ukraine\".",
        "Content": "\n          Political reporter\n              @WillCharley1\n  A government minister has declined to say if the UK was involved in a Ukrainian drone strike after the Russian ambassador partially blamed Britain for the attack. More than a hundred drones were used to attack sites inside Russia over the weekend, leading to more than 40 warplanes being destroyed. Speaking to The World With Yalda Hakim on Sky News following the attack, Russia's UK ambassador warned it could risk escalating the conflict to \"World War III\". Follow live: Russia hits 'almost all of Ukraine' with more than 400 drones and 40 missiles - Zelenskyy  Andrei Kelin pointed the finger at the UK because of the nature of the strike. \"[This] kind of attack involves, of course, provision of very high technology, so-called geospaced data, which only can be done by those who have it in possession. And this is London and Washington,\" he told Hakim. \"I don't believe that America [is involved], that has been denied by President Trump, definitely, but it has not been denied by London. \"We perfectly know how much London is involved, how deeply British forces are involved in working together with Ukraine.\" Asked if the UK had provided Ukraine with this technology, Steve Reed, the environment secretary, told Sky News: \"I'm not going to speculate on something when I don't know what the facts were.\" He said that \"we as a government, cross-party actually, are standing foursquare alongside Ukraine as they fight - try to defend themselves - against a brutal, unprovoked and illegal attack and invasion\". Mr Reed added: \"We want there to be peace talks. We want this conflict to end. But it's quite right that we should support Ukraine.\" Challenged if this escalation could risk Britain getting sucked into the conflict with Russia more directly, the cabinet minister responded: \"I do know that the people of this country and the government of this country, want to stand alongside Ukraine. \"We need peace to happen in that region, we can't allow Russia to get away with invading any more countries.\" It comes at a time of escalating tensions in the region, with both Russia and Ukraine upping their attacks. Ukrainian President Volodymyr Zelensky said his country's drone strikes at the weekend \"will undoubtedly be in history books\".  Sir Ed Davey has said supports the government's actions \"to back President Zelensky\", but said he would like to see them go further. The party leader said on Friday: \"Liberal Democrats would like the government to give even more support to Ukraine. \"We would like to see the Russian assets that have been frozen in the UK confiscated so we have the resources to support Ukraine even more.\" Sir Ed said people in the UK \"want us to be backing Ukraine with finance and with armaments\" and his calls for the government to go further extend to military support, too. Asked if this might put the UK at risk of walking into a wider conflict, Sir Ed dismissed this, saying he doesn't \"believe that risk is there\". \"I think the Russians will no doubt try to threaten in their way that they've done year after year, but they always back down\", he added. Politics latest: Badenoch says UK's asylum system is 'completely broken' The Lib Dem leader said the Russian ambassador's comment did not surprise him and that Russian officials \"just lie every time\". The blow is seen as one of the most daring of the war so far, though the US estimated only around 10 Russian bombers were blown up - and Russia said none were. Overnight, Russia claimed it downed 174 Ukrainian drones and three cruise missiles across the country. 👉Search for The Wargame on your podcast app👈 Meanwhile, Ukrainian authorities said Russia attacked towns and cities across Ukraine overnight. Mr Zelenskyy said the assault was formed of more than 400 drones and 40 missiles.  US President Donald Trump had urged Mr Putin not to retaliate on Thursday. He told reporters: \"I don't like it, I said don't do it, you shouldn't do it, you should stop it.\" In response to the allegations of British involvement, a Downing Street spokesperson said: \"We never comment on operational matters at home or abroad.\""
    },
    {
        "title": "Starmer will be breathing a sigh of relief after clinching shock victory over SNP and Reform UK",
        "description": "Anything other than a win for Labour would have been a humiliation in this contest.",
        "url": "https://news.sky.com/story/starmer-will-be-breathing-a-sigh-of-relief-to-clinch-shock-victory-over-snp-and-reform-uk-13379880",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-scottish-labour-jackie-baillie_6935576.jpg?20250606022344",
        "type": "Politics",
        "Author": "Connor Gillies",
        "Date Published": "2025-06-06 03:11:00",
        "Headline": "Labour are power hungry and have, for a long time, set their sights on forming the next Scottish government.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  Anything other than a win for Labour would have been a humiliation in this contest. It wasn't any old local by-election - this was a contest where Labour knew it could act as a mini barometer of Sir Keir Starmer's recent U-turn on winter fuel payments and become a test of how popular the politics of Nigel Farage are in Scotland. Labour are power hungry and have, for a long time, set their sights on forming the next Scottish government. The prime minister will this morning be breathing a sigh of relief after clinching this shock victory over the SNP and Reform UK.  This contest on the outskirts of Glasgow came at a time where Labour had been firefighting and grappling with polling suggesting they had blown their chances of ousting the SNP from power in Edinburgh after almost 20 years. The SNP had a spring in their step during this campaign after a chaotic couple of years. First Minister and SNP leader John Swinney had apparently stemmed the bleeding after the infamous police fraud investigation, endless fallout over gender identity reforms, and last year's general election where they were almost wiped out. \n                  Body found in wooded area in search for missing teenager Cole Cooper\n                 \n                  Scottish Labour win by-election in Hamilton, Larkhall and Stonehouse as SNP suffer shock defeat\n                 \n                  Hamilton, Larkhall and Stonehouse by-election: Polls close and count begins to replace late MSP\n                 This result leaves them no further forward than 12 months ago with questions over the party's strategy. Read more from Sky News:Scottish Labour win by-election as SNP suffer shock defeat'Farage could become PM - this is how Labour can stop him' Reform UK is very much in the Scottish picture now, finishing a few hundred votes behind the nationalists. This is a party led by a man who barely registered any support north of the border for many years. A remarkable transformation. The surge in support has spooked many because they know fine well Nigel Farage is only just getting started. One poll had Reform UK forming the next official opposition at Holyrood. After tonight, that might be a tall order but Mr Farage is shaking things up at the expense of the Conservatives. The unpredictable nature of this contest may give us a taste of what is to come."
    },
    {
        "title": "'A policy Labour never liked - but may not be able to scrap'",
        "description": "Labour may announce tweaks to the two-child benefit cap so that it exempts certain families, Harriet Harman has suggested.",
        "url": "https://news.sky.com/story/a-policy-labour-never-liked-but-may-not-be-able-to-scrap-13379606",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-playground-child-benefit_6935661.jpg?20250606082749",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-06 04:00:00",
        "Headline": "The Labour peer says her party may be \"trying to work out\" how to lift the policy, without scrapping it altogether.",
        "Content": "Labour may announce tweaks to the two-child benefit cap so that it exempts certain families, Harriet Harman has suggested. It follows ministers, including the prime minister, repeatedly refusing to rule out whether the government will scrap the policy altogether. The cap means families are restricted so that they only receive benefits for their first two children in most households. It is meant to encourage families not to expand beyond their means and become reliant on welfare. But critics say the cap worsens child poverty by leaving the poorest families with a lack of support. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Sir Keir Starmer avoided answering Kemi Badenoch's questions about whether he is in favour of removing or altering the cap at PMQs on Wednesday. Baroness Harman has suggested the issue is \"not binary\" and that the government might tweak it instead of scrapping it or leaving it as it is. Speaking on the Electoral Dysfunction podcast, Baroness Harman said: \"Labour's never liked this policy. It was a Tory Party policy. \n                  Starmer condemned for telling MP 'she talks rubbish'\n                 \n                  Red Wall MPs should focus on two-child benefit cap rather than winter fuel, Harriet Harman says\n                 \n                  'Shy' Reform voters in Labour areas led to Farage's party winning by-election, Harriet Harman says\n                 \"The question is whether Labour can afford to get rid of it. But actually, it's not binary - 'do Labour keep it or do they scrap it?'\"  Instead, the former deputy Labour leader said ministers may be looking at \"ways they could cut it down\". She continued: \"For example, they could remove the two-child benefit policy for families with disabled children. They could remove the two-child benefit policy for families who are working, or something like that. \"So, it might be that what they're trying to work out is not scrapping it altogether.\" The Labour peer said \"narrowing it down a bit\" might be the policy the government go with, as this would allow them to seem more generous and dedicated to tackling child poverty, while minimising the extra strain on the Treasury. Speaking on the podcast, Sky News' political editor Beth Rigby said she understands that Sir Keir's chief of staff, Morgan McSweeney, is against changing the two-child benefit cap. This is because \"it apparently does poll well, with voters, people, people around the country quite supportive of the policy\", she said. What are the other parties saying on the cap? Kemi Badenoch has ruled out lifting the cap, saying it is \"fair\" and ensures that families receiving welfare make choices within their means. On the other side of the argument, Nigel Farage has called for the cap to be scrapped and has said Reform UK would like to see more people in the UK having larger families. The party leader said lifting the cap would be just one of several measures he would introduce to encourage Britons to have more children. But these suggestions have been roundly criticised by the leaders of both Labour and the Tories for being unfunded policy commitments. Read more from Sky News:Badenoch to launch review into ECHR exit'Farage could become PM - this is how Labour can stop him' On Wednesday, Sir Keir refused to answer questions directly about the spending cap during a visit to a school in Essex. He was in the classroom to drive home the government's expansion of free school meals, which will mean 500,000 children are now eligible for them. He called this a \"statement of intent\" and said he is waiting on his child poverty taskforce, which will report back with recommendations for the government to follow. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Remember, you can also watch us on YouTube!"
    },
    {
        "title": "Arrests of illegal migrant workers increase by 51% in year since Labour elected",
        "description": "Arrests of migrants working illegally in the UK have increased by 51% in the year since the general election, after the government targeted restaurants, nail bars, and construction sites. ",
        "url": "https://news.sky.com/story/arrests-of-illegal-migrant-workers-increase-by-51-in-year-since-labour-elected-13380090",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-east-london-london_6935905.jpg?20250606143838",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-06 23:01:00",
        "Headline": "From 5 July 2024 - the day after Labour won the election - to 31 May 2025, 6,410 people have been arrested on suspicion of working illegally in the UK, according to Home Office figures.",
        "Content": "Arrests of migrants working illegally in the UK have increased by 51% in the year since the general election, after the government targeted restaurants, nail bars, and construction sites.  From 5 July 2024 - the day after Labour won the election - to 31 May 2025, 6,410 people have been arrested on suspicion of working illegally, according to Home Office figures. This is a rise of 51% on the previous year when the Conservatives were in government, the department says. As part of Labour's Plan for Change, enforcement officials have made 9,000 visits to restaurants, nail bars, and construction sites, among other premises, to root out those suspected of working without a visa - a 48% increase in activity during the previous year. Video footage shows the moment 36 people were arrested at a construction site in Belfast's Titanic Quarter where enforcement officials uncovered people breaching their visa conditions and working in the UK having entered the country illegally. In Surrey last month, nine people were arrested at a caravan park after intelligence revealed it was being used for illegal delivery drivers. In Bradford in March, a further nine people were arrested after officers identified a popular pick-up spot for illegal workers. Read more from Sky NewsCancer patients missing holidaysWater bosses' bonuses bannedPrisoners to be moved to lower security jails People traffickers often trick migrants into deadly small boat crossings by promising they will be able to find work in the UK, when in reality, those arrive safely are instead forced into squalid conditions, for no or little money. Employers are supposed to carry out right-to-work checks on all new employees who come from abroad - with those who fail to do so facing £60,000 fines per worker, director disqualifications, and prison sentences of up to five years. 30,000 returned to home countries Alongside the arrests, since Labour came to power, almost 30,000 people who had no right to be in the UK have been returned to their home countries, according to Home Office data. The government says it is also introducing tougher laws, extending right-to-work checks, and targeting particular sectors known to be linked to illegal workers. Dame Angela Eagle, minister for border security and asylum, said: \"For too long, employers have been able to take on and exploit migrants, with people allowed to arrive and work here illegally. \"This will no longer be tolerated on our watch. That's why we are ramping up our enforcement activity and introducing tougher laws to finally get a grip of our immigration and asylum system.\" Eddy Montgomery, director of enforcement, compliance and crime for immigration enforcement, added: \"Our work to tackle illegal working is vital in not only bringing the guilty to account, but also in protecting vulnerable people from exploitation. \"I'm incredibly proud of our enforcement teams across the country for their hard work, skill and cooperation on these often challenging but highly important operations.\""
    },
    {
        "title": "Millions to receive NHS screening invitations and appointment reminders on their phones",
        "description": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones.",
        "url": "https://news.sky.com/story/millions-to-receive-nhs-screening-invitations-and-appointment-reminders-on-their-phones-13380109",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nhs-app-on-phone-department-of-health_6936208.jpg?20250607003247",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-06 13:30:00",
        "Headline": "It's part of efforts to bring the NHS out of the \"analogue age\" and into a digital one, with physical NHS letters being scrapped.",
        "Content": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones. The government says moving to a more digital-focused NHS will mean 50 million fewer letters need to be sent out by the health service, saving an estimated £200m over the next three years. Instead, under the new plans, millions of people will be notified about appointments and other important notices via the NHS app on their phone or digital device. The app is set to become the go-to method for the NHS to communicate with people, the Department of Health and Social Care said. The changes will be backed by more than £50m investment. It will see a predicted 270 million messages sent through the app this year, an increase of around 70 million on the last financial year, the government announced. Wes Streeting has said this is all about modernising, as the NHS \"feels so 20th century\". The health secretary said: \"The fact that people still get letters through the front door, sometimes multiple letters about the same appointment... The NHS has been stuck in the mud when it comes to the everyday technology we use to organise our lives. And that's why what we're doing with the NHS app is really exciting.\" \n                  The NHS winter crisis is a recurring seasonal theme – tackling it will bring challenges\n                 \n                  Labour vows to tackle 'corridor care' and long waits with almost £450m NHS investment in England\n                 \n                  Plans to tackle mental health crisis 'not ambitious enough', charity boss tells Sky News\n                 Mr Streeting said the app will make using the NHS more convenient, and give patients more control, while saving money. He said these funds can then be invested back into the health service, to bolster things such as frontline care. Using the NHS app should be 'as joyful as Netflix' The modernisation of the NHS will also lead to fewer missed appointments, and therefore save money that way too, it is hoped. In 2023/24, there were around eight million missed appointments in elective care and almost one in three people missed a screening appointment. Currently, around 20 million people have opted in to receive messages from the NHS app.  Pushed on how the government will ensure that nobody is left behind, Mr Streeting said: \"If someone like me is booking my appointment through the app because that's what I prefer to do, [then] that's freeing up a phone line for someone who wants to get through and talk to a person.\" He added that greater use of the app will give people more choice in \"how you want to organise your care\". The cabinet minister also made a bold comparison, saying he wishes that the NHS app is as enjoyable as using streaming giant Netflix. He said: \"The NHS app actually has more subscribers than Netflix. It would be a really wonderful thing if using the NHS app felt - if not as joyful - almost as joyful as using Netflix.\" Read more: Almost £450m invested in NHS in EnglandNHS waiting list increases for first time in months Other features in the pipeline - though not yet available - include being able to add appointments to phone calendars and request help from local GPs on the app. Faster log in methods, such as using Face ID, are also planned."
    },
    {
        "title": "Kemi Badenoch: ECHR has become 'sword used to attack democratic decisions'",
        "description": "Kemi Badenoch has warned there is \"no silver bullet\" to tackle immigration, but said it is \"likely\" the UK should leave the ECHR.",
        "url": "https://news.sky.com/story/kemi-badenoch-echr-has-become-sword-used-to-attack-democratic-decisions-13380035",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kemi-badenoch-westminster_6935735.jpg?20250606111209",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-06-06 10:47:00",
        "Headline": "Tory leader Kemi Badenoch says the \"use of litigation as a weapon\" is hurting the UK's security and prosperity - and that \"this can't go on\".",
        "Content": "\n          Political reporter\n              @WillCharley1\n Kemi Badenoch has warned there is \"no silver bullet\" to tackle immigration, but said it is \"likely\" the UK should leave the ECHR. It comes as the Conservative Party leader launched a review into whether the UK should leave the European Convention on Human Rights (ECHR). In a landmark speech setting out her party's position on immigration, the Tory leader accused the body, which dates back to the 1950s, of becoming a \"sword used to attack democratic decisions and common sense\". Politics latest: Badenoch says 'Britain is being mugged' She said the ECHR has been used to prevent foreign criminals, including convicted groomers, from being deported, as they have a right to family life under Article Eight of the convention. Ms Badenoch said: \"Over and over again, we hear of cases like this, where the law is weak, or just a mess. \"Right now, we are turning into a country that protects criminals and rewards their victims.\" She said \"this can't go on\" and described the use of the law in this way as \"lawfare\".  New immigration policy Ms Badenoch said she would like to see \"a total end to asylum claims in this country by illegal immigrants\". She also said the Conservatives want \"all those who arrive illegally and try to claim asylum\" to be deported immediately. The current asylum system is \"broken\", and the government has \"lost control\" of it - with the system now in the control of people traffickers, she alleged.  Ms Badenoch said she would like to see \"fundamental reform\", which is why she said she has launched a commission to review the ECHR. The commission will be chaired by Tory peer and former justice minister Lord Wolfson of Tredegar, who is now the shadow attorney general. She accused Labour of having \"no interest\" in reforming the ECHR, and said that they \"quite like the way things are\". Ms Badenoch also said the government \"isn't interested\" in solving problems such as how many immigrants should be allowed to stay in the UK. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Badenoch's five tests The Conservative Party leader set out \"five tests\" she would like the review to judge the ECHR against: • The deportation test - whether parliament, rather than the courts, \"decides who comes here and who stays\"• The veterans test - this is about stopping \"veterans being endlessly pursued by vexatious legal attacks\"• The fairness test - whether British citizens can be prioritised for social housing and public services• The justice test - whether prison sentences can be made to actually reflect parliament's intentions• The prosperity test - whether parliament can \"prevent endless legal challenges for our infrastructure projects\" Ms Badenoch said that if these tests cannot be met and there is \"no realistic prospect of changing them\", then the UK must leave the ECHR - \"no hesitation, no apology\". She admitted \"there is no silver bullet\" - but added she believes this is the best course of action. The review will report back at the party's conference in the autumn. What are the other parties saying? Ms Badenoch's position goes less far than that of Reform UK, who she also attacked in her speech.  Nigel Farage has said he would leave the ECHR already. It also puts her out of step with some of her cabinet, including prominent Tory, Robert Jenrick. The shadow justice secretary warned Tories the party would \"die\" if they did not back exiting the ECHR. Labour has meanwhile said it would like to remain in the ECHR but will bring forward legislation to \"ensure it is the government and not parliament that decides who should have the right to remain in the UK\". Yvette Cooper, the home secretary, said compliance with international law has helped the government strike deals about cracking down on criminal gangs, such as with France and Germany. A Labour spokesperson accused Ms Badenoch of \"booting [the issue] into the long grass\". They said: \"Kemi Badenoch bemoaned the broken immigration and asylum system, but failed to mention it was her party which broke it. The Tories had had 14 years to fix our immigration system.\""
    },
    {
        "title": "Why did Zia Yusuf resign as chairman of Reform UK?",
        "description": "About 15 minutes before Zia Yusuf's shock resignation, a few senior Reform figures were warned something was due to happen.",
        "url": "https://news.sky.com/story/why-did-zia-yusuf-resign-as-chairman-of-reform-uk-13379985",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-zia-yusuf-westminster_6928718.jpg?20250606122546",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-06-06 09:35:00",
        "Headline": "A senior Reform UK source says Zia Yusuf was \"not pushed\" and \"just got sick of all the abuse online\", and chose to leave of his own accord.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n About 15 minutes before Zia Yusuf's shock resignation, a few senior Reform figures were warned something was due to happen. \"It was a surprise, but we knew something was up,\" a senior party source tells me. Politics latest: 'Britain is being mugged,' says Badenoch Alongside Nigel Farage and Richard Tice, Mr Yusuf has been an increasingly recognisable face in Reform UK. That was no accident: he was being put forward for more media interviews and was seen by some, including Mr Farage, as the future of the party. So what went wrong? A senior source tells me Mr Yusuf \"definitely was not pushed\" and the situation was very different to the resignation of former Reform MP Rupert Lowe. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The source said relations between the party leader and Mr Yusuf are \"absolutely fine\" and the pair have been in contact. In his statement, the former chairman said the role was no longer \"a good use of my time\". Behind the scenes, Mr Yusuf did have critics. He angered some when the police became involved in an investigation into Mr Lowe. On Wednesday, Mr Yusuf publicly distanced himself from the party's new MP, Sarah Pochin, when she asked Sir Keir Starmer about a burka ban at Prime Minister's Questions. Reform said the ban wasn't party policy - and the chairman called it a \"dumb\" thing to ask in a post on X.  The source said that before Ms Pochin's comments, Mr Yusuf was wavering: \"He just got sick of all the abuse online.\" They said the Reform UK leader was \"genuinely saddened\" by the former chairman's resignation, and Mr Yusuf was \"not pushed aside, he still had full control\" amidst claims of a power struggle. Another source close to the party, however, said Mr Yusuf had committed several \"politically inexperienced\" missteps, and a row had been brewing over his social media post about Ms Pochin. Read more from Sky News:Scottish Labour win by-election'A policy Labour never liked' Asked about accusations that, as we saw with UKIP, Mr Farage can't hold the top of his party together, a senior source said: \"The Rupert Lowe thing was far bigger and that did not affect our polling or results in May.\" They pointed to the rapid turnover of Conservative chairmen before they lost the election, and said the party was \"not rushing\" to appoint a new chairman."
    },
    {
        "title": "Blood test for Alzheimer's disease is highly accurate, researchers say",
        "description": "Researchers say a new blood test for Alzheimer's disease has been shown to be highly accurate in detecting people with early symptoms.",
        "url": "https://news.sky.com/story/blood-test-for-alzheimers-disease-is-highly-accurate-researchers-say-13380314",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-microscope-laboratory_6936209.jpg?20250607013047",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-06 23:30:00",
        "Headline": "US researchers say their next step is to extend the test to a wider range of patients, including those with early Alzheimer's who do not have any cognitive symptoms.",
        "Content": "Researchers say a new blood test for Alzheimer's disease has been shown to be highly accurate in detecting people with early symptoms. Scientists looked for two proteins - amyloid beta 42/40 and p-tau217 - and found the test was 95% accurate in identifying patients with existing cognitive impairment linked to the condition. The US study involved 509 patients in an outpatient memory clinic in Florida and was published in the medical journal Alzheimer's and Dementia. The test, which has already been approved by the US regulator, was also 82% accurate for specificity, which means it could rule out people without dementia. Dr Gregg Day, who led the study, said the test was as good as existing, but more invasive, tests. He said the next step was to extend the test to a wider range of patients, including those with early Alzheimer's who do not have any cognitive symptoms. Scientists say the two proteins, which they have identified in blood plasma, are associated with the buildup of amyloid plaques. \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 \n                  Football bodies could be forced to pay towards brain injury care costs of ex-players\n                 \n                  Bristol Rovers legend taking legal action against FA over brain condition says he has just years to live\n                 Amyloid protein can be found in our brains, but in Alzheimer's disease, amyloid sticks together and forms abnormal deposits, which are thought to be toxic to brain cells. Dr Richard Oakley, associate director for research and innovation at the Alzheimer's Society in the UK, said the results \"suggest this test is very accurate\". \"Blood tests will be critical to accelerate diagnosis and give more people access to the care, support and treatments they desperately need faster than ever before,\" he added. Read more:Dementia risk link to sleep problemsBrain injury costs for ex-footballersFormer player shares dementia fears In the UK, the Blood Biomarker Challenge is a multi-million-pound research programme supported by the Alzheimer's Society, Alzheimer's Research UK and the National Institute for Health and Care Research.  Its goal is to bring blood tests for dementia diagnosis to the NHS by 2029. Dr Julia Dudley, head of research at Alzheimer's Research UK, said: \"We urgently need to improve how we diagnose dementia and it's great to see international research working towards this goal.\" She said the studies like the Blood Biomarker Challenge are a \"crucial part of making diagnosis easier and faster, which will bring us closer to a cure\". \"The study is testing blood tests, including p-tau217, in thousands of people from sites across the UK,\" she added."
    },
    {
        "title": "In a dangerous world, the explosive Trump-Musk bust-up is more terrifying than titillating",
        "description": "Elon Musk posted in February that he loved his president, patron and personal friend, \"as much as a straight man can love another man.\"",
        "url": "https://news.sky.com/story/in-a-dangerous-world-the-explosive-trump-musk-bust-up-is-more-terrifying-than-titillating-13380062",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-donald-trump-elon-musk_6780448.jpg?20241219131241",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-06-06 11:48:00",
        "Headline": "Elon Musk and Donald Trump's hysterical tit-for-tat on social media might be the stuff of Hollywood tabloids, but its dangers extend far beyond the men themselves.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  Elon Musk posted in February that he loved his president, patron and personal friend, \"as much as a straight man can love another man.\" And they had so much in common: colossal egos; mercurial political views; compulsive social media habits. Yet, it was clear to almost all but the most hopeless MAGA romantics that this rocket-fuelled megastar bromance was doomed to fail. But who would have predicted an end this spectacular - their relationship undergoing a \"rapid unscheduled disassembly\" to rival the most explosive of Mr Musk's test rockets.  Their hysterical tit-for-tat on social media might be the stuff of Hollywood tabloids, but its consequences could be grave. The break-up has already had a major impact on Mr Musk's wealth, with Tesla shares sliding 15% on the news. But Mr Musk's social media platform and $250m of political donations played no small part in getting Mr Trump and his supporters into the White House. \n                  White House officials to meet Chinese delegation in London for next round of trade talks\n                 \n                  Trump says Musk has 'lost his mind' - as president considering selling his Tesla\n                 \n                  Trade war: US hiring slows but employment resilient\n                 If that money and influence were to turn against them, it could see them out. And in terms of strategic significance, Elon Musk's SpaceX is no ordinary company. In 2024, it averaged a rocket launch every three days, accounting for nearly 90% of the US orbital launch market and took more cargo into space last year than the rest of the world combined. Read more:Musk says Trump appears in Epstein files as row explodesThe extraordinary spat minute-by-minuteThe big, beautiful bust-up everyone knew was coming Elon Musk already appears to have backed down on his threat to decommission the SpaceX Crew Dragon that ferries astronauts to the International Space Station. Doing so would have risked the lives of the crew on board, leaving the US and its international partners reliant on Russian hardware to take them in and out of orbit.  Nor is it likely Mr Trump would, or even could, take down a company as necessary to US interests as SpaceX. Although the souring of relations will be good news for his up-and-coming rivals like Amazon founder Jeff Bezos's Blue Origin launch company. SpaceX is heavily reliant on government contracts from NASA and the US military. But it could be years before a competitor can rival its near-monopoly on space launches. The two men could, of course, patch things up. It wouldn't be the first time either has said outrageous things on social media that they later shrugged off. But in one way, the damage has already been done. The world has witnessed two of its most powerful people row like teenagers with no evidence of the wisdom, restraint or cool-headedness most would expect of reliable businessmen and heads of state. Given the state of the world right now, what the lurid details of their row says about the two men is more terrifying than titillating."
    },
    {
        "title": "Millions to receive NHS screening invitations and appointment reminders on their phones",
        "description": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones.",
        "url": "https://news.sky.com/story/millions-to-receive-nhs-screening-invitations-and-appointment-reminders-on-their-phones-13380109",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nhs-app-on-phone-department-of-health_6936208.jpg?20250607003247",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-06 13:30:00",
        "Headline": "It's part of efforts to bring the NHS out of the \"analogue age\" and into a digital one, with physical NHS letters being scrapped.",
        "Content": "Appointment reminders, invitations to health screenings and test results will now be received by patients on their phones. The government says moving to a more digital-focused NHS will mean 50 million fewer letters need to be sent out by the health service, saving an estimated £200m over the next three years. Instead, under the new plans, millions of people will be notified about appointments and other important notices via the NHS app on their phone or digital device. The app is set to become the go-to method for the NHS to communicate with people, the Department of Health and Social Care said. The changes will be backed by more than £50m investment. It will see a predicted 270 million messages sent through the app this year, an increase of around 70 million on the last financial year, the government announced. Wes Streeting has said this is all about modernising, as the NHS \"feels so 20th century\". The health secretary said: \"The fact that people still get letters through the front door, sometimes multiple letters about the same appointment... The NHS has been stuck in the mud when it comes to the everyday technology we use to organise our lives. And that's why what we're doing with the NHS app is really exciting.\" \n                  The NHS winter crisis is a recurring seasonal theme – tackling it will bring challenges\n                 \n                  Labour vows to tackle 'corridor care' and long waits with almost £450m NHS investment in England\n                 \n                  Plans to tackle mental health crisis 'not ambitious enough', charity boss tells Sky News\n                 Mr Streeting said the app will make using the NHS more convenient, and give patients more control, while saving money. He said these funds can then be invested back into the health service, to bolster things such as frontline care. Using the NHS app should be 'as joyful as Netflix' The modernisation of the NHS will also lead to fewer missed appointments, and therefore save money that way too, it is hoped. In 2023/24, there were around eight million missed appointments in elective care and almost one in three people missed a screening appointment. Currently, around 20 million people have opted in to receive messages from the NHS app.  Pushed on how the government will ensure that nobody is left behind, Mr Streeting said: \"If someone like me is booking my appointment through the app because that's what I prefer to do, [then] that's freeing up a phone line for someone who wants to get through and talk to a person.\" He added that greater use of the app will give people more choice in \"how you want to organise your care\". The cabinet minister also made a bold comparison, saying he wishes that the NHS app is as enjoyable as using streaming giant Netflix. He said: \"The NHS app actually has more subscribers than Netflix. It would be a really wonderful thing if using the NHS app felt - if not as joyful - almost as joyful as using Netflix.\" Read more: Almost £450m invested in NHS in EnglandNHS waiting list increases for first time in months Other features in the pipeline - though not yet available - include being able to add appointments to phone calendars and request help from local GPs on the app. Faster log in methods, such as using Face ID, are also planned."
    },
    {
        "title": "Beyonce rides into town for London leg of Cowboy Carter tour",
        "description": "Denim chaps and hot pants aren't most people's go-to outfit for standing outside on a drizzly June day in London but Beyonce fans with tickets to her Cowboy Carter tour joked they were enjoying their very own \"rain-aissance\".",
        "url": "https://news.sky.com/story/beyonce-rides-into-town-for-london-leg-of-cowboy-carter-tour-13379884",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beyonce-cowboy-carter_6935591.jpg?20250606045939",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-06-06 03:24:00",
        "Headline": "The global superstar is reportedly projected to make around £240m from her 31 international shows. And while it can be tricky to set the right price point for tickets, fans got plenty of bang for their buck.",
        "Content": "\n          Arts and entertainment correspondent\n        Denim chaps and hot pants aren't most people's go-to outfit for standing outside on a drizzly June day in London but Beyonce fans with tickets to her Cowboy Carter tour joked they were enjoying their very own \"rain-aissance\". Referencing the singer's 7th studio album, for Wilfy - originally from Brazil - the weather wasn't going to dampen his spirits. \"We came to rock and this time I'm going to see her 5 times, so on Saturday I'll be back. It's Beyonce - this is a rain-aissance!\" Her album Cowboy Carter may be responsible for the plethora of country-themed outfits, but this is not the star's first rodeo in terms of touring. As an artist who's been making music for over 25 years, this time around her 31 international shows are reportedly projected to make around £240m. For established artists, with their income from touring often surpassing revenue from streaming or sales nowadays, the price point of tickets can be a tricky line to tread - just ask Oasis. Figuring out how best to cover the costs of the massive touring infrastructure involved, make a profit whilst at the same time ensuring fans don't feel ripped off isn't easy to get right. \n                  Charli XCX, Beyonce, Taylor Swift - the Grammy moments everyone is talking about\n                 \n                  Grammys 2025: Beyonce makes history as she wins album of the year\n                 \n                  Grammy Awards: Everything to know ahead of the show\n                 From giant trucks to a mechanical bull, Beyonce fans are promised plenty of bang for their buck and at almost three hours long, it is her longest show yet. \"I love this country album, it's so good,\" said Emily from Manchester. \"I feel like it's going to be an amazing show.\" Enon from Israel explained he'd taken a five-hour flight and spent a day ripping and sewing his cowboy-inspired tasselled denim crop top because \"Beyonce is one of a kind, she changed my life, she made me who I am, and this is our little Met Gala\". While there is quite a bit of pressure on the global superstar to deliver the goods, one man who knows more than most about how that feels is her dad, Dr Mathew Knowles, who was her manager for many years. \"It takes a lot to be a good manager,\" he says, thoughtfully reflecting on that time, \"but it takes even more to be a great one.\" From Destiny's Child up until 2011, he worked alongside his daughter for some of her biggest hits. \"I'm one of the best managers ever,\" he says in all seriousness. While he has a ticket to see her perform in London, he is already in town to teach students at the London College of Contemporary Music where Sky News caught up with him.  Read more from Sky News:Meet star of John Wick spin-offDiddy trial: Rapper warned by judge Here also to help find a new talent deserving of a music scholarship in his name. The candidate, he explained, has to be \"a student who's shown this real capacity, commitment and passion for the music industry\". A stickler for young talent putting the practice in, he says: \"Some artists aren't ready to tour… from a creative standpoint and a performance standpoint [you need to] put in 10,000 hours.\" When her UK tour tickets went on sale, fans reported prices seemed to stay static, suggesting \"dynamic pricing\" wasn't used to cash in on demand. On Oasis' headline-making ticket price row, Dr Knowles said: \"I had to learn the value as a manager of understanding where each and every ticket goes. \"You know, it's sad that often the artist gets the black eye when in fact the manager should be more involved…sometimes the artist doesn't even know about it until they hear these complaints.\" Of course, you'll hear few complaints from those with a ticket to see Beyonce on the UK leg of her world tour. Music-wise Milton from Albania says he is confident his idol will \"bring everyone together\". But, he said, he wasn't so sure about whether he'd need carrying out afterwards. \"When I see her I may die - a heart attack at a Beyonce concert? It would be worth it. What a way to go.\""
    }
]