[
    {
        "title": "Labour say there's been a 'massive increase' in NHS appointments - this begs to differ",
        "description": "\"The target was never particularly ambitious,\" says the Institute for Fiscal Studies (IFS) about Labour's plan to add two million extra NHS appointments during their first year in power.",
        "url": "https://news.sky.com/story/labour-say-theres-been-a-massive-increase-in-nhs-appointments-this-begs-to-differ-13372714",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-nhs-data-and-forensics_6924130.jpg?20250522133836",
        "type": "Home",
        "Author": "Daniel Dunford, senior data journalist, and Sam Coates, deputy political editor",
        "Date Published": "2025-05-22 13:00:00",
        "Headline": "Keir Starmer made slashing NHS waiting times one of his priorities, and his Labour government has already claimed it as one of its biggest achievements so far. But new data tells a different story - and the public aren't noticing an improvement.",
        "Content": "By Daniel Dunford, senior data journalist, and Sam Coates, deputy political editor   \"The target was never particularly ambitious,\" says the Institute for Fiscal Studies (IFS) about Labour's plan to add two million extra NHS appointments during their first year in power. In February, Health Secretary Wes Streeting announced they had achieved the feat early. He recently described the now 3.6m additional appointments achieved in their first eight months as a \"massive increase\". PM signs Chagos deal - politics latest But new data, obtained by independent fact checking charity Full Fact and shared exclusively with Sky News, reveals this figure actually signalled a slowing down in new NHS activity. There was an even larger rise of 4.2m extra appointments over the same period the year before, under Rishi Sunak's government. The data also reveals how unambitious the target was in the first place. We now know two million extra appointments over the course of a year represents a rise of less than 3% of the almost 70 million carried out in the year to June 2024. In the last year under Mr Sunak, the rise was 10% - and the year before that it was 8%. Responding to the findings, Sarah Scobie, deputy director of independent health and social care think tank the Nuffield Trust, told Sky News the two million target was \"very modest\". She said delivering that number of appointments \"won't come close to bringing the treatment waiting list back to pre-pandemic levels, or to meeting longer-term NHS targets\". The IFS said it was smaller than the annual growth in demand pressures forecast by the government. What exactly did Labour promise? The Labour election manifesto said: \"As a first step, in England we will deliver an extra two million NHS operations, scans, and appointments every year; that is 40,000 more appointments every week.\" We asked the government many times exactly how it would measure the pledge, as did policy experts from places like the IFS and Full Fact. But it repeatedly failed to explain how it was defined. Leo Benedictus, a journalist and fact-checker at Full Fact, told Sky News: \"We didn't know how they were defining these appointments. \"When they said that there would be more of them, we didn't know what there would be more of.\" Even once in government, initially Labour did not specify their definition of \"operations, scans, and appointments\", or what the baseline \"extra\" was being measured against. This prevented us and others from measuring progress every month when NHS stats were published. Did it include, for instance, mental health and A&E appointments? And when is the two million extra comparison dating from? Target met, promise kept? Suddenly, in February, the government announced the target had already been met - and ever since, progress on appointments has been a key boast of ministers and Labour MPs. At this point, they did release some information: the definition of procedures that allowed them to claim what had been achieved. They said the target involved is elective - non-emergency - operations excluding maternity and mental health services; outpatient appointments and diagnostic tests.  However, we still did not have a comprehensive baseline to measure the two million increase against. The government data instead relied on a snapshot: comparing the number of appointments carried out from July to November 2024 with the number from July to November 2023, and adjusted them for the number of working days in each period. This did not tell us if the NHS had already been adding appointments under the Conservatives, and at what pace, and therefore whether this target was a big impressive ramping up of activity or, as it turns out, actually a slowing down. Since then, a number of organisations, like Full Fact, have been fighting with the government to release the data. Mr Benedictus said: \"We asked them for that information. They didn't publish it. We didn't have it. \"The only way we could get hold of it was by submitting an FOI request, which they had to answer. And when that came back about a month later, it was fascinating.\" This finally gives us the comparative data allowing us to see what the baseline is against which the government's \"success\" is being measured. Full Fact passed the data to Sky News because it had seen our reporting about how the information published by the NHS in February was not sufficient to be able to assess whether things were getting better or worse. What the government says now We put our findings to the government. A Department of Health and Social Care spokesperson said: \"On entering office last July, the secretary of state [Wes Streeting] was advised that the fiscal black hole meant elective appointments would have to be cut by 20,000 every week. \"Instead, this government provided the extra investment and has already delivered 3.6 million additional appointments - more than the manifesto commitment the British public voted for - while also getting more patients seen within 18 weeks. \"In the nine months since this government took office, the waiting list has dropped by over 200,000 - more than five times as much as it had over the same period the previous year - and also fell for six consecutive months in a row.\" We put this to Jeremy Hunt, Rishi Sunak's chancellor during his last two years as prime minister, and health secretary for six years under David Cameron and Theresa May. He said: \"What these numbers seem to show is that the rate of appointments was going up by more in the last government than it is by this government. That's really disappointing when you look at the crisis in the NHS. \"All the evidence is that if you want to increase the number of people being treated, you need more capacity in the system, and you need the doctors and nurses that are there to be working more productively. \"Instead what we've had from this government is the vast majority of the extra funding for the NHS has gone into pay rises, without asking for productivity in return.\" Edward Argar, shadow health secretary, accused the government of a \"weak attempt […] to claim credit for something that was already happening\". \"We need to see real and meaningful reform that will genuinely move the dial for patients,\" he added. Is the NHS getting better or worse? New polling carried out by YouGov on behalf of Sky News this week also reveals 39% of people think the NHS has got worse over the past year, compared with 12% who think it's got better. Six in 10 people say they do not trust Keir Starmer personally on the issue of the NHS, compared with three in 10 who say they do. That is a better rating than some of his rivals, however. Just 21% of people say they trust Nigel Farage with the NHS, and only 16% trust Kemi Badenoch - compared with 64% and 60% who do not. Ed Davey performs better, with 30% saying they trust him and 38% saying they do not. Ms Scobie of the Nuffield Trust told Sky News \"the government is right to make reducing long hospital treatment waits a key priority […] but much faster growth in activity is needed for the NHS to see a substantial improvement in waiting times for patients.\" The government is correct, however, to point out the waiting list having dropped by more than 200,000 since it's been in office. This is the biggest decline between one July and the following February since current waiting list statistics were first published under Gordon Brown. The percentage of people waiting less than 18 weeks for treatment is also falling for the first time, other than a brief period during the pandemic, for the first time in more than a decade. There is still a long way to go, though. Figures released last week showed the total number of people waiting for NHS treatment in England had risen again in March, following six months of positive progress. The latest figures show 6.25m people waiting for 7.42m treatments (some people are on the list for more than one issue). That means more than one in 10 people in England are currently waiting for NHS treatment. There continues to be a fall in the number who have been waiting longer than a year. It’s now 180,242, down from almost 400,000 in August 2023 and over 300,000 in June 2024, the Conservatives' last month in power. But that number is still incredibly high by historical standards. It remains over 100 times higher than it was before the pandemic. The government has a separate pledge that no more than 8% of patients will wait longer than 18 weeks for treatment, by the time of the next election. Despite improvements in recent months, currently more than 40% wait longer than this. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Israeli embassy shooting suspect 'fired repeatedly after victims hit the ground'",
        "description": "The man suspected of shooting dead two Israeli embassy workers in Washington DC leaned over and fired at them repeatedly after they fell to the ground, the FBI has said.",
        "url": "https://news.sky.com/story/israeli-embassy-shooting-suspect-fired-repeatedly-after-victims-hit-the-ground-13373006",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-yaron-lischinsky-sarah-milgrim_6924053.jpg?20250522122801",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-22 21:08:00",
        "Headline": "The deaths of Yaron Lichinsky and Sarah Lynn Milgrim saw Benjamin Netanyahu accuse Keir Starmer, Emmanuel Macron and Mark Carney of fuelling antisemitism, having threatened \"concrete action\" against Israel over the war in Gaza.",
        "Content": "The man suspected of shooting dead two Israeli embassy workers in Washington DC leaned over and fired at them repeatedly after they fell to the ground, the FBI has said. Elias Rodriguez, 31, has been charged with murdering Sarah Milgrim and her boyfriend Yaron Lischinsky, after they left an event at the Capital Jewish Museum on Wednesday night. Israeli PM attacks Starmer - latest updates Footage has showed Rodriguez, from Chicago, chanting \"free, free Palestine\" as he was arrested. It later emerged Mr Lischinsky had bought a ring and planned to propose to Ms Milgrim. Authorities are investigating the killings as both a hate crime against the Jewish community and terrorism.  'I did it for Gaza' It comes as the FBI has said in a charging document on Thursday that surveillance footage shows how Ms Milgrim and Mr Lischinsky died. Rodriguez is allegedly seen passing the couple after they left the museum before shooting them in the back. The FBI says the footage then shows him leaning over the couple and firing at them several more times after they fell to the ground. The video then shows Ms Milgrim attempting to crawl away before \"(Rodriguez) followed behind her and fired again\", the charging document says. The suspected gunman is then accused of reloading his weapon and firing at Ms Milgrim as she sat up. According to the charging document, Rodriguez then jogged to the museum and once inside asked to speak to a police officer before stating that he \"did it\" and that he was unarmed. He is then said to have told police: \"I did it for Palestine, I did it for Gaza, I am unarmed.\"  Suspect 'expressed admiration' for fatal protest The court document also states that 21 expended 9mm bullet cases were found at the scene and the gun was slide-locked - meaning it was empty of ammunition. An empty gun magazine was also recovered from the scene. The FBI says it has obtained travel records which show Rodriguez flew from Chicago's O'Hare International Airport to the Reagan National in Washington DC on Tuesday with the gun in his checked baggage. Rodriguez had bought the weapon in the state of Illinois on 6 March 2020, according to the charging document. The FBI has said that while Rodriguez was in custody he \"expressed admiration\" for a US Air Force member who set himself on fire in front of the Israeli embassy in Washington DC on 25 February 2024. Aaron Bushnell died in the apparent act of protest against the war in Gaza. Rodriguez also told police he bought a ticket to the museum around three hours before the event that was attended by Ms Milgrim and Mr Lischinsky. Read more:Why Trump will worry about attacker being glorified  During a brief court appearance at the E. Barrett Prettyman Federal Courthouse in Washington DC today, Rodriguez was charged with two counts of first degree murder and with the murder of foreign officials. He has also been charged with causing the death of a person through the use of a firearm and discharge of a firearm during a crime of violence. Rodriguez was told he could face life in prison or the death penalty if he is found guilty. He remained calm throughout the hearing, paying attention to the proceedings throughout and confirmed that he is asking the court to appoint an attorney on his behalf. He will next appear at a federal court in Washington DC on 18 June. Murdered couple 'were perfect for each other' Meanwhile, Ms Milgrim's father, Robert, says he feared his daughter might be in danger when he saw news alerts of a fatal shooting in Washington DC. Ms Milgrim's mother Nancy opened a phone locator app and saw Ms Milgrim was at the Capital Jewish Museum. \"Shortly after that, the Israeli ambassador called us on my wife's phone,\" Mr Milgrim told Sky News' partner network NBC News, fighting back tears. He added that it was the ambassador who told them Mr Lischinksy had bought a ring and was planning to propose to Ms Milgrim. \"They were perfect for each other, he said. Mr Milgrim continued: \"They just brought us joy, and her memory, which is a blessing, will continue to bring us joy - but it's not the same as her not being here.\""
    },
    {
        "title": "The 'scary spotlight' on music stars amid Kneecap terror charge",
        "description": "Before the amps are even switched on in Brockwell Park, there's been a lot of noise about who should or shouldn't be performing.",
        "url": "https://news.sky.com/story/the-scary-spotlight-on-music-stars-amid-kneecap-terror-charge-13373097",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kneecap-irish-band_6902809.jpg?20250501172410",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-22 23:58:00",
        "Headline": "As Kneecap court controversy - and one member faces a terror charge - over their political stances, Sky News speaks to artists about the risks of being outspoken at a time the world is so divided.",
        "Content": "\n          Arts and entertainment correspondent\n       Before the amps are even switched on in Brockwell Park, there's been a lot of noise about who should or shouldn't be performing. It's where Irish hip-hop trio Kneecap are set to play their first major show since band member Mo Chara was charged for allegedly displaying a flag in support of the terrorist group Hezbollah at one of their gigs. Before that, there had been calls for festivals to reconsider booking the band over their political stances, and several have done, which prompted artists like Brian Eno, the Mystery Jets and CMAT to sign an open letter accusing Westminster and the British media of a campaign to \"remove Kneecap from the public eye\". They put their names to wording that said \"in a democracy, no political figures… have the right to dictate who does and does not play at music festivals.\" The band have since claimed they're the victims of \"political policing\" designed to silence their views on Gaza. So what's the reality like for artists who are outspoken at a time when the world is so divided? As some of the biggest names in music gathered in London for the Ivors, an annual celebration of songwriting, Self-Esteem - aka Rebecca Lucy Taylor - said the level of scrutiny can be \"terrifying\". 'The problem with the internet' She told Sky News: \"The problem with the internet is you say one thing, which gets scrutinised, and then you shit yourself, you really do… then you're advised not to. And then you're like 'don't advise me not to!' \"You second-guess anything you want to say any more… but any time I do that, I think 'well that's why you've got to say it then'.\" She said it can be frustrating that focus turns on to pop stars' opinions instead of \"the people doing the bad things\". Read more:Why are Kneecap controversial? 'Being a pop artist isn't just about the music' Former Little Mix singer Jade said: \"To be a pop artist these days, it's not just about music, it's: 'What's your political stance?' \"I've always been quite vocal about those things, but in doing so you have even more of a scary spotlight on you, constantly assessing what your thoughts are as a human…it is scary.\" Trinidad-born London artist Berwyn, whose songs depict his struggles with UK immigration, says: \"Silencing freedom of speech… is a road we don't want to walk down. \"I'm not a politician, this is a very complicated issue, but I do absolutely believe in a human's right to express themselves freely.\" But is that freedom of speech dependent on what side you're coming from? 'Unethical investments' Soon, an event called Mighty Hoopla will take place at Brockwell Park as part of its programme of six festivals this summer. Artists performing at that are coming under increased pressure from pro-Palestine groups to quit because it's owned by a company called Superstruct, which has links to an American investment firm called KKR. Critics argue that any KKR-affiliated events should be a red flag to artists as campaigners claim it \"invests billions of pounds in companies\" that do things like \"develop Israeli underground data centres\", and they say it has shares in companies that \"advertise property on illegally occupied land in the West Bank\". 👉 Listen to Sky News Daily on your podcast app 👈 Mighty Hoopla itself has said while it \"cannot control investments made in our parent companies\", it wants to \"state its clear opposition to KKR's unethical investments\". And Superstruct - which puts on over 80 festivals around the world - says while horrified by the crisis in Gaza: \"We are aware that there is a significant amount of debate… around our festivals. \"Our owners, made up of our promoters and several investment firms, support us to achieve the highest standards... fans and artists rightly expect.\" They insist that operationally, Superstruct is independently run and all its \"revenue and profits… remains entirely within our business… towards the ongoing development… of our festivals.\" Read more from Sky News:Kid Cudi says Diddy 'messed with his dog'Bono calls for Israel to be 'released from Netanyahu'Chris Brown posts message as singer is bailed Even deciding where to perform can have political connotations for musicians these days. As Tom Gray, a founding member of the rock band Gomez, now chair of the Ivors, explains: \"The amount of commercial interest required to get a young artist into the public eye means they have to keep their head down a lot and that's a terrible shame. \"It's not just artistic expression, but personal human expression is one of the fundamental things that allows people to feel they have agency.\""
    },
    {
        "title": "Kid Cudi says Sean 'Diddy' Combs broke into his house and 'messed with his dog'",
        "description": "Kid Cudi has told a court Sean \"Diddy\" Combs broke into his home, \"messed with\" his dog and opened some of his Christmas presents during a break-in in December 2011.",
        "url": "https://news.sky.com/story/kid-cudi-says-sean-diddy-combs-broke-into-his-house-and-messed-with-his-dog-13372988",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kid-cudi-sean-diddy-combs_6924601.jpg?20250522215021",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-22 20:38:00",
        "Headline": "On the ninth day of the Sean \"Diddy\" Combs trial, Kid Cudi told the jury his Porsche was written off after a Molotov cocktail posted inside a hole cut in the roof, shortly after Diddy broke into his home.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Kid Cudi has told a court Sean \"Diddy\" Combs broke into his home, \"messed with\" his dog and opened some of his Christmas presents during a break-in in December 2011. The 41-year-old rapper was giving evidence on day nine of the trial, after briefly dating Diddy's former girlfriend Cassie the same year. Cassie and Diddy dated for 11 years, from 2007 to 2018, and Cassie has testified the rapper physically abused her during most of their relationship. Cudi described Cassie phoning him early one morning, sounding \"stressed, nervous and scared\", telling him Diddy had \"found out about us\". He said Diddy later called him from his home and told him, \"I'm here waiting for you\". After dropping Cassie at a West Hollywood hotel, Cudi said he returned to his home and found no one there, but said his dog had been locked in the bathroom. He described his pet later becoming \"jittery and on edge all the time\". He also said someone had opened Christmas presents he'd bought for his family. While Cudi, whose real name is Scott Mescudi, said he initially wanted \"to fight\" Diddy, he later thought through \"the reality of the situation,\" and called the police to report the break-in. Earlier this week, Cassie finished giving four days of evidence, becoming emotional at times, and testifying that Combs had threatened to blow up Cudi's car and hurt him after he learned she was dating him by looking at messages on her phone during a \"freak off\". Prosecutors say Combs, the founder of Bad Boy Records, forced women to take part in days-long, drug-fuelled sexual performances known as \"Freak Offs\" from 2004 to 2024, facilitated by his large retinue of staff. Combs, 55, has pleaded not guilty. The rapper faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. Sean 'Diddy' Combs trial: Day 9 - As it happened The month after the break-in, Cudi's Porsche was firebombed in his drive, with a hole cut into the roof and a Molotov cocktail dropped into the driver's seat. Cudi said he realised he had to talk to Diddy, before things \"got out of hand,\" meeting up with Diddy, who he said was weirdly \"calm\" and staring out the window with his hands behind his back \"like a Marvel super villain\". Cudi says Diddy told him he had still been dating Cassie during his relationship with her, with Cudi replying: \"[Cassie] told me you were broke up, and I took her word for it.\" Shaking hands at the end of the conversation, Cudi said he asked Diddy about \"burning\" his car, and Diddy replied, \"I don't know what you're talking about\". Cudi later said he believed that to be a lie. Cudi says he saw Diddy once a few years later at Soho House in Los Angeles with his daughter, and Diddy told him: \"Man, I just want to apologise for all that bullshit\". Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' Combs During his cross-examination, the defence suggested Cassie had been \"living two different lives\", and \"played\" both Cudi and Combs. Cudi concluded his time on the stand, saying his relationship with Cassie ended because he wanted \"to give her space\" and \"the drama was too out of hand\". Celebrity make-up artist Mylah Morales also gave evidence, describing a fight between Cassie and Diddy in 2010, which she says left Cassie with a \"swollen eye, busted lip, and knots on her head\". Morales said while she had heard the row, she hadn't physically seen it as she wasn't in the room. She told the court, \"I feared for my life\", explaining that she took Cassie to her apartment for several days to recover, but that Cassie refused to go to hospital as she was afraid of Diddy's reaction. The defence attempted to damage Morales's credibility by listing her TV appearances, which included programmes on CNN, and with Don Lemon and Piers Morgan, attempting to paint her as attention-seeking. The day also saw Combs's former assistant George Kaplan complete his testimony. He talked about two occasions when he had been asked to carry cash for Diddy, who he said never paid for things himself in the moment, recalling one time in 2015 when he looked after $50,000, and another when he was asked to pick up $10,000. Kaplan described seeing \"regular\" physical violence between Cassie and Diddy, including an incident in 2015 with whisky glasses on a private plane, when he heard glass breaking and saw Diddy standing over Cassie in the plane's central aisle. He says he also saw Diddy hurling \"decorative apples\" at another of his girlfriends, Gina, late the same year, handing in his notice the following month. Also known throughout his career as Puff Daddy and P Diddy, Combs turned artists like Notorious BIG and Usher into household names, elevating hip-hop in American culture and becoming a billionaire in the process. Diddy has been held in the Metropolitan Detention Center in Brooklyn since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for around six weeks in total and will go into its third week next week."
    },
    {
        "title": "Starmer's winter fuel cut U-turn claim 'not credible'",
        "description": "Sir Keir Starmer's claim he is U-turning on cutting winter fuel payments for pensioners because he now has the money is not \"credible\", Harriet Harman has said.",
        "url": "https://news.sky.com/story/starmers-winter-fuel-cut-u-turn-claim-not-credible-13372837",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-electoral-dysfunction_6924635.jpg?20250522223106",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-22 16:10:00",
        "Headline": "The prime minister has suggested the government will look at making the winter fuel allowance available to more pensioners - a major change of tune following Labour's disastrous recent elections results.",
        "Content": "Sir Keir Starmer's claim he is U-turning on cutting winter fuel payments for pensioners because he now has the money is not \"credible\", Harriet Harman has said. 👉 Listen to Electoral Dysfunction on your podcast app 👈 The Labour peer, speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, said the prime minister made the move as it was so unpopular with voters. PM signs Chagos deal - politics latest She also said Labour's poor results at the local elections and the Runcorn and Helsby by-election were the \"straw that broke the camel's back\". Sir Keir said on Wednesday he would ease the cut to the winter fuel payment, which has been removed from more than 10 million pensioners this winter after it became means-tested. He and his ministers had insisted they would stick to their guns on the policy, even just hours before Sir Keir revealed his change of heart at PMQs  Baroness Harman said: \"It's always been contested and always been unpopular. \"But the final straw that broke the camel's back was the elections. The council elections and the Runcorn by-election, where the voters were saying, 'this is not the change we voted for'. \"At the end of the day, you cannot just keep flying in the face of what voters - particularly if they're people who previously voted for you - wanted.\" Baroness Harman is unconvinced by Sir Keir's claim he can U-turn because there is more money due to good economic management by the government. \"I don't think that's credible as an argument,\" she said. \"It really is the fact that voters just said 'this is not the change we voted for, we're not going to have this'.\" The challenge for the government now, she said, is deciding who will get the allowance moving forward, when they'll get it, and when it will all be announced. Read more:Ex-PM suggests who should miss out on winter fuel payments Chancellor Rachel Reeves has committed to just one major fiscal event a year, meaning just one annual budget in the autumn. Autumn budgets normally take place in October, with the last one at the end of the month. If this year's budget is around the same date, it will leave little time for the extra winter fuel payments to be made, as they are paid between November and December. Business Secretary Jonathan Reynolds told the Electoral Dysfunction podcast the economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts. He also said the public would have to wait for the budget for any announcement."
    },
    {
        "title": "Putin's Stalin revival hits a new level - with his crimes out of sight",
        "description": "The Moscow metro is a sight to behold.",
        "url": "https://news.sky.com/story/putins-stalin-revival-hits-a-new-level-with-his-crimes-out-of-sight-13372954",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russia-stalin-putin_6924673.jpg?20250522230433",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-05-22 19:41:00",
        "Headline": "At the central Taganskaya station, a new statue has been unveiled. It is of one of Russia's most well-known and controversial leaders, Joseph Stalin, a man who killed millions. Some have welcomed the monument, while others have criticised it.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  The Moscow metro is a sight to behold. The gilded interiors of its cavernous stations have the opulence of a baroque palace. But amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin. The Soviet dictator was responsible for the deaths of millions of innocent people, in purges, famines and his infamous gulag labour camps. But there's no mention of that on the new sculpture at the central Taganskaya station. Instead, he's depicted as a leader who was loved by his people - a crowd of adoring workers and their children are reaching out towards him in adoration. It was described as a \"gift\" to passengers by the capital's metro system to mark its 90th anniversary. Behind a crowd of selfie-snapping passengers Some Muscovites have accepted it with open arms. At Stalin's feet, there is a pile of red carnations, and in front swarms a rolling crowd of selfie-snapping passengers. \"It's excellent.\" gushes Olga. \"History of art, culture, significance, beauty.\" For Denis, it's \"the right decision\". \"This is the history of our state,\" he says. But as well as flowers, there is fury at what appears to be Russia's latest attempt to rehabilitate the tyrant. \"What were they thinking?!\" asks Svetlana, incredulous. \"How many died under his leadership? And suddenly he appears here, this bloodsucker. How is this possible?!\" \"We should remember and honour some of his deeds,\" believes Oleg. \"But to put him like this is disrespectful. He did a lot of bad things for the Soviet people.\" Stalin's creeping return under Putin The sculpture is a replica of one that first appeared in 1950, three years before Stalin's death, in honour of his role in the Soviet Union's defeat of Nazi Germany in the Second World War. It was removed in the 1960s during the period of de-Stalinisation, which sought to destroy his cult of personality. But under Vladimir Putin's rule, the dictator has been gradually reappearing. It's mostly been on a small scale, in towns well outside the capital. A statue so prominent and so central is a first. Read more:Former Ukrainian politician shot deadKremlin 'gleeful' after Trump's call to PutinUkraine-Russia talks revealed a stark reality A historical rehabilitation? \"The trend comes down to the idea of ​the greatness of the state,\" says Yan Rachinsky, a human rights activist who works to expose Stalin's crimes at the Moscow branch of Memorial, a renowned rights group that now operates on a local level after the closure of its international arm. \"For the current government, the main thing is the state. The state is sacred, the state is above everything, the state is infallible. That is why criticism of Stalin is constantly decreasing.\" Russia's current leader has previously condemned Stalin's repressions. But he's also said the country shouldn't be made to feel guilty about its past. \"Putin's old statement that one should be proud of history - that's it,\" says Mr Rachinsky. \"Everything that prevents us from being proud of history fades into the shadows.\" It certainly feels that way, looking at the statue. Stalin's historical horrors are out of sight, and seemingly, out of mind."
    },
    {
        "title": "UK signs deal to hand over control of Chagos islands",
        "description": "The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius.",
        "url": "https://news.sky.com/story/uk-signs-deal-to-hand-over-control-of-chagos-islands-13372755",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-diego-garcia-chagos_6874792.jpg?20250403110156",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-05-22 14:18:00",
        "Headline": "The deal involves leasing back a crucial military base on Diego Garcia, the largest of the Chagos Islands, for 99 years.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius. It means Britain will give up sovereignty of the Indian Ocean territory and lease back the vital UK-US Diego Garcia military base - at a cost of billions of pounds to the taxpayer. PM signs Chagos deal - latest updates In a news conference, Prime Minister Sir Keir Starmer said the base is of the \"utmost significance to Britain\", having been used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\", and \"anticipate threats in the Red Sea and the Indo-Pacific\". He said the base was under threat because of Mauritius's legal claim on the Chagos Islands, which has been recognised by multiple international courts. \"If we did not agree this deal, the legal situation would mean that we would not be able to prevent China or any other nation setting up their own bases on the outer islands, or carrying out joint exercises near our base,\" Sir Keir said. \"We would have to explain to you, the British people and to our allies, that we'd lost control of this vital asset. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  Reeves vs Starmer: Inside the 'rift' in Downing Street\n                 \"No responsible government could let that happen, so there's no alternative but to act in Britain's national interest by agreeing to this deal. \"We will never gamble with national security.\" The deal means the UK will lease the base from the Mauritian government over 99 years. Confusion over costs Sir Keir said the average cost per year is £101m but the net overall cost is £3.4bn, not £10bn, and all public sector projects are measured in net costs. However, there is confusion over the government's calculations as the full agreement between the UK and Mauritius reveals the UK will pay: • £165m a year for the first three years;• £120m for years four to 13;• £120m plus inflation for every year after to year 99;• £40m as a one-off to a fund for Chagossians;• £45m a year for 25 years for Mauritian development. If inflation were to remain zero for the next century, this would work out to around £10bn over 99 years. Assuming an average of 2% inflation, Sky News analysis suggests costs could rise as high as £30bn. Downing Street stood by its figures, saying government accounting principles were applied to adjust for long-term costs and the value of the pound today is worth more than the pound in the future. Officials denied suggestions from journalists that was financial sophistry, insisting it was \"standard practice\". Sir Keir said that had he not struck the deal today, Mauritius would have taken the UK to international courts and probably won, with extra penalties implemented. However the Tories - who started negotiations in government - have branded the move a \"surrender tax\". Sovereignty row  The Chagos Archipelago was separated from Mauritius by the UK in 1965, when Mauritius was a British colony. Mauritius gained independence from the UK in 1968 and since then has been trying to claim the archipelago as Mauritian. In the late 1960s, the US asked the UK to expel everyone from the archipelago so they could build a naval support facility on the largest island, Diego Garcia. It is leased to the US but operates as a joint UK-US base. The UK has been under pressure to hand back control of the territory, after the UN and the International Court of Justice sided with Mauritius. The treaty said the deal would \"complete the process of decolonisation of Mauritius\". Tory leader Kemi Badenoch said that \"surrendering\" the Chagos Islands to Mauritius \"is an act of national self-harm\". \"It leaves us more exposed to China, and ignores the will of the Chagossian people. And we're paying billions to do so,\" she said. Reform UK leader Nigel Farage echoed those comments, accusing Sir Keir of caring more about foreign courts \"than Britain's national interest\". 'Deal inherited from Tories' However, Sir Keir said he \"inherited a negotiation in which the principle of giving up UK sovereignty had already been conceded\" by the Tories. He said \"all of the UK's allies\" support the deal, including the US, NATO, Five Eyes and India, and that those who are against it include \"Russia, China, Iran...and surprisingly, the leader of the opposition, and Nigel Farage\". Defence Secretary John Healey, who was also at the news conference, added that the last government failed to strike a deal despite 11 rounds of talks, leaving Labour to \"pick up the challenge\". He said ministers \"toughened the terms and the protections and the control that Britain can exercise through this treaty\". Under the deal's terms, a 24-nautical mile buffer zone will be put in place around the island where nothing can be built or placed without UK consent. The UK will retain full operational control of Diego Garcia, including the electromagnetic spectrum satellite used for communications which counters hostile interference. Marco Rubio, the US Secretary of State, said he welcomed the \"historic agreement\", saying it \"secures the long-term, stable and effective operation of the joint US-UK military facility at Diego Garcia, which is critical to regional and global security\". \"We value both parties' dedication. The US looks forward to our continued joint work to ensure the success of our shared operations,\" he said. The agreement had been due to be signed on Thursday morning but was temporarily blocked by an injunction hours before. A High Court Judge subsequently discharged the injunction at midday."
    },
    {
        "title": "US music agency co-founder among victims in plane crash",
        "description": "Three people have died after a small plane crashed into a US neighbourhood.",
        "url": "https://news.sky.com/story/small-plane-crashes-into-san-diego-neighbourhood-in-direct-hit-to-multiple-homes-13372704",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-san-diego-plane-crash_6924243.jpg?20250522153357",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-22 12:49:00",
        "Headline": "A music agency said three of its employees, including its co-founder, died on the private plane that crashed into a San Diego neighbourhood. About 15 homes caught fire, as well as vehicles, with residents across several blocks evacuated.",
        "Content": " Three people have died after a small plane crashed into a US neighbourhood. Music agency Sound Talent Group said three of its employees, including its co-founder Dave Shapiro, died after being aboard the private aircraft, which went down in San Diego early on Thursday. The total number of deaths remains unknown, but six people were on the plane, according to the Federal Aviation Administration (FAA). The agency didn't name the other two employees after the jet crashed into a neighbourhood of US Navy-owned housing during foggy weather. Mr Shapiro was listed as the owner of the plane and had a pilot's licence, according to the FAA. \"We are devastated by the loss of our co-founder, colleagues, and friends. Our hearts go out to their families and to everyone impacted by today's tragedy,\" the agency said in a statement. Several people were injured while trying to flee the crash just before 4am local time (midnight in the UK) in Murphy Canyon and others were treated for smoke inhalation. \n                  Fourteen arrests in undercover sex trafficking sting at San Diego Comic-Con convention\n                 \n                  Shark attack victim punched it in the face, witness says\n                 \n                  British number one Katie Boulter comes from set down to win San Diego Open\n                 Assistant fire department chief Dan Eddy told reporters that authorities will be investigating whether the aircraft hit a power line. The fire chief added: \"When it hit the street, as the jet fuel went down it took out every single car that was on both sides of the street. \"You can see that every single car was burning down both sides of the street.\" The California crash occurred in the US military's largest housing neighbourhood. The plane appeared to strike at least one home, with around 10 houses and multiple vehicles damaged in the incident. No one required hospital treatment, but homes and buildings in the surrounding area were evacuated as emergency crews responded. \"I can't quite put words to describe what the scene looks like, but with the jet fuel going down the street, and everything on fire all at once, it was pretty horrific to see,\" San Diego police chief Scott Wahl said. The police chief said more than 50 officers were on the scene within minutes of the alarm being raised. At least 100 residents were evacuated to nearby Miller Elementary School. Describing the scene \"like something from a movie\", Mr Eddy earlier told reporters it was foggy at the time of the crash. He said: \"You could barely see in front of you.\" Christopher Moore, who lives one street over from the crash site, said he and his wife were woken by a loud bang and saw smoke when they peered out the window. As they fled the neighbourhood with their two young children, they spotted a car engulfed in flames. Mr Moore said: \"It was definitely horrifying for sure, but sometimes you've just got to drop your head and get to safety.\" Police rescued three husky puppies from one of the homes, while evacuated families were spotted standing in their pyjamas in a car park a few streets away. Many military service members live in the neighbourhood. It is also heavily populated by small civilian and military aircraft. Marine Corps Air Station Miramar, Montgomery-Gibbs Executive Airport and Gillespie Field are nearby. San Diego Police Department (SDPD) earlier confirmed emergency crews were responding to the crash in the neighbourhood of Tierrasanta. Posting on X, a SDPS spokesperson warned people to avoid the area and urged all those who smell jet fuel or find debris to alert the authorities. Evacuations took place in Salmon Street, Sample Street and Sculpin Street. Santo Road southbound was also closed at Aero Drive. The authorities are yet to release details about the plane, but said it was a flight coming in from the Midwest. A flight tracking site listed it as a Cessna Citation II jet that was scheduled to arrive at Montgomery-Gibbs Executive Airport in San Diego from Colonel James Jabara Airport in Wichita, Kansas. Officials at the airport said it just made a fuelling stop in Wichita. The flight originated on Wednesday night in Teterboro, New Jersey, according to FlightAware. The Federal Aviation Administration (FAA) said: \"The number of people on board is unknown at this time. \"The FAA and the National Transportation Safety Board (NTSB) will investigate. The NSTB will lead the investigation and provide any updates.\""
    },
    {
        "title": "Economy will have to be 'strong enough' for U-turn on winter fuel, business secretary says",
        "description": "The economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts, the business secretary has said.",
        "url": "https://news.sky.com/story/economy-will-have-to-be-strong-enough-for-u-turn-on-winter-fuel-business-secretary-says-13372776",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-electoral-dysfunction_6924335.jpg?20250522170523",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-22 15:00:00",
        "Headline": "Sir Keir Starmer said on Wednesday the cut on who receives winter fuel payments could be eased, but did not say when.",
        "Content": " The economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts, the business secretary has said. Jonathan Reynolds, talking to Beth Rigby on the Electoral Dysfunction podcast, also said the public would have to \"wait for the actual budget\" to make an announcement on it. You can listen to the full interview on tomorrow's Electoral Dysfunction podcast. Sir Keir Starmer said on Wednesday he would ease the cut to the winter fuel payment, which has been removed from more than 10 million pensioners this winter after it became means-tested. He and his ministers had insisted they would stick to their guns on the policy, even just hours before Sir Keir revealed his change of heart at Prime Minister's Questions. But Mr Reynolds revealed there is more at play to be able to change the policy.  \"The economy has got to be strong enough to give you the capacity to make the kind of decisions people want us to see,\" he said. \"We want people to know we're listening. \"All the prime minister has said is 'look, he's listening, he's aware of it. \"He wants a strong economy to be able to deliver for people. \"You'd have to wait for the actual budget to do that.\" Read more:Gordon Brown suggests people on top income tax rate should be excluded from winter fuel Chancellor Rachel Reeves has committed to just one major fiscal event a year, meaning just one annual budget in the autumn. Autumn budgets normally take place in October, with the last one at the end of the month. If this year's budget is around the same date it will leave little time for the extra winter fuel payments to be made as they are paid between November and December."
    },
    {
        "title": "Labour say there's been a 'massive increase' in NHS appointments - this begs to differ",
        "description": "\"The target was never particularly ambitious,\" says the Institute for Fiscal Studies (IFS) about Labour's plan to add two million extra NHS appointments during their first year in power.",
        "url": "https://news.sky.com/story/labour-say-theres-been-a-massive-increase-in-nhs-appointments-this-begs-to-differ-13372714",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-nhs-data-and-forensics_6924130.jpg?20250522133836",
        "type": "UK",
        "Author": "Daniel Dunford, senior data journalist, and Sam Coates, deputy political editor",
        "Date Published": "2025-05-22 13:00:00",
        "Headline": "Keir Starmer made slashing NHS waiting times one of his priorities, and his Labour government has already claimed it as one of its biggest achievements so far. But new data tells a different story - and the public aren't noticing an improvement.",
        "Content": "By Daniel Dunford, senior data journalist, and Sam Coates, deputy political editor   \"The target was never particularly ambitious,\" says the Institute for Fiscal Studies (IFS) about Labour's plan to add two million extra NHS appointments during their first year in power. In February, Health Secretary Wes Streeting announced they had achieved the feat early. He recently described the now 3.6m additional appointments achieved in their first eight months as a \"massive increase\". PM signs Chagos deal - politics latest But new data, obtained by independent fact checking charity Full Fact and shared exclusively with Sky News, reveals this figure actually signalled a slowing down in new NHS activity. There was an even larger rise of 4.2m extra appointments over the same period the year before, under Rishi Sunak's government. The data also reveals how unambitious the target was in the first place. We now know two million extra appointments over the course of a year represents a rise of less than 3% of the almost 70 million carried out in the year to June 2024. In the last year under Mr Sunak, the rise was 10% - and the year before that it was 8%. Responding to the findings, Sarah Scobie, deputy director of independent health and social care think tank the Nuffield Trust, told Sky News the two million target was \"very modest\". She said delivering that number of appointments \"won't come close to bringing the treatment waiting list back to pre-pandemic levels, or to meeting longer-term NHS targets\". The IFS said it was smaller than the annual growth in demand pressures forecast by the government. What exactly did Labour promise? The Labour election manifesto said: \"As a first step, in England we will deliver an extra two million NHS operations, scans, and appointments every year; that is 40,000 more appointments every week.\" We asked the government many times exactly how it would measure the pledge, as did policy experts from places like the IFS and Full Fact. But it repeatedly failed to explain how it was defined. Leo Benedictus, a journalist and fact-checker at Full Fact, told Sky News: \"We didn't know how they were defining these appointments. \"When they said that there would be more of them, we didn't know what there would be more of.\" Even once in government, initially Labour did not specify their definition of \"operations, scans, and appointments\", or what the baseline \"extra\" was being measured against. This prevented us and others from measuring progress every month when NHS stats were published. Did it include, for instance, mental health and A&E appointments? And when is the two million extra comparison dating from? Target met, promise kept? Suddenly, in February, the government announced the target had already been met - and ever since, progress on appointments has been a key boast of ministers and Labour MPs. At this point, they did release some information: the definition of procedures that allowed them to claim what had been achieved. They said the target involved is elective - non-emergency - operations excluding maternity and mental health services; outpatient appointments and diagnostic tests.  However, we still did not have a comprehensive baseline to measure the two million increase against. The government data instead relied on a snapshot: comparing the number of appointments carried out from July to November 2024 with the number from July to November 2023, and adjusted them for the number of working days in each period. This did not tell us if the NHS had already been adding appointments under the Conservatives, and at what pace, and therefore whether this target was a big impressive ramping up of activity or, as it turns out, actually a slowing down. Since then, a number of organisations, like Full Fact, have been fighting with the government to release the data. Mr Benedictus said: \"We asked them for that information. They didn't publish it. We didn't have it. \"The only way we could get hold of it was by submitting an FOI request, which they had to answer. And when that came back about a month later, it was fascinating.\" This finally gives us the comparative data allowing us to see what the baseline is against which the government's \"success\" is being measured. Full Fact passed the data to Sky News because it had seen our reporting about how the information published by the NHS in February was not sufficient to be able to assess whether things were getting better or worse. What the government says now We put our findings to the government. A Department of Health and Social Care spokesperson said: \"On entering office last July, the secretary of state [Wes Streeting] was advised that the fiscal black hole meant elective appointments would have to be cut by 20,000 every week. \"Instead, this government provided the extra investment and has already delivered 3.6 million additional appointments - more than the manifesto commitment the British public voted for - while also getting more patients seen within 18 weeks. \"In the nine months since this government took office, the waiting list has dropped by over 200,000 - more than five times as much as it had over the same period the previous year - and also fell for six consecutive months in a row.\" We put this to Jeremy Hunt, Rishi Sunak's chancellor during his last two years as prime minister, and health secretary for six years under David Cameron and Theresa May. He said: \"What these numbers seem to show is that the rate of appointments was going up by more in the last government than it is by this government. That's really disappointing when you look at the crisis in the NHS. \"All the evidence is that if you want to increase the number of people being treated, you need more capacity in the system, and you need the doctors and nurses that are there to be working more productively. \"Instead what we've had from this government is the vast majority of the extra funding for the NHS has gone into pay rises, without asking for productivity in return.\" Edward Argar, shadow health secretary, accused the government of a \"weak attempt […] to claim credit for something that was already happening\". \"We need to see real and meaningful reform that will genuinely move the dial for patients,\" he added. Is the NHS getting better or worse? New polling carried out by YouGov on behalf of Sky News this week also reveals 39% of people think the NHS has got worse over the past year, compared with 12% who think it's got better. Six in 10 people say they do not trust Keir Starmer personally on the issue of the NHS, compared with three in 10 who say they do. That is a better rating than some of his rivals, however. Just 21% of people say they trust Nigel Farage with the NHS, and only 16% trust Kemi Badenoch - compared with 64% and 60% who do not. Ed Davey performs better, with 30% saying they trust him and 38% saying they do not. Ms Scobie of the Nuffield Trust told Sky News \"the government is right to make reducing long hospital treatment waits a key priority […] but much faster growth in activity is needed for the NHS to see a substantial improvement in waiting times for patients.\" The government is correct, however, to point out the waiting list having dropped by more than 200,000 since it's been in office. This is the biggest decline between one July and the following February since current waiting list statistics were first published under Gordon Brown. The percentage of people waiting less than 18 weeks for treatment is also falling for the first time, other than a brief period during the pandemic, for the first time in more than a decade. There is still a long way to go, though. Figures released last week showed the total number of people waiting for NHS treatment in England had risen again in March, following six months of positive progress. The latest figures show 6.25m people waiting for 7.42m treatments (some people are on the list for more than one issue). That means more than one in 10 people in England are currently waiting for NHS treatment. There continues to be a fall in the number who have been waiting longer than a year. It’s now 180,242, down from almost 400,000 in August 2023 and over 300,000 in June 2024, the Conservatives' last month in power. But that number is still incredibly high by historical standards. It remains over 100 times higher than it was before the pandemic. The government has a separate pledge that no more than 8% of patients will wait longer than 18 weeks for treatment, by the time of the next election. Despite improvements in recent months, currently more than 40% wait longer than this. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Starmer's winter fuel cut U-turn claim 'not credible'",
        "description": "Sir Keir Starmer's claim he is U-turning on cutting winter fuel payments for pensioners because he now has the money is not \"credible\", Harriet Harman has said.",
        "url": "https://news.sky.com/story/starmers-winter-fuel-cut-u-turn-claim-not-credible-13372837",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-electoral-dysfunction_6924635.jpg?20250522223106",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-22 16:10:00",
        "Headline": "The prime minister has suggested the government will look at making the winter fuel allowance available to more pensioners - a major change of tune following Labour's disastrous recent elections results.",
        "Content": "Sir Keir Starmer's claim he is U-turning on cutting winter fuel payments for pensioners because he now has the money is not \"credible\", Harriet Harman has said. 👉 Listen to Electoral Dysfunction on your podcast app 👈 The Labour peer, speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, said the prime minister made the move as it was so unpopular with voters. PM signs Chagos deal - politics latest She also said Labour's poor results at the local elections and the Runcorn and Helsby by-election were the \"straw that broke the camel's back\". Sir Keir said on Wednesday he would ease the cut to the winter fuel payment, which has been removed from more than 10 million pensioners this winter after it became means-tested. He and his ministers had insisted they would stick to their guns on the policy, even just hours before Sir Keir revealed his change of heart at PMQs  Baroness Harman said: \"It's always been contested and always been unpopular. \"But the final straw that broke the camel's back was the elections. The council elections and the Runcorn by-election, where the voters were saying, 'this is not the change we voted for'. \"At the end of the day, you cannot just keep flying in the face of what voters - particularly if they're people who previously voted for you - wanted.\" Baroness Harman is unconvinced by Sir Keir's claim he can U-turn because there is more money due to good economic management by the government. \"I don't think that's credible as an argument,\" she said. \"It really is the fact that voters just said 'this is not the change we voted for, we're not going to have this'.\" The challenge for the government now, she said, is deciding who will get the allowance moving forward, when they'll get it, and when it will all be announced. Read more:Ex-PM suggests who should miss out on winter fuel payments Chancellor Rachel Reeves has committed to just one major fiscal event a year, meaning just one annual budget in the autumn. Autumn budgets normally take place in October, with the last one at the end of the month. If this year's budget is around the same date, it will leave little time for the extra winter fuel payments to be made, as they are paid between November and December. Business Secretary Jonathan Reynolds told the Electoral Dysfunction podcast the economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts. He also said the public would have to wait for the budget for any announcement."
    },
    {
        "title": "The 'scary spotlight' on music stars amid Kneecap terror charge",
        "description": "Before the amps are even switched on in Brockwell Park, there's been a lot of noise about who should or shouldn't be performing.",
        "url": "https://news.sky.com/story/the-scary-spotlight-on-music-stars-amid-kneecap-terror-charge-13373097",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kneecap-irish-band_6902809.jpg?20250501172410",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-22 23:58:00",
        "Headline": "As Kneecap court controversy - and one member faces a terror charge - over their political stances, Sky News speaks to artists about the risks of being outspoken at a time the world is so divided.",
        "Content": "\n          Arts and entertainment correspondent\n       Before the amps are even switched on in Brockwell Park, there's been a lot of noise about who should or shouldn't be performing. It's where Irish hip-hop trio Kneecap are set to play their first major show since band member Mo Chara was charged for allegedly displaying a flag in support of the terrorist group Hezbollah at one of their gigs. Before that, there had been calls for festivals to reconsider booking the band over their political stances, and several have done, which prompted artists like Brian Eno, the Mystery Jets and CMAT to sign an open letter accusing Westminster and the British media of a campaign to \"remove Kneecap from the public eye\". They put their names to wording that said \"in a democracy, no political figures… have the right to dictate who does and does not play at music festivals.\" The band have since claimed they're the victims of \"political policing\" designed to silence their views on Gaza. So what's the reality like for artists who are outspoken at a time when the world is so divided? As some of the biggest names in music gathered in London for the Ivors, an annual celebration of songwriting, Self-Esteem - aka Rebecca Lucy Taylor - said the level of scrutiny can be \"terrifying\". 'The problem with the internet' She told Sky News: \"The problem with the internet is you say one thing, which gets scrutinised, and then you shit yourself, you really do… then you're advised not to. And then you're like 'don't advise me not to!' \"You second-guess anything you want to say any more… but any time I do that, I think 'well that's why you've got to say it then'.\" She said it can be frustrating that focus turns on to pop stars' opinions instead of \"the people doing the bad things\". Read more:Why are Kneecap controversial? 'Being a pop artist isn't just about the music' Former Little Mix singer Jade said: \"To be a pop artist these days, it's not just about music, it's: 'What's your political stance?' \"I've always been quite vocal about those things, but in doing so you have even more of a scary spotlight on you, constantly assessing what your thoughts are as a human…it is scary.\" Trinidad-born London artist Berwyn, whose songs depict his struggles with UK immigration, says: \"Silencing freedom of speech… is a road we don't want to walk down. \"I'm not a politician, this is a very complicated issue, but I do absolutely believe in a human's right to express themselves freely.\" But is that freedom of speech dependent on what side you're coming from? 'Unethical investments' Soon, an event called Mighty Hoopla will take place at Brockwell Park as part of its programme of six festivals this summer. Artists performing at that are coming under increased pressure from pro-Palestine groups to quit because it's owned by a company called Superstruct, which has links to an American investment firm called KKR. Critics argue that any KKR-affiliated events should be a red flag to artists as campaigners claim it \"invests billions of pounds in companies\" that do things like \"develop Israeli underground data centres\", and they say it has shares in companies that \"advertise property on illegally occupied land in the West Bank\". 👉 Listen to Sky News Daily on your podcast app 👈 Mighty Hoopla itself has said while it \"cannot control investments made in our parent companies\", it wants to \"state its clear opposition to KKR's unethical investments\". And Superstruct - which puts on over 80 festivals around the world - says while horrified by the crisis in Gaza: \"We are aware that there is a significant amount of debate… around our festivals. \"Our owners, made up of our promoters and several investment firms, support us to achieve the highest standards... fans and artists rightly expect.\" They insist that operationally, Superstruct is independently run and all its \"revenue and profits… remains entirely within our business… towards the ongoing development… of our festivals.\" Read more from Sky News:Kid Cudi says Diddy 'messed with his dog'Bono calls for Israel to be 'released from Netanyahu'Chris Brown posts message as singer is bailed Even deciding where to perform can have political connotations for musicians these days. As Tom Gray, a founding member of the rock band Gomez, now chair of the Ivors, explains: \"The amount of commercial interest required to get a young artist into the public eye means they have to keep their head down a lot and that's a terrible shame. \"It's not just artistic expression, but personal human expression is one of the fundamental things that allows people to feel they have agency.\""
    },
    {
        "title": "UK signs deal to hand over control of Chagos islands",
        "description": "The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius.",
        "url": "https://news.sky.com/story/uk-signs-deal-to-hand-over-control-of-chagos-islands-13372755",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-diego-garcia-chagos_6874792.jpg?20250403110156",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-05-22 14:18:00",
        "Headline": "The deal involves leasing back a crucial military base on Diego Garcia, the largest of the Chagos Islands, for 99 years.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius. It means Britain will give up sovereignty of the Indian Ocean territory and lease back the vital UK-US Diego Garcia military base - at a cost of billions of pounds to the taxpayer. PM signs Chagos deal - latest updates In a news conference, Prime Minister Sir Keir Starmer said the base is of the \"utmost significance to Britain\", having been used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\", and \"anticipate threats in the Red Sea and the Indo-Pacific\". He said the base was under threat because of Mauritius's legal claim on the Chagos Islands, which has been recognised by multiple international courts. \"If we did not agree this deal, the legal situation would mean that we would not be able to prevent China or any other nation setting up their own bases on the outer islands, or carrying out joint exercises near our base,\" Sir Keir said. \"We would have to explain to you, the British people and to our allies, that we'd lost control of this vital asset. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  Reeves vs Starmer: Inside the 'rift' in Downing Street\n                 \"No responsible government could let that happen, so there's no alternative but to act in Britain's national interest by agreeing to this deal. \"We will never gamble with national security.\" The deal means the UK will lease the base from the Mauritian government over 99 years. Confusion over costs Sir Keir said the average cost per year is £101m but the net overall cost is £3.4bn, not £10bn, and all public sector projects are measured in net costs. However, there is confusion over the government's calculations as the full agreement between the UK and Mauritius reveals the UK will pay: • £165m a year for the first three years;• £120m for years four to 13;• £120m plus inflation for every year after to year 99;• £40m as a one-off to a fund for Chagossians;• £45m a year for 25 years for Mauritian development. If inflation were to remain zero for the next century, this would work out to around £10bn over 99 years. Assuming an average of 2% inflation, Sky News analysis suggests costs could rise as high as £30bn. Downing Street stood by its figures, saying government accounting principles were applied to adjust for long-term costs and the value of the pound today is worth more than the pound in the future. Officials denied suggestions from journalists that was financial sophistry, insisting it was \"standard practice\". Sir Keir said that had he not struck the deal today, Mauritius would have taken the UK to international courts and probably won, with extra penalties implemented. However the Tories - who started negotiations in government - have branded the move a \"surrender tax\". Sovereignty row  The Chagos Archipelago was separated from Mauritius by the UK in 1965, when Mauritius was a British colony. Mauritius gained independence from the UK in 1968 and since then has been trying to claim the archipelago as Mauritian. In the late 1960s, the US asked the UK to expel everyone from the archipelago so they could build a naval support facility on the largest island, Diego Garcia. It is leased to the US but operates as a joint UK-US base. The UK has been under pressure to hand back control of the territory, after the UN and the International Court of Justice sided with Mauritius. The treaty said the deal would \"complete the process of decolonisation of Mauritius\". Tory leader Kemi Badenoch said that \"surrendering\" the Chagos Islands to Mauritius \"is an act of national self-harm\". \"It leaves us more exposed to China, and ignores the will of the Chagossian people. And we're paying billions to do so,\" she said. Reform UK leader Nigel Farage echoed those comments, accusing Sir Keir of caring more about foreign courts \"than Britain's national interest\". 'Deal inherited from Tories' However, Sir Keir said he \"inherited a negotiation in which the principle of giving up UK sovereignty had already been conceded\" by the Tories. He said \"all of the UK's allies\" support the deal, including the US, NATO, Five Eyes and India, and that those who are against it include \"Russia, China, Iran...and surprisingly, the leader of the opposition, and Nigel Farage\". Defence Secretary John Healey, who was also at the news conference, added that the last government failed to strike a deal despite 11 rounds of talks, leaving Labour to \"pick up the challenge\". He said ministers \"toughened the terms and the protections and the control that Britain can exercise through this treaty\". Under the deal's terms, a 24-nautical mile buffer zone will be put in place around the island where nothing can be built or placed without UK consent. The UK will retain full operational control of Diego Garcia, including the electromagnetic spectrum satellite used for communications which counters hostile interference. Marco Rubio, the US Secretary of State, said he welcomed the \"historic agreement\", saying it \"secures the long-term, stable and effective operation of the joint US-UK military facility at Diego Garcia, which is critical to regional and global security\". \"We value both parties' dedication. The US looks forward to our continued joint work to ensure the success of our shared operations,\" he said. The agreement had been due to be signed on Thursday morning but was temporarily blocked by an injunction hours before. A High Court Judge subsequently discharged the injunction at midday."
    },
    {
        "title": "Passengers injured after train hits trailer on level crossing near Leominster - as police arrest man",
        "description": "More than a dozen people have been injured after a train hit an agricultural trailer on a level crossing in Herefordshire, according to emergency services.",
        "url": "https://news.sky.com/story/six-injured-after-train-hits-tractor-at-level-crossing-in-leominster-13372677",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-leominster-train-crash_6924246.png?20250522152937",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-05-22 11:54:00",
        "Headline": "Transport for Wales confirmed its 8.30am Manchester Piccadilly-Cardiff Central service hit an \"obstruction\" at a crossing between Ludlow and Leominster.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n  More than a dozen people have been injured after a train hit an agricultural trailer on a level crossing in Herefordshire, according to emergency services. British Transport Police (BTP) said officers were called to the site north of Leominster at 10.40am on Thursday. A man has been airlifted to hospital and a woman has also been taken to hospital. A further 15 people, who were passengers on the train, were assessed by paramedics but discharged at the scene, West Midlands Ambulance Service said. A spokesperson confirmed that nobody from the tractor-trailer required assessment. Police have confirmed that a 32-year-old man from Bromyard has been arrested on suspicion of endangering safety on the railway. Firefighters and officers from West Mercia Police also attended the scene. A spokesperson for Transport for Wales (TfW) confirmed its 8.30am service between Manchester Piccadilly and Cardiff Central hit an \"obstruction\" at a crossing between Ludlow and Leominster. All lines between the Hereford and Craven Arms stations are blocked and trains will not run between the two. Replacement road transport is being put in place and TfW tickets are currently being accepted by Northern, Avanti, GWR and CrossCountry, it said. Disruption is expected to last until the end of the day and a spokesperson for the company advised anyone travelling on Thursday to check before they travel. A spokesperson for West Midlands Ambulance Service said it was \"called to an incident on the railway track at Nordan Farm, Leominster, at 10.46am\". \"On arrival crews found a man who was a passenger on the train, they treated him for non-life threatening injuries before conveying him by air ambulance to Hereford County Hospital,\" they added. \"A woman was also treated for injuries not believed to be serious and conveyed by land ambulance to Hereford County Hospital.\" The Rail Accident Investigation Branch (RAIB) said it had sent a team of inspectors to Leominster \"between a passenger train and an agricultural trailer at a user worked level crossing\", which require people to operate the crossing themselves. \"Our inspectors will gather evidence as part of the process of conducting a preliminary examination and a decision on whether an investigation will be launched will be taken in the coming days,\" the spokesperson added. British Transport Police said its enquiries were ongoing into the full circumstances of the incident."
    },
    {
        "title": "Economy will have to be 'strong enough' for U-turn on winter fuel, business secretary says",
        "description": "The economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts, the business secretary has said.",
        "url": "https://news.sky.com/story/economy-will-have-to-be-strong-enough-for-u-turn-on-winter-fuel-business-secretary-says-13372776",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-electoral-dysfunction_6924335.jpg?20250522170523",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-22 15:00:00",
        "Headline": "Sir Keir Starmer said on Wednesday the cut on who receives winter fuel payments could be eased, but did not say when.",
        "Content": " The economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts, the business secretary has said. Jonathan Reynolds, talking to Beth Rigby on the Electoral Dysfunction podcast, also said the public would have to \"wait for the actual budget\" to make an announcement on it. You can listen to the full interview on tomorrow's Electoral Dysfunction podcast. Sir Keir Starmer said on Wednesday he would ease the cut to the winter fuel payment, which has been removed from more than 10 million pensioners this winter after it became means-tested. He and his ministers had insisted they would stick to their guns on the policy, even just hours before Sir Keir revealed his change of heart at Prime Minister's Questions. But Mr Reynolds revealed there is more at play to be able to change the policy.  \"The economy has got to be strong enough to give you the capacity to make the kind of decisions people want us to see,\" he said. \"We want people to know we're listening. \"All the prime minister has said is 'look, he's listening, he's aware of it. \"He wants a strong economy to be able to deliver for people. \"You'd have to wait for the actual budget to do that.\" Read more:Gordon Brown suggests people on top income tax rate should be excluded from winter fuel Chancellor Rachel Reeves has committed to just one major fiscal event a year, meaning just one annual budget in the autumn. Autumn budgets normally take place in October, with the last one at the end of the month. If this year's budget is around the same date it will leave little time for the extra winter fuel payments to be made as they are paid between November and December."
    },
    {
        "title": "'Pregnant women and babies evacuated' after fire at Bristol maternity hospital",
        "description": "Pregnant women and babies were reportedly evacuated from a Bristol city centre maternity hospital following a fire on the roof of the building.",
        "url": "https://news.sky.com/story/pregnant-women-and-babies-evacuated-after-fire-at-bristol-maternity-hospital-13372848",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bristol-fire_6924443.jpg?20250522190359",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-22 16:20:00",
        "Headline": "Footage shared on social media showed a huge plume of black smoke billowing from St Michael's Hospital on Southwell Street this afternoon.",
        "Content": "Pregnant women and babies were reportedly evacuated from a Bristol city centre maternity hospital following a fire on the roof of the building. Black smoke was seen billowing from St Michael's Hospital after the blaze broke out at around 4:30pm today. Footage shared on social media showed flames on the roof of the building on Southwell Street. Pregnant women and babies had to evacuate the hospital as firefighters tackled the blaze, according to reports. Avon Fire and Rescue confirmed it had responded to a fire on Southwell Street in Bristol and encouraged members of the pubic to \"avoid the area while we deal with the incident\". The fire service confirmed at around 5:25pm that the fire had been \"safely extinguished\" and its cause \"will be investigated\". Avon and Somerset Police had confirmed its officers were supporting firefighters at the scene. The force urged people to avoid the area \"if at all possible\". Read more from Sky News:Fresh appeal over 1973 murder of 18-year-oldPassengers injured after train hits trailer Professor Stuart Walker, hospital managing director at University Hospitals Bristol and Weston NHS Foundation Trust, said: \"Following a fire incident at St Michael's Hospital this afternoon, we can confirm that the fire has safely been extinguished. \"Thank you to our amazing staff who worked closely with the fire service to partially evacuate the hospital. \"The hospital, including the delivery suite, has now reopened to women who need to access our services and people with appointments tomorrow should attend as planned.\""
    },
    {
        "title": "Kate names HMS Glasgow by smashing bottle of whisky against its hull",
        "description": "The Princess of Wales has smashed a bottle of whisky against the hull of a new Royal Navy warship as she officially named it HMS Glasgow.",
        "url": "https://news.sky.com/story/kate-names-hms-glasgow-by-smashing-bottle-of-whisky-against-its-hull-13372780",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kensington-palace-princess-of-wales_6924232.jpg?20250522152122",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-22 14:58:00",
        "Headline": "The Prince and Princess of Wales attended the naming ceremony which took place on the River Clyde.",
        "Content": " The Princess of Wales has smashed a bottle of whisky against the hull of a new Royal Navy warship as she officially named it HMS Glasgow. Kate pressed a button triggering an arm holding the single malt which crashed into the grey stealth-like vessel during the ceremony. Later at a reception, the Prince of Wales said of the warship: \"It's massive, I can see that's where the future is going. \"It's quite impressive, it's a hell of a piece of kit - screams UK power.\" HMS Glasgow is the first of eight Type 26 anti-submarine frigates to be built in Glasgow. The princess, who was wearing a navy blue outfit with white details and a matching hat, said at the event on the River Clyde: \"I have the pleasure to name this ship HMS Glasgow, may God bless her and all who sail on her.\" Smashing a bottle to name a ship is a centuries-old tradition that is believed to bring the vessel good luck. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  The 'scary spotlight' on music stars amid Kneecap terror charge\n                 It is usually done with champagne but can sometimes be carried out with a bottle of whisky instead. In 2014, Queen Elizabeth II christened HMS Queen Elizabeth in Rosyth Dockyard by smashing a bottle of single malt whisky to reflect the role Scotland played in its construction. Kate was joined by Prince William for the naming ceremony held at the ship's allotted place on the Clyde, where the warship's design and build was led by BAE systems. Simon Lister, BAE Systems managing director, told those gathered for the ceremony: \"In a world that continues to be volatile, we cannot underestimate the importance of this ship and the work we are doing here.\" Read more from Sky News:Israel blames Starmer over killingsInside hospital saving Haiti's malnourished childrenDoctors and teachers offered 4% pay rise Royal correspondent In some ways it still feels like a rare moment to see the Princess of Wales speaking centre stage like this. \n Since she returned to work after her cancer diagnosis, this was probably her biggest crowd yet.\n\n She stepped up to address hundreds of workers as sailors and family members had also gathered for the naming ceremony.\n From those who help construct the ship to those who will sail on board, the emphasis was on the community that HMS Glasgow represents. Prince William was with Kate to help celebrate that and what it means for the UK.  We know that the royals have been instrumental recently in highlighting Britain's military capabilities.  \nThe pictures from today, and the prince's off-the-cuff comments that the ship \"screams UK power\" are another gift to those in Whitehall who want to show the UK is ready to meet the geopolitical challenges of today.\n Watching the moment were dozens of BAE Systems staff and their families and senior Royal Navy officers who applauded as the whisky bottle broke, an exclusive single malt made by the Clydeside Distillery. A contribution from each bottle sold will be donated to HMS Glasgow's chosen charity, Place2Be, supporting children's mental health in the Glasgow area, which Kate supports as patron. The ceremony began with a royal salute from the ship's company for William and Kate, also known by their Scottish titles the Duke and Duchess of Rothesay. Second Sea Lord Vice Admiral Sir Martin Connell thanked the royal couple for their support and all those involved in the Type 26 endeavour. He also hailed the latest ship as \"a pure-bred anti-submarine warfare platform, setting the standard for naval warfare\", ready to \"meet the global and geopolitical challenges of today\". The second sea lord added: \"HMS Glasgow and her class represent the next chapter of naval innovation, safeguarding the UK's interests and contributing to national prosperity.\""
    },
    {
        "title": "Kneecap star arrives at surprise gig with tape over his mouth after terror charge",
        "description": "Irish-language rap group Kneecap have performed a surprise London show, with one of its members showing up with tape over his mouth after he was charged with a terror offence.",
        "url": "https://news.sky.com/story/kneecap-announces-surprise-show-after-member-charged-with-terror-offence-13372829",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kneecap-ireland-gaza_6924697.jpg?20250523000359",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-22 15:44:00",
        "Headline": "One of the three rappers, Liam O'Hanna, was charged with displaying a flag in support of Hezbollah, at a concert in London, the Metropolitan Police said.",
        "Content": "Irish-language rap group Kneecap have performed a surprise London show, with one of its members showing up with tape over his mouth after he was charged with a terror offence. Liam O'Hanna, or Liam Og O Hannaidh, was charged with displaying a flag in support of Hezbollah, a proscribed organisation, at a concert in London last November, the Metropolitan Police said on Wednesday. Just hours later, Kneecap announced on their Instagram account \"we're back\", adding they would perform at the 100 Club on Oxford Street, London, on Thursday night. The post also included a quote by former Sex Pistols vocalist John Lydon, who told ITV's Good Morning Britain the rap trio \"maybe (...) need a bloody good kneecapping\" after footage of the band allegedly calling for the deaths of MPs emerged. O'Hanna arrived at the 100 Club ahead of the gig and was later seen going on stage with tape covering his mouth. He also joked about being careful with what he said before thanking his lawyer. It came after at least three police officers were seen walking into the venue at around 7.35pm on Thursday evening. \n                  Kneecap say terror charge is bid to 'silence' them\n                 \n                  Vandals damage Tesla cars in Belfast\n                 \n                  Northern Ireland shooting victim 'denied travel to Scotland for treatment'\n                 A short queue had formed outside before the doors opened five minutes earlier, including one man in a band T-shirt. The band said on X that the event sold out in 90 seconds, with 2,000 people on the waiting list. Kneecap apologised to the families of murdered MPs last month, but said footage of the incident at their concert had been \"exploited and weaponised\", adding that they \"never supported\" Hamas or Hezbollah. The rappers had gigs cancelled after the footage emerged and politicians pushed for Kneecap to be dropped from the Glastonbury Festival line-up, with Tory leader Kemi Badenoch calling for Kneecap to be banned. The group from Belfast in Northern Ireland is still set to headline Wide Awake Festival in south London on Friday. Read more from Sky News:Passengers injured after train hits trailer on level crossingPublication of final Letby inquiry report pushed back In response to the charge, the group said in a social media statement: \"14,000 babies are about to die of starvation in Gaza, with food sent by the world sitting on the other side of a wall, and once again the British establishment is focused on us. \"We deny this 'offence' and will vehemently defend ourselves, this is political policing, this is a carnival of distraction. \"We are not the story, genocide is, as they profit from genocide, they use an 'anti-terror law' against us for displaying a flag thrown on stage. A charge not serious enough to even warrant their crown court, instead a court that doesn't have a jury. What's the objective?\" The charge came after counter-terror police assessed a video said to be from a Kneecap concert. In the footage, O'Hanna is allegedly displaying a flag in support of Hezbollah at the O2 Forum in Kentish Town, London, on 21 November last year. Officers from the Met's Counter Terrorism Command were made aware of a video circulating online on 22 April and an investigation led to the Crown Prosecution Service authorising the charge, the force said. O'Hanna - who performs under the stage name Mo Chara - is due to appear at Westminster Magistrates' Court on 18 June."
    },
    {
        "title": "Publication date of final Lucy Letby inquiry report pushed back to early 2026",
        "description": "A public inquiry's final report into how former nurse Lucy Letby was able to commit her crimes will now be published early next year.",
        "url": "https://news.sky.com/story/publication-date-of-final-lucy-letby-inquiry-report-pushed-back-to-early-2026-13372695",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-check-before-use-lucy-letby_6253531.jpg?20230904163842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-22 12:30:00",
        "Headline": "Lady Justice Thirlwall, the chair of the inquiry, is expected to send out \"warning letters\" from September 2025, with the final report published in early 2026.",
        "Content": "A public inquiry's final report into how former nurse Lucy Letby was able to commit her crimes will now be published early next year. Letby, 35, was found guilty of murdering seven children and attempting to murder seven more between June 2015 and June 2016 while working in the neonatal unit of the Countess of Chester Hospital in Chester. She is serving 15 whole-life orders after she was convicted at Manchester Crown Court. Letby is Britain's most prolific serial child killer of modern times and her case prompted the government to order an inquiry into how the killings went undetected. The inquiry is also examining the hospital's response to concerns raised about Letby before her arrest. The report was previously expected to be released this November. A statement published on Thursday on the inquiry's website said it has written to \"core participants\" with an update on the progress of the final report. \n                  Two motorbike riders killed in 11-bike crash during British Supersport race at Oulton Park\n                 \n                  Warrington mother who forged paternity test to trick ex-partner is spared jail\n                 \n                  Chester: Mercedes driver arrested after collision involving tractor that crashed into houses\n                 Lady Justice Thirlwall, the chair of the inquiry, is now expected to send out \"warning letters\" from September 2025, with the final report published in early 2026. Read more from Sky News:Chemical castration for sex offendersJudge clears way for Chagos Islands deal Warning letters are sent ahead of an inquiry being published to anyone \"who may be subject to significant or explicit criticism in an inquiry report\", according to the website. \"This must be done in advance of the inquiry's report being published and allow a reasonable opportunity to respond,\" it said. Prominent figures like senior Conservative MP David Davis have called for a retrial in Letby's case, saying her conviction was \"built on a poor understanding of probabilities\" and lacked \"hard evidence\". In February, an international panel of neonatologists and paediatric specialists told reporters that poor medical care and natural causes were the reasons for the collapses and deaths. Their evidence has been passed to the Criminal Cases Review Commission (CCRC), which investigates potential miscarriages of justice, and Letby's legal team hopes her case will be referred back to the Court of Appeal. In March, Letby asked for the Thirlwall Inquiry to be suspended while she attempted to appeal her case but that request was denied."
    },
    {
        "title": "Israeli embassy shooting suspect 'fired repeatedly after victims hit the ground'",
        "description": "The man suspected of shooting dead two Israeli embassy workers in Washington DC leaned over and fired at them repeatedly after they fell to the ground, the FBI has said.",
        "url": "https://news.sky.com/story/israeli-embassy-shooting-suspect-fired-repeatedly-after-victims-hit-the-ground-13373006",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-yaron-lischinsky-sarah-milgrim_6924053.jpg?20250522122801",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-22 21:08:00",
        "Headline": "The deaths of Yaron Lichinsky and Sarah Lynn Milgrim saw Benjamin Netanyahu accuse Keir Starmer, Emmanuel Macron and Mark Carney of fuelling antisemitism, having threatened \"concrete action\" against Israel over the war in Gaza.",
        "Content": "The man suspected of shooting dead two Israeli embassy workers in Washington DC leaned over and fired at them repeatedly after they fell to the ground, the FBI has said. Elias Rodriguez, 31, has been charged with murdering Sarah Milgrim and her boyfriend Yaron Lischinsky, after they left an event at the Capital Jewish Museum on Wednesday night. Israeli PM attacks Starmer - latest updates Footage has showed Rodriguez, from Chicago, chanting \"free, free Palestine\" as he was arrested. It later emerged Mr Lischinsky had bought a ring and planned to propose to Ms Milgrim. Authorities are investigating the killings as both a hate crime against the Jewish community and terrorism.  'I did it for Gaza' It comes as the FBI has said in a charging document on Thursday that surveillance footage shows how Ms Milgrim and Mr Lischinsky died. Rodriguez is allegedly seen passing the couple after they left the museum before shooting them in the back. The FBI says the footage then shows him leaning over the couple and firing at them several more times after they fell to the ground. The video then shows Ms Milgrim attempting to crawl away before \"(Rodriguez) followed behind her and fired again\", the charging document says. The suspected gunman is then accused of reloading his weapon and firing at Ms Milgrim as she sat up. According to the charging document, Rodriguez then jogged to the museum and once inside asked to speak to a police officer before stating that he \"did it\" and that he was unarmed. He is then said to have told police: \"I did it for Palestine, I did it for Gaza, I am unarmed.\"  Suspect 'expressed admiration' for fatal protest The court document also states that 21 expended 9mm bullet cases were found at the scene and the gun was slide-locked - meaning it was empty of ammunition. An empty gun magazine was also recovered from the scene. The FBI says it has obtained travel records which show Rodriguez flew from Chicago's O'Hare International Airport to the Reagan National in Washington DC on Tuesday with the gun in his checked baggage. Rodriguez had bought the weapon in the state of Illinois on 6 March 2020, according to the charging document. The FBI has said that while Rodriguez was in custody he \"expressed admiration\" for a US Air Force member who set himself on fire in front of the Israeli embassy in Washington DC on 25 February 2024. Aaron Bushnell died in the apparent act of protest against the war in Gaza. Rodriguez also told police he bought a ticket to the museum around three hours before the event that was attended by Ms Milgrim and Mr Lischinsky. Read more:Why Trump will worry about attacker being glorified  During a brief court appearance at the E. Barrett Prettyman Federal Courthouse in Washington DC today, Rodriguez was charged with two counts of first degree murder and with the murder of foreign officials. He has also been charged with causing the death of a person through the use of a firearm and discharge of a firearm during a crime of violence. Rodriguez was told he could face life in prison or the death penalty if he is found guilty. He remained calm throughout the hearing, paying attention to the proceedings throughout and confirmed that he is asking the court to appoint an attorney on his behalf. He will next appear at a federal court in Washington DC on 18 June. Murdered couple 'were perfect for each other' Meanwhile, Ms Milgrim's father, Robert, says he feared his daughter might be in danger when he saw news alerts of a fatal shooting in Washington DC. Ms Milgrim's mother Nancy opened a phone locator app and saw Ms Milgrim was at the Capital Jewish Museum. \"Shortly after that, the Israeli ambassador called us on my wife's phone,\" Mr Milgrim told Sky News' partner network NBC News, fighting back tears. He added that it was the ambassador who told them Mr Lischinksy had bought a ring and was planning to propose to Ms Milgrim. \"They were perfect for each other, he said. Mr Milgrim continued: \"They just brought us joy, and her memory, which is a blessing, will continue to bring us joy - but it's not the same as her not being here.\""
    },
    {
        "title": "Trump team will worry about Washington attacker being glorified",
        "description": "There are multiple layers to this shocking act of extreme violence.",
        "url": "https://news.sky.com/story/concerns-israeli-embassy-staff-shooting-could-be-glorified-in-same-way-as-luigi-mangione-13372498",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-washington-dc-israeli-embassy-staff_6923835.jpg?20250522080733",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-05-22 06:57:00",
        "Headline": "There will be immediate questions for the US authorities about the security of Israeli diplomats. The shooting happened in the downtown area of DC, not far from the FBI field office and the FBI headquarters.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  There are multiple layers to this shocking act of extreme violence. The presence of the US attorney general at a midnight news conference is a clear indication of the Trump administration's shock and swift reaction. Pam Bondi had already visited the scene of the attack. The president himself was quick to comment on social media, calling it out as antisemitism and saying: \"Hatred and Radicalism have no place in the USA.\" Israeli embassy staff shooting suspect 'shouted free Palestine' - follow live updates  There will be immediate questions for the US authorities about the security of Israeli diplomats. The shooting happened in the downtown area of DC, not far from the FBI field office and the FBI headquarters. The two victims are understood to be junior aides and so probably not considered particular targets. But the shooting will prompt a fresh look at diplomatic security arrangements. A video has emerged online said to show the gunman calmly shouting \"free free Palestine\" as he was detained by museum security.  Pro-Palestinian protests have been intense on college campuses, outside embassies and elsewhere; the Israeli embassy in Washington has been a particular focus of protesters. Last year, a 25-year-old active duty US airman immolated himself in front of the Israeli embassy in Washington to protest the war in Gaza. Israel's diplomatic relations with close allies, including the UK, France and others, have become increasingly strained over the methods used in its continuing war in Gaza. Read more:Sex offenders could face chemical castrationMeet staff crossing gang lines to battle malnutrition in HaitiTrump ambushes South African president at White House meeting Authorities will also be braced for how this incident plays in the days ahead. There will be a concern within the Trump administration that this man's actions will be given some glorification in parts of society, mainly online, in the same way Luigi Mangione became not just infamous but famous for allegedly shooting dead a healthcare executive in protest of corporate greed. Expect prompt condemnation from the White House of any such glorification.  There is also a deeply tragic twist to this shooting. The two young victims were a couple and were due to travel to Jerusalem in the days ahead to become engaged. I've been in touch with contacts at the Israeli embassy where the entire team is in shock and reeling at the loss of two of their own on the streets of Washington."
    },
    {
        "title": "Netanyahu launches attack on Starmer, Macron and Carney after embassy shooting",
        "description": "Benjamin Netanyahu has blamed Sir Keir Starmer, Emmanuel Macron and Mark Carney for fuelling antisemitism after two Israeli embassy workers were shot dead in Washington DC.",
        "url": "https://news.sky.com/story/netanyahu-launches-attack-on-starmer-macron-and-carney-after-embassy-shooting-13372966",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/5234a1998c7cf98774e58729718fcf8d956da80b188a2ca5484387ad5417f5d1_6924417.jpg?20250522222244",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-22 19:47:00",
        "Headline": "Israeli embassy workers Yaron Lischinsky and Sarah Lynn Milgrim were shot dead by Elias Rodriguez, who shouted \"free, free Palestine\" as he was arrested.",
        "Content": " Benjamin Netanyahu has blamed Sir Keir Starmer, Emmanuel Macron and Mark Carney for fuelling antisemitism after two Israeli embassy workers were shot dead in Washington DC. Mr Netanyahu said the leaders of the UK, France and Canada are \"on the wrong side of humanity and (...) history\" after they threatened \"concrete action\" against Israel this week if it continues its \"egregious\" military operations in Gaza. He linked the criticism of Israel's renewed military offensive in the enclave to the shooting outside the Capital Jewish Museum in Washington DC last night. The shooter, named as 31-year-old Elias Rodriguez from Chicago, Illinois, told a witness that he \"did this for Gaza\" before shouting \"free, free Palestine\" as he was being detained.  The two victims, Yaron Lischinsky and Sarah Lynn Milgrim, worked at the Israeli embassy and had attended an event for young Jewish professionals at the museum before they were shot dead. Israel's foreign minister Gideon Sa'ar called the shooting a \"direct result of antisemitic enticement\" that is \"absolutely toxic and has been used across the world\" since the 7 October 2023 attacks by Hamas. Mr Sa'ar said there is a \"direct line\" between those speaking against Israel's actions in Gaza, which he calls \"blood libels\", and the killings in Washington DC. \n                  Bono calls for Israel to be 'released from Benjamin Netanyahu' in plea to 'stop war'\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Is the Middle East Trump's comfort zone?  \n                 \"This incitement is also done by leaders and officials of many countries and international organisations, especially from Europe,\" he said. The term dates back to the Middle Ages when Jewish people were falsely accused of using the blood of Christians and non-Jewish children for religious rituals such as Passover. This was then used as justification for deadly violence against Jewish people. The term, while highly contentious and offensive to many, is now used to describe antisemitism or violence against Jewish people, which the perpetrators claim is justified by Israel's war against Hamas in Gaza. Mr Netanyahu echoed those statements, describing the shootings as the \"terrible price of antisemitism\" and \"rampant incitement against the State of Israel\". \"Blood libels against the Jewish state cost blood,\" he said in his statement. Amichai Chikli, Israel's diaspora minister, also accused the leaders of the UK, France and Canada of \"emboldening the forces of terror\". In a post on X, he said those who give \"backing to this hatred - whether through appeasement, double standards, or silence,\" must be held to account. Mr Chikli added: \"French President Emmanuel Macron, British Prime Minister Keir Starmer, and Canadian Prime Minister Mark Carney have all, in different ways, emboldened the forces of terror through their failure to draw moral red lines. \"This cowardice has a price - and that price is paid in Jewish blood.\" Israeli diplomats have since distanced themselves from the comments by Mr Chikli. A French foreign ministry spokesperson has since rejected the claim that European nations bear blame for the attack as \"completely outrageous and completely unjustified\". \"France has condemned, France condemns and France will continue to condemn, always and unequivocally, any act of antisemitism,\" the spokesman told AFP. Read more about the shooting:Rodriguez accused Israel of 'atrocities' in GazaTrump team will worry about shooter being glorified In response to the shooting, Sir Keir said he \"thoroughly condemns\" the incident and that \"antisemitism is an evil we must stamp out wherever it appears\". Mr Macron also posted about the \"antisemitic attack\", offering his condolences to the families and loved ones of the victims."
    },
    {
        "title": "Washington suspect told witness he 'did this for Gaza' in frenzied moments after Israeli embassy workers shot dead",
        "description": "Witnesses have told Sky News of the moments after a man shot two Israeli embassy staff members outside a Jewish museum in Washington DC.",
        "url": "https://news.sky.com/story/washington-suspect-told-witness-he-did-this-for-gaza-in-frenzied-moments-after-israeli-embassy-workers-shot-dead-13372605",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elias-rodriguez-shooting_6923893.jpg?20250522111833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-22 09:59:00",
        "Headline": "The suspect, named as Elias Rodriguez by police, shot at a group of four people just over a mile from the White House and then chanted a pro-Palestinian slogan in custody.",
        "Content": " Witnesses have told Sky News of the moments after a man shot two Israeli embassy staff members outside a Jewish museum in Washington DC. Yaron Lischinsky and Sarah Lynn Milgram, a couple who were about to become engaged, were shot dead as they left the Annual Young Diplomats reception at the Capital Jewish Museum in the US capital. Follow live updates here  The suspect, named as Elias Rodriguez by police, shot at a group of four people just over a mile from the White House and then chanted a pro-Palestinian slogan in custody. The event organiser told Sky News she handed the suspect water, mistakenly believing him to be an \"innocent bystander\".  Jojo Drake Kalin said the event was wrapping up when she headed to the lobby to find \"commotion and a frenzy\" but at that time, no one was aware two people had lost their lives. \"The gunshots were heard, so security started locking the doors and that is when I saw who I now know is the... murderer of this Israeli-Jewish couple,\" she said. Analysis: Trump team will worry about Washington attacker being glorified Ms Drake Kalin didn't find out until \"much later\" who she was actually talking to. \"I see him [and] he seems very distraught. I now understand it's because he killed two people point-blank. [I] offered him water, he accepted,\" she said. \"The second I've handed him water, he whips out his keffiyeh [a scarf] and yells 'Free Palestine' and then he's subdued by the officers on scene.\" Ms Drake Kalin said the event was themed around \"bridge-building\" between Israeli and Palestinian communities. She called it \"painfully ironic\" that someone came in with \"such hate and destruction\", considering the event's theme.  Another witness, John Elleson, cried as he told Sky News correspondent Ashish Joshi what he saw. \"A guy came up and... looked like [he had a] gun, I couldn't tell what it was, but I heard it afterwards, the shots, and he shot this young couple,\" he said. \"He ran inside and yelled something. \"It was terrible. It was terrible.\" Another eyewitness, Katie Kalisher, said it was around 9.07pm when she heard gunshots. \"Then a man comes in. He looks really distressed and people are talking to him and trying to calm him down,\" she said. \"Eventually, he comes over to where I was and we were like, 'Do you need any water?', 'Are you okay?'\" Ms Kalisher said the suspect asked her what kind of museum he was in and when she replied, \"It's a Jewish museum,\" he said: \"Do you think that's why they did this?\" She told him she didn't think so but he then reached into his bag and pulled out a keffiyeh. \"[He] says, 'I did it. I did this for Gaza' - and just starts shouting 'free Palestine' and that's when the police came in and arrested him,\" said Ms Kalisher. The reaction to the shooting has been one of shock, with President Donald Trump condemning the \"horrible killings\" which he said were \"based obviously on antisemitism\". Israeli Prime Minister Benjamin Netanyahu said his heart ached for the families of the victims, \"whose lives were cut short in a moment by an abhorrent antisemitic murderer\". Earlier, an Israeli minister accused the leaders of the UK, France and Canada of \"emboldening the forces of terror\" after the three countries threatened \"concrete action\" against Israel if it continues its \"egregious\" military operations in Gaza. Israeli diplomats have since distanced themselves from the minister's comments."
    },
    {
        "title": "Putin's Stalin revival hits a new level - with his crimes out of sight",
        "description": "The Moscow metro is a sight to behold.",
        "url": "https://news.sky.com/story/putins-stalin-revival-hits-a-new-level-with-his-crimes-out-of-sight-13372954",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russia-stalin-putin_6924673.jpg?20250522230433",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-05-22 19:41:00",
        "Headline": "At the central Taganskaya station, a new statue has been unveiled. It is of one of Russia's most well-known and controversial leaders, Joseph Stalin, a man who killed millions. Some have welcomed the monument, while others have criticised it.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  The Moscow metro is a sight to behold. The gilded interiors of its cavernous stations have the opulence of a baroque palace. But amid the mosaics and chandeliers, there is a new monument turning heads - a life-sized statue of Joseph Stalin. The Soviet dictator was responsible for the deaths of millions of innocent people, in purges, famines and his infamous gulag labour camps. But there's no mention of that on the new sculpture at the central Taganskaya station. Instead, he's depicted as a leader who was loved by his people - a crowd of adoring workers and their children are reaching out towards him in adoration. It was described as a \"gift\" to passengers by the capital's metro system to mark its 90th anniversary. Behind a crowd of selfie-snapping passengers Some Muscovites have accepted it with open arms. At Stalin's feet, there is a pile of red carnations, and in front swarms a rolling crowd of selfie-snapping passengers. \"It's excellent.\" gushes Olga. \"History of art, culture, significance, beauty.\" For Denis, it's \"the right decision\". \"This is the history of our state,\" he says. But as well as flowers, there is fury at what appears to be Russia's latest attempt to rehabilitate the tyrant. \"What were they thinking?!\" asks Svetlana, incredulous. \"How many died under his leadership? And suddenly he appears here, this bloodsucker. How is this possible?!\" \"We should remember and honour some of his deeds,\" believes Oleg. \"But to put him like this is disrespectful. He did a lot of bad things for the Soviet people.\" Stalin's creeping return under Putin The sculpture is a replica of one that first appeared in 1950, three years before Stalin's death, in honour of his role in the Soviet Union's defeat of Nazi Germany in the Second World War. It was removed in the 1960s during the period of de-Stalinisation, which sought to destroy his cult of personality. But under Vladimir Putin's rule, the dictator has been gradually reappearing. It's mostly been on a small scale, in towns well outside the capital. A statue so prominent and so central is a first. Read more:Former Ukrainian politician shot deadKremlin 'gleeful' after Trump's call to PutinUkraine-Russia talks revealed a stark reality A historical rehabilitation? \"The trend comes down to the idea of ​the greatness of the state,\" says Yan Rachinsky, a human rights activist who works to expose Stalin's crimes at the Moscow branch of Memorial, a renowned rights group that now operates on a local level after the closure of its international arm. \"For the current government, the main thing is the state. The state is sacred, the state is above everything, the state is infallible. That is why criticism of Stalin is constantly decreasing.\" Russia's current leader has previously condemned Stalin's repressions. But he's also said the country shouldn't be made to feel guilty about its past. \"Putin's old statement that one should be proud of history - that's it,\" says Mr Rachinsky. \"Everything that prevents us from being proud of history fades into the shadows.\" It certainly feels that way, looking at the statue. Stalin's historical horrors are out of sight, and seemingly, out of mind."
    },
    {
        "title": "Why Trump's evidence about the killing of South African farmers is inaccurate",
        "description": "Donald Trump put his South African counterpart Cyril Ramaphosa on the spot with a list of claims and video clips when the pair met in the Oval Office on Wednesday.",
        "url": "https://news.sky.com/story/why-trumps-evidence-about-the-killing-of-south-african-farmers-is-inaccurate-13372763",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-south-africa-trump_6924249.png?20250522153140",
        "type": "World",
        "Author": "Sophia Massam, junior digital investigations journalist",
        "Date Published": "2025-05-22 14:29:00",
        "Headline": "President Trump ambushed South African counterpart Cyril Ramaphosa with claims of violence against white farmers. But his evidence is a collection of inaccuracies. ",
        "Content": "By Sophia Massam, junior digital investigations journalist  Donald Trump put his South African counterpart Cyril Ramaphosa on the spot with a list of claims and video clips when the pair met in the Oval Office on Wednesday. But multiple pieces of evidence that President Trump used to support his claims are inaccurate. One video the White House played showed lines of white crosses alongside a road. Mr Trump told President Ramaphosa that the footage showed burial sites of more than 1,000 white farmers in South Africa. The clip appears to originate from a YouTube video from 2020 showing crosses lining the P39-1 road near Newcastle in the east of South Africa. The caption of the video, which was filmed in KwaZulu-Natal province, explains that the crosses are a memorial for murdered farm workers after two farmers Glen and Vida Rafferty had been killed. There is no indication that the crosses mark where the deceased have been buried or that each cross represents a white farmer. \n                  White South African farmer elated Donald Trump grilled his president\n                 \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Cyril Ramaphosa sworn in as South African president - despite his ANC party losing majority\n                 Satellite map imagery from 2023 shows the crosses are no longer there. Local reporting at the time quotes attendants of the memorial as saying the crosses are a show of support not specifically for white farmers but for people from all walks of life who were concerned about farm murders. White crosses have been used as a symbol of commemoration for the murder of farmers in South Africa for years. The Witkruis Monument in the north of the country displays dozens of white crosses as a tribute to farmer workers who have been killed. Read more from Data and Forensics:What aid has entered Gaza - and where is it going?NHS waiting list rises for first time in seven months Other parts of the evidence presented by Mr Trump were also incorrect. At one point, while talking about the deaths of white farmers in South Africa, Mr Trump held up a printed-out image of a blog called 'American Thinker'. The blog picture is taken from a February 2025 YouTube video of Red Cross workers in the Democratic Republic of Congo. Mr Trump also played videos of people he said were officials promoting the killing of white farmers. The videos were of rallies or speeches from opponents of Mr Ramaphosa's ANC party, which is currently in power. Many of these videos show Julius Malema, the leader of the black nationalist and communist Economic Freedom Fighters (EFF) party.  The EFF are not a mainstream party and are not officials as Mr Trump claimed. Mr Ramaphosa responded to Mr Trump, saying: \"Our government policy is completely against what he [Malema] was saying.\" He continued that \"they [the EFF] are a small minority party, which is allowed to exist according to our constitution\". These claims were made as part of President Trump's allegation that white people in South Africa are facing a high level of race-based violence. \"We have many people that feel they're being persecuted, and they're coming to the United States. So we take from many... locations, if we feel there's persecution or genocide going on,\" the US president said, referring specifically to white farmers.  South Africa has rejected the allegation that white people are disproportionately targeted by crime. The country's police data does not give race-based crime statistics. Police data from April 2020 to March 2024 showed 225 people were killed on farms in South Africa. Crime data suggests 98,115 murders between 2020 and 2024, of which killings on farms are a very small proportion, around 0.2%.  The accuracy of crime data in South Africa has been questioned by academic experts, as farm murders are not consistently recorded in official data. In response to a request from Sky News to comment, a White House spokesperson disputed what they called the characterisation of the president's very real evidence regarding the persecution of Afrikaners as \"inaccurate\". Earlier this month, President Trump offered refuge to a small number of white South Africans. In March, the South African ambassador to the US Ebrahim Rasool was expelled after American secretary of state Marco Rubio accused him of being a \"race-baiting politician\" who hates President Trump. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "White South African farmer elated Donald Trump grilled his president",
        "description": "\"It was a whipping!\" says Wannie Scribante, a small-scale white farmer in South Africa's North West province.",
        "url": "https://news.sky.com/story/white-south-african-farmer-elated-donald-trump-grilled-his-president-13372879",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elbagir-wannie-scribante_6864457.png?20250322193345",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-05-22 17:26:00",
        "Headline": "White farmer Wannie Scribante said he enjoyed his president being grilled by his US counterpart, but he does not believe Donald Trump's claims of \"a white genocide\".",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n \"It was a whipping!\" says Wannie Scribante, a small-scale white farmer in South Africa's North West province. He's describing Wednesday's Oval Office meeting between President Donald Trump and his South African counterpart Cyril Ramaphosa. This is the second time we visit Wannie's small farm since March to ask him about the White House.  Like many Afrikaners, Wannie is elated that his leader was grilled on the targeted killings of white South African farmers like himself after years of perceived dismissal. But even he does not believe Mr Trump's persistent claims of \"a white genocide\". \"I will say immediately we are not in genocide at this stage, but they are laying the table to getting there,\" he said. However, official crime statistics do not reflect mass killings of white farm owners as a basis for fears of a looming genocide. \n                  Why Trump's evidence about the killing of South African farmers is inaccurate\n                 \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Cyril Ramaphosa sworn in as South African president - despite his ANC party losing majority\n                 According to the South African Police Service (SAPS), only one farmer was murdered in the third quarter of 2024. Read more: Trump evidence of farmers' killings is inaccurate  AfriForum, an Afrikaner minority rights organisation, submitted a list of farm attacks to the Ministry of Police to support their claim that the official crime statistics are underreporting the number of farm murders and farm owners in particular. In March, SAPS shared that they are verifying cases in the submission and their preliminary results asserted that only one farm owner was murdered.  \"This corresponds with the single farm owner murder reported in the official crime statistics for the third quarter,\" it declared in a statement. \"While the verification processes are still ongoing, no additional murders of farm owners have been identified beyond what was originally reported by SAPS.\" AfriForum's chief executive Kallie Kriel is adamant that farm killings are an issue, though he does not directly repeat the allegations of a white genocide that have been pushed by fringe White South African groups since the end of apartheid. \"Instead of going into a genocide or not genocide fight, just accept that farm murders are a serious issue and there are tangible steps we can take,\" says Mr Kriel. But the chief economist at South Africa's Agricultural Business Chamber and adviser to President Ramaphosa, Wandile Sihlobo, argues that the thriving farming sector of predominantly white owners undermines a case of targeted attacks. \"There is no white genocide in South Africa and no [widespread] targeted killings of the farmers - there is crime generally across the country,\" he says. \"Between now and 1994, the [agricultural] sector has more than doubled in value and volume terms, exporting half of its produce worth close to $14bn in 2024.\" \"There is no country that can do that well in agriculture if the sector was in a situation where there was genocide and people were running away from the country.\""
    },
    {
        "title": "Bono calls for Israel to be 'released from Benjamin Netanyahu' in plea to 'stop war'",
        "description": "Irish rock star Bono has called for Israel to be \"released from Benjamin Netanyahu and far-right fundamentalists\" during an awards ceremony.",
        "url": "https://news.sky.com/story/bono-calls-for-israel-to-be-released-from-benjamin-netanyahu-in-plea-for-peace-13372955",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bono-u2-singer_6924667.jpg?20250522230031",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-22 19:37:00",
        "Headline": "The U2 frontman's comments mark the first time the human rights activist has publicly spoken out against the Israeli prime minister since the war started.",
        "Content": "Irish rock star Bono has called for Israel to be \"released from Benjamin Netanyahu and far-right fundamentalists\" during an awards ceremony. The U2 frontman's comments at the Ivors mark the first time the human rights activist has spoken out in public against the Israeli prime minister since the war in Gaza broke out in October 2023. Bono, who received the Peace Summit Award at the 2008 Nobel Peace Laureates summit, also called for Hamas to release its remaining Israeli hostages. It comes as Western leaders have been criticising Mr Netanyahu and the Israeli authorities over the renewed offensive in the Palestinian territory and the risk of famine due to an 11-week aid blockade, which is slowly easing. Gaza war: Follow latest updates Bono, whose real name is Paul Hewson, said on Thursday evening at London's Grosvenor House: \"Peace creates possibilities in the most intractable situations. \"Lord knows there's a few of them out there right now. Hamas release the hostages. Stop the war. \n                  Netanyahu launches attack on Starmer, Macron and Carney after embassy shooting\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Is the Middle East Trump's comfort zone?  \n                 \"Israel be released from Benjamin Netanyahu and far-right fundamentalists that twist your sacred texts. \"All of you protect our aid workers, they are the best of us.\" Bono, 65, made the call for peace as he and fellow U2 members each received an award from pop star Ed Sheeran. Read more from Sky News:What we know about Washington DC shooting victimsUK calls for investigation over West Bank gunfire The group became the first Irish songwriters to be awarded an academy fellowship at the 70th year of the awards. U2 then performed their song Sunday Bloody Sunday, which references the 1972 Bloody Sunday shootings in Londonderry, where members of the British army's Parachute Regiment opened fire at civil rights demonstrators. The group ended the evening with a performance of their 1988 song Angel Of Harlem.  Also on Thursday, Mr Netanyahu said UK Prime Minister Sir Keir Starmer was \"on the wrong side of humanity\" after he called for an end to the war in Gaza. In a video he shared on social media, the Israeli prime minister also attacked the leaders of France and Canada for their criticism of Israel's actions in the conflict. Mr Netanyahu specifically linked the criticism from the UK, France and Canada to the killings in Washington DC of Israeli embassy workers Yaron Lischinsky and Sarah Lynn Milgrim on Wednesday night."
    },
    {
        "title": "UK signs deal to hand over control of Chagos islands",
        "description": "The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius.",
        "url": "https://news.sky.com/story/uk-signs-deal-to-hand-over-control-of-chagos-islands-13372755",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-diego-garcia-chagos_6874792.jpg?20250403110156",
        "type": "World",
        "Author": "Faye Brown",
        "Date Published": "2025-05-22 14:18:00",
        "Headline": "The deal involves leasing back a crucial military base on Diego Garcia, the largest of the Chagos Islands, for 99 years.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius. It means Britain will give up sovereignty of the Indian Ocean territory and lease back the vital UK-US Diego Garcia military base - at a cost of billions of pounds to the taxpayer. PM signs Chagos deal - latest updates In a news conference, Prime Minister Sir Keir Starmer said the base is of the \"utmost significance to Britain\", having been used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\", and \"anticipate threats in the Red Sea and the Indo-Pacific\". He said the base was under threat because of Mauritius's legal claim on the Chagos Islands, which has been recognised by multiple international courts. \"If we did not agree this deal, the legal situation would mean that we would not be able to prevent China or any other nation setting up their own bases on the outer islands, or carrying out joint exercises near our base,\" Sir Keir said. \"We would have to explain to you, the British people and to our allies, that we'd lost control of this vital asset. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  Reeves vs Starmer: Inside the 'rift' in Downing Street\n                 \"No responsible government could let that happen, so there's no alternative but to act in Britain's national interest by agreeing to this deal. \"We will never gamble with national security.\" The deal means the UK will lease the base from the Mauritian government over 99 years. Confusion over costs Sir Keir said the average cost per year is £101m but the net overall cost is £3.4bn, not £10bn, and all public sector projects are measured in net costs. However, there is confusion over the government's calculations as the full agreement between the UK and Mauritius reveals the UK will pay: • £165m a year for the first three years;• £120m for years four to 13;• £120m plus inflation for every year after to year 99;• £40m as a one-off to a fund for Chagossians;• £45m a year for 25 years for Mauritian development. If inflation were to remain zero for the next century, this would work out to around £10bn over 99 years. Assuming an average of 2% inflation, Sky News analysis suggests costs could rise as high as £30bn. Downing Street stood by its figures, saying government accounting principles were applied to adjust for long-term costs and the value of the pound today is worth more than the pound in the future. Officials denied suggestions from journalists that was financial sophistry, insisting it was \"standard practice\". Sir Keir said that had he not struck the deal today, Mauritius would have taken the UK to international courts and probably won, with extra penalties implemented. However the Tories - who started negotiations in government - have branded the move a \"surrender tax\". Sovereignty row  The Chagos Archipelago was separated from Mauritius by the UK in 1965, when Mauritius was a British colony. Mauritius gained independence from the UK in 1968 and since then has been trying to claim the archipelago as Mauritian. In the late 1960s, the US asked the UK to expel everyone from the archipelago so they could build a naval support facility on the largest island, Diego Garcia. It is leased to the US but operates as a joint UK-US base. The UK has been under pressure to hand back control of the territory, after the UN and the International Court of Justice sided with Mauritius. The treaty said the deal would \"complete the process of decolonisation of Mauritius\". Tory leader Kemi Badenoch said that \"surrendering\" the Chagos Islands to Mauritius \"is an act of national self-harm\". \"It leaves us more exposed to China, and ignores the will of the Chagossian people. And we're paying billions to do so,\" she said. Reform UK leader Nigel Farage echoed those comments, accusing Sir Keir of caring more about foreign courts \"than Britain's national interest\". 'Deal inherited from Tories' However, Sir Keir said he \"inherited a negotiation in which the principle of giving up UK sovereignty had already been conceded\" by the Tories. He said \"all of the UK's allies\" support the deal, including the US, NATO, Five Eyes and India, and that those who are against it include \"Russia, China, Iran...and surprisingly, the leader of the opposition, and Nigel Farage\". Defence Secretary John Healey, who was also at the news conference, added that the last government failed to strike a deal despite 11 rounds of talks, leaving Labour to \"pick up the challenge\". He said ministers \"toughened the terms and the protections and the control that Britain can exercise through this treaty\". Under the deal's terms, a 24-nautical mile buffer zone will be put in place around the island where nothing can be built or placed without UK consent. The UK will retain full operational control of Diego Garcia, including the electromagnetic spectrum satellite used for communications which counters hostile interference. Marco Rubio, the US Secretary of State, said he welcomed the \"historic agreement\", saying it \"secures the long-term, stable and effective operation of the joint US-UK military facility at Diego Garcia, which is critical to regional and global security\". \"We value both parties' dedication. The US looks forward to our continued joint work to ensure the success of our shared operations,\" he said. The agreement had been due to be signed on Thursday morning but was temporarily blocked by an injunction hours before. A High Court Judge subsequently discharged the injunction at midday."
    },
    {
        "title": "Israeli embassy shooting suspect 'fired repeatedly after victims hit the ground'",
        "description": "The man suspected of shooting dead two Israeli embassy workers in Washington DC leaned over and fired at them repeatedly after they fell to the ground, the FBI has said.",
        "url": "https://news.sky.com/story/israeli-embassy-shooting-suspect-fired-repeatedly-after-victims-hit-the-ground-13373006",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-yaron-lischinsky-sarah-milgrim_6924053.jpg?20250522122801",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-22 21:08:00",
        "Headline": "The deaths of Yaron Lichinsky and Sarah Lynn Milgrim saw Benjamin Netanyahu accuse Keir Starmer, Emmanuel Macron and Mark Carney of fuelling antisemitism, having threatened \"concrete action\" against Israel over the war in Gaza.",
        "Content": "The man suspected of shooting dead two Israeli embassy workers in Washington DC leaned over and fired at them repeatedly after they fell to the ground, the FBI has said. Elias Rodriguez, 31, has been charged with murdering Sarah Milgrim and her boyfriend Yaron Lischinsky, after they left an event at the Capital Jewish Museum on Wednesday night. Israeli PM attacks Starmer - latest updates Footage has showed Rodriguez, from Chicago, chanting \"free, free Palestine\" as he was arrested. It later emerged Mr Lischinsky had bought a ring and planned to propose to Ms Milgrim. Authorities are investigating the killings as both a hate crime against the Jewish community and terrorism.  'I did it for Gaza' It comes as the FBI has said in a charging document on Thursday that surveillance footage shows how Ms Milgrim and Mr Lischinsky died. Rodriguez is allegedly seen passing the couple after they left the museum before shooting them in the back. The FBI says the footage then shows him leaning over the couple and firing at them several more times after they fell to the ground. The video then shows Ms Milgrim attempting to crawl away before \"(Rodriguez) followed behind her and fired again\", the charging document says. The suspected gunman is then accused of reloading his weapon and firing at Ms Milgrim as she sat up. According to the charging document, Rodriguez then jogged to the museum and once inside asked to speak to a police officer before stating that he \"did it\" and that he was unarmed. He is then said to have told police: \"I did it for Palestine, I did it for Gaza, I am unarmed.\"  Suspect 'expressed admiration' for fatal protest The court document also states that 21 expended 9mm bullet cases were found at the scene and the gun was slide-locked - meaning it was empty of ammunition. An empty gun magazine was also recovered from the scene. The FBI says it has obtained travel records which show Rodriguez flew from Chicago's O'Hare International Airport to the Reagan National in Washington DC on Tuesday with the gun in his checked baggage. Rodriguez had bought the weapon in the state of Illinois on 6 March 2020, according to the charging document. The FBI has said that while Rodriguez was in custody he \"expressed admiration\" for a US Air Force member who set himself on fire in front of the Israeli embassy in Washington DC on 25 February 2024. Aaron Bushnell died in the apparent act of protest against the war in Gaza. Rodriguez also told police he bought a ticket to the museum around three hours before the event that was attended by Ms Milgrim and Mr Lischinsky. Read more:Why Trump will worry about attacker being glorified  During a brief court appearance at the E. Barrett Prettyman Federal Courthouse in Washington DC today, Rodriguez was charged with two counts of first degree murder and with the murder of foreign officials. He has also been charged with causing the death of a person through the use of a firearm and discharge of a firearm during a crime of violence. Rodriguez was told he could face life in prison or the death penalty if he is found guilty. He remained calm throughout the hearing, paying attention to the proceedings throughout and confirmed that he is asking the court to appoint an attorney on his behalf. He will next appear at a federal court in Washington DC on 18 June. Murdered couple 'were perfect for each other' Meanwhile, Ms Milgrim's father, Robert, says he feared his daughter might be in danger when he saw news alerts of a fatal shooting in Washington DC. Ms Milgrim's mother Nancy opened a phone locator app and saw Ms Milgrim was at the Capital Jewish Museum. \"Shortly after that, the Israeli ambassador called us on my wife's phone,\" Mr Milgrim told Sky News' partner network NBC News, fighting back tears. He added that it was the ambassador who told them Mr Lischinksy had bought a ring and was planning to propose to Ms Milgrim. \"They were perfect for each other, he said. Mr Milgrim continued: \"They just brought us joy, and her memory, which is a blessing, will continue to bring us joy - but it's not the same as her not being here.\""
    },
    {
        "title": "Washington DC shooting suspect accused Israel of 'atrocities' in social media post, Sky News finds",
        "description": "A social media post believed to have been published by the suspect in the killing  of two Israeli embassy workers in Washington DC accuses Israel of \"atrocities\" against Palestinians.",
        "url": "https://news.sky.com/story/washington-shooting-suspect-accused-israel-of-atrocities-in-social-media-post-sky-news-finds-13372548",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elias-rodriguez-washington_6924013.jpg?20250522114103",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-22 08:54:00",
        "Headline": "The post was published an hour after the attack in which two members of staff of the Israeli embassy in Washington were shot dead.",
        "Content": " A social media post believed to have been published by the suspect in the killing  of two Israeli embassy workers in Washington DC accuses Israel of \"atrocities\" against Palestinians. The suspect, identified as Elias Rodriguez, 31, from Chicago, chanted \"free, free Palestine\" as he was arrested, footage shows. The victims, who were attacked as they were leaving an event at a Jewish museum, have been identified as Yaron Lischinsky and Sarah Milgrim, a young couple who were about to be engaged. Israel accuses Starmer over killings - read latest updates Sky News has uncovered what is believed to be a statement by the shooting suspect posted at 10pm local time, around an hour after the shooting - suggesting it was scheduled. The letter, signed with Rodriguez's name, was dated 20 May 2025. In the lengthy essay, Rodriguez criticises Israel's actions in Gaza and attacks the US government's position. \"The atrocities committed by the Israelis against Palestine defy description and defy quantification,\" it says. \"Instead of reading descriptions mostly we watch them unfold on video, sometimes live. After a few months of rapidly mounting death tolls Israel had obliterated the capacity to even continue counting the dead.\" The statement adds: \"Public opinion has shifted against the genocidal apartheid state, and the American government has simply shrugged, they'll do without public opinion then, criminalize it where they can, suffocate it with bland reassurances that they're doing all they can to restrain Israel where it cannot criminalize protest outright.\" Rodriguez concludes the statement: \"I love you Mom, Dad, baby sis, the rest of my familia, including you, O***** . Free Palestine.\" Israel has repeatedly denied accusations of genocide in Gaza. Prime Minister Benjamin Netanyahu has described a UN report accusing Israel of carrying out \"genocidal acts\" against the Palestinians as biased and antisemitic. The International Criminal Court has issued arrest warrants for Mr Netanyahu and his former defence secretary Yoav Gallant - as well as a senior Hamas commander - for alleged war crimes and crimes against humanity related to the war in Gaza. Mr Netanyahu has decried what he said were the \"false and absurd charges of the International Criminal Court, a biased and discriminatory political body\". Analysis: Trump team will worry about Washington attacker being glorified  The attack The couple were leaving an event at the Capital Jewish Museum when the suspect approached a group of four people and began shooting, Metropolitan Police Chief Pamela Smith said at a news conference. She said the suspect was seen pacing outside the museum before the shooting. \"After the shooting, the suspect entered the museum and was detained by event security,\" Ms Smith said. \"Once in handcuffs, the suspect identified where he discarded the weapon, and that weapon has been recovered, and he implied that he committed the offence.\" When he was taken into custody, the suspect began chanting, \"Free, free Palestine,\" Police Chief Smith said. Suspect believed to have been member of revolutionary socialist group Rodriguez is believed to have been a member of the Party of Socialism and Liberation, which describes itself as a revolutionary socialist party. An article in the group's Liberation paper about a protest outside the home of Chicago's then mayor Rahm Emanuel in October 2017 features a picture of Rodriguez at the demonstration as well as quotes from him. The protest was not linked to Israel or Gaza. The article was taken down from the paper's website on Thursday. Since 2024, Rodriguez has worked as an administrative specialist for the American Osteopathic Association, according to his LinkedIn profile. Before that he was an oral history researcher at The HistoryMakers, an online archive developed by Carnegie Mellon University to tell the stories of African Americans. A profile for Rodriguez on the website says he was born and raised in Chicago and has a BA degree in English from the University of Illinois Chicago. \"He enjoys reading and writing fiction, live music, film, and exploring new places,\" the profile says. Rodriguez is also believed to have donated $500 to Joe Biden's presidential campaign in March 2020, when he was running in the Democratic Party presidential primaries. Israel began its war against Hamas in Gaza after the militant group stormed across the border on 7 October 2023 and killed 1,200 people, taking 250 hostages. Since then Israeli attacks in Gaza have killed more than 53,000 people, mostly children, according to the enclave's Hamas-run health ministry, which does not differentiate between combatants and civilians in its count. The war has displaced 90% of Gaza's population of roughly two million people and left much of the territory in ruins. Reporting by Samuel Osborne, news reporter, and Sam Doak, OSINT producer"
    },
    {
        "title": "US music agency co-founder among victims in plane crash",
        "description": "Three people have died after a small plane crashed into a US neighbourhood.",
        "url": "https://news.sky.com/story/small-plane-crashes-into-san-diego-neighbourhood-in-direct-hit-to-multiple-homes-13372704",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-san-diego-plane-crash_6924243.jpg?20250522153357",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-22 12:49:00",
        "Headline": "A music agency said three of its employees, including its co-founder, died on the private plane that crashed into a San Diego neighbourhood. About 15 homes caught fire, as well as vehicles, with residents across several blocks evacuated.",
        "Content": " Three people have died after a small plane crashed into a US neighbourhood. Music agency Sound Talent Group said three of its employees, including its co-founder Dave Shapiro, died after being aboard the private aircraft, which went down in San Diego early on Thursday. The total number of deaths remains unknown, but six people were on the plane, according to the Federal Aviation Administration (FAA). The agency didn't name the other two employees after the jet crashed into a neighbourhood of US Navy-owned housing during foggy weather. Mr Shapiro was listed as the owner of the plane and had a pilot's licence, according to the FAA. \"We are devastated by the loss of our co-founder, colleagues, and friends. Our hearts go out to their families and to everyone impacted by today's tragedy,\" the agency said in a statement. Several people were injured while trying to flee the crash just before 4am local time (midnight in the UK) in Murphy Canyon and others were treated for smoke inhalation. \n                  Fourteen arrests in undercover sex trafficking sting at San Diego Comic-Con convention\n                 \n                  Shark attack victim punched it in the face, witness says\n                 \n                  British number one Katie Boulter comes from set down to win San Diego Open\n                 Assistant fire department chief Dan Eddy told reporters that authorities will be investigating whether the aircraft hit a power line. The fire chief added: \"When it hit the street, as the jet fuel went down it took out every single car that was on both sides of the street. \"You can see that every single car was burning down both sides of the street.\" The California crash occurred in the US military's largest housing neighbourhood. The plane appeared to strike at least one home, with around 10 houses and multiple vehicles damaged in the incident. No one required hospital treatment, but homes and buildings in the surrounding area were evacuated as emergency crews responded. \"I can't quite put words to describe what the scene looks like, but with the jet fuel going down the street, and everything on fire all at once, it was pretty horrific to see,\" San Diego police chief Scott Wahl said. The police chief said more than 50 officers were on the scene within minutes of the alarm being raised. At least 100 residents were evacuated to nearby Miller Elementary School. Describing the scene \"like something from a movie\", Mr Eddy earlier told reporters it was foggy at the time of the crash. He said: \"You could barely see in front of you.\" Christopher Moore, who lives one street over from the crash site, said he and his wife were woken by a loud bang and saw smoke when they peered out the window. As they fled the neighbourhood with their two young children, they spotted a car engulfed in flames. Mr Moore said: \"It was definitely horrifying for sure, but sometimes you've just got to drop your head and get to safety.\" Police rescued three husky puppies from one of the homes, while evacuated families were spotted standing in their pyjamas in a car park a few streets away. Many military service members live in the neighbourhood. It is also heavily populated by small civilian and military aircraft. Marine Corps Air Station Miramar, Montgomery-Gibbs Executive Airport and Gillespie Field are nearby. San Diego Police Department (SDPD) earlier confirmed emergency crews were responding to the crash in the neighbourhood of Tierrasanta. Posting on X, a SDPS spokesperson warned people to avoid the area and urged all those who smell jet fuel or find debris to alert the authorities. Evacuations took place in Salmon Street, Sample Street and Sculpin Street. Santo Road southbound was also closed at Aero Drive. The authorities are yet to release details about the plane, but said it was a flight coming in from the Midwest. A flight tracking site listed it as a Cessna Citation II jet that was scheduled to arrive at Montgomery-Gibbs Executive Airport in San Diego from Colonel James Jabara Airport in Wichita, Kansas. Officials at the airport said it just made a fuelling stop in Wichita. The flight originated on Wednesday night in Teterboro, New Jersey, according to FlightAware. The Federal Aviation Administration (FAA) said: \"The number of people on board is unknown at this time. \"The FAA and the National Transportation Safety Board (NTSB) will investigate. The NSTB will lead the investigation and provide any updates.\""
    },
    {
        "title": "Kid Cudi says Sean 'Diddy' Combs broke into his house and 'messed with his dog'",
        "description": "Kid Cudi has told a court Sean \"Diddy\" Combs broke into his home, \"messed with\" his dog and opened some of his Christmas presents during a break-in in December 2011.",
        "url": "https://news.sky.com/story/kid-cudi-says-sean-diddy-combs-broke-into-his-house-and-messed-with-his-dog-13372988",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kid-cudi-sean-diddy-combs_6924601.jpg?20250522215021",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-22 20:38:00",
        "Headline": "On the ninth day of the Sean \"Diddy\" Combs trial, Kid Cudi told the jury his Porsche was written off after a Molotov cocktail posted inside a hole cut in the roof, shortly after Diddy broke into his home.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Kid Cudi has told a court Sean \"Diddy\" Combs broke into his home, \"messed with\" his dog and opened some of his Christmas presents during a break-in in December 2011. The 41-year-old rapper was giving evidence on day nine of the trial, after briefly dating Diddy's former girlfriend Cassie the same year. Cassie and Diddy dated for 11 years, from 2007 to 2018, and Cassie has testified the rapper physically abused her during most of their relationship. Cudi described Cassie phoning him early one morning, sounding \"stressed, nervous and scared\", telling him Diddy had \"found out about us\". He said Diddy later called him from his home and told him, \"I'm here waiting for you\". After dropping Cassie at a West Hollywood hotel, Cudi said he returned to his home and found no one there, but said his dog had been locked in the bathroom. He described his pet later becoming \"jittery and on edge all the time\". He also said someone had opened Christmas presents he'd bought for his family. While Cudi, whose real name is Scott Mescudi, said he initially wanted \"to fight\" Diddy, he later thought through \"the reality of the situation,\" and called the police to report the break-in. Earlier this week, Cassie finished giving four days of evidence, becoming emotional at times, and testifying that Combs had threatened to blow up Cudi's car and hurt him after he learned she was dating him by looking at messages on her phone during a \"freak off\". Prosecutors say Combs, the founder of Bad Boy Records, forced women to take part in days-long, drug-fuelled sexual performances known as \"Freak Offs\" from 2004 to 2024, facilitated by his large retinue of staff. Combs, 55, has pleaded not guilty. The rapper faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. Sean 'Diddy' Combs trial: Day 9 - As it happened The month after the break-in, Cudi's Porsche was firebombed in his drive, with a hole cut into the roof and a Molotov cocktail dropped into the driver's seat. Cudi said he realised he had to talk to Diddy, before things \"got out of hand,\" meeting up with Diddy, who he said was weirdly \"calm\" and staring out the window with his hands behind his back \"like a Marvel super villain\". Cudi says Diddy told him he had still been dating Cassie during his relationship with her, with Cudi replying: \"[Cassie] told me you were broke up, and I took her word for it.\" Shaking hands at the end of the conversation, Cudi said he asked Diddy about \"burning\" his car, and Diddy replied, \"I don't know what you're talking about\". Cudi later said he believed that to be a lie. Cudi says he saw Diddy once a few years later at Soho House in Los Angeles with his daughter, and Diddy told him: \"Man, I just want to apologise for all that bullshit\". Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' Combs During his cross-examination, the defence suggested Cassie had been \"living two different lives\", and \"played\" both Cudi and Combs. Cudi concluded his time on the stand, saying his relationship with Cassie ended because he wanted \"to give her space\" and \"the drama was too out of hand\". Celebrity make-up artist Mylah Morales also gave evidence, describing a fight between Cassie and Diddy in 2010, which she says left Cassie with a \"swollen eye, busted lip, and knots on her head\". Morales said while she had heard the row, she hadn't physically seen it as she wasn't in the room. She told the court, \"I feared for my life\", explaining that she took Cassie to her apartment for several days to recover, but that Cassie refused to go to hospital as she was afraid of Diddy's reaction. The defence attempted to damage Morales's credibility by listing her TV appearances, which included programmes on CNN, and with Don Lemon and Piers Morgan, attempting to paint her as attention-seeking. The day also saw Combs's former assistant George Kaplan complete his testimony. He talked about two occasions when he had been asked to carry cash for Diddy, who he said never paid for things himself in the moment, recalling one time in 2015 when he looked after $50,000, and another when he was asked to pick up $10,000. Kaplan described seeing \"regular\" physical violence between Cassie and Diddy, including an incident in 2015 with whisky glasses on a private plane, when he heard glass breaking and saw Diddy standing over Cassie in the plane's central aisle. He says he also saw Diddy hurling \"decorative apples\" at another of his girlfriends, Gina, late the same year, handing in his notice the following month. Also known throughout his career as Puff Daddy and P Diddy, Combs turned artists like Notorious BIG and Usher into household names, elevating hip-hop in American culture and becoming a billionaire in the process. Diddy has been held in the Metropolitan Detention Center in Brooklyn since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for around six weeks in total and will go into its third week next week."
    },
    {
        "title": "Woman shot outside CIA headquarters after driving towards gates and refusing to stop",
        "description": "A woman who drove toward the gates of the CIA headquarters was shot after ignoring orders to stop, a source familiar with the matter said.",
        "url": "https://news.sky.com/story/woman-shot-outside-cia-headquarters-after-driving-towards-gates-and-refusing-to-stop-13372771",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cia-langley_6924294.jpg?20250522161832",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-22 14:49:00",
        "Headline": "Fairfax County Police described the shooting at the agency's headquarters in Langley, Virginia, early on Thursday as \"non-fatal\".",
        "Content": "A woman who drove toward the gates of the CIA headquarters was shot after ignoring orders to stop, a source familiar with the matter said. The CIA confirmed that its security guards \"engaged a person\" outside the main gates of the agency's headquarters in Langley, Virginia. Security personnel opened fire on the woman's vehicle as she drove toward the gates, ignoring orders to stop, just after 4am local time (9am UK time). A CIA spokesperson declined to say whether the woman was hit, but a person with knowledge of the matter told Sky News' US partner network NBC that the woman was shot. Fairfax County Police described the shooting on Thursday as \"non-fatal\". A source told Reuters that the woman was in stable condition after the shooting, adding that public records revealed she previously drove under the influence. Her vehicle never entered the CIA compound, and no security guards were hurt, the source added. \n                  CIA believes lab leak most likely caused COVID outbreak\n                 \n                  Malcolm X family brings $100m lawsuit against FBI, CIA and NYPD over 'conspiracy to assassinate' civil rights leader\n                 \n                  MI6 and CIA warn of 'reckless campaign of sabotage across Europe' being waged by Russia\n                 Read more from Sky News:'Multiple people dead' after plane crash in San DiegoMan who 'shot two people' accused Israel of 'atrocities' The CIA spokesperson said the suspect had been taken into custody, but declined to say whether authorities have identified a motive for the incident. The agency closed the main gate to its headquarters in McLean, Virginia, about 10 miles from downtown Washington, D.C., and directed employees to other gates."
    },
    {
        "title": "Why Trump's evidence about the killing of South African farmers is inaccurate",
        "description": "Donald Trump put his South African counterpart Cyril Ramaphosa on the spot with a list of claims and video clips when the pair met in the Oval Office on Wednesday.",
        "url": "https://news.sky.com/story/why-trumps-evidence-about-the-killing-of-south-african-farmers-is-inaccurate-13372763",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-south-africa-trump_6924249.png?20250522153140",
        "type": "US",
        "Author": "Sophia Massam, junior digital investigations journalist",
        "Date Published": "2025-05-22 14:29:00",
        "Headline": "President Trump ambushed South African counterpart Cyril Ramaphosa with claims of violence against white farmers. But his evidence is a collection of inaccuracies. ",
        "Content": "By Sophia Massam, junior digital investigations journalist  Donald Trump put his South African counterpart Cyril Ramaphosa on the spot with a list of claims and video clips when the pair met in the Oval Office on Wednesday. But multiple pieces of evidence that President Trump used to support his claims are inaccurate. One video the White House played showed lines of white crosses alongside a road. Mr Trump told President Ramaphosa that the footage showed burial sites of more than 1,000 white farmers in South Africa. The clip appears to originate from a YouTube video from 2020 showing crosses lining the P39-1 road near Newcastle in the east of South Africa. The caption of the video, which was filmed in KwaZulu-Natal province, explains that the crosses are a memorial for murdered farm workers after two farmers Glen and Vida Rafferty had been killed. There is no indication that the crosses mark where the deceased have been buried or that each cross represents a white farmer. \n                  White South African farmer elated Donald Trump grilled his president\n                 \n                  Donald Trump ambushes South African president at White House meeting by playing video alleging 'genocide'\n                 \n                  Cyril Ramaphosa sworn in as South African president - despite his ANC party losing majority\n                 Satellite map imagery from 2023 shows the crosses are no longer there. Local reporting at the time quotes attendants of the memorial as saying the crosses are a show of support not specifically for white farmers but for people from all walks of life who were concerned about farm murders. White crosses have been used as a symbol of commemoration for the murder of farmers in South Africa for years. The Witkruis Monument in the north of the country displays dozens of white crosses as a tribute to farmer workers who have been killed. Read more from Data and Forensics:What aid has entered Gaza - and where is it going?NHS waiting list rises for first time in seven months Other parts of the evidence presented by Mr Trump were also incorrect. At one point, while talking about the deaths of white farmers in South Africa, Mr Trump held up a printed-out image of a blog called 'American Thinker'. The blog picture is taken from a February 2025 YouTube video of Red Cross workers in the Democratic Republic of Congo. Mr Trump also played videos of people he said were officials promoting the killing of white farmers. The videos were of rallies or speeches from opponents of Mr Ramaphosa's ANC party, which is currently in power. Many of these videos show Julius Malema, the leader of the black nationalist and communist Economic Freedom Fighters (EFF) party.  The EFF are not a mainstream party and are not officials as Mr Trump claimed. Mr Ramaphosa responded to Mr Trump, saying: \"Our government policy is completely against what he [Malema] was saying.\" He continued that \"they [the EFF] are a small minority party, which is allowed to exist according to our constitution\". These claims were made as part of President Trump's allegation that white people in South Africa are facing a high level of race-based violence. \"We have many people that feel they're being persecuted, and they're coming to the United States. So we take from many... locations, if we feel there's persecution or genocide going on,\" the US president said, referring specifically to white farmers.  South Africa has rejected the allegation that white people are disproportionately targeted by crime. The country's police data does not give race-based crime statistics. Police data from April 2020 to March 2024 showed 225 people were killed on farms in South Africa. Crime data suggests 98,115 murders between 2020 and 2024, of which killings on farms are a very small proportion, around 0.2%.  The accuracy of crime data in South Africa has been questioned by academic experts, as farm murders are not consistently recorded in official data. In response to a request from Sky News to comment, a White House spokesperson disputed what they called the characterisation of the president's very real evidence regarding the persecution of Afrikaners as \"inaccurate\". Earlier this month, President Trump offered refuge to a small number of white South Africans. In March, the South African ambassador to the US Ebrahim Rasool was expelled after American secretary of state Marco Rubio accused him of being a \"race-baiting politician\" who hates President Trump. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Trump administration bars Harvard from enrolling international students",
        "description": "The Trump administration has revoked Harvard's ability to enrol international students, meaning thousands must transfer to other universities or leave the US entirely.",
        "url": "https://news.sky.com/story/trump-administration-bars-harvard-from-enrolling-international-students-13372921",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-harvard-university_6924580.jpg?20250522213245",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-22 18:51:00",
        "Headline": "The Department of Homeland Security argued the Ivy League school had created an unsafe campus environment as it announced the decision.",
        "Content": "The Trump administration has revoked Harvard's ability to enrol international students, meaning thousands must transfer to other universities or leave the US entirely. The Department of Homeland Security (DHS), which announced the action, said the Ivy League school had created an unsafe campus environment by allowing \"anti-American, pro-terrorist agitators\" to assault Jewish students on campus. Kristi Noem, the secretary of homeland security, also accused the university in Cambridge, Massachusetts, of \"coordinating with the Chinese Communist Party on its campus\", but did not provide evidence for the claim.  She has ordered her department to cancel Harvard's certification in the student and exchange visitor programme \"as a result of their failure to adhere to the law\". She wrote on X: \"It is a privilege, not a right, for universities to enroll foreign students and benefit from their higher tuition payments to help pad their multibillion-dollar endowments. \"Let this serve as a warning to all universities and academic institutions across the country.\" DHS said in a statement: \"This means Harvard can no longer enrol foreign students and existing foreign students must transfer or lose their legal status.\" \n                  White South African farmer elated Donald Trump grilled his president\n                 \n                  Why Trump's evidence about the killing of South African farmers is inaccurate\n                 \n                  Lights, camera, ambush: Why Trump is making South Africa genocide claims\n                 The university called the government's action \"unlawful\" and said it \"threatens serious harm to the Harvard community and our country, and undermines Harvard's academic and research mission\". Almost 6,800 foreign students from more than 100 countries are currently enrolled at Harvard, making up more than a quarter of the university's student body. The majority of them are graduate students. This comes amid the Trump administration's escalating battle with the university, which is accused of ideological bias and allowing antisemitism during campus protests against Israel's war in Gaza. The White House froze $2.2bn (£1.6bn) of government funding for Harvard earlier this year after the school rejected a list of demands. Read more: Woman shot outside CIA HQ'Multiple people dead' after San Diego plane crash Among the demands were that the university screen international students for those \"hostile to the American values\" and the end of all diversity, equality and inclusion programmes. Harvard is now suing the Trump administration to get the federal grants reinstated, accusing the US government of violating its First Amendment rights with its \"arbitrary and capricious\" funding freeze."
    },
    {
        "title": "Trump team will worry about Washington attacker being glorified",
        "description": "There are multiple layers to this shocking act of extreme violence.",
        "url": "https://news.sky.com/story/concerns-israeli-embassy-staff-shooting-could-be-glorified-in-same-way-as-luigi-mangione-13372498",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-washington-dc-israeli-embassy-staff_6923835.jpg?20250522080733",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-05-22 06:57:00",
        "Headline": "There will be immediate questions for the US authorities about the security of Israeli diplomats. The shooting happened in the downtown area of DC, not far from the FBI field office and the FBI headquarters.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  There are multiple layers to this shocking act of extreme violence. The presence of the US attorney general at a midnight news conference is a clear indication of the Trump administration's shock and swift reaction. Pam Bondi had already visited the scene of the attack. The president himself was quick to comment on social media, calling it out as antisemitism and saying: \"Hatred and Radicalism have no place in the USA.\" Israeli embassy staff shooting suspect 'shouted free Palestine' - follow live updates  There will be immediate questions for the US authorities about the security of Israeli diplomats. The shooting happened in the downtown area of DC, not far from the FBI field office and the FBI headquarters. The two victims are understood to be junior aides and so probably not considered particular targets. But the shooting will prompt a fresh look at diplomatic security arrangements. A video has emerged online said to show the gunman calmly shouting \"free free Palestine\" as he was detained by museum security.  Pro-Palestinian protests have been intense on college campuses, outside embassies and elsewhere; the Israeli embassy in Washington has been a particular focus of protesters. Last year, a 25-year-old active duty US airman immolated himself in front of the Israeli embassy in Washington to protest the war in Gaza. Israel's diplomatic relations with close allies, including the UK, France and others, have become increasingly strained over the methods used in its continuing war in Gaza. Read more:Sex offenders could face chemical castrationMeet staff crossing gang lines to battle malnutrition in HaitiTrump ambushes South African president at White House meeting Authorities will also be braced for how this incident plays in the days ahead. There will be a concern within the Trump administration that this man's actions will be given some glorification in parts of society, mainly online, in the same way Luigi Mangione became not just infamous but famous for allegedly shooting dead a healthcare executive in protest of corporate greed. Expect prompt condemnation from the White House of any such glorification.  There is also a deeply tragic twist to this shooting. The two young victims were a couple and were due to travel to Jerusalem in the days ahead to become engaged. I've been in touch with contacts at the Israeli embassy where the entire team is in shock and reeling at the loss of two of their own on the streets of Washington."
    },
    {
        "title": "Washington suspect told witness he 'did this for Gaza' in frenzied moments after Israeli embassy workers shot dead",
        "description": "Witnesses have told Sky News of the moments after a man shot two Israeli embassy staff members outside a Jewish museum in Washington DC.",
        "url": "https://news.sky.com/story/washington-suspect-told-witness-he-did-this-for-gaza-in-frenzied-moments-after-israeli-embassy-workers-shot-dead-13372605",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elias-rodriguez-shooting_6923893.jpg?20250522111833",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-22 09:59:00",
        "Headline": "The suspect, named as Elias Rodriguez by police, shot at a group of four people just over a mile from the White House and then chanted a pro-Palestinian slogan in custody.",
        "Content": " Witnesses have told Sky News of the moments after a man shot two Israeli embassy staff members outside a Jewish museum in Washington DC. Yaron Lischinsky and Sarah Lynn Milgram, a couple who were about to become engaged, were shot dead as they left the Annual Young Diplomats reception at the Capital Jewish Museum in the US capital. Follow live updates here  The suspect, named as Elias Rodriguez by police, shot at a group of four people just over a mile from the White House and then chanted a pro-Palestinian slogan in custody. The event organiser told Sky News she handed the suspect water, mistakenly believing him to be an \"innocent bystander\".  Jojo Drake Kalin said the event was wrapping up when she headed to the lobby to find \"commotion and a frenzy\" but at that time, no one was aware two people had lost their lives. \"The gunshots were heard, so security started locking the doors and that is when I saw who I now know is the... murderer of this Israeli-Jewish couple,\" she said. Analysis: Trump team will worry about Washington attacker being glorified Ms Drake Kalin didn't find out until \"much later\" who she was actually talking to. \"I see him [and] he seems very distraught. I now understand it's because he killed two people point-blank. [I] offered him water, he accepted,\" she said. \"The second I've handed him water, he whips out his keffiyeh [a scarf] and yells 'Free Palestine' and then he's subdued by the officers on scene.\" Ms Drake Kalin said the event was themed around \"bridge-building\" between Israeli and Palestinian communities. She called it \"painfully ironic\" that someone came in with \"such hate and destruction\", considering the event's theme.  Another witness, John Elleson, cried as he told Sky News correspondent Ashish Joshi what he saw. \"A guy came up and... looked like [he had a] gun, I couldn't tell what it was, but I heard it afterwards, the shots, and he shot this young couple,\" he said. \"He ran inside and yelled something. \"It was terrible. It was terrible.\" Another eyewitness, Katie Kalisher, said it was around 9.07pm when she heard gunshots. \"Then a man comes in. He looks really distressed and people are talking to him and trying to calm him down,\" she said. \"Eventually, he comes over to where I was and we were like, 'Do you need any water?', 'Are you okay?'\" Ms Kalisher said the suspect asked her what kind of museum he was in and when she replied, \"It's a Jewish museum,\" he said: \"Do you think that's why they did this?\" She told him she didn't think so but he then reached into his bag and pulled out a keffiyeh. \"[He] says, 'I did it. I did this for Gaza' - and just starts shouting 'free Palestine' and that's when the police came in and arrested him,\" said Ms Kalisher. The reaction to the shooting has been one of shock, with President Donald Trump condemning the \"horrible killings\" which he said were \"based obviously on antisemitism\". Israeli Prime Minister Benjamin Netanyahu said his heart ached for the families of the victims, \"whose lives were cut short in a moment by an abhorrent antisemitic murderer\". Earlier, an Israeli minister accused the leaders of the UK, France and Canada of \"emboldening the forces of terror\" after the three countries threatened \"concrete action\" against Israel if it continues its \"egregious\" military operations in Gaza. Israeli diplomats have since distanced themselves from the minister's comments."
    },
    {
        "title": "Phoenix Group plots rebranding under historic Standard Life name",
        "description": "Phoenix Group, the FTSE-100 pensions provider, is plotting to rebrand itself using the historic Standard Life name it acquired four years ago.",
        "url": "https://news.sky.com/story/phoenix-group-plots-rebranding-under-historic-standard-life-name-13372741",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-standard-life-edinburgh_6924200.jpg?20250522145914",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-22 13:58:00",
        "Headline": "The board of Phoenix Group, chaired by Sir Nicholas Lyons, is said to be planning to change its name to 200-year old Standard Life later this year, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Phoenix Group, the FTSE-100 pensions provider, is plotting to rebrand itself using the historic Standard Life name it acquired four years ago. Sky News has learnt that Phoenix, which has a market value of over £6.2bn, is drawing up plans to drop the current name of its listed holding company in favour of that of Standard Life, which traces its roots back to the 1820s. City sources said an announcement was likely about the name-change in the coming months, although they insisted that a final decision had yet to be taken. If it does go ahead, it would see the Standard Life name returning to the London Stock Exchange for the first time since Standard Life Aberdeen made the ill-advised decision to change its name to the frequently derided abrdn in 2021. Standard Life is one of the City's most venerable brands, and was structured as a mutual for much of its existence. Responding to an enquiry from Sky News, a Phoenix Group spokesman said: \"Our brand strategy must support our business strategy and this is kept under review. \"Standard Life is a strong brand with 200 years of history and the brand we are using to grow our business across three markets. \n                  Pressure builds on Reeves as borrowing rises ahead of spending review\n                 \n                  Doctors and teachers offered 4% pay rise in England and Wales\n                 \n                  Bitcoin hits new high as investor appeal widens\n                 \"You may have seen at our recent AGM we changed our articles of association to allow us to rebrand with board approval, rather than shareholder approval. \"This board approval hasn't happened.\" He declined to comment on the company's future intentions."
    },
    {
        "title": "Pressure builds on Reeves as borrowing rises ahead of spending review",
        "description": "The Chancellor borrowed more than expected at the start of the new tax year, piling more pressure on the public finances ahead of next month's spending review.",
        "url": "https://news.sky.com/story/pressure-builds-on-reeves-as-borrowing-rises-ahead-of-spending-review-13372531",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rachel-reeves-mansion-house-accord_6914811.jpg?20250513085720",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-05-22 08:19:00",
        "Headline": "Data from the Office for National Statistics (ONS) shows estimated net borrowing of £20.2bn in April - higher than the £17.9bn forecast by economists and the fourth highest April total on record.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The Chancellor borrowed more than expected at the start of the new tax year, piling more pressure on the public finances ahead of next month's spending review. Data from the Office for National Statistics (ONS) showed estimated net borrowing of £20.2bn in April - higher than the £17.9bn forecast by economists and the fourth highest April total on record. That was despite a £1.7bn projected boost from employer national insurance contributions - hiked in October's budget to help get the public finances in order and which kicked-in on 6 April. The main reasons for the rise in borrowing included increases in public sector pay, along with higher benefits and state pensions, the ONS said. Money latest: How travel insurance cost can surge The data will do nothing to ease nerves over the state of the nation's coffers amid renewed concerns Rachel Reeves may be forced to act again, in the autumn budget, to meet her own \"non-negotiable\" fiscal rules. They say she must balance day-to-day spending with revenues by 2029-30, while improving public services and targeting accelerated economic growth. \n                  Phoenix Group plots rebranding under historic Standard Life name\n                 \n                  Doctors and teachers offered 4% pay rise in England and Wales\n                 \n                  Bitcoin hits new high as investor appeal widens\n                 The Chancellor was forced to restore a £10bn buffer at the spring statement in March, led by planned welfare curbs, after the economy flatlined. A further restoration of headroom may be on the cards in October, given that stronger growth in the first quarter of the year is forecast to prove elusive across the rest of 2025. The run-up to next month's spending review - which sets budgets for government departments - has been dominated by a political row over one of her first actions in the role, which saw universal winter fuel payments stopped. Prime Minister Sir Keir Starmer confirmed on Wednesday that a U-turn, of sorts, is on the cards. The prospect of a higher bill ahead will do nothing to ease the cost of servicing government debt, with bond market investors continuing to demand a higher premium to hold UK gilts. Their concerns include not only the forecasts for slowing growth but also persistent inflation.  One good bit of news for Ms Reeves was a downwards revision by the ONS to its government borrowing figure for the last financial year. The total dropped by almost £4bn to £148.3bn. The shift was explained by higher tax receipts but the sum still remained about £11bn above the updated forecast by the Office for Budget Responsibility. Darren Jones, chief secretary to the Treasury, said of the ONS figures: \"After years of economic instability crippling the public purse, we have taken the decisions to stabilise our public finances, which has helped deliver four interest rate cuts since August, cutting the cost of borrowing for businesses and working people. \"We're fixing the NHS, with three million more appointments to bring waiting lists down, rebuilding Britain with our landmark planning reforms and strengthening our borders, delivering on the priorities of the country through our plan for change.\" Read more from Sky News:Bitcoin hits new record highInflation at highest level since January 2024 There is a growing school of thought that Ms Reeves will need to raise taxes in October if she is to meet her commitments, including her fiscal rules. Lindsay James, investor strategist at wealth management firm Quilter, said: \"The decision to hold off on tax rises in the spring budget increasingly looks like a temporary reprieve. \"As borrowing continues to outstrip forecasts and debt interest costs remain elevated, pressure is building on the chancellor to make tougher choices.\""
    },
    {
        "title": "Doctors and teachers offered 4% pay rise in England and Wales",
        "description": "Doctors and teachers will be given a 4% pay rise after the government accepted recommendations from independent review bodies.",
        "url": "https://news.sky.com/story/doctors-and-teachers-offered-4-pay-rise-in-england-and-wales-13372767",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-junior-doctors-bma_6924310.jpg?20250522163129",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-22 14:42:00",
        "Headline": "The salary increases are 2.8% higher than what the government originally budgeted for, but unions say they are still inadequate in tempering inflation and historical pay freezes.",
        "Content": "Doctors and teachers will be given a 4% pay rise after the government accepted recommendations from independent review bodies. The salary increases, announced by ministers on Thursday afternoon, are 2.8% above what the government had originally budgeted for. The 4% rise is just above the current rate of inflation, which increased from 2.6% in March to 3.5% in April. It will apply to all doctors and teachers in England and Wales. But both the British Medical Association (BMA) and National Education Union (NEU) have threatened further strike action following the announcement, claiming the increases do not account for historical pay freezes. Other NHS workers in England, including nurses, midwives, and physiotherapists, will get a 3.6% pay increase effective from 1 April, Health Secretary Wes Streeting said. He added that junior doctors would be offered an average increase of 5.4% as a result of a further £750 top-up. Read more from Sky NewsChemical castrations proposed for sex offendersWhat is chemical castration?Data reveals net migration has halved to the UK Senior civil servants will get a 3.25% pay increase, the Cabinet Office added, but there are still changes to be made to higher salary bands within the civil service. Prison officers and managers will get the same 4% pay rise as doctors and teachers, Justice Secretary Shabana Mahmood said. Military personnel are being offered a 4.5% rise following their own independent pay review. Senior military officers will get a slightly lower boost of 3.75%, with Defence Secretary John Healey saying the changes \"recognise their dedication to keep Britain secure at home and strong abroad\". Unions say offers are 'woefully inadequate' The government's proposals on pay have been met with anger among healthcare unions, with the BMA describing its offer for doctors as \"woefully inadequate\". Professor Philip Banfield, chairman of the BMA council, said doctors are already considering striking again. \"Doctors' pay is still around a quarter less than it was in real terms 16 years ago and today's 'award' delays pay restoration even more, without a government plan or reassurance to correct this erosion of what a doctor is worth,\" he said. Other NHS workers who belong to either the Royal College of Nursing (RCN) or GMB unions are being asked to vote on whether they will accept their offers or not. RCN general secretary and chief executive Professor Nicola Ranger warned pay increases have already been \"entirely swallowed up by inflation and do nothing to change the status quo - where nursing is not valued, too few enter it and too many quit\". Schools will have to fund 1% themselves While education unions have been less resistant, the NEU, which is the largest teacher union, threatened to \"register a dispute\" with the government if it does not fund all of the pay rises itself - as they are currently being offered as part of existing school budgets, which they insist are needed for pressing matters outside staffing. Schools will be given an additional £615m towards the pay increases this financial year, but they will be expected to find the final 1% of the 4% rise themselves - \"through improved productivity and smarter spending\". Education Secretary Bridget Phillipson said: \"I believe schools have a responsibility, like the rest of the public sector, to ensure that their funding is spent as efficiently as possible.\" General secretary of the TUC Paul Nowak said further negotiations with the government would be needed to resolve outstanding issues. He said his and other unions want to \"work with the government to address the recruitment and retention crisis gripping our public services\". \"Ministers need to talk directly to unions to address the root causes behind dedicated and experienced public servants quitting their professions,\" he warned. \"We need a clear, jointly-agreed long-term strategy to improve public-sector pay, alongside other crucial issues such as better working hours, more manageable workloads and enhanced flexible working options.\""
    },
    {
        "title": "Bitcoin hits new high as investor appeal widens",
        "description": "Bitcoin has surged to a new all-time high - breaking through $111,000 for the first time.",
        "url": "https://news.sky.com/story/bitcoin-hits-new-high-as-investor-appeal-widens-13372479",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bitcoin-crypto_6806466.jpg?20250121150936",
        "type": "Business",
        "Author": "Connor Sephton",
        "Date Published": "2025-05-22 06:13:00",
        "Headline": "The world's biggest cryptocurrency has had a volatile 2025 to date but there are reasons to believe some further momentum is likely.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Bitcoin has surged to a new all-time high - breaking through $111,000 for the first time. It means every single person who has bought it since 2009 (and held onto it) will be sitting on a profit. The surge follows a pretty dramatic 2025 for Bitcoin (BTC), with Donald Trump's presidency making this digital asset even more volatile than usual. Money latest: How travel insurance costs can spike BTC had first managed to hit $109,000 on 20 January - the day Mr Trump was inaugurated - with investors hopeful that he would introduce a slew of pro-crypto policies. Despite the president coming good on some of those promises, the world's biggest cryptocurrency soon fell, amid accusations these policies didn't go far enough. The White House has confirmed the US will treat Bitcoin seized from criminals as an investment, but there was disappointment when it was confirmed the government would not be buying additional coins for its \"strategic reserve\" using taxpayers' money. \n                  Phoenix Group plots rebranding under historic Standard Life name\n                 \n                  Pressure builds on Reeves as borrowing rises ahead of spending review\n                 \n                  Doctors and teachers offered 4% pay rise in England and Wales\n                 Bitcoin also took a battering in the immediate aftermath of Mr Trump's controversial \"Liberation Day\" tariffs - slumping to lows of $75,000 in April as investors dumped riskier assets. There are several factors behind this recent comeback, with laws designed to regulate the crypto sector now advancing through the US Senate for the first time.  Interest in Bitcoin is also growing among hedge funds and financial institutions, while some companies are now in a race to buy as much of this cryptocurrency as possible. One company called Strategy now has a war chest of 576,230 BTC worth $63bn - resulting in handsome profits of more than $23bn. Part of BTC's appeal lies in how it has a limited supply of 21 million coins, whereas the amount of traditional currencies in circulation often increases over time. The latest milestone will likely contribute to a euphoric atmosphere when the president hosts a controversial dinner tomorrow for 220 of the biggest investors in $TRUMP, his very own cryptocurrency. It also coincides with Bitcoin 2025 - the biggest crypto conference in the world - which is due to begin in Las Vegas on Tuesday - and growing financial market concerns about the size of the US government's ballooning debt pile. Nigel Green, chief executive of global financial advisory firm deVere Group, expects Bitcoin to set new milestones in the coming months. \"$150,000 no longer looks ambitious - it looks cautious,\" he wrote in a note. \"Several forces have aligned to propel the market. A cooler-than-expected US inflation print, an easing in trade tensions between Washington and Beijing, and the Moody's downgrade of US sovereign debt have all steered investors toward alternatives to traditional fiat-based stores of value. \"Bitcoin, often likened to digital gold, is soaking up that demand. \"In a world where sovereign credibility is fraying, investors are shifting decisively into assets that can't be diluted or manipulated. Bitcoin has become not just a speculative play, but a strategic hedge.\""
    },
    {
        "title": "Bonhams-owner Epiris eyes plunge into Merlin aquariums",
        "description": "The private equity backer of businesses including Bonhams, the auctioneer, and Amber Taverns is plotting a bid for a portfolio of aquariums earmarked for disposal by the world's biggest theme park operator.",
        "url": "https://news.sky.com/story/bonhams-owner-epiris-eyes-plunge-into-merlin-aquariums-13372586",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-merlin-sealife-sea-life_6827467.jpg?20250213111533",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-22 09:43:00",
        "Headline": "The private equity backer of Bonhams and Amber Taverns is among the suitors preparing offers for a portfolio of Merlin Entertainments' Sea Life-branded aquariums, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backer of businesses including Bonhams, the auctioneer, and Amber Taverns is plotting a bid for a portfolio of aquariums earmarked for disposal by the world's biggest theme park operator. Sky News has learnt that Epiris is among a number of parties preparing to table offers for a number of Sea Life sites in the coming weeks. The auction process - initially reported by Sky News earlier this year - remains at an early stage, with first-round bids yet to be submitted. Money latest: How travel insurance cost can surge The aquariums have been put up for sale by Merlin Entertainments, which wants to prioritise investment in its biggest international sites - including in London. The London attraction is not part of the auction. Merlin is jointly owned by the private equity giant Blackstone and the investment vehicle of the family behind the Lego dynasty, and counts Alton Towers, Legoland and Madame Tussauds among its British venues. \n                  Phoenix Group plots rebranding under historic Standard Life name\n                 \n                  Pressure builds on Reeves as borrowing rises ahead of spending review\n                 \n                  Doctors and teachers offered 4% pay rise in England and Wales\n                 The group owns more than 40 aquariums globally, many of which trade under the Sea Life brand. In the UK, there are 11 such attractions, including in London, Birmingham and Manchester - which are not for sale - and Blackpool, Brighton, Great Yarmouth, Loch Lomond, Scarborough and Weymouth. The potential disposals only relate to Merlin's aquariums division and do not encompass any other area of its operations. Epiris declined to comment on its interest. Read more from Sky News:Bitcoin hits new record highInflation at highest level since January 2024 A Merlin spokesperson said earlier this year: \"Like any well-run business, Merlin regularly reviews its estate, to ensure it reflects the company's long-term growth strategy. \"We continue to invest in our attractions globally - opening 24 new rides, attractions and experiences in 2024."
    },
    {
        "title": "Labour say there's been a 'massive increase' in NHS appointments - this begs to differ",
        "description": "\"The target was never particularly ambitious,\" says the Institute for Fiscal Studies (IFS) about Labour's plan to add two million extra NHS appointments during their first year in power.",
        "url": "https://news.sky.com/story/labour-say-theres-been-a-massive-increase-in-nhs-appointments-this-begs-to-differ-13372714",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-nhs-data-and-forensics_6924130.jpg?20250522133836",
        "type": "Politics",
        "Author": "Daniel Dunford, senior data journalist, and Sam Coates, deputy political editor",
        "Date Published": "2025-05-22 13:00:00",
        "Headline": "Keir Starmer made slashing NHS waiting times one of his priorities, and his Labour government has already claimed it as one of its biggest achievements so far. But new data tells a different story - and the public aren't noticing an improvement.",
        "Content": "By Daniel Dunford, senior data journalist, and Sam Coates, deputy political editor   \"The target was never particularly ambitious,\" says the Institute for Fiscal Studies (IFS) about Labour's plan to add two million extra NHS appointments during their first year in power. In February, Health Secretary Wes Streeting announced they had achieved the feat early. He recently described the now 3.6m additional appointments achieved in their first eight months as a \"massive increase\". PM signs Chagos deal - politics latest But new data, obtained by independent fact checking charity Full Fact and shared exclusively with Sky News, reveals this figure actually signalled a slowing down in new NHS activity. There was an even larger rise of 4.2m extra appointments over the same period the year before, under Rishi Sunak's government. The data also reveals how unambitious the target was in the first place. We now know two million extra appointments over the course of a year represents a rise of less than 3% of the almost 70 million carried out in the year to June 2024. In the last year under Mr Sunak, the rise was 10% - and the year before that it was 8%. Responding to the findings, Sarah Scobie, deputy director of independent health and social care think tank the Nuffield Trust, told Sky News the two million target was \"very modest\". She said delivering that number of appointments \"won't come close to bringing the treatment waiting list back to pre-pandemic levels, or to meeting longer-term NHS targets\". The IFS said it was smaller than the annual growth in demand pressures forecast by the government. What exactly did Labour promise? The Labour election manifesto said: \"As a first step, in England we will deliver an extra two million NHS operations, scans, and appointments every year; that is 40,000 more appointments every week.\" We asked the government many times exactly how it would measure the pledge, as did policy experts from places like the IFS and Full Fact. But it repeatedly failed to explain how it was defined. Leo Benedictus, a journalist and fact-checker at Full Fact, told Sky News: \"We didn't know how they were defining these appointments. \"When they said that there would be more of them, we didn't know what there would be more of.\" Even once in government, initially Labour did not specify their definition of \"operations, scans, and appointments\", or what the baseline \"extra\" was being measured against. This prevented us and others from measuring progress every month when NHS stats were published. Did it include, for instance, mental health and A&E appointments? And when is the two million extra comparison dating from? Target met, promise kept? Suddenly, in February, the government announced the target had already been met - and ever since, progress on appointments has been a key boast of ministers and Labour MPs. At this point, they did release some information: the definition of procedures that allowed them to claim what had been achieved. They said the target involved is elective - non-emergency - operations excluding maternity and mental health services; outpatient appointments and diagnostic tests.  However, we still did not have a comprehensive baseline to measure the two million increase against. The government data instead relied on a snapshot: comparing the number of appointments carried out from July to November 2024 with the number from July to November 2023, and adjusted them for the number of working days in each period. This did not tell us if the NHS had already been adding appointments under the Conservatives, and at what pace, and therefore whether this target was a big impressive ramping up of activity or, as it turns out, actually a slowing down. Since then, a number of organisations, like Full Fact, have been fighting with the government to release the data. Mr Benedictus said: \"We asked them for that information. They didn't publish it. We didn't have it. \"The only way we could get hold of it was by submitting an FOI request, which they had to answer. And when that came back about a month later, it was fascinating.\" This finally gives us the comparative data allowing us to see what the baseline is against which the government's \"success\" is being measured. Full Fact passed the data to Sky News because it had seen our reporting about how the information published by the NHS in February was not sufficient to be able to assess whether things were getting better or worse. What the government says now We put our findings to the government. A Department of Health and Social Care spokesperson said: \"On entering office last July, the secretary of state [Wes Streeting] was advised that the fiscal black hole meant elective appointments would have to be cut by 20,000 every week. \"Instead, this government provided the extra investment and has already delivered 3.6 million additional appointments - more than the manifesto commitment the British public voted for - while also getting more patients seen within 18 weeks. \"In the nine months since this government took office, the waiting list has dropped by over 200,000 - more than five times as much as it had over the same period the previous year - and also fell for six consecutive months in a row.\" We put this to Jeremy Hunt, Rishi Sunak's chancellor during his last two years as prime minister, and health secretary for six years under David Cameron and Theresa May. He said: \"What these numbers seem to show is that the rate of appointments was going up by more in the last government than it is by this government. That's really disappointing when you look at the crisis in the NHS. \"All the evidence is that if you want to increase the number of people being treated, you need more capacity in the system, and you need the doctors and nurses that are there to be working more productively. \"Instead what we've had from this government is the vast majority of the extra funding for the NHS has gone into pay rises, without asking for productivity in return.\" Edward Argar, shadow health secretary, accused the government of a \"weak attempt […] to claim credit for something that was already happening\". \"We need to see real and meaningful reform that will genuinely move the dial for patients,\" he added. Is the NHS getting better or worse? New polling carried out by YouGov on behalf of Sky News this week also reveals 39% of people think the NHS has got worse over the past year, compared with 12% who think it's got better. Six in 10 people say they do not trust Keir Starmer personally on the issue of the NHS, compared with three in 10 who say they do. That is a better rating than some of his rivals, however. Just 21% of people say they trust Nigel Farage with the NHS, and only 16% trust Kemi Badenoch - compared with 64% and 60% who do not. Ed Davey performs better, with 30% saying they trust him and 38% saying they do not. Ms Scobie of the Nuffield Trust told Sky News \"the government is right to make reducing long hospital treatment waits a key priority […] but much faster growth in activity is needed for the NHS to see a substantial improvement in waiting times for patients.\" The government is correct, however, to point out the waiting list having dropped by more than 200,000 since it's been in office. This is the biggest decline between one July and the following February since current waiting list statistics were first published under Gordon Brown. The percentage of people waiting less than 18 weeks for treatment is also falling for the first time, other than a brief period during the pandemic, for the first time in more than a decade. There is still a long way to go, though. Figures released last week showed the total number of people waiting for NHS treatment in England had risen again in March, following six months of positive progress. The latest figures show 6.25m people waiting for 7.42m treatments (some people are on the list for more than one issue). That means more than one in 10 people in England are currently waiting for NHS treatment. There continues to be a fall in the number who have been waiting longer than a year. It’s now 180,242, down from almost 400,000 in August 2023 and over 300,000 in June 2024, the Conservatives' last month in power. But that number is still incredibly high by historical standards. It remains over 100 times higher than it was before the pandemic. The government has a separate pledge that no more than 8% of patients will wait longer than 18 weeks for treatment, by the time of the next election. Despite improvements in recent months, currently more than 40% wait longer than this. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Starmer's winter fuel cut U-turn claim 'not credible'",
        "description": "Sir Keir Starmer's claim he is U-turning on cutting winter fuel payments for pensioners because he now has the money is not \"credible\", Harriet Harman has said.",
        "url": "https://news.sky.com/story/starmers-winter-fuel-cut-u-turn-claim-not-credible-13372837",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-electoral-dysfunction_6924635.jpg?20250522223106",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-22 16:10:00",
        "Headline": "The prime minister has suggested the government will look at making the winter fuel allowance available to more pensioners - a major change of tune following Labour's disastrous recent elections results.",
        "Content": "Sir Keir Starmer's claim he is U-turning on cutting winter fuel payments for pensioners because he now has the money is not \"credible\", Harriet Harman has said. 👉 Listen to Electoral Dysfunction on your podcast app 👈 The Labour peer, speaking to Sky News political editor Beth Rigby on the Electoral Dysfunction podcast, said the prime minister made the move as it was so unpopular with voters. PM signs Chagos deal - politics latest She also said Labour's poor results at the local elections and the Runcorn and Helsby by-election were the \"straw that broke the camel's back\". Sir Keir said on Wednesday he would ease the cut to the winter fuel payment, which has been removed from more than 10 million pensioners this winter after it became means-tested. He and his ministers had insisted they would stick to their guns on the policy, even just hours before Sir Keir revealed his change of heart at PMQs  Baroness Harman said: \"It's always been contested and always been unpopular. \"But the final straw that broke the camel's back was the elections. The council elections and the Runcorn by-election, where the voters were saying, 'this is not the change we voted for'. \"At the end of the day, you cannot just keep flying in the face of what voters - particularly if they're people who previously voted for you - wanted.\" Baroness Harman is unconvinced by Sir Keir's claim he can U-turn because there is more money due to good economic management by the government. \"I don't think that's credible as an argument,\" she said. \"It really is the fact that voters just said 'this is not the change we voted for, we're not going to have this'.\" The challenge for the government now, she said, is deciding who will get the allowance moving forward, when they'll get it, and when it will all be announced. Read more:Ex-PM suggests who should miss out on winter fuel payments Chancellor Rachel Reeves has committed to just one major fiscal event a year, meaning just one annual budget in the autumn. Autumn budgets normally take place in October, with the last one at the end of the month. If this year's budget is around the same date, it will leave little time for the extra winter fuel payments to be made, as they are paid between November and December. Business Secretary Jonathan Reynolds told the Electoral Dysfunction podcast the economy will have to be \"strong enough\" for the government to U-turn on winter fuel payment cuts. He also said the public would have to wait for the budget for any announcement."
    },
    {
        "title": "Reeves vs Starmer: Inside the 'rift' in Downing Street",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/reeves-vs-starmer-inside-the-rift-in-downing-street-13372799",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6862564.png?20250320204606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-22 15:22:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Are Keir Starmer and Rachel Reeves falling out over winter fuel payments? Beth tells us what she's been hearing in Westminster about a rift between the pair and although it's denied by Number 11, she's heard there's \"palpable tension\" between the principal players over the change in policy. Also, with a vote on welfare reforms coming up next month, Beth, Harriet Harman and Ruth Davidson discuss how it will play out with Labour MPs and whether the government is losing its grip despite having such a big majority. Plus, Beth speaks to Business Secretary Jonathan Reynolds about the winter fuel U-turn and whether the government can get a better deal with Donald Trump. Remember you can also watch us on YouTube!"
    },
    {
        "title": "UK signs deal to hand over control of Chagos islands",
        "description": "The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius.",
        "url": "https://news.sky.com/story/uk-signs-deal-to-hand-over-control-of-chagos-islands-13372755",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-diego-garcia-chagos_6874792.jpg?20250403110156",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-22 14:18:00",
        "Headline": "The deal involves leasing back a crucial military base on Diego Garcia, the largest of the Chagos Islands, for 99 years.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  The UK has signed a long-awaited deal to hand control of the Chagos Islands to Mauritius. It means Britain will give up sovereignty of the Indian Ocean territory and lease back the vital UK-US Diego Garcia military base - at a cost of billions of pounds to the taxpayer. PM signs Chagos deal - latest updates In a news conference, Prime Minister Sir Keir Starmer said the base is of the \"utmost significance to Britain\", having been used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\", and \"anticipate threats in the Red Sea and the Indo-Pacific\". He said the base was under threat because of Mauritius's legal claim on the Chagos Islands, which has been recognised by multiple international courts. \"If we did not agree this deal, the legal situation would mean that we would not be able to prevent China or any other nation setting up their own bases on the outer islands, or carrying out joint exercises near our base,\" Sir Keir said. \"We would have to explain to you, the British people and to our allies, that we'd lost control of this vital asset. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  Reeves vs Starmer: Inside the 'rift' in Downing Street\n                 \"No responsible government could let that happen, so there's no alternative but to act in Britain's national interest by agreeing to this deal. \"We will never gamble with national security.\" The deal means the UK will lease the base from the Mauritian government over 99 years. Confusion over costs Sir Keir said the average cost per year is £101m but the net overall cost is £3.4bn, not £10bn, and all public sector projects are measured in net costs. However, there is confusion over the government's calculations as the full agreement between the UK and Mauritius reveals the UK will pay: • £165m a year for the first three years;• £120m for years four to 13;• £120m plus inflation for every year after to year 99;• £40m as a one-off to a fund for Chagossians;• £45m a year for 25 years for Mauritian development. If inflation were to remain zero for the next century, this would work out to around £10bn over 99 years. Assuming an average of 2% inflation, Sky News analysis suggests costs could rise as high as £30bn. Downing Street stood by its figures, saying government accounting principles were applied to adjust for long-term costs and the value of the pound today is worth more than the pound in the future. Officials denied suggestions from journalists that was financial sophistry, insisting it was \"standard practice\". Sir Keir said that had he not struck the deal today, Mauritius would have taken the UK to international courts and probably won, with extra penalties implemented. However the Tories - who started negotiations in government - have branded the move a \"surrender tax\". Sovereignty row  The Chagos Archipelago was separated from Mauritius by the UK in 1965, when Mauritius was a British colony. Mauritius gained independence from the UK in 1968 and since then has been trying to claim the archipelago as Mauritian. In the late 1960s, the US asked the UK to expel everyone from the archipelago so they could build a naval support facility on the largest island, Diego Garcia. It is leased to the US but operates as a joint UK-US base. The UK has been under pressure to hand back control of the territory, after the UN and the International Court of Justice sided with Mauritius. The treaty said the deal would \"complete the process of decolonisation of Mauritius\". Tory leader Kemi Badenoch said that \"surrendering\" the Chagos Islands to Mauritius \"is an act of national self-harm\". \"It leaves us more exposed to China, and ignores the will of the Chagossian people. And we're paying billions to do so,\" she said. Reform UK leader Nigel Farage echoed those comments, accusing Sir Keir of caring more about foreign courts \"than Britain's national interest\". 'Deal inherited from Tories' However, Sir Keir said he \"inherited a negotiation in which the principle of giving up UK sovereignty had already been conceded\" by the Tories. He said \"all of the UK's allies\" support the deal, including the US, NATO, Five Eyes and India, and that those who are against it include \"Russia, China, Iran...and surprisingly, the leader of the opposition, and Nigel Farage\". Defence Secretary John Healey, who was also at the news conference, added that the last government failed to strike a deal despite 11 rounds of talks, leaving Labour to \"pick up the challenge\". He said ministers \"toughened the terms and the protections and the control that Britain can exercise through this treaty\". Under the deal's terms, a 24-nautical mile buffer zone will be put in place around the island where nothing can be built or placed without UK consent. The UK will retain full operational control of Diego Garcia, including the electromagnetic spectrum satellite used for communications which counters hostile interference. Marco Rubio, the US Secretary of State, said he welcomed the \"historic agreement\", saying it \"secures the long-term, stable and effective operation of the joint US-UK military facility at Diego Garcia, which is critical to regional and global security\". \"We value both parties' dedication. The US looks forward to our continued joint work to ensure the success of our shared operations,\" he said. The agreement had been due to be signed on Thursday morning but was temporarily blocked by an injunction hours before. A High Court Judge subsequently discharged the injunction at midday."
    },
    {
        "title": "Netanyahu launches attack on Starmer, Macron and Carney after embassy shooting",
        "description": "Benjamin Netanyahu has blamed Sir Keir Starmer, Emmanuel Macron and Mark Carney for fuelling antisemitism after two Israeli embassy workers were shot dead in Washington DC.",
        "url": "https://news.sky.com/story/netanyahu-launches-attack-on-starmer-macron-and-carney-after-embassy-shooting-13372966",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/5234a1998c7cf98774e58729718fcf8d956da80b188a2ca5484387ad5417f5d1_6924417.jpg?20250522222244",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-22 19:47:00",
        "Headline": "Israeli embassy workers Yaron Lischinsky and Sarah Lynn Milgrim were shot dead by Elias Rodriguez, who shouted \"free, free Palestine\" as he was arrested.",
        "Content": " Benjamin Netanyahu has blamed Sir Keir Starmer, Emmanuel Macron and Mark Carney for fuelling antisemitism after two Israeli embassy workers were shot dead in Washington DC. Mr Netanyahu said the leaders of the UK, France and Canada are \"on the wrong side of humanity and (...) history\" after they threatened \"concrete action\" against Israel this week if it continues its \"egregious\" military operations in Gaza. He linked the criticism of Israel's renewed military offensive in the enclave to the shooting outside the Capital Jewish Museum in Washington DC last night. The shooter, named as 31-year-old Elias Rodriguez from Chicago, Illinois, told a witness that he \"did this for Gaza\" before shouting \"free, free Palestine\" as he was being detained.  The two victims, Yaron Lischinsky and Sarah Lynn Milgrim, worked at the Israeli embassy and had attended an event for young Jewish professionals at the museum before they were shot dead. Israel's foreign minister Gideon Sa'ar called the shooting a \"direct result of antisemitic enticement\" that is \"absolutely toxic and has been used across the world\" since the 7 October 2023 attacks by Hamas. Mr Sa'ar said there is a \"direct line\" between those speaking against Israel's actions in Gaza, which he calls \"blood libels\", and the killings in Washington DC. \n                  Bono calls for Israel to be 'released from Benjamin Netanyahu' in plea to 'stop war'\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Is the Middle East Trump's comfort zone?  \n                 \"This incitement is also done by leaders and officials of many countries and international organisations, especially from Europe,\" he said. The term dates back to the Middle Ages when Jewish people were falsely accused of using the blood of Christians and non-Jewish children for religious rituals such as Passover. This was then used as justification for deadly violence against Jewish people. The term, while highly contentious and offensive to many, is now used to describe antisemitism or violence against Jewish people, which the perpetrators claim is justified by Israel's war against Hamas in Gaza. Mr Netanyahu echoed those statements, describing the shootings as the \"terrible price of antisemitism\" and \"rampant incitement against the State of Israel\". \"Blood libels against the Jewish state cost blood,\" he said in his statement. Amichai Chikli, Israel's diaspora minister, also accused the leaders of the UK, France and Canada of \"emboldening the forces of terror\". In a post on X, he said those who give \"backing to this hatred - whether through appeasement, double standards, or silence,\" must be held to account. Mr Chikli added: \"French President Emmanuel Macron, British Prime Minister Keir Starmer, and Canadian Prime Minister Mark Carney have all, in different ways, emboldened the forces of terror through their failure to draw moral red lines. \"This cowardice has a price - and that price is paid in Jewish blood.\" Israeli diplomats have since distanced themselves from the comments by Mr Chikli. A French foreign ministry spokesperson has since rejected the claim that European nations bear blame for the attack as \"completely outrageous and completely unjustified\". \"France has condemned, France condemns and France will continue to condemn, always and unequivocally, any act of antisemitism,\" the spokesman told AFP. Read more about the shooting:Rodriguez accused Israel of 'atrocities' in GazaTrump team will worry about shooter being glorified In response to the shooting, Sir Keir said he \"thoroughly condemns\" the incident and that \"antisemitism is an evil we must stamp out wherever it appears\". Mr Macron also posted about the \"antisemitic attack\", offering his condolences to the families and loved ones of the victims."
    },
    {
        "title": "Net migration halves in UK, new data shows",
        "description": "Net migration has fallen sharply in the UK, the latest official figures show.",
        "url": "https://news.sky.com/story/net-migration-halves-in-uk-new-data-shows-13372514",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-uk-border-force-manchester-airport_6759946.jpg?20250522132654",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-22 07:53:00",
        "Headline": "The data, published by the Office for National Statistics (ONS), estimates that net migration has halved from 860,000 in the year ending December 2023 to 431,000 in the year ending December 2024.",
        "Content": "Net migration has fallen sharply in the UK, the latest official figures show. The data, published by the Office for National Statistics (ONS), estimates that net migration has halved from 860,000 in the year ending December 2023 to 431,000 in the year ending December 2024. The drop is the largest ever recorded for a 12-month period, and marks the most significant calendar-year fall in net migration since the early stages of the pandemic. Politics latest: Net migration to the UK estimated to have halved Meanwhile, long-term immigration fell below one million for the first time in around three years. That was estimated to be 948,000 in the year ending December 2024, down by almost a third from 1,326,000 in the previous 12 months and below a million for the first time since the 12 months to March 2022.  Emigration rose by around 11% to an estimated 517,000 for the year to December, up from 466,000 in the previous year. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  Reeves vs Starmer: Inside the 'rift' in Downing Street\n                 Home Secretary Yvette Cooper hailed a 300,000 drop in net migration since the start of the Labour government last July as \"important and welcome\". She said: \"These figures show a big increase in returns of failed asylum seekers and foreign national offenders, record levels of illegal working penalties, and the asylum backlog and hotel use coming down.\" Net migration hit a record high of 906,000 in June 2023, and stood at 728,000 in the year to June 2024, shortly before Labour took over from the previous Conservative government. But former home secretary James Cleverly said while Labour \"will try to claim credit\" for the falling numbers, the changes are a result of policies enacted while he was in government. What caused this fall in net migration? The sharp fall reported on Thursday is thought to be driven by a decrease in immigration from non-European Union nationals. The ONS also noted plummeting numbers of people coming to work and study in the UK. Additionally, these estimates follow restrictions introduced under the Conservatives in early 2024 on people eligible to travel to the UK on work or study visas. Mary Gregory, the director of population statistics at the ONS, said the fall is \"driven by falling numbers of people coming to work and study, particularly student dependants\". She said: \"There has also been an increase in emigration over the 12 months to December 2024, especially people leaving who originally came on study visas once pandemic travel restrictions to the UK were eased.\" Read more from Sky News:Chemical castration for sex offendersJudge blocks Chagos Islands deal The new estimates come less than a fortnight after Sir Keir Starmer set out a series of measures aimed at reducing further the number of people moving long term to the UK. The prime minister, who said the country risks becoming an \"island of strangers\" without better integration, said he wanted net migration to have fallen \"significantly\" by the next general election - but refused to set a target number. Sir Keir's plan includes reforming work and study visas and requiring a higher level of English across all immigration routes, and is expected to reduce the number of people coming to the UK by up to 100,000 per year. However, the Conservatives have claimed credit for the fall. Former home secretary James Cleverly said while Labour \"will try to claim credit\", the changes are a result of policies enacted while he was in government. He said: \"This drop is because of the visa rule changes that I put in place. Labour will try to claim credit for these figures but they criticised me at the time, and have failed to fully implement the changes.\""
    },
    {
        "title": "Doctors and teachers offered 4% pay rise in England and Wales",
        "description": "Doctors and teachers will be given a 4% pay rise after the government accepted recommendations from independent review bodies.",
        "url": "https://news.sky.com/story/doctors-and-teachers-offered-4-pay-rise-in-england-and-wales-13372767",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-junior-doctors-bma_6924310.jpg?20250522163129",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-22 14:42:00",
        "Headline": "The salary increases are 2.8% higher than what the government originally budgeted for, but unions say they are still inadequate in tempering inflation and historical pay freezes.",
        "Content": "Doctors and teachers will be given a 4% pay rise after the government accepted recommendations from independent review bodies. The salary increases, announced by ministers on Thursday afternoon, are 2.8% above what the government had originally budgeted for. The 4% rise is just above the current rate of inflation, which increased from 2.6% in March to 3.5% in April. It will apply to all doctors and teachers in England and Wales. But both the British Medical Association (BMA) and National Education Union (NEU) have threatened further strike action following the announcement, claiming the increases do not account for historical pay freezes. Other NHS workers in England, including nurses, midwives, and physiotherapists, will get a 3.6% pay increase effective from 1 April, Health Secretary Wes Streeting said. He added that junior doctors would be offered an average increase of 5.4% as a result of a further £750 top-up. Read more from Sky NewsChemical castrations proposed for sex offendersWhat is chemical castration?Data reveals net migration has halved to the UK Senior civil servants will get a 3.25% pay increase, the Cabinet Office added, but there are still changes to be made to higher salary bands within the civil service. Prison officers and managers will get the same 4% pay rise as doctors and teachers, Justice Secretary Shabana Mahmood said. Military personnel are being offered a 4.5% rise following their own independent pay review. Senior military officers will get a slightly lower boost of 3.75%, with Defence Secretary John Healey saying the changes \"recognise their dedication to keep Britain secure at home and strong abroad\". Unions say offers are 'woefully inadequate' The government's proposals on pay have been met with anger among healthcare unions, with the BMA describing its offer for doctors as \"woefully inadequate\". Professor Philip Banfield, chairman of the BMA council, said doctors are already considering striking again. \"Doctors' pay is still around a quarter less than it was in real terms 16 years ago and today's 'award' delays pay restoration even more, without a government plan or reassurance to correct this erosion of what a doctor is worth,\" he said. Other NHS workers who belong to either the Royal College of Nursing (RCN) or GMB unions are being asked to vote on whether they will accept their offers or not. RCN general secretary and chief executive Professor Nicola Ranger warned pay increases have already been \"entirely swallowed up by inflation and do nothing to change the status quo - where nursing is not valued, too few enter it and too many quit\". Schools will have to fund 1% themselves While education unions have been less resistant, the NEU, which is the largest teacher union, threatened to \"register a dispute\" with the government if it does not fund all of the pay rises itself - as they are currently being offered as part of existing school budgets, which they insist are needed for pressing matters outside staffing. Schools will be given an additional £615m towards the pay increases this financial year, but they will be expected to find the final 1% of the 4% rise themselves - \"through improved productivity and smarter spending\". Education Secretary Bridget Phillipson said: \"I believe schools have a responsibility, like the rest of the public sector, to ensure that their funding is spent as efficiently as possible.\" General secretary of the TUC Paul Nowak said further negotiations with the government would be needed to resolve outstanding issues. He said his and other unions want to \"work with the government to address the recruitment and retention crisis gripping our public services\". \"Ministers need to talk directly to unions to address the root causes behind dedicated and experienced public servants quitting their professions,\" he warned. \"We need a clear, jointly-agreed long-term strategy to improve public-sector pay, alongside other crucial issues such as better working hours, more manageable workloads and enhanced flexible working options.\""
    },
    {
        "title": "Botched partial winter fuel U-turn could have profound consequences for Starmer",
        "description": "The utter crass political mishandling of yesterday's botched partial winter fuel U-turn could have profound consequences for Sir Keir Starmer.&#160;",
        "url": "https://news.sky.com/story/botched-partial-winter-fuel-u-turn-could-have-profound-consequences-for-starmer-13372717",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-labour_6922820.jpg?20250520230945",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-05-22 13:04:00",
        "Headline": "The PM bowed to pressure from Labour MPs on Wednesday when he said he would extend the winter fuel payment to more pensioners after cutting it.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n The utter crass political mishandling of yesterday's botched partial winter fuel U-turn could have profound consequences for Sir Keir Starmer.  And now, whether bad things flow from his obtuse but significant comments in the Commons chamber yesterday will depend, among other things, on the vagaries of the global economy and the riptides of the trade union movement. Here is why: At the point of the autumn budget last year - when Rachel Reeves spent more than signalled in the election campaign, funded by borrowing more than the markets expected and raising taxes that weren't foreshadowed in the manifesto - those whose livelihood depends on forecasting the response of the debt markets had one question. Politics latest: Starmer's Chagos Island deal gets last-minute green light They wanted to know: is that it? Is that the extent of the big spending splurges that the chancellor would perform? Because, although there was a big unsignaled boost to spending, borrowing and taxing last November, the markets' judgement was - more or less - that was fine provided she was able to hold the line at broadly this level of spending and borrowing and no more. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  Reeves vs Starmer: Inside the 'rift' in Downing Street\n                 Clad in her cast iron armour, Ms Reeves insisted that was it. A \"once a parliament\" budget, she said, meaning no more substantial tax hikes.  An upfront public spending boost, but then Tory levels of restraint in rises in the second half of the parliament. She would hold the line, she promised. But the question still lingered: what would happen in a less benign political climate? The manifesto contained tough decisions, like the two-child spending cap which Labour MPs were required to endorse to stand and keep the whip. Initially, actions like the suspension of the whip from the likes of John McDonnell for rebelling on spending signalled they were prepared to face down spending demands. Yesterday's botched partial U-turn has blown that narrative sky high. No 10 and No 11 have crossed a rubicon. They have provided a precedent whereby they whip out the cheque book in the face of political pressure, even though we are years from a general election. Not only did No 10 fold, but they evidently did so without any semblance of a plan of what they would actually do with winter fuel allowance or how much they would spend on mitigation, or how that would be funded. Perhaps they had no plan because they too waited for the Institute for Fiscal Studies press release laying out the options. That's how we work out what will probably happen - maybe that's their trick too. Read more:Ex-PM suggests people on top rate of income tax should be excluded from winter fuel allowanceNet migration halves in UK Now look at this morning's Guardian. The excellent Pippa Crerar, the political editor wronged by a Number 10 denial of her winter fuel climbdown story last week, reports more welfare climbdowns on the card, including potentially a change or removal of the two-child cap. Others have said the same to me. I make no moral judgment about the two-child cap, that's not my job. Many Labour MPs find it abhorrent. But it performed a vital function in the manifesto: it was a signal to the markets that Labour can take and stick to the difficult fiscal decisions that the current state of the public finances demands. The two-child cap was Ms Reeves's pre-nuptial agreement with the buyers of UK government debt. She breaks that as a result of political pressure at her peril. She may claim better economic news in recent days gives her wiggle room - today's borrowing figures and the sheer level of global uncertainty (what would Israel bombing Iran do to petrol prices, for instance) suggest caution might be a worthwhile path. Just this morning, Bloomberg is warning long-term bond yields are going up all over the world, including the UK. The question now is where does the spine crumbling end? Who knows now how much this government will recoil when there's the next rebellion. Or when the unions up the pressure, as they surely will at some point before the next election. Take just one example. Today, public sector pay awards have been flopping into our inboxes. GMB Union has begun balloting NHS and ambulance workers in England on this year's 3.6% pay award. How much will ministers be prepared to pay in the next 18 months to stop strikes breaking out? We just don't know. And more importantly, we don't get a sense Ms Reeves does either. After yesterday, levels of certainty about the course of government decision-making took a hit. Will they end up being punished by the markets for this? Some believe they could. It seems we must return to watching the cost of government debt for the rest of this parliament."
    },
    {
        "title": "'Chancellor Gordon Brown' returns",
        "description": "Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics.   ",
        "url": "https://news.sky.com/story/chancellor-gordon-brown-returns-13372489",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-22 06:40:00",
        "Headline": "No subtitle found",
        "Content": "Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics.    👉Listen to Politics at Sam and Anne's on your podcast app👈 As Sir Keir Starmer waves goodbye to the Chagos Islands and his planned cuts to the winter fuel allowance, Sam and Anne assess what it all means. How much \"backseat driving\" on the winter fuel U-turn has come from former chancellor Gordon Brown? And what's the best way to implement a volte-face? And what do the Gauke reforms, set to be accepted by Justice Secretary Shabana Mahmood, mean for our stretched prison and probation services?"
    },
    {
        "title": "What is chemical castration? Here's why doctors will be uneasy about using it on sex offenders",
        "description": "Chemical castration has been used on sex offenders in several countries over many years, with some success - but it remains controversial.",
        "url": "https://news.sky.com/story/what-is-chemical-castration-heres-why-doctors-will-be-uneasy-about-using-it-on-sex-offenders-13372590",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-crime-preston-prison_6913736.jpg?20250522111538",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-05-22 09:51:00",
        "Headline": "Sex offenders could face chemical castration under plans proposed in a sentencing policy review set to be accepted by ministers.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n Chemical castration has been used on sex offenders in several countries over many years, with some success - but it remains controversial. The principle of treatment, when used on men, is to inhibit the action of the sex hormone testosterone. The expectation is that the offender will have fewer sexual fantasies and a lower sex drive. Many of the drugs are more widely used to treat prostate cancer, where they reduce the growth of hormone-sensitive tumours. But they vary in how effective they are at treating sex offenders - and how swiftly they act.  Sky News was given exclusive access to a clinical trial in Stockholm, Sweden, of a drug called degarelix. Results showed that just two weeks after the first injection, men - who were living in the community - had a significantly reduced risk of committing child sexual abuse. \n                  Labour say there's been a 'massive increase' in NHS appointments - this begs to differ\n                 \n                  Starmer's winter fuel cut U-turn claim 'not credible'\n                 \n                  The 'scary spotlight' on music stars amid Kneecap terror charge\n                 But like other clinical trials, it was relatively small with only 52 men taking part. The evidence base for chemical castration is limited. The drugs can also have side effects, including the development of breast tissue in men, depression and hot flushes. And some criminologists question whether lower reoffending rates really are as a result of treatment. It's possible that men offered a shorter prison sentence in exchange for taking a drug to suppress testosterone may simply be motivated to stay out of prison when they are released. That hasn't stopped many countries using chemical castration. Germany, Denmark and the UK have used it on men who volunteer for treatment. Read more:Chemical castration for sex offenders to be consideredMen's prisons 'could run out of space in months' In England, a trial has been running in prisons in the South West since 2022 - and is now being cited by the Home Office as a reason to expand a treatment programme to 20 regions around the country. But the drugs have been used in the UK far longer. In 2012, it was revealed that around 100 sex offenders were being treated at HMP Whatton in Nottinghamshire, either with chemical castration or with drugs such as Prozac, which can alter patterns of thinking. Justice Secretary Shabana Mahmood is reported to be considering making treatment compulsory for serious sex offenders. That would be deeply controversial with the medical profession in the UK. Consent is a long-standing principle of treatment with any procedure.  But in the US, chemical castration is mandatory for some men in several states. California was the first, amending its penal code in 1996 to include it as a punishment for those convicted of sexual abuse of minors. Florida, Texas, Louisiana are among those that followed suit. Poland, Russia, Moldova, and Estonia have also introduced compulsory treatment for paedophiles. But in the UK, without strong evidence on the risks and benefits of using the drugs, there will be professional unease about forcing men to undergo castration - even if they are convicted of the most heinous sexual offences against children."
    },
    {
        "title": "Extra cancer screenings for women with dense breasts could save hundreds of lives, study finds",
        "description": "Extra cancer screenings for women with dense breasts could save hundreds of lives, according to a new study.",
        "url": "https://news.sky.com/story/extra-cancer-screenings-for-women-with-dense-breasts-could-save-hundreds-of-lives-study-finds-13372492",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cancer-mammogram_6923831.png?20250522093202",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-22 06:50:00",
        "Headline": "Louise Duffield, a 60-year-old grandmother of four from Ely in Cambridgeshire, was diagnosed with early-stage breast cancer as a result of the trial.",
        "Content": "Extra cancer screenings for women with dense breasts could save hundreds of lives, according to a new study. Researchers from the University of Cambridge found extra scans for some women could identify an extra 3,500 early-stage cancers that can be \"hidden\" during regular mammograms. Around 10% of women have very dense breasts, which means they have more fibrous and glandular tissue and less fatty tissue than other women. These women are up to four times more likely to develop breast cancer compared to women with low breast density. More than 2.2 million women receive breast screening in the UK each year but mammograms, which are used for breast screening, can be less effective at detecting cancer in dense breasts. This is because denser breasts look whiter on mammograms, which makes it harder to spot small early-stage cancers which also appear white. Some 9,361 women across the UK with dense breasts whose mammograms showed they did not have cancer were studied in the trial, which has been published in the Lancet medical journal. A total of 85 cancers were found among these women when the scientists trialled three extra testing methods. Louise Duffield, a 60-year-old grandmother of four from Ely in Cambridgeshire, was diagnosed with early-stage breast cancer as a result of the trial. In 2023, she was invited to take part following her regular mammogram, which showed that she had very dense breasts. As part of the trial, Ms Duffield had an AB-MRI scan, a faster type of MRI, which identified a small lump deep inside one of her breasts. Soon after the MRI, Ms Duffield had a biopsy that confirmed she had very early breast cancer within the ducts of one of her breasts. Six weeks later, she had surgery to remove the tumour - by that time, it had already grown larger than it appeared on the scans. \"It's been a stressful time and it's a huge relief to have it gone,\" said Ms Duffield. \"The tumour was deep in the breast so if I hadn't been on the trial, it could have gone unnoticed for years.\" The location of her tumour meant it would have been hard for Ms Duffield to find through self-examination, and since it was not detected during her regular mammogram, it would have been at least three years before she was invited for another. The two methods examined in the trial were contrast-enhanced mammography (CEM), where dye is used to make blood vessels more visible, and AB-MRIs. The experts calculated that adding either of these methods to existing breast screening could detect 3,500 more cancers per year in the UK. As screening reduces death for about 20% of cancers detected, this could mean an extra 700 lives saved each year, they said. Read more from science, climate and tech:Can Labour's new local cash idea win over Reform voters?West Nile virus found in UK mosquitos for first timeFacial recognition tech finds sex offender with six-year-old girl A Department for Health and Social Care spokesperson said: \"Research is being conducted into the use of additional tests for women with dense breasts, as part of the NHS breast screening programme. \"The UK National Screening Committee is reviewing this evidence as it becomes available.\""
    },
    {
        "title": "Australia floods: Natural disaster declared in New South Wales as four months of rain falls in just two days",
        "description": "A natural disaster has been declared in Australia after unprecedented floods in New South Wales.",
        "url": "https://news.sky.com/story/australia-floods-natural-disaster-declared-in-new-south-wales-as-four-months-of-rain-falls-in-just-two-days-13372439",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-australia-floods_6923752.jpg?20250522032119",
        "type": "Technology",
        "Author": "Connor Sephton",
        "Date Published": "2025-05-22 02:22:00",
        "Headline": "At least one person has died and there are \"grave fears\" for three others who are missing - with 50,000 told they must prepare to isolate. ",
        "Content": "\n          News reporter\n              @ConnorSephton\n A natural disaster has been declared in Australia after unprecedented floods in New South Wales. More than four months' worth of rain has fallen in the past two days - and at least one person is known to have died. The body of a 63-year-old man was found in a flooded home about 186 miles north of Sydney, in a hard-hit town where farms have been washed away and roads destroyed. Police say there are \"grave fears\" for three others who are missing - including a 60-year-old woman and two men aged 25 and 49. \"We should be bracing for more tough news over the next 24 hours,\" New South Wales Premier Chris Minns told ABC News. People across the state have been warned that the situation may get worse between now and Friday, with 50,000 told they must prepare to isolate. Entire towns have been cut off - with more than 100 schools closed and an estimated 5,300 businesses and homes without power. \n                  Ben Roberts-Smith: Australia's most decorated living war veteran loses defamation appeal over Afghanistan killings\n                 \n                  Mum in court accused of killing three people with poisonous mushrooms - what you need to know\n                 \n                  Australian PM Anthony Albanese wins re-election\n                 Essential Energy, which maintains electricity infrastructure across New South Wales, fears the outages could last for days because of extensive damage to power lines. Some of those affected by the record flooding have been stranded for hours as they await rescue, with fast-flowing water making it too dangerous to send out boats. The treacherous conditions also mean it has been difficult to deploy helicopters. Andrew Edmunds, a spokesperson for Australia's State Emergency Service, said there are \"about 100 to 150 incidents that we are yet to get to, because access is not really possible\". Two people in their 70s were winched to safety from the roof of their car after driving into floodwaters, and were checked over by paramedics. Read from Sky News:Tornado and funnel cloud might hit parts of UKLong-term weather forecasts could get more accurate Forecasters say further life-threatening flash floods are possible in the coming hours, and some areas could receive up to 300mm (12in) of rain by Friday. Government ministers have told local media that \"we aren't over the worst of it yet\" - especially considering that some rivers are still to peak. New South Wales is prone to flooding. Jeremy Thornton, a local insurance broker, told ABC News that this makes it \"impossible\" for some homeowners to take out a policy. He revealed that some companies refuse to offer quotes in vulnerable postcodes - with one person told that their premium would cost half of their yearly wage."
    },
    {
        "title": "The 'scary spotlight' on music stars amid Kneecap terror charge",
        "description": "Before the amps are even switched on in Brockwell Park, there's been a lot of noise about who should or shouldn't be performing.",
        "url": "https://news.sky.com/story/the-scary-spotlight-on-music-stars-amid-kneecap-terror-charge-13373097",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kneecap-irish-band_6902809.jpg?20250501172410",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-22 23:58:00",
        "Headline": "As Kneecap court controversy - and one member faces a terror charge - over their political stances, Sky News speaks to artists about the risks of being outspoken at a time the world is so divided.",
        "Content": "\n          Arts and entertainment correspondent\n       Before the amps are even switched on in Brockwell Park, there's been a lot of noise about who should or shouldn't be performing. It's where Irish hip-hop trio Kneecap are set to play their first major show since band member Mo Chara was charged for allegedly displaying a flag in support of the terrorist group Hezbollah at one of their gigs. Before that, there had been calls for festivals to reconsider booking the band over their political stances, and several have done, which prompted artists like Brian Eno, the Mystery Jets and CMAT to sign an open letter accusing Westminster and the British media of a campaign to \"remove Kneecap from the public eye\". They put their names to wording that said \"in a democracy, no political figures… have the right to dictate who does and does not play at music festivals.\" The band have since claimed they're the victims of \"political policing\" designed to silence their views on Gaza. So what's the reality like for artists who are outspoken at a time when the world is so divided? As some of the biggest names in music gathered in London for the Ivors, an annual celebration of songwriting, Self-Esteem - aka Rebecca Lucy Taylor - said the level of scrutiny can be \"terrifying\". 'The problem with the internet' She told Sky News: \"The problem with the internet is you say one thing, which gets scrutinised, and then you shit yourself, you really do… then you're advised not to. And then you're like 'don't advise me not to!' \"You second-guess anything you want to say any more… but any time I do that, I think 'well that's why you've got to say it then'.\" She said it can be frustrating that focus turns on to pop stars' opinions instead of \"the people doing the bad things\". Read more:Why are Kneecap controversial? 'Being a pop artist isn't just about the music' Former Little Mix singer Jade said: \"To be a pop artist these days, it's not just about music, it's: 'What's your political stance?' \"I've always been quite vocal about those things, but in doing so you have even more of a scary spotlight on you, constantly assessing what your thoughts are as a human…it is scary.\" Trinidad-born London artist Berwyn, whose songs depict his struggles with UK immigration, says: \"Silencing freedom of speech… is a road we don't want to walk down. \"I'm not a politician, this is a very complicated issue, but I do absolutely believe in a human's right to express themselves freely.\" But is that freedom of speech dependent on what side you're coming from? 'Unethical investments' Soon, an event called Mighty Hoopla will take place at Brockwell Park as part of its programme of six festivals this summer. Artists performing at that are coming under increased pressure from pro-Palestine groups to quit because it's owned by a company called Superstruct, which has links to an American investment firm called KKR. Critics argue that any KKR-affiliated events should be a red flag to artists as campaigners claim it \"invests billions of pounds in companies\" that do things like \"develop Israeli underground data centres\", and they say it has shares in companies that \"advertise property on illegally occupied land in the West Bank\". 👉 Listen to Sky News Daily on your podcast app 👈 Mighty Hoopla itself has said while it \"cannot control investments made in our parent companies\", it wants to \"state its clear opposition to KKR's unethical investments\". And Superstruct - which puts on over 80 festivals around the world - says while horrified by the crisis in Gaza: \"We are aware that there is a significant amount of debate… around our festivals. \"Our owners, made up of our promoters and several investment firms, support us to achieve the highest standards... fans and artists rightly expect.\" They insist that operationally, Superstruct is independently run and all its \"revenue and profits… remains entirely within our business… towards the ongoing development… of our festivals.\" Read more from Sky News:Kid Cudi says Diddy 'messed with his dog'Bono calls for Israel to be 'released from Netanyahu'Chris Brown posts message as singer is bailed Even deciding where to perform can have political connotations for musicians these days. As Tom Gray, a founding member of the rock band Gomez, now chair of the Ivors, explains: \"The amount of commercial interest required to get a young artist into the public eye means they have to keep their head down a lot and that's a terrible shame. \"It's not just artistic expression, but personal human expression is one of the fundamental things that allows people to feel they have agency.\""
    },
    {
        "title": "Kid Cudi says Sean 'Diddy' Combs broke into his house and 'messed with his dog'",
        "description": "Kid Cudi has told a court Sean \"Diddy\" Combs broke into his home, \"messed with\" his dog and opened some of his Christmas presents during a break-in in December 2011.",
        "url": "https://news.sky.com/story/kid-cudi-says-sean-diddy-combs-broke-into-his-house-and-messed-with-his-dog-13372988",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kid-cudi-sean-diddy-combs_6924601.jpg?20250522215021",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-22 20:38:00",
        "Headline": "On the ninth day of the Sean \"Diddy\" Combs trial, Kid Cudi told the jury his Porsche was written off after a Molotov cocktail posted inside a hole cut in the roof, shortly after Diddy broke into his home.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Kid Cudi has told a court Sean \"Diddy\" Combs broke into his home, \"messed with\" his dog and opened some of his Christmas presents during a break-in in December 2011. The 41-year-old rapper was giving evidence on day nine of the trial, after briefly dating Diddy's former girlfriend Cassie the same year. Cassie and Diddy dated for 11 years, from 2007 to 2018, and Cassie has testified the rapper physically abused her during most of their relationship. Cudi described Cassie phoning him early one morning, sounding \"stressed, nervous and scared\", telling him Diddy had \"found out about us\". He said Diddy later called him from his home and told him, \"I'm here waiting for you\". After dropping Cassie at a West Hollywood hotel, Cudi said he returned to his home and found no one there, but said his dog had been locked in the bathroom. He described his pet later becoming \"jittery and on edge all the time\". He also said someone had opened Christmas presents he'd bought for his family. While Cudi, whose real name is Scott Mescudi, said he initially wanted \"to fight\" Diddy, he later thought through \"the reality of the situation,\" and called the police to report the break-in. Earlier this week, Cassie finished giving four days of evidence, becoming emotional at times, and testifying that Combs had threatened to blow up Cudi's car and hurt him after he learned she was dating him by looking at messages on her phone during a \"freak off\". Prosecutors say Combs, the founder of Bad Boy Records, forced women to take part in days-long, drug-fuelled sexual performances known as \"Freak Offs\" from 2004 to 2024, facilitated by his large retinue of staff. Combs, 55, has pleaded not guilty. The rapper faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. Sean 'Diddy' Combs trial: Day 9 - As it happened The month after the break-in, Cudi's Porsche was firebombed in his drive, with a hole cut into the roof and a Molotov cocktail dropped into the driver's seat. Cudi said he realised he had to talk to Diddy, before things \"got out of hand,\" meeting up with Diddy, who he said was weirdly \"calm\" and staring out the window with his hands behind his back \"like a Marvel super villain\". Cudi says Diddy told him he had still been dating Cassie during his relationship with her, with Cudi replying: \"[Cassie] told me you were broke up, and I took her word for it.\" Shaking hands at the end of the conversation, Cudi said he asked Diddy about \"burning\" his car, and Diddy replied, \"I don't know what you're talking about\". Cudi later said he believed that to be a lie. Cudi says he saw Diddy once a few years later at Soho House in Los Angeles with his daughter, and Diddy told him: \"Man, I just want to apologise for all that bullshit\". Read more:Everything you need to know about the Sean Combs trialThe rise and fall of Sean 'Diddy' Combs During his cross-examination, the defence suggested Cassie had been \"living two different lives\", and \"played\" both Cudi and Combs. Cudi concluded his time on the stand, saying his relationship with Cassie ended because he wanted \"to give her space\" and \"the drama was too out of hand\". Celebrity make-up artist Mylah Morales also gave evidence, describing a fight between Cassie and Diddy in 2010, which she says left Cassie with a \"swollen eye, busted lip, and knots on her head\". Morales said while she had heard the row, she hadn't physically seen it as she wasn't in the room. She told the court, \"I feared for my life\", explaining that she took Cassie to her apartment for several days to recover, but that Cassie refused to go to hospital as she was afraid of Diddy's reaction. The defence attempted to damage Morales's credibility by listing her TV appearances, which included programmes on CNN, and with Don Lemon and Piers Morgan, attempting to paint her as attention-seeking. The day also saw Combs's former assistant George Kaplan complete his testimony. He talked about two occasions when he had been asked to carry cash for Diddy, who he said never paid for things himself in the moment, recalling one time in 2015 when he looked after $50,000, and another when he was asked to pick up $10,000. Kaplan described seeing \"regular\" physical violence between Cassie and Diddy, including an incident in 2015 with whisky glasses on a private plane, when he heard glass breaking and saw Diddy standing over Cassie in the plane's central aisle. He says he also saw Diddy hurling \"decorative apples\" at another of his girlfriends, Gina, late the same year, handing in his notice the following month. Also known throughout his career as Puff Daddy and P Diddy, Combs turned artists like Notorious BIG and Usher into household names, elevating hip-hop in American culture and becoming a billionaire in the process. Diddy has been held in the Metropolitan Detention Center in Brooklyn since September and faces at least 15 years or possibly life in prison if convicted. The trial is set to last for around six weeks in total and will go into its third week next week."
    },
    {
        "title": "Bono calls for Israel to be 'released from Benjamin Netanyahu' in plea to 'stop war'",
        "description": "Irish rock star Bono has called for Israel to be \"released from Benjamin Netanyahu and far-right fundamentalists\" during an awards ceremony.",
        "url": "https://news.sky.com/story/bono-calls-for-israel-to-be-released-from-benjamin-netanyahu-in-plea-for-peace-13372955",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bono-u2-singer_6924667.jpg?20250522230031",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-22 19:37:00",
        "Headline": "The U2 frontman's comments mark the first time the human rights activist has publicly spoken out against the Israeli prime minister since the war started.",
        "Content": "Irish rock star Bono has called for Israel to be \"released from Benjamin Netanyahu and far-right fundamentalists\" during an awards ceremony. The U2 frontman's comments at the Ivors mark the first time the human rights activist has spoken out in public against the Israeli prime minister since the war in Gaza broke out in October 2023. Bono, who received the Peace Summit Award at the 2008 Nobel Peace Laureates summit, also called for Hamas to release its remaining Israeli hostages. It comes as Western leaders have been criticising Mr Netanyahu and the Israeli authorities over the renewed offensive in the Palestinian territory and the risk of famine due to an 11-week aid blockade, which is slowly easing. Gaza war: Follow latest updates Bono, whose real name is Paul Hewson, said on Thursday evening at London's Grosvenor House: \"Peace creates possibilities in the most intractable situations. \"Lord knows there's a few of them out there right now. Hamas release the hostages. Stop the war. \n                  Netanyahu launches attack on Starmer, Macron and Carney after embassy shooting\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 \n                  Is the Middle East Trump's comfort zone?  \n                 \"Israel be released from Benjamin Netanyahu and far-right fundamentalists that twist your sacred texts. \"All of you protect our aid workers, they are the best of us.\" Bono, 65, made the call for peace as he and fellow U2 members each received an award from pop star Ed Sheeran. Read more from Sky News:What we know about Washington DC shooting victimsUK calls for investigation over West Bank gunfire The group became the first Irish songwriters to be awarded an academy fellowship at the 70th year of the awards. U2 then performed their song Sunday Bloody Sunday, which references the 1972 Bloody Sunday shootings in Londonderry, where members of the British army's Parachute Regiment opened fire at civil rights demonstrators. The group ended the evening with a performance of their 1988 song Angel Of Harlem.  Also on Thursday, Mr Netanyahu said UK Prime Minister Sir Keir Starmer was \"on the wrong side of humanity\" after he called for an end to the war in Gaza. In a video he shared on social media, the Israeli prime minister also attacked the leaders of France and Canada for their criticism of Israel's actions in the conflict. Mr Netanyahu specifically linked the criticism from the UK, France and Canada to the killings in Washington DC of Israeli embassy workers Yaron Lischinsky and Sarah Lynn Milgrim on Wednesday night."
    },
    {
        "title": "Kneecap star arrives at surprise gig with tape over his mouth after terror charge",
        "description": "Irish-language rap group Kneecap have performed a surprise London show, with one of its members showing up with tape over his mouth after he was charged with a terror offence.",
        "url": "https://news.sky.com/story/kneecap-announces-surprise-show-after-member-charged-with-terror-offence-13372829",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kneecap-ireland-gaza_6924697.jpg?20250523000359",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-22 15:44:00",
        "Headline": "One of the three rappers, Liam O'Hanna, was charged with displaying a flag in support of Hezbollah, at a concert in London, the Metropolitan Police said.",
        "Content": "Irish-language rap group Kneecap have performed a surprise London show, with one of its members showing up with tape over his mouth after he was charged with a terror offence. Liam O'Hanna, or Liam Og O Hannaidh, was charged with displaying a flag in support of Hezbollah, a proscribed organisation, at a concert in London last November, the Metropolitan Police said on Wednesday. Just hours later, Kneecap announced on their Instagram account \"we're back\", adding they would perform at the 100 Club on Oxford Street, London, on Thursday night. The post also included a quote by former Sex Pistols vocalist John Lydon, who told ITV's Good Morning Britain the rap trio \"maybe (...) need a bloody good kneecapping\" after footage of the band allegedly calling for the deaths of MPs emerged. O'Hanna arrived at the 100 Club ahead of the gig and was later seen going on stage with tape covering his mouth. He also joked about being careful with what he said before thanking his lawyer. It came after at least three police officers were seen walking into the venue at around 7.35pm on Thursday evening. \n                  Kneecap say terror charge is bid to 'silence' them\n                 \n                  Vandals damage Tesla cars in Belfast\n                 \n                  Northern Ireland shooting victim 'denied travel to Scotland for treatment'\n                 A short queue had formed outside before the doors opened five minutes earlier, including one man in a band T-shirt. The band said on X that the event sold out in 90 seconds, with 2,000 people on the waiting list. Kneecap apologised to the families of murdered MPs last month, but said footage of the incident at their concert had been \"exploited and weaponised\", adding that they \"never supported\" Hamas or Hezbollah. The rappers had gigs cancelled after the footage emerged and politicians pushed for Kneecap to be dropped from the Glastonbury Festival line-up, with Tory leader Kemi Badenoch calling for Kneecap to be banned. The group from Belfast in Northern Ireland is still set to headline Wide Awake Festival in south London on Friday. Read more from Sky News:Passengers injured after train hits trailer on level crossingPublication of final Letby inquiry report pushed back In response to the charge, the group said in a social media statement: \"14,000 babies are about to die of starvation in Gaza, with food sent by the world sitting on the other side of a wall, and once again the British establishment is focused on us. \"We deny this 'offence' and will vehemently defend ourselves, this is political policing, this is a carnival of distraction. \"We are not the story, genocide is, as they profit from genocide, they use an 'anti-terror law' against us for displaying a flag thrown on stage. A charge not serious enough to even warrant their crown court, instead a court that doesn't have a jury. What's the objective?\" The charge came after counter-terror police assessed a video said to be from a Kneecap concert. In the footage, O'Hanna is allegedly displaying a flag in support of Hezbollah at the O2 Forum in Kentish Town, London, on 21 November last year. Officers from the Met's Counter Terrorism Command were made aware of a video circulating online on 22 April and an investigation led to the Crown Prosecution Service authorising the charge, the force said. O'Hanna - who performs under the stage name Mo Chara - is due to appear at Westminster Magistrates' Court on 18 June."
    },
    {
        "title": "Kneecap say terror charge is bid to 'silence' them",
        "description": "Irish rap trio Kneecap have branded the charging of one of their members with a terror offence in the UK as \"political policing\" in a bid to \"silence voices of compassion\".",
        "url": "https://news.sky.com/story/kneecap-say-terror-charge-political-policing-in-bid-to-silence-them-13372522",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kneecap-liam-ohanna_6923875.jpg?20250522103002",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-22 08:11:00",
        "Headline": "Liam Og O hAannaidh - who performs under the stage name Mo Chara - will appear at Westminster Magistrates' Court next month.",
        "Content": "Irish rap trio Kneecap have branded the charging of one of their members with a terror offence in the UK as \"political policing\" in a bid to \"silence voices of compassion\". Liam Og O hAannaidh has been charged over the alleged displaying of a flag in support of Hezbollah, a proscribed organisation, at a gig at the O2 Forum in Kentish Town, London, on 21 November. The 27-year-old from Belfast in Northern Ireland - who performs under the stage name Mo Chara - is due to appear at Westminster Magistrates' Court on 18 June. In a statement on X, the group said: \"14,000 babies are about to die of starvation in Gaza, with food sent by the world sitting on the other side of a wall, and once again the British establishment is focused on us.\" The UN has since clarified the widely reported claim, saying an estimated 14,000 babies are in danger of acute malnutrition between April 2025 and March 2026 - within a year, not 48 hours. The group added: \"We deny this 'offence' and will vehemently defend ourselves. This is political policing. This is a carnival of distraction. We are not the story. Genocide is. \"As they profit from genocide, they use an 'anti-terror law' against us for displaying a flag thrown on stage. \"A charge not serious enough to even warrant their crown court, instead a court that doesn't have a jury. What's the objective? \"To restrict our ability to travel. To prevent us speaking to young people across the world. To silence voices of compassion. To prosecute artists who dare speak out. \"Instead of defending innocent people, or the principles of international law they claim to uphold, the powerful in Britain have abetted slaughter and famine in Gaza, just as they did in Ireland for centuries. \"Then, like now, they claim justification. \"The IDF units they arm and fly spy plane missions for are the real terrorists, the whole world can see it. \"We stand proudly with the people. You stand complicit with the war criminals. We are on the right side of history. You are not. \"We will fight you in court. We will win. Free Palestine.\" Officers from the Metropolitan Police's Counter Terrorism Command were made aware of a video circulating online on 22 April, the force said. An investigation led to the Crown Prosecution Service (CPS) authorising the charge. Read more from Sky News:Inside Diddy's star-studded partiesChris Brown released on bail Kneecap apologised last month to the families of murdered MPs after videos emerged allegedly showing the band calling for the deaths of MPs and shouting \"up Hamas, up Hezbollah\". The group said footage of the incident had been \"exploited and weaponised\", adding they have \"never supported\" Hamas or Hezbollah, which are banned in the UK. The incident led to gigs being cancelled and calls for the band to be dropped from the Glastonbury Festival and TRNSMT line-ups. The trio are due to headline Wide Awake Festival in south London on Friday. In an interview on Thursday morning, Ireland's deputy premier said Hezbollah or Hamas should not be conflated with the cause of the Palestinian people. Tanaiste Simon Harris said: \"To take Hamas first, Hamas is a despicable terrorist organisation. It carried out a brutal terrorist attack in Israel that has been condemned by Ireland and all right-thinking people. \"They offer the people of Palestine no future of hope or positivity. They shouldn't be in any way, shape or form given any succour - and aren't - by Ireland. \"When it comes to Hezbollah, I'm also the minister for defence in this country. We're fighting daily for justice for Private Sean Rooney. Hezbollah, again, is an illegal terrorist organisation that have brought pain, suffering and death to Irish peacekeepers.\""
    }
]