[
    {
        "title": "Rory McIlroy claims career Grand Slam with US Masters win",
        "description": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament.",
        "url": "https://news.sky.com/story/rory-mcilroy-claims-career-grand-slam-with-us-masters-win-13348424",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mcilroy-green-jacket_6885963.jpg?20250414005424",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:01:00",
        "Headline": "Northern Ireland's Rory McIlroy has won the 89th Masters at Augusta National, becoming only the sixth male golfer to complete the career Grand Slam.",
        "Content": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament. The Masters was the last major tournament left for McIlroy to complete the modern golf Grand Slam - a feat only five others have managed before him. McIlroy, who was making his 11th attempt at completing the Grand Slam, faced off Justin Rose in a sudden-death playoff to decide the Masters champion, after they finished tied on 11 under at the end of regulation on Sunday. 'So hard to stay patient' Speaking at a press conference after his victory, McIlroy said: \"You have to be the eternal optimist in this game. \"I have been saying it until I am blue in the face but I truly believe I am a better player now than 10 year ago. \"It is so hard to stay patient, keep coming back and not being able to get it done. \n                  Extinction Rebellion climate change protest disrupts PGA golf tournament in Connecticut\n                 \n                  Rory McIlroy's divorce off as couple look forward to 'new beginning'\n                 \n                  Scottie Scheffler: Charges against world number one golfer dropped after 'big misunderstanding' at PGA Championship\n                 \"There were points on the back nine where I thought, 'have I let this slip again?' but I responded and am really proud of myself. \"It has been an emotional week so I am thrilled to be last man standing.\" Just before slipping on a coveted green jacket during the presentation ceremony, the Northern Irishman said: \"It's my 17th time here and I started to wonder if it would ever be my time. \"I'm just absolutely honoured and thrilled and just so proud to be able to call myself a Masters champion.\" McIlroy had missed his six-foot putt for par, a bogey which dropped him back to 11 under, where he joined Rose - leading to a dramatic playoff between the two. Only five other golfers have been able to complete a career Grand Slam - Tiger Woods, Jack Nicklaus, Gary Player, Ben Hogan and Gene Sarazen. McIlroy is a two-time winner of the PGA Championship, claiming the prize in 2012 and 2014. The 35-year-old also won his first major title, the US Open, in 2011, and won the Open Championship in 2014. How did McIlroy clinch victory?  McIlroy recovered from losing his overnight two-shot advantage with an opening-hole double bogey to initially take control at Augusta National, only to blow a four-shot lead over his closing six holes. The world number two bogeyed the last to close a one-over 73 and slip back to 11 under alongside Rose, who overturned a seven-stroke deficit and posted a stunning final-round 66 to force a playoff. The players returned to the 18th for the playoff, where McIlroy made amends for his 72nd-hole blunder by firing a stunning approach to within three feet of the pin and making the birdie putt required for the win. After the winning putt dropped, McIlroy raised his arms towards the sky and let his putter fall behind him as he dropped to his knees overcome with emotion. He then embraced his wife Erica and daughter Poppy as chants of \"Rory! Rory!\" rang out around the green. 'Hard to put into words' Tony Denver, who was among those watching McIlroy from his home club in Holywood, County Down, told Sky News it was \"hard to put into words\" how he was feeling following the play-off, as crowds in the background cheered and applauded the world's number two golf player. Mr Denver went on to say the feeling was \"absolutely fantastic\", adding he remembers McIlroy \"from a young lad growing up and he's now one of the six players to win the Grand Slam which is just unbelievable\". Ruth Watt, lady captain of Holywood golf club, said: \"We are all immensely proud, absolutely delighted to be welcoming Rory back home in that green jacket. \"He has put us through the ringer tonight but what an outcome.\" She added: \"There was always something very special about the golf that he played but he is such a gentleman and such a lovely, lovely person.\" For the club, McIlroy's victory is just \"phenomenal\", she said."
    },
    {
        "title": "At least 34 dead in Ukrainian city of Sumy after Russian missile strikes",
        "description": "At least 34 people - including two children - have been killed after a Russian missile attack on a Ukrainian city.",
        "url": "https://news.sky.com/story/at-least-34-dead-in-ukrainian-city-of-sumy-after-russian-missile-strikes-13348179",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sumy-missile-strike_6885017.jpg?20250413101027",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 14:41:00",
        "Headline": "Volodymyr Zelenskyy says \"only scoundrels can act like this\" after a Russian missile strike killed at least 34 people.",
        "Content": " At least 34 people - including two children - have been killed after a Russian missile attack on a Ukrainian city. The country's state emergency service said another 117 people have been injured, with 15 children among them, in the northeastern city of Sumy. Ukraine's foreign ministry later added that one of the children injured was a baby girl born this year, saying \"even newborns are targets for Russia's crimes\". Volodymyr Zelenskyy also shared videos on Telegram of the aftermath of the attack on social media, showing dead bodies in the middle of a city street near a destroyed bus. As it happened: Russian attack is 'signal' to US and Ukraine Russia 'dragging out this war' - Zelenskyy The Ukrainian president said on social media \"only scoundrels can act like this\" and that \"tough reaction from the world is needed\". \"Russia wants exactly this kind of terror and is dragging out this war,\" he added. \"Without pressure on the aggressor, peace is impossible. \"Talks have never stopped ballistic missiles and air bombs. We need the kind of attitude towards Russia that a terrorist deserves.\" Andriy Kovalenko, a security official who runs Ukraine's centre for countering disinformation, noted the strike came after a visit to Moscow by US envoy Steve Witkoff.  US official: 'This is wrong' Keith Kellogg, Donald Trump's envoy for the Ukraine war, said the attack crosses \"any line of decency\" and that \"there are scores of civilian dead and wounded\". He added: \"As a former military leader, I understand targeting and this is wrong. It is why President Trump is working hard to end this war.\" In response to Mr Kellogg, Mr Zelenskyy's communications adviser, Dmytro Lytvynm asked: \"Don't you think it's time to smack the Moscow mule across the nose with a 2X4?\". Later, US secretary of state Marco Rubio said the strike was \"horrifying\" and a \"tragic reminder of why President Trump and his Administration are putting so much time and effort into trying to end this war and achieve durable peace\". UK Foreign Secretary David Lammy added he was \"horrified\" by Russia's \"barbaric strike\" on Sumy, and called for an \"immediate ceasefire\". Meanwhile, EU Commission President Ursula von der Leyen said \"cruelty struck again\" and called the strike a \"blatant violation of international law\". It came hours before a separate Russian strike killed three people in the central district of the southern city of Kherson. Read more:Why Putin seems to be raising the stakes2025 'critical year' for Ukraine, warns minister The local governor, Oleksandr Prokudin, said a 68-year-old woman was injured and died in hospital and that a 48-year-old man also died after \"the occupiers dropped an explosive device from a drone\". A 62-year-old woman was also killed \"as a result of the shelling\". On Saturday, a Russian guided bomb hit a house in the northeastern Ukrainian town of Kupiansk on Saturday, injuring four people. Governor Oleh Syniehubov said on Telegram that three others could be trapped under rubble. It comes after Russian diplomats accused each other of violating a tentative US-brokered deal to pause strikes on energy infrastructure. \"The Ukrainians have been attacking us from the very beginning, every passing day, maybe with two or three exceptions,\" Sergey Lavrov, Russia's foreign minister, said, adding that Moscow would provide a list of Kyiv's attacks from the past three weeks. Andrii Sybiha, his Ukrainian counterpart, dismissed the claim saying on Saturday that Russia launched \"almost 70 missiles, over 2,200 [exploding] drones, and over 6,000 guided aerial bombs at Ukraine, mostly at civilians\" since agreeing to the limited pause on strikes."
    },
    {
        "title": "Why Vladimir Putin seems to be raising the stakes",
        "description": "He may not be the one to sit down with Vladimir Putin, but Keith Kellogg, President Trump's special envoy for Ukraine, summed up the horror of Sunday's ballistic missile strikes on Sumy succinctly.",
        "url": "https://news.sky.com/story/russias-strikes-make-a-mockery-of-us-talks-on-ukraine-with-putin-seemingly-risking-trumps-patience-13348301",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sumy-reuters-ukraine_6885516.jpg?20250413172604",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-04-13 16:19:00",
        "Headline": "At least 34 people, including two children, were killed after a Russian strike on the Ukrainian city of Sumy on Sunday. Putin doesn't seem to mind if that makes a mockery of US-led talks on ending the war.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n He may not be the one to sit down with Vladimir Putin, but Keith Kellogg, President Trump's special envoy for Ukraine, summed up the horror of Sunday's ballistic missile strikes on Sumy succinctly. \"Today's Palm Sunday attack by Russian forces on civilian targets in Sumy crosses any line of decency,\" he said. \"As a former military leader, I understand targeting and this is wrong.\" Ukraine war latest: At least 34 people killed  Vladimir Putin gave up on decency long before he started this war. What he seems to be risking by attacks of this scale is Donald Trump's patience.  He does not seem to mind if strikes like this make a mockery of US attempts to bring the two warring parties to the table. He does not seem to care if he alienates his US counterpart, who has been strangely predisposed to fawn over him to date. Perhaps he is raising the stakes as high as he can to illustrate his strength of hand: Strikes on civilians damage Ukrainian morale - even if they are hardly battlefield wins - and on the battlefield, he is pushing ahead and does not want to stop. Perhaps he knows that if he keeps up his military momentum, President Trump will tire of a conflict he realises he cannot solve and let the matter slip while staying true to his MAGA-economic priorities by letting funds for Ukraine dry up. Perhaps he thinks President Trump is so keen on a rapprochement with Russia, on the big Putin-Trump bilateral, that the details, the civilian deaths along the way, will all be by-the-by when that long-sought photo-op finally happens. Whatever it is, President Putin seems to be in no rush to get things settled. His spokesman told a Russian state reporter on Sunday that talks were under way at several levels but that \"of course, it is impossible to expect any instant results\". Withdrawing his troops would get instant results. But that is not what Vladimir Putin wants. Read more:The art of doing a deal with Trump2025 'critical year' for Ukraine, warns official His war economy is working for him, and he has the attention of the one country he considers a worthy adversary, the United States. In the meantime, this attack reinforces why President Zelenskyy's plea for air defence systems is his top priority. And why a ceasefire cannot come soon enough."
    },
    {
        "title": "Race to keep British Steel furnaces running with last-minute efforts to secure raw materials under way",
        "description": "Last-minute efforts to keep British Steel operating are to be carried out today, as the plant races to secure a supply of raw materials.",
        "url": "https://news.sky.com/story/race-to-keep-british-steel-furnaces-running-with-last-minute-efforts-to-secure-raw-materials-under-way-13348481",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:00:00",
        "Headline": "Unions said earlier this month that British Steel's owner, Chinese company Jingye, decided to cancel future orders for the iron ore, coal and other raw materials needed to keep the furnaces running.",
        "Content": "Last-minute efforts to keep British Steel operating are to be carried out today, as the plant races to secure a supply of raw materials. The Department for Business and Trade said officials are working to secure supplies of materials, including coking coal, to keep British Steel operational, as well as to ensure all staff will be paid. It added that setting up new supply chains was \"crucial\" as a fall in blast furnace temperature could risk \"irreparable damage to the site, with the steel setting and scarring the machinery\".  Companies including Tata - which ran the now-closed Port Talbot steelworks - and Rainham Steel have offered managerial support and materials to keep the Lincolnshire site running. Business Secretary Jonathan Reynolds said in a statement that \"when I said steelmaking has a future in the UK, I meant it\". \"Steel is vital for our national security and our ambitious plans for the housing, infrastructure and manufacturing sectors in the UK,\" he added. \"We will set out a long-term plan to co-invest with the private sector to ensure steel in the UK has a bright and sustainable future.\" \n                  Minister says he wouldn't bring China into 'sensitive' steel industry again\n                 \n                  A sticking plaster, not a solution: What next for British Steel?\n                 \n                  Relief in Scunthorpe after emergency British Steel law passed - but the fight isn't over yet\n                 Earlier this month, unions said the steelwork's owner, Chinese company Jingye, decided to cancel future orders for the iron ore, coal and other raw materials needed to keep the furnaces running. It meant the Scunthorpe plant had been on course to close down by May, bit it sparked urgent calls for government intervention. Emergency legislation was passed on Saturday bringing the steelworks into effective government control, and officials were on site as soon as the new legislation came into force. However, the business secretary has warned that does not mean the plant is guaranteed to survive. Appearing on Sky News' Sunday Morning With Trevor Phillips, Mr Reynolds also said he would not bring a Chinese company into the \"sensitive\" steel sector again. \"I don't know... the Boris Johnson government when they did this, what exactly the situation was,\" he added. \"But I think it's a sensitive area.\"  Jingye stepped in with a deal to buy British Steel's Scunthorpe plant out of insolvency in 2020, when Mr Johnson was prime minister. The minister added that while The Steel Industry (Special Measures) Bill stops short of the full nationalisation of British Steel, \"to be frank, as I said to parliament yesterday, it is perhaps at this stage the likely option\". The Conservatives accused the government of acting \"too late\" and implementing a \"botched nationalisation\" after ignoring warnings about the risk to the steelworks. Read more:A sticking plaster, not a solution: What next for British Steel?How Trump, China and Reform all played their part Shadow business secretary Andrew Griffith said: \"The Labour Government have landed themselves in a steel crisis entirely of their own making. \"They've made poor decisions and let the unions dictate their actions.\""
    },
    {
        "title": "No evidence of 'two-tier policing' in handling of Southport riots, MPs say",
        "description": "There was no evidence of \"two-tier policing\" in the handling of riots that erupted after last year's Southport murders, MPs have said.",
        "url": "https://news.sky.com/story/no-evidence-of-two-tier-policing-in-handling-of-southport-riots-mps-say-13347983",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-uk-riots-hartlepool_6812129.jpg?20250127152348",
        "type": "Home",
        "Author": "Faith Ridler",
        "Date Published": "2025-04-13 23:00:00",
        "Headline": "A report by the Home Affairs Committee examined the police response to disorder that broke out after the murder of three girls at a Taylor Swift-themed dance class in Southport last year.",
        "Content": "\n          Politics reporter\n              @FaithLRidler\n There was no evidence of \"two-tier policing\" in the handling of riots that erupted after last year's Southport murders, MPs have said. A report by the Home Affairs Committee, published on Monday, examined the police response to disorder that broke out after the murder of three girls at a Taylor Swift-themed dance class in Southport on 29 July. Allegations of \"two-tier policing\" followed, suggesting that police were more heavy handed with people on the right of the political spectrum than the left. Politics latest: Follow live updates However, MPs on committee have concluded there was no evidence to support these \"baseless\" claims. They also found officers' handling of the violence was \"entirely appropriate given the levels of violence and criminality that were on display\". MPs said: \"This was not protest. \n                  Young people joined last summer's riots in 'thrill of the moment', says Children's Commissioner\n                 \n                  Colin Stonehouse and David Kirkbride: Pair who joined Tamworth hotel protests following Southport stabbings jailed for 21 months\n                 \n                  Man who featured in viral video after being hit in groin during Southport riot is jailed\n                 \"Those participating in disorder were not policed more strongly because of their supposed political views but because they were throwing missiles, assaulting police officers and committing arson. \"It was disgraceful to see unsubstantiated commentary about 'two-tier policing' undermining the efforts of police officers who served bravely in the face of violence.\" Misinformation about Southport attacker Axel Rudakubana spread online after the stabbings - including false claims that he was a 17-year-old asylum seeker who had come to the country by boat. A total of 246 protests, counter-protests and incidents of disorder took place in the aftermath, including 88 deemed \"significant\", the report said. As of 22 January this year, there had been 1,804 arrests and 1,072 charges linked to the riots. Dame Karen Bradley, chairwoman of the committee, said: \"There is a difference in how police must deal with violence and how they deal with peaceful protests. \"This needs to recognised by commentators who all too readily spread claims of 'two-tier policing'. Organised disorder is rightly met with a robust response; any implied equivalence with planned non-violent protests is simply wrong.\" The report also considered the impact of the riots on individual officers, noting \"it is clear that the disorder has had a detrimental effect\" when many were already \"struggling with heavy workloads, fatigue and stress\". Read more:Young people joined last summer's riots in 'thrill of the moment'Police 'immensely brave' but forces 'were unprepared' for summer riots Additionally, MPs agreed with findings from a watchdog that police forces should have better anticipated the risk of disorder in general, and that it should not have been taken for granted that planned protests following the Southport disorder would remain peaceful. Dame Karen added: \"It is a grim reality that bad actors sought to exploit the unspeakable tragedy that unfolded in Southport. \"The criminal justice system will need to ensure its approach to communication is fit for the social media age.\" Chief Constable BJ Harrington, the National Police Chiefs' Council lead for operations, said he is \"pleased that the report robustly disagrees with the notion of 'two-tier policing', and that the policing response was entirely appropriate given the levels of violence and criminality that were on display\". He added that MPs were right to \"praise the efforts\" of police, who were \"often in the face of very real risk and injury\"."
    },
    {
        "title": "Military planners called in to help with Birmingham bin crisis - as workers to vote on 'partial deal' to end strike",
        "description": "The government has called military planners to help tackle the mounting piles of rubbish in Birmingham as a month-long strike by the city's bin workers continues.",
        "url": "https://news.sky.com/story/military-planners-called-in-to-help-with-birmingham-bin-crisis-as-workers-to-vote-on-partial-deal-to-end-strike-13348558",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rubbish-strike-bin_6883048.jpg?20250411154015",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:01:00",
        "Headline": "Amid an \"ongoing public health risk\" posed by the mountains of waste that have been piling up in Birmingham, a small number of military planners will be assigned to provide temporary logistical support.",
        "Content": "The government has called military planners to help tackle the mounting piles of rubbish in Birmingham as a month-long strike by the city's bin workers continues. Amid an \"ongoing public health risk\" posed by the mounds of waste that have been piling up, military planners will be assigned to provide logistical support for a short period. They will be office-based and soldiers are not being deployed to collect rubbish. Sky News understands the initiative will only involve three staff from the military. Read more:Why are workers striking and how long will it last? 👉 Listen to Sky News Daily on your podcast app 👈 A government spokesperson said: \"The government has already provided a number of staff to support the council with logistics and make sure the response on the ground is swift to address the associated public health risks. \n                  Identity of man whose body was found in Birmingham canal still unknown, West Midlands Police say\n                 \n                  Bin strikes, stinking rubbish and rats – what's life like in Birmingham now?\n                 \n                  Man arrested on suspicion of assisting foreign intelligence over parcel fire at DHL warehouse\n                 \"In light of the ongoing public health risk, a small number of office-based military personnel with operational planning expertise have been made available to Birmingham City Council to further support in this area.\"  Unite members walked out on 11 March in a dispute over pay and jobs, with Birmingham City Council declaring a major incident on 31 March due to public health concerns. On Monday, refuse workers are to vote on a \"partial deal\" aimed at ending the strike. Deputy Prime Minister Angela Rayner visited the city last week and urged Unite to accept an improved offer. Unite said there will be a ballot held by the close of play on Monday.  Members of Unite went out on strike due to a long-running dispute over the role of waste recycling and collection officer (WRCO) being removed. The union says the move will leave around 150 members £8,000 worse off annually. Unite's general secretary Sharon Graham said: \"This dispute is not about greed, or increased pay. This dispute is about workers losing up to £8,000 of their pay - which for some is almost a quarter. \"Whilst after many weeks there has now been a partial deal on pay protection for a few, it still leaves these workers worrying about how they are going to pay their mortgages and rent payments in a few months' time.\" The council disputes the figures, saying only 17 workers will be affected, losing far less than Unite is claiming. It adds that scrapping the WRCO role is in line with national practice and would improve its waste collection service."
    },
    {
        "title": "Bangladesh issues arrest warrant for Tulip Siddiq - as she denies claims against her",
        "description": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq. ",
        "url": "https://news.sky.com/story/bangladesh-issues-arrest-warrant-for-tulip-siddiq-as-she-denies-claims-against-her-13348103",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tulip-siddiq-bangladesh_6845305.jpg?20250303164319",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 13:28:00",
        "Headline": "Bangladesh's Anti-Corruption Commission sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka, which her lawyers say she has never owned.",
        "Content": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq.  Bangladesh's Anti-Corruption Commission (ACC) sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka. Ms Siddiq's lawyers have told Sky News the allegations are \"completely false\", adding there was \"no basis at all for any charges to be made against her\". They said there was \"absolutely no truth\" behind the allegations regarding the plot of land. The MP resigned as a Treasury minister earlier this year following an investigation by the prime minister's ethics adviser into her links to her aunt Sheikh Hasina's regime, which was overthrown in Bangladesh last year. Earlier this month, Ms Siddiq told Sky News her lawyers were \"ready\" to handle any formal questions about allegations of corruption in Bangladesh.  In her first public comments since leaving government, Ms Siddiq said \"there's been allegations for months on end and no one has contacted me\". \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Ex-minister Tulip Siddiq attacks 'targeted and baseless campaign' against her by Bangladesh authorities\n                 \n                  Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister\n                 Last month, the interim leader of Bangladesh told Sky News the MP had \"wealth left behind\" in the country \"and should be made responsible\". Lawyers acting for Ms Siddiq wrote to the Bangladeshi Anti Corruption Commission (ACC) several weeks ago saying the allegations were \"false and vexatious\". The allegations surrounding Ms Siddiq are focused on links to her aunt Ms Hasina - who served as the prime minister of Bangladesh for 20 years. Ms Hasina was forced to flee the country in August following weeks of deadly protests. She is accused of becoming an autocrat, with politically-motivated arrests and other abuses allegedly happening on her watch. Ms Hasina claims it is all a political witch hunt. Ms Siddiq's lawyer said in a statement that she \"has not been contacted by the ACC or any authorities in Bangladesh\". \"The ACC has made various allegations against Ms Siddiq through the media in the last few months,\" they said. \"The allegations are completely false and have been dealt with in writing by Ms Siddiq's lawyers. The ACC has not responded to Ms Siddiq or put any allegations to her directly or through her lawyers. \"Ms Siddiq knows nothing about a hearing in Dhaka relating to her and she has no knowledge of any arrest warrant that is said to have been issued. \"To be clear, there is no basis at all for any charges to be made against her, and there is absolutely no truth in any allegation that she received a plot of land in Dhaka through illegal means. \"She has never had a plot of land in Bangladesh, and she has never influenced any allocation of plots of land to her family members or anyone else. \"No evidence has been provided by the ACC to support this or any other allegation made against Ms Siddiq, and it is clear to us that the charges are politically motivated.\""
    },
    {
        "title": "Prison union boss calls for 'change' after brother of Manchester Arena bomber attacks guards",
        "description": "Prison guards have been calling for more protection \"for years\" to avoid attacks like the one by the Manchester Arena bomber's brother on Saturday, according a prison union boss.",
        "url": "https://news.sky.com/story/prison-union-boss-calls-for-change-after-brother-of-manchester-arena-bomber-attacks-guards-13348195",
        "image_url": "https://e3.365dm.com/20/12/1920x1080/skynews-hashem-abedi-greater-manchester-police_5198655.jpg?20201207142316",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 14:43:00",
        "Headline": "Hashem Abedi is said to have thrown hot cooking oil over three prison officers before stabbing and slashing them with \"improvised knives\".",
        "Content": " Prison guards have been calling for more protection \"for years\" to avoid attacks like the one by the Manchester Arena bomber's brother on Saturday, according a prison union boss. The Prison Officers Association (POA) said three prison officers were attacked by 28-year-old Hashem Abedi - the brother of Salman Abedi - and that he threw hot cooking oil over the guards before stabbing them with \"improvised knives\", potentially made from a baking tray. Speaking to Sky News' Kamali Melbourne on Sunday, POA national chairman Mark Fairhurst called for \"change\" after the officers were taken to hospital following the attack at category A Frankland prison, in County Durham, shortly before 11am on Saturday.   One female officer was discharged at 4pm on Saturday afternoon, while the two other officers remain in hospital in a stable condition. One of them has a punctured lung, according to Mr Fairhurst. \n                  Counter terror police investigating after brother of Manchester Arena bomber attacks prison officers\n                 \n                  Manchester Arena attack: Man arrested at airport in relation to 2017 suicide bombing at Ariana Grande concert\n                 \n                  Manchester Arena bombing inquiry: Attacker's brother 'takes coward's way out' after leaving UK, victims' families say\n                 The attack is said to have happened at a separation centre, a small unit sometimes referred to as a \"prison within a prison\", usually used to house dangerous prisoners and those deemed a risk of radicalising other inmates. Mr Fairhurst has been critical of safety in place in separation centres. He said: \"These separation centres hold the most violent and the worst threat to national security when it comes to terrorist offenders, and we're allowing them the freedoms and privileges of everybody else on normal location [in prison]. \"That has to change, along with the protections that prison staff are afforded on duty. And we've been calling for several years now for stab-proof vests to be issued to staff on the front line, but it's been consistently denied. That has to change.\" He said the POA has repeatedly been told stab-proof vests \"look too militaristic and might intimidate prisoners\". \"Now we're dealing with murderers, armed robbers, major criminals and terrorists and they're worried about us intimidating them because of the uniform we wear. Staff safety is paramount,\" he said. He added the POA had requested an urgent meeting with Justice Secretary Shabana Mahmood over the incident. \"What's appalling to me is they are allowed the freedoms and privileges that people on normal location enjoy, and they are allowed access to cooking facilities and the resources to fashion weapons to attack staff,\" he continued. \"As far as I'm concerned, separation centres are there for one reason and one reason alone: to control and contain the most prolific and the biggest threat and the most serious terrorist offenders that the system holds. That's all we need to do give them their basic entitlements, control them and contain them. Nothing else.\" In a statement on Sunday, a Ministry of Justice spokesperson said: \"Our thoughts remain with the two prison officers still in hospital as they recover. \"There will be a full review into how this attack was able to happen, alongside the separate police inquiry. \"The government will do whatever it takes to keep our hardworking staff safe.\" Counter Terrorism Policing is leading an investigation into the incident. Ian Acheson, the former prison governor and former head of security at Wandsworth Prison, recommended the creation of separation units to the government in 2016. He told Sky News the units have \"devolved\" into places where the most dangerous prisoners are \"allowed far, far too much latitude to be able to fashion weapons and assault prison officers in this appalling way\". He said the possibility of Abedi having access to cooking oil was \"an inconceivable security lapse\". \"This attack and others, other attacks like them indicate that the state is not fully in control of Frankland prison and indeed other high security prisons where a lot of other terrorist prisoners are being held,\" he added. On Saturday, Ms Mahmood said on X: \"I am appalled by the attack of three brave officers at HMP Frankland today. My thoughts are with them and their families. \"The police are now investigating. I will be pushing for the strongest possible punishment. Violence against our staff will never be tolerated.\" Hashem Abedi was previously found guilty, along with two other convicted terrorists, of attacking a prison officer at southeast London's Belmarsh prison in 2020. The officer was hit with a chair, repeatedly punched and kicked when he was set upon by Hashem Abedi, Parsons Green Tube bomber Ahmed Hassan and Muhammed Saeed, who spoke about carrying out a knife attack in London. Hashem Abedi was found guilty by a jury of 22 counts of murder, attempted murder and plotting to cause an explosion likely to endanger life over the Manchester Arena bombing."
    },
    {
        "title": "Upstairs, Downstairs actress Jean Marsh dies",
        "description": "Jean Marsh, star of Upstairs, Downstairs, has died aged 90, a friend has confirmed.",
        "url": "https://news.sky.com/story/upstairs-downstairs-actress-jean-marsh-dies-13348525",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jean-marsh-obe-2012_6885871.jpg?20250413214629",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 20:24:00",
        "Headline": "Jean Marsh was best known for her role as Rose in Upstairs, Downstairs, for which she won an Emmy for outstanding lead actress in a limited series in 1976.",
        "Content": "Jean Marsh, star of Upstairs, Downstairs, has died aged 90, a friend has confirmed. Marsh's friend, director Sir Michael Lindsay-Hogg, said in a statement to the PA news agency that the actress \"died peacefully in bed looked after by one of her very loving carers\". \"You could say we were very close for 60 years,\" he added. \"She was as wise and funny as anyone I ever met, as well as being very pretty and kind, and talented as both an actress and writer. \"An instinctively empathetic person who was loved by everyone who met her. We spoke on the phone almost every day for the past 40 years.\" Marsh was best known for her role as Rose in Upstairs, Downstairs, for which she won an Emmy for outstanding lead actress in a limited series in 1976. She co-created the series - about life in Edwardian England - with Dame Eileen Atkins. Born on 1 July 1934 in Stoke Newington, north London, Marsh's mother worked in a bar and as a theatre dresser, while her father was a handyman and printer's assistant. \n                  Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'\n                 \n                  Menendez brothers' resentencing hearing can go ahead next week, says judge\n                 \n                  Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?\n                 Marsh took dance and mime classes as therapy for an illness at a young age, and began acting on stage with a stint at Huddersfield Rep in the 1950s. She then transferred to London, and at just 12 years old made her West End debut in The Land Of The Christmas Stockings at The Duke of York's Theatre. A success in the US, Marsh appeared in iconic shows such as The Twilight Zone, Danger Man, Hawaii Five-O and Murder, She Wrote. She also made appearances in classic British shows, including Doctor Who - where she played William Hartnell's short-lived companion Sara Kingdom, among other appearances - and Detective. Marsh also had film roles in 1988's Willow, 1972's Frenzy, and 1976's The Eagle Has Landed."
    },
    {
        "title": "Woman dies and two others left injured after car hits pedestrians near Crawley Leisure Park",
        "description": "A woman has died and two other members of her family have been left seriously injured after a car hit pedestrians outside a leisure park.",
        "url": "https://news.sky.com/story/woman-dies-and-two-others-left-injured-after-car-hits-pedestrians-near-crawley-leisure-centre-13348075",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-crawley-leisure-park_6885241.jpg?20250413145222",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-13 13:09:00",
        "Headline": "The incident involving a grey BMW 3 Series took place outside Crawley Leisure Park in West Sussex at about 8.36pm on Saturday, Sussex Police say.",
        "Content": "A woman has died and two other members of her family have been left seriously injured after a car hit pedestrians outside a leisure park. The incident involving a grey BMW 3 Series took place outside Crawley Leisure Park in West Sussex at about 8.36pm on Saturday, Sussex Police said. A 25-year-old woman was killed in the collision, while her sister, 12, and their cousin, a 19-year-old woman, were seriously injured and taken to hospital. All three were from the local area. Officers said they have informed their next of kin of the incident.  The force added a 33-year-old man from Crawley was arrested at the scene on suspicion of causing death by dangerous driving and driving while unfit through drugs. He remains in police custody. Read more:'Completely nuts': New ferries too big for harbourMan found dead after house collapses in explosion Chief Inspector James Davidson added in a statement: \"Our thoughts are with the victims' family at this difficult time and we ask that the public respect their right to privacy. \"I'd like to reassure the community that we swiftly arrested a suspect in connection with this tragic incident, and our enquiries are ongoing to establish the exact circumstances.\""
    },
    {
        "title": "Rory McIlroy claims career Grand Slam with US Masters win",
        "description": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament.",
        "url": "https://news.sky.com/story/rory-mcilroy-claims-career-grand-slam-with-us-masters-win-13348424",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mcilroy-green-jacket_6885963.jpg?20250414005424",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:01:00",
        "Headline": "Northern Ireland's Rory McIlroy has won the 89th Masters at Augusta National, becoming only the sixth male golfer to complete the career Grand Slam.",
        "Content": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament. The Masters was the last major tournament left for McIlroy to complete the modern golf Grand Slam - a feat only five others have managed before him. McIlroy, who was making his 11th attempt at completing the Grand Slam, faced off Justin Rose in a sudden-death playoff to decide the Masters champion, after they finished tied on 11 under at the end of regulation on Sunday. 'So hard to stay patient' Speaking at a press conference after his victory, McIlroy said: \"You have to be the eternal optimist in this game. \"I have been saying it until I am blue in the face but I truly believe I am a better player now than 10 year ago. \"It is so hard to stay patient, keep coming back and not being able to get it done. \n                  Extinction Rebellion climate change protest disrupts PGA golf tournament in Connecticut\n                 \n                  Rory McIlroy's divorce off as couple look forward to 'new beginning'\n                 \n                  Scottie Scheffler: Charges against world number one golfer dropped after 'big misunderstanding' at PGA Championship\n                 \"There were points on the back nine where I thought, 'have I let this slip again?' but I responded and am really proud of myself. \"It has been an emotional week so I am thrilled to be last man standing.\" Just before slipping on a coveted green jacket during the presentation ceremony, the Northern Irishman said: \"It's my 17th time here and I started to wonder if it would ever be my time. \"I'm just absolutely honoured and thrilled and just so proud to be able to call myself a Masters champion.\" McIlroy had missed his six-foot putt for par, a bogey which dropped him back to 11 under, where he joined Rose - leading to a dramatic playoff between the two. Only five other golfers have been able to complete a career Grand Slam - Tiger Woods, Jack Nicklaus, Gary Player, Ben Hogan and Gene Sarazen. McIlroy is a two-time winner of the PGA Championship, claiming the prize in 2012 and 2014. The 35-year-old also won his first major title, the US Open, in 2011, and won the Open Championship in 2014. How did McIlroy clinch victory?  McIlroy recovered from losing his overnight two-shot advantage with an opening-hole double bogey to initially take control at Augusta National, only to blow a four-shot lead over his closing six holes. The world number two bogeyed the last to close a one-over 73 and slip back to 11 under alongside Rose, who overturned a seven-stroke deficit and posted a stunning final-round 66 to force a playoff. The players returned to the 18th for the playoff, where McIlroy made amends for his 72nd-hole blunder by firing a stunning approach to within three feet of the pin and making the birdie putt required for the win. After the winning putt dropped, McIlroy raised his arms towards the sky and let his putter fall behind him as he dropped to his knees overcome with emotion. He then embraced his wife Erica and daughter Poppy as chants of \"Rory! Rory!\" rang out around the green. 'Hard to put into words' Tony Denver, who was among those watching McIlroy from his home club in Holywood, County Down, told Sky News it was \"hard to put into words\" how he was feeling following the play-off, as crowds in the background cheered and applauded the world's number two golf player. Mr Denver went on to say the feeling was \"absolutely fantastic\", adding he remembers McIlroy \"from a young lad growing up and he's now one of the six players to win the Grand Slam which is just unbelievable\". Ruth Watt, lady captain of Holywood golf club, said: \"We are all immensely proud, absolutely delighted to be welcoming Rory back home in that green jacket. \"He has put us through the ringer tonight but what an outcome.\" She added: \"There was always something very special about the golf that he played but he is such a gentleman and such a lovely, lovely person.\" For the club, McIlroy's victory is just \"phenomenal\", she said."
    },
    {
        "title": "Race to keep British Steel furnaces running with last-minute efforts to secure raw materials under way",
        "description": "Last-minute efforts to keep British Steel operating are to be carried out today, as the plant races to secure a supply of raw materials.",
        "url": "https://news.sky.com/story/race-to-keep-british-steel-furnaces-running-with-last-minute-efforts-to-secure-raw-materials-under-way-13348481",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:00:00",
        "Headline": "Unions said earlier this month that British Steel's owner, Chinese company Jingye, decided to cancel future orders for the iron ore, coal and other raw materials needed to keep the furnaces running.",
        "Content": "Last-minute efforts to keep British Steel operating are to be carried out today, as the plant races to secure a supply of raw materials. The Department for Business and Trade said officials are working to secure supplies of materials, including coking coal, to keep British Steel operational, as well as to ensure all staff will be paid. It added that setting up new supply chains was \"crucial\" as a fall in blast furnace temperature could risk \"irreparable damage to the site, with the steel setting and scarring the machinery\".  Companies including Tata - which ran the now-closed Port Talbot steelworks - and Rainham Steel have offered managerial support and materials to keep the Lincolnshire site running. Business Secretary Jonathan Reynolds said in a statement that \"when I said steelmaking has a future in the UK, I meant it\". \"Steel is vital for our national security and our ambitious plans for the housing, infrastructure and manufacturing sectors in the UK,\" he added. \"We will set out a long-term plan to co-invest with the private sector to ensure steel in the UK has a bright and sustainable future.\" \n                  Minister says he wouldn't bring China into 'sensitive' steel industry again\n                 \n                  A sticking plaster, not a solution: What next for British Steel?\n                 \n                  Relief in Scunthorpe after emergency British Steel law passed - but the fight isn't over yet\n                 Earlier this month, unions said the steelwork's owner, Chinese company Jingye, decided to cancel future orders for the iron ore, coal and other raw materials needed to keep the furnaces running. It meant the Scunthorpe plant had been on course to close down by May, bit it sparked urgent calls for government intervention. Emergency legislation was passed on Saturday bringing the steelworks into effective government control, and officials were on site as soon as the new legislation came into force. However, the business secretary has warned that does not mean the plant is guaranteed to survive. Appearing on Sky News' Sunday Morning With Trevor Phillips, Mr Reynolds also said he would not bring a Chinese company into the \"sensitive\" steel sector again. \"I don't know... the Boris Johnson government when they did this, what exactly the situation was,\" he added. \"But I think it's a sensitive area.\"  Jingye stepped in with a deal to buy British Steel's Scunthorpe plant out of insolvency in 2020, when Mr Johnson was prime minister. The minister added that while The Steel Industry (Special Measures) Bill stops short of the full nationalisation of British Steel, \"to be frank, as I said to parliament yesterday, it is perhaps at this stage the likely option\". The Conservatives accused the government of acting \"too late\" and implementing a \"botched nationalisation\" after ignoring warnings about the risk to the steelworks. Read more:A sticking plaster, not a solution: What next for British Steel?How Trump, China and Reform all played their part Shadow business secretary Andrew Griffith said: \"The Labour Government have landed themselves in a steel crisis entirely of their own making. \"They've made poor decisions and let the unions dictate their actions.\""
    },
    {
        "title": "Military planners called in to help with Birmingham bin crisis - as workers to vote on 'partial deal' to end strike",
        "description": "The government has called military planners to help tackle the mounting piles of rubbish in Birmingham as a month-long strike by the city's bin workers continues.",
        "url": "https://news.sky.com/story/military-planners-called-in-to-help-with-birmingham-bin-crisis-as-workers-to-vote-on-partial-deal-to-end-strike-13348558",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rubbish-strike-bin_6883048.jpg?20250411154015",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:01:00",
        "Headline": "Amid an \"ongoing public health risk\" posed by the mountains of waste that have been piling up in Birmingham, a small number of military planners will be assigned to provide temporary logistical support.",
        "Content": "The government has called military planners to help tackle the mounting piles of rubbish in Birmingham as a month-long strike by the city's bin workers continues. Amid an \"ongoing public health risk\" posed by the mounds of waste that have been piling up, military planners will be assigned to provide logistical support for a short period. They will be office-based and soldiers are not being deployed to collect rubbish. Sky News understands the initiative will only involve three staff from the military. Read more:Why are workers striking and how long will it last? 👉 Listen to Sky News Daily on your podcast app 👈 A government spokesperson said: \"The government has already provided a number of staff to support the council with logistics and make sure the response on the ground is swift to address the associated public health risks. \n                  Identity of man whose body was found in Birmingham canal still unknown, West Midlands Police say\n                 \n                  Bin strikes, stinking rubbish and rats – what's life like in Birmingham now?\n                 \n                  Man arrested on suspicion of assisting foreign intelligence over parcel fire at DHL warehouse\n                 \"In light of the ongoing public health risk, a small number of office-based military personnel with operational planning expertise have been made available to Birmingham City Council to further support in this area.\"  Unite members walked out on 11 March in a dispute over pay and jobs, with Birmingham City Council declaring a major incident on 31 March due to public health concerns. On Monday, refuse workers are to vote on a \"partial deal\" aimed at ending the strike. Deputy Prime Minister Angela Rayner visited the city last week and urged Unite to accept an improved offer. Unite said there will be a ballot held by the close of play on Monday.  Members of Unite went out on strike due to a long-running dispute over the role of waste recycling and collection officer (WRCO) being removed. The union says the move will leave around 150 members £8,000 worse off annually. Unite's general secretary Sharon Graham said: \"This dispute is not about greed, or increased pay. This dispute is about workers losing up to £8,000 of their pay - which for some is almost a quarter. \"Whilst after many weeks there has now been a partial deal on pay protection for a few, it still leaves these workers worrying about how they are going to pay their mortgages and rent payments in a few months' time.\" The council disputes the figures, saying only 17 workers will be affected, losing far less than Unite is claiming. It adds that scrapping the WRCO role is in line with national practice and would improve its waste collection service."
    },
    {
        "title": "No evidence of 'two-tier policing' in handling of Southport riots, MPs say",
        "description": "There was no evidence of \"two-tier policing\" in the handling of riots that erupted after last year's Southport murders, MPs have said.",
        "url": "https://news.sky.com/story/no-evidence-of-two-tier-policing-in-handling-of-southport-riots-mps-say-13347983",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-uk-riots-hartlepool_6812129.jpg?20250127152348",
        "type": "UK",
        "Author": "Faith Ridler",
        "Date Published": "2025-04-13 23:00:00",
        "Headline": "A report by the Home Affairs Committee examined the police response to disorder that broke out after the murder of three girls at a Taylor Swift-themed dance class in Southport last year.",
        "Content": "\n          Politics reporter\n              @FaithLRidler\n There was no evidence of \"two-tier policing\" in the handling of riots that erupted after last year's Southport murders, MPs have said. A report by the Home Affairs Committee, published on Monday, examined the police response to disorder that broke out after the murder of three girls at a Taylor Swift-themed dance class in Southport on 29 July. Allegations of \"two-tier policing\" followed, suggesting that police were more heavy handed with people on the right of the political spectrum than the left. Politics latest: Follow live updates However, MPs on committee have concluded there was no evidence to support these \"baseless\" claims. They also found officers' handling of the violence was \"entirely appropriate given the levels of violence and criminality that were on display\". MPs said: \"This was not protest. \n                  Young people joined last summer's riots in 'thrill of the moment', says Children's Commissioner\n                 \n                  Colin Stonehouse and David Kirkbride: Pair who joined Tamworth hotel protests following Southport stabbings jailed for 21 months\n                 \n                  Man who featured in viral video after being hit in groin during Southport riot is jailed\n                 \"Those participating in disorder were not policed more strongly because of their supposed political views but because they were throwing missiles, assaulting police officers and committing arson. \"It was disgraceful to see unsubstantiated commentary about 'two-tier policing' undermining the efforts of police officers who served bravely in the face of violence.\" Misinformation about Southport attacker Axel Rudakubana spread online after the stabbings - including false claims that he was a 17-year-old asylum seeker who had come to the country by boat. A total of 246 protests, counter-protests and incidents of disorder took place in the aftermath, including 88 deemed \"significant\", the report said. As of 22 January this year, there had been 1,804 arrests and 1,072 charges linked to the riots. Dame Karen Bradley, chairwoman of the committee, said: \"There is a difference in how police must deal with violence and how they deal with peaceful protests. \"This needs to recognised by commentators who all too readily spread claims of 'two-tier policing'. Organised disorder is rightly met with a robust response; any implied equivalence with planned non-violent protests is simply wrong.\" The report also considered the impact of the riots on individual officers, noting \"it is clear that the disorder has had a detrimental effect\" when many were already \"struggling with heavy workloads, fatigue and stress\". Read more:Young people joined last summer's riots in 'thrill of the moment'Police 'immensely brave' but forces 'were unprepared' for summer riots Additionally, MPs agreed with findings from a watchdog that police forces should have better anticipated the risk of disorder in general, and that it should not have been taken for granted that planned protests following the Southport disorder would remain peaceful. Dame Karen added: \"It is a grim reality that bad actors sought to exploit the unspeakable tragedy that unfolded in Southport. \"The criminal justice system will need to ensure its approach to communication is fit for the social media age.\" Chief Constable BJ Harrington, the National Police Chiefs' Council lead for operations, said he is \"pleased that the report robustly disagrees with the notion of 'two-tier policing', and that the policing response was entirely appropriate given the levels of violence and criminality that were on display\". He added that MPs were right to \"praise the efforts\" of police, who were \"often in the face of very real risk and injury\"."
    },
    {
        "title": "Bangladesh issues arrest warrant for Tulip Siddiq - as she denies claims against her",
        "description": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq. ",
        "url": "https://news.sky.com/story/bangladesh-issues-arrest-warrant-for-tulip-siddiq-as-she-denies-claims-against-her-13348103",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tulip-siddiq-bangladesh_6845305.jpg?20250303164319",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 13:28:00",
        "Headline": "Bangladesh's Anti-Corruption Commission sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka, which her lawyers say she has never owned.",
        "Content": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq.  Bangladesh's Anti-Corruption Commission (ACC) sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka. Ms Siddiq's lawyers have told Sky News the allegations are \"completely false\", adding there was \"no basis at all for any charges to be made against her\". They said there was \"absolutely no truth\" behind the allegations regarding the plot of land. The MP resigned as a Treasury minister earlier this year following an investigation by the prime minister's ethics adviser into her links to her aunt Sheikh Hasina's regime, which was overthrown in Bangladesh last year. Earlier this month, Ms Siddiq told Sky News her lawyers were \"ready\" to handle any formal questions about allegations of corruption in Bangladesh.  In her first public comments since leaving government, Ms Siddiq said \"there's been allegations for months on end and no one has contacted me\". \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Ex-minister Tulip Siddiq attacks 'targeted and baseless campaign' against her by Bangladesh authorities\n                 \n                  Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister\n                 Last month, the interim leader of Bangladesh told Sky News the MP had \"wealth left behind\" in the country \"and should be made responsible\". Lawyers acting for Ms Siddiq wrote to the Bangladeshi Anti Corruption Commission (ACC) several weeks ago saying the allegations were \"false and vexatious\". The allegations surrounding Ms Siddiq are focused on links to her aunt Ms Hasina - who served as the prime minister of Bangladesh for 20 years. Ms Hasina was forced to flee the country in August following weeks of deadly protests. She is accused of becoming an autocrat, with politically-motivated arrests and other abuses allegedly happening on her watch. Ms Hasina claims it is all a political witch hunt. Ms Siddiq's lawyer said in a statement that she \"has not been contacted by the ACC or any authorities in Bangladesh\". \"The ACC has made various allegations against Ms Siddiq through the media in the last few months,\" they said. \"The allegations are completely false and have been dealt with in writing by Ms Siddiq's lawyers. The ACC has not responded to Ms Siddiq or put any allegations to her directly or through her lawyers. \"Ms Siddiq knows nothing about a hearing in Dhaka relating to her and she has no knowledge of any arrest warrant that is said to have been issued. \"To be clear, there is no basis at all for any charges to be made against her, and there is absolutely no truth in any allegation that she received a plot of land in Dhaka through illegal means. \"She has never had a plot of land in Bangladesh, and she has never influenced any allocation of plots of land to her family members or anyone else. \"No evidence has been provided by the ACC to support this or any other allegation made against Ms Siddiq, and it is clear to us that the charges are politically motivated.\""
    },
    {
        "title": "Upstairs, Downstairs actress Jean Marsh dies",
        "description": "Jean Marsh, star of Upstairs, Downstairs, has died aged 90, a friend has confirmed.",
        "url": "https://news.sky.com/story/upstairs-downstairs-actress-jean-marsh-dies-13348525",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jean-marsh-obe-2012_6885871.jpg?20250413214629",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 20:24:00",
        "Headline": "Jean Marsh was best known for her role as Rose in Upstairs, Downstairs, for which she won an Emmy for outstanding lead actress in a limited series in 1976.",
        "Content": "Jean Marsh, star of Upstairs, Downstairs, has died aged 90, a friend has confirmed. Marsh's friend, director Sir Michael Lindsay-Hogg, said in a statement to the PA news agency that the actress \"died peacefully in bed looked after by one of her very loving carers\". \"You could say we were very close for 60 years,\" he added. \"She was as wise and funny as anyone I ever met, as well as being very pretty and kind, and talented as both an actress and writer. \"An instinctively empathetic person who was loved by everyone who met her. We spoke on the phone almost every day for the past 40 years.\" Marsh was best known for her role as Rose in Upstairs, Downstairs, for which she won an Emmy for outstanding lead actress in a limited series in 1976. She co-created the series - about life in Edwardian England - with Dame Eileen Atkins. Born on 1 July 1934 in Stoke Newington, north London, Marsh's mother worked in a bar and as a theatre dresser, while her father was a handyman and printer's assistant. \n                  Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'\n                 \n                  Menendez brothers' resentencing hearing can go ahead next week, says judge\n                 \n                  Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?\n                 Marsh took dance and mime classes as therapy for an illness at a young age, and began acting on stage with a stint at Huddersfield Rep in the 1950s. She then transferred to London, and at just 12 years old made her West End debut in The Land Of The Christmas Stockings at The Duke of York's Theatre. A success in the US, Marsh appeared in iconic shows such as The Twilight Zone, Danger Man, Hawaii Five-O and Murder, She Wrote. She also made appearances in classic British shows, including Doctor Who - where she played William Hartnell's short-lived companion Sara Kingdom, among other appearances - and Detective. Marsh also had film roles in 1988's Willow, 1972's Frenzy, and 1976's The Eagle Has Landed."
    },
    {
        "title": "Woman dies and two others left injured after car hits pedestrians near Crawley Leisure Park",
        "description": "A woman has died and two other members of her family have been left seriously injured after a car hit pedestrians outside a leisure park.",
        "url": "https://news.sky.com/story/woman-dies-and-two-others-left-injured-after-car-hits-pedestrians-near-crawley-leisure-centre-13348075",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-crawley-leisure-park_6885241.jpg?20250413145222",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 13:09:00",
        "Headline": "The incident involving a grey BMW 3 Series took place outside Crawley Leisure Park in West Sussex at about 8.36pm on Saturday, Sussex Police say.",
        "Content": "A woman has died and two other members of her family have been left seriously injured after a car hit pedestrians outside a leisure park. The incident involving a grey BMW 3 Series took place outside Crawley Leisure Park in West Sussex at about 8.36pm on Saturday, Sussex Police said. A 25-year-old woman was killed in the collision, while her sister, 12, and their cousin, a 19-year-old woman, were seriously injured and taken to hospital. All three were from the local area. Officers said they have informed their next of kin of the incident.  The force added a 33-year-old man from Crawley was arrested at the scene on suspicion of causing death by dangerous driving and driving while unfit through drugs. He remains in police custody. Read more:'Completely nuts': New ferries too big for harbourMan found dead after house collapses in explosion Chief Inspector James Davidson added in a statement: \"Our thoughts are with the victims' family at this difficult time and we ask that the public respect their right to privacy. \"I'd like to reassure the community that we swiftly arrested a suspect in connection with this tragic incident, and our enquiries are ongoing to establish the exact circumstances.\""
    },
    {
        "title": "Prison union boss calls for 'change' after brother of Manchester Arena bomber attacks guards",
        "description": "Prison guards have been calling for more protection \"for years\" to avoid attacks like the one by the Manchester Arena bomber's brother on Saturday, according a prison union boss.",
        "url": "https://news.sky.com/story/prison-union-boss-calls-for-change-after-brother-of-manchester-arena-bomber-attacks-guards-13348195",
        "image_url": "https://e3.365dm.com/20/12/1920x1080/skynews-hashem-abedi-greater-manchester-police_5198655.jpg?20201207142316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 14:43:00",
        "Headline": "Hashem Abedi is said to have thrown hot cooking oil over three prison officers before stabbing and slashing them with \"improvised knives\".",
        "Content": " Prison guards have been calling for more protection \"for years\" to avoid attacks like the one by the Manchester Arena bomber's brother on Saturday, according a prison union boss. The Prison Officers Association (POA) said three prison officers were attacked by 28-year-old Hashem Abedi - the brother of Salman Abedi - and that he threw hot cooking oil over the guards before stabbing them with \"improvised knives\", potentially made from a baking tray. Speaking to Sky News' Kamali Melbourne on Sunday, POA national chairman Mark Fairhurst called for \"change\" after the officers were taken to hospital following the attack at category A Frankland prison, in County Durham, shortly before 11am on Saturday.   One female officer was discharged at 4pm on Saturday afternoon, while the two other officers remain in hospital in a stable condition. One of them has a punctured lung, according to Mr Fairhurst. \n                  Counter terror police investigating after brother of Manchester Arena bomber attacks prison officers\n                 \n                  Manchester Arena attack: Man arrested at airport in relation to 2017 suicide bombing at Ariana Grande concert\n                 \n                  Manchester Arena bombing inquiry: Attacker's brother 'takes coward's way out' after leaving UK, victims' families say\n                 The attack is said to have happened at a separation centre, a small unit sometimes referred to as a \"prison within a prison\", usually used to house dangerous prisoners and those deemed a risk of radicalising other inmates. Mr Fairhurst has been critical of safety in place in separation centres. He said: \"These separation centres hold the most violent and the worst threat to national security when it comes to terrorist offenders, and we're allowing them the freedoms and privileges of everybody else on normal location [in prison]. \"That has to change, along with the protections that prison staff are afforded on duty. And we've been calling for several years now for stab-proof vests to be issued to staff on the front line, but it's been consistently denied. That has to change.\" He said the POA has repeatedly been told stab-proof vests \"look too militaristic and might intimidate prisoners\". \"Now we're dealing with murderers, armed robbers, major criminals and terrorists and they're worried about us intimidating them because of the uniform we wear. Staff safety is paramount,\" he said. He added the POA had requested an urgent meeting with Justice Secretary Shabana Mahmood over the incident. \"What's appalling to me is they are allowed the freedoms and privileges that people on normal location enjoy, and they are allowed access to cooking facilities and the resources to fashion weapons to attack staff,\" he continued. \"As far as I'm concerned, separation centres are there for one reason and one reason alone: to control and contain the most prolific and the biggest threat and the most serious terrorist offenders that the system holds. That's all we need to do give them their basic entitlements, control them and contain them. Nothing else.\" In a statement on Sunday, a Ministry of Justice spokesperson said: \"Our thoughts remain with the two prison officers still in hospital as they recover. \"There will be a full review into how this attack was able to happen, alongside the separate police inquiry. \"The government will do whatever it takes to keep our hardworking staff safe.\" Counter Terrorism Policing is leading an investigation into the incident. Ian Acheson, the former prison governor and former head of security at Wandsworth Prison, recommended the creation of separation units to the government in 2016. He told Sky News the units have \"devolved\" into places where the most dangerous prisoners are \"allowed far, far too much latitude to be able to fashion weapons and assault prison officers in this appalling way\". He said the possibility of Abedi having access to cooking oil was \"an inconceivable security lapse\". \"This attack and others, other attacks like them indicate that the state is not fully in control of Frankland prison and indeed other high security prisons where a lot of other terrorist prisoners are being held,\" he added. On Saturday, Ms Mahmood said on X: \"I am appalled by the attack of three brave officers at HMP Frankland today. My thoughts are with them and their families. \"The police are now investigating. I will be pushing for the strongest possible punishment. Violence against our staff will never be tolerated.\" Hashem Abedi was previously found guilty, along with two other convicted terrorists, of attacking a prison officer at southeast London's Belmarsh prison in 2020. The officer was hit with a chair, repeatedly punched and kicked when he was set upon by Hashem Abedi, Parsons Green Tube bomber Ahmed Hassan and Muhammed Saeed, who spoke about carrying out a knife attack in London. Hashem Abedi was found guilty by a jury of 22 counts of murder, attempted murder and plotting to cause an explosion likely to endanger life over the Manchester Arena bombing."
    },
    {
        "title": "Body found after 11-year-old Kaliyah Coa went missing in River Thames",
        "description": "A body has been found after an 11-year-old girl went missing in the River Thames, police have said. ",
        "url": "https://news.sky.com/story/body-found-in-search-for-girl-11-who-went-missing-in-river-thames-13348238",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kaliyah-coa-met-police_6873822.jpg?20250402125249",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 15:25:00",
        "Headline": "The Met Police were alerted to a body found in the River Thames at around 9am on Sunday. Officers say the body is yet to be formally identified, but that they have informed the family of Kaliyah Coa of the development.",
        "Content": "A body has been found after an 11-year-old girl went missing in the River Thames, police have said.  The Metropolitan Police said they were alerted to a body in the River Thames in Maritime Quay around 9am on Sunday morning. Officers said the body is yet to be formally identified, \"however, the family of Kaliyah Coa have been informed of this development and are being supported by specialist officers\".   The girl went missing after she entered the water in east London at the end of March. Officers said she had been playing during a school inset day and went into the water near Barge House Causeway in North Woolwich. \n                  Kara Alexander: Dagenham mother who murdered her two young sons in the bath jailed\n                 \n                  Harley Woods: Family of 18-year-old among three teenagers killed in crash say they are 'completely devastated' by his death\n                 \n                  Arrests made after blood-red dye dumped into US embassy pond in Israel arms sales protest\n                 Emergency services were called at 1.23pm with London Ambulance Service, London Fire Brigade, the RNLI and the coastguard carrying out an \"extensive search\" for the missing schoolgirl. The Met Police then released her name and photo at the start of the month, and said officers were leading a recovery mission along the Thames to find her. Barge House Causeway is a concrete slope that goes directly into the river and is used to transport boats. Residents said it appeared to be covered in moss and was slippery on the day of the incident."
    },
    {
        "title": "Man found dead following explosion and house collapse in Worksop",
        "description": "A man has been found dead among the debris following an explosion at a house in Nottinghamshire.",
        "url": "https://news.sky.com/story/man-found-dead-following-explosion-and-house-collapse-in-worksop-13347905",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-house-explosion-worksop_6885063.jpg?20250413114259",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-13 07:44:00",
        "Headline": "The blast happened in John Street in Worksop, Nottinghamshire, on Saturday evening, with multiple nearby properties evacuated.",
        "Content": " A man has been found dead among the debris following an explosion at a house in Nottinghamshire. Emergency services were called to John Street, Worksop, on Saturday evening after reports that a house had collapsed in a blast, and a major incident was declared. Nottinghamshire Police said on Sunday afternoon that the body of a man in his 50s was later recovered in the wreckage, and although emergency services tried to save him, he died at the scene. Firefighters from the town were joined by crews from Warsop and Mansfield, and Clowne in Derbyshire, after receiving reports shortly before 7.40pm. The terraced property was partially destroyed and neighbouring homes suffered \"significant damage\", Nottinghamshire Police said, with people evacuated from multiple properties. Earlier on Sunday, Nottinghamshire Fire and Rescue Service reported the incident as a suspected gas explosion and said \"a number of appliances\" remained at the scene. Videos posted on social media showed the front of a terraced house blown out and the roof collapsed, while neighbouring houses suffered damage to windows. Midlands correspondent As the plastic police tape flaps in the wind, evacuated residents gather beside it, wondering when they'll be allowed back home. The tape has been used by officers to cordon off a large area of terraced housing, which surrounds the explosion site in John Street. \"My uncle was in bed when it happened\", August tells me, \"he said the stairs came down so he had to jump, the windows and the doors all smashed\". August and his family live in the house next door to where the explosion took place. He tells me that his friend called him at work, to tell him to get home quick. \"My kids weren't there and my uncle is ok, so I'm grateful for that,\" he says. August said he didn't know the victim, but he says that people are feeling sadness over what happened. Marie tells me she went home to check her boiler immediately after the explosion. The cause isn't yet known, but one line of inquiry for investigators is that gas may have been involved. \"There was a huge bang, my whole house shook, everything fell off the mantelpiece,\" says Marie. Others had travelled to Worksop from four miles away, saying they'd heard the blast. \"I thought we were back in the war,\" one elderly lady told me. She and her family stayed with relatives after being asked to leave their properties nearby. In the local community centre car park I find Piotr, his wife, and their two dogs, who'd all spent the night in their vehicle. \"Now we don't know what's next,\" Piotr says. The local council say they're helping people with temporary accommodation if they have nowhere else to stay. It could be many weeks before this part of Nottinghamshire recovers from the extraordinary events of Saturday night. A Facebook user reported a \"huge\" bang that shook the surrounding properties, while another described \"a terrific bang, like a very loud firework\". Chief Inspector Clive Collings, from Nottinghamshire Police, described it as \"an extremely serious incident that has led to a man's untimely death\". He said the explosion \"will have come as a shock to the community in Worksop\", and that specially trained officers are supporting the man's family, who have been told of his death. \"Anyone who may have been in the area at the time is now accounted for,\" he added. Chief Inspector Collings said the cordon and road closures will probably remain in place for some time while investigations continue. Multiple residents from in and around John Street were asked to leave, he said, and are being supported by Nottinghamshire County Council staff. He warned people against using drones as flying a drone over or near an ongoing emergency response without permission is an offence."
    },
    {
        "title": "At least 34 dead in Ukrainian city of Sumy after Russian missile strikes",
        "description": "At least 34 people - including two children - have been killed after a Russian missile attack on a Ukrainian city.",
        "url": "https://news.sky.com/story/at-least-34-dead-in-ukrainian-city-of-sumy-after-russian-missile-strikes-13348179",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sumy-missile-strike_6885017.jpg?20250413101027",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-13 14:41:00",
        "Headline": "Volodymyr Zelenskyy says \"only scoundrels can act like this\" after a Russian missile strike killed at least 34 people.",
        "Content": " At least 34 people - including two children - have been killed after a Russian missile attack on a Ukrainian city. The country's state emergency service said another 117 people have been injured, with 15 children among them, in the northeastern city of Sumy. Ukraine's foreign ministry later added that one of the children injured was a baby girl born this year, saying \"even newborns are targets for Russia's crimes\". Volodymyr Zelenskyy also shared videos on Telegram of the aftermath of the attack on social media, showing dead bodies in the middle of a city street near a destroyed bus. As it happened: Russian attack is 'signal' to US and Ukraine Russia 'dragging out this war' - Zelenskyy The Ukrainian president said on social media \"only scoundrels can act like this\" and that \"tough reaction from the world is needed\". \"Russia wants exactly this kind of terror and is dragging out this war,\" he added. \"Without pressure on the aggressor, peace is impossible. \"Talks have never stopped ballistic missiles and air bombs. We need the kind of attitude towards Russia that a terrorist deserves.\" Andriy Kovalenko, a security official who runs Ukraine's centre for countering disinformation, noted the strike came after a visit to Moscow by US envoy Steve Witkoff.  US official: 'This is wrong' Keith Kellogg, Donald Trump's envoy for the Ukraine war, said the attack crosses \"any line of decency\" and that \"there are scores of civilian dead and wounded\". He added: \"As a former military leader, I understand targeting and this is wrong. It is why President Trump is working hard to end this war.\" In response to Mr Kellogg, Mr Zelenskyy's communications adviser, Dmytro Lytvynm asked: \"Don't you think it's time to smack the Moscow mule across the nose with a 2X4?\". Later, US secretary of state Marco Rubio said the strike was \"horrifying\" and a \"tragic reminder of why President Trump and his Administration are putting so much time and effort into trying to end this war and achieve durable peace\". UK Foreign Secretary David Lammy added he was \"horrified\" by Russia's \"barbaric strike\" on Sumy, and called for an \"immediate ceasefire\". Meanwhile, EU Commission President Ursula von der Leyen said \"cruelty struck again\" and called the strike a \"blatant violation of international law\". It came hours before a separate Russian strike killed three people in the central district of the southern city of Kherson. Read more:Why Putin seems to be raising the stakes2025 'critical year' for Ukraine, warns minister The local governor, Oleksandr Prokudin, said a 68-year-old woman was injured and died in hospital and that a 48-year-old man also died after \"the occupiers dropped an explosive device from a drone\". A 62-year-old woman was also killed \"as a result of the shelling\". On Saturday, a Russian guided bomb hit a house in the northeastern Ukrainian town of Kupiansk on Saturday, injuring four people. Governor Oleh Syniehubov said on Telegram that three others could be trapped under rubble. It comes after Russian diplomats accused each other of violating a tentative US-brokered deal to pause strikes on energy infrastructure. \"The Ukrainians have been attacking us from the very beginning, every passing day, maybe with two or three exceptions,\" Sergey Lavrov, Russia's foreign minister, said, adding that Moscow would provide a list of Kyiv's attacks from the past three weeks. Andrii Sybiha, his Ukrainian counterpart, dismissed the claim saying on Saturday that Russia launched \"almost 70 missiles, over 2,200 [exploding] drones, and over 6,000 guided aerial bombs at Ukraine, mostly at civilians\" since agreeing to the limited pause on strikes."
    },
    {
        "title": "Why Vladimir Putin seems to be raising the stakes",
        "description": "He may not be the one to sit down with Vladimir Putin, but Keith Kellogg, President Trump's special envoy for Ukraine, summed up the horror of Sunday's ballistic missile strikes on Sumy succinctly.",
        "url": "https://news.sky.com/story/russias-strikes-make-a-mockery-of-us-talks-on-ukraine-with-putin-seemingly-risking-trumps-patience-13348301",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sumy-reuters-ukraine_6885516.jpg?20250413172604",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-04-13 16:19:00",
        "Headline": "At least 34 people, including two children, were killed after a Russian strike on the Ukrainian city of Sumy on Sunday. Putin doesn't seem to mind if that makes a mockery of US-led talks on ending the war.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n He may not be the one to sit down with Vladimir Putin, but Keith Kellogg, President Trump's special envoy for Ukraine, summed up the horror of Sunday's ballistic missile strikes on Sumy succinctly. \"Today's Palm Sunday attack by Russian forces on civilian targets in Sumy crosses any line of decency,\" he said. \"As a former military leader, I understand targeting and this is wrong.\" Ukraine war latest: At least 34 people killed  Vladimir Putin gave up on decency long before he started this war. What he seems to be risking by attacks of this scale is Donald Trump's patience.  He does not seem to mind if strikes like this make a mockery of US attempts to bring the two warring parties to the table. He does not seem to care if he alienates his US counterpart, who has been strangely predisposed to fawn over him to date. Perhaps he is raising the stakes as high as he can to illustrate his strength of hand: Strikes on civilians damage Ukrainian morale - even if they are hardly battlefield wins - and on the battlefield, he is pushing ahead and does not want to stop. Perhaps he knows that if he keeps up his military momentum, President Trump will tire of a conflict he realises he cannot solve and let the matter slip while staying true to his MAGA-economic priorities by letting funds for Ukraine dry up. Perhaps he thinks President Trump is so keen on a rapprochement with Russia, on the big Putin-Trump bilateral, that the details, the civilian deaths along the way, will all be by-the-by when that long-sought photo-op finally happens. Whatever it is, President Putin seems to be in no rush to get things settled. His spokesman told a Russian state reporter on Sunday that talks were under way at several levels but that \"of course, it is impossible to expect any instant results\". Withdrawing his troops would get instant results. But that is not what Vladimir Putin wants. Read more:The art of doing a deal with Trump2025 'critical year' for Ukraine, warns official His war economy is working for him, and he has the attention of the one country he considers a worthy adversary, the United States. In the meantime, this attack reinforces why President Zelenskyy's plea for air defence systems is his top priority. And why a ceasefire cannot come soon enough."
    },
    {
        "title": "Israeli air strike hits Gaza hospital",
        "description": "An Israeli air strike has hit a hospital in Gaza City, with pictures showing the devastating aftermath at some of its wards.",
        "url": "https://news.sky.com/story/israeli-air-strike-hits-gaza-hospital-13347901",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-al-ahli-arab-baptist_6884956.jpg?20250413084336",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-13 07:34:00",
        "Headline": "The al-Ahli Arab Hospital in Gaza City was hit by multiple missiles, according to the Hamas-run health ministry. Israeli officials say they \"struck a command and control centre used by Hamas\" within the hospital.",
        "Content": "An Israeli air strike has hit a hospital in Gaza City, with pictures showing the devastating aftermath at some of its wards. Multiple missiles hit the al-Ahli Arab Baptist Hospital, the Hamas-run health ministry said, adding hundreds of patients, medical personnel, and their companions were on site at the time of the attack. It said the Israeli army had targeted what it described as \"one of the oldest and most vital healthcare institutions operating in the Gaza Strip\". One patient died during the evacuation as medical staff were unable to provide urgent care, it said. No other casualties have been reported. The Israeli Defence Forces (IDF) said they \"struck a command and control centre used by Hamas\" in the hospital. \"The compound was used by Hamas terrorists to plan and execute terror attacks against Israeli civilians and IDF troops,\" they said in a statemement. \"Prior to the strike, steps were taken to mitigate harm to civilians or to the hospital compound, including issuing advanced warnings in the area of the terror infrastructure, the use of precise munitions, and aerial surveillance. \"The Hamas terrorist organisation systematically violates international law while using civilian infrastructure, brutally exploiting the civilian population as a human shield for its terrorist activities.\" The health facility's director, Dr Fadel Naim, said they were warned of the attack beforehand. Hamas has denied using hospitals for military purposes throughout the war and has accused Israel of intentionally targeting its medical infrastructure in its ongoing offensive. Later on Sunday, Foreign Secretary David Lammy said Israel's attacks on medical facilities in Gaza \"have comprehensively degraded access to healthcare\" in the region, and noted al-Ahli Hospital \"has been attacked repeatedly\" since the war on Hamas began. \"These deplorable attacks must end,\" he added. \"Diplomacy not more bloodshed is how we will achieve a lasting peace.\" The latest strikes come after Israel ended its ceasefire with Hamas and restarted its air and ground offensive. Prime Minister Benjamin Netanyahu's government has also imposed a month-long blockade on food, fuel and humanitarian aid - a tactic that rights groups say is a war crime. Israel reconstructs Morag corridor On Saturday, Israel said it had completed the construction of a new security corridor that cuts off the southern city of Rafah from the rest of Gaza. The security corridor was referred to by Israeli officials as the Morag Axis, a reference to a former Israeli settlement previously located in an area between the two southern cities of Rafah and Khan Younis. The prime minister said the move gives Israel control of a second axis in southern Gaza in addition to the Philadelphi Corridor, running along the border with Egypt, which Israel sees as a key line stopping weapons being smuggled into Gaza.  Israel has also gained control of the Netzarim Corridor, which cuts off the northern third of Gaza from the rest of the territory. Morag's construction is part of Israel's pledge to seize large parts of Gaza to pressure Hamas to release remaining hostages and accept proposed ceasefire terms, and it further squeezes Palestinians into shrinking areas of land. In a statement on Saturday, Israel's defence minister Israel Katz said his country's military would soon expand \"rapidly\" throughout most of Gaza and that Palestinians would \"have to evacuate the fighting zones\". He did not say where Palestinians were supposed to go. The war between Israel and Hamas began when Hamas-led militants invaded Israel on 7 October 2023, killing around 1,200 people and taking 251 hostage. Some 59 hostages are still being held in Gaza, with 24 still believed to be alive. The ensuing Israeli offensive has killed more than 50,000 Palestinians, according to Gaza's Hamas-run health ministry. It does not distinguish between civilians and combatants in its count, but has previously said more than half of those killed in the conflict are women and children."
    },
    {
        "title": "Bangladesh issues arrest warrant for Tulip Siddiq - as she denies claims against her",
        "description": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq. ",
        "url": "https://news.sky.com/story/bangladesh-issues-arrest-warrant-for-tulip-siddiq-as-she-denies-claims-against-her-13348103",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tulip-siddiq-bangladesh_6845305.jpg?20250303164319",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-13 13:28:00",
        "Headline": "Bangladesh's Anti-Corruption Commission sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka, which her lawyers say she has never owned.",
        "Content": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq.  Bangladesh's Anti-Corruption Commission (ACC) sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka. Ms Siddiq's lawyers have told Sky News the allegations are \"completely false\", adding there was \"no basis at all for any charges to be made against her\". They said there was \"absolutely no truth\" behind the allegations regarding the plot of land. The MP resigned as a Treasury minister earlier this year following an investigation by the prime minister's ethics adviser into her links to her aunt Sheikh Hasina's regime, which was overthrown in Bangladesh last year. Earlier this month, Ms Siddiq told Sky News her lawyers were \"ready\" to handle any formal questions about allegations of corruption in Bangladesh.  In her first public comments since leaving government, Ms Siddiq said \"there's been allegations for months on end and no one has contacted me\". \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Ex-minister Tulip Siddiq attacks 'targeted and baseless campaign' against her by Bangladesh authorities\n                 \n                  Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister\n                 Last month, the interim leader of Bangladesh told Sky News the MP had \"wealth left behind\" in the country \"and should be made responsible\". Lawyers acting for Ms Siddiq wrote to the Bangladeshi Anti Corruption Commission (ACC) several weeks ago saying the allegations were \"false and vexatious\". The allegations surrounding Ms Siddiq are focused on links to her aunt Ms Hasina - who served as the prime minister of Bangladesh for 20 years. Ms Hasina was forced to flee the country in August following weeks of deadly protests. She is accused of becoming an autocrat, with politically-motivated arrests and other abuses allegedly happening on her watch. Ms Hasina claims it is all a political witch hunt. Ms Siddiq's lawyer said in a statement that she \"has not been contacted by the ACC or any authorities in Bangladesh\". \"The ACC has made various allegations against Ms Siddiq through the media in the last few months,\" they said. \"The allegations are completely false and have been dealt with in writing by Ms Siddiq's lawyers. The ACC has not responded to Ms Siddiq or put any allegations to her directly or through her lawyers. \"Ms Siddiq knows nothing about a hearing in Dhaka relating to her and she has no knowledge of any arrest warrant that is said to have been issued. \"To be clear, there is no basis at all for any charges to be made against her, and there is absolutely no truth in any allegation that she received a plot of land in Dhaka through illegal means. \"She has never had a plot of land in Bangladesh, and she has never influenced any allocation of plots of land to her family members or anyone else. \"No evidence has been provided by the ACC to support this or any other allegation made against Ms Siddiq, and it is clear to us that the charges are politically motivated.\""
    },
    {
        "title": "Rory McIlroy claims career Grand Slam with US Masters win",
        "description": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament.",
        "url": "https://news.sky.com/story/rory-mcilroy-claims-career-grand-slam-with-us-masters-win-13348424",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mcilroy-green-jacket_6885963.jpg?20250414005424",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:01:00",
        "Headline": "Northern Ireland's Rory McIlroy has won the 89th Masters at Augusta National, becoming only the sixth male golfer to complete the career Grand Slam.",
        "Content": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament. The Masters was the last major tournament left for McIlroy to complete the modern golf Grand Slam - a feat only five others have managed before him. McIlroy, who was making his 11th attempt at completing the Grand Slam, faced off Justin Rose in a sudden-death playoff to decide the Masters champion, after they finished tied on 11 under at the end of regulation on Sunday. 'So hard to stay patient' Speaking at a press conference after his victory, McIlroy said: \"You have to be the eternal optimist in this game. \"I have been saying it until I am blue in the face but I truly believe I am a better player now than 10 year ago. \"It is so hard to stay patient, keep coming back and not being able to get it done. \n                  Extinction Rebellion climate change protest disrupts PGA golf tournament in Connecticut\n                 \n                  Rory McIlroy's divorce off as couple look forward to 'new beginning'\n                 \n                  Scottie Scheffler: Charges against world number one golfer dropped after 'big misunderstanding' at PGA Championship\n                 \"There were points on the back nine where I thought, 'have I let this slip again?' but I responded and am really proud of myself. \"It has been an emotional week so I am thrilled to be last man standing.\" Just before slipping on a coveted green jacket during the presentation ceremony, the Northern Irishman said: \"It's my 17th time here and I started to wonder if it would ever be my time. \"I'm just absolutely honoured and thrilled and just so proud to be able to call myself a Masters champion.\" McIlroy had missed his six-foot putt for par, a bogey which dropped him back to 11 under, where he joined Rose - leading to a dramatic playoff between the two. Only five other golfers have been able to complete a career Grand Slam - Tiger Woods, Jack Nicklaus, Gary Player, Ben Hogan and Gene Sarazen. McIlroy is a two-time winner of the PGA Championship, claiming the prize in 2012 and 2014. The 35-year-old also won his first major title, the US Open, in 2011, and won the Open Championship in 2014. How did McIlroy clinch victory?  McIlroy recovered from losing his overnight two-shot advantage with an opening-hole double bogey to initially take control at Augusta National, only to blow a four-shot lead over his closing six holes. The world number two bogeyed the last to close a one-over 73 and slip back to 11 under alongside Rose, who overturned a seven-stroke deficit and posted a stunning final-round 66 to force a playoff. The players returned to the 18th for the playoff, where McIlroy made amends for his 72nd-hole blunder by firing a stunning approach to within three feet of the pin and making the birdie putt required for the win. After the winning putt dropped, McIlroy raised his arms towards the sky and let his putter fall behind him as he dropped to his knees overcome with emotion. He then embraced his wife Erica and daughter Poppy as chants of \"Rory! Rory!\" rang out around the green. 'Hard to put into words' Tony Denver, who was among those watching McIlroy from his home club in Holywood, County Down, told Sky News it was \"hard to put into words\" how he was feeling following the play-off, as crowds in the background cheered and applauded the world's number two golf player. Mr Denver went on to say the feeling was \"absolutely fantastic\", adding he remembers McIlroy \"from a young lad growing up and he's now one of the six players to win the Grand Slam which is just unbelievable\". Ruth Watt, lady captain of Holywood golf club, said: \"We are all immensely proud, absolutely delighted to be welcoming Rory back home in that green jacket. \"He has put us through the ringer tonight but what an outcome.\" She added: \"There was always something very special about the golf that he played but he is such a gentleman and such a lovely, lovely person.\" For the club, McIlroy's victory is just \"phenomenal\", she said."
    },
    {
        "title": "Pope makes appearance in St Peter's Square for Palm Sunday mass",
        "description": "Pope Francis has made an appearance in St Peter's Square for Palm Sunday, as he continues to recover from a life-threatening battle with double pneumonia.",
        "url": "https://news.sky.com/story/pope-makes-appearance-in-st-peters-square-for-palm-sunday-mass-13348005",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-the-pope-vatican_6885086.jpg?20250413121836",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-13 11:27:00",
        "Headline": "The pontiff is continuing to recover after a five-week hospital stay, and on Sunday was seen for the first time without nasal tubes for supplemental oxygen.",
        "Content": " Pope Francis has made an appearance in St Peter's Square for Palm Sunday, as he continues to recover from a life-threatening battle with double pneumonia. The pontiff greeted the 20,000-strong Vatican City crowd as he joined for mass, weeks after being released from hospital following a five-week stay. Faithfuls reached out to touch the 88-year-old's hand and garments as he was brought in a wheelchair down a ramp to the main altar, where he thanked supporters and wished them a \"Good Palm Sunday, a good Holy Week\". He was not wearing the nasal tubes for supplemental oxygen that he was still seen with at the Vatican a week ago - a reassuring sign as he continues his recovery. On his way back to St Peter's Basilica, the Pope stopped to bless a rosary, and offered sweets to a boy who greeted him. In his traditional Sunday blessing, which has been delivered in text form since his hospitalisation in mid-February, he said: \"At this time of physical weakness, they help me to feel God's closeness, compassion and tenderness even more.\" He also offered prayers for those suffering in the conflict in Sudan, which marks its second anniversary on Tuesday, and for Lebanon, where civil war began 50 years ago, as well as for peace in Ukraine, the Middle East, Congo, Myanmar and South Sudan. Read more:Israeli air strike hits Gaza hospitalIran and US hold 'indirect talks' over nuclear programme The Pope was admitted to hospital on 14 February for a bout of bronchitis that developed into double pneumonia. It is a particularly serious condition for him as he had pleurisy as a young adult and had part of one lung removed. He was discharged on 23 March, after giving a short greeting to the crowd outside the balcony of the room he was staying in. The pontiff made his first official appearance back in the public eye last Sunday, again briefly addressing the St Peter's Square crowd, saying: \"Happy Sunday to everyone. Thank you so much.\""
    },
    {
        "title": "Brother pays tribute to relatives killed in Hudson River helicopter crash - as cause remains unclear",
        "description": "The brother of a woman killed alongside her family in a helicopter crash in the Hudson River has said they died \"without suffering\", and thrown flowers into the water in their memory.",
        "url": "https://news.sky.com/story/brother-pays-tribute-to-relatives-killed-in-hudson-river-helicopter-crash-as-cause-remains-unclear-13347949",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-merce-camprubi-montal_6882597.jpg?20250411090939",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-13 09:17:00",
        "Headline": "Merce Camprubi Montal, her husband Agustin Escobar and their three children were killed when the aircraft broke apart and plunged into the Hudson River in New York City on Thursday. Pilot Sean Johnson also died in the crash.",
        "Content": " The brother of a woman killed alongside her family in a helicopter crash in the Hudson River has said they died \"without suffering\", and thrown flowers into the water in their memory. Joan Camprubi's sister, Merce Camprubi Montal, 39, died alongside her husband Agustin Escobar, 49, and their three children after the aircraft broke apart and plunged into the water in New York City on Thursday. The helicopter's pilot, Sean Johnson, was also killed. Mr Camprubi said the family, from Barcelona, Spain, \"left together\" and \"without suffering\" following the sightseeing flight over the city. \"As a family, we want to [remember] and honour their happiness and their smile forever,\" he added. One of their children, Mercedes, was due to celebrate her ninth birthday on Friday, the day after the crash. The other children were Victor, who was four, and 10-year-old Agustin. Mr Camprubi told reporters on Saturday: \"We will never forget you. And we will keep your smile alive every day of our lives. And that, I think, is the greatest legacy that we can give.\" New York Mayor Eric Adams joined Mr Camprubi to throw flowers and lamented that \"what should have been a joyful vacation turned into an unimaginable tragedy\". He also paid tribute to Mr Johnson, a former US Navy Seal, but said \"no words can fill the void, the loss\" that bereaved relatives are enduring. National Transportation Safety Board (NTSB) investigators have not yet determined the cause of the crash. There were reports of a loud boom when the aircraft, a Bell 206, broke apart, and officials previously said they were looking into reports of a large flock of birds being seen beforehand. As divers continued to pull pieces of the wreckage from the Hudson on Saturday, NTSB officials said they were checking the flight control system. The helicopter was not equipped with any black box flight recorders. Its main rotor, main gear box, tail rotor, and a large portion of the tail boom are still missing, the NTSB said.  Witnesses, including Aleesha Alam, described seeing the main rotor blade flying off moments before it dropped out of the sky. The main fuselage, including the cockpit and cabin, the forward portion of the tail boom, the horizontal stabiliser finlets, and the vertical fin have been recovered. Read more on Sky News:Menendez resentencing next weekDozens dead in missile attack'Indirect' US-Iran nuclear talks The helicopter had last been inspected on 1 March and completed seven tour flights earlier on Thursday. The accident took place during the aircraft's eighth flight of the day, according to the NTSB. It comes less than three months after 67 people died when an army helicopter and American Airlines jet collided over the Potomac River in Washington DC."
    },
    {
        "title": "Rory McIlroy claims career Grand Slam with US Masters win",
        "description": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament.",
        "url": "https://news.sky.com/story/rory-mcilroy-claims-career-grand-slam-with-us-masters-win-13348424",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mcilroy-green-jacket_6885963.jpg?20250414005424",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:01:00",
        "Headline": "Northern Ireland's Rory McIlroy has won the 89th Masters at Augusta National, becoming only the sixth male golfer to complete the career Grand Slam.",
        "Content": "Rory McIlroy has completed a career Grand Slam in golf with his win at the US Masters tournament. The Masters was the last major tournament left for McIlroy to complete the modern golf Grand Slam - a feat only five others have managed before him. McIlroy, who was making his 11th attempt at completing the Grand Slam, faced off Justin Rose in a sudden-death playoff to decide the Masters champion, after they finished tied on 11 under at the end of regulation on Sunday. 'So hard to stay patient' Speaking at a press conference after his victory, McIlroy said: \"You have to be the eternal optimist in this game. \"I have been saying it until I am blue in the face but I truly believe I am a better player now than 10 year ago. \"It is so hard to stay patient, keep coming back and not being able to get it done. \n                  Extinction Rebellion climate change protest disrupts PGA golf tournament in Connecticut\n                 \n                  Rory McIlroy's divorce off as couple look forward to 'new beginning'\n                 \n                  Scottie Scheffler: Charges against world number one golfer dropped after 'big misunderstanding' at PGA Championship\n                 \"There were points on the back nine where I thought, 'have I let this slip again?' but I responded and am really proud of myself. \"It has been an emotional week so I am thrilled to be last man standing.\" Just before slipping on a coveted green jacket during the presentation ceremony, the Northern Irishman said: \"It's my 17th time here and I started to wonder if it would ever be my time. \"I'm just absolutely honoured and thrilled and just so proud to be able to call myself a Masters champion.\" McIlroy had missed his six-foot putt for par, a bogey which dropped him back to 11 under, where he joined Rose - leading to a dramatic playoff between the two. Only five other golfers have been able to complete a career Grand Slam - Tiger Woods, Jack Nicklaus, Gary Player, Ben Hogan and Gene Sarazen. McIlroy is a two-time winner of the PGA Championship, claiming the prize in 2012 and 2014. The 35-year-old also won his first major title, the US Open, in 2011, and won the Open Championship in 2014. How did McIlroy clinch victory?  McIlroy recovered from losing his overnight two-shot advantage with an opening-hole double bogey to initially take control at Augusta National, only to blow a four-shot lead over his closing six holes. The world number two bogeyed the last to close a one-over 73 and slip back to 11 under alongside Rose, who overturned a seven-stroke deficit and posted a stunning final-round 66 to force a playoff. The players returned to the 18th for the playoff, where McIlroy made amends for his 72nd-hole blunder by firing a stunning approach to within three feet of the pin and making the birdie putt required for the win. After the winning putt dropped, McIlroy raised his arms towards the sky and let his putter fall behind him as he dropped to his knees overcome with emotion. He then embraced his wife Erica and daughter Poppy as chants of \"Rory! Rory!\" rang out around the green. 'Hard to put into words' Tony Denver, who was among those watching McIlroy from his home club in Holywood, County Down, told Sky News it was \"hard to put into words\" how he was feeling following the play-off, as crowds in the background cheered and applauded the world's number two golf player. Mr Denver went on to say the feeling was \"absolutely fantastic\", adding he remembers McIlroy \"from a young lad growing up and he's now one of the six players to win the Grand Slam which is just unbelievable\". Ruth Watt, lady captain of Holywood golf club, said: \"We are all immensely proud, absolutely delighted to be welcoming Rory back home in that green jacket. \"He has put us through the ringer tonight but what an outcome.\" She added: \"There was always something very special about the golf that he played but he is such a gentleman and such a lovely, lovely person.\" For the club, McIlroy's victory is just \"phenomenal\", she said."
    },
    {
        "title": "Hundred investors force ECB onto sticky wicket over revised £975m deal",
        "description": "A &#163;975m deal to transform the finances of English cricket risks facing further demands for revision over proposals including one allowing the sport's governing body to cancel The Hundred tournament in seven years time.",
        "url": "https://news.sky.com/story/hundred-investors-force-ecb-onto-sticky-wicket-over-revised-163975m-deal-13347958",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-oval-invincibles-london-spirit_6828051.jpg?20250213200326",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-13 09:59:00",
        "Headline": "The ECB would forego voting control over its flagship new tournament but retain the right to unilaterally cancel it after seven years of a new commercial deal, according to a document seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A £975m deal to transform the finances of English cricket risks facing further demands for revision over proposals including one allowing the sport's governing body to cancel The Hundred tournament in seven years time. Sky News has obtained a revised document sent this weekend by the England and Wales Cricket Board (ECB) to prospective investors in the eight Hundred franchises - who include some of the world's most powerful technology company executives. The document outlines a series of changes to the ECB's original proposals, in an attempt to persuade the competition's new shareholders - who have collectively agreed to stump up £520m for their team stakes - to sign binding contracts within weeks. In recent weeks, the ECB has come under pressure from many of the investors to revise proposals relating to media and sponsorship rights, future expansion of The Hundred, and governance of the tournament. The sale of the ECB's 49% stakes in the eight Hundred teams, including Trent Rockets and Oval Invincibles, was hailed as a landmark moment for the sport, paving the way for a vast injection of cash into English cricket at county and grassroots level. However, one senior cricket insider cast doubt on the ECB's timetable for signing binding agreements, scheduled for 29 April, amid continuing dissatisfaction from some stakeholders. Another sticking point for the investors may be the inclusion of a clause that the ECB has the right to unilaterally terminate the Hundred competition after seven years. \n                  Jos Buttler to step down as England's white-ball cricket captain\n                 \n                  Hampshire captain James Vince to move to Dubai after attacks on family home\n                 \n                  Joe Root becomes England's leading Test match run-scorer of all time\n                 \"What happens in year eight?\", said one on Sunday. \"These investors have agreed to pay hundreds of millions of pounds with no guarantee of terminal value.\" Among the new backers of The Hundred - which is broadcast by Sky Sports, which shares a parent company with Sky News - are the Chelsea FC co-owner Todd Boehly, the billionaire Indian Ambani family and a group of tech executives including the chief executives of Google and Microsoft. According to the document, the existing Hundred committee will be scrapped by a new body, The Hundred Board (HB), on which the ECB would cede control and hold just a third of the overall voting rights. The HB would consist of 20 members, with four from the ECB and two from each team - but with the ECB members each carrying double voting rights. \"The HB Agreement now protects teams from future changes, meaning [the] ECB can no longer unilaterally amend the decision-making and other powers of the HB. \"Instead, any variation to the HB Agreement will require approval from a majority of investor members of the HB, two-thirds of all members of the HB, and the ECB board,\" the document said. One of the ECB's board members will become chair of the HB, according to the document, while the governing body will also appoint the Hundred's managing director on a minimum five-year contract. A source close to one of the new investors questioned that arrangement on Sunday, arguing that such an arrangement risked \"embedding failure\" in the event of unhappiness at the competition's administration. The document also sets out several matters, including UK media rights arrangements for the period after 2029, which would be subject to so-called \"triple trigger voting\" requiring an \"affirmative vote from a majority of Investor Members of the HB, two-thirds of all members of the HB and the ECB board\". Also included on the triple-trigger list are: changes to league expansion criteria; the distribution of league expansion proceeds to ECB and The Hundred stakeholders; Material increases in payments from The Hundred and its teams to hosts and the broader ECB county ecosystem; and changes to the HB Agreement, or changes to the Framework Agreement that materially adversely affect teams. \"For the 2029 [media rights] cycle, the default position is the UK media rights will be sold on a bundled basis, with a floor valuation of £51m per year for The Hundred,\" the document said. \"For each subsequent cycle, the default shifts to an unbundled sale of rights between The Hundred and the ECB's broader UK media right package. \"For the 2029 cycle, ECB will request that UK rights bidders provide an itemized pricing allocation for The Hundred and non-Hundred rights to provide transparency on value of The Hundred.\" Read more:Starmer's search for football watchdog chair goes into extra-timeLecturers' pension fund seeks new tune with £90m O2 arena bid The ECB document said it would only permit expansion of The Hundred in 2029 or later, and that it could only admit teams which have a purpose-built permanent stadium that does not host another franchise. A revenue formula to protect distribution to existing teams would also be established, while new teams would be required to demonstrate that \"they unlock a new fan base and complementary ticket sales\". According to the document, the ECB has \"developed a revised set of termination events that protects the ECB and other teams in extreme scenarios, also providing further protection for teams for events outside of their control: • ECB will not unilaterally terminate The Hundred for seven years • The ECB Member Resolution termination event has been removed • ECB has clarified that it will not terminate the competition based on a breach by one or a select few clubs • Termination for force majeure has been extended to require disruption over two consecutive seasons of The Hundred • ECB's right to terminate for \"financial reasons\" has been clarified to only apply in scenarios where ECB is experiencing financial challenges due to cash losses generated by The Hundred.\" \"In the unlikely event the ECB decides to end its involvement in The Hundred, the ECB is committed to providing teams with an opportunity to maintain the competition independently, including using reasonable endeavours to make players, venues and a suitable playing window available to the competition,\" the document states. The ECB said it would also commit to \"not launch or sanction a competing professional league for a period of 4 years\". The ECB has also revised a set of sponsorship and player appearance proposals as part of its revised agreement. In an effort to ensure a swift resolution to the process, the ECB told investors that those who do not sign and complete their stake purchases simultaneously would forego their right to an additional dividend. For all investors, the governing body would provide \"a £1 liability cap on all Business Warranties (given on a knowledge qualified basis) and Tax Claims\". \"The ECB will provide fundamental warranties only and will provide no other indemnities or warranties.\" An ECB spokesman declined to comment on the document on Sunday, but pointed to comments made recently by Richard Gould, the governing body's chief executive. \"We're just trying to work out how to maximise value from sponsorships, tickets sales and broadcast revenues,\" he said. \"They're investing a lot of money into our game and we want to make sure that pays dividends. \"We've got brilliant supporters for our UK domestic market through Sky, but there are probably significant opportunities in the overseas broadcast market and that's very much something that they're focused on but there are differences in the markets. \"We need to make sure we've got something which is fit for purpose across the global markets, not just a UK market.\""
    },
    {
        "title": "Race to keep British Steel furnaces running with last-minute efforts to secure raw materials under way",
        "description": "Last-minute efforts to keep British Steel operating are to be carried out today, as the plant races to secure a supply of raw materials.",
        "url": "https://news.sky.com/story/race-to-keep-british-steel-furnaces-running-with-last-minute-efforts-to-secure-raw-materials-under-way-13348481",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875399.jpg?20250404000520",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-13 23:00:00",
        "Headline": "Unions said earlier this month that British Steel's owner, Chinese company Jingye, decided to cancel future orders for the iron ore, coal and other raw materials needed to keep the furnaces running.",
        "Content": "Last-minute efforts to keep British Steel operating are to be carried out today, as the plant races to secure a supply of raw materials. The Department for Business and Trade said officials are working to secure supplies of materials, including coking coal, to keep British Steel operational, as well as to ensure all staff will be paid. It added that setting up new supply chains was \"crucial\" as a fall in blast furnace temperature could risk \"irreparable damage to the site, with the steel setting and scarring the machinery\".  Companies including Tata - which ran the now-closed Port Talbot steelworks - and Rainham Steel have offered managerial support and materials to keep the Lincolnshire site running. Business Secretary Jonathan Reynolds said in a statement that \"when I said steelmaking has a future in the UK, I meant it\". \"Steel is vital for our national security and our ambitious plans for the housing, infrastructure and manufacturing sectors in the UK,\" he added. \"We will set out a long-term plan to co-invest with the private sector to ensure steel in the UK has a bright and sustainable future.\" \n                  Minister says he wouldn't bring China into 'sensitive' steel industry again\n                 \n                  A sticking plaster, not a solution: What next for British Steel?\n                 \n                  Relief in Scunthorpe after emergency British Steel law passed - but the fight isn't over yet\n                 Earlier this month, unions said the steelwork's owner, Chinese company Jingye, decided to cancel future orders for the iron ore, coal and other raw materials needed to keep the furnaces running. It meant the Scunthorpe plant had been on course to close down by May, bit it sparked urgent calls for government intervention. Emergency legislation was passed on Saturday bringing the steelworks into effective government control, and officials were on site as soon as the new legislation came into force. However, the business secretary has warned that does not mean the plant is guaranteed to survive. Appearing on Sky News' Sunday Morning With Trevor Phillips, Mr Reynolds also said he would not bring a Chinese company into the \"sensitive\" steel sector again. \"I don't know... the Boris Johnson government when they did this, what exactly the situation was,\" he added. \"But I think it's a sensitive area.\"  Jingye stepped in with a deal to buy British Steel's Scunthorpe plant out of insolvency in 2020, when Mr Johnson was prime minister. The minister added that while The Steel Industry (Special Measures) Bill stops short of the full nationalisation of British Steel, \"to be frank, as I said to parliament yesterday, it is perhaps at this stage the likely option\". The Conservatives accused the government of acting \"too late\" and implementing a \"botched nationalisation\" after ignoring warnings about the risk to the steelworks. Read more:A sticking plaster, not a solution: What next for British Steel?How Trump, China and Reform all played their part Shadow business secretary Andrew Griffith said: \"The Labour Government have landed themselves in a steel crisis entirely of their own making. \"They've made poor decisions and let the unions dictate their actions.\""
    },
    {
        "title": "Minister says he wouldn't bring China into 'sensitive' steel industry again",
        "description": "The business secretary has told Sky News he would not bring a Chinese company into the \"sensitive\" steel sector again - after the government was forced to take control of British Steel.",
        "url": "https://news.sky.com/story/minister-says-he-wouldnt-bring-china-into-sensitive-steel-industry-again-13347947",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jonathan-reynolds-trevor_6884975.jpg?20250413090510",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-13 09:26:00",
        "Headline": "Urgent legislation rushed through the House of Commons and House of Lords on Saturday gives ministers the power to instruct British Steel - owned by Chinese company Jingye - to keep the plant open.",
        "Content": " The business secretary has told Sky News he would not bring a Chinese company into the \"sensitive\" steel sector again - after the government was forced to take control of British Steel. Urgent legislation rushed through the House of Commons and House of Lords on Saturday gave ministers the power to instruct British Steel - owned by Chinese company Jingye - to keep the plant open. The Steel Industry (Special Measures) Bill essentially allows the government to take control of British Steel \"using force if necessary\", order materials for steelmaking and instruct that workers be paid. It also authorises a jail sentence of up to two years for anyone breaching this law. Emergency bill becomes law - follow the latest reaction here Jonathan Reynolds told Sunday Morning With Trevor Phillips that he would not \"personally bring a Chinese company into our steel sector\" again, describing steel as a \"sensitive area\" in the UK. The business secretary agreed there is now a high trust bar for Chinese companies to be involved in the UK economy. He said: \"I think steel is a very sensitive area. I don't know... the Boris Johnson government when they did this, what exactly the situation was. But I think it's a sensitive area.\" \n                  Race to keep British Steel furnaces running with last-minute efforts to secure raw materials under way\n                 \n                  A sticking plaster, not a solution: What next for British Steel?\n                 \n                  Relief in Scunthorpe after emergency British Steel law passed - but the fight isn't over yet\n                 Jingye stepped in with a deal to buy British Steel's Scunthorpe plant out of insolvency in 2020, when Mr Johnson was prime minister. But the company recently cancelled orders for supplies of raw materials needed to keep blast furnaces running at the site - the last in the UK capable of producing virgin steel. This threw the future of the steel industry into question, and ultimately led to MPs and peers being recalled from parliamentary recess to take part in a rare Saturday sitting when negotiations with Jingye appeared to break down. An emergency bill to save the plant became law later that day. Public ownership currently 'likely option' It stops short of full nationalisation of British Steel, but Reynolds told Sky News that public ownership remains the \"likely option\" for the future. He said: \"Well that remains an option. And to be frank, as I said to parliament yesterday, it is perhaps at this stage the likely option.\" Read more:British Steel workers express fears over plant's futureWhy the hot spring weather is sliding away However, the minister said he believes there is \"potential\" for a commercial private sector partner. He said: \"That is my preference, but I feel we've got to find a bridge to that. The kind of investments required for the transition to new steel technology, whichever technology that is, it's a lot of money, a lot of capital.\" Andrew Griffith, the shadow business secretary, said the government's emergency bill amounts to a \"botched nationalisation\". He told Sky News the Conservatives supported the \"least worst\" option in the Commons on Saturday. \"There's clearly still more work to do because the taxpayer is now picking up the bills for a business that is still owned by its Chinese owner,\" the Tory frontbencher said. \"I hope the government will very quickly come back and clarify that situation.\""
    },
    {
        "title": "Bangladesh issues arrest warrant for Tulip Siddiq - as she denies claims against her",
        "description": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq. ",
        "url": "https://news.sky.com/story/bangladesh-issues-arrest-warrant-for-tulip-siddiq-as-she-denies-claims-against-her-13348103",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tulip-siddiq-bangladesh_6845305.jpg?20250303164319",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-13 13:28:00",
        "Headline": "Bangladesh's Anti-Corruption Commission sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka, which her lawyers say she has never owned.",
        "Content": "Anti-corruption authorities in Bangladesh have issued a warrant for the arrest of British Labour MP Tulip Siddiq.  Bangladesh's Anti-Corruption Commission (ACC) sought the warrant over allegations Ms Siddiq received a 7,200sq ft plot of land in the country's capital, Dhaka. Ms Siddiq's lawyers have told Sky News the allegations are \"completely false\", adding there was \"no basis at all for any charges to be made against her\". They said there was \"absolutely no truth\" behind the allegations regarding the plot of land. The MP resigned as a Treasury minister earlier this year following an investigation by the prime minister's ethics adviser into her links to her aunt Sheikh Hasina's regime, which was overthrown in Bangladesh last year. Earlier this month, Ms Siddiq told Sky News her lawyers were \"ready\" to handle any formal questions about allegations of corruption in Bangladesh.  In her first public comments since leaving government, Ms Siddiq said \"there's been allegations for months on end and no one has contacted me\". \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Ex-minister Tulip Siddiq attacks 'targeted and baseless campaign' against her by Bangladesh authorities\n                 \n                  Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister\n                 Last month, the interim leader of Bangladesh told Sky News the MP had \"wealth left behind\" in the country \"and should be made responsible\". Lawyers acting for Ms Siddiq wrote to the Bangladeshi Anti Corruption Commission (ACC) several weeks ago saying the allegations were \"false and vexatious\". The allegations surrounding Ms Siddiq are focused on links to her aunt Ms Hasina - who served as the prime minister of Bangladesh for 20 years. Ms Hasina was forced to flee the country in August following weeks of deadly protests. She is accused of becoming an autocrat, with politically-motivated arrests and other abuses allegedly happening on her watch. Ms Hasina claims it is all a political witch hunt. Ms Siddiq's lawyer said in a statement that she \"has not been contacted by the ACC or any authorities in Bangladesh\". \"The ACC has made various allegations against Ms Siddiq through the media in the last few months,\" they said. \"The allegations are completely false and have been dealt with in writing by Ms Siddiq's lawyers. The ACC has not responded to Ms Siddiq or put any allegations to her directly or through her lawyers. \"Ms Siddiq knows nothing about a hearing in Dhaka relating to her and she has no knowledge of any arrest warrant that is said to have been issued. \"To be clear, there is no basis at all for any charges to be made against her, and there is absolutely no truth in any allegation that she received a plot of land in Dhaka through illegal means. \"She has never had a plot of land in Bangladesh, and she has never influenced any allocation of plots of land to her family members or anyone else. \"No evidence has been provided by the ACC to support this or any other allegation made against Ms Siddiq, and it is clear to us that the charges are politically motivated.\""
    },
    {
        "title": "No evidence of 'two-tier policing' in handling of Southport riots, MPs say",
        "description": "There was no evidence of \"two-tier policing\" in the handling of riots that erupted after last year's Southport murders, MPs have said.",
        "url": "https://news.sky.com/story/no-evidence-of-two-tier-policing-in-handling-of-southport-riots-mps-say-13347983",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-uk-riots-hartlepool_6812129.jpg?20250127152348",
        "type": "Politics",
        "Author": "Faith Ridler",
        "Date Published": "2025-04-13 23:00:00",
        "Headline": "A report by the Home Affairs Committee examined the police response to disorder that broke out after the murder of three girls at a Taylor Swift-themed dance class in Southport last year.",
        "Content": "\n          Politics reporter\n              @FaithLRidler\n There was no evidence of \"two-tier policing\" in the handling of riots that erupted after last year's Southport murders, MPs have said. A report by the Home Affairs Committee, published on Monday, examined the police response to disorder that broke out after the murder of three girls at a Taylor Swift-themed dance class in Southport on 29 July. Allegations of \"two-tier policing\" followed, suggesting that police were more heavy handed with people on the right of the political spectrum than the left. Politics latest: Follow live updates However, MPs on committee have concluded there was no evidence to support these \"baseless\" claims. They also found officers' handling of the violence was \"entirely appropriate given the levels of violence and criminality that were on display\". MPs said: \"This was not protest. \n                  Young people joined last summer's riots in 'thrill of the moment', says Children's Commissioner\n                 \n                  Colin Stonehouse and David Kirkbride: Pair who joined Tamworth hotel protests following Southport stabbings jailed for 21 months\n                 \n                  Man who featured in viral video after being hit in groin during Southport riot is jailed\n                 \"Those participating in disorder were not policed more strongly because of their supposed political views but because they were throwing missiles, assaulting police officers and committing arson. \"It was disgraceful to see unsubstantiated commentary about 'two-tier policing' undermining the efforts of police officers who served bravely in the face of violence.\" Misinformation about Southport attacker Axel Rudakubana spread online after the stabbings - including false claims that he was a 17-year-old asylum seeker who had come to the country by boat. A total of 246 protests, counter-protests and incidents of disorder took place in the aftermath, including 88 deemed \"significant\", the report said. As of 22 January this year, there had been 1,804 arrests and 1,072 charges linked to the riots. Dame Karen Bradley, chairwoman of the committee, said: \"There is a difference in how police must deal with violence and how they deal with peaceful protests. \"This needs to recognised by commentators who all too readily spread claims of 'two-tier policing'. Organised disorder is rightly met with a robust response; any implied equivalence with planned non-violent protests is simply wrong.\" The report also considered the impact of the riots on individual officers, noting \"it is clear that the disorder has had a detrimental effect\" when many were already \"struggling with heavy workloads, fatigue and stress\". Read more:Young people joined last summer's riots in 'thrill of the moment'Police 'immensely brave' but forces 'were unprepared' for summer riots Additionally, MPs agreed with findings from a watchdog that police forces should have better anticipated the risk of disorder in general, and that it should not have been taken for granted that planned protests following the Southport disorder would remain peaceful. Dame Karen added: \"It is a grim reality that bad actors sought to exploit the unspeakable tragedy that unfolded in Southport. \"The criminal justice system will need to ensure its approach to communication is fit for the social media age.\" Chief Constable BJ Harrington, the National Police Chiefs' Council lead for operations, said he is \"pleased that the report robustly disagrees with the notion of 'two-tier policing', and that the policing response was entirely appropriate given the levels of violence and criminality that were on display\". He added that MPs were right to \"praise the efforts\" of police, who were \"often in the face of very real risk and injury\"."
    },
    {
        "title": "Liberal Democrat MP Wera Hobhouse denied entry to Hong Kong to visit newborn grandson",
        "description": "A Liberal Democrat MP has been denied entry to Hong Kong where she was due to visit her newborn grandson.",
        "url": "https://news.sky.com/story/liberal-democrat-mp-wera-hobhouse-denied-entry-to-hong-kong-to-visit-newborn-grandson-13347858",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-wera-hobhouse-liberal-democrats_6884932.jpg?20250413014344",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-13 00:31:00",
        "Headline": "Wera Hobhouse says she landed at Hong Kong airport on Thursday after a 13-hour flight - only to be detained by security, questioned, and put on a return flight to the UK.",
        "Content": "A Liberal Democrat MP has been denied entry to Hong Kong where she was due to visit her newborn grandson. Wera Hobhouse landed at Hong Kong airport on Thursday after a 13-hour flight - only to be detained by security, questioned, and put on a return flight to the UK, she told The Sunday Times. She had been due to visit her three-month-old grandson and described Chinese authorities' actions as a \"cruel and upsetting blow\". Politics latest: Follow live updates \"My son was waiting at the other end at arrivals. I couldn't even see him and give him a hug and I hadn't seen him in a year,\" she told the newspaper. Ms Hobhouse is a member of the Inter-Parliamentary Alliance on China (Ipac) and has spoken out against Beijing's alleged human rights violations in both Hong Kong and Tibet. China has previously banned other Ipac members, including Sir Iain Duncan Smith and Nusrat Ghani, as well as former security minister Tom Tugendhat. Liberal Democrat leader Sir Ed Davey has called on the foreign secretary to summon the Chinese ambassador in the wake of the decision, which he described as \"heartless\" and \"totally unacceptable\". In a letter to David Lammy, he asked the minister to uncover \"why a British MP and her family have been treated in such an appalling way\". \"We are sure you will agree that this is a deeply concerning situation,\" Sir Ed said. \"The UK cannot allow the Chinese government to attempt to undermine our democracy by intimidating our parliamentarians.\" Read more from Sky NewsWho are the Labour MPs rejected from Israel?Emergency bill to protect British SteelPalestinian activist can be deported Mr Lammy previously described Ms Hobhouse's experience as \"deeply concerning\" and said he would \"urgently raise\" the issues with authorities in both Hong Kong and Beijing to \"demand an explanation\". \"It is deeply concerning to hear that an MP on a personal trip has been refused entry to Hong Kong,\" he said. \"As I made clear earlier this week, it would be unacceptable for an MP to be denied entry for simply expressing their views as a Parliamentarian.\" It comes after two Labour MPs were denied entry to Israel last week. Yuan Yang and Abtisam Mohamed were suspected of planning to \"document the activities of security forces and spread anti-Israeli hatred\", according to the country's immigration ministry. Ms Hobhouse claimed she is the \"first MP to be refused entry on arrival to Hong Kong since 1997\"."
    },
    {
        "title": "Upstairs, Downstairs actress Jean Marsh dies",
        "description": "Jean Marsh, star of Upstairs, Downstairs, has died aged 90, a friend has confirmed.",
        "url": "https://news.sky.com/story/upstairs-downstairs-actress-jean-marsh-dies-13348525",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jean-marsh-obe-2012_6885871.jpg?20250413214629",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-13 20:24:00",
        "Headline": "Jean Marsh was best known for her role as Rose in Upstairs, Downstairs, for which she won an Emmy for outstanding lead actress in a limited series in 1976.",
        "Content": "Jean Marsh, star of Upstairs, Downstairs, has died aged 90, a friend has confirmed. Marsh's friend, director Sir Michael Lindsay-Hogg, said in a statement to the PA news agency that the actress \"died peacefully in bed looked after by one of her very loving carers\". \"You could say we were very close for 60 years,\" he added. \"She was as wise and funny as anyone I ever met, as well as being very pretty and kind, and talented as both an actress and writer. \"An instinctively empathetic person who was loved by everyone who met her. We spoke on the phone almost every day for the past 40 years.\" Marsh was best known for her role as Rose in Upstairs, Downstairs, for which she won an Emmy for outstanding lead actress in a limited series in 1976. She co-created the series - about life in Edwardian England - with Dame Eileen Atkins. Born on 1 July 1934 in Stoke Newington, north London, Marsh's mother worked in a bar and as a theatre dresser, while her father was a handyman and printer's assistant. \n                  Erin Brockovich: 'My chiropractor saw mud on my stiletto - I said, I've been collecting dead frogs'\n                 \n                  Menendez brothers' resentencing hearing can go ahead next week, says judge\n                 \n                  Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?\n                 Marsh took dance and mime classes as therapy for an illness at a young age, and began acting on stage with a stint at Huddersfield Rep in the 1950s. She then transferred to London, and at just 12 years old made her West End debut in The Land Of The Christmas Stockings at The Duke of York's Theatre. A success in the US, Marsh appeared in iconic shows such as The Twilight Zone, Danger Man, Hawaii Five-O and Murder, She Wrote. She also made appearances in classic British shows, including Doctor Who - where she played William Hartnell's short-lived companion Sara Kingdom, among other appearances - and Detective. Marsh also had film roles in 1988's Willow, 1972's Frenzy, and 1976's The Eagle Has Landed."
    }
]