[
    {
        "title": "Andrew pays the ultimate price after years of public disdain",
        "description": "Andrew always denied the allegations - but the repeated accusations would not go away.",
        "url": "https://news.sky.com/story/birthright-could-not-withstand-withering-public-disdain-andrew-finally-pays-the-price-13460995",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-duke-of-york_7056916.jpg?20251021041958",
        "type": "Home",
        "Author": "Laura Bundock",
        "Date Published": "2025-10-30 21:13:00",
        "Headline": "For years, Andrew enjoyed the perks and privileges of his powerful position, but his birthright could not withstand withering public disdain after years of scrutiny over his relationship with Jeffrey Epstein.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n  Andrew always denied the allegations - but the repeated accusations would not go away. And his associations risked real reputational damage to the royal family. His friendship with convicted paedophile Jeffrey Epstein, his dealings with an alleged Chinese spy, and then the posthumous publication of his accuser, Virginia Giuffre's memoir. Her family said she brought down a British prince with her truth and extraordinary courage. The piling pressure was starting to overshadow the work of Andrew's wider family. And with the Prince of Wales soon heading to Brazil for his Earthshot award, enough was enough. We understand the Royal Family, including Prince William backed the King's leadership on this matter. The King made the decisions, his family supported them. \n                  'Huge moment in world history' as Andrew loses titles - and will be kicked out of royal home\n                 \n                  King heckled over Prince Andrew and Jeffrey Epstein during visit\n                 \n                  No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit\n                 Andrew will leave Royal Lodge, his large home on the Windsor estate. His ex-wife, Sarah Ferguson, who also lived there, will \"make her own arrangements\". It was their family home for many years. Both daughters, Princess Beatrice and Princess Eugenie, who grew up there, will keep their titles. As for Andrew, he will soon move to Sandringham - the King's private Norfolk estate - where the family traditionally gathers for Christmas; and he will be funded privately by the King. Read more:Andrew allegations should be examined in 'fullest ways' This is all a formal process carried out in consultation with official authorities, but the government supports the decision taken. This will not have been easy for the King, but he knew he could not ignore public opinion. The criticism and anger directed at Andrew was never going to stop - and only he had the power to take the ultimate action against his own brother. For years, Andrew enjoyed the perks and privileges of his powerful position, but his birthright could not withstand withering public disdain. And now he's paid the ultimate price."
    },
    {
        "title": "Defiance in the West Bank - despite encroaching threat from 'unwanted neighbours'",
        "description": "For generations, Keith Asad's family has owned olive trees in the land near the West Bank town of Turmosayya, but now they are out of his reach.",
        "url": "https://news.sky.com/story/defiance-in-the-west-bank-despite-encroaching-threat-from-unwanted-neighbours-13461004",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-west-bank-israel_7067386.jpg?20251030215249",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-30 21:29:00",
        "Headline": "For people living in the occupied West Bank, it feels like even basic tasks, like visiting an olive grove, can be risky - and Sky's crew was threatened with arrest as they drove around.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  For generations, Keith Asad's family has owned olive trees in the land near the West Bank town of Turmosayya, but now they are out of his reach. The trees are still there. He can see them, clearly, from the backyard of his house, tantalisingly close. But he can't go there. He's too frightened, and with good reason. Even though he lives in a town where crime is almost unknown, Keith has just installed a wall made of rigid metal spikes, and he's considering adding barbed wire to the top of them. He worries about the safety of his wife and children, but why? Through the gaps between the spikes, we can see a group of vehicles and tents that have been set up in the valley beyond Keith's house. He calls them his \"unwanted neighbours\". The rest of the world calls them settlers. \"We have some trees over there,\" he says, pointing at his land. \"This is the first year that we're not even thinking about going over there.\"  'Oh, we'll be shot… guaranteed' \"What would happen if you went?\" I ask, and the answer is immediate. \"Oh, we'll be shot. That's guaranteed. One hundred percent.\" This group arrived a few months ago, with just a couple of tents, a couple of cars and an air of menace. Road blocks appeared, stopping the locals from reaching their ancestral land. Buildings were vandalised and weapons were brandished. And Keith says the Israeli police and military have done nothing to help. He shows me the damage to a door left behind after Israeli soldiers came to the house in the early hours of one morning, searching it from top to bottom and refusing to explain why. He feels besieged, and he knows it will get worse. Because more and more of these outposts are being set up in the West Bank, by Israelis who believe they have a historic, or biblical, right to the land. They are illegal, under both Israeli and international law. But it is almost unknown for Israeli authorities to do anything to stop them and there is a crop of Israeli politicians, including some in the cabinet, who are passionate about encouraging as many new outposts as possible. Because over time, they grow, attracting more people. Military to civilian occupation Roads and houses are built, Palestinians are intimidated into leaving and eventually those little outposts morph into permanent settlements, signed off and approved by the Israeli government. And gradually, the Israeli occupation of the West Bank becomes slightly less military and slightly more civilian. For the Palestinians we spoke to, it feels like an invasion, fuelled by a sense that the settlers act and attack with impunity. Between 2005 and 2024, only around 3% of police investigations into settler violence ended in conviction. And, of course, many attacks are never investigated. 'Very, very nervous' In the olive groves outside Turmosayya, Yasser Alqam is driving me along a rough track, looking warily from side to side. \"I feel very, very nervous,\" he says. \"I'm looking to my sides, on top of these hills, because, without any warning, stones can come down on your car. \"And it's going to take you a while before you figure out which way they're coming from.\" Yasser was here earlier in the month when he saw a horrendous attack, in which a settler, armed with a club dotted with nails, beat people - including a 53-year-old Palestinian woman called Afaf Abu Alia. Video of her being attacked, and then, covered in blood, helped to a car to be taken to hospital, was put on social media and attracted widespread condemnation. So far, despite the video evidence, nobody has been arrested. Sky News confronted by Israeli troops Yasser takes us to the site of the attack. As we film, an Israeli military vehicle comes along a track and stops in a cloud of dust. The soldiers emerge and tell us we have to leave for our own protection, claiming that this olive grove is, in fact, a closed military zone. Read more from Sky News:Andrew to relocate to SandringhamMan killed in helicopter crash I ask who they are protecting us from, but there is no answer. I'm shown a WhatsApp image of a rudimentary rectangle on a map, and informed that this is a military order. We're then told we can't leave, and that the police are on the way to arrest us. We discuss the law. And then, as suddenly as it started, it's over - we're free to go. It's just another flare-up on the West Bank. In a statement, the Israel Defense Forces (IDF) told us its mission was to thwart terrorism, and it said it strongly condemned violence of any kind. It said it would conduct a review of the attacks we have reported on here. But the echoes of violence reverberate here. We go to visit Afaf, the woman who was so grievously attacked. Her body is badly battered, and she has two blood clots on her brain, but she has been discharged from hospital and is sitting on a sofa, her family around her, frail but sure. The song of defiance \"They beat me on my head, behind my ears, along my legs, my back, and my neck all over my body, everywhere,\" she tells me. \"I was terrified. The first thing that came to my mind was my son - he's getting married soon. All I could think was that I might never get the chance to celebrate. \"It's our land. We stand our ground, and we are here to stay. We're not going anywhere. I won't give it up to setters. They can beat us all they want, they won't break us.\" It is a refrain you hear repeatedly on the West Bank - the song of defiance. The olive farmers still come out, tending to their trees, aware that settlers, with their guns and their own belief that this land is rightly theirs, are lurking. These valleys and fields are, at once, so tranquil, but also so very ominous and menacing."
    },
    {
        "title": "Damning report eviscerates UK's 'complacent' fast jets programme",
        "description": "Repeated delays to the UK's multibillion-pound F-35 fast jet programme, because of a lack of cash, has increased costs and harmed the plane's ability to fight, a report by MPs has said.",
        "url": "https://news.sky.com/story/damning-report-eviscerates-uks-complacent-fast-jets-programme-13461038",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-royal-navy-raf-aircraft_7067431.jpg?20251030223729",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-30 22:08:00",
        "Headline": "The UK only has 37 out of a planned 138 F-35 jets in service - almost four decades since the programme, led by the US, was conceived.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Repeated delays to the UK's multibillion-pound F-35 fast jet programme, because of a lack of cash, has increased costs and harmed the plane's ability to fight, a report by MPs has said. Exacerbating the problem, an \"unacceptable\" shortage of pilots and engineers is limiting how often the aircraft can fly, the Public Accounts Committee revealed. It also raised questions about a major announcement by Sir Keir Starmer in June that the UK would purchase a variant of the aircraft that is able to carry American nuclear weapons, saying there did not appear to be a timeframe for when this capability would be operational nor an estimate of the additional price tag. The strong criticism will likely make uncomfortable reading for Air Chief Marshal Sir Richard Knighton, Britain's new military chief. He was previously the head of the Royal Air Force and before that the top military officer at the Ministry of Defence (MoD) in charge of capability. The UK only has 37 out of a planned 138 F-35 jets in service - almost four decades since the programme, led by the US, was conceived and nearly a quarter of a century since Britain initially started paying tens of billions of pounds for it. The aircraft are among the most advanced, stealthy and lethal jets on the planet, provided they have the right technology, weapons and - crucially - software updates. A persistent squeeze on UK defence budgets, though, means military chiefs developed a bad habit of slowing down the F-35 procurement and scrimping on orders to save money in the short term - only for taxpayers to be hit with a much larger bill overall and for the RAF and the navy's Fleet Air Arm to be left with jets that are unable to meet their full potential. The Public Accounts Committee laid bare the impact of this behaviour, highlighting five key issues: One: A short-term cost-saving decision by the MoD in 2021 to save £82m by delaying an investment in what is known as an Air Signature Assessment Facility - which is vital for the F-35's stealth capabilities to fly undetected - will add an extra £16m when it is finally built in 2032. More worryingly, this limits the UK's ability to deploy the jets. Two: A cost-saving move to delay by six years building infrastructure for the naval squadron that operates the F-35 jets means the cost for that construction will almost treble to £154m from £56m. Three: A failure by the MoD to accurately update the total acquisition cost of the F-35s. The department only this year said the whole-life cost until 2069 to acquire a total of 138 aircraft will be almost £57bn - up from £18.4bn for the first 48 jets out until 2048. But even the new higher price tag was dismissed by the MPs as \"unrealistic\" - because it does not include additional costs such as fuel. Four: The current fleet of F-35B jets will not be armed with conventional missiles to hit targets on the land from a safe distance until the early 2030s. This is a critical capability in modern warfare when operating against a country like Russia that has sophisticated air defence weapons that can blast jets in range out of the sky. Five: The military will claim its F-35B jump jets have met \"full operating capability\" by the end of the year - a timeline that is already years late - even though they do not have the long-range missiles and are blighted by other woes. A 'leaky roof' mistake Sir Geoffrey Clifton-Brown MP, the committee chair, said: \"Making short-term cost decisions is famously inadvisable if you're a homeowner with a leaky roof, let alone if one is running a complex fighter jet programme - and yet such decisions have been rife in the management of the F-35.\" The UK's existing F-35Bs are designed to fly off the Royal Navy's two aircraft carriers. The nuclear weapons-capable A-variant only operate off the land. The MoD has said it will purchase an additional 15 F-35Bs and 12 of the As at an anticipated cost of £3.2bn. However, there is no estimate yet of the cost to certify the F-35As to join a NATO mission, carrying American nuclear warheads. Read more:Can UK's new air defence missile systems protect us? The MPs said they were told work on becoming certified to operate with US nuclear weapons \"is at an early stage and the department did not provide any indication of forecast costs\". 'Very complacent' The report flagged concerns about personnel shortages and how that impacted the availability of the few F-35s the UK does operate. This included the need for an extra 168 engineers - a 20% increase in the current workforce and a shortfall that \"will take several years to resolve\", the MPs said. Making the recruitment and retention dilemma even worse is \"substandard\" accommodation at RAF Marham, which has been the home for the F-35 force since 2013. This has again been caused by budget shortfalls, meaning insufficient funds to invest in infrastructure. The MoD said some upgrades would be completed by 2034. The Public Account Committee said this \"is very complacent and should be given greater priority\". An MoD spokesperson said: \"Many of the decisions referenced in the report were taken under the previous government, and we have set out plans to tackle historic issues with procurement, infrastructure, recruitment, and skills through the Strategic Defence Review.\""
    },
    {
        "title": "Rachel Reeves to face no further action over 'inadvertent' rental licence 'failure', says Keir Starmer",
        "description": "Sir Keir Starmer has said Rachel Reeves will face no further action over her \"inadvertent failure\" to obtain a rental licence for her south London home. ",
        "url": "https://news.sky.com/story/rachel-reeves-to-face-no-further-action-over-inadvertent-rental-licence-failure-says-keir-starmer-13460984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves_7067340.jpg?20251030210645",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:00:00",
        "Headline": "The PM's letter came after the letting agency Rachel Reeves used to rent out her home apologised.",
        "Content": " Sir Keir Starmer has said Rachel Reeves will face no further action over her \"inadvertent failure\" to obtain a rental licence for her south London home.  It follows a turbulent 24 hours for the chancellor, in which she was accused of breaking the law and the Conservatives called for her to resign or be sacked. In a letter published on Thursday night, the prime minister said correspondence shared by the chancellor \"shows that the oversight regarding the licence occurred after your husband had been told by the estate agents that they would apply for a licence on his behalf\". However, the application \"did not occur\". Politics latest: Key emails published in rent breach row Sir Keir continued: \"It is clearly regrettable that the information in this correspondence was not shared with me when you wrote to me last night, but I fully accept that you were not aware, at that stage, of these emails. \"I understand that the relevant emails were only unearthed by your husband this morning, and that you have updated me as soon as possible.\" \n                  Rachel Reeves survives permit row, but questions it raises cut deeper\n                 \n                  Badenoch says hacking into Harriet Harman's website 17 years ago 'not the same' as Reeves breaking law\n                 \n                  Farage v Mahmood: Who is the Terminator?\n                 The PM then labelled the incident \"an inadvertent failure\" and said he sees \"no need\" for further action. The government has also published a letter from Sir Laurie Magnus, an independent adviser on ministerial standards, to Sir Keir. He wrote: \"It is regrettable that information provided on successive days has generated confusion, but I find no evidence of bad faith.\" The letters came after Ms Reeves had received an apology from a lettings agency after the company confirmed it offered to apply for a rental licence and then failed to do so. On Wednesday evening, the Daily Mail reported Ms Reeves had failed to pay for a \"selective\" licence when renting out her family home in Dulwich, south London, which she has left while living in Downing Street as chancellor. In an exchange of letters a matter of hours later, Sir Keir Starmer gave the chancellor his backing and said further investigation into the issue was \"not necessary\" after consulting his independent ethics adviser Sir Laurie Magnus. Ms Reeves immediately faced calls to leave her post, having admitted to mistakenly breaching local council housing rules by failing to secure the licence. The Housing Act 2004 gives councils the power to make landlords accredit themselves in certain areas. However, late on Thursday afternoon, the owner of lettings agency Harvey and Wheeler released an apology to the chancellor. In it, boss Gareth Martin confirmed a member of his staff said they would apply for the licence for the Reeves family - but this was never done, as the person \"suddenly resigned\" prior to the start of the tenancy. Mr Martin said: \"We alert all our clients to the need for a licence. In an effort to be helpful our previous property manager offered to apply for a licence on these clients' behalf, as shown in the correspondence. That property manager suddenly resigned on the Friday before the tenancy began on the following Monday. \"Unfortunately, the lack of application was not picked up by us as we do not normally apply for licences on behalf of our clients; the onus is on them to apply. We have apologised to the owners for this oversight. \"At the time the tenancy began, all the relevant certificates were in place and if the licence had been applied for, we have no doubt it would have been granted. \"Our clients would have been under the impression that a licence had been applied for. Although it is not our responsibility to apply, we did offer to help with this. \"We deeply regret the issue caused to our clients as they would have been under the impression that a licence had been applied for.\" Read more:Badenoch hacking 'not the same' as Reeves 'law break'Sam Coates: Rental row raises questions that cut deeper Under the Housing Act 2004, introduced by Labour, councils can decide to introduce selective licensing, where residential landlords in specified areas must have a licence.\n Landlords must adhere to certain requirements to obtain a licence, including gas certificates, working carbon monoxide alarms and fire safety regulations for furnishings. They must secure a licence within 28 days of renting out a home.\n Southwark Council, where Rachel Reeves' house is, charges £900 for a licence, which lasts five years. Failure to secure a selective licence can result in a penalty of up to £30,000 or an unlimited fine from a court upon conviction. Landlords can also be made to repay up to 12 months' rent to the tenant or they can be prevented from renting out the property.\n Serious and repeat offenders can be prosecuted, with a sentence of up to five years or an uncapped fine, and they can be put on a rogue landlords database.\n The government has published emails between her husband Nicholas Joicey and the agency showing that Harvey and Wheeler had agreed to apply for the licence, while Ms Reeves told the prime minister in a letter she took \"full responsibility\" for the matter. The final email in the series, sent on 13 August 2024 by the letting agent, said: \"I will do the selective licence once the new tenant moves in.\" In the letter from Ms Reeves to Sir Keir, the chancellor said: \"Yesterday I wrote to you and said that we were not aware that a licence was necessary to let out our property, based on conversations my husband had with the agency yesterday. \"Today the letting agency and my husband have found correspondence confirming that on 17 July 2024 the letting agent said to my husband that a selective licence would be required and agreed that the agency would apply for the licence on our behalf. \"They have also confirmed today they did not take the application forward, in part due to a member of staff leaving the organisation. Nevertheless, as I said yesterday, I accept it was our responsibility to secure the licence. \"I also take responsibility for not finding this information yesterday and bringing it to your attention. \"As I said to you today, I am sorry about this matter and accept full responsibility for it.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 The Conservatives are calling for further investigations from Downing Street into what happened and the timeline of events. However, it appears that Number 10 considers the matter closed as it has consistently stood behind the chancellor - and says she will deliver next month's budget."
    },
    {
        "title": "Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans",
        "description": "The US is drastically cutting the number of refugees it will allow into the country to 7,500, and giving priority to white South Africans.",
        "url": "https://news.sky.com/story/donald-trump-announces-dramatic-drop-in-us-refugee-intake-with-most-of-them-white-south-africans-13460936",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-president-donald-trump_7067306.jpg?20251030200838",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:40:00",
        "Headline": "The new figure is a dramatic reduction from last year's 125,000, set by former president Joe Biden and half the 15,000 total for 2021, reportedly the previous lowest.",
        "Content": "The US is drastically cutting the number of refugees it will allow into the country to 7,500, and giving priority to white South Africans. The new figure, announced on Thursday in a memo in the Federal Registry, the official journal of the US administration, is a dramatic reduction from last year's 125,000, set by former president Joe Biden. No reason was given for the decrease, but the note said the admission of the 7,500 refugees during the 2026 fiscal year was \"justified by humanitarian concerns or is otherwise in the national interest\".   The notice posted to the register's website said the 7,500 admissions would \"primarily\" be allocated to Afrikaner South Africans and \"other victims of illegal or unjust discrimination in their respective homelands\". It is half the 15,000 total set for 2021 during Donald Trump's first term in office at the height of the COVID pandemic, which reports said was the previous lowest refugee admissions cap. Refugee rights groups were quick to condemn the proposal, with International Refugee Assistance Project (IRAP) president Sharif Aly, saying that by \"privileging Afrikaners while continuing to ban thousands of refugees who have already been vetted and approved, the administration is once again politicising a humanitarian programme\". Krish O'Mara Vignarajah, CEO of Global Refuge, said: \"Concentrating the vast majority of admissions on one group undermines the programme's purpose as well as its credibility.\" \n                  Trump's upbeat opinion of his meeting with Xi brushes over thornier issues\n                 \n                  Donald Trump says tariffs will be cut after 'amazing' meeting with Xi Jinping\n                 \n                  Trump-Xi meeting as it happened: US president teases 'large' energy deal after rating talks '12 out of 10'\n                 Human Rights First president, Uzra Zeya, called it a \"new low point\" in US foreign policy, which will \"further destabilise front-line states that host over two-thirds of the world's nearly 43 million refugees, undermining US national security in tandem\". In May, Mr Trump confronted South Africa's President Cyril Ramaphosa in the White House, claiming white farmers in his nation were being killed and \"persecuted\". A video purporting to show burial sites for murdered white farmers was played but was later shown to be scenes from a 2020 protest in which the crosses represented farmers killed over multiple years. The South African government has vehemently denied that Afrikaners and other white South Africans are being persecuted. Read more from Sky News:Tariffs change after 'amazing' Xi talksIs Trump preparing for war with Venezuela?US kills 14 in 'drug boat' attacks In January, the US president suspended the US Refugee Admissions Programme (USRAP) to, in his words, allow US authorities to prioritise national security and public safety. During the Oval Office meeting, Mr Ramaphosa said only that he hoped that Trump officials would listen to South Africans about the issue, and later said he believed there is \"doubt and disbelief about all this in [Mr Trump's] head\"."
    },
    {
        "title": "Before and after images of Jamaica show destruction left by Hurricane Melissa",
        "description": "The scale of the destruction left by Hurricane Melissa as it tore across Jamaica is now being revealed by the first photos taken by satellites.",
        "url": "https://news.sky.com/story/before-and-after-images-of-jamaica-show-destruction-left-by-hurricane-melissa-13460662",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jamaica-black-river_7066649.jpg?20251030081417",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-30 12:18:00",
        "Headline": "Satellite images show the impact the 185mph winds had on Jamaica after Hurricane Melissa made landfall on the island earlier this week.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The scale of the destruction left by Hurricane Melissa as it tore across Jamaica is now being revealed by the first photos taken by satellites. The eye of the storm made landfall on the southwest coast of the island, 75 miles from the capital Kingston, on Tuesday. Before and after images from Vantor's satellites show the impact of the 185mph winds on the town of Black River, the capital of St Elizabeth Parish. Use the sliders below to see the same areas of Jamaica before and after the hurricane struck. There is widespread damage. Some houses and businesses are without roofs, and others have been destroyed altogether. The covered food market is in ruins. So is St John Anglican church, one of the oldest in Jamaica - only its bell tower still stands.  Houses that lined the shore would have born the brunt of the storm surge. Further along the coast is the fishing village of White House. Streets have been reduced to piles of rubble. Trees have been stripped of their leaves by the wind. The west of Jamaica is the country's bread basket, important for growing food. But fields are underwater, flooded by up to a metre of rain that fell as the vast storm system passed over. Many crops will have been destroyed and the government has appealed for vegetable seeds so farmers can quickly plant crops again. Read more:What we know about Hurricane MelissaUK charters flights to transport Britons out of Jamaica On the northwest coast is the resort of Montego Bay. The container terminal and oil storage tanks in the port have been inundated by the storm surge and are surrounded by water. It's estimated that 400,000 people in Jamaica have been affected by the hurricane. And the cost of the devastation is immense. Estimates by hazard analysts Enki Research put the bill at £5.8bn. That's more than a third of Jamaica's GDP - a measure of its economic wealth. It will take months and international support to put Jamaica back on its feet."
    },
    {
        "title": "Britons urged to book jabs as flu season hits the UK weeks earlier than usual",
        "description": "The UK's flu season has begun more than a month earlier than usual &#8211; with cases three times higher than this time last year.",
        "url": "https://news.sky.com/story/britons-urged-to-book-jabs-as-flu-season-hits-the-uk-weeks-earlier-than-usual-13460883",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-flu-illness_7067167.jpg?20251030172841",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-30 17:18:00",
        "Headline": "The rise in cases is being driven by a spike in school-aged children falling ill, the NHS has said.",
        "Content": "The UK's flu season has begun more than a month earlier than usual – with cases three times higher than this time last year. It follows warning signs from the Asia-Pacific region, where Japan has already declared a flu epidemic and closed many schools. The latest figures from the UK Health Security Agency (UKHSA) reveal cases have this week increased from 6.1% to 8.2%, largely driven by a spike in school-aged children falling ill. Duncan Burton, chief nursing officer for England, said: \"This early rise of flu in children is particularly concerning - especially given that flu circulation in children normally precedes that in adults.\" It's \"vitally important\" that anyone eligible for a flu vaccine books theirs in \"as soon as possible to avoid a long and drawn-out flu season\", he added. The NHS has ramped up its vaccine programme and so far delivered more than 12.2m flu jabs this autumn. For the first time, everyone eligible for winter vaccines has been able to book an appointment since 1 September. Dr Alex Allen, consultant epidemiologist at the UKHSA, said: \"We're seeing an unusually early start to the flu season this year, with the latest data showing a sharp increase among children but also increases in other age groups, with the virus now starting to spread more widely in the community. \"If you're eligible for a vaccine it is because you are at greater risk of severe illness - every year we see many thousands end up in hospital and far too many deaths from flu. \"It's crucial that everyone eligible books their appointment as soon as possible. The vaccine is our best defence.\" All eligible adults should aim to have received their flu jab by the end of November, the NHS has said. Appointments are available in GP practices, local pharmacies and community clinic drop-in centres. Parents are being reminded to complete their child's vaccine consent forms or book appointments for two and three-year-olds."
    },
    {
        "title": "Man dies after helicopter crash near Doncaster",
        "description": "A 70-year-old man has died after a helicopter crash in a field near Doncaster.",
        "url": "https://news.sky.com/story/police-at-scene-of-helicopter-crash-near-doncaster-13460680",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-doncaster-helicoopter_7066967.jpg?20251030141321",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-30 12:44:00",
        "Headline": "Three others – including a 10-year-old boy – suffered minor injuries in the crash. ",
        "Content": " A 70-year-old man has died after a helicopter crash in a field near Doncaster. South Yorkshire Police say officers were called to reports of a helicopter crash in a field off Ings Lane, Bentley. Officers say a man suffered serious injuries in the crash and despite the best efforts of medical staff, he was sadly pronounced dead at the scene. \"His family is aware and being supported by our officers,\" police say. The pilot, a 41-year-old man, and two other passengers, a 58-year-old woman and a 10-year-old boy, received minor injuries. A parallel investigation has been launched between the Air Accidents Investigation Branch (AAIB) and South Yorkshire Police. Detective Chief Inspector Gary Magnay, silver commander, said: \"Our thoughts are with the family and loved ones of the man who sadly died in this tragic incident. \"We and our emergency services colleagues remain at the scene and we have launched a full joint investigation into the circumstances surrounding the incident in parallel with the AAIB.\" Anyone with information on the incident should contact the police, he said, adding they are \"particularly keen to hear from those with footage of the helicopter leading up to the crash\". Ed Miliband, the MP for Doncaster North, said: \"This is devastating news and my thoughts are with the family and friends of the victim of this terrible incident. \"My office are in touch with the relevant authorities including South Yorkshire Police, and I know the whole of Doncaster will be united in having the victim in their thoughts today.\" Read more:Mum faces nightly battle to keep daughter aliveTV star 'in shock' after being attacked in street  The helicopter was a private flight which took off from Gamston Airport near Retford shortly before it crashed. In a statement, the airport said: \"We can confirm an aircraft based here operated by an onsite tenant has been involved in an incident. \"We have no further information at this time.\" A spokesperson for the Air Accidents Investigation Branch said: \"The AAIB has been made aware of an accident near Doncaster and has deployed a team to commence an investigation.\""
    },
    {
        "title": "Andrew loses his titles - everything we know",
        "description": "Andrew has been stripped of his royal titles, Buckingham Palace has said.",
        "url": "https://news.sky.com/story/andrew-loses-his-titles-everything-we-know-13460988",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-jeffrey-epstein_7067343.jpg?20251030211138",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:04:00",
        "Headline": "A notice has been served for Andrew to surrender his lease at the Royal Lodge, Buckingham Palace has said.",
        "Content": " Andrew has been stripped of his royal titles, Buckingham Palace has said. It means the former prince will now be known as Andrew Mountbatten Windsor. A notice has also been served for Andrew to surrender his lease at the Royal Lodge. The decision from the King follows continued criticism about Andrew's former friendship with paedophile financier Jeffrey Epstein, which was recently intensified by a string of damaging leaks. Virginia Giuffre, who died in April, accused Andrew of sexually assaulting her after being introduced by Epstein. Andrew has always vehemently denied her accusations. Andrew latest: King's brother to lose 'prince' title and move out of Royal Lodge What has Buckingham Palace said? In a statement on Thursday evening, Buckingham Palace announced the King had started the formal process \"to remove the Style, Titles and Honours of Prince Andrew\". \"His lease on Royal Lodge has, to date, provided him with legal protection to continue in residence. Formal notice has now been served to surrender the lease and he will move to alternative private accommodation,\" the statement added. \"These censures are deemed necessary, notwithstanding the fact that he continues to deny the allegations against him. \"Their Majesties wish to make clear that their thoughts and utmost sympathies have been, and will remain with, the victims and survivors of any and all forms of abuse.\"  Why is this happening now? The move from the King follows fresh allegations against Andrew, after he announced he would no longer use his royal titles.  Among them was an allegation he sought to dig up information on Ms Giuffre through a Met bodyguard. It also emerged he had been paying a \"peppercorn rent\" on his property - piling pressure on him staying at Royal Lodge. Andrew has not released a statement following Thursday's announcement, but it is understood he has not objected to it. What has Virginia Giuffre's family said? The family of Andrew's accuser, who say she died by suicide, said Ms Giuffree \"brought down a British prince\". \"Today, an ordinary American girl from an ordinary American family brought down a British prince with her truth and extraordinary courage,\" they said in a statement. \"Virginia Roberts Giuffre, our sister, a child when she was sexually assaulted by Andrew, never stopped fighting for accountability for what had happened to her and countless other survivors like her. \"Today, she declares a victory. We, her family, along with her survivor sisters, continue Virginia's battle and will not rest until the same accountability applies to all of her abusers and abetters, connected to Jeffrey Epstein and Ghislaine Maxwell.\" Andrew settled a case with Ms Giuffree in 2022 outside of court for a sum reported to have been around £12m. Andrew has always denied the allegations against him. Read More:Andrew to relocate to SandringhamKing heckled over Prince Andrew and Jeffrey Epstein What have other royal family members said? It is understood the King's decision has been welcomed by the wider family, including Prince William. It also appears the UK government was consulted in the process and has deemed the move constitutionally proper and appropriate. What will happen to Sarah, Eugenie and Beatrice? Princess Eugenie and Princess Beatrice will retain their titles because they are the daughters of the son of a sovereign. Andrew's ex-wife, Sarah Ferguson, who had lost her Duchess of York title after Andrew gave up his earlier this month, will make her own living arrangements as well, it is understood. Together they shared his 30-room Windsor home. Where will he go next? It is understood Andrew will move, as soon as practicable, to an undisclosed property on the King's Sandringham estate. Sandringham House, which has been the private home of five generations of British monarchs for more than 150 years, is where the King usually spends Christmas Its vast estate includes 16,000 acres of farmland, 3,500 acres of woodland and 150 properties. According to its website, the estate has residential properties in 13 villages. Who will fund Andrew's next accommodation?  That will be privately funded by the King, who will support Andrew with private financial provisions. How will the titles be removed? Lord Chancellor, David Lammy, will play a role in the removal of Andrew's titles. Because of his role, he is responsible for maintaining the peerage roll. Mr Lammy, who is also Justice Secretary, is being sent royal warrants by the King to strike the Duke from the roll along with his Prince title and HRH style."
    },
    {
        "title": "Andrew pays the ultimate price after years of public disdain",
        "description": "Andrew always denied the allegations - but the repeated accusations would not go away.",
        "url": "https://news.sky.com/story/birthright-could-not-withstand-withering-public-disdain-andrew-finally-pays-the-price-13460995",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-duke-of-york_7056916.jpg?20251021041958",
        "type": "UK",
        "Author": "Laura Bundock",
        "Date Published": "2025-10-30 21:13:00",
        "Headline": "For years, Andrew enjoyed the perks and privileges of his powerful position, but his birthright could not withstand withering public disdain after years of scrutiny over his relationship with Jeffrey Epstein.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n  Andrew always denied the allegations - but the repeated accusations would not go away. And his associations risked real reputational damage to the royal family. His friendship with convicted paedophile Jeffrey Epstein, his dealings with an alleged Chinese spy, and then the posthumous publication of his accuser, Virginia Giuffre's memoir. Her family said she brought down a British prince with her truth and extraordinary courage. The piling pressure was starting to overshadow the work of Andrew's wider family. And with the Prince of Wales soon heading to Brazil for his Earthshot award, enough was enough. We understand the Royal Family, including Prince William backed the King's leadership on this matter. The King made the decisions, his family supported them. \n                  'Huge moment in world history' as Andrew loses titles - and will be kicked out of royal home\n                 \n                  King heckled over Prince Andrew and Jeffrey Epstein during visit\n                 \n                  No charges over images of Trump and Epstein projected onto Windsor Castle during president's visit\n                 Andrew will leave Royal Lodge, his large home on the Windsor estate. His ex-wife, Sarah Ferguson, who also lived there, will \"make her own arrangements\". It was their family home for many years. Both daughters, Princess Beatrice and Princess Eugenie, who grew up there, will keep their titles. As for Andrew, he will soon move to Sandringham - the King's private Norfolk estate - where the family traditionally gathers for Christmas; and he will be funded privately by the King. Read more:Andrew allegations should be examined in 'fullest ways' This is all a formal process carried out in consultation with official authorities, but the government supports the decision taken. This will not have been easy for the King, but he knew he could not ignore public opinion. The criticism and anger directed at Andrew was never going to stop - and only he had the power to take the ultimate action against his own brother. For years, Andrew enjoyed the perks and privileges of his powerful position, but his birthright could not withstand withering public disdain. And now he's paid the ultimate price."
    },
    {
        "title": "Andrew loses his titles - everything we know",
        "description": "Andrew has been stripped of his royal titles, Buckingham Palace has said.",
        "url": "https://news.sky.com/story/andrew-loses-his-titles-everything-we-know-13460988",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-jeffrey-epstein_7067343.jpg?20251030211138",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:04:00",
        "Headline": "A notice has been served for Andrew to surrender his lease at the Royal Lodge, Buckingham Palace has said.",
        "Content": " Andrew has been stripped of his royal titles, Buckingham Palace has said. It means the former prince will now be known as Andrew Mountbatten Windsor. A notice has also been served for Andrew to surrender his lease at the Royal Lodge. The decision from the King follows continued criticism about Andrew's former friendship with paedophile financier Jeffrey Epstein, which was recently intensified by a string of damaging leaks. Virginia Giuffre, who died in April, accused Andrew of sexually assaulting her after being introduced by Epstein. Andrew has always vehemently denied her accusations. Andrew latest: King's brother to lose 'prince' title and move out of Royal Lodge What has Buckingham Palace said? In a statement on Thursday evening, Buckingham Palace announced the King had started the formal process \"to remove the Style, Titles and Honours of Prince Andrew\". \"His lease on Royal Lodge has, to date, provided him with legal protection to continue in residence. Formal notice has now been served to surrender the lease and he will move to alternative private accommodation,\" the statement added. \"These censures are deemed necessary, notwithstanding the fact that he continues to deny the allegations against him. \"Their Majesties wish to make clear that their thoughts and utmost sympathies have been, and will remain with, the victims and survivors of any and all forms of abuse.\"  Why is this happening now? The move from the King follows fresh allegations against Andrew, after he announced he would no longer use his royal titles.  Among them was an allegation he sought to dig up information on Ms Giuffre through a Met bodyguard. It also emerged he had been paying a \"peppercorn rent\" on his property - piling pressure on him staying at Royal Lodge. Andrew has not released a statement following Thursday's announcement, but it is understood he has not objected to it. What has Virginia Giuffre's family said? The family of Andrew's accuser, who say she died by suicide, said Ms Giuffree \"brought down a British prince\". \"Today, an ordinary American girl from an ordinary American family brought down a British prince with her truth and extraordinary courage,\" they said in a statement. \"Virginia Roberts Giuffre, our sister, a child when she was sexually assaulted by Andrew, never stopped fighting for accountability for what had happened to her and countless other survivors like her. \"Today, she declares a victory. We, her family, along with her survivor sisters, continue Virginia's battle and will not rest until the same accountability applies to all of her abusers and abetters, connected to Jeffrey Epstein and Ghislaine Maxwell.\" Andrew settled a case with Ms Giuffree in 2022 outside of court for a sum reported to have been around £12m. Andrew has always denied the allegations against him. Read More:Andrew to relocate to SandringhamKing heckled over Prince Andrew and Jeffrey Epstein What have other royal family members said? It is understood the King's decision has been welcomed by the wider family, including Prince William. It also appears the UK government was consulted in the process and has deemed the move constitutionally proper and appropriate. What will happen to Sarah, Eugenie and Beatrice? Princess Eugenie and Princess Beatrice will retain their titles because they are the daughters of the son of a sovereign. Andrew's ex-wife, Sarah Ferguson, who had lost her Duchess of York title after Andrew gave up his earlier this month, will make her own living arrangements as well, it is understood. Together they shared his 30-room Windsor home. Where will he go next? It is understood Andrew will move, as soon as practicable, to an undisclosed property on the King's Sandringham estate. Sandringham House, which has been the private home of five generations of British monarchs for more than 150 years, is where the King usually spends Christmas Its vast estate includes 16,000 acres of farmland, 3,500 acres of woodland and 150 properties. According to its website, the estate has residential properties in 13 villages. Who will fund Andrew's next accommodation?  That will be privately funded by the King, who will support Andrew with private financial provisions. How will the titles be removed? Lord Chancellor, David Lammy, will play a role in the removal of Andrew's titles. Because of his role, he is responsible for maintaining the peerage roll. Mr Lammy, who is also Justice Secretary, is being sent royal warrants by the King to strike the Duke from the roll along with his Prince title and HRH style."
    },
    {
        "title": "Rachel Reeves survives permit row, but questions it raises cut deeper",
        "description": "Rachel Reeves was never going to resign over her failure to apply for a permit to rent out her house in south London.",
        "url": "https://news.sky.com/story/rachel-reeves-survives-permit-row-but-questions-it-raises-cut-deeper-13460835",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves_7067241.jpg?20251030183457",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-30 16:03:00",
        "Headline": "The chancellor's oversight may seem minor, but it highlights both her weaknesses and the political peril her departure would pose to Downing Street ahead of a make-or-break budget.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Rachel Reeves was never going to resign over her failure to apply for a permit to rent out her house in south London. She is unlikely even to face a fine from Southwark council - the mea culpa from the estate agent will have absolved her of much of the political guilt. The episode is a distraction from the far bigger challenge she faces ahead of next month's budget - and the £30-40 billion black hole. But that doesn't mean this squall should be ignored entirely - for it tells us two important things. The first is it reminds us of of one of Ms Reeves' traits that is at odds with the vibe she likes to present to the country: that she is not always as across the detail or on top of things as she would like to make out. The chancellor first said she was not advised to get a permit by a letting agent, so did not do so. Then, 24 hours later, she said that she was told by the letting agency it would take care of a permit, and did not realise it had not.  But is that quite good enough, particularly for someone who campaigned to strengthen exactly this law and who ended up deriving financial benefit for not doing so, to quite evidently not be across the detail? In the aftermath of Angela Rayner's resignation for a failure to comply with property law, might it not have been worthwhile for one to double-check the paperwork of one's second home? Then there have been other incidents in Ms Reeves' life outside of being chancellor that jar with the image of a super-efficient stateswoman. Ahead of the election, Ms Reeves was forced to hold her hands up and acknowledge making mistakes in her new book about female economists after she faced allegations of plagiarism. She admitted that some sentences in her book, The Women Who Made Modern Economics, were \"not properly referenced in the bibliography\". She also had to update her LinkedIn after it emerged she was not an \"economist\" when she worked in financial services at a bank. For a chancellor who faces making momentous decisions that will affect everybody in this country, lack of attention to detail is not a characteristic she would want extensively dwelt on. The bigger story this tells about her will sting. The second thing it tells us is just how central she is to the Starmer project. Number 10 moved to protect her within hours - publishing an exchange of letters late into Wednesday night that relied just on the account of Ms Reeves and apparently without corroborating evidence. The government machine went out of its way in the fastest possible timeframe to try and shut the matter down - a courtesy not extended to Angela Rayner or Louise Haigh. This is because Sir Keir knows a Reeves departure risks exposing himself - weeks before a budget that could determine this prime minister's fate. Read more from Sky News:Investigation into Reeves not needed, Starmer saysSky News gets rare access inside Reform UK meeting It also risks an adverse reaction in the bond markets, which fear higher-borrowing alternative candidates in the Treasury. Neither outcome is one this government feels like it could cope with at the moment. Rachel Reeves is quite simply the most important figure in Sir Keir Starmer's administration, and this is why she is protected at almost any reasonable cost. While this is true now, it may not always be this way, however. Will Sir Keir feel the same after 26 November when he has to defend the tax-raising budget?"
    },
    {
        "title": "Teenager filmed inches from being hit by train as they 'risk everything' for 'game'",
        "description": "A teenager has been filmed \"risking everything\" for a \"game\" after coming within inches of being hit by an oncoming train.",
        "url": "https://news.sky.com/story/teenager-risks-everything-as-they-were-inches-from-being-hit-by-oncoming-train-13460922",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-norfolk-greater-anglia_7067257.jpg?20251030185244",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-30 18:20:00",
        "Headline": "The teenager flouted warning signs and a red light. They then moved clear only at the last second as the high-speed Greater Anglia train, which can travel up to 100mph, zoomed past.",
        "Content": " A teenager has been filmed \"risking everything\" for a \"game\" after coming within inches of being hit by an oncoming train. CCTV footage of the person stepping close to the track north of Diss station, Norfolk, has been released by Network Rail as it warned of the dangers of such \"reckless\" actions. It said the teenager flouted warning signs and a red light. The person then moved clear only at the last second as the high-speed Greater Anglia train, which can travel up to 100mph, zoomed past. Network Rail said there have been eight accidental deaths at level crossings in the UK in the past 12 months, including one on the Anglia region. There have also been 51 near-misses on Anglia level crossings. 'Dangerous behaviour we see all too often' The company's health and safety manager, Shenel Bullock, said: \"The young person in the CCTV video came to no harm thankfully, and we wanted to share the footage to highlight just one example of the incredibly dangerous behaviour that we see all too often on level crossings. \"Whether it's taking selfies, filming dances or playing games, the risk of death or life-changing injury is simply too high. \"Please don't take the chance, even if it seems like you're in control, because one tiny misjudgement or slip could easily lead to tragic consequences.\" Read more from Sky News:Andrew to relocate to SandringhamMan dies after helicopter crash near Doncaster Ms Bullock added: \"Other times, people can simply be distracted when approaching a level crossing, looking at their screen or wearing headphones, but this equally could be a fatal mistake. \"I urge everyone to pay full attention as they approach crossings, read instructions carefully and always respect locked gates, barriers, lights and alarms.\""
    },
    {
        "title": "UK charters flights to help transport British nationals out of Jamaica following Hurricane Melissa",
        "description": "The UK has chartered flights to help transport British nationals out of Jamaica after Hurricane Melissa ripped through the Caribbean.",
        "url": "https://news.sky.com/story/uk-charters-flights-to-help-transport-british-nationals-out-of-jamaica-following-hurricane-melissa-13460646",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jamaica-santa-cruz_7065973.jpg?20251030130416",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-30 11:53:00",
        "Headline": "Up to 8,000 holidaying British citizens are in Jamaica as it reels from one of the strongest Atlantic hurricanes in history, with speeds of 185mph.",
        "Content": " The UK has chartered flights to help transport British nationals out of Jamaica after Hurricane Melissa ripped through the Caribbean. Up to 8,000 holidaying British citizens are in Jamaica as it reels from one of the strongest Atlantic hurricanes in history, with speeds of 185mph. People have been ordered to stay indoors after Hurricane Melissa swept over the Caribbean island, which is also home to 50,000 dual nationals, with tourists locked down in hotels. The Foreign, Commonwealth and Development Office (FCDO) said in a statement that it was chartering the flights to help bolster commercial capacity. It said the chartered flights were for those \"who are unable to fly home commercially\", but that it was also working closely with travel companies to restore flights for holidaymakers and British nationals. \"All British nationals who have already registered via the Register Your Presence portal will automatically be contacted and provided with a link to the booking portal once airports are open,\" an FCDO spokesperson said. \"If you are a British national in Jamaica wanting to leave on a flight and have not already registered your presence, you should do so immediately.\" Read more: What we know about Hurricane Melissa  The FCDO urged travellers to contact their airline or travel provider first to see if commercial options are available, and if they have already booked a flight back to the UK, to confirm if it is still operating. \"We will prioritise those who are most vulnerable, for example, those with medical needs and children, in allocating seats on the flight. The cost of a seat will be based on standard commercial rates,\" the government said. Eligible are British nationals and their immediate family members, which include partners or spouses and children under 18, as well as Windrush generations with indefinite leave to remain in the UK. All passengers must hold a valid travel document.  The FCDO said it would contact those who are allocated a seat on the flights directly, and urged British nationals not to make their way to the airport unless they are contacted. Foreign Secretary Yvette Cooper said: \"The strong links between the UK and Jamaica mean many British nationals were there during the devastation of the hurricane, and we need to ensure they can get safely home, as we know how worrying and difficult the last few days will have been. \"The UK government is chartering flights to bolster commercial capacity and ensure people who wish to return to the UK can do so as soon as possible.\" Read more:Dozens dead as 'unprecedented' storm hits CaribbeanDo we need new 'category 6' for most extreme storms? It comes after the government announced it was making £2.5m available in emergency humanitarian funding to assist recovery efforts from the devastation Hurricane Melissa caused in the Caribbean. At least 34 people have been killed in the hurricane. Eight of the deaths so far have come in Jamaica, one in the Dominican Republic, and 25 in Haiti."
    },
    {
        "title": "Rachel Reeves to face no further action over 'inadvertent' rental licence 'failure', says Keir Starmer",
        "description": "Sir Keir Starmer has said Rachel Reeves will face no further action over her \"inadvertent failure\" to obtain a rental licence for her south London home. ",
        "url": "https://news.sky.com/story/rachel-reeves-to-face-no-further-action-over-inadvertent-rental-licence-failure-says-keir-starmer-13460984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves_7067340.jpg?20251030210645",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:00:00",
        "Headline": "The PM's letter came after the letting agency Rachel Reeves used to rent out her home apologised.",
        "Content": " Sir Keir Starmer has said Rachel Reeves will face no further action over her \"inadvertent failure\" to obtain a rental licence for her south London home.  It follows a turbulent 24 hours for the chancellor, in which she was accused of breaking the law and the Conservatives called for her to resign or be sacked. In a letter published on Thursday night, the prime minister said correspondence shared by the chancellor \"shows that the oversight regarding the licence occurred after your husband had been told by the estate agents that they would apply for a licence on his behalf\". However, the application \"did not occur\". Politics latest: Key emails published in rent breach row Sir Keir continued: \"It is clearly regrettable that the information in this correspondence was not shared with me when you wrote to me last night, but I fully accept that you were not aware, at that stage, of these emails. \"I understand that the relevant emails were only unearthed by your husband this morning, and that you have updated me as soon as possible.\" \n                  Rachel Reeves survives permit row, but questions it raises cut deeper\n                 \n                  Badenoch says hacking into Harriet Harman's website 17 years ago 'not the same' as Reeves breaking law\n                 \n                  Farage v Mahmood: Who is the Terminator?\n                 The PM then labelled the incident \"an inadvertent failure\" and said he sees \"no need\" for further action. The government has also published a letter from Sir Laurie Magnus, an independent adviser on ministerial standards, to Sir Keir. He wrote: \"It is regrettable that information provided on successive days has generated confusion, but I find no evidence of bad faith.\" The letters came after Ms Reeves had received an apology from a lettings agency after the company confirmed it offered to apply for a rental licence and then failed to do so. On Wednesday evening, the Daily Mail reported Ms Reeves had failed to pay for a \"selective\" licence when renting out her family home in Dulwich, south London, which she has left while living in Downing Street as chancellor. In an exchange of letters a matter of hours later, Sir Keir Starmer gave the chancellor his backing and said further investigation into the issue was \"not necessary\" after consulting his independent ethics adviser Sir Laurie Magnus. Ms Reeves immediately faced calls to leave her post, having admitted to mistakenly breaching local council housing rules by failing to secure the licence. The Housing Act 2004 gives councils the power to make landlords accredit themselves in certain areas. However, late on Thursday afternoon, the owner of lettings agency Harvey and Wheeler released an apology to the chancellor. In it, boss Gareth Martin confirmed a member of his staff said they would apply for the licence for the Reeves family - but this was never done, as the person \"suddenly resigned\" prior to the start of the tenancy. Mr Martin said: \"We alert all our clients to the need for a licence. In an effort to be helpful our previous property manager offered to apply for a licence on these clients' behalf, as shown in the correspondence. That property manager suddenly resigned on the Friday before the tenancy began on the following Monday. \"Unfortunately, the lack of application was not picked up by us as we do not normally apply for licences on behalf of our clients; the onus is on them to apply. We have apologised to the owners for this oversight. \"At the time the tenancy began, all the relevant certificates were in place and if the licence had been applied for, we have no doubt it would have been granted. \"Our clients would have been under the impression that a licence had been applied for. Although it is not our responsibility to apply, we did offer to help with this. \"We deeply regret the issue caused to our clients as they would have been under the impression that a licence had been applied for.\" Read more:Badenoch hacking 'not the same' as Reeves 'law break'Sam Coates: Rental row raises questions that cut deeper Under the Housing Act 2004, introduced by Labour, councils can decide to introduce selective licensing, where residential landlords in specified areas must have a licence.\n Landlords must adhere to certain requirements to obtain a licence, including gas certificates, working carbon monoxide alarms and fire safety regulations for furnishings. They must secure a licence within 28 days of renting out a home.\n Southwark Council, where Rachel Reeves' house is, charges £900 for a licence, which lasts five years. Failure to secure a selective licence can result in a penalty of up to £30,000 or an unlimited fine from a court upon conviction. Landlords can also be made to repay up to 12 months' rent to the tenant or they can be prevented from renting out the property.\n Serious and repeat offenders can be prosecuted, with a sentence of up to five years or an uncapped fine, and they can be put on a rogue landlords database.\n The government has published emails between her husband Nicholas Joicey and the agency showing that Harvey and Wheeler had agreed to apply for the licence, while Ms Reeves told the prime minister in a letter she took \"full responsibility\" for the matter. The final email in the series, sent on 13 August 2024 by the letting agent, said: \"I will do the selective licence once the new tenant moves in.\" In the letter from Ms Reeves to Sir Keir, the chancellor said: \"Yesterday I wrote to you and said that we were not aware that a licence was necessary to let out our property, based on conversations my husband had with the agency yesterday. \"Today the letting agency and my husband have found correspondence confirming that on 17 July 2024 the letting agent said to my husband that a selective licence would be required and agreed that the agency would apply for the licence on our behalf. \"They have also confirmed today they did not take the application forward, in part due to a member of staff leaving the organisation. Nevertheless, as I said yesterday, I accept it was our responsibility to secure the licence. \"I also take responsibility for not finding this information yesterday and bringing it to your attention. \"As I said to you today, I am sorry about this matter and accept full responsibility for it.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 The Conservatives are calling for further investigations from Downing Street into what happened and the timeline of events. However, it appears that Number 10 considers the matter closed as it has consistently stood behind the chancellor - and says she will deliver next month's budget."
    },
    {
        "title": "Damning report eviscerates UK's 'complacent' fast jets programme",
        "description": "Repeated delays to the UK's multibillion-pound F-35 fast jet programme, because of a lack of cash, has increased costs and harmed the plane's ability to fight, a report by MPs has said.",
        "url": "https://news.sky.com/story/damning-report-eviscerates-uks-complacent-fast-jets-programme-13461038",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-royal-navy-raf-aircraft_7067431.jpg?20251030223729",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-10-30 22:08:00",
        "Headline": "The UK only has 37 out of a planned 138 F-35 jets in service - almost four decades since the programme, led by the US, was conceived.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Repeated delays to the UK's multibillion-pound F-35 fast jet programme, because of a lack of cash, has increased costs and harmed the plane's ability to fight, a report by MPs has said. Exacerbating the problem, an \"unacceptable\" shortage of pilots and engineers is limiting how often the aircraft can fly, the Public Accounts Committee revealed. It also raised questions about a major announcement by Sir Keir Starmer in June that the UK would purchase a variant of the aircraft that is able to carry American nuclear weapons, saying there did not appear to be a timeframe for when this capability would be operational nor an estimate of the additional price tag. The strong criticism will likely make uncomfortable reading for Air Chief Marshal Sir Richard Knighton, Britain's new military chief. He was previously the head of the Royal Air Force and before that the top military officer at the Ministry of Defence (MoD) in charge of capability. The UK only has 37 out of a planned 138 F-35 jets in service - almost four decades since the programme, led by the US, was conceived and nearly a quarter of a century since Britain initially started paying tens of billions of pounds for it. The aircraft are among the most advanced, stealthy and lethal jets on the planet, provided they have the right technology, weapons and - crucially - software updates. A persistent squeeze on UK defence budgets, though, means military chiefs developed a bad habit of slowing down the F-35 procurement and scrimping on orders to save money in the short term - only for taxpayers to be hit with a much larger bill overall and for the RAF and the navy's Fleet Air Arm to be left with jets that are unable to meet their full potential. The Public Accounts Committee laid bare the impact of this behaviour, highlighting five key issues: One: A short-term cost-saving decision by the MoD in 2021 to save £82m by delaying an investment in what is known as an Air Signature Assessment Facility - which is vital for the F-35's stealth capabilities to fly undetected - will add an extra £16m when it is finally built in 2032. More worryingly, this limits the UK's ability to deploy the jets. Two: A cost-saving move to delay by six years building infrastructure for the naval squadron that operates the F-35 jets means the cost for that construction will almost treble to £154m from £56m. Three: A failure by the MoD to accurately update the total acquisition cost of the F-35s. The department only this year said the whole-life cost until 2069 to acquire a total of 138 aircraft will be almost £57bn - up from £18.4bn for the first 48 jets out until 2048. But even the new higher price tag was dismissed by the MPs as \"unrealistic\" - because it does not include additional costs such as fuel. Four: The current fleet of F-35B jets will not be armed with conventional missiles to hit targets on the land from a safe distance until the early 2030s. This is a critical capability in modern warfare when operating against a country like Russia that has sophisticated air defence weapons that can blast jets in range out of the sky. Five: The military will claim its F-35B jump jets have met \"full operating capability\" by the end of the year - a timeline that is already years late - even though they do not have the long-range missiles and are blighted by other woes. A 'leaky roof' mistake Sir Geoffrey Clifton-Brown MP, the committee chair, said: \"Making short-term cost decisions is famously inadvisable if you're a homeowner with a leaky roof, let alone if one is running a complex fighter jet programme - and yet such decisions have been rife in the management of the F-35.\" The UK's existing F-35Bs are designed to fly off the Royal Navy's two aircraft carriers. The nuclear weapons-capable A-variant only operate off the land. The MoD has said it will purchase an additional 15 F-35Bs and 12 of the As at an anticipated cost of £3.2bn. However, there is no estimate yet of the cost to certify the F-35As to join a NATO mission, carrying American nuclear warheads. Read more:Can UK's new air defence missile systems protect us? The MPs said they were told work on becoming certified to operate with US nuclear weapons \"is at an early stage and the department did not provide any indication of forecast costs\". 'Very complacent' The report flagged concerns about personnel shortages and how that impacted the availability of the few F-35s the UK does operate. This included the need for an extra 168 engineers - a 20% increase in the current workforce and a shortfall that \"will take several years to resolve\", the MPs said. Making the recruitment and retention dilemma even worse is \"substandard\" accommodation at RAF Marham, which has been the home for the F-35 force since 2013. This has again been caused by budget shortfalls, meaning insufficient funds to invest in infrastructure. The MoD said some upgrades would be completed by 2034. The Public Account Committee said this \"is very complacent and should be given greater priority\". An MoD spokesperson said: \"Many of the decisions referenced in the report were taken under the previous government, and we have set out plans to tackle historic issues with procurement, infrastructure, recruitment, and skills through the Strategic Defence Review.\""
    },
    {
        "title": "Zarah Sultana takes over company holding £800,000 in Your Party donations after major row",
        "description": "Zarah Sultana now has sole control of over &#163;800,000 of Your Party donations following a fresh internal fallout.",
        "url": "https://news.sky.com/story/zarah-sultana-takes-over-company-holding-163800000-in-your-party-donations-after-major-row-13460569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-zarah-sultana_7047989.jpg?20251010182657",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-10-30 09:55:00",
        "Headline": "Your Party has been trying to put on a united front ahead of its founding conference next month - but there has been a major row behind the scenes over control of donations and data, Sky News has learned.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Zarah Sultana now has sole control of over £800,000 of Your Party donations following a fresh internal fallout. Sky News understands she has assured co-leader Jeremy Corbyn the money will be transferred to the party as a whole. Politics latest: Rachel Reeves has to go after breaking law, rival tells Sky News However that is yet to happen, frustrating some Your Party figures who have been trying to access the funds for weeks, in a situation one source described as \"an insane mess\". There has been a major row behind the scenes with the previous custodians of the donations - former Labour MP Beth Winter, former Labour mayor Jamie Driscoll and former South African politician Andrew Feinstein. The trio were the directors of a company called MoU Operations, which was set up in April to support an independent alliance of MPs centred around former Labour leader Mr Corbyn. When Your Party was launched in July, its privacy policy stated that donations would be collected by MoU until the new movement was formally constituted and had its own bank account. \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 \n                  Corbyn and Sultana have 'patched things up' - but what really happened?\n                 \n                  Corbyn and Sultana friends again 'like the Gallagher brothers' as next steps for Your Party set out\n                 Your Party was registered with the electoral commission on 30 September, when it declared assets of £850,000, but no transfer of funds was made despite repeated requests from senior figures to MoU, seen by Sky News. The row reached boiling point this week as Your Party sources said they were considering legal action. Sky News understands lawyers had drafted a 'letter before action' to send to MoU, putting them on notice of court proceedings, before the three directors broke their silence and quit on Wednesday night. In a lengthy statement, the trio said the role of holding donations was \"thrust upon\" them and the company had been \"repeatedly been used without our agreement\". They said a transfer of funds had been further complicated by Ms Sultana's unauthorised membership launch last month, which left MoU vulnerable to liabilities. 'Totally undemocratic' The group said that since the end of September, they have been asking Your Party to take complete ownership and control of MoU, but this was refused. Ms Sultana taking the reins was aimed at breaking the impasse. However one Your Party source told Sky News it is \"only a resolution if Zarah transfers the money to the Your Party bank account\". Another Your Party source pointed to a statement she made on social media on Wednesday night, in which she said the MoU resources \"will now be used for Your Party as was always intended\". The source said: \"Zarah created this utter mess then poses as coming to the rescue, but she didn't actually say she would transfer it in her statement. \"Imagine if this was the Labour Party and one MP had control of the funds. It's totally undemocratic.\" A source close to Ms Sultana said that legal formalities are being concluded and the cash will \"100%\" be moved over as soon as practically possible, stressing there is no deliberate delay. Sky News understands she was willing to take on risks associated with MoU to get the issue resolved before the founding conference next month. The row, which also relates to data, is deeply damaging for a party that had promised to revive the British left but has so far been marred by chaos and division. Ms Sultana announced the new party in early July in a move that appeared to catch Mr Corbyn off guard - with the official launch coming weeks later.  Botched membership launch comes back to haunt Your Party  On 18 September, she sent an email to supporters asking them to become a paid member for £5 a month or £55 a year, which Mr Corbyn said was unauthorised. The website had a different domain name to Your Party's website, though it looked similar, and said it was being managed by MoU, which received the membership fees. However neither MoU nor Ms Sultana was the owner of the data of those who received the email, which was being managed by Mr Corbyn's Peace and Justice Project. The matter was referred to the Information Commissioner's Office, and an investigation is still ongoing. The money collected by MoU in membership fees is not expected to be transferred to Your Party as those people who paid are entitled to a refund - a process Ms Sultana will now have to manage. Read more:Corbyn and Sultana friends again 'like Gallagher brothers' Some 20,000 people signed up to Ms Sultana's portal but Your Party still does not have access to their emails, meaning there is no way of contacting them. 'Lack of governance at top of Your Party' Your Party had been requesting the transfer of this too, but MoU's outgoing directors suggested this would breach GDPR regulations. In their statement, they said they had no involvement in the \"confused membership launch\" and they could not \"accept personal liability for actions that were taken without our knowledge or approval\". \"Nor could we agree to a proposed 'resolution' that put MOU at risk of having liabilities exceeding its assets,\" they added. The group also claimed they raised concerns about the \"lack of appropriate governance\" of Your Party ever since its launch and \"tried many times to hand over everything to Your Party, lock, stock and barrel\". They said they wanted to find a resolution behind the scenes but have repeatedly been subject to \"hostile briefings\". \"In simple terms, we offered to hand over ownership to Your Party, and make the six Your Party MPs directors in our place, giving them full control. Only one of the six was willing to agree,\" the statement said. \"We will have no further involvement with MOU. We want nothing for ourselves. We have taken no money or benefit in kind.\" Your Party has not released a statement of its own. But Ms Sultana paid tribute to her predecessors on X, saying they have been \"patient, constructive and consistently sought to resolve matters diplomatically\". She said: \"Thank you for your patience - this brings the chapter to a close and these resources will now be used for Your Party, as was always intended.\""
    },
    {
        "title": "Before and after images of Jamaica show destruction left by Hurricane Melissa",
        "description": "The scale of the destruction left by Hurricane Melissa as it tore across Jamaica is now being revealed by the first photos taken by satellites.",
        "url": "https://news.sky.com/story/before-and-after-images-of-jamaica-show-destruction-left-by-hurricane-melissa-13460662",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jamaica-black-river_7066649.jpg?20251030081417",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-30 12:18:00",
        "Headline": "Satellite images show the impact the 185mph winds had on Jamaica after Hurricane Melissa made landfall on the island earlier this week.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The scale of the destruction left by Hurricane Melissa as it tore across Jamaica is now being revealed by the first photos taken by satellites. The eye of the storm made landfall on the southwest coast of the island, 75 miles from the capital Kingston, on Tuesday. Before and after images from Vantor's satellites show the impact of the 185mph winds on the town of Black River, the capital of St Elizabeth Parish. Use the sliders below to see the same areas of Jamaica before and after the hurricane struck. There is widespread damage. Some houses and businesses are without roofs, and others have been destroyed altogether. The covered food market is in ruins. So is St John Anglican church, one of the oldest in Jamaica - only its bell tower still stands.  Houses that lined the shore would have born the brunt of the storm surge. Further along the coast is the fishing village of White House. Streets have been reduced to piles of rubble. Trees have been stripped of their leaves by the wind. The west of Jamaica is the country's bread basket, important for growing food. But fields are underwater, flooded by up to a metre of rain that fell as the vast storm system passed over. Many crops will have been destroyed and the government has appealed for vegetable seeds so farmers can quickly plant crops again. Read more:What we know about Hurricane MelissaUK charters flights to transport Britons out of Jamaica On the northwest coast is the resort of Montego Bay. The container terminal and oil storage tanks in the port have been inundated by the storm surge and are surrounded by water. It's estimated that 400,000 people in Jamaica have been affected by the hurricane. And the cost of the devastation is immense. Estimates by hazard analysts Enki Research put the bill at £5.8bn. That's more than a third of Jamaica's GDP - a measure of its economic wealth. It will take months and international support to put Jamaica back on its feet."
    },
    {
        "title": "UK charters flights to help transport British nationals out of Jamaica following Hurricane Melissa",
        "description": "The UK has chartered flights to help transport British nationals out of Jamaica after Hurricane Melissa ripped through the Caribbean.",
        "url": "https://news.sky.com/story/uk-charters-flights-to-help-transport-british-nationals-out-of-jamaica-following-hurricane-melissa-13460646",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jamaica-santa-cruz_7065973.jpg?20251030130416",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 11:53:00",
        "Headline": "Up to 8,000 holidaying British citizens are in Jamaica as it reels from one of the strongest Atlantic hurricanes in history, with speeds of 185mph.",
        "Content": " The UK has chartered flights to help transport British nationals out of Jamaica after Hurricane Melissa ripped through the Caribbean. Up to 8,000 holidaying British citizens are in Jamaica as it reels from one of the strongest Atlantic hurricanes in history, with speeds of 185mph. People have been ordered to stay indoors after Hurricane Melissa swept over the Caribbean island, which is also home to 50,000 dual nationals, with tourists locked down in hotels. The Foreign, Commonwealth and Development Office (FCDO) said in a statement that it was chartering the flights to help bolster commercial capacity. It said the chartered flights were for those \"who are unable to fly home commercially\", but that it was also working closely with travel companies to restore flights for holidaymakers and British nationals. \"All British nationals who have already registered via the Register Your Presence portal will automatically be contacted and provided with a link to the booking portal once airports are open,\" an FCDO spokesperson said. \"If you are a British national in Jamaica wanting to leave on a flight and have not already registered your presence, you should do so immediately.\" Read more: What we know about Hurricane Melissa  The FCDO urged travellers to contact their airline or travel provider first to see if commercial options are available, and if they have already booked a flight back to the UK, to confirm if it is still operating. \"We will prioritise those who are most vulnerable, for example, those with medical needs and children, in allocating seats on the flight. The cost of a seat will be based on standard commercial rates,\" the government said. Eligible are British nationals and their immediate family members, which include partners or spouses and children under 18, as well as Windrush generations with indefinite leave to remain in the UK. All passengers must hold a valid travel document.  The FCDO said it would contact those who are allocated a seat on the flights directly, and urged British nationals not to make their way to the airport unless they are contacted. Foreign Secretary Yvette Cooper said: \"The strong links between the UK and Jamaica mean many British nationals were there during the devastation of the hurricane, and we need to ensure they can get safely home, as we know how worrying and difficult the last few days will have been. \"The UK government is chartering flights to bolster commercial capacity and ensure people who wish to return to the UK can do so as soon as possible.\" Read more:Dozens dead as 'unprecedented' storm hits CaribbeanDo we need new 'category 6' for most extreme storms? It comes after the government announced it was making £2.5m available in emergency humanitarian funding to assist recovery efforts from the devastation Hurricane Melissa caused in the Caribbean. At least 34 people have been killed in the hurricane. Eight of the deaths so far have come in Jamaica, one in the Dominican Republic, and 25 in Haiti."
    },
    {
        "title": "Climate change made Hurricane Melissa four times more likely, say scientists",
        "description": "Hurricane Melissa was made four times more likely by climate change, according to a study.",
        "url": "https://news.sky.com/story/climate-change-made-hurricane-melissa-four-times-more-likely-say-scientists-13460549",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hurricane-melissa-jamaica_7066606.jpg?20251030073011",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 09:05:00",
        "Headline": "It was one of the most powerful hurricanes ever recorded - and climate change increased it's intensity, analysis suggests.",
        "Content": " Hurricane Melissa was made four times more likely by climate change, according to a study. The category 5 hurricane that struck Jamaica on Tuesday, tore through the Caribbean with winds of up to 185mph and also hit Haiti, the Dominican Republic and Cuba, leaving dozens dead and widespread destruction. In Jamaica, AccuWeather estimated Melissa could cost $22bn in damages and economic loss and that rebuilding could take a decade or more. Researchers at Imperial College London estimated that in a world without climate change, a weaker hurricane would have been about 12% less damaging. They said human-caused global warming not only increased the intensity but also the likelihood of the powerful hurricane. They also found that climate change - caused primarily by the burning of oil, gas and coal - boosted Hurricane Melissa's wind speed by 7% (11mph).  In a cooler world without climate change, a Melissa-type hurricane would have made landfall in Jamaica once every 8,000 years, they said. But in today's climate, with 1.3C warming, it has become four times more likely with such an event now expected once every 1,700 years.  Jamaica now faces an enormous relief effort to help the roughly 400,000 people reportedly affected, in a country where 70% of its population live within 3.1 miles of the sea, the researchers said. Professor Ralf Toumi, director of the Grantham Institute at Imperial College London, said: \"Man-made climate change clearly made Hurricane Melissa stronger and more destructive. \"These storms will become even more devastating in the future if we continue overheating the planet by burning fossil fuels.\" Read more:Hurricane Melissa: Before and after images of JamaicaWhat we know about Hurricane MelissaUK charters flights to help transport Britons out of Jamaica   Co-author Dr Emily Theokritoff said: \"As we approach COP30, this is a stark reminder of both the economic logic of reducing emissions now and the moral imperative to rapidly scale up international finance for loss and damage and adaptation in the most vulnerable countries.\""
    },
    {
        "title": "Defiance in the West Bank - despite encroaching threat from 'unwanted neighbours'",
        "description": "For generations, Keith Asad's family has owned olive trees in the land near the West Bank town of Turmosayya, but now they are out of his reach.",
        "url": "https://news.sky.com/story/defiance-in-the-west-bank-despite-encroaching-threat-from-unwanted-neighbours-13461004",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-west-bank-israel_7067386.jpg?20251030215249",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-30 21:29:00",
        "Headline": "For people living in the occupied West Bank, it feels like even basic tasks, like visiting an olive grove, can be risky - and Sky's crew was threatened with arrest as they drove around.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  For generations, Keith Asad's family has owned olive trees in the land near the West Bank town of Turmosayya, but now they are out of his reach. The trees are still there. He can see them, clearly, from the backyard of his house, tantalisingly close. But he can't go there. He's too frightened, and with good reason. Even though he lives in a town where crime is almost unknown, Keith has just installed a wall made of rigid metal spikes, and he's considering adding barbed wire to the top of them. He worries about the safety of his wife and children, but why? Through the gaps between the spikes, we can see a group of vehicles and tents that have been set up in the valley beyond Keith's house. He calls them his \"unwanted neighbours\". The rest of the world calls them settlers. \"We have some trees over there,\" he says, pointing at his land. \"This is the first year that we're not even thinking about going over there.\"  'Oh, we'll be shot… guaranteed' \"What would happen if you went?\" I ask, and the answer is immediate. \"Oh, we'll be shot. That's guaranteed. One hundred percent.\" This group arrived a few months ago, with just a couple of tents, a couple of cars and an air of menace. Road blocks appeared, stopping the locals from reaching their ancestral land. Buildings were vandalised and weapons were brandished. And Keith says the Israeli police and military have done nothing to help. He shows me the damage to a door left behind after Israeli soldiers came to the house in the early hours of one morning, searching it from top to bottom and refusing to explain why. He feels besieged, and he knows it will get worse. Because more and more of these outposts are being set up in the West Bank, by Israelis who believe they have a historic, or biblical, right to the land. They are illegal, under both Israeli and international law. But it is almost unknown for Israeli authorities to do anything to stop them and there is a crop of Israeli politicians, including some in the cabinet, who are passionate about encouraging as many new outposts as possible. Because over time, they grow, attracting more people. Military to civilian occupation Roads and houses are built, Palestinians are intimidated into leaving and eventually those little outposts morph into permanent settlements, signed off and approved by the Israeli government. And gradually, the Israeli occupation of the West Bank becomes slightly less military and slightly more civilian. For the Palestinians we spoke to, it feels like an invasion, fuelled by a sense that the settlers act and attack with impunity. Between 2005 and 2024, only around 3% of police investigations into settler violence ended in conviction. And, of course, many attacks are never investigated. 'Very, very nervous' In the olive groves outside Turmosayya, Yasser Alqam is driving me along a rough track, looking warily from side to side. \"I feel very, very nervous,\" he says. \"I'm looking to my sides, on top of these hills, because, without any warning, stones can come down on your car. \"And it's going to take you a while before you figure out which way they're coming from.\" Yasser was here earlier in the month when he saw a horrendous attack, in which a settler, armed with a club dotted with nails, beat people - including a 53-year-old Palestinian woman called Afaf Abu Alia. Video of her being attacked, and then, covered in blood, helped to a car to be taken to hospital, was put on social media and attracted widespread condemnation. So far, despite the video evidence, nobody has been arrested. Sky News confronted by Israeli troops Yasser takes us to the site of the attack. As we film, an Israeli military vehicle comes along a track and stops in a cloud of dust. The soldiers emerge and tell us we have to leave for our own protection, claiming that this olive grove is, in fact, a closed military zone. Read more from Sky News:Andrew to relocate to SandringhamMan killed in helicopter crash I ask who they are protecting us from, but there is no answer. I'm shown a WhatsApp image of a rudimentary rectangle on a map, and informed that this is a military order. We're then told we can't leave, and that the police are on the way to arrest us. We discuss the law. And then, as suddenly as it started, it's over - we're free to go. It's just another flare-up on the West Bank. In a statement, the Israel Defense Forces (IDF) told us its mission was to thwart terrorism, and it said it strongly condemned violence of any kind. It said it would conduct a review of the attacks we have reported on here. But the echoes of violence reverberate here. We go to visit Afaf, the woman who was so grievously attacked. Her body is badly battered, and she has two blood clots on her brain, but she has been discharged from hospital and is sitting on a sofa, her family around her, frail but sure. The song of defiance \"They beat me on my head, behind my ears, along my legs, my back, and my neck all over my body, everywhere,\" she tells me. \"I was terrified. The first thing that came to my mind was my son - he's getting married soon. All I could think was that I might never get the chance to celebrate. \"It's our land. We stand our ground, and we are here to stay. We're not going anywhere. I won't give it up to setters. They can beat us all they want, they won't break us.\" It is a refrain you hear repeatedly on the West Bank - the song of defiance. The olive farmers still come out, tending to their trees, aware that settlers, with their guns and their own belief that this land is rightly theirs, are lurking. These valleys and fields are, at once, so tranquil, but also so very ominous and menacing."
    },
    {
        "title": "Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans",
        "description": "The US is drastically cutting the number of refugees it will allow into the country to 7,500, and giving priority to white South Africans.",
        "url": "https://news.sky.com/story/donald-trump-announces-dramatic-drop-in-us-refugee-intake-with-most-of-them-white-south-africans-13460936",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-president-donald-trump_7067306.jpg?20251030200838",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:40:00",
        "Headline": "The new figure is a dramatic reduction from last year's 125,000, set by former president Joe Biden and half the 15,000 total for 2021, reportedly the previous lowest.",
        "Content": "The US is drastically cutting the number of refugees it will allow into the country to 7,500, and giving priority to white South Africans. The new figure, announced on Thursday in a memo in the Federal Registry, the official journal of the US administration, is a dramatic reduction from last year's 125,000, set by former president Joe Biden. No reason was given for the decrease, but the note said the admission of the 7,500 refugees during the 2026 fiscal year was \"justified by humanitarian concerns or is otherwise in the national interest\".   The notice posted to the register's website said the 7,500 admissions would \"primarily\" be allocated to Afrikaner South Africans and \"other victims of illegal or unjust discrimination in their respective homelands\". It is half the 15,000 total set for 2021 during Donald Trump's first term in office at the height of the COVID pandemic, which reports said was the previous lowest refugee admissions cap. Refugee rights groups were quick to condemn the proposal, with International Refugee Assistance Project (IRAP) president Sharif Aly, saying that by \"privileging Afrikaners while continuing to ban thousands of refugees who have already been vetted and approved, the administration is once again politicising a humanitarian programme\". Krish O'Mara Vignarajah, CEO of Global Refuge, said: \"Concentrating the vast majority of admissions on one group undermines the programme's purpose as well as its credibility.\" \n                  Trump's upbeat opinion of his meeting with Xi brushes over thornier issues\n                 \n                  Donald Trump says tariffs will be cut after 'amazing' meeting with Xi Jinping\n                 \n                  Trump-Xi meeting as it happened: US president teases 'large' energy deal after rating talks '12 out of 10'\n                 Human Rights First president, Uzra Zeya, called it a \"new low point\" in US foreign policy, which will \"further destabilise front-line states that host over two-thirds of the world's nearly 43 million refugees, undermining US national security in tandem\". In May, Mr Trump confronted South Africa's President Cyril Ramaphosa in the White House, claiming white farmers in his nation were being killed and \"persecuted\". A video purporting to show burial sites for murdered white farmers was played but was later shown to be scenes from a 2020 protest in which the crosses represented farmers killed over multiple years. The South African government has vehemently denied that Afrikaners and other white South Africans are being persecuted. Read more from Sky News:Tariffs change after 'amazing' Xi talksIs Trump preparing for war with Venezuela?US kills 14 in 'drug boat' attacks In January, the US president suspended the US Refugee Admissions Programme (USRAP) to, in his words, allow US authorities to prioritise national security and public safety. During the Oval Office meeting, Mr Ramaphosa said only that he hoped that Trump officials would listen to South Africans about the issue, and later said he believed there is \"doubt and disbelief about all this in [Mr Trump's] head\"."
    },
    {
        "title": "Five new arrests in Louvre heist investigation - with one suspect 'traced via DNA'",
        "description": "Five new arrests have been made in the investigation into the Louvre jewellery heist, the prosecutor for Paris has said.",
        "url": "https://news.sky.com/story/five-new-arrests-in-louvre-heist-investigation-report-13460529",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-paris-france-robbery_7058172.jpg?20251022104355",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 07:27:00",
        "Headline": "There have now been a total of seven arrests over the daring heist at the world-famous Paris museum on 19 October. ",
        "Content": "Five new arrests have been made in the investigation into the Louvre jewellery heist, the prosecutor for Paris has said. French radio station RTL reported the arrests on Thursday, following an interview with Laure Beccuau. The Paris prosecutor's department shared the interview on social media with the caption: \"Louvre Burglary: Five New Suspects Apprehended.\" In the interview, Ms Beccuau said one of the five suspects was identified through DNA traces left at the crime scene, but she added that it was \"too early\" to comment further on the suspects' identities. All five were arrested in coordinated raids in Paris and its surrounding areas late Wednesday, but searches overnight \"did not allow us to find the goods\", Ms Beccuau said. It comes after the prosecutor said two suspects arrested over the jewellery heist had \"partially\" confessed to their involvement in the robbery.  Four thieves stole nine items - one of which was dropped and recovered at the scene - in a heist pulled off while the world-famous Paris museum was open to visitors on 19 October. It took the thieves less than eight minutes to steal the jewels worth £76m. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift.  Ms Beccuau urged the thieves to return the French crown jewels on Wednesday. \"These jewels are now, of course, unsellable,\" she said. \"Anyone who buys them would be guilty of concealment of stolen goods. It's still time to give them back.\" Regarding the two suspects in custody since Saturday, Ms Beccuau previously revealed that one is a 34-year-old Algerian national who has been living in France since 2010. He was arrested Saturday night at Charles de Gaulle airport as he was about to fly to Algeria with no return ticket. Ms Beccuau said that he was living in the northern Paris suburb of Aubervilliers, and was known to police mostly for road traffic offences. His DNA was found on one of the scooters used by the thieves to leave the scene, according to the prosecutor. The other suspect, 39, was arrested Saturday night at his home in Aubervilliers. \"There is no evidence to suggest that he was about to leave the country,\" said Ms Beccuau. The man was known to police for several thefts, and his DNA was found on one of the glass cases where the jewels were displayed, and on items the thieves left behind, she added. The heist exposed major gaps in the Louvre's security, with Paris police chief Patrice Faure telling politicians that ageing security systems had left weak spots. Read more from Sky News:How the Louvre investigation is unfolding'Race against time' as police try to recover 'priceless' jewels'Matter of time' before thieves struck, expert says \"A technological step has not been taken,\" he said. Mr Faure also revealed that the Louvre's authorisation to operate its security cameras quietly expired in July and had not been renewed. He said the first alert to police came not from the Louvre's alarms, but from a cyclist outside who dialled the emergency line after seeing helmeted men with a basket lift."
    },
    {
        "title": "World Athletics blames employees for £1.3m taken in 'systematic theft'",
        "description": "World Athletics says two employees and a contractor stole &#8364;1.5m (&#163;1.3m) of its money as part of a \"systematic theft\" that lasted several years.",
        "url": "https://news.sky.com/story/world-athletics-blames-employees-for-16313m-taken-in-systematic-theft-13460880",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-world-athletics-theft_7067305.jpg?20251030200730",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 20:20:00",
        "Headline": "One employee and a contractor have been sacked while another culprit had already left the company.",
        "Content": "World Athletics says two employees and a contractor stole €1.5m (£1.3m) of its money as part of a \"systematic theft\" that lasted several years. The sport's international governing body said one of the employees and a consultant had been sacked following an internal investigation, while the other had already left the company. It said just over €1.5m (£1.3m) was stolen. The theft was uncovered by the body's finance department during its first annual auditing process, under a new financial team. World Athletics said detailed cases were handed over to judicial and legal authorities for criminal investigation. It added that \"a set of enhanced internal financial controls\" will be introduced to prevent future frauds. Read:Gender testing rules would have earned me an Olympic medalWorld Athletics to introduce mandatory sex testing 'It is important we do the right thing' Sebastian Coe, the World Athletics president, said: \"Unfortunately, corporate theft happens in organisations around the world and across all industry sectors at different levels. \"The most important thing is to identify it, review how it was able to happen and then introduce new processes and enhanced controls to ensure it doesn't happen again. This is what we have done. \"We are also determined to recover whatever monies we are able to using the full force of the law to do this. \"Too many organisations brush incidents like this under the carpet, terminating employment with limited information which allows perpetrators to continue their scams and thefts within new organisations. We are not that type of organisation. \"We have built a strong reputation for good governance, transparency and for defending what is right, even if it is sometimes a little uncomfortable. \"This is uncomfortable but it is important that we do the right thing.\""
    },
    {
        "title": "Trump's upbeat opinion of his meeting with Xi brushes over thornier issues",
        "description": "For all the brinkmanship, for all the high stakes and attempts to wield maximum leverage, in the end, there was clear recognition from both the US and China that a degree of stabilisation was necessary.",
        "url": "https://news.sky.com/story/trumps-upbeat-opinion-of-his-meeting-with-xi-brushes-over-thornier-issues-13460565",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-jinping-china_7066751.jpg?20251030101940",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-10-30 09:44:00",
        "Headline": "The US president and his Chinese counterpart have reached a consensus on key issues - but there appear to be no guarantees written in to prevent either party from reneging on what has been agreed.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  For all the brinkmanship, for all the high stakes and attempts to wield maximum leverage, in the end, there was clear recognition from both the US and China that a degree of stabilisation was necessary. The fact that some progress has been made on a relatively wide range of issues speaks to that. But there are real questions about how deep that progress runs and how easily, in the hands of two leaders who staked both their reputations on being strong and unyielding, it could all come crashing down. Follow the latest: Trump teases 'large-scale' energy deal From the very outset, the differences in style could not have been more stark. As the two posed for the introductory handshake, Donald Trump moved quickly to dominate the space - leaning in, doing all the talking, even quipping to the gathered reporters that Xi Jinping is \"a very strong negotiator, and that isn't good\". That didn't raise as much as an eyebrow from the Chinese leader. Xi doesn't like or respond well to unscripted moments; Trump, on the other hand, lives for them. It might seem like a relatively inconsequential detail, but it speaks to how difficult it has been for two such opposing systems to see eye to eye, and how many stumbling blocks remained. But it seems today, at least some of that was overcome. Indeed, there appears to have been an agreement on key issues such as the movement of rare earth minerals, the purchase of soybeans, the reduction of tariffs and the crackdown on the trade of fentanyl and the chemicals used to make it. There was further consensus to keep talking about the sale of high-end US chips and to work together to try to end the war in Ukraine. None of this is insignificant, but Trump's assessment of it all as a \"12 out of 10\" likely brushes over many much thornier issues.  The reality is that there is still a great gulf between them; there are many more barriers to trade than there were at the start of the year, there are still a raft of deep political and structural issues that divide them and the levels of distrust the trade war has left will take more than just one meeting to fix. Disagreements, such as the future status of Taiwan, for example, weren't even mentioned today. There also doesn't appear to be any guarantees baked in, and thus, there is nothing to prevent either party from reneging on what has been agreed and ramping pressure back up as soon as another issue arises. And, given the characters involved, that feels all too likely. Indeed, both sides, for different reasons, have found political advantage in the \"maximum pressure\" style brinkmanship we've seen in recent months. Read more:Donald Trump says tariffs will be cutEverything you need to know about the meeting Xi in particular cannot now be seen to cave in to Trump's pressure and, economically at least, China doesn't need to. There was an agreement today that the two would meet again in the early part of next year; Trump plans to visit China in April. This at least offers more diplomatic opportunity, but it would perhaps be naive to assume it will all be plain sailing until then."
    },
    {
        "title": "What happened when Trump met Xi? Here are five key points",
        "description": null,
        "url": "https://news.sky.com/story/everything-you-need-to-know-about-trump-and-xis-meeting-13460590",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-xi_7066771.jpg?20251030114119",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 10:13:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Netherlands election: Geert Wilders' far-right party suffers blow as centrists lead in exit poll",
        "description": "The Netherlands is set to elect its youngest ever prime minister after the far-right party of Geert Wilders was projected to suffer losses in an election he brought about by bringing down the government.",
        "url": "https://news.sky.com/story/netherlands-election-geert-wilders-far-right-party-suffers-blow-as-centrists-lead-in-exit-poll-13460482",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rob-jetten-netherlands_7066537.jpg?20251030035152",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-30 03:14:00",
        "Headline": "Far right parties have been on the march in countries including France and Germany, but long-serving Dutch populist leader Geert Wilders has been dealt a blow in his country's latest general election.",
        "Content": "The Netherlands is set to elect its youngest ever prime minister after the far-right party of Geert Wilders was projected to suffer losses in an election he brought about by bringing down the government. Rob Jetten, the 38-year-old leader of the centrist D66 party, was on course to claim the top job with half of all votes counted early this morning. His party was projected to win 27 of the 150 seats in the country's lower house of parliament, beating Mr Wilder's Freedom Party on 25, according to an exit poll by Ipsos. It comes just two years after he led his party to victory in the last election, winning 37 seats, although his coalition partners refused to endorse him as prime minister. Mr Jetten will also need to rely on a coalition himself, with 76 seats needed for a majority. At least four parties will be required for him to get there. One of Europe's longest-serving populist leaders, Mr Wilders is known for his anti-Islam stance and had proposed denying all asylum requests, sending all male Ukrainian refugees back to their homeland, and cancelling foreign aid. He brought the government down in June over its refusal to adopt his hardline measures. \"I regret the loss,\" he said in the early hours of Thursday, \"but it's not as if we were wiped off the map.\" He said Mr Jetten \"deserves congratulations\". 'We've shown the world how to beat the right' D66's Mr Jetten - who would also become the country's first openly gay prime minister - enjoyed a surge in support in the month leading up to polling day. He campaigned on a promise to resolve a housing shortage, invest in education, and tackle immigration. Like the other mainstream parties in the race, Mr Jetten also committed to support for Ukraine, NATO, and the EU. \"We've shown not only to the Netherlands, but also to the world that it is possible to beat populist and extreme right movements,\" he told a crowd of supporters. Read more from Sky News:PM rules out investigation into ReevesRare access inside Reform UK meeting Mr Jetten will first need to embark upon weeks or months of talks with other party leaders to form a coalition. One possible scenario is a pact including D66, the conservative Christian Democrats, the centre-right VVD, and the Greens-Labour party."
    },
    {
        "title": "Donald Trump announces dramatic drop in US refugee intake, with most of them white South Africans",
        "description": "The US is drastically cutting the number of refugees it will allow into the country to 7,500, and giving priority to white South Africans.",
        "url": "https://news.sky.com/story/donald-trump-announces-dramatic-drop-in-us-refugee-intake-with-most-of-them-white-south-africans-13460936",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-president-donald-trump_7067306.jpg?20251030200838",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:40:00",
        "Headline": "The new figure is a dramatic reduction from last year's 125,000, set by former president Joe Biden and half the 15,000 total for 2021, reportedly the previous lowest.",
        "Content": "The US is drastically cutting the number of refugees it will allow into the country to 7,500, and giving priority to white South Africans. The new figure, announced on Thursday in a memo in the Federal Registry, the official journal of the US administration, is a dramatic reduction from last year's 125,000, set by former president Joe Biden. No reason was given for the decrease, but the note said the admission of the 7,500 refugees during the 2026 fiscal year was \"justified by humanitarian concerns or is otherwise in the national interest\".   The notice posted to the register's website said the 7,500 admissions would \"primarily\" be allocated to Afrikaner South Africans and \"other victims of illegal or unjust discrimination in their respective homelands\". It is half the 15,000 total set for 2021 during Donald Trump's first term in office at the height of the COVID pandemic, which reports said was the previous lowest refugee admissions cap. Refugee rights groups were quick to condemn the proposal, with International Refugee Assistance Project (IRAP) president Sharif Aly, saying that by \"privileging Afrikaners while continuing to ban thousands of refugees who have already been vetted and approved, the administration is once again politicising a humanitarian programme\". Krish O'Mara Vignarajah, CEO of Global Refuge, said: \"Concentrating the vast majority of admissions on one group undermines the programme's purpose as well as its credibility.\" \n                  Trump's upbeat opinion of his meeting with Xi brushes over thornier issues\n                 \n                  Donald Trump says tariffs will be cut after 'amazing' meeting with Xi Jinping\n                 \n                  Trump-Xi meeting as it happened: US president teases 'large' energy deal after rating talks '12 out of 10'\n                 Human Rights First president, Uzra Zeya, called it a \"new low point\" in US foreign policy, which will \"further destabilise front-line states that host over two-thirds of the world's nearly 43 million refugees, undermining US national security in tandem\". In May, Mr Trump confronted South Africa's President Cyril Ramaphosa in the White House, claiming white farmers in his nation were being killed and \"persecuted\". A video purporting to show burial sites for murdered white farmers was played but was later shown to be scenes from a 2020 protest in which the crosses represented farmers killed over multiple years. The South African government has vehemently denied that Afrikaners and other white South Africans are being persecuted. Read more from Sky News:Tariffs change after 'amazing' Xi talksIs Trump preparing for war with Venezuela?US kills 14 in 'drug boat' attacks In January, the US president suspended the US Refugee Admissions Programme (USRAP) to, in his words, allow US authorities to prioritise national security and public safety. During the Oval Office meeting, Mr Ramaphosa said only that he hoped that Trump officials would listen to South Africans about the issue, and later said he believed there is \"doubt and disbelief about all this in [Mr Trump's] head\"."
    },
    {
        "title": "Donald Trump says tariffs will be cut after 'amazing' meeting with Xi Jinping",
        "description": "Donald Trump has described crucial trade talks with Chinese President Xi Jinping as \"amazing\" - and says he will visit Beijing in April.",
        "url": "https://news.sky.com/story/donald-trump-says-tariffs-will-be-cut-after-amazing-meeting-with-xi-jinping-13460490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-xi_7066539.jpg?20251030042245",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-30 04:20:00",
        "Headline": "The US president had predicted negotiations with his Chinese counterpart would last for three or four hours - but their meeting ended in less than two. He's now flying back to Washington on Air Force One after a whirlwind trip across Asia.",
        "Content": "Donald Trump has described crucial trade talks with Chinese President Xi Jinping as \"amazing\" - and says he will visit Beijing in April. The leaders of the world's two biggest economies met in South Korea as they tried to defuse growing tensions - with both countries imposing aggressive tariffs on exports since the president's second term began. Catch up on Trump-Xi meeting - as it happened Aboard Air Force One, Mr Trump confirmed tariffs on Chinese goods exported to the US will be reduced, which could prove much-needed relief to consumers. It was also agreed that Beijing will work \"hard\" to stop fentanyl flowing into the US. Semiconductor chips were another issue raised during their 100-minute meeting, but the president admitted certain issues weren't discussed. \"On a scale of one to 10, the meeting with Xi was 12,\" he told reporters en route back to the US.  Xi a 'tough negotiator', says Trump The talks conclude a whirlwind visit across Asia - with Mr Trump saying he was \"too busy\" to see Kim Jong Un. However, the president said he would be willing to fly back to see the North Korean leader, with a view to discussing denuclearisation. Mr Trump had predicted negotiations with his Chinese counterpart would last for three or four hours - but their meeting ended in less than two. The pair shook hands before the summit, with the US president quipping: \"He's a tough negotiator - and that's not good!\" It marks the first face-to-face meeting between both men since 2019 - back in Mr Trump's first term. There were signs that Beijing had extended an olive branch to Washington ahead of the talks, with confirmation China will start buying US soybeans again. American farmers have been feeling the pinch since China stopped making purchases earlier this year - not least because the country was their biggest overseas market. Chinese stocks reached a 10-year high early on Thursday as investors digested their meeting, with the yuan rallying to a one-year high against the US dollar. Analysis: A fascinating power play Sky News Asia correspondent Helen-Ann Smith - who is in Busan where the talks took place - said it was fascinating to see the power play between both world leaders. She said: \"Trump moved quickly to dominate the space - leaning in, doing all the talking, even responding very briefly to a few thrown questions. \"That didn't draw so much as an eyebrow raise from his counterpart, who was hard to read throughout. Xi does not like or respond well to unscripted moments; Trump lives for them.\" Asia correspondent Based on Trump's initial comments it appears the meeting has yielded progress on significant issues, even if the language thus far is vague and the tone \"Trumpian\". While agreements to ease the flow of rare earths, to lower tariffs, talk further on chips and to stem the flow of fentanyl precursors are commendable, Trump's assessment of the meeting as a \"12 out of 10\" likely brushes over the fact thornier issues remain. Both economies desperately needed stabilisation from the raucous instability of recent months and years, the willingness to reach agreement on such a variety of issues speaks clearly to that. But, in a way, economics is the easy bit, there are still a wealth of thornier political issues that divide them; the future of Taiwan, for instance, wasn't even raised. It is also unclear whether any form of guarantee will be baked in; what's to stop either side ramping tensions back up as soon as the next stumbling block emerges? In short, today may have tackled the low hanging fruit, but reversing the now deep-seated distrust will be harder.  Read more from Sky News:US cuts interest rates as inflation fears easeIs Trump preparing for war with Venezuela?  On Truth Social, Mr Trump had described the summit as a gathering of the \"G2\" - a nod to America and China's status as the world's two biggest economies. While en route to see President Xi, he also revealed that the US \"Department of War\" has now been ordered to start testing nuclear weapons for the first time since 1992."
    },
    {
        "title": "Trump's upbeat opinion of his meeting with Xi brushes over thornier issues",
        "description": "For all the brinkmanship, for all the high stakes and attempts to wield maximum leverage, in the end, there was clear recognition from both the US and China that a degree of stabilisation was necessary.",
        "url": "https://news.sky.com/story/trumps-upbeat-opinion-of-his-meeting-with-xi-brushes-over-thornier-issues-13460565",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-jinping-china_7066751.jpg?20251030101940",
        "type": "US",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-10-30 09:44:00",
        "Headline": "The US president and his Chinese counterpart have reached a consensus on key issues - but there appear to be no guarantees written in to prevent either party from reneging on what has been agreed.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  For all the brinkmanship, for all the high stakes and attempts to wield maximum leverage, in the end, there was clear recognition from both the US and China that a degree of stabilisation was necessary. The fact that some progress has been made on a relatively wide range of issues speaks to that. But there are real questions about how deep that progress runs and how easily, in the hands of two leaders who staked both their reputations on being strong and unyielding, it could all come crashing down. Follow the latest: Trump teases 'large-scale' energy deal From the very outset, the differences in style could not have been more stark. As the two posed for the introductory handshake, Donald Trump moved quickly to dominate the space - leaning in, doing all the talking, even quipping to the gathered reporters that Xi Jinping is \"a very strong negotiator, and that isn't good\". That didn't raise as much as an eyebrow from the Chinese leader. Xi doesn't like or respond well to unscripted moments; Trump, on the other hand, lives for them. It might seem like a relatively inconsequential detail, but it speaks to how difficult it has been for two such opposing systems to see eye to eye, and how many stumbling blocks remained. But it seems today, at least some of that was overcome. Indeed, there appears to have been an agreement on key issues such as the movement of rare earth minerals, the purchase of soybeans, the reduction of tariffs and the crackdown on the trade of fentanyl and the chemicals used to make it. There was further consensus to keep talking about the sale of high-end US chips and to work together to try to end the war in Ukraine. None of this is insignificant, but Trump's assessment of it all as a \"12 out of 10\" likely brushes over many much thornier issues.  The reality is that there is still a great gulf between them; there are many more barriers to trade than there were at the start of the year, there are still a raft of deep political and structural issues that divide them and the levels of distrust the trade war has left will take more than just one meeting to fix. Disagreements, such as the future status of Taiwan, for example, weren't even mentioned today. There also doesn't appear to be any guarantees baked in, and thus, there is nothing to prevent either party from reneging on what has been agreed and ramping pressure back up as soon as another issue arises. And, given the characters involved, that feels all too likely. Indeed, both sides, for different reasons, have found political advantage in the \"maximum pressure\" style brinkmanship we've seen in recent months. Read more:Donald Trump says tariffs will be cutEverything you need to know about the meeting Xi in particular cannot now be seen to cave in to Trump's pressure and, economically at least, China doesn't need to. There was an agreement today that the two would meet again in the early part of next year; Trump plans to visit China in April. This at least offers more diplomatic opportunity, but it would perhaps be naive to assume it will all be plain sailing until then."
    },
    {
        "title": "Trump's upbeat opinion of his meeting with Xi brushes over thornier issues",
        "description": "For all the brinkmanship, for all the high stakes and attempts to wield maximum leverage, in the end, there was clear recognition from both the US and China that a degree of stabilisation was necessary.",
        "url": "https://news.sky.com/story/trumps-upbeat-opinion-of-his-meeting-with-xi-brushes-over-thornier-issues-13460565",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-jinping-china_7066751.jpg?20251030101940",
        "type": "Business",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-10-30 09:44:00",
        "Headline": "The US president and his Chinese counterpart have reached a consensus on key issues - but there appear to be no guarantees written in to prevent either party from reneging on what has been agreed.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  For all the brinkmanship, for all the high stakes and attempts to wield maximum leverage, in the end, there was clear recognition from both the US and China that a degree of stabilisation was necessary. The fact that some progress has been made on a relatively wide range of issues speaks to that. But there are real questions about how deep that progress runs and how easily, in the hands of two leaders who staked both their reputations on being strong and unyielding, it could all come crashing down. Follow the latest: Trump teases 'large-scale' energy deal From the very outset, the differences in style could not have been more stark. As the two posed for the introductory handshake, Donald Trump moved quickly to dominate the space - leaning in, doing all the talking, even quipping to the gathered reporters that Xi Jinping is \"a very strong negotiator, and that isn't good\". That didn't raise as much as an eyebrow from the Chinese leader. Xi doesn't like or respond well to unscripted moments; Trump, on the other hand, lives for them. It might seem like a relatively inconsequential detail, but it speaks to how difficult it has been for two such opposing systems to see eye to eye, and how many stumbling blocks remained. But it seems today, at least some of that was overcome. Indeed, there appears to have been an agreement on key issues such as the movement of rare earth minerals, the purchase of soybeans, the reduction of tariffs and the crackdown on the trade of fentanyl and the chemicals used to make it. There was further consensus to keep talking about the sale of high-end US chips and to work together to try to end the war in Ukraine. None of this is insignificant, but Trump's assessment of it all as a \"12 out of 10\" likely brushes over many much thornier issues.  The reality is that there is still a great gulf between them; there are many more barriers to trade than there were at the start of the year, there are still a raft of deep political and structural issues that divide them and the levels of distrust the trade war has left will take more than just one meeting to fix. Disagreements, such as the future status of Taiwan, for example, weren't even mentioned today. There also doesn't appear to be any guarantees baked in, and thus, there is nothing to prevent either party from reneging on what has been agreed and ramping pressure back up as soon as another issue arises. And, given the characters involved, that feels all too likely. Indeed, both sides, for different reasons, have found political advantage in the \"maximum pressure\" style brinkmanship we've seen in recent months. Read more:Donald Trump says tariffs will be cutEverything you need to know about the meeting Xi in particular cannot now be seen to cave in to Trump's pressure and, economically at least, China doesn't need to. There was an agreement today that the two would meet again in the early part of next year; Trump plans to visit China in April. This at least offers more diplomatic opportunity, but it would perhaps be naive to assume it will all be plain sailing until then."
    },
    {
        "title": "Donald Trump says tariffs will be cut after 'amazing' meeting with Xi Jinping",
        "description": "Donald Trump has described crucial trade talks with Chinese President Xi Jinping as \"amazing\" - and says he will visit Beijing in April.",
        "url": "https://news.sky.com/story/donald-trump-says-tariffs-will-be-cut-after-amazing-meeting-with-xi-jinping-13460490",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-xi_7066539.jpg?20251030042245",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-30 04:20:00",
        "Headline": "The US president had predicted negotiations with his Chinese counterpart would last for three or four hours - but their meeting ended in less than two. He's now flying back to Washington on Air Force One after a whirlwind trip across Asia.",
        "Content": "Donald Trump has described crucial trade talks with Chinese President Xi Jinping as \"amazing\" - and says he will visit Beijing in April. The leaders of the world's two biggest economies met in South Korea as they tried to defuse growing tensions - with both countries imposing aggressive tariffs on exports since the president's second term began. Catch up on Trump-Xi meeting - as it happened Aboard Air Force One, Mr Trump confirmed tariffs on Chinese goods exported to the US will be reduced, which could prove much-needed relief to consumers. It was also agreed that Beijing will work \"hard\" to stop fentanyl flowing into the US. Semiconductor chips were another issue raised during their 100-minute meeting, but the president admitted certain issues weren't discussed. \"On a scale of one to 10, the meeting with Xi was 12,\" he told reporters en route back to the US.  Xi a 'tough negotiator', says Trump The talks conclude a whirlwind visit across Asia - with Mr Trump saying he was \"too busy\" to see Kim Jong Un. However, the president said he would be willing to fly back to see the North Korean leader, with a view to discussing denuclearisation. Mr Trump had predicted negotiations with his Chinese counterpart would last for three or four hours - but their meeting ended in less than two. The pair shook hands before the summit, with the US president quipping: \"He's a tough negotiator - and that's not good!\" It marks the first face-to-face meeting between both men since 2019 - back in Mr Trump's first term. There were signs that Beijing had extended an olive branch to Washington ahead of the talks, with confirmation China will start buying US soybeans again. American farmers have been feeling the pinch since China stopped making purchases earlier this year - not least because the country was their biggest overseas market. Chinese stocks reached a 10-year high early on Thursday as investors digested their meeting, with the yuan rallying to a one-year high against the US dollar. Analysis: A fascinating power play Sky News Asia correspondent Helen-Ann Smith - who is in Busan where the talks took place - said it was fascinating to see the power play between both world leaders. She said: \"Trump moved quickly to dominate the space - leaning in, doing all the talking, even responding very briefly to a few thrown questions. \"That didn't draw so much as an eyebrow raise from his counterpart, who was hard to read throughout. Xi does not like or respond well to unscripted moments; Trump lives for them.\" Asia correspondent Based on Trump's initial comments it appears the meeting has yielded progress on significant issues, even if the language thus far is vague and the tone \"Trumpian\". While agreements to ease the flow of rare earths, to lower tariffs, talk further on chips and to stem the flow of fentanyl precursors are commendable, Trump's assessment of the meeting as a \"12 out of 10\" likely brushes over the fact thornier issues remain. Both economies desperately needed stabilisation from the raucous instability of recent months and years, the willingness to reach agreement on such a variety of issues speaks clearly to that. But, in a way, economics is the easy bit, there are still a wealth of thornier political issues that divide them; the future of Taiwan, for instance, wasn't even raised. It is also unclear whether any form of guarantee will be baked in; what's to stop either side ramping tensions back up as soon as the next stumbling block emerges? In short, today may have tackled the low hanging fruit, but reversing the now deep-seated distrust will be harder.  Read more from Sky News:US cuts interest rates as inflation fears easeIs Trump preparing for war with Venezuela?  On Truth Social, Mr Trump had described the summit as a gathering of the \"G2\" - a nod to America and China's status as the world's two biggest economies. While en route to see President Xi, he also revealed that the US \"Department of War\" has now been ordered to start testing nuclear weapons for the first time since 1992."
    },
    {
        "title": "'Win for passengers' as Virgin clears first step to run Channel Tunnel trains to rival Eurostar",
        "description": "Virgin has cleared the first step in its plan to launch a rival Eurostar service. ",
        "url": "https://news.sky.com/story/win-for-passengers-as-virgin-clears-first-step-to-run-channel-tunnel-trains-to-rival-eurostar-13460642",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-eurostar-virgin-train_7066823.jpg?20251030115031",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-30 11:39:00",
        "Headline": "Extra competition will bring down prices, according to Sir Richard Branson, who says Virgin has ambitions to expand services across the continent.",
        "Content": "Virgin has cleared the first step in its plan to launch a rival Eurostar service.  The company, owned by billionaire Sir Richard Branson, has been granted access to share Eurostar's Temple Mill international depot in east London. The decision, by the rail regulator, the Office of Rail and Road (ORR), is an important first step towards operating cross-border train services via the Channel Tunnel. Sir Richard has described it as \"the big hurdle that we had to get through\" in the process. Access to the depot means Virgin can maintain and store trains. Money blog: Major bank loses 23,000 customers to rivals Additional regulatory approvals are necessary, however, and Virgin Trains will require track access and a safety go-ahead before it can start international services.  The company says it wants to run trains between London's St Pancras station and the city centres of Paris, Brussels and Amsterdam in 2030. It's also in discussions with France's busiest airport, Charles de Gaulle, about running trains there. Sir Richard said he hoped to recommence occasional services between London and Disneyland Paris. There are \"ambitions\" to expand \"further across France, and into Germany and Switzerland\". Eurostar stopped running direct trains to the theme park in 2023. Other train operators had sought access to the depot and were denied. Eurostar, who currently run services, had sought to expand its access but was turned down. Read more:Car finance redress scheme threatens UK jobs, bank warnsOfgem to wipe millions of debt with slight increase to bills  The ORR said the announcement was a win for passengers, customer choice, and economic growth. \"Virgin Trains' plans were more financially and operationally robust than those of other applicants, and it provided clear evidence of investor backing and an agreement in principle to deliver the necessary and appropriate rolling stock,\" it added. This competition will bring down prices, Sir Richard said. Passenger rail services on the high-speed line have been a monopoly since it opened in 1994.  The tunnel is only used at roughly 50% capacity, despite accommodating the LeShuttle vehicle-carrying trains between Folkestone in Kent and Calais in northern France.  "
    },
    {
        "title": "Energy regulator Ofgem to wipe millions of debt with slight increase to bills",
        "description": "Up to &#163;500m in energy bill debt is to be cancelled by regulator Ofgem as it aims to tackle record levels of arrears. ",
        "url": "https://news.sky.com/story/energy-regulator-ofgem-to-wipe-millions-of-debt-with-slight-increase-to-bills-13460531",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-energy-bills-electricity_7057830.jpg?20251021222054",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-30 07:54:00",
        "Headline": "Energy bill debt has reached record highs as prices have increased.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Up to £500m in energy bill debt is to be cancelled by regulator Ofgem as it aims to tackle record levels of arrears.  As many as 195,000 bill payers could be helped by the write-off in the first part of Ofgem's proposals to reduce debt and prevent it rising to such highs again. Only a small proportion of the record-high £4.4bn debt mound in the energy system will be erased. Up to a third of this, between £1.1bn and £1.7bn, is never paid. Money blog: Major bank loses 23,000 customers to rivals  Consumers engaging with a debt advice charity or making some contribution to their bill arrears or ongoing energy use are set to benefit. Eligible customers will also be identified and contacted automatically by suppliers. \n                  Tesco promises 'strong deals' amid 'intensive' price war - as profits expected to hit £3bn\n                 \n                  Finances feeling tight? New figures on disposable income help explain why\n                 \n                  'If we're not there already we're coming to a town near you' Aldi says, vowing lower prices before Christmas\n                 How much will it cost? Bill payers will fund the debt cancellation by paying an estimated extra £5 a year, equalling about 42 pence a month, from 2027, Ofgem said. This measure is better than the current system, Ofgem said, of spreading the debt across everyone's bills or writing it off entirely. Spreading the debt has added £52 to an annual bill, the regulator added. So the measure announced on Thursday will mean bill savings overall by reducing the amount customers pay towards debt-related costs. The scheme is likely to take effect \"early\" in 2026 with full policy documents published in the coming weeks, it said.  Another proposal MPs of the Energy Security and Net Zero Committee, however, have called for energy firm profits to pay down the debt. Energy bills have risen significantly as wholesale oil and gas prices have risen massively after Russia's invasion of Ukraine.  The rush in the West to wean off Russian imports and sanction the country, as well as ongoing geopolitical tensions, means prices have remained elevated. Fossil fuel-producing companies enjoyed record profits as a result. Changes when you move house Changes for when people move into a new property are to be trialled as part of the effort to prevent debt reaching the current highs again. Credit could be added to a smart meter or changed to prepayment mode for a new tenant or homeowner, so the new residents could have power while getting an account set up with a supplier. At present, bills build up under \"anonymous\" accounts until the resident registers with a supplier. "
    },
    {
        "title": "Monzo hires new CEO as it prepares to click on mega-float",
        "description": "Monzo, the digital bank which counts one in five British adults among its customers, is shaking up its leadership ahead of a public flotation that investors hope could value it at up to &#163;10bn.",
        "url": "https://news.sky.com/story/monzo-hires-new-ceo-as-it-prepares-to-click-on-mega-float-13460562",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-monzo-bank-card_6364411.jpg?20231118075058",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-30 09:42:00",
        "Headline": "Diana Layfield, a former Google and Standard Chartered executive, is to become CEO of one of Britain's fastest-growing banks ahead of a blockbuster listing, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Monzo, the digital bank which counts one in five British adults among its customers, is shaking up its leadership ahead of a public flotation that investors hope could value it at up to £10bn. Sky News has learnt that Monzo is to name Diana Layfield, a former Google and Standard Chartered executive, as its new chief executive. TS Anil, who has run the bank for the last five years, is expected to step down as part of the move. The leadership change will come as Monzo steps up preparations for an eventual public listing in London or New York. Earlier this year, Sky News reported that Monzo was working with Morgan Stanley, the Wall Street giant, on a series of meetings with potential investors ahead of an IPO. London is currently seen as the most likely listing venue for Monzo by board members and investors, according to people close to the situation. The company, which saw its valuation soar to £4.5bn last year after primary and secondary share sales, is considering a further sale of existing shares to allow early investors and employees to cash in, although a decision to proceed has not yet been taken. \n                  Santander warns car finance redress scheme a threat to UK jobs, growth and economy\n                 \n                  Bank tax could hurt households and business lending, UK's biggest mortgage provider says\n                 \n                  Nationwide app and internet banking back up after outage\n                 Monzo has more than 11m UK retail customers, making it the seventh-largest British bank by customer numbers, and 600,000 business customers. Founded a decade ago, it has become one of Britain's most successful, and valuable, fintech companies. It employs close to 4,000 people. Last year, it raised more than £500m by selling newly issued shares to a group of investors led by Capital G, a division of Alphabet-owned Google. That primary share sale valued the business at £4.1bn. An IPO, including any new capital raised, would be likely to value Monzo at more than £6bn, and potentially in the region of £7bn, according to banking sources. Last year's secondary share sale saw existing Monzo investors StepStone Group and GIC, the Singaporean sovereign wealth fund, buying stock from employees. The company is now profitable and has diversified into investments and instant access savings accounts. It has also launched pensions products and accounts aimed at under-16s. Monzo is among a new generation of banks which have emerged since the last financial crisis and begun to accumulate a significant share of the UK retail banking market. Monzo has recovered spectacularly from a difficult period in 2020 when it emerged that the City watchdog was investigating it for potential breaches of anti-money laundering and financial crime rules. It has revamped its corporate structure as it pursues an international expansion aimed at enticing new investors to its strategy for long-term growth. The company has been exploring acquisition opportunities in the US and Europe, although a major deal is not thought to be imminent. Monzo Bank Holding Group was established to avoid the company facing punitive capital treatment by British regulators as it launches in new overseas markets. Other Monzo investors include the Chinese group Tencent, Passion Capital, Accel, General Catalyst and Hedosophia. Monzo is chaired by Gary Hoffman, the banker who salvaged Northern Rock after its nationalisation in 2008. The company declined to comment on Thursday morning."
    },
    {
        "title": "Rachel Reeves survives permit row, but questions it raises cut deeper",
        "description": "Rachel Reeves was never going to resign over her failure to apply for a permit to rent out her house in south London.",
        "url": "https://news.sky.com/story/rachel-reeves-survives-permit-row-but-questions-it-raises-cut-deeper-13460835",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves_7067241.jpg?20251030183457",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-30 16:03:00",
        "Headline": "The chancellor's oversight may seem minor, but it highlights both her weaknesses and the political peril her departure would pose to Downing Street ahead of a make-or-break budget.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Rachel Reeves was never going to resign over her failure to apply for a permit to rent out her house in south London. She is unlikely even to face a fine from Southwark council - the mea culpa from the estate agent will have absolved her of much of the political guilt. The episode is a distraction from the far bigger challenge she faces ahead of next month's budget - and the £30-40 billion black hole. But that doesn't mean this squall should be ignored entirely - for it tells us two important things. The first is it reminds us of of one of Ms Reeves' traits that is at odds with the vibe she likes to present to the country: that she is not always as across the detail or on top of things as she would like to make out. The chancellor first said she was not advised to get a permit by a letting agent, so did not do so. Then, 24 hours later, she said that she was told by the letting agency it would take care of a permit, and did not realise it had not.  But is that quite good enough, particularly for someone who campaigned to strengthen exactly this law and who ended up deriving financial benefit for not doing so, to quite evidently not be across the detail? In the aftermath of Angela Rayner's resignation for a failure to comply with property law, might it not have been worthwhile for one to double-check the paperwork of one's second home? Then there have been other incidents in Ms Reeves' life outside of being chancellor that jar with the image of a super-efficient stateswoman. Ahead of the election, Ms Reeves was forced to hold her hands up and acknowledge making mistakes in her new book about female economists after she faced allegations of plagiarism. She admitted that some sentences in her book, The Women Who Made Modern Economics, were \"not properly referenced in the bibliography\". She also had to update her LinkedIn after it emerged she was not an \"economist\" when she worked in financial services at a bank. For a chancellor who faces making momentous decisions that will affect everybody in this country, lack of attention to detail is not a characteristic she would want extensively dwelt on. The bigger story this tells about her will sting. The second thing it tells us is just how central she is to the Starmer project. Number 10 moved to protect her within hours - publishing an exchange of letters late into Wednesday night that relied just on the account of Ms Reeves and apparently without corroborating evidence. The government machine went out of its way in the fastest possible timeframe to try and shut the matter down - a courtesy not extended to Angela Rayner or Louise Haigh. This is because Sir Keir knows a Reeves departure risks exposing himself - weeks before a budget that could determine this prime minister's fate. Read more from Sky News:Investigation into Reeves not needed, Starmer saysSky News gets rare access inside Reform UK meeting It also risks an adverse reaction in the bond markets, which fear higher-borrowing alternative candidates in the Treasury. Neither outcome is one this government feels like it could cope with at the moment. Rachel Reeves is quite simply the most important figure in Sir Keir Starmer's administration, and this is why she is protected at almost any reasonable cost. While this is true now, it may not always be this way, however. Will Sir Keir feel the same after 26 November when he has to defend the tax-raising budget?"
    },
    {
        "title": "Zarah Sultana takes over company holding £800,000 in Your Party donations after major row",
        "description": "Zarah Sultana now has sole control of over &#163;800,000 of Your Party donations following a fresh internal fallout.",
        "url": "https://news.sky.com/story/zarah-sultana-takes-over-company-holding-163800000-in-your-party-donations-after-major-row-13460569",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-zarah-sultana_7047989.jpg?20251010182657",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-10-30 09:55:00",
        "Headline": "Your Party has been trying to put on a united front ahead of its founding conference next month - but there has been a major row behind the scenes over control of donations and data, Sky News has learned.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Zarah Sultana now has sole control of over £800,000 of Your Party donations following a fresh internal fallout. Sky News understands she has assured co-leader Jeremy Corbyn the money will be transferred to the party as a whole. Politics latest: Rachel Reeves has to go after breaking law, rival tells Sky News However that is yet to happen, frustrating some Your Party figures who have been trying to access the funds for weeks, in a situation one source described as \"an insane mess\". There has been a major row behind the scenes with the previous custodians of the donations - former Labour MP Beth Winter, former Labour mayor Jamie Driscoll and former South African politician Andrew Feinstein. The trio were the directors of a company called MoU Operations, which was set up in April to support an independent alliance of MPs centred around former Labour leader Mr Corbyn. When Your Party was launched in July, its privacy policy stated that donations would be collected by MoU until the new movement was formally constituted and had its own bank account. \n                  Jeremy Corbyn and Zarah Sultana's Your Party gains first Scottish representatives\n                 \n                  Corbyn and Sultana have 'patched things up' - but what really happened?\n                 \n                  Corbyn and Sultana friends again 'like the Gallagher brothers' as next steps for Your Party set out\n                 Your Party was registered with the electoral commission on 30 September, when it declared assets of £850,000, but no transfer of funds was made despite repeated requests from senior figures to MoU, seen by Sky News. The row reached boiling point this week as Your Party sources said they were considering legal action. Sky News understands lawyers had drafted a 'letter before action' to send to MoU, putting them on notice of court proceedings, before the three directors broke their silence and quit on Wednesday night. In a lengthy statement, the trio said the role of holding donations was \"thrust upon\" them and the company had been \"repeatedly been used without our agreement\". They said a transfer of funds had been further complicated by Ms Sultana's unauthorised membership launch last month, which left MoU vulnerable to liabilities. 'Totally undemocratic' The group said that since the end of September, they have been asking Your Party to take complete ownership and control of MoU, but this was refused. Ms Sultana taking the reins was aimed at breaking the impasse. However one Your Party source told Sky News it is \"only a resolution if Zarah transfers the money to the Your Party bank account\". Another Your Party source pointed to a statement she made on social media on Wednesday night, in which she said the MoU resources \"will now be used for Your Party as was always intended\". The source said: \"Zarah created this utter mess then poses as coming to the rescue, but she didn't actually say she would transfer it in her statement. \"Imagine if this was the Labour Party and one MP had control of the funds. It's totally undemocratic.\" A source close to Ms Sultana said that legal formalities are being concluded and the cash will \"100%\" be moved over as soon as practically possible, stressing there is no deliberate delay. Sky News understands she was willing to take on risks associated with MoU to get the issue resolved before the founding conference next month. The row, which also relates to data, is deeply damaging for a party that had promised to revive the British left but has so far been marred by chaos and division. Ms Sultana announced the new party in early July in a move that appeared to catch Mr Corbyn off guard - with the official launch coming weeks later.  Botched membership launch comes back to haunt Your Party  On 18 September, she sent an email to supporters asking them to become a paid member for £5 a month or £55 a year, which Mr Corbyn said was unauthorised. The website had a different domain name to Your Party's website, though it looked similar, and said it was being managed by MoU, which received the membership fees. However neither MoU nor Ms Sultana was the owner of the data of those who received the email, which was being managed by Mr Corbyn's Peace and Justice Project. The matter was referred to the Information Commissioner's Office, and an investigation is still ongoing. The money collected by MoU in membership fees is not expected to be transferred to Your Party as those people who paid are entitled to a refund - a process Ms Sultana will now have to manage. Read more:Corbyn and Sultana friends again 'like Gallagher brothers' Some 20,000 people signed up to Ms Sultana's portal but Your Party still does not have access to their emails, meaning there is no way of contacting them. 'Lack of governance at top of Your Party' Your Party had been requesting the transfer of this too, but MoU's outgoing directors suggested this would breach GDPR regulations. In their statement, they said they had no involvement in the \"confused membership launch\" and they could not \"accept personal liability for actions that were taken without our knowledge or approval\". \"Nor could we agree to a proposed 'resolution' that put MOU at risk of having liabilities exceeding its assets,\" they added. The group also claimed they raised concerns about the \"lack of appropriate governance\" of Your Party ever since its launch and \"tried many times to hand over everything to Your Party, lock, stock and barrel\". They said they wanted to find a resolution behind the scenes but have repeatedly been subject to \"hostile briefings\". \"In simple terms, we offered to hand over ownership to Your Party, and make the six Your Party MPs directors in our place, giving them full control. Only one of the six was willing to agree,\" the statement said. \"We will have no further involvement with MOU. We want nothing for ourselves. We have taken no money or benefit in kind.\" Your Party has not released a statement of its own. But Ms Sultana paid tribute to her predecessors on X, saying they have been \"patient, constructive and consistently sought to resolve matters diplomatically\". She said: \"Thank you for your patience - this brings the chapter to a close and these resources will now be used for Your Party, as was always intended.\""
    },
    {
        "title": "Rachel Reeves to face no further action over 'inadvertent' rental licence 'failure', says Keir Starmer",
        "description": "Sir Keir Starmer has said Rachel Reeves will face no further action over her \"inadvertent failure\" to obtain a rental licence for her south London home. ",
        "url": "https://news.sky.com/story/rachel-reeves-to-face-no-further-action-over-inadvertent-rental-licence-failure-says-keir-starmer-13460984",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rachel-reeves_7067340.jpg?20251030210645",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-30 21:00:00",
        "Headline": "The PM's letter came after the letting agency Rachel Reeves used to rent out her home apologised.",
        "Content": " Sir Keir Starmer has said Rachel Reeves will face no further action over her \"inadvertent failure\" to obtain a rental licence for her south London home.  It follows a turbulent 24 hours for the chancellor, in which she was accused of breaking the law and the Conservatives called for her to resign or be sacked. In a letter published on Thursday night, the prime minister said correspondence shared by the chancellor \"shows that the oversight regarding the licence occurred after your husband had been told by the estate agents that they would apply for a licence on his behalf\". However, the application \"did not occur\". Politics latest: Key emails published in rent breach row Sir Keir continued: \"It is clearly regrettable that the information in this correspondence was not shared with me when you wrote to me last night, but I fully accept that you were not aware, at that stage, of these emails. \"I understand that the relevant emails were only unearthed by your husband this morning, and that you have updated me as soon as possible.\" \n                  Rachel Reeves survives permit row, but questions it raises cut deeper\n                 \n                  Badenoch says hacking into Harriet Harman's website 17 years ago 'not the same' as Reeves breaking law\n                 \n                  Farage v Mahmood: Who is the Terminator?\n                 The PM then labelled the incident \"an inadvertent failure\" and said he sees \"no need\" for further action. The government has also published a letter from Sir Laurie Magnus, an independent adviser on ministerial standards, to Sir Keir. He wrote: \"It is regrettable that information provided on successive days has generated confusion, but I find no evidence of bad faith.\" The letters came after Ms Reeves had received an apology from a lettings agency after the company confirmed it offered to apply for a rental licence and then failed to do so. On Wednesday evening, the Daily Mail reported Ms Reeves had failed to pay for a \"selective\" licence when renting out her family home in Dulwich, south London, which she has left while living in Downing Street as chancellor. In an exchange of letters a matter of hours later, Sir Keir Starmer gave the chancellor his backing and said further investigation into the issue was \"not necessary\" after consulting his independent ethics adviser Sir Laurie Magnus. Ms Reeves immediately faced calls to leave her post, having admitted to mistakenly breaching local council housing rules by failing to secure the licence. The Housing Act 2004 gives councils the power to make landlords accredit themselves in certain areas. However, late on Thursday afternoon, the owner of lettings agency Harvey and Wheeler released an apology to the chancellor. In it, boss Gareth Martin confirmed a member of his staff said they would apply for the licence for the Reeves family - but this was never done, as the person \"suddenly resigned\" prior to the start of the tenancy. Mr Martin said: \"We alert all our clients to the need for a licence. In an effort to be helpful our previous property manager offered to apply for a licence on these clients' behalf, as shown in the correspondence. That property manager suddenly resigned on the Friday before the tenancy began on the following Monday. \"Unfortunately, the lack of application was not picked up by us as we do not normally apply for licences on behalf of our clients; the onus is on them to apply. We have apologised to the owners for this oversight. \"At the time the tenancy began, all the relevant certificates were in place and if the licence had been applied for, we have no doubt it would have been granted. \"Our clients would have been under the impression that a licence had been applied for. Although it is not our responsibility to apply, we did offer to help with this. \"We deeply regret the issue caused to our clients as they would have been under the impression that a licence had been applied for.\" Read more:Badenoch hacking 'not the same' as Reeves 'law break'Sam Coates: Rental row raises questions that cut deeper Under the Housing Act 2004, introduced by Labour, councils can decide to introduce selective licensing, where residential landlords in specified areas must have a licence.\n Landlords must adhere to certain requirements to obtain a licence, including gas certificates, working carbon monoxide alarms and fire safety regulations for furnishings. They must secure a licence within 28 days of renting out a home.\n Southwark Council, where Rachel Reeves' house is, charges £900 for a licence, which lasts five years. Failure to secure a selective licence can result in a penalty of up to £30,000 or an unlimited fine from a court upon conviction. Landlords can also be made to repay up to 12 months' rent to the tenant or they can be prevented from renting out the property.\n Serious and repeat offenders can be prosecuted, with a sentence of up to five years or an uncapped fine, and they can be put on a rogue landlords database.\n The government has published emails between her husband Nicholas Joicey and the agency showing that Harvey and Wheeler had agreed to apply for the licence, while Ms Reeves told the prime minister in a letter she took \"full responsibility\" for the matter. The final email in the series, sent on 13 August 2024 by the letting agent, said: \"I will do the selective licence once the new tenant moves in.\" In the letter from Ms Reeves to Sir Keir, the chancellor said: \"Yesterday I wrote to you and said that we were not aware that a licence was necessary to let out our property, based on conversations my husband had with the agency yesterday. \"Today the letting agency and my husband have found correspondence confirming that on 17 July 2024 the letting agent said to my husband that a selective licence would be required and agreed that the agency would apply for the licence on our behalf. \"They have also confirmed today they did not take the application forward, in part due to a member of staff leaving the organisation. Nevertheless, as I said yesterday, I accept it was our responsibility to secure the licence. \"I also take responsibility for not finding this information yesterday and bringing it to your attention. \"As I said to you today, I am sorry about this matter and accept full responsibility for it.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 The Conservatives are calling for further investigations from Downing Street into what happened and the timeline of events. However, it appears that Number 10 considers the matter closed as it has consistently stood behind the chancellor - and says she will deliver next month's budget."
    },
    {
        "title": "Claire Inglis: Call for 'damning' report into mother's murder to be fully released",
        "description": "Scotland's top law officer is being urged to fully release a \"damning\" report into the murder of a young mother who was tortured and killed by her boyfriend.",
        "url": "https://news.sky.com/story/claire-inglis-call-for-damning-report-into-mothers-murder-to-be-fully-released-13460776",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-claire-inglis-facebook_6335111.jpg?20251030145720",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-10-30 14:53:00",
        "Headline": "Christopher McGowan was out on bail when he beat and strangled Claire Inglis, 28, at her flat in Stirling in November 2021.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Scotland's top law officer is being urged to fully release a \"damning\" report into the murder of a young mother who was tortured and killed by her boyfriend. Christopher McGowan beat and strangled Claire Inglis, 28, at her flat in Stirling in November 2021. The mother-of-one suffered 76 injuries in the fatal attack, which included being burned with a lighter and having a wet wipe pushed down her throat. McGowan received a life sentence with a minimum of 23 years behind bars in October 2023. Following the murder, which was described by judge Michael O'Grady as \"beyond sadistic\", it was revealed that McGowan was a serial offender who had been bailed three times to Claire's home in the months leading up to her death. An independent expert report into the handling of the case noted that despite prior concerns, \"no further action was taken by social services\" - with the expert concluding that this amounted to a \"major safeguarding lapse\". The report found no one spoke to Ms Inglis about McGowan's background or offered her support, adding that the \"system as a whole\" failed her. \n                  Regan McClinton: Blantyre sex predator who attacked two girls after dragging them off street jailed\n                 \n                  'Sex predator' who spiked women's drinks at Kirkcaldy club before attacking them jailed\n                 \n                  Romanian grooming gang jailed for raping and sexually exploiting women\n                 It said Ms Inglis and her son were \"effectively invisible\" to authorities. The victim's parents Fiona and Ian Inglis have only seen a summary of the document and are calling on the Crown Office and Procurator Fiscal Service (COPFS) to release the report in full. Ms Inglis said: \"The Crown Office has not even given us the full report, but only a brief summary which does not answer critical questions about whether Claire's murder might have been prevented. \"We believe that it could have been and that she should still be with us today. \"That is why we back the policy to ensure that all relevant information is shared between the police, social services and courts when making bail decisions. \"Doing so could prevent another family from suffering such a tragedy.\" The couple watched from the public gallery at Holyrood on Thursday as Scottish Tory leader Russell Findlay highlighted their plight during First Minister's Questions. In response, John Swinney agreed to speak to Lord Advocate Dorothy Bain. He said: \"I will ask the Lord Advocate if there can be further dialogue with Mr and Mrs Inglis on the contents of the report to ensure that the issues about which they remain concerned can be properly and fully aired.\" The first minister, who has met the Inglis family previously, acknowledged there \"may well be issues about data handling\" that cause \"constraints on the release of the full report\". He added: \"If the report can be released, I am very happy for that to be the case.\" Read more from Sky News:Man killed and three others injured in helicopter crashTV presenter 'still in shock' after being attacked in street Mr Findlay branded the report \"damning\" as he backed the release of it in full. The MSP for West Scotland supports the family's call for a fatal accident inquiry (FAI). He is also calling for a review of a \"bail blindspot\" in the law which he claims is \"putting women and children in danger\" as there is \"no obligation to check the addresses where violent offenders are to be released on bail\". Mr Swinney noted it is for the Lord Advocate to independently decide whether an FAI should be held. And on the issue of bail, he highlighted recent legislation passed at the Scottish parliament which \"would provide the type of protection that Mr Finlay is looking for, and it is already in statute\". But the first minister added: \"I appreciate that is of absolutely no comfort to Mr and Mrs Inglis in the loss that they have suffered.\" After FMQs, Mr Findlay said: \"Claire's parents Fiona and Ian have spent four years fighting and indeed pleading for information. \"The way in which the Inglis family are being treated is disrespectful and cruel. The new expert report commissioned by the Crown Office is damning. \"Fiona and Ian have not been told the answer to critical questions because the Crown have only given them a brief summary. \"John Swinney should back the full release of this report and support the establishment of an FAI, so the Inglis family can finally get the answers they deserve.\" COPFS has been contacted for comment."
    },
    {
        "title": "First Minister John Swinney brands Reform councillor's Sharia law claims 'ludicrous, absurd and divisive'",
        "description": "Claims made by a Reform UK councillor that Sharia law is being brought to Glasgow have been branded \"ludicrous, absurd and divisive\" by Scotland's first minister.",
        "url": "https://news.sky.com/story/first-minister-john-swinney-brands-reform-councillor8217s-sharia-law-claims-ludicrous-absurd-and-divisive-13460621",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-john-swinney-snp-first-minister_7066805.jpg?20251030112331",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-30 11:05:00",
        "Headline": "Glasgow councillor Audrey Dempsey made the comments during an interview with Sky News Scotland correspondent Connor Gillies.",
        "Content": "Claims made by a Reform UK councillor that Sharia law is being brought to Glasgow have been branded \"ludicrous, absurd and divisive\" by Scotland's first minister. Glasgow councillor Audrey Dempsey made the comments during an interview with Sky News Scotland correspondent Connor Gillies. Speaking at a meeting of the party's local branch, Ms Dempsey said: \"When they arrived in this country and they were fitting in with our culture, our values and learning our way of life, that would be more than welcome.\" Questioned about what she meant by \"our way of life,\" she replied: \"Instead of coming and trying to inflict their culture on other people here, like Sharia law, for instance, they're trying to bring that here, that's just not something we celebrate.\" Pressed on who she believes is bringing Sharia law to Scotland, Ms Dempsey stated: \"The asylum seekers, some of the asylum seekers, the legal migrants.\"  Asked where it was happening, she responded: \"Do you not have conversations in the street?\" When pushed to clarify her position, Ms Dempsey said: \"You just have to take a walk through the streets of Glasgow city centre, any given day.\" \n                  Woman appears in court charged with murder after human remains found at Loch Lomond\n                 \n                  Two people dead and five others taken to hospital after fire in Glasgow\n                 \n                  Charity opens walk-in mental health hub in Glasgow\n                 Read more from Sky News:UK charters flights to get nationals out of JamaicaWestlife on 25 years of touring Ms Dempsey claimed there was \"stacks of evidence online,\" adding: \"These migrants are posting themselves, videos of them saying they're coming to the land of milk and honey, they're coming to take over.\" Asked to clarify if she believed migrants were coming to \"take over,\" Ms Dempsey added: \"I don't quite know what I believe at the moment.\" At Bute House in Edinburgh later on Thursday, First Minister John Swinney said he didn't \"believe for a moment\" migrants were bringing Sharia law to Scotland's biggest city. He stated: \"That's what I think is the danger of where we are just now, that absolutely ludicrous, absurd and divisive comments have been made by the far right that have the risk of undermining community cohesion in Scotland. \"Scotland has been a welcoming country, is a welcoming country, where we attach the greatest significance to cohesion within our communities. \"That's what my leadership in Scotland is all about, and I want to give that principled, values-based leadership that will resist those messages from the far right.\""
    },
    {
        "title": "Farage v Mahmood: Who is the Terminator?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/farage-v-mahmood-who-is-the-terminator-13460510",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-30 06:27:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 Rachel Reeves admits breaking housing rules after failing to get a licence to rent out her Dulwich home, but Keir Starmer says an apology is enough. A penny for Angela Rayner's thoughts - the former deputy prime minister and housing secretary who resigned following a row over her tax affairs - she too claimed she was wrongly advised. The prime minister and his chancellor face a nervous morning as opposition parties react. Plus, Sam's been inside The Spectator awards, where cabinet ministers Lucy Powell and Shabana Mahmood jovially took aim at some of their Labour colleagues - and Reform UK leader Nigel Farage vowed to take on Westminster's elite."
    },
    {
        "title": "Boris Johnson becomes third former Tory PM to criticise Kemi Badenoch's policies ",
        "description": "Boris Johnson has warned the Conservatives will not win the next election by \"bashing the green agenda\". ",
        "url": "https://news.sky.com/story/boris-johnson-becomes-third-former-tory-pm-to-criticise-kemi-badenochs-policies-13460479",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-boris-johnson-dubai_6826396.jpg?20251030013240",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-30 01:12:00",
        "Headline": "Baroness Theresa May says scrapping net zero targets is an \"extreme and unnecessary measure\", while Sir John Major fears it will \"alienate\" the electorate.",
        "Content": "Boris Johnson has warned the Conservatives will not win the next election by \"bashing the green agenda\".  Under Kemi Badenoch, the Tories have vowed to repeal the Climate Change Act - and scrap an \"impossible\" commitment to reach net zero by 2050 because it risks \"bankrupting\" the UK. Politics Hub: Latest updates from Westminster But in a new podcast, the former prime minister has described current arguments surrounding environmental policy as \"depressing\".  Mr Johnson claimed everyday voters aren't interested in anti-net zero policies - but simply want \"cheap green energy\" as they grapple with the cost-of-living crisis. \"I didn't see us soaring in the polls as a result of saying what rubbish net zero is. I didn't see a massive leap in support for the Conservatives,\" he told The Smart Society Show. He has become the third former Tory prime minister to criticise the party's opposition to policies designed to cut carbon emissions and reduce global warming. Earlier this week, Theresa May cautioned the Conservatives against using \"populism\" for \"short-term political ends\". In a wide-ranging speech to the House of Lords, she warned scrapping net zero policies was an \"extreme and unnecessary measure\" that would \"fatally undermine\" Britain's global leadership on climate issues - as well as jobs and investment generated by the transition. She told peers: \"This announcement only reinforces climate policy as a dividing line in our politics, rather than being the unifying issue it once was. \"And for the Conservative Party, it risks chasing votes from Reform at the expense of the wider electorate.\" Baroness May went on to highlight polling that suggests the British public are broadly supportive of eliminating carbon emissions.  A day later, Sir John Major also claimed the Conservative Party's current policies risk \"alienating\" the electorate. He said: \"We fare less well when moderate opinions are banished or - where maintained - tolerated and ignored. \"So - when our party says 'no' to Europe, 'no' to climate change, 'no' to overseas aid - it falls out with the majority of public opinion. \"Such policies may delight a minority of opinion, but not the broad mass of electors in our essentially tolerant and kindly nation.\" Read more politics news:Rachel Reeves apologises for rental 'mistake'Tories and Reform UK: From feud to love-in?  Mr Johnson had supported the UK's net zero targets during his time in Downing Street, and hosted Glasgow's COP26 summit back in 2021. But since leaving office, he has suggested he went \"far too fast\" on eco-friendly policies, especially considering energy prices rose following Russia's invasion of Ukraine. Speaking to the podcast, Mr Johnson said surging bills had been \"a big kick in the teeth\" that made it \"really tough for people like us to make the case for reducing CO2\". Nonetheless, the former PM insisted he had \"lost none of my zeal\" for net zero: \"I still fundamentally believe that it's the right thing to do, even if you can't get there as fast as we wanted to do.\" Looking ahead, he also warned that \"the vast demands of AI\" mean bills could keep on rising unless cheaper and more effective solutions are found."
    },
    {
        "title": "Before and after images of Jamaica show destruction left by Hurricane Melissa",
        "description": "The scale of the destruction left by Hurricane Melissa as it tore across Jamaica is now being revealed by the first photos taken by satellites.",
        "url": "https://news.sky.com/story/before-and-after-images-of-jamaica-show-destruction-left-by-hurricane-melissa-13460662",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jamaica-black-river_7066649.jpg?20251030081417",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-30 12:18:00",
        "Headline": "Satellite images show the impact the 185mph winds had on Jamaica after Hurricane Melissa made landfall on the island earlier this week.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The scale of the destruction left by Hurricane Melissa as it tore across Jamaica is now being revealed by the first photos taken by satellites. The eye of the storm made landfall on the southwest coast of the island, 75 miles from the capital Kingston, on Tuesday. Before and after images from Vantor's satellites show the impact of the 185mph winds on the town of Black River, the capital of St Elizabeth Parish. Use the sliders below to see the same areas of Jamaica before and after the hurricane struck. There is widespread damage. Some houses and businesses are without roofs, and others have been destroyed altogether. The covered food market is in ruins. So is St John Anglican church, one of the oldest in Jamaica - only its bell tower still stands.  Houses that lined the shore would have born the brunt of the storm surge. Further along the coast is the fishing village of White House. Streets have been reduced to piles of rubble. Trees have been stripped of their leaves by the wind. The west of Jamaica is the country's bread basket, important for growing food. But fields are underwater, flooded by up to a metre of rain that fell as the vast storm system passed over. Many crops will have been destroyed and the government has appealed for vegetable seeds so farmers can quickly plant crops again. Read more:What we know about Hurricane MelissaUK charters flights to transport Britons out of Jamaica On the northwest coast is the resort of Montego Bay. The container terminal and oil storage tanks in the port have been inundated by the storm surge and are surrounded by water. It's estimated that 400,000 people in Jamaica have been affected by the hurricane. And the cost of the devastation is immense. Estimates by hazard analysts Enki Research put the bill at £5.8bn. That's more than a third of Jamaica's GDP - a measure of its economic wealth. It will take months and international support to put Jamaica back on its feet."
    },
    {
        "title": "Climate change made Hurricane Melissa four times more likely, say scientists",
        "description": "Hurricane Melissa was made four times more likely by climate change, according to a study.",
        "url": "https://news.sky.com/story/climate-change-made-hurricane-melissa-four-times-more-likely-say-scientists-13460549",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hurricane-melissa-jamaica_7066606.jpg?20251030073011",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-30 09:05:00",
        "Headline": "It was one of the most powerful hurricanes ever recorded - and climate change increased it's intensity, analysis suggests.",
        "Content": " Hurricane Melissa was made four times more likely by climate change, according to a study. The category 5 hurricane that struck Jamaica on Tuesday, tore through the Caribbean with winds of up to 185mph and also hit Haiti, the Dominican Republic and Cuba, leaving dozens dead and widespread destruction. In Jamaica, AccuWeather estimated Melissa could cost $22bn in damages and economic loss and that rebuilding could take a decade or more. Researchers at Imperial College London estimated that in a world without climate change, a weaker hurricane would have been about 12% less damaging. They said human-caused global warming not only increased the intensity but also the likelihood of the powerful hurricane. They also found that climate change - caused primarily by the burning of oil, gas and coal - boosted Hurricane Melissa's wind speed by 7% (11mph).  In a cooler world without climate change, a Melissa-type hurricane would have made landfall in Jamaica once every 8,000 years, they said. But in today's climate, with 1.3C warming, it has become four times more likely with such an event now expected once every 1,700 years.  Jamaica now faces an enormous relief effort to help the roughly 400,000 people reportedly affected, in a country where 70% of its population live within 3.1 miles of the sea, the researchers said. Professor Ralf Toumi, director of the Grantham Institute at Imperial College London, said: \"Man-made climate change clearly made Hurricane Melissa stronger and more destructive. \"These storms will become even more devastating in the future if we continue overheating the planet by burning fossil fuels.\" Read more:Hurricane Melissa: Before and after images of JamaicaWhat we know about Hurricane MelissaUK charters flights to help transport Britons out of Jamaica   Co-author Dr Emily Theokritoff said: \"As we approach COP30, this is a stark reminder of both the economic logic of reducing emissions now and the moral imperative to rapidly scale up international finance for loss and damage and adaptation in the most vulnerable countries.\""
    },
    {
        "title": "TikTok accused of 'backtracking' on safety commitments ",
        "description": "TikTok is being accused of \"backtracking\" on its safety commitments, as it puts hundreds of moderator jobs at risk in its London office.&#160;",
        "url": "https://news.sky.com/story/tiktok-accused-of-backtracking-on-safety-commitments-13460627",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tiktok-protest_7024627.jpg?20250918210712",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-30 11:19:00",
        "Headline": "Dame Chi Onwurah MP has told TikTok proposed moderator redundancies \"bring into question\" its ability to protect users.",
        "Content": "\n          Science and technology reporter\n       TikTok is being accused of \"backtracking\" on its safety commitments, as it puts hundreds of moderator jobs at risk in its London office.  In August, the company announced that hundreds of jobs were at risk in its Trust and Safety offices. In an open letter to MPs, the Trades Union Congress (TUC) said on Thursday that TikTok is \"looking to replace skilled UK workers with unproven AI-driven content moderation and with workers in places like Kenya or the Philippines who are subject to gruelling conditions, poverty pay\". Sky News understands that a number of the 400+ moderators losing their jobs will be replaced by agency workers in other countries, as part of TikTok's efforts to streamline its trust and safety operations. TikTok's moderators in Dublin and Berlin have also reported they are at risk of redundancy. Now, the chair of the Science, Innovation and Technology Select Committee, Dame Chi Onwurah MP, has told the company the job losses \"bring into question\" TikTok's ability to protect users from harmful and misleading content. \"TikTok seem to be backtracking on statements it made only half a year ago,\" said Dame Chi. \n                  Abuser becomes first to be jailed for encouraging child to self-harm\n                 \n                  Denmark proposes social media ban for under-15s - as PM hits out at 'monster'\n                 \n                  Online safety laws to be toughened to make blocking of self-harm content a legal requirement\n                 \"This raises alarming questions not only about its accountability [...], but also about its plans to keep users safe. \"They must provide clarity urgently and answer key questions about its changes to its content moderation process, otherwise, how can we have any confidence in their ability to properly moderate content and safeguard users?\" She set a 10 November deadline for the firm to respond. In an exchange of letters with the social media giant, Dame Chi pointed out that as recently as February this year, TikTok's director of public policy and government, Ali Law, had \"highlighted the importance of the work of staff to support TikTok's [AI] moderation processes\". Read more from Sky News:Federal Reserve cuts interest ratesMicrosoft Azure outage hits thousands In the exchange that the committee published on Thursday, Mr Law said: \"We reject [the committee's] claims in their entirety, which are made without evidence. \"To be clear, the proposals that have been put forward, both in the UK and globally, are solely designed to improve the speed and efficacy of our moderation processes in order to increase safety on our platform.\" A TikTok spokesperson also told Sky News: \"As we laid out in our letter to the committee, we strongly reject these claims. \"This reorganisation of our global operating model for trust and safety will ensure we maximise effectiveness and speed in our moderation processes as we evolve this critical safety function for the company with the benefit of technological advancements.\" Last month, TikTok moderators told Sky News that young people in the UK may be exposed to more harmful content if the redundancies go ahead. \"If you speak to most moderators, we wouldn't let our children on the app,\" said one moderator, who asked to remain anonymous. He spoke to Sky News at a protest outside the company's UK headquarters. At the time, TikTok told Sky News they \"strongly reject these claims\"."
    },
    {
        "title": "Boris Johnson becomes third former Tory PM to criticise Kemi Badenoch's policies ",
        "description": "Boris Johnson has warned the Conservatives will not win the next election by \"bashing the green agenda\". ",
        "url": "https://news.sky.com/story/boris-johnson-becomes-third-former-tory-pm-to-criticise-kemi-badenochs-policies-13460479",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-boris-johnson-dubai_6826396.jpg?20251030013240",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-30 01:12:00",
        "Headline": "Baroness Theresa May says scrapping net zero targets is an \"extreme and unnecessary measure\", while Sir John Major fears it will \"alienate\" the electorate.",
        "Content": "Boris Johnson has warned the Conservatives will not win the next election by \"bashing the green agenda\".  Under Kemi Badenoch, the Tories have vowed to repeal the Climate Change Act - and scrap an \"impossible\" commitment to reach net zero by 2050 because it risks \"bankrupting\" the UK. Politics Hub: Latest updates from Westminster But in a new podcast, the former prime minister has described current arguments surrounding environmental policy as \"depressing\".  Mr Johnson claimed everyday voters aren't interested in anti-net zero policies - but simply want \"cheap green energy\" as they grapple with the cost-of-living crisis. \"I didn't see us soaring in the polls as a result of saying what rubbish net zero is. I didn't see a massive leap in support for the Conservatives,\" he told The Smart Society Show. He has become the third former Tory prime minister to criticise the party's opposition to policies designed to cut carbon emissions and reduce global warming. Earlier this week, Theresa May cautioned the Conservatives against using \"populism\" for \"short-term political ends\". In a wide-ranging speech to the House of Lords, she warned scrapping net zero policies was an \"extreme and unnecessary measure\" that would \"fatally undermine\" Britain's global leadership on climate issues - as well as jobs and investment generated by the transition. She told peers: \"This announcement only reinforces climate policy as a dividing line in our politics, rather than being the unifying issue it once was. \"And for the Conservative Party, it risks chasing votes from Reform at the expense of the wider electorate.\" Baroness May went on to highlight polling that suggests the British public are broadly supportive of eliminating carbon emissions.  A day later, Sir John Major also claimed the Conservative Party's current policies risk \"alienating\" the electorate. He said: \"We fare less well when moderate opinions are banished or - where maintained - tolerated and ignored. \"So - when our party says 'no' to Europe, 'no' to climate change, 'no' to overseas aid - it falls out with the majority of public opinion. \"Such policies may delight a minority of opinion, but not the broad mass of electors in our essentially tolerant and kindly nation.\" Read more politics news:Rachel Reeves apologises for rental 'mistake'Tories and Reform UK: From feud to love-in?  Mr Johnson had supported the UK's net zero targets during his time in Downing Street, and hosted Glasgow's COP26 summit back in 2021. But since leaving office, he has suggested he went \"far too fast\" on eco-friendly policies, especially considering energy prices rose following Russia's invasion of Ukraine. Speaking to the podcast, Mr Johnson said surging bills had been \"a big kick in the teeth\" that made it \"really tough for people like us to make the case for reducing CO2\". Nonetheless, the former PM insisted he had \"lost none of my zeal\" for net zero: \"I still fundamentally believe that it's the right thing to do, even if you can't get there as fast as we wanted to do.\" Looking ahead, he also warned that \"the vast demands of AI\" mean bills could keep on rising unless cheaper and more effective solutions are found."
    },
    {
        "title": "Man jailed after burgling Damien Hirst's studio while wearing GPS tag",
        "description": "A man who burgled one of Damien Hirst's studios and was caught by police who traced the movements of his GPS-enabled ankle tag has been jailed.",
        "url": "https://news.sky.com/story/man-jailed-after-burgling-damien-hirsts-studio-while-wearing-gps-tag-13460871",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-damien-hirst-gallery_7067208.jpg?20251030175906",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-30 18:48:00",
        "Headline": "Liam Middleton-Gomm broke into Thames Wharf Studios in west London on 30 June and stole around £5,130 of goods, including electronic items, clothing and a pram.",
        "Content": "A man who burgled one of Damien Hirst's studios and was caught by police who traced the movements of his GPS-enabled ankle tag has been jailed. Liam Middleton-Gomm broke into Thames Wharf Studios in west London on 30 June and stole around £5,130 of goods, including electronic items, clothing and a pram. The 36-year-old, of no fixed abode, smashed the window beside a fire exit and reached in to activate its shutter and enter the building, prosecutor Paul Andrews told Kingston Crown Court on Thursday. The burglar, who has dozens of previous convictions, had attended the studio twice that evening and went to his father's property with some of the stolen goods, the court heard. It is understood Middleton-Gomm stole multiple leather jackets that were being embellished, as well as trousers, embroidered shirts and a Dior pram with silver skulls on its wheels. Some of the property was sold on and has not been recovered. Middleton-Gomm's father, Leslie Gomm, 62, of Fulham, west London, previously pleaded guilty to handling stolen goods for his son's benefit. He was given a one-year conditional discharge on Thursday after having been in custody for three and a half months before his sentencing. The prosecution said Middleton-Gomm visited his father's property twice that evening, but Gomm did not know the studio was being burgled. Police charged the burglar after examining data from his GPS ankle tag and DNA at the scene, Mr Andrews told the court. Read more from Sky News:Man dies after helicopter crashDestruction in Jamaica revealed in satellite images Judge Martyn Barklem sentenced Middleton-Gomm to 32 months in prison. He said: \"You were actually wearing a GPS tag that was part of your licence conditions when you were carrying out these offences.\" He added: \"Your appalling previous record is of course a serious aggravating factor\". The court heard Middleton-Gomm has 39 previous convictions involving 83 offences, including multiple house burglaries. Middleton-Gomm had pleaded guilty to two counts of burgling Hirst's riverside studio. He was also sentenced for two house burglaries on 9 and 17 July, as well as the attempted burglary of a property on 9 July."
    },
    {
        "title": "'We're having the time of our lives': Westlife on 25 years of touring, family fame and fans",
        "description": "They were one of the main staples of noughties music in the UK and Ireland and to celebrate 25 years of touring, Westlife have returned to the spotlight again.",
        "url": "https://news.sky.com/story/were-having-the-time-of-our-lives-westlife-on-25-years-of-touring-family-fame-and-fans-13460513",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-westlife-ridgard_7066626.jpg?20251030074604",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-10-30 06:45:00",
        "Headline": "The boy band has released a new single called Chariot, with an album following suit in February and a tour that will take them around the world next year.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  They were one of the main staples of noughties music in the UK and Ireland and to celebrate 25 years of touring, Westlife have returned to the spotlight again. The boy band has released a new song called Chariot, with an album following suit in February and a tour that will take them around the world next year. \"The Westlife story is fairy tale stuff and we're very lucky and proud to be part of it\", Shane Filan tells Sky News at the Royal Albert Hall, where they have just performed for two nights. \"It took our breath away. We came out to the Royal Albert Hall thinking it might be a little bit more intimate than a big arena and just the sheer noise, the sheer screams from the women and everyone just having good fun. \"The support and love, we never felt it like we did in the room. It was amazing.\" Formed by their manager Louis Walsh in the late 1990s, the group originally consisted of Filan, Mark Feehily, Brian McFadden, Nicky Byrne and Kian Egan. McFadden left the group in 2004 to pursue a solo career, but the other four have remained together. Due to health issues, Feehily can't join the celebrations, but representatives say he is still very much part of the band and features on their new music and upcoming album. History-making chart successes Westlife are joint third with Sir Cliff Richard and Ed Sheeran for the most UK number one singles in history, just behind Elvis and The Beatles. In their first 18 months, they secured seven of those top spots thanks to songs like Flying Without Wings, I Have A Dream and If I Let You Go. Reflecting on the years gone by, Byrne says the nostalgia hits harder than ever. \"You see the generations coming to the shows, people letting their hair down, people remembering the songs from their first kiss, the first dance, all those special things that music does,\" he says. \"Not even just for the fans - we're having the time of our lives. \"We're singing these songs up there... I remember breaking the wardrobe door when we were promoting Swear It Again, and now we're singing it in front of the Royal Albert Hall and look, I mean, just look at this place.\" Famous fans and furniture For Byrne, finding out about fans of their music never gets old, and their song Flying Without Wings seems to be a key component of their stature in music. \"I did Soccer Aid with Tom Grennan recently, and he was talking all about how he grew up listening to Westlife - his dad is Irish. Big Zuu, who scored the winning goal, he was like, 'Flying Without Wings, man, is the best song I've ever heard'.\" It's the same song Sheeran first learned to play guitar on, and years later, he began writing songs for the group, including their latest single Chariot. Oddly, it's their choice in furniture that receives just as much attention as their music over the years, with four stools becoming synonymous with the group. Stemming from their lack of dancing skills, according to Simon Cowell at least, they chose to change it up and simply rise from their chair on the key change of the song. \"We are stool connoisseurs. It's become a very strange thing and it's nearly as big as our music. It's genuinely as big as You Raise Me Up,\" Filan laughs. Keeping their kids grounded As the band continued to release music, each member settled down and had families of their own. Now their children are around the same age they were when they first started as a group. Egan says they all made a conscious decision to raise the next generation away from the spotlight. \"We don't want our kids growing up in this world and at the end of the day they are privileged, so it's really important for us to keep them grounded and to try and give them as much of a natural kind of upbringing as they possibly can, and I think that's why we choose to bring them up in the same places that we grew up,\" he adds. Byrne chimes in jokingly: \"Slightly bigger houses, though!\" It was this tour that caused Byrne's children to realise the extent of their father's fame. \"I have twin boys who are 18 and a half, and the middle girl is 12. So last week, when the tour went on sale in Ireland, and we went from five nights in the 3Arena to 13, and from Belfast it went from three right up to seven, and the boys are looking at me, going, 'You're doing 13 nights in the 3Arena'. \"And it is even me looking at them going, 'Yeah, right'. It hits you, it hits you there in a way, to be honest with you. I got a little bit cooler then.\" Read more from Sky News:Five new arrests in Louvre heist investigationJohn Cleese leads tributes to Fawlty Towers star Running from September 2026, Westlife 25 - The Anniversary World Tour, will kick off in Dublin for 13 shows before heading to Aberdeen, Glasgow, Newcastle, Leeds, Sheffield, London, Brighton, Bournemouth, Birmingham, Cardiff, Manchester and then Belfast for seven nights. Gigs in Paris, Hamburg, Copenhagen, Stockholm, Amsterdam, Antwerp, Cologne and Zurich will follow. Tickets for Westlife's UK tour dates go on sale this Friday."
    },
    {
        "title": "Presenter Kirsty Gallacher 'still in shock' after being attacked in street",
        "description": "Kirsty Gallacher has been flooded with well wishes from famous friends after a stranger attacked her in central London.",
        "url": "https://news.sky.com/story/presenter-kirsty-gallacher-8216still-in-shock8217-following-attack-as-famous-friends-offer-support-13460632",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kirsty-gallacher-gallacher_7066810.jpg?20251030113108",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-30 11:09:00",
        "Headline": "The presenter said she was kicked like a 'football' by a man 'dressed all in black' as she walked to her car on her way home in central London.",
        "Content": "Kirsty Gallacher has been flooded with well wishes from famous friends after a stranger attacked her in central London. The former Sky Sports News presenter said a man dressed \"all in black, covered up\" walked towards her before physically assaulting her in the street. The unprovoked attack happened at around 7pm on Tuesday as she walked to her car on her way home, with the streets lit and other people nearby. Ms Gallacher, who currently presents Global's Gold Radio Drive, appeared tearful in an Instagram video posted on Wednesday evening, saying she was attacked during the walk she takes \"most nights\". \"I was walking on the pavement and I noticed this guy all in black covered up, just walking at me, and I'm always vigilant, and he was just walking towards me, and I thought 'this is not right,' so I moved out of the way,\" she said. \"Then he brushed past me, he turned around and he kicked me - like he was kicking a football - he kicked me in the middle of a street at about seven o'clock last night in front of people. I turned around and he scarpered.\" Famous friends were quick to offer support, with Celebrity Traitors star Kate Garraway replying: \"This is awful - am so sorry - very brave in sharing such an important message but hope YOU are okay?\" \n                  'Huge moment in world history' as Andrew loses titles - and will be kicked out of royal home\n                 \n                  Andrew pays the ultimate price after years of public disdain\n                 \n                  Andrew loses his titles - everything we know\n                 ITV's This Morning co-presenter Ben Shephard wrote: \"Kirsty, so, so sorry to hear this. Sending tons of love and support.\" Former super-middleweight world champion boxer Carl Froch said: \"Disgraceful! Wish I was there, he can't run when he's been rendered unconscious.\" Read more from Sky News:Uxbridge triple stabbing suspect charged with murderGroup considering private prosecution against Prince Andrew TV presenter Lisa Snowdon said: \"Oh, Kirsty. I'm so angry and so utterly devastated that this happened to you. It's horrific. I'm sending you a huge hug, my love.\" Radio and TV presenter Jenni Falconer said: \"Kirsty, this is awful. I'm so sorry you experienced this. And not okay. Big love to you.\" 'Still shocked' Ms Gallacher said she is always \"very vigilant\" when out, taking precautions such as wearing a cross-body bag and keeping her hands free. She said she \"couldn't have done more to protect herself\". \"I'm still shocked now, and I have the bruises to prove it, I'm afraid,\" she said. A group of girls helped Ms Gallacher, but a nearby security guard \"did nothing,\" she added. \"I just stood there and I just couldn't actually believe that someone, a stranger, has just decided, for whatever reason - whether he's got a problem with women, whether he's just an opportunist - he decided he did not like me and he just thought 'nah, I'll give you the boot'. \"You always think it's not going to happen to me, and that was me.\""
    },
    {
        "title": "Five new arrests in Louvre heist investigation - with one suspect 'traced via DNA'",
        "description": "Five new arrests have been made in the investigation into the Louvre jewellery heist, the prosecutor for Paris has said.",
        "url": "https://news.sky.com/story/five-new-arrests-in-louvre-heist-investigation-report-13460529",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-paris-france-robbery_7058172.jpg?20251022104355",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-30 07:27:00",
        "Headline": "There have now been a total of seven arrests over the daring heist at the world-famous Paris museum on 19 October. ",
        "Content": "Five new arrests have been made in the investigation into the Louvre jewellery heist, the prosecutor for Paris has said. French radio station RTL reported the arrests on Thursday, following an interview with Laure Beccuau. The Paris prosecutor's department shared the interview on social media with the caption: \"Louvre Burglary: Five New Suspects Apprehended.\" In the interview, Ms Beccuau said one of the five suspects was identified through DNA traces left at the crime scene, but she added that it was \"too early\" to comment further on the suspects' identities. All five were arrested in coordinated raids in Paris and its surrounding areas late Wednesday, but searches overnight \"did not allow us to find the goods\", Ms Beccuau said. It comes after the prosecutor said two suspects arrested over the jewellery heist had \"partially\" confessed to their involvement in the robbery.  Four thieves stole nine items - one of which was dropped and recovered at the scene - in a heist pulled off while the world-famous Paris museum was open to visitors on 19 October. It took the thieves less than eight minutes to steal the jewels worth £76m. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift.  Ms Beccuau urged the thieves to return the French crown jewels on Wednesday. \"These jewels are now, of course, unsellable,\" she said. \"Anyone who buys them would be guilty of concealment of stolen goods. It's still time to give them back.\" Regarding the two suspects in custody since Saturday, Ms Beccuau previously revealed that one is a 34-year-old Algerian national who has been living in France since 2010. He was arrested Saturday night at Charles de Gaulle airport as he was about to fly to Algeria with no return ticket. Ms Beccuau said that he was living in the northern Paris suburb of Aubervilliers, and was known to police mostly for road traffic offences. His DNA was found on one of the scooters used by the thieves to leave the scene, according to the prosecutor. The other suspect, 39, was arrested Saturday night at his home in Aubervilliers. \"There is no evidence to suggest that he was about to leave the country,\" said Ms Beccuau. The man was known to police for several thefts, and his DNA was found on one of the glass cases where the jewels were displayed, and on items the thieves left behind, she added. The heist exposed major gaps in the Louvre's security, with Paris police chief Patrice Faure telling politicians that ageing security systems had left weak spots. Read more from Sky News:How the Louvre investigation is unfolding'Race against time' as police try to recover 'priceless' jewels'Matter of time' before thieves struck, expert says \"A technological step has not been taken,\" he said. Mr Faure also revealed that the Louvre's authorisation to operate its security cameras quietly expired in July and had not been renewed. He said the first alert to police came not from the Louvre's alarms, but from a cyclist outside who dialled the emergency line after seeing helmeted men with a basket lift."
    }
]