[
    {
        "title": "Democrats release more photos from Epstein estate showing Trump, Clinton, Andrew and others",
        "description": "Donald Trump, Andrew Mountbatten-Windsor and Bill Clinton are among high-profile figures pictured in a new selection of photos from Jeffrey Epstein's estate, released by Democrats in Congress.",
        "url": "https://news.sky.com/story/whos-pictured-in-the-newly-released-photos-from-epstein-estate-13482625",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-epstein-files_7108618.jpg?20251212211540",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 16:17:00",
        "Headline": "The photos were shared by House Oversight Committee Democrats, who said they are reviewing more than 95,000 images from the estate.",
        "Content": " Donald Trump, Andrew Mountbatten-Windsor and Bill Clinton are among high-profile figures pictured in a new selection of photos from Jeffrey Epstein's estate, released by Democrats in Congress. Warning: This article contains images of a sexual nature that some readers may find offensive. An initial tranche of 19 photos was shared on Friday, and all of the people whose faces had not been redacted were identified by Sky News. They have been contacted for comment. A second batch of dozens of photos was released the same day, including one of former Israeli prime minister Ehud Barak and another of Epstein himself in the bath. Latest updates from release of Epstein photos The photos were shared by House Oversight Committee Democrats, who said they are reviewing more than 95,000 images from the estate. There is no suggestion of wrongdoing on the part of those pictured in the images released on Friday and the context surrounding the photos is not known. Mr Barak told the New York Times this week: \"I now deeply regret having any association with him. \"However, not any point in my dealings with him I did ever witness any improper behaviour and certainly I never participated in anything like that.\" In one image, Mr Trump is seen with the late sex offender Jeffrey Epstein and Belgian model Ingrid Seynhaeve. Two further photos show the US president with women whose faces are redacted. One image is black and white and shows him with six women; three on either side of him. The other is out of focus, and shows him sitting alongside an unidentified woman.  Asked about the latest photos, the US president told reporters at the White House: \"He [Epstein] was all over Palm Beach. He has photos with everybody. I mean, almost - there are hundreds and hundreds of people that have photos with him. So that's no big deal.\"  White House spokeswoman Abigail Jackson said the Trump administration \"has done more for Epstein's victims than Democrats ever have\". \"It's time for the media to stop regurgitating Democrat talking points and start asking Democrats why they wanted to hang around Epstein after he was convicted,\" she added. Speaking after Epstein took his own life in jail in 2019, Mr Trump admitted knowing Epstein, but added: \"I had a falling out with him. I haven't spoken to him in 15 years. I was not a fan of his, that I can tell you.\" In July, the White House also released a statement saying Epstein had been banned from Trump's Mar-a-Lago resort in Florida for acting like a \"creep\". In 2019, a spokesperson for the former US president said he had \"not spoken to Epstein in well over a decade\" and \"knows nothing about the terrible crimes\". In other photos released on Friday, Bill Clinton is seen with Epstein and convicted sex offender Ghislaine Maxwell, as well as singer Jimmy Buffett and Mr Buffett's wife Jane Slagsvol. Further images show Epstein with long-time Trump ally, Steve Bannon. In one he sits across from him at his desk, while in another the men are seen side-by-side taking a selfie in a mirror. Mr Bannon appeared again in the later batch of images, photographed alongside Noam Chomsky, an American professor perhaps best known for his political activism.  Hollywood filmmaker Woody Allen appears in four photos; two of them taken with Epstein. In another, Allen is photographed with Mr Bannon, while one more shows him sat with Bill Clinton's former treasury secretary, Larry Summers, and his wife Elisa New, seemingly on a private plane. Speaking to The Times in September, Allen said he had been to dinner at Epstein's home, but suggested he was unaware of the nature of his crimes. Allen said: \"He told us he'd been in jail and that he had been - I can't remember the word - but that he'd been falsely put in jail in some way.\" Meanwhile, Mr Summers told the Harvard Crimson that his former association with Epstein was \"a major error of judgement\". Andrew Mountbatten-Windsor, then Prince Andrew, is seen just once, alongside tech billionaire Bill Gates. Epstein is not pictured. The original photo at a malaria summit also shows the then Prince Charles but he is cropped out of the version released by the Democrats. It is not clear why the picture has been included in the Epstein files. Andrew relinquished his titles in October amid continued controversy over his friendship with Epstein, but said at the time: \"I vigorously deny the accusations against me\". Mr Gates himself appears twice more, once alongside Epstein's long-time pilot, Larry Visoski, and once in a framed photo which appears in an image above a black cabinet. In 2021, the tech billionaire told the New York Times he had met Epstein to discuss philanthropy and Gates's spokeswoman said he regretted ever meeting him. The following year Mr Gates told the BBC: \"I made a mistake ever meeting with Jeffrey Epstein. \"Any meeting I had with him could be viewed as almost condoning his evil behaviour. So, that was a mistake.\" Another photo shows British entrepreneur Richard Branson with Epstein and Dean Kamen, an American engineer, inventor, and businessman. Epstein is seen with his lawyer, Alan Dershowitz, in one more image. Mr Dershowitz said he fell out with Epstein after making a plea deal for him in 2007, leading to his conviction. He told the Harvard Crimson in November: \"Jeffrey Epstein despised me after I had made the deal. Epstein and I did not get along personally after I represented him and helped get the deal.\" Emirati businessman Ahmed bin Sulayem is also among those pictured, appearing twice in the second cache of photos. A number of images of a sexual nature appear in the first cache. One shows a bowl of novelty condoms with a caricature of Trump's face, each one bearing the phrase \"I'm HUUUUGE!\" A handwritten sign reads: \"Trump condom $4.50.\" Various sex toys are also featured in pictures, including a glove with ribbed fingers, and a safety notice from a \"jawbreaker\" gag warning of the risk of injury or death. Many of the newer batch of photos appear to show parts of Epstein's properties, including a toilet, various service areas, and a small beachfront construction project. Among the photos are several additional images which are thought to be from the disgraced financier's private island, Little Saint James, showing a dental suite previously seen in an earlier release of pictures. The images, obtained from the Epstein estate, were released by Democrats on the House Oversight Committee in a bid to pressure the US Justice Department to release the full Epstein files. President Trump signed a bill in November compelling the department to release case files within 30 days, in a U-turn after he opposed the bill for months. The end of that window is Friday 19 December. The images released on Friday were described by Democrats as being \"of the wealthy and powerful men who spent time with Jeffrey Epstein\" and \"photographs of women and Epstein properties\". A spokesperson for the Republican-led House Oversight Committee accused the Democrats of \"cherry-picking photos and making targeted redactions\" to create a \"false narrative\" about Donald Trump. \"Democrats' hoax against President Trump has been completely debunked,\" they added."
    },
    {
        "title": "King reveals 'good news' in his battle with cancer and urges people to get checked",
        "description": "The King has revealed that, thanks to early diagnosis, his cancer treatment can be reduced in the new year.",
        "url": "https://news.sky.com/story/king-reveals-good-news-in-his-battle-with-cancer-and-urges-people-to-get-checked-13482580",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-king-charles-chatfield_7072709.jpg?20251105121542",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 15:23:00",
        "Headline": "Charles says his treatment will be reduced next year thanks to his \"adherence to doctors' orders\" and early diagnosis.",
        "Content": " The King has revealed that, thanks to early diagnosis, his cancer treatment can be reduced in the new year. In a televised address, Charles said his \"good news\" was \"thanks to early diagnosis, effective intervention and adherence to doctors' orders\". \"This milestone is both a personal blessing and a testimony to the remarkable advances that have been made in cancer care in recent years,\" he added. \"Testimony that I hope may give encouragement to the 50% of us who will be diagnosed with the illness at some point in our lives.\" The King announced in February 2024 that he had been diagnosed with cancer and was beginning treatment. The monarch postponed all public-facing engagements, but continued with his duties as head of state behind palace walls, conducting audiences and Privy Council meetings. He returned to public duties in April last year and visited University College Hospital Macmillan Cancer Centre in central London with the Queen and discussed his \"shock\" at being diagnosed when he spoke to a fellow cancer patient. \n                  Prostate cancer treatment with potential for fewer side effects to be trialled in UK\n                 \n                  Why prostate cancer is expected to be left as the only major cancer without national screening\n                 \n                  Prostate cancer: NHS screening programme could come one step closer today\n                 Sources suggested last December his treatment would continue in 2025 and was \"moving in a positive direction\". The King has chosen not to reveal what kind of cancer he has been treated for. Palace sources have partly put that down to the fact that he doesn't want one type of cancer to appear more significant or attract more attention than others. In a statement after the speech aired, a Buckingham Palace spokesperson said: \"His Majesty has responded exceptionally well to treatment and his doctors advise that ongoing measures will now move into a precautionary phase.\" Sir Keir Starmer praised the video message as \"a powerful message,\" and said: \"I know I speak for the entire country when I say how glad I am that his cancer treatment will be reduced in the new year. \"Early cancer screening saves lives.\"  Early detection can give 'the precious gift of hope' His message on Friday was broadcast at 8pm in support of Stand Up To Cancer, a joint campaign by Cancer Research UK and Channel 4. In an appeal to people to get screened for the disease early, the King said: \"I know from my own experience that a cancer diagnosis can feel overwhelming. \"Yet I also know that early detection is the key that can transform treatment journeys, giving invaluable time to medical teams - and, to their patients, the precious gift of hope. These are gifts we can all help deliver.\" Charles noted that \"at least nine million people in our country are not up to date with the cancer screenings available to them,\" adding: \"That is at least nine million opportunities for early diagnosis being missed. \"The statistics speak with stark clarity. To take just one example: When bowel cancer is caught at the earliest stage, around nine in ten people survive for at least five years. \"When diagnosed late, that falls to just one in ten. Early diagnosis quite simply saves lives.\" Royal correspondent This is a rare but positive update. The King in his own words speaking about his cancer.  And it's good news. Since his diagnosis, he's received weekly treatment. His work schedule has had to fit around the appointments. And while it's not stopping, it is being significantly reduced. He's responded well, and his recovery has reached, we understand, a very positive stage. The King's decision to speak publicly and so personally is unusual. He has deliberately chosen the moment, supporting the high-profile Stand Up To Cancer campaign, and the launch of a national online screening checker. It still hasn't been revealed what kind of cancer he has. And there's a reason - firstly, it's private information. But more importantly, the King knows the power of sharing his story. And with it, the potential to support the wider cancer community.\n We are once again seeing a candid openness from the Royal Family. Earlier this year, the Princess of Wales discussed the ups and downs of her cancer journey. These moments signal a shift towards greater transparency on matters the Royal Family once kept entirely private. For millions facing cancer, the King's update is empathy and encouragement from someone who understands. And after months of uncertainty, for the King himself, some relief and reassurance. Minor inconvenience of screening 'a small price to pay' The King acknowledged that people often avoid screening \"because they imagine it may be frightening, embarrassing or uncomfortable\". But, he added: \"If and when they do finally take up their invitation, they are glad they took part. \"A few moments of minor inconvenience are a small price to pay for the reassurance that comes for most people when they are either told either they don't need further tests, or, for some, are given the chance to enable early detection, with the life-saving intervention that can follow.\" Read more from Sky News:Christmas tree chopped down hours after lights switch-onMore photos from Epstein's estate releasedTaylor Swift breaks down in tears over Southport attacks Giving his \"most heartfelt thanks\" to doctors, nurses, researchers and charity workers, the King added: \"As I have observed before, the darkest moments of illness can be illuminated by the greatest compassion. But compassion must be paired with action. \"This December, as we gather to reflect on the year past, I pray that we can each pledge, as part of our resolutions for the year ahead, to play our part in helping to catch cancer early. \"Your life - or the life of someone you love - may depend upon it.\""
    },
    {
        "title": "Judge 'haunted' by attack on victim as Eastern European grooming gang is jailed",
        "description": "Five men who were part of an Eastern European grooming gang, targeting teenage girls in Gateshead, have been jailed.",
        "url": "https://news.sky.com/story/judge-haunted-by-attack-on-victim-as-eastern-european-grooming-gang-is-jailed-13482697",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-composite-gang_7108574.jpg?20251212203601",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 19:33:00",
        "Headline": "Newcastle Crown Court heard the victims, all girls aged between 13 and 15, were exploited in Gateshead by a gang of Romanian and Albanian men.",
        "Content": "Five men who were part of an Eastern European grooming gang, targeting teenage girls in Gateshead, have been jailed. During an eight-week trial at Newcastle Crown Court, the four Romanians and an Albanian were found guilty of 31 charges involving six victims between 2014 and 2019 in October. The girls, aged between 13 and 15, were sometimes plied with alcohol or cocaine before they were sexually abused and raped. The court heard the victims were targeted by teenage boys, just a few years older than them, with the girls sometimes thinking they were in a relationship, before older men exploited them. The gang were jailed on Friday for between 18 months and 14 years. The court heard some of the offending centred around Saltwell Park where the men would meet to play football. During sentencing remarks, Judge Tim Gittins paid tribute to all the victims' courage and resilience by coming forward. \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  Metropolitan police chief accuses Trump of talking 'nonsense' about London crime\n                 \n                  Man found guilty of murdering wife in rare retrial\n                 'Nothing less than haunting' He described a statement from one of the victims, who was sexually exploited after becoming addicted to cocaine, as \"nothing less than haunting\" after the men \"deeply traumatised her and psychologically scarred her\". She said she was \"petrified of all men\". She added: \"I don't know if I will ever lead a normal life.\" Another victim said in a statement: \"I was naive and impressionable, and it made it easy for me to be preyed upon.\" The court also heard another victim describe the control her attacker had on her. \"It was like he had a spell on me... it was like I was held hostage and had to play a role.\" Read more from Sky News:Man guilty of murder in rare retrialMet chief accuses Trump of 'nonsense'King discusses battle with cancer Senior Investigating Officer Detective Chief Inspector Graeme Barr, of Northumbria Police, thanked the victims for their \"composure and dignity\". \"This was a complex investigation which took time to piece together and establish the extent of the horrific offending. \"The girls had their childhood snatched from them in the cruellest of ways by predators who targeted them as vulnerable members of our community.\" Jailed for up to 14 years Four Romanians, all with addresses in Gateshead, were sentenced on Friday: Bogdan Gugiuman, 44, was jailed for 14 years for rape and supplying a class A drug. Codrin Dura, 27, received a sentence of 13 years after being found guilty of rape, sexual activity with a child, blackmail, attempted rape, serious sexual assault, supplying a class A drug and arranging or facilitating commission of a child sex offence. Leonard Paun, 23, was jailed for five years and one month for rape, arranging or facilitating commission of a child sex offence, sexual activity with a child, sexual assault, supplying a class A drug and distributing photos of a child. Stefan Ciuraru, 22, who was found guilty of four counts of sexual assault, sexual activity with a child and causing or inciting a child to engage in sexual activity. He was jailed for 18 months. In addition, Albanian Klaudio Aleksiu, 28, from Windsor, was jailed for six years for rape. The sentencing took into account that Aleksiu, Dura, and Paun were all juveniles at the time of offending. A sixth man was found not guilty of all charges he faced. The judge added that the men's nationality was \"irrelevant to the sentencing process\" but pointed out that \"the information the court has is you all came to this country legally, most as children, and have stayed legitimately\"."
    },
    {
        "title": "Sudan: UK sanctions four paramilitary commanders over 'mass killings'",
        "description": "The UK has sanctioned senior commanders of Sudan's Rapid Support Forces (RSF) over suspected heinous violence including mass killings, systematic sexual violence and deliberate attacks on civilians.",
        "url": "https://news.sky.com/story/sudan-uk-sanctions-four-paramilitary-commanders-over-mass-killings-13482703",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-rsf-darfur_7048447.jpg?20251011155616",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-12-12 19:50:00",
        "Headline": "Abdul Rahim Hamdan Dagalo was responsible for \"grave breaches\" of humanitarian law, the UK said, among them mass killings, ethnically targeted executions, and sexual violence including gang rape.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  The UK has sanctioned senior commanders of Sudan's Rapid Support Forces (RSF) over suspected heinous violence including mass killings, systematic sexual violence and deliberate attacks on civilians. The commanders were designated on Friday after documented atrocities committed by RSF troops in El Fasher, the capital of North Darfur. Deputy commander Abdul Rahim Hamdan Dagalo, the brother of RSF leader Mohamed Hamdan \"Hemedti\" Dagalo, is among four commanders of the paramilitary group that will face asset freezes and travel bans. Hemedti himself is not on the list of sanctions. El Fasher was captured by the RSF on 26 October after an 18-month siege against the Sudanese Armed Forces (SAF). The RSF co-ordinated a campaign of enforced starvation, shelling and drone strikes with widespread civilian casualties. In September, Sky News travelled to North Darfur and reported on volunteers being killed and arrested by the RSF for attempting to smuggle food and medicine into the city at the height of the siege. Food smuggling co-ordinators told us they had no choice but to try to save the city from \"a slow genocide\". Other volunteers pleaded with us to urge the world to save Darfur and condemned the \"inhumanity\" of the global apathy. Many of the people we met in North Darfur lost loved ones to the RSF's violent takeover of the city. After the capture of El Fasher, sometimes spelled Al Fashir, RSF fighters filmed themselves killing civilians in the fields around the city as they attempted to flee. \n                  Sudan's RSF says it has captured Babanusa in West Kordofan \n                 \n                  Sudan 'epicentre of suffering in the world', says UN humanitarian chief\n                 \n                  Sudan's paramilitary forces agree to US-led proposal for humanitarian ceasefire\n                 A Sky News investigation with Lighthouse Reports and Sudan War Monitor revealed that hundreds of civilians were rounded up in school yards in a town bordering the road out of the city. A survivor told us they were forced to bury with their own hands fellow captives who were killed by the RSF on the basis of ethnicity. Satellite images analysed by Sky News found that an existing cemetery in Gurnei was extended in the days that followed 26 October, corresponding with testimony of new burials. Yale Humanitarian Labs analysed high-resolution satellite imagery from the streets of El Fasher in the days after the RSF capture. Their analysis showed objects in the streets that correspond with corpses and large red-coloured stains likely to be blood. A civilian who escaped the slaughter told us they were stepping over bodies on their way out of the city. An RSF insider said that at least 7,000 people were killed by their troops in the first five days of capture and that sanctioned RSF deputy commander Abdul Rahim Dagalo commanded the entire operation. Celebratory footage shared by the RSF shows him in the city only hours after it fell. In a document naming the sanctioned individuals, the UK government said Dagalo was responsible for engaging in, supporting, or promoting \"serious violations of international humanitarian law in Sudan\". Read more:Genocide is unfolding in Darfur, warns Sudanese government63 children killed in attacks on Sudan kindergarten and hospital These \"grave breaches\" comprise \"the mass killings of civilians; ethnically targeted executions; sexual violence, including gang rape; abductions for ransom; widespread arbitrary detentions; and attacks on health facilities, medical staff and humanitarian workers\". Also sanctioned was major general Osman Mohamed Hamid Mohamed, the head of the RSF's Operations Department, as well as brigadier general Al-Fateh Abdullah Idris and field commander Tijani Ibrahim Moussa Mohamed. The RSF has been battling the Sudanese Armed Forces (SAF) for control of Sudan since April 2023. The paramilitary group held the capital Khartoum for two years before it was recaptured by the army in March. Fighting pivoted to Darfur as the RSF tightened its siege on El Fasher and massacred the nearby Zamzam displacement camp before closing in on the city. The epicentre of the war has now shifted to three fronts in the southwest Kordofan, threatening to tear Sudan into two. The RSF has made recent gains; seizing the key city of Babanusa in West Kordofan - a railway city that connects the west, east, south and north of the country - and the oil-rich town of Heglieg on the border with Sudan's South Kordofan State and South Sudan."
    },
    {
        "title": "Man found guilty of murdering wife in rare retrial",
        "description": "A 52-year-old carpenter from Surrey has been found guilty of murdering his wife in a rare retrial, eight years after being acquitted.",
        "url": "https://news.sky.com/story/man-found-guilty-of-murdering-wife-in-rare-retrial-13480936",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-robert-rhodes-surrey-police_7108187.jpg?20251212122548",
        "type": "Home",
        "Author": "Amelia Harper",
        "Date Published": "2025-12-12 11:34:00",
        "Headline": "Robert Rhodes killed his estranged wife, Dawn Rhodes, by slitting her throat with a knife at their family home in Redhill, Surrey, in June 2016.",
        "Content": "\n          Home news correspondent\n              @AmeliaHarperTV\n  A 52-year-old carpenter from Surrey has been found guilty of murdering his wife in a rare retrial, eight years after being acquitted. Robert Rhodes killed his estranged wife, Dawn Rhodes, by slitting her throat with a knife at their family home in Redhill, Surrey, in June 2016. The couple's marriage had broken down and he had filed for a divorce. He was previously found not guilty after a trial at the Old Bailey in 2017, where he convinced jurors that he had acted in self-defence during an argument. It has since emerged that this was a \"cover-up\", after the couple's child came forward with new evidence that Rhodes killed Ms Rhodes, and they were involved in the murder too. In 2021, the child, who was under the age of 10 at the time of the murder, told police they had been manipulated into lying about the true version of events by their father. Both Rhodes and the child were found with knife wounds at the scene, which were initially claimed to have been inflicted in an attack by Ms Rhodes. The child's new account stated that after Rhodes killed his wife, he inflicted two wounds to his scalp before instructing the child to inflict two more on their father's back. He then cut his own child's arm so deeply that it required stitches under general anaesthetic. Under the double jeopardy rule a person cannot be tried twice for the same crime, unless new and compelling evidence comes out after an acquittal or conviction for serious offences. On Friday, jurors at Inner London Crown Court convicted Rhodes of murder and child cruelty. He was also found guilty of perverting the course of justice and two counts of perjury. Rhodes will be sentenced on 16 January. The double jeopardy rule is a legal principle that prevents a person from being tried twice for the same crime after they have been acquitted or convicted.  It's a protection for that person from harassment. However, the law permits a retrial where someone was acquitted of a serious offence, but new and compelling evidence has since come to light which indicates the person might actually be guilty.  In this case, the new evidence from the child was compelling enough for the Court of Appeal to quash the acquittal and a retrial to take place. \n Crucially, the child's evidence was so compelling that the Court of Appeal agreed Rhodes needed to be tried again. Surrey Police told Sky News that the child, who was of primary school age at the time and is below the age of criminal responsibility, was \"groomed\" by Rhodes into lying. The child told police that during supervised contact with Rhodes in 2016 and 2017 - while he was on bail after being charged with murder - he had told them that they had \"got some things wrong\" and continued to give them instructions to stick to the plan.  Rhodes even hid a phone at his mother's house for when the child visited, on which he would leave messages for the child. Detective Chief Inspector Kimball Edey said: \"During the first trial, Dawn was portrayed as the villain but had actually been a victim of domestic abuse and coercive control at the hands of her husband for years. \"The fact that Rhodes not only murdered his wife in cold blood but then manipulated and groomed his own child to play a part in his evil scheme and cover-up what he had done is simply despicable - not only did he take a life; he irreparably damaged another, as well as the lives of everyone else who loved Dawn.\"  2 June 2016 - Dawn Rhodes killed 5 June 2016 - Robert Rhodes charged with murder 2 May 2017 - first trial begins 30 May 2017 - not guilty verdict 18 November 2021 - child gives therapist new account Late November 2021 - police reopen case 4 June 2024 - Robert Rhodes rearrested and charged the next day 7 November 2024 - Rhodes's acquittal quashed  2 October 2025 - second trial begins The Crown Prosecution Service said \"the child's part in the plan was that they would distract the mother by saying to the mother 'hold out your hands, I've got a surprise for you', and the child would then put a drawing into the hands of the mother\".   Rhodes then cut his wife's throat. She was found lying face down in a pool of blood in the dining room. Libby Clark, specialist prosecutor for the Crown Prosecution Service's south east area complex casework unit, said the child showed \"great bravery and strength\" in coming forward with the truth. She said: \"The child has grown up with the dawning realisation, I would say, that they were part of a plan. They were complicit in the murder of the mother, Dawn Rhodes.\" Ms Rhodes's family paid tribute to the \"loving daughter, sister and mother\". \"She was everything to us and he is nothing, she will be celebrated and he will be forgotten,\" they said. \"There are no words we can use to make sense of this horrific situation. \"We struggle to comprehend the mindset of an individual so twisted as to even contemplate this as a solution to his own unhappiness, implicating a child under 10 in the process.\"   Read more from Sky News:Man guilty of savage glass bottle train attackActor and comedian Stanley Baxter diesUK 'rapidly developing' plans to prepare for war  Legal commentator Joshua Rozenberg said there are \"very few cases\" where a retrial like this happens. He said: \"It's very unusual. I don't think there's been a case that I can think of where a witness who was present at the scene of the crime has come forward and given evidence, which has led to a conviction.\""
    },
    {
        "title": "UK weather: 'Danger to life' warning as heavy rain and floods set to hit parts of country this weekend",
        "description": "Forecasters have warned of a \"danger to life\" from fast-flowing rivers as heavy rain and flooding are predicted to hit parts of the UK this weekend.",
        "url": "https://news.sky.com/story/uk-weather-danger-to-life-warning-as-heavy-rain-and-floods-set-to-hit-parts-of-country-this-weekend-13482685",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-istock-uk-weather-rain_7108554.jpg?20251212194312",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 18:43:00",
        "Headline": "An amber warning will be in effect in Cumbria from 6am on Sunday to 6pm on Monday, where the Met Office said more than 200mm of rain \"is possible in some locations\".",
        "Content": "Forecasters have warned of a \"danger to life\" from fast-flowing rivers as heavy rain and flooding are predicted to hit parts of the UK this weekend. Yellow weather warnings for rain have been issued by the Met Office for the west of Scotland, Northern Ireland, parts of western Wales, and northwest England, with Scotland's alert until Sunday and the rest until Monday. Check the forecast where you are A more serious amber warning will be in effect in Cumbria from 6am on Sunday to 6pm on Monday, where the agency said more than 200mm of rain \"is possible in some locations\". The Met Office said \"fast flowing or deep floodwater is likely, causing danger to life\", and \"homes and businesses are likely to be flooded, causing damage to some buildings\". Jonathan Day, Environment Agency flood duty manager, said the likely heavy rain in Cumbria \"means significant river and surface water flooding impacts are probable\" and \"are also possible more widely\". He added that the agency's teams \"are out on the ground, taking action to reduce the impact of flooding and support those communities affected\". \n                  Storm Bram brings 90mph winds, rain and flooding to parts of UK\n                 \n                  UK weather: 90mph winds possible and travel disruption likely as Storm Bram hits\n                 \n                  Storm Bram: 'Danger to life' warning as strong winds, heavy rain and flooding forecast for parts of UK and Ireland\n                 \"We urge people not to drive through flood water - it is often deeper than it looks and just 30cm of flowing water is enough to float your car,\" he also said. Floods minister Emma Hardy also urged people in affected areas to follow local advice, sign up for flood warnings, and stay up to date with the latest information. According to the Met Office, some areas of northwest England will continue to see showers until late Monday afternoon, while elsewhere, the southern half of the UK will be dry and bright, with much lighter winds. Cloudless skies, patches of frost, mist and fog are expected in the south of England on Saturday morning, and Sunday is set to stay dry for many. Read more from Sky News:Belgian leader 'sceptical' about using Russian assetsUK 'rapidly developing' plans to prepare for war There will be more clouds, followed by the band of rain, slowly moving southeast through Sunday night and into Monday. Sky's weather producer Kirsty McCabe reports that the \"unsettled and mostly mild theme will continue for a while yet, but southern parts could escape with a mainly fine weekend\". She said: \"It'll be windy in the north too, with coastal gales likely, locally severe. Temperatures will be mostly above average, but where skies remain clear overnight, frost and fog are possible.\" Ms McCabe also noted that \"high pressure is likely to build in the run up to Christmas - so it could be colder, drier and more settled\"."
    },
    {
        "title": "Metropolitan police chief accuses Trump of talking 'nonsense' about London crime",
        "description": "Metropolitan Police commissioner Sir Mark Rowley has said the US president has been talking \"complete nonsense\" during recent comments about crime in London.\n",
        "url": "https://news.sky.com/story/metropolitan-police-chief-accuses-trump-of-talking-nonsense-about-london-crime-13482563",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mark-rowley-donald-trump_7108384.png?20251212161520",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 14:41:00",
        "Headline": "While admitting the situation was \"not perfect\" for the UK's largest force, Sir Mark Rowley insisted that some attempts to \"rubbish London\" were \"driven by politics\".",
        "Content": "Metropolitan Police commissioner Sir Mark Rowley has said the US president has been talking \"complete nonsense\" during recent comments about crime in London.\n Sir Mark was responding to Donald Trump's accusations that crime levels were \"crazy\" and that police did not want to patrol some parts of the UK capital. Speaking to LBC, Sir Mark said: \"In terms of some of the comments that come from America about London... they're complete nonsense. \"This trend of trying to rubbish London, some of which is driven by politics... we need... to fight back about it.\" But the police chief admitted more work was needed to improve the performance of the force and outcomes for Londoners. \"Clearly there are some crime issues that we're tackling, and it's not perfect, I'm proud of the progress we're making in reducing crime.\" During an interview with GB News in November, Mr Trump, who has a long-running feud with London Mayor Sir Sadiq Khan, claimed people were being stabbed \"in the ass or worse\" in London. \n                  'I stand before you a free man', says Kilmar Abrego Garcia as judge blocks ICE from detaining him\n                 \n                  Would Trump really invade Venezuela?\n                 \n                  Thailand has launched more airstrikes, claims Cambodia, as heavy fighting flares following ceasefire\n                 \"My mother loved London. She loved that city... that was a different London than you have today. Today you have people being stabbed in the ass or worse... it's crazy,\" he said. He added that the mayor was \"a disaster\" who was \"letting crime go\". Mr Trump added: \"You have areas in London, and you have this in Paris too, where police don't even want to go anywhere near those areas. Responding to those claims, Sir Mark said it was \"completely false\" to suggest there were parts of the capital deemed as no-go areas for police. And he hit back at crime rates in London compared with the US. \"The homicide rate in London is lower than every single US state. It's lower than all their big cities. The murder rate in New York, last time I looked, is three or four times higher than London per capita.\" Read more from Sky News:Khan: Trump's 'racist' and 'sexist'Trump: Khan a 'terrible mayor' On Tuesday, the US president used an interview with Politico to hit out at Sir Sadiq, who he called a \"disgusting mayor\", and implied the Labour politician gets elected only \"because so many people have come in\". The prime minister's spokesperson openly criticised Mr Trump's comments on Wednesday, saying that Sir Keir Starmer has \"made clear\" that they were \"wrong\". On Friday, Liberal Democrats leader, Sir Ed Davey, said the prime minister should take a more robust stance against the US president who has proven himself to be what he called a \"totally unreliable\" ally."
    },
    {
        "title": "Belgian prime minister tells Sky News he is 'sceptical' about Ukraine loan using Russian assets",
        "description": "The Belgian prime minister said he is \"sceptical\" about giving Ukraine a loan using frozen Russian assets, and tells Sky News that it would need to be done with European partners.",
        "url": "https://news.sky.com/story/belgian-prime-minister-tells-sky-news-he-is-sceptical-about-ukraine-loan-using-russian-assets-13482639",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-belgium-bart-de-wever_7108438.jpg?20251212170041",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 16:49:00",
        "Headline": "Speaking to Sky News' people and politics correspondent Nick Martin, Bart De Wever said: \"I'm heavily exposed to the liabilities of such an operation. But I'm a loyal European. I'm loyally pro Ukraine.\"",
        "Content": " The Belgian prime minister said he is \"sceptical\" about giving Ukraine a loan using frozen Russian assets, and tells Sky News that it would need to be done with European partners. Bart De Wever met Sir Keir Starmer at Downing Street on Friday for talks on using frozen Russian assets, the majority of which are held in Belgium, to fund Ukraine. European Council president Antonio Costa said this week that members were close to greenlighting the proposal, but the Belgian prime minister has not ruled out taking legal action against the EU if the bloc decides to confiscate the assets. Asked by Sky News' people and politics correspondent Nick Martin if Belgium holds the key to Ukraine's future defence, Mr De Wever said \"that's a bit of a cynical question\". \"I don't think we hold the key, but we do hold a lot of Russian assets,\" he said. \"Will we do it with a European solution or with the reparation loan? I'm sceptical about a loan. I'm not going to lie. \"That's because I'm heavily exposed to the liabilities of such an operation. But I'm a loyal European. I'm loyally pro Ukraine.\" The Belgian prime minister then said \"if you want to go through with this, we could,\" but said there would need to be \"the mutualisation of the risk of it being a liquidity safety net\". \n                  UK deploying specialist RAF team to defend Belgium from 'rogue' drones\n                 \n                  Belgium: Tear gas, scuffles and cancelled flights as thousands stage general strike and protests\n                 \n                  Police thwart suspected plot to attack Belgium's prime minister\n                 \"The idea that we do this all together,\" he said. \"But I'm not the only one who holds immobilised assets, there are other countries like the UK, like France. \"If you go together, then you're under a big umbrella and you're not the only one that is exposed to all the risks.\" Russian assets worth €190bn are held in Belgium, De Wever said outside Number 10, compared with €8bn worth in the UK. When asked if he received assurances on shared liability from Sir Keir, Mr De Wever added: \"I'm not sure that I'm at liberty to say what the Prime Minister has told me... but it was a constructive meeting\". 'It's something historic'  Mr De Wever also said that the meeting was timely and noted \"I've even been described as a Russian asset\" for his stance on the proposal. \"It worries me a lot, of course. The exposure risk is huge. €190bn plus damages, and litigation that could go on, go on for two decades. \"It's a tall order, because until two months ago, we considered this to be an operation that we would never do... It's not a detail. It's something historic. \"So to get that all in the right wording, with the right reassurances, it's quite something.\" A Downing Street spokesperson said in a statement that Mr De Wever and Sir Keir \"discussed ongoing work, together with European partners, on addressing Ukraine's financial needs, including through the use of the value of immobilised Russian Sovereign Assets\". \"They agreed to continue to work together closely to make progress on this complex issue,\" they added. Read more from Sky News:Everyone in new Epstein photos identifiedUK 'rapidly developing' plans to prepare for war EU indefinitely freezes assets It comes as Russia's central bank said on Friday that the plan was \"illegal\" and that it reserved the right to take any means necessary to protect its interests. Meanwhile, the EU has indefinitely frozen Russia's assets in Europe using a special procedure meant for economic emergencies to prevent the billions of euros from being used to support Ukraine. Hungarian prime minister Viktor Orban - who has friendly relations with Russian President Vladimir Putin - accused the European Commission, which prepared the decision, \"of systematically raping European law.\" \"It is doing this in order to continue the war in Ukraine, a war that clearly isn't winnable,\" he added on social media. Slovakian prime minister Robert Fico has also said that he would refuse to support any move that \"would include covering Ukraine's military expenses for the coming years\".  Zelenskyy to visit Ukraine, Sky News learns It comes as Sky News learnt from a source that Ukrainian President Volodymyr Zelenskyy is planning to visit Berlin on Monday. He is set to meet German chancellor Friedrich Merz and also speak with representatives of Britain and France, it's understood. It also comes as Ukraine's deputy energy minister said that Russia has launched 1,800 missiles, 50,000 drones and attacked energy facilities 4,500 times since the start of the year. Roman Andarak told a briefing: \"There are no examples in recent history of an energy system existing under such conditions - such large-scale, targeted terror. \"Unfortunately, this terror is intensifying every day.\""
    },
    {
        "title": "'It was little kids' - Taylor Swift breaks down in tears over Southport attacks",
        "description": "Taylor Swift met families of the Southport attack victims and broke down in tears after the encounter, a new TV documentary reveals. ",
        "url": "https://news.sky.com/story/it-was-little-kids-taylor-swift-breaks-down-in-tears-over-southport-attacks-13482502",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-taylor-swift-swift_7108184.jpg?20251212122328",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-12 11:09:00",
        "Headline": "The star's new TV docuseries also reveals she met families of the victims of the mass stabbings,  and her fear for the safety of fans attending her concerts.",
        "Content": " Taylor Swift met families of the Southport attack victims and broke down in tears after the encounter, a new TV documentary reveals.  The series, filmed while she was on tour, also includes footage of the American popstar reflecting on the stabbings that saw three children killed when they attended a dance and yoga workshop themed around her music. Alice da Silva Aguiar, nine, Bebe King, six, and Elsie Dot Stancombe, seven, all died in the attacks on 29 July last year, in Southport, Lancashire. Footage - from her new six-part Disney+ docuseries, \"The End of an Era.\" - shows Swift unable to continue talking about the tragedy and breaking down after explaining that \"it was little kids\". She later tries to continue, saying how she is \"going to meet some of these families [affected by the Southport attack] tonight\". The star then lets out an incredulous half-laugh as she realises that she will be trying to put on a happy and joyful pop concert shortly after having such heart-breaking encounters. Swift then half chides half motivates herself to \"lock it off,\" and get into pop performer mode. \n                  UK's Prevent counter-terrorism strategy 'is no longer keeping the country safe', commission warns \n                 \n                  Two teenagers who allegedly wanted to emulate Southport killer have been arrested\n                 \n                  What we've learned from the Southport Inquiry: Victims 'failed at every possible turn'\n                 She compares it to being a pilot needing to adopt a \"calm, cool, collected\" demeanour. Swift later met privately with families of the Southport victims. That meeting is not on camera, but the aftermath is. It shows the star in tears, placing her hand on a wall for support and being comforted by her mother. The footage was filmed as Swift prepared for concerts in London in August 2024, her first performances since three Vienna dates were cancelled over an apparent plot to launch an attack on the shows. She admits that \"being afraid something is going to happen\" to her audience at a show was a new challenge. Read more from Sky News:Maduro's 'narco nephews' hit with sanctionsKing to share personal cancer update At the time of the Southport attack, Swift said she was \"completely in shock\" over the violence. The popstar also revealed when talking to fellow singer Ed Sheeran, that she felt \"hunted\" lately and wanted to go somewhere no one could find her in the two months off she had following her London shows. Fear of shows being targeted  Taylor Swift's Vienna shows aren't the only pop concerts that have allegedly been targeted. In May 2025, authorities in Brazil prevented a bomb attack at a free Lady Gaga concert on the beach of Rio de Janeiro that drew an audience of over two million. In 2017 a suicide bomber targeted an Ariana Grande concert in Manchester and detonated an explosive device in the arena foyer, which killed 22 and injured hundreds of others.  While the pop star was physically unharmed in the attack, she suffered from post-traumatic stress disorder afterwards. She later described the Manchester Arena terror attack as something \"that seems impossible to fully recover from\"."
    },
    {
        "title": "King reveals 'good news' in his battle with cancer and urges people to get checked",
        "description": "The King has revealed that, thanks to early diagnosis, his cancer treatment can be reduced in the new year.",
        "url": "https://news.sky.com/story/king-reveals-good-news-in-his-battle-with-cancer-and-urges-people-to-get-checked-13482580",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-king-charles-chatfield_7072709.jpg?20251105121542",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-12 15:23:00",
        "Headline": "Charles says his treatment will be reduced next year thanks to his \"adherence to doctors' orders\" and early diagnosis.",
        "Content": " The King has revealed that, thanks to early diagnosis, his cancer treatment can be reduced in the new year. In a televised address, Charles said his \"good news\" was \"thanks to early diagnosis, effective intervention and adherence to doctors' orders\". \"This milestone is both a personal blessing and a testimony to the remarkable advances that have been made in cancer care in recent years,\" he added. \"Testimony that I hope may give encouragement to the 50% of us who will be diagnosed with the illness at some point in our lives.\" The King announced in February 2024 that he had been diagnosed with cancer and was beginning treatment. The monarch postponed all public-facing engagements, but continued with his duties as head of state behind palace walls, conducting audiences and Privy Council meetings. He returned to public duties in April last year and visited University College Hospital Macmillan Cancer Centre in central London with the Queen and discussed his \"shock\" at being diagnosed when he spoke to a fellow cancer patient. \n                  Prostate cancer treatment with potential for fewer side effects to be trialled in UK\n                 \n                  Why prostate cancer is expected to be left as the only major cancer without national screening\n                 \n                  Prostate cancer: NHS screening programme could come one step closer today\n                 Sources suggested last December his treatment would continue in 2025 and was \"moving in a positive direction\". The King has chosen not to reveal what kind of cancer he has been treated for. Palace sources have partly put that down to the fact that he doesn't want one type of cancer to appear more significant or attract more attention than others. In a statement after the speech aired, a Buckingham Palace spokesperson said: \"His Majesty has responded exceptionally well to treatment and his doctors advise that ongoing measures will now move into a precautionary phase.\" Sir Keir Starmer praised the video message as \"a powerful message,\" and said: \"I know I speak for the entire country when I say how glad I am that his cancer treatment will be reduced in the new year. \"Early cancer screening saves lives.\"  Early detection can give 'the precious gift of hope' His message on Friday was broadcast at 8pm in support of Stand Up To Cancer, a joint campaign by Cancer Research UK and Channel 4. In an appeal to people to get screened for the disease early, the King said: \"I know from my own experience that a cancer diagnosis can feel overwhelming. \"Yet I also know that early detection is the key that can transform treatment journeys, giving invaluable time to medical teams - and, to their patients, the precious gift of hope. These are gifts we can all help deliver.\" Charles noted that \"at least nine million people in our country are not up to date with the cancer screenings available to them,\" adding: \"That is at least nine million opportunities for early diagnosis being missed. \"The statistics speak with stark clarity. To take just one example: When bowel cancer is caught at the earliest stage, around nine in ten people survive for at least five years. \"When diagnosed late, that falls to just one in ten. Early diagnosis quite simply saves lives.\" Royal correspondent This is a rare but positive update. The King in his own words speaking about his cancer.  And it's good news. Since his diagnosis, he's received weekly treatment. His work schedule has had to fit around the appointments. And while it's not stopping, it is being significantly reduced. He's responded well, and his recovery has reached, we understand, a very positive stage. The King's decision to speak publicly and so personally is unusual. He has deliberately chosen the moment, supporting the high-profile Stand Up To Cancer campaign, and the launch of a national online screening checker. It still hasn't been revealed what kind of cancer he has. And there's a reason - firstly, it's private information. But more importantly, the King knows the power of sharing his story. And with it, the potential to support the wider cancer community.\n We are once again seeing a candid openness from the Royal Family. Earlier this year, the Princess of Wales discussed the ups and downs of her cancer journey. These moments signal a shift towards greater transparency on matters the Royal Family once kept entirely private. For millions facing cancer, the King's update is empathy and encouragement from someone who understands. And after months of uncertainty, for the King himself, some relief and reassurance. Minor inconvenience of screening 'a small price to pay' The King acknowledged that people often avoid screening \"because they imagine it may be frightening, embarrassing or uncomfortable\". But, he added: \"If and when they do finally take up their invitation, they are glad they took part. \"A few moments of minor inconvenience are a small price to pay for the reassurance that comes for most people when they are either told either they don't need further tests, or, for some, are given the chance to enable early detection, with the life-saving intervention that can follow.\" Read more from Sky News:Christmas tree chopped down hours after lights switch-onMore photos from Epstein's estate releasedTaylor Swift breaks down in tears over Southport attacks Giving his \"most heartfelt thanks\" to doctors, nurses, researchers and charity workers, the King added: \"As I have observed before, the darkest moments of illness can be illuminated by the greatest compassion. But compassion must be paired with action. \"This December, as we gather to reflect on the year past, I pray that we can each pledge, as part of our resolutions for the year ahead, to play our part in helping to catch cancer early. \"Your life - or the life of someone you love - may depend upon it.\""
    },
    {
        "title": "Judge 'haunted' by attack on victim as Eastern European grooming gang is jailed",
        "description": "Five men who were part of an Eastern European grooming gang, targeting teenage girls in Gateshead, have been jailed.",
        "url": "https://news.sky.com/story/judge-haunted-by-attack-on-victim-as-eastern-european-grooming-gang-is-jailed-13482697",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-composite-gang_7108574.jpg?20251212203601",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-12 19:33:00",
        "Headline": "Newcastle Crown Court heard the victims, all girls aged between 13 and 15, were exploited in Gateshead by a gang of Romanian and Albanian men.",
        "Content": "Five men who were part of an Eastern European grooming gang, targeting teenage girls in Gateshead, have been jailed. During an eight-week trial at Newcastle Crown Court, the four Romanians and an Albanian were found guilty of 31 charges involving six victims between 2014 and 2019 in October. The girls, aged between 13 and 15, were sometimes plied with alcohol or cocaine before they were sexually abused and raped. The court heard the victims were targeted by teenage boys, just a few years older than them, with the girls sometimes thinking they were in a relationship, before older men exploited them. The gang were jailed on Friday for between 18 months and 14 years. The court heard some of the offending centred around Saltwell Park where the men would meet to play football. During sentencing remarks, Judge Tim Gittins paid tribute to all the victims' courage and resilience by coming forward. \n                  King reveals 'good news' in his battle with cancer and urges people to get checked\n                 \n                  Metropolitan police chief accuses Trump of talking 'nonsense' about London crime\n                 \n                  Man found guilty of murdering wife in rare retrial\n                 'Nothing less than haunting' He described a statement from one of the victims, who was sexually exploited after becoming addicted to cocaine, as \"nothing less than haunting\" after the men \"deeply traumatised her and psychologically scarred her\". She said she was \"petrified of all men\". She added: \"I don't know if I will ever lead a normal life.\" Another victim said in a statement: \"I was naive and impressionable, and it made it easy for me to be preyed upon.\" The court also heard another victim describe the control her attacker had on her. \"It was like he had a spell on me... it was like I was held hostage and had to play a role.\" Read more from Sky News:Man guilty of murder in rare retrialMet chief accuses Trump of 'nonsense'King discusses battle with cancer Senior Investigating Officer Detective Chief Inspector Graeme Barr, of Northumbria Police, thanked the victims for their \"composure and dignity\". \"This was a complex investigation which took time to piece together and establish the extent of the horrific offending. \"The girls had their childhood snatched from them in the cruellest of ways by predators who targeted them as vulnerable members of our community.\" Jailed for up to 14 years Four Romanians, all with addresses in Gateshead, were sentenced on Friday: Bogdan Gugiuman, 44, was jailed for 14 years for rape and supplying a class A drug. Codrin Dura, 27, received a sentence of 13 years after being found guilty of rape, sexual activity with a child, blackmail, attempted rape, serious sexual assault, supplying a class A drug and arranging or facilitating commission of a child sex offence. Leonard Paun, 23, was jailed for five years and one month for rape, arranging or facilitating commission of a child sex offence, sexual activity with a child, sexual assault, supplying a class A drug and distributing photos of a child. Stefan Ciuraru, 22, who was found guilty of four counts of sexual assault, sexual activity with a child and causing or inciting a child to engage in sexual activity. He was jailed for 18 months. In addition, Albanian Klaudio Aleksiu, 28, from Windsor, was jailed for six years for rape. The sentencing took into account that Aleksiu, Dura, and Paun were all juveniles at the time of offending. A sixth man was found not guilty of all charges he faced. The judge added that the men's nationality was \"irrelevant to the sentencing process\" but pointed out that \"the information the court has is you all came to this country legally, most as children, and have stayed legitimately\"."
    },
    {
        "title": "Metropolitan police chief accuses Trump of talking 'nonsense' about London crime",
        "description": "Metropolitan Police commissioner Sir Mark Rowley has said the US president has been talking \"complete nonsense\" during recent comments about crime in London.\n",
        "url": "https://news.sky.com/story/metropolitan-police-chief-accuses-trump-of-talking-nonsense-about-london-crime-13482563",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mark-rowley-donald-trump_7108384.png?20251212161520",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-12 14:41:00",
        "Headline": "While admitting the situation was \"not perfect\" for the UK's largest force, Sir Mark Rowley insisted that some attempts to \"rubbish London\" were \"driven by politics\".",
        "Content": "Metropolitan Police commissioner Sir Mark Rowley has said the US president has been talking \"complete nonsense\" during recent comments about crime in London.\n Sir Mark was responding to Donald Trump's accusations that crime levels were \"crazy\" and that police did not want to patrol some parts of the UK capital. Speaking to LBC, Sir Mark said: \"In terms of some of the comments that come from America about London... they're complete nonsense. \"This trend of trying to rubbish London, some of which is driven by politics... we need... to fight back about it.\" But the police chief admitted more work was needed to improve the performance of the force and outcomes for Londoners. \"Clearly there are some crime issues that we're tackling, and it's not perfect, I'm proud of the progress we're making in reducing crime.\" During an interview with GB News in November, Mr Trump, who has a long-running feud with London Mayor Sir Sadiq Khan, claimed people were being stabbed \"in the ass or worse\" in London. \n                  'I stand before you a free man', says Kilmar Abrego Garcia as judge blocks ICE from detaining him\n                 \n                  Would Trump really invade Venezuela?\n                 \n                  Thailand has launched more airstrikes, claims Cambodia, as heavy fighting flares following ceasefire\n                 \"My mother loved London. She loved that city... that was a different London than you have today. Today you have people being stabbed in the ass or worse... it's crazy,\" he said. He added that the mayor was \"a disaster\" who was \"letting crime go\". Mr Trump added: \"You have areas in London, and you have this in Paris too, where police don't even want to go anywhere near those areas. Responding to those claims, Sir Mark said it was \"completely false\" to suggest there were parts of the capital deemed as no-go areas for police. And he hit back at crime rates in London compared with the US. \"The homicide rate in London is lower than every single US state. It's lower than all their big cities. The murder rate in New York, last time I looked, is three or four times higher than London per capita.\" Read more from Sky News:Khan: Trump's 'racist' and 'sexist'Trump: Khan a 'terrible mayor' On Tuesday, the US president used an interview with Politico to hit out at Sir Sadiq, who he called a \"disgusting mayor\", and implied the Labour politician gets elected only \"because so many people have come in\". The prime minister's spokesperson openly criticised Mr Trump's comments on Wednesday, saying that Sir Keir Starmer has \"made clear\" that they were \"wrong\". On Friday, Liberal Democrats leader, Sir Ed Davey, said the prime minister should take a more robust stance against the US president who has proven himself to be what he called a \"totally unreliable\" ally."
    },
    {
        "title": "Man found guilty of murdering wife in rare retrial",
        "description": "A 52-year-old carpenter from Surrey has been found guilty of murdering his wife in a rare retrial, eight years after being acquitted.",
        "url": "https://news.sky.com/story/man-found-guilty-of-murdering-wife-in-rare-retrial-13480936",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-robert-rhodes-surrey-police_7108187.jpg?20251212122548",
        "type": "UK",
        "Author": "Amelia Harper",
        "Date Published": "2025-12-12 11:34:00",
        "Headline": "Robert Rhodes killed his estranged wife, Dawn Rhodes, by slitting her throat with a knife at their family home in Redhill, Surrey, in June 2016.",
        "Content": "\n          Home news correspondent\n              @AmeliaHarperTV\n  A 52-year-old carpenter from Surrey has been found guilty of murdering his wife in a rare retrial, eight years after being acquitted. Robert Rhodes killed his estranged wife, Dawn Rhodes, by slitting her throat with a knife at their family home in Redhill, Surrey, in June 2016. The couple's marriage had broken down and he had filed for a divorce. He was previously found not guilty after a trial at the Old Bailey in 2017, where he convinced jurors that he had acted in self-defence during an argument. It has since emerged that this was a \"cover-up\", after the couple's child came forward with new evidence that Rhodes killed Ms Rhodes, and they were involved in the murder too. In 2021, the child, who was under the age of 10 at the time of the murder, told police they had been manipulated into lying about the true version of events by their father. Both Rhodes and the child were found with knife wounds at the scene, which were initially claimed to have been inflicted in an attack by Ms Rhodes. The child's new account stated that after Rhodes killed his wife, he inflicted two wounds to his scalp before instructing the child to inflict two more on their father's back. He then cut his own child's arm so deeply that it required stitches under general anaesthetic. Under the double jeopardy rule a person cannot be tried twice for the same crime, unless new and compelling evidence comes out after an acquittal or conviction for serious offences. On Friday, jurors at Inner London Crown Court convicted Rhodes of murder and child cruelty. He was also found guilty of perverting the course of justice and two counts of perjury. Rhodes will be sentenced on 16 January. The double jeopardy rule is a legal principle that prevents a person from being tried twice for the same crime after they have been acquitted or convicted.  It's a protection for that person from harassment. However, the law permits a retrial where someone was acquitted of a serious offence, but new and compelling evidence has since come to light which indicates the person might actually be guilty.  In this case, the new evidence from the child was compelling enough for the Court of Appeal to quash the acquittal and a retrial to take place. \n Crucially, the child's evidence was so compelling that the Court of Appeal agreed Rhodes needed to be tried again. Surrey Police told Sky News that the child, who was of primary school age at the time and is below the age of criminal responsibility, was \"groomed\" by Rhodes into lying. The child told police that during supervised contact with Rhodes in 2016 and 2017 - while he was on bail after being charged with murder - he had told them that they had \"got some things wrong\" and continued to give them instructions to stick to the plan.  Rhodes even hid a phone at his mother's house for when the child visited, on which he would leave messages for the child. Detective Chief Inspector Kimball Edey said: \"During the first trial, Dawn was portrayed as the villain but had actually been a victim of domestic abuse and coercive control at the hands of her husband for years. \"The fact that Rhodes not only murdered his wife in cold blood but then manipulated and groomed his own child to play a part in his evil scheme and cover-up what he had done is simply despicable - not only did he take a life; he irreparably damaged another, as well as the lives of everyone else who loved Dawn.\"  2 June 2016 - Dawn Rhodes killed 5 June 2016 - Robert Rhodes charged with murder 2 May 2017 - first trial begins 30 May 2017 - not guilty verdict 18 November 2021 - child gives therapist new account Late November 2021 - police reopen case 4 June 2024 - Robert Rhodes rearrested and charged the next day 7 November 2024 - Rhodes's acquittal quashed  2 October 2025 - second trial begins The Crown Prosecution Service said \"the child's part in the plan was that they would distract the mother by saying to the mother 'hold out your hands, I've got a surprise for you', and the child would then put a drawing into the hands of the mother\".   Rhodes then cut his wife's throat. She was found lying face down in a pool of blood in the dining room. Libby Clark, specialist prosecutor for the Crown Prosecution Service's south east area complex casework unit, said the child showed \"great bravery and strength\" in coming forward with the truth. She said: \"The child has grown up with the dawning realisation, I would say, that they were part of a plan. They were complicit in the murder of the mother, Dawn Rhodes.\" Ms Rhodes's family paid tribute to the \"loving daughter, sister and mother\". \"She was everything to us and he is nothing, she will be celebrated and he will be forgotten,\" they said. \"There are no words we can use to make sense of this horrific situation. \"We struggle to comprehend the mindset of an individual so twisted as to even contemplate this as a solution to his own unhappiness, implicating a child under 10 in the process.\"   Read more from Sky News:Man guilty of savage glass bottle train attackActor and comedian Stanley Baxter diesUK 'rapidly developing' plans to prepare for war  Legal commentator Joshua Rozenberg said there are \"very few cases\" where a retrial like this happens. He said: \"It's very unusual. I don't think there's been a case that I can think of where a witness who was present at the scene of the crime has come forward and given evidence, which has led to a conviction.\""
    },
    {
        "title": "People are disappearing 'daily' from asylum hotels, says whistleblower",
        "description": "An insider has told Sky News people are still disappearing \"daily\" from asylum seeker hotels.",
        "url": "https://news.sky.com/story/theyre-invisible-within-society-whistleblower-says-asylum-seekers-disappear-daily-from-hotels-13482396",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-asylum-seeker-asylum-hotel_7107874.jpg?20251211225547",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-12-12 00:01:00",
        "Headline": "A hotel contractor speaks of his fears about undocumented people absconding from hotels despite the government's promise to get the immigration system under control.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  An insider has told Sky News people are still disappearing \"daily\" from asylum seeker hotels. In an exclusive interview, the contractor described the chaos he sees within the system as \"terrifying\" because undocumented people are persistently absconding from hotels. He spoke to us because he is deeply concerned about the ongoing lack of monitoring at a time when the government has promised to tighten the asylum system. The man, who we are not naming, works across multiple asylum hotels in one region of England. \"When someone gets to about a week away from the hotel, they're processed as an absconder,\" he said. \"Nothing really happens there. They get marked as 'left the hotel' and a notification is sent to the Home Office. \"It's at least weekly. Most of the time it can be daily.\" \n                  PM issues warning to European leaders ahead of ECHR talks\n                 \n                  The asylum seeker whose claim has taken so long to process that he's had time to start a family\n                 \n                  Asylum seekers to be banned from using taxis for medical appointments\n                 The government moved last month to reset its immigration policy by promising to toughen the process for asylum seekers. The latest figures up to September this year show 36,272 asylum seekers living in hotels. Overall 110,000 people claimed asylum in the UK between September 2024 and September 2025 - higher than the previous recorded peak of 103,000 in 2002. The hotel contractor also described to Sky News what he says happens when a resident's claim for asylum is rejected. \"They get given a date that they need to move out by,\" he said. \"You would expect immigration enforcement to go to the hotel to pick these people up. You would expect them to not even be told that they failed their asylum claim. \"You would expect them to just be collected from the hotel… that doesn't happen.\" He told us that some residents just walk out of the door with no further checks or assistance. \"It must be terrifying for these people as well… 'what do I do now? I don't have an address'. \"So what do they do? How do they survive? \"Do they then get forced… to go into an underground world? \"They're just completely invisible within society. \"For those people to freely be allowed, undetected and unchecked, on the streets of this country is terrifying.\" His account from within the system contrasts with the government's promises to restore control over the asylum process. In response to the interview, a Home Office spokesperson said: \"This government will end the use of hotels and have introduced major reforms to the asylum system, to scale up removals of people with no right to be here and address the factors drawing illegal migrants to the UK in the first place. \"Nearly 50,000 people with no right to be in our country have been removed and enforcement arrests to tackle illegal working are at the highest level in recent history. \"A dedicated team in the Home Office works with police, across government and commercial companies to trace absconders. Failure to return to a hotel can also lead to asylum claims and support being withdrawn.\" At a community kitchen in Greater Manchester, organisers told us they regularly see people who are living under the radar - surviving with \"cash in hand\" jobs. Volunteer Shabana Yunas helps many hungry and desperate people. She also feels the tension it causes in her community. \"People don't know who they are and I understand a lot of people are afraid… but if there's those things in place where we can monitor who is around, then everybody can feel a lot safer. \"If people are coming into the UK and we don't know who they are and they're just disappearing, crime rates are going to go up, slavery is going to go higher, child exploitation is going to be more exposed. \"They are too afraid to go to the authorities because they are scared of being deported to a country where their lives could be at risk. \"It's getting worse, it is dangerous and we do need to do something about this where we can support people.\" Another volunteer at the kitchen is Khalid. He arrived in the UK in 2015 having travelled from Ethiopia - he hid on a lorry to get into England. Read more:The visa overstayers living under the radarStats show rise in asylum seekers being housed in hotelsBritain's immigration system changes explained He has applied for asylum and been rejected four times. He has recently submitted another application and told us political violence at home meant he could not return. Crucially, he knows plenty of people living off-grid. \"Yeah, they don't care about what the government thinks, because they already destroyed their life,\" he told us. 👉 Listen to Sky News Daily on your podcast app 👈 Although Khalid now has somewhere to stay, he has previously considered turning to crime to give himself the stability of life in prison. \"I was in depression. I was like, I wanna do some criminal and go jail, to stay in a prison. \"Once upon a time, I'd prefer that way.\"  Khalid is now volunteering to give his life more purpose as he waits for another decision from the Home Office. He says he doesn't blame people who think he should be deported back to Ethiopia. When asked if he should have been, he said: \"That is up to Home Office, like up to government.\" Stopping small boats, clearing backlogs, closing hotels, enforcing the rules and restoring faith in the system are all priorities for the Home Office - solving it all is one of the defining challenges for the Starmer government."
    },
    {
        "title": "UK 'rapidly developing' plans to prepare for war",
        "description": "The UK is \"rapidly developing\" plans to prepare the whole country for the possible outbreak of war, the armed forces minister has said.",
        "url": "https://news.sky.com/story/uk-rapidly-developing-plans-to-prepare-for-war-says-armed-forces-minister-13482403",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-al-carns-army-secretary_7107892.jpg?20251212013215",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-12-12 00:01:00",
        "Headline": "Al Carns has warned of a \"shadow of war\" at Europe's door, as hostile intelligence activity against the UK has jumped by more than 50% over the past year.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK is \"rapidly developing\" plans to prepare the whole country for the possible outbreak of war, the armed forces minister has said. Underlining the role civilians would have to play in a major conflict, Al Carns said armies, navies and air forces respond to crises but \"societies, industries and economies win wars\". He said: \"The shadow of war is knocking on Europe's door once more. That's the reality. We've got to be prepared to deter it.\" The comments came after Mark Rutte, the head of NATO, told allies on Thursday that Europe must ready itself for a confrontation with Russia on the kind of scale \"our grandparents and great-grandparents endured\" - a reference to the First and Second World Wars.  In an indication of the threat, Britain revealed on Friday that the level of hostile intelligence activity - such as spying, hacking and physical threats - against its armed forces and the Ministry of Defence has jumped by more than 50% over the past year. Russia, China, Iran and North Korea are suspected of being the main culprits. The government is launching a new defence counter-intelligence unit to bolster its ability to detect and disrupt intelligence operations by hostile states. \n                  UK and Norway sign submarine hunting pact amid Russian threat to undersea cables\n                 \n                  The army's Ajax fighting vehicle injured troops and cost billions - there must be accountability\n                 \n                  Army pauses use of Ajax armoured fighting vehicles after dozens of soldiers fall ill\n                 It has also moved to enhance the Ministry of Defence's spying capabilities by combining the various military intelligence branches across the army, navy and air force, as well as Defence Intelligence, into a new organisation called the Military Intelligence Services. The \"MI\" initials are the same as in MI5 and MI6 - the UK's domestic and foreign intelligence agencies.  Mr Carns, a former special forces colonel, visited RAF Wyton, a top-secret military spy base in Cambridgeshire, with a second defence minister, Louise Sandher-Jones, as well as a group of journalists to announce the organisational changes. But improving the readiness of the professional armed forces is only part of any country's preparedness for potential conflict. With France warning its people they may need to lose their children fighting a war with Russia, Sky News asked Mr Carns whether he thought more needed to be done to inform the British public about the sacrifices they might be required to make in a war. The minister said: \"There's a whole load of work going on now between us [Ministry of Defence], the Cabinet Office, and the whole of society approach, and what conflict means, and what everybody's role in society means if we were to go to war and the build up to war.\" He continued: \"Collectively, everybody - what is their role if we get caught in an existential crisis, and what do they need to be aware they need to do and what they can't do, and how do we mobilise the nation to support a military endeavour? \"Not just about deploying the military, but actually about protecting every inch of our own territory. That work is ongoing now, it's rapidly developing. We've got to move as fast as we can to make sure that's shored up.\" The UK used to have a comprehensive plan for the transition from peace to war. Developed over decades, the Government War Book had instructions for every part of society, from the army and the police to schools, hospitals and even art galleries.  Read more from Sky News:Head of MI6: 'Never seen the world in a more dangerous state'Russia ready to hit UK with wave of cyber attacks, minister warns However, this huge body of preparedness - which was expensive to maintain - was quietly shelved following the end of the Cold War. Mr Carns's comments indicate that some kind of modern version of the doctrine could make a comeback. Communicating the changing reality of the security situation to the public is also seen as key. The armed forces minister said many people in the UK do not see, hear or feel the dangers even as Russia's war in Ukraine rages, impacting the cost of fuel. \"We've got to bring that home to make sure people understand, not to scare them, but to be realistic and understand where those threats are emanating from, and why defence and a whole society approach is so important,\" he said. 👉 Click here to listen to The Wargame on your podcast app 👈 Sky News' The Wargame podcast explores what might happen if Russia attacked the UK and how all of society would be affected."
    },
    {
        "title": "UK weather: 'Danger to life' warning as heavy rain and floods set to hit parts of country this weekend",
        "description": "Forecasters have warned of a \"danger to life\" from fast-flowing rivers as heavy rain and flooding are predicted to hit parts of the UK this weekend.",
        "url": "https://news.sky.com/story/uk-weather-danger-to-life-warning-as-heavy-rain-and-floods-set-to-hit-parts-of-country-this-weekend-13482685",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-istock-uk-weather-rain_7108554.jpg?20251212194312",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-12 18:43:00",
        "Headline": "An amber warning will be in effect in Cumbria from 6am on Sunday to 6pm on Monday, where the Met Office said more than 200mm of rain \"is possible in some locations\".",
        "Content": "Forecasters have warned of a \"danger to life\" from fast-flowing rivers as heavy rain and flooding are predicted to hit parts of the UK this weekend. Yellow weather warnings for rain have been issued by the Met Office for the west of Scotland, Northern Ireland, parts of western Wales, and northwest England, with Scotland's alert until Sunday and the rest until Monday. Check the forecast where you are A more serious amber warning will be in effect in Cumbria from 6am on Sunday to 6pm on Monday, where the agency said more than 200mm of rain \"is possible in some locations\". The Met Office said \"fast flowing or deep floodwater is likely, causing danger to life\", and \"homes and businesses are likely to be flooded, causing damage to some buildings\". Jonathan Day, Environment Agency flood duty manager, said the likely heavy rain in Cumbria \"means significant river and surface water flooding impacts are probable\" and \"are also possible more widely\". He added that the agency's teams \"are out on the ground, taking action to reduce the impact of flooding and support those communities affected\". \n                  Storm Bram brings 90mph winds, rain and flooding to parts of UK\n                 \n                  UK weather: 90mph winds possible and travel disruption likely as Storm Bram hits\n                 \n                  Storm Bram: 'Danger to life' warning as strong winds, heavy rain and flooding forecast for parts of UK and Ireland\n                 \"We urge people not to drive through flood water - it is often deeper than it looks and just 30cm of flowing water is enough to float your car,\" he also said. Floods minister Emma Hardy also urged people in affected areas to follow local advice, sign up for flood warnings, and stay up to date with the latest information. According to the Met Office, some areas of northwest England will continue to see showers until late Monday afternoon, while elsewhere, the southern half of the UK will be dry and bright, with much lighter winds. Cloudless skies, patches of frost, mist and fog are expected in the south of England on Saturday morning, and Sunday is set to stay dry for many. Read more from Sky News:Belgian leader 'sceptical' about using Russian assetsUK 'rapidly developing' plans to prepare for war There will be more clouds, followed by the band of rain, slowly moving southeast through Sunday night and into Monday. Sky's weather producer Kirsty McCabe reports that the \"unsettled and mostly mild theme will continue for a while yet, but southern parts could escape with a mainly fine weekend\". She said: \"It'll be windy in the north too, with coastal gales likely, locally severe. Temperatures will be mostly above average, but where skies remain clear overnight, frost and fog are possible.\" Ms McCabe also noted that \"high pressure is likely to build in the run up to Christmas - so it could be colder, drier and more settled\"."
    },
    {
        "title": "As GDP shrinks, it is not clear where the economic jump-start will come from",
        "description": "The British economy has been slowing since the summer but the long wait for a late-November budget applied an extra touch to the brakes, according to the latest growth figures from the Office for National Statistics.",
        "url": "https://news.sky.com/story/as-gdp-shrinks-it-is-not-clear-where-the-economic-jump-start-will-come-from-13482490",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cash-money_6983843.jpg?20250806070550",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-12 10:24:00",
        "Headline": "The slowdown should remove any lingering doubts that the Bank of England will agree an interest rate cut when it meets next week, the expected quarter-point trim taking the headline figure below 4% for the first time since January 2023.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The British economy has been slowing since the summer but the long wait for a late-November budget applied an extra touch to the brakes, according to the latest growth figures from the Office for National Statistics. A monthly contraction in GDP of 0.1% in October, and a similar fall in the three-month trend, was attributed to uncertainty about Rachel Reeves's plans amid an autumn blizzard of trails, leaks and speculation. The ONS said businesses across the \"production, construction and services\" reported waiting for the outcome of the budget. It was not the only factor - output was pulled down by the continued impact of the Jaguar Land Rover cyber-shutdown and services, the engine of the economy, were flat - but we can now put a price on the chancellor's prevarication. It is likely to have taken a toll on November's figures, too, making it likely that the year will end with a quarter of stalled growth, and raising questions about where a rebound may come from. The slowdown should remove any lingering doubts that the Bank of England will agree an interest rate cut when it meets next week, the expected quarter-point trim taking the headline figure below 4% for the first time since January 2023. The pace of cuts beyond that remains uncertain, but if the torpid performance continues, then another cut could come as early as February. \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 The Bank and the Office for Budget Responsibility both expect inflation to decline in 2026, too, which could help the economy climb out of the current slough. Read more: More bad news for chancellor as UK economy shrinks againLabour MPs split on Angela Rayner's future amid leadership speculation In a statement, the Treasury said the government was determined to defy forecasts, and cited a number of projects as examples of its pro-growth credentials, including new runways at Heathrow and Gatwick and the Sizewell C nuclear power station. What they all have in common are completion dates in the next decade, and with the budget scored as having no immediate pro-growth measures, and tax rises to come, it is not clear where the economic jump-start will come from."
    },
    {
        "title": "'Disgraceful' vandals felled Christmas tree hours after lights switch-on",
        "description": "Vandals have been labelled \"disgraceful\" after felling a Christmas tree, that stood in a village for more than a decade, just hours after its lights were switched on.",
        "url": "https://news.sky.com/story/christmas-tree-chopped-down-hours-after-lights-switch-on-13482411",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-shotton-colliery-tree_7107893.jpg?20251212051709",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-12 05:07:00",
        "Headline": "Police appeal for witnesses after a tree in Shotton Colliery, County Durham, was deliberately cut down.",
        "Content": "Vandals have been labelled \"disgraceful\" after felling a Christmas tree, that stood in a village for more than a decade, just hours after its lights were switched on. Denise Brooks, manager of Shotton Community Centre, County Durham, told Sky News she could not believe it when she heard the tree had been chopped down. \"All of the memories and the history of the tree, it's like... just gone. I think it's been disgraceful to tell you the truth. I'm really hurt,\" she said. The tree in Shotton Colliery was chopped down between 10pm and 11pm on Wednesday, causing \"huge upset\", according to Durham Police. The force believes it was felled deliberately and have appealed for witnesses to come forward. Police Constable David Allan said: \"This was a disgusting act of mindless vandalism which has caused huge upset throughout the village at a time when our community should be coming together. \"We are treating this incident extremely seriously, and we will deal with anyone responsible as robustly as the law allows. \"This behaviour has no place in our community. Someone knows something - please help us find who is responsible.\" St Saviour's, a local church, posted images of lights on the tree being turned on. A message on their Facebook account said: \"May the people who caused this be caught and punished by the authorities.\" Read more from Sky News:Man guilty of murder in rare retrialMet chief: Trump talking 'nonsense'Taylor Swift in tears over Southport Ms Brooks said the tree had been growing in the centre of the village as a sapling for the last 12 years and young people have developed a connection to it. \"They've grown up with the tree, we've nurtured the tree. So it's like... they put a lot of care into it.\" She added that the village was planning to replace the lights, as the tree had grown so large. \"We were going to get new lights... and we were trying to get funding for it... and so we were talking about the future of the tree and now it's not going to be there. We probably have to start again.\" She said that when she visited the felled tree, it reminded her of how locals felt about the loss of the Sycamore Gap tree, which was deliberately cut down and resulted in two men being jailed.  Police have urged anyone with information, including CCTV or doorbell footage, to contact them."
    },
    {
        "title": "Belgian prime minister tells Sky News he is 'sceptical' about Ukraine loan using Russian assets",
        "description": "The Belgian prime minister said he is \"sceptical\" about giving Ukraine a loan using frozen Russian assets, and tells Sky News that it would need to be done with European partners.",
        "url": "https://news.sky.com/story/belgian-prime-minister-tells-sky-news-he-is-sceptical-about-ukraine-loan-using-russian-assets-13482639",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-belgium-bart-de-wever_7108438.jpg?20251212170041",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-12 16:49:00",
        "Headline": "Speaking to Sky News' people and politics correspondent Nick Martin, Bart De Wever said: \"I'm heavily exposed to the liabilities of such an operation. But I'm a loyal European. I'm loyally pro Ukraine.\"",
        "Content": " The Belgian prime minister said he is \"sceptical\" about giving Ukraine a loan using frozen Russian assets, and tells Sky News that it would need to be done with European partners. Bart De Wever met Sir Keir Starmer at Downing Street on Friday for talks on using frozen Russian assets, the majority of which are held in Belgium, to fund Ukraine. European Council president Antonio Costa said this week that members were close to greenlighting the proposal, but the Belgian prime minister has not ruled out taking legal action against the EU if the bloc decides to confiscate the assets. Asked by Sky News' people and politics correspondent Nick Martin if Belgium holds the key to Ukraine's future defence, Mr De Wever said \"that's a bit of a cynical question\". \"I don't think we hold the key, but we do hold a lot of Russian assets,\" he said. \"Will we do it with a European solution or with the reparation loan? I'm sceptical about a loan. I'm not going to lie. \"That's because I'm heavily exposed to the liabilities of such an operation. But I'm a loyal European. I'm loyally pro Ukraine.\" The Belgian prime minister then said \"if you want to go through with this, we could,\" but said there would need to be \"the mutualisation of the risk of it being a liquidity safety net\". \n                  UK deploying specialist RAF team to defend Belgium from 'rogue' drones\n                 \n                  Belgium: Tear gas, scuffles and cancelled flights as thousands stage general strike and protests\n                 \n                  Police thwart suspected plot to attack Belgium's prime minister\n                 \"The idea that we do this all together,\" he said. \"But I'm not the only one who holds immobilised assets, there are other countries like the UK, like France. \"If you go together, then you're under a big umbrella and you're not the only one that is exposed to all the risks.\" Russian assets worth €190bn are held in Belgium, De Wever said outside Number 10, compared with €8bn worth in the UK. When asked if he received assurances on shared liability from Sir Keir, Mr De Wever added: \"I'm not sure that I'm at liberty to say what the Prime Minister has told me... but it was a constructive meeting\". 'It's something historic'  Mr De Wever also said that the meeting was timely and noted \"I've even been described as a Russian asset\" for his stance on the proposal. \"It worries me a lot, of course. The exposure risk is huge. €190bn plus damages, and litigation that could go on, go on for two decades. \"It's a tall order, because until two months ago, we considered this to be an operation that we would never do... It's not a detail. It's something historic. \"So to get that all in the right wording, with the right reassurances, it's quite something.\" A Downing Street spokesperson said in a statement that Mr De Wever and Sir Keir \"discussed ongoing work, together with European partners, on addressing Ukraine's financial needs, including through the use of the value of immobilised Russian Sovereign Assets\". \"They agreed to continue to work together closely to make progress on this complex issue,\" they added. Read more from Sky News:Everyone in new Epstein photos identifiedUK 'rapidly developing' plans to prepare for war EU indefinitely freezes assets It comes as Russia's central bank said on Friday that the plan was \"illegal\" and that it reserved the right to take any means necessary to protect its interests. Meanwhile, the EU has indefinitely frozen Russia's assets in Europe using a special procedure meant for economic emergencies to prevent the billions of euros from being used to support Ukraine. Hungarian prime minister Viktor Orban - who has friendly relations with Russian President Vladimir Putin - accused the European Commission, which prepared the decision, \"of systematically raping European law.\" \"It is doing this in order to continue the war in Ukraine, a war that clearly isn't winnable,\" he added on social media. Slovakian prime minister Robert Fico has also said that he would refuse to support any move that \"would include covering Ukraine's military expenses for the coming years\".  Zelenskyy to visit Ukraine, Sky News learns It comes as Sky News learnt from a source that Ukrainian President Volodymyr Zelenskyy is planning to visit Berlin on Monday. He is set to meet German chancellor Friedrich Merz and also speak with representatives of Britain and France, it's understood. It also comes as Ukraine's deputy energy minister said that Russia has launched 1,800 missiles, 50,000 drones and attacked energy facilities 4,500 times since the start of the year. Roman Andarak told a briefing: \"There are no examples in recent history of an energy system existing under such conditions - such large-scale, targeted terror. \"Unfortunately, this terror is intensifying every day.\""
    },
    {
        "title": "Sudan: UK sanctions four paramilitary commanders over 'mass killings'",
        "description": "The UK has sanctioned senior commanders of Sudan's Rapid Support Forces (RSF) over suspected heinous violence including mass killings, systematic sexual violence and deliberate attacks on civilians.",
        "url": "https://news.sky.com/story/sudan-uk-sanctions-four-paramilitary-commanders-over-mass-killings-13482703",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-rsf-darfur_7048447.jpg?20251011155616",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-12-12 19:50:00",
        "Headline": "Abdul Rahim Hamdan Dagalo was responsible for \"grave breaches\" of humanitarian law, the UK said, among them mass killings, ethnically targeted executions, and sexual violence including gang rape.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  The UK has sanctioned senior commanders of Sudan's Rapid Support Forces (RSF) over suspected heinous violence including mass killings, systematic sexual violence and deliberate attacks on civilians. The commanders were designated on Friday after documented atrocities committed by RSF troops in El Fasher, the capital of North Darfur. Deputy commander Abdul Rahim Hamdan Dagalo, the brother of RSF leader Mohamed Hamdan \"Hemedti\" Dagalo, is among four commanders of the paramilitary group that will face asset freezes and travel bans. Hemedti himself is not on the list of sanctions. El Fasher was captured by the RSF on 26 October after an 18-month siege against the Sudanese Armed Forces (SAF). The RSF co-ordinated a campaign of enforced starvation, shelling and drone strikes with widespread civilian casualties. In September, Sky News travelled to North Darfur and reported on volunteers being killed and arrested by the RSF for attempting to smuggle food and medicine into the city at the height of the siege. Food smuggling co-ordinators told us they had no choice but to try to save the city from \"a slow genocide\". Other volunteers pleaded with us to urge the world to save Darfur and condemned the \"inhumanity\" of the global apathy. Many of the people we met in North Darfur lost loved ones to the RSF's violent takeover of the city. After the capture of El Fasher, sometimes spelled Al Fashir, RSF fighters filmed themselves killing civilians in the fields around the city as they attempted to flee. \n                  Sudan's RSF says it has captured Babanusa in West Kordofan \n                 \n                  Sudan 'epicentre of suffering in the world', says UN humanitarian chief\n                 \n                  Sudan's paramilitary forces agree to US-led proposal for humanitarian ceasefire\n                 A Sky News investigation with Lighthouse Reports and Sudan War Monitor revealed that hundreds of civilians were rounded up in school yards in a town bordering the road out of the city. A survivor told us they were forced to bury with their own hands fellow captives who were killed by the RSF on the basis of ethnicity. Satellite images analysed by Sky News found that an existing cemetery in Gurnei was extended in the days that followed 26 October, corresponding with testimony of new burials. Yale Humanitarian Labs analysed high-resolution satellite imagery from the streets of El Fasher in the days after the RSF capture. Their analysis showed objects in the streets that correspond with corpses and large red-coloured stains likely to be blood. A civilian who escaped the slaughter told us they were stepping over bodies on their way out of the city. An RSF insider said that at least 7,000 people were killed by their troops in the first five days of capture and that sanctioned RSF deputy commander Abdul Rahim Dagalo commanded the entire operation. Celebratory footage shared by the RSF shows him in the city only hours after it fell. In a document naming the sanctioned individuals, the UK government said Dagalo was responsible for engaging in, supporting, or promoting \"serious violations of international humanitarian law in Sudan\". Read more:Genocide is unfolding in Darfur, warns Sudanese government63 children killed in attacks on Sudan kindergarten and hospital These \"grave breaches\" comprise \"the mass killings of civilians; ethnically targeted executions; sexual violence, including gang rape; abductions for ransom; widespread arbitrary detentions; and attacks on health facilities, medical staff and humanitarian workers\". Also sanctioned was major general Osman Mohamed Hamid Mohamed, the head of the RSF's Operations Department, as well as brigadier general Al-Fateh Abdullah Idris and field commander Tijani Ibrahim Moussa Mohamed. The RSF has been battling the Sudanese Armed Forces (SAF) for control of Sudan since April 2023. The paramilitary group held the capital Khartoum for two years before it was recaptured by the army in March. Fighting pivoted to Darfur as the RSF tightened its siege on El Fasher and massacred the nearby Zamzam displacement camp before closing in on the city. The epicentre of the war has now shifted to three fronts in the southwest Kordofan, threatening to tear Sudan into two. The RSF has made recent gains; seizing the key city of Babanusa in West Kordofan - a railway city that connects the west, east, south and north of the country - and the oil-rich town of Heglieg on the border with Sudan's South Kordofan State and South Sudan."
    },
    {
        "title": "Maduro's 'narco nephews' hit with sanctions as Trump tightens screw on Venezuela",
        "description": "The US has issued new sanctions targeting Venezuela, President Nicolas Maduro&#8217;s family, oil tankers and shipping companies, as Washington ramps up pressure on Caracas.",
        "url": "https://news.sky.com/story/maduros-narco-nephews-hit-with-sanctions-as-trump-tightens-screw-on-venezuela-13482472",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maduro-flores_7108066.jpg?20251212100201",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-12 09:33:00",
        "Headline": "The US has issued new sanctions targeting Venezuelan president Nicolas Maduro’s family, six oil tankers and shipping companies linked to them.",
        "Content": " The US has issued new sanctions targeting Venezuela, President Nicolas Maduro’s family, oil tankers and shipping companies, as Washington ramps up pressure on Caracas. The measures target three of the president's wife's nephews as well as six crude oil tankers and six shipping companies linked to them . The action came as the US continues its large-scale military build-up in the southern Caribbean and as US President Donald Trump campaigns for Maduro's removal from power. Trump warned on Thursday that the US would soon begin land strikes in Venezuela to stop narcotics shipments travelling via land routes. So-called 'narco nephews' targeted  Franqui Flores and Efrain Antonio Campo Flores, nephews of Venezuelan first lady Cilia Flores, have both been hit with sanctions. The two were dubbed the \"narco nephews\" after their arrest in Haiti in 2015 in a US drug enforcement administration sting operation. \n                  Would Trump really invade Venezuela?\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 \n                  'Venezuela has already been invaded' says Nobel Peace Prize winner Machado when asked about Trump intervention\n                 They were convicted in 2016 on charges that they tried to carry out a multimillion-dollar cocaine deal and sentenced to 18 years in prison, but were released in a 2022 prisoner swap with Venezuela. A third nephew, Carlos Erik Malpica Flores, who the US says was involved in a corruption plot at the state oil company, is also sanctioned. US strikes on alleged drug boats  The US has already been carrying out legally contested strikes against what it claims were boats transporting drugs. On Wednesday, Trump said the US had seized a sanctioned oil tanker off the coast of Venezuela - with the White House later confirming the ship will be taken to a US port. The oil on board will also be seized by the US, according to the White House press secretary, Karoline Leavitt. The US treasury department, said it had now imposed sanctions on six shipping companies moving Venezuelan oil, as well as six crude oil tankers. It described the tankers as having \"engaged in deceptive and unsafe shipping practices\" and said they continued to \"provide financial resources that fuel Maduro's corrupt narco-terrorist regime\". Four of the tankers are Panama-flagged. The other two are registered in the Cook Islands, and Hong Kong, respectively. The targeted vessels are supertankers that recently loaded crude oil in Venezuela, according to state oil company PDVSA's internal shipping documents. The Venezuelan communications ministry, which handles press inquiries for the government, did not immediately respond to a request for comment. Maduro and his government have vehemently denied links to crime and say that the US is pursuing regime change in order to take control of Venezuela's vast oil reserves. In a visit to the Pinto Salinas neighbourhood, Maduro claimed: \"The imperialists thought that our people would falter, but here no one faltered, and no one will ever falter.\" Read more:How seized oil tanker tried to evade noticeAirlines cancel Venezuelan flights David Goldwyn, a former energy diplomat at the US state department said the sanctions on the six vessels could lay the groundwork for the US to try and seize them. \"This is a powerful intimidation tactic. Certainly, any sanctioned vessel owner will think twice about lifting Venezuelan crude for fear of losing the vessel entirely. \"And those that are not sanctioned will certainly be concerned about being boarded or designated going forward,\" Goldwyn said. Francisco Monaldi, from Rice University's Baker Institute, said the impact of the seizure and further sanctions would depend on US enforcement. But he said that the risks were now higher for ships departing from Venezuelan waters, especially for shadow fleet and sanctioned vessels. He added that that would at least \"force wider price discounts for Venezuela's oil or more flexible terms by PDVSA not to lose customers and could hit export volumes too\"."
    },
    {
        "title": "'I stand before you a free man', says Kilmar Abrego Garcia as judge blocks ICE from detaining him",
        "description": "A US federal judge has barred Immigration and Customs Enforcement (ICE) from detaining Kilmar Abrego Garcia hours after his release from custody. ",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-freed-from-immigration-detention-centre-on-judges-orders-as-he-fights-to-stay-in-us-13482414",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kilmar-abrego-migrant_7108200.jpg?20251212124255",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-12 05:52:00",
        "Headline": "Abrego Garcia became a flashpoint of the Trump administration's immigration crackdown earlier this year when he was wrongly deported to El Salvador.",
        "Content": "A US federal judge has barred Immigration and Customs Enforcement (ICE) from detaining Kilmar Abrego Garcia hours after his release from custody.  Abrego Garcia, who became a flashpoint of the Trump administration's immigration crackdown earlier this year when he was wrongly deported to El Salvador, was freed from an ICE detention facility in Pennsylvania on Thursday. He appeared on Friday morning for an appointment at an ICE field office, some 14 hours after he was released on a judge's orders. Abrego Garcia stopped at a news conference outside the building, escorted by a group of supporters chanting, \"We are all Kilmar!\" \"I stand before you a free man and I want you to remember me this way, with my head held up high,\" Abrego Garcia said through a translator. \"I come here today with so much hope and I thank God who has been with me since the start with my family.\" He called on supporters to keep campaigning. \"I stand here today with my head held high and I will continue to fight and stand firm against all of the injustices this government has done upon me,\" Abrego Garcia said. \"Regardless of this administration, I believe this is a country of laws and I believe that this injustice will come to an end.\" When he had finished speaking, Abrego Garcia went through security at the field office, escorted by supporters. His lawyers had asked the judge to block authorities from detaining him again. US District Judge Paula Xinis in Maryland said officials cannot re-detain him until the court conducts a hearing on the motion for the temporary restraining order. Abrego Garcia, 30, who was taken into custody in August, returned to his home in Beltsville, Maryland, a few hours after his release from detention on Thursday. He was freed from ICE custody just before 5pm following a court ruling by Judge Xinis in Maryland. She wrote federal authorities detained him after he returned to the US without any legal basis. Abrego Garcia, who was mistakenly deported and then returned to the US, is a Salvadoran citizen with an American wife and child who has lived in Maryland for years. He entered the country illegally as a teenager to join his brother who had become a US citizen. In 2019, an immigration judge granted him protection from being deported back to El Salvador, where he said he faced danger from a gang that targeted his family. Though he was permitted to live and work in the US under ICE supervision, he was not handed residency status. Earlier this year, he was mistakenly deported and detained in a Salvadoran prison, despite having no criminal record. Facing growing public pressure and a court order, the Trump administration brought him back to the US in June, but only after issuing an arrest warrant on human smuggling charges in Tennessee. Abrego Garcia, who has applied for asylum in the US, has pleaded not guilty to those charges and asked a federal judge there to dismiss them. He was released from jail in Tennessee, but taken into custody again.  The 2019 settlement found he had a \"well-founded fear\" of danger in El Salvador if he was deported. Instead, ICE has been looking to deport him to a series of African countries. Abrego Garcia has sued, claiming the Trump administration is illegally using the removal process to punish him for the public humiliation caused by his deportation. Read more from Sky News:Charlie Kirk shooting suspect in courtLife-threatening floods hit Washington State  In her order releasing Abrego Garcia, the judge wrote that federal authorities \"did not just stonewall\" the court, \"they affirmatively misled the tribunal\". The Department of Homeland Security strongly criticised the court order and vowed to lodge an appeal, calling the ruling \"naked judicial activism\" by a judge appointed during the Obama administration. White House press secretary Karoline Leavitt also told reporters the Trump administration would be appealing against the decision. Abrego Garcia's lawyer, Simon Sandoval-Moshenberg, said he was prepared to defend his client against further attempts to deport him. He said the judge made it clear the government cannot detain someone indefinitely without legal authority and that his client \"has endured more than anyone should ever have to\"."
    },
    {
        "title": "British backpacker jailed after drunk e-scooter crash killed father-of-two in Australia",
        "description": "A 25-year-old British backpacker has been sentenced to four years in prison after a fatal collision with a father-of-two while riding an electric scooter in Perth, Western Australia.",
        "url": "https://news.sky.com/story/british-backpacker-jailed-after-drunk-e-scooter-crash-killed-father-of-two-in-australia-13482408",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-alicia-kemp-tiktok_6987775.jpg?20250811041756",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-12 04:33:00",
        "Headline": "Alicia Kemp, 25, from Redditch, Worcestershire, was over the legal alcohol limit when she hit 51-year-old Thanh Phan, who later died in hospital, sparking renewed safety concerns over e-scooters in Australia.",
        "Content": " A 25-year-old British backpacker has been sentenced to four years in prison after a fatal collision with a father-of-two while riding an electric scooter in Perth, Western Australia. Alicia Kemp, from Redditch, Worcestershire, appeared at Perth District Court on Friday, where she pleaded guilty to dangerous driving causing death while under the influence of alcohol. Judge Wendy Hughes handed down a four-year sentence, backdated to June 2025 for time served, with a non-parole period of two years. Kemp could be eligible for release in mid-2027, and her driver's licence has been suspended for two years. She was over the legal blood alcohol limit when she struck 51-year-old Thanh Phan on 31 May. Mr Phan later died in hospital from a brain bleed. Kemp and a passenger on the e-scooter sustained minor injuries. Read more from Sky News:Asylum seekers disappearing 'daily' from hotelsHundreds of artefacts stolen from Bristol museum \n                  Belgian prime minister tells Sky News he is 'sceptical' about Ukraine loan using Russian assets\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 \n                  Venezuela latest: Trump threatens land strikes 'soon' - and sanctions 'narco nephews'\n                 The incident has sparked a national debate about e-scooter safety, prompting Perth and several surrounding councils to suspend hire services indefinitely. In a statement, Mr Phan's family described him as a \"beloved husband, father-of-two and dear friend\". Dangerous driving causing death carries a maximum sentence of 20 years in Western Australia. E-scooter riders in the state must be over 16, wear a helmet, carry no passengers, and remain sober while riding."
    },
    {
        "title": "Would Trump really invade Venezuela?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/why-is-the-united-states-about-to-invade-venezuela-13482407",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-12 03:14:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   A significant escalation in tensions between the US and Venezuela. On Wednesday, Donald Trump announced that his military had seized an oil tanker off the coast of the South American country. Then, a day later, the president says a land invasion is about to start. On the podcast today, we'll explain what's happened, what could happen next, and answer why America is even interested in Venezuela. Plus - Kilmar Abrego Garcia is released after months of detention, and how you can become a US citizen, for the small price of just one million dollars. You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Democrats release more photos from Epstein estate showing Trump, Clinton, Andrew and others",
        "description": "Donald Trump, Andrew Mountbatten-Windsor and Bill Clinton are among high-profile figures pictured in a new selection of photos from Jeffrey Epstein's estate, released by Democrats in Congress.",
        "url": "https://news.sky.com/story/whos-pictured-in-the-newly-released-photos-from-epstein-estate-13482625",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-epstein-files_7108618.jpg?20251212211540",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-12 16:17:00",
        "Headline": "The photos were shared by House Oversight Committee Democrats, who said they are reviewing more than 95,000 images from the estate.",
        "Content": " Donald Trump, Andrew Mountbatten-Windsor and Bill Clinton are among high-profile figures pictured in a new selection of photos from Jeffrey Epstein's estate, released by Democrats in Congress. Warning: This article contains images of a sexual nature that some readers may find offensive. An initial tranche of 19 photos was shared on Friday, and all of the people whose faces had not been redacted were identified by Sky News. They have been contacted for comment. A second batch of dozens of photos was released the same day, including one of former Israeli prime minister Ehud Barak and another of Epstein himself in the bath. Latest updates from release of Epstein photos The photos were shared by House Oversight Committee Democrats, who said they are reviewing more than 95,000 images from the estate. There is no suggestion of wrongdoing on the part of those pictured in the images released on Friday and the context surrounding the photos is not known. Mr Barak told the New York Times this week: \"I now deeply regret having any association with him. \"However, not any point in my dealings with him I did ever witness any improper behaviour and certainly I never participated in anything like that.\" In one image, Mr Trump is seen with the late sex offender Jeffrey Epstein and Belgian model Ingrid Seynhaeve. Two further photos show the US president with women whose faces are redacted. One image is black and white and shows him with six women; three on either side of him. The other is out of focus, and shows him sitting alongside an unidentified woman.  Asked about the latest photos, the US president told reporters at the White House: \"He [Epstein] was all over Palm Beach. He has photos with everybody. I mean, almost - there are hundreds and hundreds of people that have photos with him. So that's no big deal.\"  White House spokeswoman Abigail Jackson said the Trump administration \"has done more for Epstein's victims than Democrats ever have\". \"It's time for the media to stop regurgitating Democrat talking points and start asking Democrats why they wanted to hang around Epstein after he was convicted,\" she added. Speaking after Epstein took his own life in jail in 2019, Mr Trump admitted knowing Epstein, but added: \"I had a falling out with him. I haven't spoken to him in 15 years. I was not a fan of his, that I can tell you.\" In July, the White House also released a statement saying Epstein had been banned from Trump's Mar-a-Lago resort in Florida for acting like a \"creep\". In 2019, a spokesperson for the former US president said he had \"not spoken to Epstein in well over a decade\" and \"knows nothing about the terrible crimes\". In other photos released on Friday, Bill Clinton is seen with Epstein and convicted sex offender Ghislaine Maxwell, as well as singer Jimmy Buffett and Mr Buffett's wife Jane Slagsvol. Further images show Epstein with long-time Trump ally, Steve Bannon. In one he sits across from him at his desk, while in another the men are seen side-by-side taking a selfie in a mirror. Mr Bannon appeared again in the later batch of images, photographed alongside Noam Chomsky, an American professor perhaps best known for his political activism.  Hollywood filmmaker Woody Allen appears in four photos; two of them taken with Epstein. In another, Allen is photographed with Mr Bannon, while one more shows him sat with Bill Clinton's former treasury secretary, Larry Summers, and his wife Elisa New, seemingly on a private plane. Speaking to The Times in September, Allen said he had been to dinner at Epstein's home, but suggested he was unaware of the nature of his crimes. Allen said: \"He told us he'd been in jail and that he had been - I can't remember the word - but that he'd been falsely put in jail in some way.\" Meanwhile, Mr Summers told the Harvard Crimson that his former association with Epstein was \"a major error of judgement\". Andrew Mountbatten-Windsor, then Prince Andrew, is seen just once, alongside tech billionaire Bill Gates. Epstein is not pictured. The original photo at a malaria summit also shows the then Prince Charles but he is cropped out of the version released by the Democrats. It is not clear why the picture has been included in the Epstein files. Andrew relinquished his titles in October amid continued controversy over his friendship with Epstein, but said at the time: \"I vigorously deny the accusations against me\". Mr Gates himself appears twice more, once alongside Epstein's long-time pilot, Larry Visoski, and once in a framed photo which appears in an image above a black cabinet. In 2021, the tech billionaire told the New York Times he had met Epstein to discuss philanthropy and Gates's spokeswoman said he regretted ever meeting him. The following year Mr Gates told the BBC: \"I made a mistake ever meeting with Jeffrey Epstein. \"Any meeting I had with him could be viewed as almost condoning his evil behaviour. So, that was a mistake.\" Another photo shows British entrepreneur Richard Branson with Epstein and Dean Kamen, an American engineer, inventor, and businessman. Epstein is seen with his lawyer, Alan Dershowitz, in one more image. Mr Dershowitz said he fell out with Epstein after making a plea deal for him in 2007, leading to his conviction. He told the Harvard Crimson in November: \"Jeffrey Epstein despised me after I had made the deal. Epstein and I did not get along personally after I represented him and helped get the deal.\" Emirati businessman Ahmed bin Sulayem is also among those pictured, appearing twice in the second cache of photos. A number of images of a sexual nature appear in the first cache. One shows a bowl of novelty condoms with a caricature of Trump's face, each one bearing the phrase \"I'm HUUUUGE!\" A handwritten sign reads: \"Trump condom $4.50.\" Various sex toys are also featured in pictures, including a glove with ribbed fingers, and a safety notice from a \"jawbreaker\" gag warning of the risk of injury or death. Many of the newer batch of photos appear to show parts of Epstein's properties, including a toilet, various service areas, and a small beachfront construction project. Among the photos are several additional images which are thought to be from the disgraced financier's private island, Little Saint James, showing a dental suite previously seen in an earlier release of pictures. The images, obtained from the Epstein estate, were released by Democrats on the House Oversight Committee in a bid to pressure the US Justice Department to release the full Epstein files. President Trump signed a bill in November compelling the department to release case files within 30 days, in a U-turn after he opposed the bill for months. The end of that window is Friday 19 December. The images released on Friday were described by Democrats as being \"of the wealthy and powerful men who spent time with Jeffrey Epstein\" and \"photographs of women and Epstein properties\". A spokesperson for the Republican-led House Oversight Committee accused the Democrats of \"cherry-picking photos and making targeted redactions\" to create a \"false narrative\" about Donald Trump. \"Democrats' hoax against President Trump has been completely debunked,\" they added."
    },
    {
        "title": "'I stand before you a free man', says Kilmar Abrego Garcia as judge blocks ICE from detaining him",
        "description": "A US federal judge has barred Immigration and Customs Enforcement (ICE) from detaining Kilmar Abrego Garcia hours after his release from custody. ",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-freed-from-immigration-detention-centre-on-judges-orders-as-he-fights-to-stay-in-us-13482414",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kilmar-abrego-migrant_7108200.jpg?20251212124255",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-12 05:52:00",
        "Headline": "Abrego Garcia became a flashpoint of the Trump administration's immigration crackdown earlier this year when he was wrongly deported to El Salvador.",
        "Content": "A US federal judge has barred Immigration and Customs Enforcement (ICE) from detaining Kilmar Abrego Garcia hours after his release from custody.  Abrego Garcia, who became a flashpoint of the Trump administration's immigration crackdown earlier this year when he was wrongly deported to El Salvador, was freed from an ICE detention facility in Pennsylvania on Thursday. He appeared on Friday morning for an appointment at an ICE field office, some 14 hours after he was released on a judge's orders. Abrego Garcia stopped at a news conference outside the building, escorted by a group of supporters chanting, \"We are all Kilmar!\" \"I stand before you a free man and I want you to remember me this way, with my head held up high,\" Abrego Garcia said through a translator. \"I come here today with so much hope and I thank God who has been with me since the start with my family.\" He called on supporters to keep campaigning. \"I stand here today with my head held high and I will continue to fight and stand firm against all of the injustices this government has done upon me,\" Abrego Garcia said. \"Regardless of this administration, I believe this is a country of laws and I believe that this injustice will come to an end.\" When he had finished speaking, Abrego Garcia went through security at the field office, escorted by supporters. His lawyers had asked the judge to block authorities from detaining him again. US District Judge Paula Xinis in Maryland said officials cannot re-detain him until the court conducts a hearing on the motion for the temporary restraining order. Abrego Garcia, 30, who was taken into custody in August, returned to his home in Beltsville, Maryland, a few hours after his release from detention on Thursday. He was freed from ICE custody just before 5pm following a court ruling by Judge Xinis in Maryland. She wrote federal authorities detained him after he returned to the US without any legal basis. Abrego Garcia, who was mistakenly deported and then returned to the US, is a Salvadoran citizen with an American wife and child who has lived in Maryland for years. He entered the country illegally as a teenager to join his brother who had become a US citizen. In 2019, an immigration judge granted him protection from being deported back to El Salvador, where he said he faced danger from a gang that targeted his family. Though he was permitted to live and work in the US under ICE supervision, he was not handed residency status. Earlier this year, he was mistakenly deported and detained in a Salvadoran prison, despite having no criminal record. Facing growing public pressure and a court order, the Trump administration brought him back to the US in June, but only after issuing an arrest warrant on human smuggling charges in Tennessee. Abrego Garcia, who has applied for asylum in the US, has pleaded not guilty to those charges and asked a federal judge there to dismiss them. He was released from jail in Tennessee, but taken into custody again.  The 2019 settlement found he had a \"well-founded fear\" of danger in El Salvador if he was deported. Instead, ICE has been looking to deport him to a series of African countries. Abrego Garcia has sued, claiming the Trump administration is illegally using the removal process to punish him for the public humiliation caused by his deportation. Read more from Sky News:Charlie Kirk shooting suspect in courtLife-threatening floods hit Washington State  In her order releasing Abrego Garcia, the judge wrote that federal authorities \"did not just stonewall\" the court, \"they affirmatively misled the tribunal\". The Department of Homeland Security strongly criticised the court order and vowed to lodge an appeal, calling the ruling \"naked judicial activism\" by a judge appointed during the Obama administration. White House press secretary Karoline Leavitt also told reporters the Trump administration would be appealing against the decision. Abrego Garcia's lawyer, Simon Sandoval-Moshenberg, said he was prepared to defend his client against further attempts to deport him. He said the judge made it clear the government cannot detain someone indefinitely without legal authority and that his client \"has endured more than anyone should ever have to\"."
    },
    {
        "title": "Maduro's 'narco nephews' hit with sanctions as Trump tightens screw on Venezuela",
        "description": "The US has issued new sanctions targeting Venezuela, President Nicolas Maduro&#8217;s family, oil tankers and shipping companies, as Washington ramps up pressure on Caracas.",
        "url": "https://news.sky.com/story/maduros-narco-nephews-hit-with-sanctions-as-trump-tightens-screw-on-venezuela-13482472",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maduro-flores_7108066.jpg?20251212100201",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-12 09:33:00",
        "Headline": "The US has issued new sanctions targeting Venezuelan president Nicolas Maduro’s family, six oil tankers and shipping companies linked to them.",
        "Content": " The US has issued new sanctions targeting Venezuela, President Nicolas Maduro’s family, oil tankers and shipping companies, as Washington ramps up pressure on Caracas. The measures target three of the president's wife's nephews as well as six crude oil tankers and six shipping companies linked to them . The action came as the US continues its large-scale military build-up in the southern Caribbean and as US President Donald Trump campaigns for Maduro's removal from power. Trump warned on Thursday that the US would soon begin land strikes in Venezuela to stop narcotics shipments travelling via land routes. So-called 'narco nephews' targeted  Franqui Flores and Efrain Antonio Campo Flores, nephews of Venezuelan first lady Cilia Flores, have both been hit with sanctions. The two were dubbed the \"narco nephews\" after their arrest in Haiti in 2015 in a US drug enforcement administration sting operation. \n                  Would Trump really invade Venezuela?\n                 \n                  Moving in the shadows: Why tanker seized by US off Venezuela was 'spoofing' its location\n                 \n                  'Venezuela has already been invaded' says Nobel Peace Prize winner Machado when asked about Trump intervention\n                 They were convicted in 2016 on charges that they tried to carry out a multimillion-dollar cocaine deal and sentenced to 18 years in prison, but were released in a 2022 prisoner swap with Venezuela. A third nephew, Carlos Erik Malpica Flores, who the US says was involved in a corruption plot at the state oil company, is also sanctioned. US strikes on alleged drug boats  The US has already been carrying out legally contested strikes against what it claims were boats transporting drugs. On Wednesday, Trump said the US had seized a sanctioned oil tanker off the coast of Venezuela - with the White House later confirming the ship will be taken to a US port. The oil on board will also be seized by the US, according to the White House press secretary, Karoline Leavitt. The US treasury department, said it had now imposed sanctions on six shipping companies moving Venezuelan oil, as well as six crude oil tankers. It described the tankers as having \"engaged in deceptive and unsafe shipping practices\" and said they continued to \"provide financial resources that fuel Maduro's corrupt narco-terrorist regime\". Four of the tankers are Panama-flagged. The other two are registered in the Cook Islands, and Hong Kong, respectively. The targeted vessels are supertankers that recently loaded crude oil in Venezuela, according to state oil company PDVSA's internal shipping documents. The Venezuelan communications ministry, which handles press inquiries for the government, did not immediately respond to a request for comment. Maduro and his government have vehemently denied links to crime and say that the US is pursuing regime change in order to take control of Venezuela's vast oil reserves. In a visit to the Pinto Salinas neighbourhood, Maduro claimed: \"The imperialists thought that our people would falter, but here no one faltered, and no one will ever falter.\" Read more:How seized oil tanker tried to evade noticeAirlines cancel Venezuelan flights David Goldwyn, a former energy diplomat at the US state department said the sanctions on the six vessels could lay the groundwork for the US to try and seize them. \"This is a powerful intimidation tactic. Certainly, any sanctioned vessel owner will think twice about lifting Venezuelan crude for fear of losing the vessel entirely. \"And those that are not sanctioned will certainly be concerned about being boarded or designated going forward,\" Goldwyn said. Francisco Monaldi, from Rice University's Baker Institute, said the impact of the seizure and further sanctions would depend on US enforcement. But he said that the risks were now higher for ships departing from Venezuelan waters, especially for shadow fleet and sanctioned vessels. He added that that would at least \"force wider price discounts for Venezuela's oil or more flexible terms by PDVSA not to lose customers and could hit export volumes too\"."
    },
    {
        "title": "UK economy shrank by 0.1% in October, official figures show",
        "description": "The UK economy contracted by 0.1% in October, according to official figures.",
        "url": "https://news.sky.com/story/economy-shrinks-by-01-in-october-official-figures-show-13482426",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-city-of-london-boe_7107957.jpg?20251212072138",
        "type": "Business",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-12-12 06:19:00",
        "Headline": "The fall in gross domestic product comes after a similar surprise 0.1% drop in September and 0% growth in August. Economists had predicted a modest return to growth.",
        "Content": "By Daniel Binns, business reporter  The UK economy contracted by 0.1% in October, according to official figures. The surprise fall in gross domestic product (GDP) - a measure of economic output - comes after a similar unexpected 0.1% drop in September and 0% growth in August. Economists polled by the Reuters news agency had predicted that October GDP would grow by 0.1%. The figures, from the Office for National Statistics (ONS), represent more bad news for the chancellor over the state of the UK economy. Commentators had warned that consumer spending was likely to be restrained in the run-up to November's budget, amid concerns about the impact of Rachel Reeves's potential measures on households and businesses. UK GDP has also been hit hard by disruption to car production caused by a cyber attack on Jaguar Land Rover. The ONS said that during October, the UK's services sector fell by 0.3%, while construction was down 0.6%. However, production grew by 1.1%. It found that GDP on a rolling three-month basis, to October, also fell by 0.1%. Read more from Sky News:Appeal court delay for first Post Office Capture caseMail owner lines up NatWest to help fund Telegraph bidBurger King UK lands new backing The ONS's director of economic statistics, Liz McKeown, said: \"Within production, there was continued weakness in car manufacturing, with the industry only making a slight recovery in October from the substantial fall in output seen in the previous month. \"Overall services showed no growth in the latest three months, continuing the recent trend of slowing in this sector. There were falls in wholesale and scientific research, offset by growth in rental and leasing and retail.\" Interest rate cut 'nailed on' Commentators also blamed rumours and leaks in the run-up to the budget for dampening demand. Scott Gardner, from banking giant JP Morgan, said that despite expectations of a return to growth, the economy continued to \"battle a period of inconsistent productivity\". He added: \"Speculation about potential budget announcements had a numbing effect on consumers and businesses in the lead up to the chancellor's speech at the end of November.\" Suren Thiru, from the Institute of Chartered Accountants, said the data increased the likelihood of the Bank of England cutting interest rates next week. He said: \"With these downbeat figures likely to further fuel fears among rate-setters over the health of the UK economy, a December policy loosening looks nailed on, particularly given the likely deflationary impact of the budget.\" Figures 'extremely concerning' Barret Kupelian, chief economist at PwC, said that while some of the blame could be attributed to the Jaguar Land Rover cyber attack, \"the bigger story is that speculation around the autumn budget kept households and businesses in wait-and-see mode\". He added: \"Given the timing of the budget, November's GDP print is likely to look similarly subdued before any post-budget effects start to show up.\" Sir Mel Stride, the Tory shadow chancellor, described the figures as \"extremely concerning\", claiming they were \"a direct result of Labour's economic mismanagement\". A Treasury spokesperson said: \"We are determined to defy the forecasts on growth and create good jobs, so everyone is better off, while also helping us invest in better public services.\""
    },
    {
        "title": "As GDP shrinks, it is not clear where the economic jump-start will come from",
        "description": "The British economy has been slowing since the summer but the long wait for a late-November budget applied an extra touch to the brakes, according to the latest growth figures from the Office for National Statistics.",
        "url": "https://news.sky.com/story/as-gdp-shrinks-it-is-not-clear-where-the-economic-jump-start-will-come-from-13482490",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cash-money_6983843.jpg?20250806070550",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-12 10:24:00",
        "Headline": "The slowdown should remove any lingering doubts that the Bank of England will agree an interest rate cut when it meets next week, the expected quarter-point trim taking the headline figure below 4% for the first time since January 2023.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The British economy has been slowing since the summer but the long wait for a late-November budget applied an extra touch to the brakes, according to the latest growth figures from the Office for National Statistics. A monthly contraction in GDP of 0.1% in October, and a similar fall in the three-month trend, was attributed to uncertainty about Rachel Reeves's plans amid an autumn blizzard of trails, leaks and speculation. The ONS said businesses across the \"production, construction and services\" reported waiting for the outcome of the budget. It was not the only factor - output was pulled down by the continued impact of the Jaguar Land Rover cyber-shutdown and services, the engine of the economy, were flat - but we can now put a price on the chancellor's prevarication. It is likely to have taken a toll on November's figures, too, making it likely that the year will end with a quarter of stalled growth, and raising questions about where a rebound may come from. The slowdown should remove any lingering doubts that the Bank of England will agree an interest rate cut when it meets next week, the expected quarter-point trim taking the headline figure below 4% for the first time since January 2023. The pace of cuts beyond that remains uncertain, but if the torpid performance continues, then another cut could come as early as February. \n                  UK economy shrank by 0.1% in October, official figures show\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 The Bank and the Office for Budget Responsibility both expect inflation to decline in 2026, too, which could help the economy climb out of the current slough. Read more: More bad news for chancellor as UK economy shrinks againLabour MPs split on Angela Rayner's future amid leadership speculation In a statement, the Treasury said the government was determined to defy forecasts, and cited a number of projects as examples of its pro-growth credentials, including new runways at Heathrow and Gatwick and the Sizewell C nuclear power station. What they all have in common are completion dates in the next decade, and with the budget scored as having no immediate pro-growth measures, and tax rises to come, it is not clear where the economic jump-start will come from."
    },
    {
        "title": "Jamie Oliver Group axes 20% of workforce ahead of high street comeback",
        "description": "Celebrity chef Jamie Oliver&#8217;s holding company has axed a fifth of its workforce, even as he plots a high street restaurant comeback six years after his Jamie&#8217;s Italian chain collapsed into administration.",
        "url": "https://news.sky.com/story/jamie-oliver-group-axes-20-of-workforce-ahead-of-high-street-comeback-13482521",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jamie-oliver-chef_7108173.jpg?20251212120913",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-12 12:07:00",
        "Headline": "The celebrity chef’s main commercial operation has completed a consultation process which involves 25 of its 126 employees being made redundant, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Celebrity chef Jamie Oliver’s holding company has axed a fifth of its workforce, even as he plots a high street restaurant comeback six years after his Jamie’s Italian chain collapsed into administration. Sky News has learnt that Jamie Oliver Group - which is not connected to the newly revived restaurant business - is making 25 of its 126 staff redundant. A spokeswoman confirmed by email that \"the consultation [process] is complete\" and the numbers of staff affected, but refused to answer further questions, including about why the restructuring was taking place and whether the 25 employees had formally left the company. The chef's group operations include his media activities such as digital content and partnerships with third parties. Last year, Kevin Styles, a former executive at Thomas Cook and the cinema chain Vue, stepped down as chief executive of Jamie Oliver Group after just over two years in the role. The company's spokeswoman said he had been replaced, but declined to provide further details, and no announcement about the changes was apparent on the group's website. The return to the British casual dining scene of Jamie's Italian is being orchestrated through a partnership with Brava Hospitality Group, the owner of Prezzo. Read more from Sky News:Economy shrank by 0.1% in OctoberMail owner lines up bank to fund Telegraph bidBurger King UK lands new backing \"As a chef, having the chance to return to the high street is incredibly important to me,\" Mr Oliver said last week. \"I will drive the menus, make sure the sourcing is right, the staff training, and ensure the look and feel of the restaurant is brought to life in the right way.\" The chain's demise in 2019 resulted in about 1,000 job losses and came after frantic efforts to find a buyer for the business."
    },
    {
        "title": "Nationwide fined £44m for financial crime failures",
        "description": "Nationwide has been fined &#163;44m for failing to do enough to combat financial crime.",
        "url": "https://news.sky.com/story/nationwide-fined-16344m-for-financial-crime-failures-13482468",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nationwide-bank_7108032.jpg?20251212095513",
        "type": "Business",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-12-12 09:13:00",
        "Headline": "The building society's anti-money laundering efforts have been \"inadequate\", says the Financial Conduct Authority. It failed to spot a customer receiving millions in fraudulent COVID furlough payments.",
        "Content": "By Daniel Binns, business reporter  Nationwide has been fined £44m for failing to do enough to combat financial crime. The Financial Conduct Authority (FCA) issued the penalty after criticising the building society's \"inadequate\" efforts at tackling offences such as money laundering. The regulator said this included Nationwide having ineffective policies and procedures for monitoring personal current accounts. The fine relates to failures during the period between October 2016 and July 2021. The FCA said that in one \"serious\" case, the building society missed opportunities to spot how a customer was using current accounts to receive millions of pounds in fraudulent COVID furlough payments during the pandemic. They were sent 24 payments totalling £27.3m over 13 months, including £26m deposited over eight days. HMRC managed to claw back most of the cash, but approximately £800,000 remains unrecovered. Money latest: Value of pound hit by surprise GDP figure The FAC said Nationwide had been aware that some customers had been \"using their personal accounts for business activity, in breach of its terms\". It added: \"Nationwide did not offer business current accounts at this point, so did not have the right processes in place to manage the financial crime risks from business activity.\" Read more from Sky News:Economy shrank by 0.1% in OctoberMail owner lines up bank to fund Telegraph bidBurger King UK lands new backing Therese Chambers, an FCA director, said: \"Nationwide failed to get a proper grip of the financial crime risks lurking within its customer base. It took too long to address its flawed systems and weak controls, meaning red flags were missed with serious consequences. \"Building societies and banks have a key role in the fight against financial crime. Firms must remain vigilant in this fight.\" A Nationwide spokesperson told Sky News: \"Nationwide identified these issues, which relate to controls in place before July 2021, through its own reviews, and voluntarily brought them to the attention of the FCA. \"The society cooperated fully with the FCA investigation, and we are sorry that our controls during the period fell below the high standards we expect. \"Since 2021, Nationwide has invested significantly in all aspects of its economic crime control framework in order to ensure our systems are robust.\" They added: \"We do not believe that these controls issues caused financial loss to any of our customers and remain committed to preventing economic crime and protecting our customers and the wider UK economy from fraud.\" The penalty is the latest in a string of fines handed out over financial crime failures by the FCA in recent years. In December 2022, the regulator fined Santander UK £107.8m for \"repeated money-laundering failures\", while in November 2024 Metro Bank was issued with a £16m penalty for similar reasons."
    },
    {
        "title": "Appeal court delay for first Capture case as Post Office requests extension",
        "description": "The first-ever Capture case has been delayed at the Court of Appeal as the Post Office asks for an extension to respond, Sky News has learned.\n ",
        "url": "https://news.sky.com/story/appeal-court-delay-for-first-capture-case-as-post-office-requests-extension-13482406",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-post-office-branch_6986135.jpg?20250809021535",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-12-12 04:00:00",
        "Headline": "Family's 27-year wait for justice continues as Post Office requests delay in landmark pre-Horizon appeal case.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The first-ever Capture case has been delayed at the Court of Appeal as the Post Office asks for an extension to respond, Sky News has learned.\n  Pat Owen, a former sub postmistress who has since passed away, was convicted of stealing in 1998 based on evidence from computer software. The system, known as Capture, was used in up to 2,500 branches in the 1990s, before the infamous Horizon system was introduced. Hundreds of sub-postmasters were wrongfully convicted between 1999 and 2015 as part of the Horizon scandal. Earlier this year, Sky News unearthed a 1998 report showing the Capture software was also faulty. That report, commissioned by the solicitors acting for Mrs Owen in 1998, was served on the Post Office and may never have been seen by the jury in her case.  Ms Owen was given a suspended prison sentence and fought to clear her name subsequently - but died in 2003. \n                  Post Office scandal: Police consider corporate manslaughter charges\n                 \n                  Conviction linked to third 'faulty' Post Office system referred to Court of Appeal\n                 \n                  Post Office agrees fresh extension to scandal-hit Fujitsu Horizon deal\n                 Her case was referred by the Criminal Cases Review Commission (CCRC) to the Court of Appeal in October. The Post Office had until 5 December to respond to papers put forward by Mrs Owen's defence team but they have now asked for an extension until 30 January. Ms Owen's daughter, Juliet Shardlow, described the family's suffering at the lengthening wait. \"I need to emphasise the profound impact the ongoing delay is having on our family,\" she said. \"The continuous uncertainty only compounds our heartache, stress, and anxiety.  \"It has become the last thing I think about before I go to sleep and the first thing when I wake up. \"We have waited 27 years for justice, and this additional wait feels never-ending.\" Ms Owen's case is the first time a conviction based on Capture has reached the Court of Appeal since the scandal was exposed. Read more from Sky News:Corporate manslaughter charges considered in Post Office scandal21 'Capture' cases investigated for miscarriages of justice Lawyers have said that if Ms Owen is exonerated posthumously, it may \"speed up\" the handling of others. CCRC chair Dame Vera Baird also told Sky News in the summer it could be a \"touchstone case\" for other victims. The CCRC is also continuing to investigate around 30 other \"pre-Horizon\" convictions. A Post Office spokesperson said: \"We have sought an extension of time to fully consider and respond to the CCRC's Statement of Reasons in Ms Owen's case. \"We deeply regret the impact our request for further time will have on Ms Owen's family. \"We have a duty to carefully consider the evidence presented in the Statement of Reasons submitted by the CCRC and do everything we can to fully assist the Court when it considers this conviction.\" Meanwhile, the first-ever redress scheme for victims of the Post Office Capture IT scandal was launched this autumn. The Capture Redress Scheme will provide payments of up to £300,000, and more in \"exceptional\" cases, to former postmasters who suffered financial losses."
    },
    {
        "title": "How much your data is worth - and how to stop people profiting from it",
        "description": "Companies generate massive profits from people's information, with experts describing user data as \"the new oil\".",
        "url": "https://news.sky.com/story/how-much-your-data-is-worth-and-how-to-stop-people-profiting-from-it-13482475",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-data-internet_7107912.jpg?20251212061244",
        "type": "Business",
        "Author": "Kieren Williams",
        "Date Published": "2025-12-12 09:42:00",
        "Headline": "Do you know the true value of your data? Businesses all over the internet certainly do know its worth - so here's what you can do about that.",
        "Content": "\n          News Reporter\n              @kjjjwilliams\n Companies generate massive profits from people's information, with experts describing user data as \"the new oil\". Some of these companies are household names but many are unknown, with one analyst comparing the relationship between companies and users as \"David vs Goliath\". Is there anything you can do about it, or are you resigned to having companies know all about you - and make money on it? How companies collect data Sam Jones, founder of Gener8, a company that helps users make money from their own data online, told our Money team how companies farmed data on users. \"Companies collect data about people through a range of methods, many of which operate quietly in the background as we go about our daily lives,\" he said. \"Most of us have heard of 'cookies', but perhaps many of us don't realise that a 'cookie' is really another word for a tracker. \"And when you click 'accept' on a cookie banner, you are not just allowing the website you are on to track you, but often you're allowing hundreds of different companies who are hidden in the website terms and conditions.\" Other methods of data collection include (but are not limited to): • Pixels: Tiny images embedded on websites and emails that track activity;• Device fingerprinting: Sites gather device-specific information (for example, screen size, browser type, font type) to create a unique way to identify it;• And mobile apps: Many include third-party software that sends data to other companies about users - this can be location or usage habits for example. There are also companies known as data brokers that compile information about users that can be sold to advertisers, insurers or even political groups. \"In the end, users are frequently handing over significant amounts of data without fully realising the scale of what's being collected, how it's being used, or who it's being shared with,\" Jones told Money. What data do companies collect? Experts say collected data largely falls into two categories: • Personal data: Information about users, such as name, email, phone number and location;• Behavioural data: Information about how users interact with websites, which ones they visit, what they search for, how they search, where they click and how long they spend on each part of the site. Combined, these can be used to predict interests, habits and even life events. Why do companies collect data? Advertising is one of the main - and most profitable - reasons companies collect data. If companies understand users better, they're better placed to sell them products (or help others sell them products). We've already mentioned data brokers, which sell the user information itself to companies that are hoping to reach people for a variety of reasons. Another big use is research, because knowing more about users lets companies spot trends (or problems) and inform decision-making. But Oliver Devane, senior security researcher at McAfee, explained to Money that information gathering wasn't all sinister. \"One reason why is basically to improve the user experience as well,\" Devane said. He gave the example of a video-sharing platform tailoring its experience to a football fan by showing them videos of the sport and their club. Tilman Harmeling, a data protection expert at Userscentrics, added that some data collection companies undertook was a legal requirement. What can you do about it? It can seem daunting, knowing that information about you is out on the internet, and our experts have tips to help - but it's not easy. Money was repeatedly told that the best first step was to be aware of where your data is on the internet. Various online tools will, for a price, scrape through the internet to see which companies have a user's information and remove it for them. But to do this yourself (for free), you need to conduct a personal digital audit. This can be done by: • Go through your emails and see what you're signed up to;• And search your name and phone number on various search engines to see where you pop up. Once you've identified where your information exists, you can go about scrubbing it. Sites that may have your data will have a privacy policy (they all do), and Devane says to look out for sections that refer to users' rights or data. From here, you can often find how to request a deletion, or can contact the company to do so. Read more:Bad news for chancellor as UK economy shrinks againDaily Mail owner lines up Natwest to help fund Telegraph bidBurger King UK lands new backing from buyout firm With more recent privacy laws, you can also submit legal requests to take down your data - for example, Google's Results About You tool. Forgotten accounts can also be a hub of a user's data on the internet, so don't forget to purge them, deleting any unused profiles. Similarly, be cautious about who you share your data with from the off and be choosy about app permissions on your mobile - delete old and unused apps because fewer apps mean fewer avenues of data collection. Meanwhile, on social media pages, it's always worth being aware of what you're sharing and what your privacy settings are. There are also technical ways to protect your data online, according to Devane. He said people could use protection software such as VPNs. Our experts generally recommended that people do a clean-up regularly, but all acknowledge the difficulty of this and how the issue is stacked against users."
    },
    {
        "title": "Attempting to rejoin EU customs union 'complete fuel for Reform', Starmer warned",
        "description": "Attempting to rejoin an EU customs union would be \"complete fuel for Reform\", Sir Keir Starmer has been warned.",
        "url": "https://news.sky.com/story/attempting-to-rejoin-eu-customs-union-complete-fuel-for-reform-starmer-warned-13482172",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-nigel-farage_7035938.jpg?20250929112858",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-12 05:00:00",
        "Headline": "A Liberal Democrat bill calling on the government to begin negotiations on joining an EU customs union was backed by 13 Labour MPs.",
        "Content": "Attempting to rejoin an EU customs union would be \"complete fuel for Reform\", Sir Keir Starmer has been warned. Labour peer Harriet Harman told Beth Rigby on the Electoral Dysfunction podcast she thinks the government may not rejoin the current customs union, but will be part of elements of it. On Tuesday, 13 Labour MPs backed a Liberal Democrat bill calling on the government to begin negotiations on joining a bespoke customs union with the EU. Sir Keir recently said such a move was \"not currently our policy\", but the vote, which has gone through to a second reading, has prompted suggestions the UK could join a new personalised trading partnership with the EU. Baroness Harman said: \"In the run-up to the election, Keir Starmer made it quite clear that, if he was in government, he would not be rejoining the single market or rejoining the customs union.\" But she said he could get around that by doing something similar to what the chancellor did with income tax at the budget. Rachel Reeves extended the freeze on income tax, allowing her to stick to her manifesto promise not to raise income tax, while pulling more people into paying higher rates of the tax. \n                  Trump gives withering verdict on America's traditional allies\n                 \n                  Are Trump's allies behind hostile takeover bid of Warner Bros?\n                 \n                  Greek farmers have forced shutdown of Crete airport\n                 Read more: David Lammy suggests UK would benefit from rejoining customs union  Baroness Harman said: \"I think we might get into a little bit of that with the customs union, because we're not rejoining the customs union, but we could have a customs union which is better - i.e. elements of it, which smooth the path of better trading relations.\" But Ruth Davidson, the former Scottish Conservative leader, warned that could cause \"some political problems for Labour\". \"This is the sort of thing that completely arms Reform,\" she said. \"And it would take months, into years to get done. \"It would just be complete fuel for Reform. \"I think, politically, it's too hard to do, even if economically it looks like a lever that could be beneficial to the country.\""
    },
    {
        "title": "Does Starmer need his mates more than ever?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/does-starmer-need-his-mates-more-than-ever-13482287",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-12 05:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Westminster is restless, and the team are digging into why. Beth, Ruth and Harriet discuss the growing unease inside Labour, as somebody new joins the cabinet table.  They also go over the damning findings of Baroness Amos's interim report into maternity care in England, featuring deeply personal accounts from women affected by systemic failings, including former Conservative MP Theo Clarke, who now hosts the podcast Breaking The Taboo. If you've been affected by issues discussed in this episode, you can reach out to the Birth Trauma Association or MASIC. This episode also includes discussion of stillbirth. The charity Sands also offers help and advice. You can WhatsApp the podcast at 07934 200 444 or email electoraldysfunction@sky.uk. And if you didn't know, you can also watch Beth, Ruth and Harriet on YouTube. St James's Place sponsors Electoral Dysfunction on Sky News, learn more here."
    },
    {
        "title": "Left-wing Labour MPs split on Angela Rayner's future amid leadership speculation",
        "description": "Left-wing Labour MPs are split on whether they would welcome an Angela Rayner leadership bid, as speculation continues over whether Sir Keir Starmer can survive.",
        "url": "https://news.sky.com/story/left-wing-labour-mps-split-on-angela-rayners-future-amid-leadership-speculation-13482124",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-rayner_7089746.jpg?20251123162005",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-12-12 00:01:00",
        "Headline": "The former deputy prime minister is idolised by many of her colleagues, but others say she didn't do enough for the left while in government.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Left-wing Labour MPs are split on whether they would welcome an Angela Rayner leadership bid, as speculation continues over whether Sir Keir Starmer can survive. Senior MPs on the left have told Sky News that the former deputy prime minister \"only needs to push the button\" and she would have the support to take out her old boss. But others said it \"won't wash with the public\", given it was only a few months ago that she resigned in scandal over her tax affairs. She has also been accused of not doing enough for the left while she was in government. Sir Keir has insisted he would face down any threat to his leadership, while Ms Rayner's allies say she has no plan to oust him. But many MPs have said privately - if not publicly - that a challenge to his position appears increasingly inevitable given the state of the polls. One MP in the socialist campaign group (SCG) said \"all Angela needs to do is push the button\" and MPs would get behind her - citing her popularity with the Labour membership. Another MP said: \"I think she would have a healthy number of people who would back her.\" \n                  Angela Rayner just showed Labour MPs what they're missing\n                 \n                  Claims of 'stitch-up' in Labour's battle to replace Rayner - as first candidate enters race\n                 \n                  Would-be Labour deputies woo the unions in Brighton\n                 Ms Rayner, a former trade union rep, was elected by members to be deputy Labour leader in 2020. She was a longstanding member of Jeremy Corbyn's shadow cabinet and is revered by many of her colleagues on the left for her rise from a working-class background to the top of British politics, having left school at 16, pregnant, and with no qualifications. However one MP said while they personally \"rate her a lot\" she \"could have done more\" for the left while in government. \"Ange was the deputy leader for a long time. I have to say she went to ground for a long time and didn't speak up. Whether she has the support of MPs or the country I don't know.\" This view was echoed by another colleague, who said she is \"complicit\" in the government's failures. This MP, in a traditional red wall seat, said the \"visceral dislike of Starmer is baked in\" and they have never experienced anything like the anti-Labour sentiment they are hearing on the doorstep.  They said any change of leader would have to be an outsider with a radical vision \"like 1945\". \"It would have to be Andy\", they said, referring to the Greater Manchester metro mayor Andy Burnham. 'Burnham is a no-brainer' Many MPs on both the left and the so-called \"soft-left\" told Sky News he would be their preferred candidate, given he is not associated with the current government, he has a different vision for the country and is popular with the public. Mr Burnham is not currently an MP but he has not ruled out standing if a seat became available. \"In a hypothetical universe where all the barriers are overcome then Burnham is a no-brainer,\" said one MP from the 2024 intake. Read more from politics:Farage's former school responds to claims he made racist commentsReeves acknowledges damage of 'too many' budget leaks Another MP supportive of a Burnham takeover said a Rayner return \"won't wash with the public\" given she had to resign from the second most senior position in government for underpaying stamp duty in September. They said it also wouldn't be credible for her to \"suddenly\" start criticising the direction of the Starmer government given she was so closely tied to it. As another MP put it: \"I'd be backing a candidate from the left of the party. Angela Rayner is not from the left of the party.\" Other runners and riders Any challenger would need the public backing of 80 colleagues to trigger a leadership contest. May is seen as crunch date if the local elections go as badly as predicted. Other names that have come up include Health Secretary Wes Streeting and Home Secretary Shabana Mahmood. Mr Streeting is seen as a charismatic communicator who could take on Nigel Farage and Zack Polanski, while MPs within the \"blue Labour\" caucus are impressed with Ms Mahmood's hard line on immigration. But MPs on the left feel this would only offer a temporary boost in the polls as the pair are both seen as being on the centre-right, and a change of leader would be pointless without a change of direction. Another name that has come up is the former Labour leader Ed Miliband, but while he is more to the left he has been rejected by the public once - having lost the 2015 election. 'No active plot' The MPs who spoke to Sky News stressed there was no active plot, but rather a general consensus that it is looking increasingly likely Sir Keir won't be able to turn things around. MPs who disagree with the prime minister's politics said they are surprised at how personally disliked he is on the doorstep as he is ultimately a \"nice man\". They fear he has lost the trust of the public by saying one thing and doing another, with the winter fuel fiasco still coming up in areas where Reform UK is making gains. As one MP put it: \"We want him [Sir Keir] to do well and do better… but you can't go on forever if things look terrible in the opinion polls.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 'Budget has sparked a sea-change' MPs have recently revived the soft-left tribune group with the aim of influencing the government to take more of a progressive direction. Ms Rayner addressed this group on Tuesday night, along with new deputy leader Lucy Powell and cabinet ministers Mr Miliband and Lisa Nandy. One MP who spoke to Ms Rayner said she has \"absolutely no plans\" to launch a leadership bid \"unless she is keeping it quiet\". They added that the subject of a leadership challenge didn't come up in any of the speeches and there was an \"upbeat atmosphere\" following the lifting of the two-child benefit cap. \"The budget has landed well with the party,\" they said. \"[The meeting] felt like a sea change.\"  As deputy prime minister and housing secretary, Ms Rayner introduced the Employment Rights Bill within 100 days and pushed through reforms to renters rights, the leasehold system and further devolution. She is also said to have played a crucial role in persuading Sir Keir to water down welfare cuts in the face of a major backbench rebellion. A source close to her defended her record, saying she is \"not interested in pacts and plots\" and wants the government to succeed. They said she is not finished in politics but \"she's no one's pawn, she's her own person\". Ms Rayner resigned after an ethics investigation found she acted in good faith, but broke the ministerial code by failing to get the correct tax advice after purchasing a flat in Brighton. She referred herself to HMRC and an investigation is ongoing. Sir Keir has said he wants her back in cabinet, a view echoed by many senior colleagues."
    },
    {
        "title": "How much your data is worth - and how to stop people profiting from it",
        "description": "Companies generate massive profits from people's information, with experts describing user data as \"the new oil\".",
        "url": "https://news.sky.com/story/how-much-your-data-is-worth-and-how-to-stop-people-profiting-from-it-13482475",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-data-internet_7107912.jpg?20251212061244",
        "type": "Technology",
        "Author": "Kieren Williams",
        "Date Published": "2025-12-12 09:42:00",
        "Headline": "Do you know the true value of your data? Businesses all over the internet certainly do know its worth - so here's what you can do about that.",
        "Content": "\n          News Reporter\n              @kjjjwilliams\n Companies generate massive profits from people's information, with experts describing user data as \"the new oil\". Some of these companies are household names but many are unknown, with one analyst comparing the relationship between companies and users as \"David vs Goliath\". Is there anything you can do about it, or are you resigned to having companies know all about you - and make money on it? How companies collect data Sam Jones, founder of Gener8, a company that helps users make money from their own data online, told our Money team how companies farmed data on users. \"Companies collect data about people through a range of methods, many of which operate quietly in the background as we go about our daily lives,\" he said. \"Most of us have heard of 'cookies', but perhaps many of us don't realise that a 'cookie' is really another word for a tracker. \"And when you click 'accept' on a cookie banner, you are not just allowing the website you are on to track you, but often you're allowing hundreds of different companies who are hidden in the website terms and conditions.\" Other methods of data collection include (but are not limited to): • Pixels: Tiny images embedded on websites and emails that track activity;• Device fingerprinting: Sites gather device-specific information (for example, screen size, browser type, font type) to create a unique way to identify it;• And mobile apps: Many include third-party software that sends data to other companies about users - this can be location or usage habits for example. There are also companies known as data brokers that compile information about users that can be sold to advertisers, insurers or even political groups. \"In the end, users are frequently handing over significant amounts of data without fully realising the scale of what's being collected, how it's being used, or who it's being shared with,\" Jones told Money. What data do companies collect? Experts say collected data largely falls into two categories: • Personal data: Information about users, such as name, email, phone number and location;• Behavioural data: Information about how users interact with websites, which ones they visit, what they search for, how they search, where they click and how long they spend on each part of the site. Combined, these can be used to predict interests, habits and even life events. Why do companies collect data? Advertising is one of the main - and most profitable - reasons companies collect data. If companies understand users better, they're better placed to sell them products (or help others sell them products). We've already mentioned data brokers, which sell the user information itself to companies that are hoping to reach people for a variety of reasons. Another big use is research, because knowing more about users lets companies spot trends (or problems) and inform decision-making. But Oliver Devane, senior security researcher at McAfee, explained to Money that information gathering wasn't all sinister. \"One reason why is basically to improve the user experience as well,\" Devane said. He gave the example of a video-sharing platform tailoring its experience to a football fan by showing them videos of the sport and their club. Tilman Harmeling, a data protection expert at Userscentrics, added that some data collection companies undertook was a legal requirement. What can you do about it? It can seem daunting, knowing that information about you is out on the internet, and our experts have tips to help - but it's not easy. Money was repeatedly told that the best first step was to be aware of where your data is on the internet. Various online tools will, for a price, scrape through the internet to see which companies have a user's information and remove it for them. But to do this yourself (for free), you need to conduct a personal digital audit. This can be done by: • Go through your emails and see what you're signed up to;• And search your name and phone number on various search engines to see where you pop up. Once you've identified where your information exists, you can go about scrubbing it. Sites that may have your data will have a privacy policy (they all do), and Devane says to look out for sections that refer to users' rights or data. From here, you can often find how to request a deletion, or can contact the company to do so. Read more:Bad news for chancellor as UK economy shrinks againDaily Mail owner lines up Natwest to help fund Telegraph bidBurger King UK lands new backing from buyout firm With more recent privacy laws, you can also submit legal requests to take down your data - for example, Google's Results About You tool. Forgotten accounts can also be a hub of a user's data on the internet, so don't forget to purge them, deleting any unused profiles. Similarly, be cautious about who you share your data with from the off and be choosy about app permissions on your mobile - delete old and unused apps because fewer apps mean fewer avenues of data collection. Meanwhile, on social media pages, it's always worth being aware of what you're sharing and what your privacy settings are. There are also technical ways to protect your data online, according to Devane. He said people could use protection software such as VPNs. Our experts generally recommended that people do a clean-up regularly, but all acknowledge the difficulty of this and how the issue is stacked against users."
    },
    {
        "title": "Primal Scream says video with alleged antisemitic imagery shown at gig was meant to provoke debate",
        "description": "Primal Scream have said a video containing alleged antisemitic imagery was a \"piece of art\" and was intended to \"provoke debate, not hate\".",
        "url": "https://news.sky.com/story/primal-scream-says-video-with-alleged-antisemitic-imagery-shown-at-gig-was-meant-to-provoke-debate-13482593",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-primal-scream-bobby-gillespie_7108449.jpg?20251212170729",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-12 15:41:00",
        "Headline": "The rock band have been reported to police for showing a film at a gig which appeared to include imagery of the Star of David entwined with a swastika.",
        "Content": "Primal Scream have said a video containing alleged antisemitic imagery was a \"piece of art\" and was intended to \"provoke debate, not hate\". Warning: This article contains alleged antisemitic imagery. The Scottish rock band have been reported to the Metropolitan Police for showing a film at their Roundhouse concert in Camden, London on Monday which appeared to include imagery of the Star of David entwined with a swastika. The force is now assessing the report. 'Film is a piece of art' Primal Scream said in a statement on Instagram: \"The film is a piece of art. It clearly draws from history to question where the actions of current world governments sit in that context. It is meant to provoke debate, not hate. \"In a free, pluralistic and liberal society freedom of expression is a right which we choose to exercise.\" \n                  Metropolitan police chief accuses Trump of talking 'nonsense' about London crime\n                 \n                  London tube and some train fares to rise, says mayor Sadiq Khan\n                 \n                  Man arrested after frozen pangolins, rats and porcupines seized in London\n                 Primal Scream, founded by frontman Bobby Gillespie in 1982, were playing a 25-year anniversary show for their album XTRMNTR. As the group performed Swastika Eyes, pictures of political figures including Israeli Prime Minister Benjamin Netanyahu appeared behind them, showing what appeared to be the Star of David combined with a swastika in their eyes. Venue 'appalled' The Roundhouse has apologised, saying it was \"appalled\" that \"antisemitic imagery was displayed\", adding it was done entirely without its knowledge. It said in a statement: \"We deeply regret that these highly offensive images were presented on our stage and unequivocally apologise to anyone who attended the gig and to the wider Jewish community.\" It added: \"Our organisation absolutely condemns antisemitism in every form.\" Call for 'urgent investigation' The Community Security Trust (CST), which provides protection for Jewish communities in the UK, said it had reported the band to police and called on the venue to carry out an \"urgent investigation\". In a statement, a CST spokesperson said: \"CST is appalled by the grossly antisemitic image displayed at Primal Scream. Entwining a Star of David with a swastika implies that Jews are Nazis and risks encouraging hatred of Jews. \"There needs to be an urgent investigation by the venue and the promoter about how this happened, and we have reported this to the police.\" What have police said? Responding to that report, a Met Police spokesperson said: \"On Wednesday, 10 December, we received a report in relation to a video shown on stage during a concert at the Roundhouse in Chalk Farm Road, Camden on Monday, 8 December. \"It is being assessed by officers.\" Read more from Sky News:Man found guilty of savage train glass bottle attackTaylor Swift breaks down in tears over Southport attacks 'Unadulterated hatred' The charity Campaign Against Antisemitism said: \"The Nazi swastika represents the ideology that inspired people to industrially slaughter six million innocent Jewish men, women and children by bullet, gas and any other means available. \"To visually combine that with the Star of David - the pre-eminent symbol of Judaism - is absolutely sickening and totally inexcusable. \"This isn't art. This isn't edgy. This isn't political statement. It is unadulterated hatred and a clear breach of the international definition of antisemitism. \"We will be writing to the Camden Roundhouse and our legal team is examining the footage to consider further steps.\""
    },
    {
        "title": "'Beloved and inspirational' author Joanna Trollope dies",
        "description": "Author Joanna Trollope has died aged 82, her family has said.",
        "url": "https://news.sky.com/story/beloved-and-inspirational-author-joanna-trollope-dies-13482519",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-cbe-joanna-trollope_7108163.jpg?20251212120051",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-12 11:59:00",
        "Headline": "She was one of the nation's most widely read authors, having published more than 30 novels during a career that began in the 1970s.",
        "Content": "Author Joanna Trollope has died aged 82, her family has said. Trollope was one of the nation's most widely read authors, having published more than 30 novels during a career that began in the 1970s. Her novels include \"Aga sagas\" The Rector's Wife, Marrying The Mistress and Daughters-in-Law. In a statement, Trollope's daughters Antonia and Louise said: \"Our beloved and inspirational mother Joanna Trollope has died peacefully at her Oxfordshire home, on December 11, aged 82.\" Her literary agent James Gill said: \"It is with great sadness that we learn of the passing of Joanna Trollope, one of our most cherished, acclaimed and widely enjoyed novelists. \"Joanna will be mourned by her children, grandchildren, family, her countless friends and - of course - her readers.\" Trollope was born in Gloucestershire in 1943. She won a scholarship to study at the University of Oxford in the 1960s. After graduating, she joined the Foreign Office before training as a teacher and then turning to writing full-time in 1980. The author was best known for her novels set in rural middle England and centred around domestic life and relationships. Her early historical romances were written under the pseudonym Caroline Harvey, before she turned to contemporary fiction. Her work tackled a range of topics from affairs, blended families and adoption, to parenting and marital breakdown. Trollope also took part in The Austen Project, which saw six of Jane Austen's novels retold by contemporary writers. She wrote the first book in the series, Sense & Sensibility, published in 2013. Read more from Sky News:Man found guilty of murdering wife in rare retrialUK 'rapidly developing' plans to prepare for war In 1996, Trollope was awarded the Order of the British Empire (OBE) for her services to literature and later made a Commander of the Order of the British Empire (CBE) in 2019. She won the Romantic Novel of the Year in 1980 for the book Parson Harding's Daughter and in 2010 was given a lifetime achievement award from the Romantic Novelists' Association (RNA) for her services to romance. She went on to chair a number of award ceremonies, including the Costa Book Awards, formerly the Whitbread Prize, as well as the BBC National Short Story Award and the Orange Prize for Fiction."
    }
]