[
    {
        "title": "Trump tells Gazans 'you are dead' if Israeli hostages are not immediately handed over",
        "description": "US President Donald Trump has told Gazans to hand over Israeli hostages or \"you are dead\".",
        "url": "https://news.sky.com/story/us-holds-talks-with-hamas-13322252",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-congress-speech_6846562.jpg?20250305025603",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-05 19:20:00",
        "Headline": "Trump's warning, posted on social media, came after it was confirmed US officials had held direct talks with Hamas. Washington has a long-held policy of not negotiating with terrorists - and Hamas has been labelled as such by Washington since 1997.",
        "Content": " US President Donald Trump has told Gazans to hand over Israeli hostages or \"you are dead\". The threat, made over social media, came hours after the White House confirmed that US officials had broken with tradition to hold direct talks with Hamas. The US has previously avoided direct contact with the group owing to Washington's longstanding position not to negotiate with terrorists - with Hamas having been designated as a terrorist group in the US since 1997. In a press conference on Wednesday, White House press secretary Ms Keavitt said there had been \"ongoing talks and discussions\" between the US officials and Hamas. But she would not be drawn on the substance of the talks - taking place in Doha, Qatar - between US officials and Hamas, but said Israel had been consulted. Ms Leavitt continued: \"Dialogue and talking to people around the world to do what's in the best interest of the American people, is something that the president has proven is what he believes is a good faith, effort to do what's right for the American people.\" There are \"American lives at stake,\" she added. Adam Boehler, Mr Trump's pick to be special envoy for hostage affairs, participated in the direct talks with Hamas. A spokesperson for Benjamin Netanyahu's office said Israel had \"expressed to the United States its position regarding direct talks with Hamas\". Hours later, Mr Trump warned Hamas to hand over Israeli hostages or \"it's over for you\" - adding: \"This is your last warning\". On his Truth Social platform, Mr Trump wrote: \"Release all of the hostages now, not later, and immediately return all of the dead bodies of the people you murdered or it is over for you. \"Only sick and twisted people keep bodies and you are sick and twisted. I am sending Israel everything it needs to finish the job, not a single Hamas member will be safe if you don't do as I say.\" Mr Trump met with freed Israeli hostages on Wednesday, something he referenced in his social media post, before adding: \"This is your last warning. For the leadership of Hamas, now is the time to leave Gaza, while you still have a chance. \"Also, to the people of Gaza, a beautiful future awaits, but not if you hold hostages. If you do, you are dead. Make a smart decision. Release the hostages now, or there will be hell to pay later.\" Israel estimates about 24 living hostages, including American citizen Edan Alexander, and the bodies of at least 35 others, are still believed to be in Gaza. The US has a long-held policy of not negotiating with terrorists - which it is breaking with these talks as Hamas has been designated a foreign terrorist organisation by the US government's National Counterterrorism Center since 1997. The discussions come as a fragile Israel-Hamas ceasefire continues to hold, but its future is uncertain. Mr Trump has signalled he has no intention of pushing the Israeli prime minister away from a return to combat if Hamas does not agree to terms of a new ceasefire proposal - which, Israel says, has been drafted by US Middle East envoy Steve Witkoff. The new plan would require Hamas to release half its remaining hostages - the group's main bargaining chip - in exchange for a ceasefire extension and a promise to negotiate a lasting truce. Read more:The competing plans for rebuilding GazaFreed Israeli hostage details captivity Israel has made no mention of releasing more Palestinian prisoners, a key component of the first phase. Fighting in Gaza has been halted since 19 January. Hamas has exchanged 33 Israeli and five Thai hostages for some 2,000 Palestinian prisoners and detainees."
    },
    {
        "title": "Child dies and another injured after car driven on to sports pitch",
        "description": "A child has died and another has been injured after a car was driven on to a sports pitch in Cumbria.",
        "url": "https://news.sky.com/story/child-dies-and-another-injured-after-car-driven-onto-sports-pitch-with-man-arrested-13322232",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kendal-cumbria_6847494.jpg?20250305214840",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-05 18:55:00",
        "Headline": "A man in his 40s has been arrested on suspicion of causing death by dangerous driving.",
        "Content": "A child has died and another has been injured after a car was driven on to a sports pitch in Cumbria. Police say they were called at 4.58pm to reports of a collision involving a BMW i40 and two children on a pitch at Kendal Rugby Union Football Club on Shap Road, in Kendal. Cumbria Police say one child died, while the second is being treated by paramedics. A man aged in his 40s has been arrested on suspicion of causing death by dangerous driving. A spokesperson for Cumbria Police said: \"Specialist investigators are at the scene and the area has been cordoned off as initial investigation enquiries take place.\" The force said the incident was not believed to be terror-related. Immediate family members of both children have been informed, it added. In a post on its Facebook page, the club said it was \"deeply saddened to confirm that an incident occurred today at Kendal Rugby Club.\" The post, attributed to club chairman Dr Stephen Green, continued: \"Our thoughts are with their family and friends and we kindly ask for privacy for all involved at this difficult time.\" The club and its facilities are now temporarily closed while it cooperates \"fully\" with authorities, it added. More from Sky News:Serial rapist jailed for 15 yearsGardener wins court case over £1m prize Tim Farron MP, whose constituency includes Kendal, posted on X: \"This is devastating, utterly heartbreaking news. I'm praying for the children and for their families and friends. \"Our community in Kendal is stunned and in mourning.\""
    },
    {
        "title": "Zhenhao Zou: How a student described as 'smart and charming' was unmasked as a prolific sexual predator",
        "description": "\"Really, don't push me, it's pointless... the sound insulation here is very good\" - those are the terrifying words of rapist Zhenhao Zou to one of his victims.",
        "url": "https://news.sky.com/story/zhenhao-zou-how-a-student-described-as-smart-and-charming-was-unmasked-as-a-prolific-sexual-predator-13321005",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-zhenhao-zou-met-police_6841249.jpg?20250304193616",
        "type": "Home",
        "Author": "Amelia Harper, news correspondent",
        "Date Published": "2025-03-05 15:30:00",
        "Headline": "Zhenhao Zou, 28, drugged women with powerful tranquillisers at his flat in London then filmed them - officers discovered nearly 1,300 videos.",
        "Content": "By Amelia Harper, news correspondent  \"Really, don't push me, it's pointless... the sound insulation here is very good\" - those are the terrifying words of rapist Zhenhao Zou to one of his victims. Warning: This article contains distressing details It's now believed the former PhD student could have as many as 60 victims after footage was found of numerous unidentified women being attacked. Prosecutors say he appeared to be a \"smart and charming young man\" from a wealthy family, but he hid a secret life as a \"sexual predator, a voyeur and a rapist\". Officers discovered nearly 1,300 videos - but Zou insisted the sex depicted was consensual. The 28-year-old said he had a \"habit\" of taking pictures during sex and told jurors he liked \"rape role play\" and pornography involving sleeping women.  He told the court: \"I like it because the girl appears to be still and quiet when they are having sex.\" Prosecutors said the women in his videos seemed unconscious - and a number of powerful tranquillising drugs were found at Zou's home. 'You should feel guilty for what you did' On Wednesday, following a trial at Inner London Crown Court, Zou was found guilty of 11 counts of rape against 10 different women. However, only two of his victims, one of whom was the victim in two counts, have been identified so far. The other eight victims are yet to be traced. A major effort is now under way to identify other woman seen in Zou's videos, in what police say has become the UK's biggest current rape investigation. Police believe there could be another 50 further victims, with around half of the incidents being investigated by officers thought to have taken place in this country and the other half in China. We are also now able to report that, during the course of the trial, one woman came forward to police claiming to be a victim of Zou. Zou's prolific offending might never have been uncovered if not for the courage of one of his victims to pick up the phone and call the police. The trial heard the woman was raped while \"drunk and unconscious\" at his flat in London's Elephant and Castle in May 2023. Zou filmed the attack and took intimate images without her knowledge using a small camera by the bed. The woman said she was drunk and had tried to leave, but that Zou dragged her back in and pushed her to consume vodka. She said she'd told him she would stay if he transferred her 100,000 in Chinese currency, but that it didn't give him permission to have sex with her. When the two messaged afterwards, Zou told her: \"I had too much to drink and did something wrong, can we discuss this later?\" She replied: \"You should feel guilty for what you did.\" Crucially, the woman posted about her ordeal on Chinese social media apps LittleRedBook and WeChat, prompting someone else to come forward with a similar experience. The woman said she'd woken up to find the former PhD student raping her. She said it happened while \"unconscious\" after being out drinking for four or five hours with friends in London's Chinatown. Zou's 'trophy box' Following Zou's arrest on 25 January 2024, police seized cameras and memory cards from his home, as well as his phone. They were shocked by what they found. He had filmed nine of the women he raped, as well as taking intimate pictures. Zou also kept a box of items, which he claimed was \"lost property\" - but the prosecution said it was a \"trophy box\" of items belonging to his victims. Police believe one of the attacks carried out by Zou happened in his Woburn Place UCL student accommodation, sometime between September 2019 and September 2020. Read more from Sky News:Tesla charging stations set on fireBoy shot dead near Tube station named The evidence was found on a camera in a box in his flat. On the recording, the woman can be heard saying: \"I really don't want... I beg you, don't do this.\" Zou responds: \"Really, don't push me, it's pointless… It's not the first time we have done it. This is the second time… The sound insulation here is very good.\" Police also found multiple 500ml bottles of butanediol at Zou's flat. Toxicologist John Slaughter told Inner London Crown Court it's converted into GHB, typically known as the 'date-rape' drug, if swallowed. Zou claimed the butanediol was for a moisturiser. The jury didn't agree and convicted him of 11 counts of rape, with two of the offences relating to one victim. Zou was also convicted of three counts of voyeurism, 10 of possession of an extreme pornographic image, one of false imprisonment and three of possession of a controlled drug with intent to commit a sexual offence, namely butanediol. He was cleared of two further counts of possession of an extreme pornographic image, and five counts of possession of controlled drugs to commit a sexual offence, namely one count involving MDMA, three involving ketamine, and one of alprazolam. 'Dangerous sexual predator' The Metropolitan Police said the testimony of the two victims was crucial to give context to the videos as many victims appear to be sleeping or unaware of what's going on. They are now trying to identify his other victims with the cooperation of the Chinese authorities. As part of their appeal, a major incident tool is available which - for the first time - has the option for language translations. They particularly want to reach out to the Chinese community, and police think there will be further trials in future. Commander Kevin Southworth, lead for public protection at the Metropolitan Police, said: \"Zhenhao Zou is a dangerous and prolific sexual predator, who manipulated and drugged women in order to prey on them in the most cowardly way. \"I'd like to acknowledge the two women who bravely gave evidence against Zou in court, their courage and resilience has been unwavering. \"We are determined to support all victim-survivors and are now asking women who believe they may have concerns about Zou to please come forward.\""
    },
    {
        "title": "UK nations plan joint bid to host 2035 FIFA Women's World Cup",
        "description": "The four nations of the UK are planning a joint bid to host the 2035 FIFA Women's World Cup.",
        "url": "https://news.sky.com/story/uk-set-to-bid-for-2035-womens-world-cup-13322248",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-football-world-cup_6847377.jpg?20250305194829",
        "type": "Home",
        "Author": "Rob Harris, sports correspondent, and Kieren Williams, news reporter",
        "Date Published": "2025-03-05 19:17:00",
        "Headline": "The hosting process begins with the submission of a declaration of interest to FIFA, after a bidding timetable was announced on Wednesday.",
        "Content": "By Rob Harris, sports correspondent, and Kieren Williams, news reporter  The four nations of the UK are planning a joint bid to host the 2035 FIFA Women's World Cup. A statement said: \"The Football Associations of England, Northern Ireland, Scotland and Wales will collectively submit an expression of interest to FIFA for the United Kingdom to host the Women's World Cup in 2035.\" Prime Minister Sir Keir Starmer said the planned bid had his government's \"full support\". He added: \"Football is and always will be at the core of our country's identity. \"Whether we watch on TV, play at the weekends like I do, or simply enjoy soaking up the atmosphere in the pub, it brings communities together like little else.\" The process begins with the submission of a declaration of interest to FIFA, after a bidding timetable was announced on Wednesday. Bidders have around a month for expressions of interest to be lodged before submitting the full proposals by November, with a decision being made toward the middle of 2026. \n                  Mansfield footballer Lucas Akins starts League One match hours after crash death guilty plea\n                 \n                  Top FIFA official says it's harder than ever to be a football referee due to abuse\n                 \n                  FIFA president Gianni Infantino defends 'critical' alliance with Donald Trump\n                 Earlier on Wednesday, FIFA limited the prospective 2035 hosts to only European and African nations - opening the path up for the joint UK bid. As Sky News revealed last year, the British bid could be boosted by the potential for the tournament's expansion from 32 to 48 nations. Read more from Sky News:Aspirin could stop some cancers spreadingChild dies after car driven on to sports pitchUS holds direct talks with Hamas The Three Lionesses lost the 2023 World Cup final 1-0 to Spain in Sydney. England has only hosted the World Cup once - when the men won in 1966. But, England led a successful bid for the men's Euro 2034, which will also see Scotland, Wales and Ireland staging matches."
    },
    {
        "title": "Authorities' involvement with family - which sparked Leeds riot - 'was never about discrimination', judge says",
        "description": "Local authority involvement with a family in Leeds - which sparked a riot in the city - \"was not, and never had been, about discrimination,\" a judge has told a family court.",
        "url": "https://news.sky.com/story/authorities-involvement-with-family-which-sparked-leeds-riot-was-never-about-discrimination-judge-says-13322229",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-leeds-riot-disorder_6631601.jpg?20240719043635",
        "type": "Home",
        "Author": "Frazer Maude",
        "Date Published": "2025-03-05 18:53:00",
        "Headline": "Police and social workers became involved with the extended family and in July last year, four of the children in the house were removed. The incident led to an eruption of violence in the Harehills area of Leeds. ",
        "Content": "\n          North of England correspondent\n              @frazeratsky\n Local authority involvement with a family in Leeds - which sparked a riot in the city - \"was not, and never had been, about discrimination,\" a judge has told a family court. The hearing focused on an incident in April last year which led to a baby, who was one of seven children living in a house in Harehills, being taken to hospital with what turned out to be a fractured skull. Police and social workers then became involved with the extended family and on 18 July 2024, four of the children in the house were removed over concerns they would be taken out of the country. After the police arrived at the property, the area erupted in violence, with officers coming under attack, a patrol car overturned and a bus torched. Reading her judgement after a three-day, fact-finding hearing, Judge Helen Trotter-Jackson said: \"These entire proceedings have come about because of dishonesty of the parents.\" \"That dishonesty led to widespread public disorder,\" she added. Read more: How did the disorder spiral? \n                  Mansfield footballer Lucas Akins starts League One match hours after crash death guilty plea\n                 \n                  Miah brothers jailed for grooming and sexually abusing girls in Leeds and Barrow-in-Furness\n                 \n                  Surgeons remove tumour through patient's eye socket in UK first\n                 In the judgment, Judge Trotter-Jackson highlighted the inconsistent evidence given by the adults involved in the investigation, saying the mother of the injured child gave what she saw as a \"dishonest and deliberately evasive account\" of how the child was injured, and why medical assistance was not sought sooner. Earlier in the hearing, the boy's mother said she now accepted she should have sought medical attention for her son sooner, on the day he was injured. More from Sky News:British man jailed in Russia for 19 yearsChild dies after car driven on to sports pitch She insisted she did not see any swelling until the next day, but told the court: \"When the child had a fever and was agitated, I should have gone with him to hospital.\" The hearing also heard that three of the children involved have never been registered for secondary school."
    },
    {
        "title": "Sky News wins best News Channel at Royal Television Society awards - as Sophy Ridge named Presenter of the Year",
        "description": "Sky News has won News Channel of the Year and Sophy Ridge has been named Presenter of the Year at the Royal Television Society (RTS) Awards.",
        "url": "https://news.sky.com/story/sky-news-wins-news-channel-of-the-year-for-eighth-year-in-a-row-at-rts-journalism-awards-13322406",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rts-sophy-ridge-rts-awards_6847608.jpg?20250305235912",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-05 22:37:00",
        "Headline": "RTS judges praised the \"excellent journalism, high production values, and clear analysis\", adding that Sky News was \"hard to beat\" in the news channel category.",
        "Content": " Sky News has won News Channel of the Year and Sophy Ridge has been named Presenter of the Year at the Royal Television Society (RTS) Awards. Speaking about the News Channel of the Year award - which Sky News has won for the eighth year in a row - Jonathan Levy, Managing Director and Executive Editor of Sky News UK, said: \"The recognition of this award is particularly encouraging in such a big news year - a general election and a summer of discontent here at home, the re-election of Donald Trump and the wars in Ukraine and the Middle East abroad. \"As news organisations we choose where, and frankly where not to point our cameras, and last year at Sky News we chose to point them often at the devastating conflict in Sudan. \"It's heartening to see that journalism and that story getting some recognition.\" RTS judges praised the \"excellent journalism, high production values, and clear analysis\", adding that Sky News was \"hard to beat\" in the category. \"It [Sky News] had strong eye-witness coverage from around the world, and also produced highly watchable reporting on many UK stories,\" judges said. Africa correspondent Yousra Elbagir has repeatedly reported from the front lines of Sudan's civil war, while other notable international coverage has included chief correspondent Stuart Ramsay on the conflict in Myanmar and an exclusive with President Zelenskyy. In addition, Sophy Ridge, Sky News' lead political presenter who hosts a weeknight show from 7-8pm, won Network Presenter of the Year. She said: \"I feel very proud to work at Sky News. I feel very proud of the journalism we do at Sky News but for me the best thing about TV journalism is that we work as part of a team. \"At the moment journalism feels like it's under attack, the truth sometimes feels like it's under attack as well. What I keep in mind is that people have the perception that presenting is about talking, when it's about listening. Listening to our viewers, our audience... and all the people that we interview.\" RTS judges said: \"In a very strong field, this presenter stood out... combining disarming toughness with huge likeability. Moving effortlessly from politics to breaking news, she's in control, genuinely insightful and never domineering.\" In 2024, Sky News reported on stories such as the UK's general election - with highlights including Beth Rigby's questioning of Rishi Sunak and Sir Keir Starmer in Grimsby. The World With Yalda Hakim featured interviews including several exclusives with the Qatari prime minister, a key mediator in Gaza ceasefire talks."
    },
    {
        "title": "Gardener wins High Court case against Paddy Power over £1m jackpot - after betting firm only paid her £20,000",
        "description": "A gardener, who was told she had scooped more than &#163;1m on a Paddy Power game but was only paid &#163;20,000, has won a High Court case against the betting company.",
        "url": "https://news.sky.com/story/gardener-wins-high-court-case-against-paddy-power-over-1631m-jackpot-after-betting-firm-only-paid-her-16320000-13322187",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-corrine-durber-gambling_6847294.jpg?20250305173147",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-05 17:26:00",
        "Headline": "Corrine Durber sued Paddy Power for breach of contract after she was told she had won a £1m jackpot on one of its games, but was later informed this was an error.",
        "Content": "A gardener, who was told she had scooped more than £1m on a Paddy Power game but was only paid £20,000, has won a High Court case against the betting company. Corrine Durber, from Gloucestershire, was playing one of the firm's online games in October 2020. It was described as a combination of a fruit machine and a wheel of fortune-style game with two different parts. During the second section, spinning the jackpot wheel, Mrs Durber received a message saying she had won the \"Monster Jackpot\" - which was said to be £1,097,132.71. However, she was only paid £20,265.14 and instead told she had actually won the much smaller \"Daily Jackpot\". The company said there had been an error with the game's display as it had been mal-programmed and directed her to the wrong prize. However, Mrs Durber sued PPB Entertainment Limited, which trades as Paddy Power and Betfair, for breach of contract and for the rest of her winnings. \n                  Stake, Everton's shirt sponsor, will leave UK gambling market as advert investigated\n                 \n                  Roblox: How kids are being lured into online casinos\n                 \n                  Illegal casinos are using Roblox to draw children into online gambling\n                 Judge's remarks In a judgment on Wednesday, Mr Justice Ritchie granted summary judgment in her favour - meaning she won without a trial. In a 62-page ruling, the judge said the idea of \"what you see is what you get\" was \"central\" to the online game. He went on: \"Objectively, customers would want and expect that what was to be shown to them on screen to be accurate and correct. \"The same expectation probably applies when customers go into a physical casino and play roulette. \"They expect the house to pay out on the roulette wheel if they bet on number 13 and the ball lands on number 13.\" PPB said the outcome was determined by a random number generator, which said she won the daily jackpot, but an error affected the animations, showing the wrong result. 'Legal torment' Speaking after the decision, Mrs Durber said: \"As you can imagine, I'm so relieved and happy that the judge has confirmed I fairly and squarely won £1m from Paddy Power. \"But why couldn't Paddy Power pay up straight away instead of putting me through this legal torment? \"I will never bet with them ever again.\" Read more from Sky News:Boy, 16, shot dead near Tube station namedEmma Raducanu speaks out after spotting stalkerScottish Tories propose lowering school leaving age She added that Paddy Power had \"tried their very best to deny me my rightful winnings\". \"What's the point in betting if betting companies like Paddy Power won't pay-up when someone wins a big jackpot?\" Following the ruling, a spokesperson for Flutter UKI, which owns Paddy Power, told Sky News: \"Every week, tens of thousands of customers win with Paddy Power, including an individual who received a £5.7m jackpot just one year ago. \"We always strive to provide the best customer experience possible and pride ourselves on fairness. \"We deeply regret this unfortunate case and are reviewing the judgment.\""
    },
    {
        "title": "Three skiers buried up to 30 metres deep in Alaska avalanche presumed dead, officials say",
        "description": "An avalanche that swept away three skiers has likely killed them under the weight of the snow, officials have said.",
        "url": "https://news.sky.com/story/three-skiers-buried-up-to-30-metres-deep-in-alaska-avalanche-presumed-dead-officials-say-13322336",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alaska-girdwood_6847470.jpg?20250305211743",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-05 21:10:00",
        "Headline": "The trio were said to be heli-skiers who use helicopters to reach remote mountains far from commonly used ski lifts.",
        "Content": "An avalanche that swept away three skiers has likely killed them under the weight of the snow, officials have said. The trio had flown by helicopter to a remote mountain range near Anchorage in the US state of Alaska. However, according to state troopers, they were caught in an avalanche and trapped in snow at a depth of between 12 metres (40ft) and 30 metres (100ft). The deaths have not yet been confirmed, but Austin McDaniel, a spokesperson for Alaska State Troopers, said that \"based on the information provided by the operator, unfortunately, we do not believe that any of the three missing persons survived the avalanche\". The incident took place on Tuesday in the Chugach Mountains in an area along the Twentymile River, eight miles (13km) northeast of the airport in Girdwood, and about 40 miles (64km) south of Anchorage. The trio were said to be heli-skiers who use helicopters to reach remote mountains far from commonly used ski lifts. Mr McDaniel added that guides from the heli-skiing company had tried to locate the skiers using avalanche beacons and believed they had found a probable area where they were buried. \n                  Wreckage found in Alaska for missing Bering Air plane carrying 10 people\n                 \n                  Scientists monitoring Alaska volcano after rise in earthquakes beneath it\n                 \n                  Fat Bear Week delayed after contestant killed by rival\n                 Due to the depth, guides were unable to recover them, and there was a continued \"considerable avalanche risk in this area\", Mr McDaniel said. It has also been rainy, windy and foggy in Girdwood, with snow at higher levels. Read more from Sky News:Child dies after car driven on to sports pitchUK plan joint bid to host Women's World CupBoy, 16, shot dead near Tube station named A spokesperson for Alaska State Troopers told Sky News that the weather and the continued risk of avalanches were interferring with rescue efforts, which would resume when it was \"safe for personnel to return to the scene\". In the meantime, the situation was being \"actively monitored\"."
    },
    {
        "title": "Kyle Clifford: CCTV shows triple killer visiting garden centre on day of murders",
        "description": "CCTV played in court has shown a former soldier visiting a garden centre with his family hours before he murdered his ex-girlfriend, her mother and her sister. ",
        "url": "https://news.sky.com/story/kyle-clifford-cctv-shows-triple-killer-visiting-garden-centre-on-day-of-murders-13322047",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-cctv-kyle-clifford_6847032.jpg?20250305184033",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-03-05 14:25:00",
        "Headline": "The 26-year-old has admitted murdering BBC racing commentator John Hunt's wife Carol and their daughters Louise and Hannah, but denies rape.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  CCTV played in court has shown a former soldier visiting a garden centre with his family hours before he murdered his ex-girlfriend, her mother and her sister.  Kyle Clifford, 26, was also filmed in a branch of B&Q days earlier on 4 July last year buying the silver duct tape he would use to restrain former partner Louise Hunt during the attack. He has admitted murdering the 25-year-old, her mother Carol Hunt, 61, and Louise's sister Hannah Hunt, 28, at the family home, where they lived with BBC racing commentator John Hunt, in Bushey, Hertfordshire, on 9 July last year. Clifford has also admitted possession of the butcher's knife used to kill Mrs Hunt and the crossbow used to shoot her daughters, as well as false imprisonment of Louise. He has chosen not to attend his trial at Cambridge Crown Court for a single charge of raping Louise, which he denies. Prosecutors say Clifford started planning the four-hour attack against her and members of her family after she broke up with him 13 days earlier. Jurors were played footage of Clifford lifting weights at a gym on 5 July. Another clip shows him arriving at a garden centre near his home in Enfield, north London, with members of his family shortly before 10am on the day of the murders. Detective Constable Alex Leckie said he was there with his mother, father and niece, and at one point he can be seen pushing a buggy. Further footage showed Clifford, dressed all in black, parking his car near the Hunt family home before walking to the address and knocking on the door shortly after 2.30pm. A doorbell camera captured his conversation with Carol Hunt as he told her he was \"just dropping off some of Louise's stuff\". Mrs Hunt asks how he is and he replies: \"I'm good, thank you. What's wrong? You look like…\" \"I've seen a ghost,\" she responds. Mr Hunt watched proceedings from the public gallery, while a woman left in tears after the footage at the doorstep was played. Prosecutors say Clifford took a bag of clothes and a \"thank you\" card as a \"ruse\" to get inside the house before taking a knife from his backpack to kill her. Read more from Sky News:PhD student guilty of drugging and raping 10 womenBoy, 16, shot dead near Tube station named Another CCTV clip shows him leaving the house before returning with the crossbow hidden under a blanket and letting himself back into the house with a key. He is said to have held Louise for hours after she returned from working at her dog grooming business, which she ran from a pod in the garden, then shot her moments before her sister got home. The court heard in a 999 call to police, Hannah Hunt said: \"My sister's ex-boyfriend has come in and he shot us.\" She was found found collapsed in the doorway when emergency services arrived but died shortly after. The trial continues."
    },
    {
        "title": "Child dies and another injured after car driven on to sports pitch",
        "description": "A child has died and another has been injured after a car was driven on to a sports pitch in Cumbria.",
        "url": "https://news.sky.com/story/child-dies-and-another-injured-after-car-driven-onto-sports-pitch-with-man-arrested-13322232",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-kendal-cumbria_6847494.jpg?20250305214840",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-05 18:55:00",
        "Headline": "A man in his 40s has been arrested on suspicion of causing death by dangerous driving.",
        "Content": "A child has died and another has been injured after a car was driven on to a sports pitch in Cumbria. Police say they were called at 4.58pm to reports of a collision involving a BMW i40 and two children on a pitch at Kendal Rugby Union Football Club on Shap Road, in Kendal. Cumbria Police say one child died, while the second is being treated by paramedics. A man aged in his 40s has been arrested on suspicion of causing death by dangerous driving. A spokesperson for Cumbria Police said: \"Specialist investigators are at the scene and the area has been cordoned off as initial investigation enquiries take place.\" The force said the incident was not believed to be terror-related. Immediate family members of both children have been informed, it added. In a post on its Facebook page, the club said it was \"deeply saddened to confirm that an incident occurred today at Kendal Rugby Club.\" The post, attributed to club chairman Dr Stephen Green, continued: \"Our thoughts are with their family and friends and we kindly ask for privacy for all involved at this difficult time.\" The club and its facilities are now temporarily closed while it cooperates \"fully\" with authorities, it added. More from Sky News:Serial rapist jailed for 15 yearsGardener wins court case over £1m prize Tim Farron MP, whose constituency includes Kendal, posted on X: \"This is devastating, utterly heartbreaking news. I'm praying for the children and for their families and friends. \"Our community in Kendal is stunned and in mourning.\""
    },
    {
        "title": "Zhenhao Zou: How a student described as 'smart and charming' was unmasked as a prolific sexual predator",
        "description": "\"Really, don't push me, it's pointless... the sound insulation here is very good\" - those are the terrifying words of rapist Zhenhao Zou to one of his victims.",
        "url": "https://news.sky.com/story/zhenhao-zou-how-a-student-described-as-smart-and-charming-was-unmasked-as-a-prolific-sexual-predator-13321005",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-zhenhao-zou-met-police_6841249.jpg?20250304193616",
        "type": "UK",
        "Author": "Amelia Harper, news correspondent",
        "Date Published": "2025-03-05 15:30:00",
        "Headline": "Zhenhao Zou, 28, drugged women with powerful tranquillisers at his flat in London then filmed them - officers discovered nearly 1,300 videos.",
        "Content": "By Amelia Harper, news correspondent  \"Really, don't push me, it's pointless... the sound insulation here is very good\" - those are the terrifying words of rapist Zhenhao Zou to one of his victims. Warning: This article contains distressing details It's now believed the former PhD student could have as many as 60 victims after footage was found of numerous unidentified women being attacked. Prosecutors say he appeared to be a \"smart and charming young man\" from a wealthy family, but he hid a secret life as a \"sexual predator, a voyeur and a rapist\". Officers discovered nearly 1,300 videos - but Zou insisted the sex depicted was consensual. The 28-year-old said he had a \"habit\" of taking pictures during sex and told jurors he liked \"rape role play\" and pornography involving sleeping women.  He told the court: \"I like it because the girl appears to be still and quiet when they are having sex.\" Prosecutors said the women in his videos seemed unconscious - and a number of powerful tranquillising drugs were found at Zou's home. 'You should feel guilty for what you did' On Wednesday, following a trial at Inner London Crown Court, Zou was found guilty of 11 counts of rape against 10 different women. However, only two of his victims, one of whom was the victim in two counts, have been identified so far. The other eight victims are yet to be traced. A major effort is now under way to identify other woman seen in Zou's videos, in what police say has become the UK's biggest current rape investigation. Police believe there could be another 50 further victims, with around half of the incidents being investigated by officers thought to have taken place in this country and the other half in China. We are also now able to report that, during the course of the trial, one woman came forward to police claiming to be a victim of Zou. Zou's prolific offending might never have been uncovered if not for the courage of one of his victims to pick up the phone and call the police. The trial heard the woman was raped while \"drunk and unconscious\" at his flat in London's Elephant and Castle in May 2023. Zou filmed the attack and took intimate images without her knowledge using a small camera by the bed. The woman said she was drunk and had tried to leave, but that Zou dragged her back in and pushed her to consume vodka. She said she'd told him she would stay if he transferred her 100,000 in Chinese currency, but that it didn't give him permission to have sex with her. When the two messaged afterwards, Zou told her: \"I had too much to drink and did something wrong, can we discuss this later?\" She replied: \"You should feel guilty for what you did.\" Crucially, the woman posted about her ordeal on Chinese social media apps LittleRedBook and WeChat, prompting someone else to come forward with a similar experience. The woman said she'd woken up to find the former PhD student raping her. She said it happened while \"unconscious\" after being out drinking for four or five hours with friends in London's Chinatown. Zou's 'trophy box' Following Zou's arrest on 25 January 2024, police seized cameras and memory cards from his home, as well as his phone. They were shocked by what they found. He had filmed nine of the women he raped, as well as taking intimate pictures. Zou also kept a box of items, which he claimed was \"lost property\" - but the prosecution said it was a \"trophy box\" of items belonging to his victims. Police believe one of the attacks carried out by Zou happened in his Woburn Place UCL student accommodation, sometime between September 2019 and September 2020. Read more from Sky News:Tesla charging stations set on fireBoy shot dead near Tube station named The evidence was found on a camera in a box in his flat. On the recording, the woman can be heard saying: \"I really don't want... I beg you, don't do this.\" Zou responds: \"Really, don't push me, it's pointless… It's not the first time we have done it. This is the second time… The sound insulation here is very good.\" Police also found multiple 500ml bottles of butanediol at Zou's flat. Toxicologist John Slaughter told Inner London Crown Court it's converted into GHB, typically known as the 'date-rape' drug, if swallowed. Zou claimed the butanediol was for a moisturiser. The jury didn't agree and convicted him of 11 counts of rape, with two of the offences relating to one victim. Zou was also convicted of three counts of voyeurism, 10 of possession of an extreme pornographic image, one of false imprisonment and three of possession of a controlled drug with intent to commit a sexual offence, namely butanediol. He was cleared of two further counts of possession of an extreme pornographic image, and five counts of possession of controlled drugs to commit a sexual offence, namely one count involving MDMA, three involving ketamine, and one of alprazolam. 'Dangerous sexual predator' The Metropolitan Police said the testimony of the two victims was crucial to give context to the videos as many victims appear to be sleeping or unaware of what's going on. They are now trying to identify his other victims with the cooperation of the Chinese authorities. As part of their appeal, a major incident tool is available which - for the first time - has the option for language translations. They particularly want to reach out to the Chinese community, and police think there will be further trials in future. Commander Kevin Southworth, lead for public protection at the Metropolitan Police, said: \"Zhenhao Zou is a dangerous and prolific sexual predator, who manipulated and drugged women in order to prey on them in the most cowardly way. \"I'd like to acknowledge the two women who bravely gave evidence against Zou in court, their courage and resilience has been unwavering. \"We are determined to support all victim-survivors and are now asking women who believe they may have concerns about Zou to please come forward.\""
    },
    {
        "title": "Kyle Clifford: CCTV shows triple killer visiting garden centre on day of murders",
        "description": "CCTV played in court has shown a former soldier visiting a garden centre with his family hours before he murdered his ex-girlfriend, her mother and her sister. ",
        "url": "https://news.sky.com/story/kyle-clifford-cctv-shows-triple-killer-visiting-garden-centre-on-day-of-murders-13322047",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-cctv-kyle-clifford_6847032.jpg?20250305184033",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-03-05 14:25:00",
        "Headline": "The 26-year-old has admitted murdering BBC racing commentator John Hunt's wife Carol and their daughters Louise and Hannah, but denies rape.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  CCTV played in court has shown a former soldier visiting a garden centre with his family hours before he murdered his ex-girlfriend, her mother and her sister.  Kyle Clifford, 26, was also filmed in a branch of B&Q days earlier on 4 July last year buying the silver duct tape he would use to restrain former partner Louise Hunt during the attack. He has admitted murdering the 25-year-old, her mother Carol Hunt, 61, and Louise's sister Hannah Hunt, 28, at the family home, where they lived with BBC racing commentator John Hunt, in Bushey, Hertfordshire, on 9 July last year. Clifford has also admitted possession of the butcher's knife used to kill Mrs Hunt and the crossbow used to shoot her daughters, as well as false imprisonment of Louise. He has chosen not to attend his trial at Cambridge Crown Court for a single charge of raping Louise, which he denies. Prosecutors say Clifford started planning the four-hour attack against her and members of her family after she broke up with him 13 days earlier. Jurors were played footage of Clifford lifting weights at a gym on 5 July. Another clip shows him arriving at a garden centre near his home in Enfield, north London, with members of his family shortly before 10am on the day of the murders. Detective Constable Alex Leckie said he was there with his mother, father and niece, and at one point he can be seen pushing a buggy. Further footage showed Clifford, dressed all in black, parking his car near the Hunt family home before walking to the address and knocking on the door shortly after 2.30pm. A doorbell camera captured his conversation with Carol Hunt as he told her he was \"just dropping off some of Louise's stuff\". Mrs Hunt asks how he is and he replies: \"I'm good, thank you. What's wrong? You look like…\" \"I've seen a ghost,\" she responds. Mr Hunt watched proceedings from the public gallery, while a woman left in tears after the footage at the doorstep was played. Prosecutors say Clifford took a bag of clothes and a \"thank you\" card as a \"ruse\" to get inside the house before taking a knife from his backpack to kill her. Read more from Sky News:PhD student guilty of drugging and raping 10 womenBoy, 16, shot dead near Tube station named Another CCTV clip shows him leaving the house before returning with the crossbow hidden under a blanket and letting himself back into the house with a key. He is said to have held Louise for hours after she returned from working at her dog grooming business, which she ran from a pod in the garden, then shot her moments before her sister got home. The court heard in a 999 call to police, Hannah Hunt said: \"My sister's ex-boyfriend has come in and he shot us.\" She was found found collapsed in the doorway when emergency services arrived but died shortly after. The trial continues."
    },
    {
        "title": "Gardener wins High Court case against Paddy Power over £1m jackpot - after betting firm only paid her £20,000",
        "description": "A gardener, who was told she had scooped more than &#163;1m on a Paddy Power game but was only paid &#163;20,000, has won a High Court case against the betting company.",
        "url": "https://news.sky.com/story/gardener-wins-high-court-case-against-paddy-power-over-1631m-jackpot-after-betting-firm-only-paid-her-16320000-13322187",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-corrine-durber-gambling_6847294.jpg?20250305173147",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-05 17:26:00",
        "Headline": "Corrine Durber sued Paddy Power for breach of contract after she was told she had won a £1m jackpot on one of its games, but was later informed this was an error.",
        "Content": "A gardener, who was told she had scooped more than £1m on a Paddy Power game but was only paid £20,000, has won a High Court case against the betting company. Corrine Durber, from Gloucestershire, was playing one of the firm's online games in October 2020. It was described as a combination of a fruit machine and a wheel of fortune-style game with two different parts. During the second section, spinning the jackpot wheel, Mrs Durber received a message saying she had won the \"Monster Jackpot\" - which was said to be £1,097,132.71. However, she was only paid £20,265.14 and instead told she had actually won the much smaller \"Daily Jackpot\". The company said there had been an error with the game's display as it had been mal-programmed and directed her to the wrong prize. However, Mrs Durber sued PPB Entertainment Limited, which trades as Paddy Power and Betfair, for breach of contract and for the rest of her winnings. \n                  Stake, Everton's shirt sponsor, will leave UK gambling market as advert investigated\n                 \n                  Roblox: How kids are being lured into online casinos\n                 \n                  Illegal casinos are using Roblox to draw children into online gambling\n                 Judge's remarks In a judgment on Wednesday, Mr Justice Ritchie granted summary judgment in her favour - meaning she won without a trial. In a 62-page ruling, the judge said the idea of \"what you see is what you get\" was \"central\" to the online game. He went on: \"Objectively, customers would want and expect that what was to be shown to them on screen to be accurate and correct. \"The same expectation probably applies when customers go into a physical casino and play roulette. \"They expect the house to pay out on the roulette wheel if they bet on number 13 and the ball lands on number 13.\" PPB said the outcome was determined by a random number generator, which said she won the daily jackpot, but an error affected the animations, showing the wrong result. 'Legal torment' Speaking after the decision, Mrs Durber said: \"As you can imagine, I'm so relieved and happy that the judge has confirmed I fairly and squarely won £1m from Paddy Power. \"But why couldn't Paddy Power pay up straight away instead of putting me through this legal torment? \"I will never bet with them ever again.\" Read more from Sky News:Boy, 16, shot dead near Tube station namedEmma Raducanu speaks out after spotting stalkerScottish Tories propose lowering school leaving age She added that Paddy Power had \"tried their very best to deny me my rightful winnings\". \"What's the point in betting if betting companies like Paddy Power won't pay-up when someone wins a big jackpot?\" Following the ruling, a spokesperson for Flutter UKI, which owns Paddy Power, told Sky News: \"Every week, tens of thousands of customers win with Paddy Power, including an individual who received a £5.7m jackpot just one year ago. \"We always strive to provide the best customer experience possible and pride ourselves on fairness. \"We deeply regret this unfortunate case and are reviewing the judgment.\""
    },
    {
        "title": "UK nations plan joint bid to host 2035 FIFA Women's World Cup",
        "description": "The four nations of the UK are planning a joint bid to host the 2035 FIFA Women's World Cup.",
        "url": "https://news.sky.com/story/uk-set-to-bid-for-2035-womens-world-cup-13322248",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-football-world-cup_6847377.jpg?20250305194829",
        "type": "UK",
        "Author": "Rob Harris, sports correspondent, and Kieren Williams, news reporter",
        "Date Published": "2025-03-05 19:17:00",
        "Headline": "The hosting process begins with the submission of a declaration of interest to FIFA, after a bidding timetable was announced on Wednesday.",
        "Content": "By Rob Harris, sports correspondent, and Kieren Williams, news reporter  The four nations of the UK are planning a joint bid to host the 2035 FIFA Women's World Cup. A statement said: \"The Football Associations of England, Northern Ireland, Scotland and Wales will collectively submit an expression of interest to FIFA for the United Kingdom to host the Women's World Cup in 2035.\" Prime Minister Sir Keir Starmer said the planned bid had his government's \"full support\". He added: \"Football is and always will be at the core of our country's identity. \"Whether we watch on TV, play at the weekends like I do, or simply enjoy soaking up the atmosphere in the pub, it brings communities together like little else.\" The process begins with the submission of a declaration of interest to FIFA, after a bidding timetable was announced on Wednesday. Bidders have around a month for expressions of interest to be lodged before submitting the full proposals by November, with a decision being made toward the middle of 2026. \n                  Mansfield footballer Lucas Akins starts League One match hours after crash death guilty plea\n                 \n                  Top FIFA official says it's harder than ever to be a football referee due to abuse\n                 \n                  FIFA president Gianni Infantino defends 'critical' alliance with Donald Trump\n                 Earlier on Wednesday, FIFA limited the prospective 2035 hosts to only European and African nations - opening the path up for the joint UK bid. As Sky News revealed last year, the British bid could be boosted by the potential for the tournament's expansion from 32 to 48 nations. Read more from Sky News:Aspirin could stop some cancers spreadingChild dies after car driven on to sports pitchUS holds direct talks with Hamas The Three Lionesses lost the 2023 World Cup final 1-0 to Spain in Sydney. England has only hosted the World Cup once - when the men won in 1966. But, England led a successful bid for the men's Euro 2034, which will also see Scotland, Wales and Ireland staging matches."
    },
    {
        "title": "Sky News wins best News Channel at Royal Television Society awards - as Sophy Ridge named Presenter of the Year",
        "description": "Sky News has won News Channel of the Year and Sophy Ridge has been named Presenter of the Year at the Royal Television Society (RTS) Awards.",
        "url": "https://news.sky.com/story/sky-news-wins-news-channel-of-the-year-for-eighth-year-in-a-row-at-rts-journalism-awards-13322406",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rts-sophy-ridge-rts-awards_6847608.jpg?20250305235912",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-05 22:37:00",
        "Headline": "RTS judges praised the \"excellent journalism, high production values, and clear analysis\", adding that Sky News was \"hard to beat\" in the news channel category.",
        "Content": " Sky News has won News Channel of the Year and Sophy Ridge has been named Presenter of the Year at the Royal Television Society (RTS) Awards. Speaking about the News Channel of the Year award - which Sky News has won for the eighth year in a row - Jonathan Levy, Managing Director and Executive Editor of Sky News UK, said: \"The recognition of this award is particularly encouraging in such a big news year - a general election and a summer of discontent here at home, the re-election of Donald Trump and the wars in Ukraine and the Middle East abroad. \"As news organisations we choose where, and frankly where not to point our cameras, and last year at Sky News we chose to point them often at the devastating conflict in Sudan. \"It's heartening to see that journalism and that story getting some recognition.\" RTS judges praised the \"excellent journalism, high production values, and clear analysis\", adding that Sky News was \"hard to beat\" in the category. \"It [Sky News] had strong eye-witness coverage from around the world, and also produced highly watchable reporting on many UK stories,\" judges said. Africa correspondent Yousra Elbagir has repeatedly reported from the front lines of Sudan's civil war, while other notable international coverage has included chief correspondent Stuart Ramsay on the conflict in Myanmar and an exclusive with President Zelenskyy. In addition, Sophy Ridge, Sky News' lead political presenter who hosts a weeknight show from 7-8pm, won Network Presenter of the Year. She said: \"I feel very proud to work at Sky News. I feel very proud of the journalism we do at Sky News but for me the best thing about TV journalism is that we work as part of a team. \"At the moment journalism feels like it's under attack, the truth sometimes feels like it's under attack as well. What I keep in mind is that people have the perception that presenting is about talking, when it's about listening. Listening to our viewers, our audience... and all the people that we interview.\" RTS judges said: \"In a very strong field, this presenter stood out... combining disarming toughness with huge likeability. Moving effortlessly from politics to breaking news, she's in control, genuinely insightful and never domineering.\" In 2024, Sky News reported on stories such as the UK's general election - with highlights including Beth Rigby's questioning of Rishi Sunak and Sir Keir Starmer in Grimsby. The World With Yalda Hakim featured interviews including several exclusives with the Qatari prime minister, a key mediator in Gaza ceasefire talks."
    },
    {
        "title": "'Eureka moment' as scientists discover how aspirin could stop some cancers spreading",
        "description": "Scientists have discovered how aspirin may stop some cancers from spreading, describing it as a \"Eureka moment\".",
        "url": "https://news.sky.com/story/eureka-moment-as-scientists-discover-how-aspirin-could-stop-some-cancers-spreading-13322196",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-aspirin-bayer-tablet_6269943.jpg?20230901074654",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-05 17:40:00",
        "Headline": "The new research suggests a path for aspirin to become a cancer treatment - but people are being warned not to start taking it daily without speaking to a doctor. ",
        "Content": "Scientists have discovered how aspirin may stop some cancers from spreading, describing it as a \"Eureka moment\". The new research builds on existing evidence suggesting aspirin supports a boost in the immune system to help catch deadly cancer cells. Clinical trials in cancer patients, examining how aspirin could stop the disease coming back, are ongoing - but experts warn against routinely taking aspirin without speaking to a doctor. The new research suggests a path for aspirin to become a cancer treatment, alongside the development of more effective drugs to prevent cancer spreading. Researchers screened 810 genes in mice and found 15 that impact the spread of cancer. Mice lacking a gene which produces a certain protein, called ARHGEF1, were less likely to have cancer spread to the lungs and liver, the study found. Scientists found that ARHGEF1 suppresses a type of immune cell called a T cell, which is important for recognising and killing metastatic (spreading to other parts of the body) cancer cells. \n                  Tattoos may be linked to increased risk of cancer, study suggests\n                 \n                  Breast cancer cases and deaths set to surge, study suggests\n                 \n                  'Life-saving' simple blood test could transform and personalise cancer care if trial succeeds\n                 They unexpectedly discovered the ARHGEF1 is switched on when T cells are exposed to a particular clotting factor, a protein that prevents excessive bleeding. The clotting factor, called thromboxane A2 (TXA2), is made by platelets in the blood - and aspirin is already known to cut its production. By decreasing TXA2 production, aspirin can prevent certain cancers from spreading, researchers found. In mice given aspirin, the frequency of metastases - the spread of cancer - was reduced compared with ones not on the drug, the research, published in the Nature journal and funded by the Medical Research Council and Wellcome Trust, found. Read more from Sky News:Tattoos may be linked to cancer risk levels - studyCancer death rates '60% higher' in deprived areas Dr Jie Yang, from the team which led the study at the University of Cambridge, described the discovery about TXA2 as a \"Eureka moment\". \"It was an entirely unexpected finding which sent us down quite a different path of inquiry than we had anticipated,\" Dr Yang said. \"Aspirin, or other drugs that could target this pathway, have the potential to be less expensive than antibody-based therapies, and therefore more accessible globally. Researchers are now working with Professor Ruth Langley at University College London, who is leading a study into whether aspirin can stop or delay early stage cancers from returning. Prof Langley said: \"This is an important discovery. It will enable us to interpret the results of ongoing clinical trials and work out who is most likely to benefit from aspirin after a cancer diagnosis.\" However, she warned: \"In a small proportion of people, aspirin can cause serious side-effects, including bleeding or stomach ulcers. \"Therefore, it is important to understand which people with cancer are likely to benefit, and always talk to your doctor before starting aspirin.\""
    },
    {
        "title": "Mansfield footballer Lucas Akins starts League One match hours after crash death guilty plea",
        "description": "Mansfield Town have said they are unable to comment after striker Lucas Akins started a League One match on the same day he admitted causing the death of a cyclist.",
        "url": "https://news.sky.com/story/mansfield-footballer-lucas-akins-starts-league-one-match-hours-after-crash-death-guilty-plea-13321947",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mansfield-town-lucas-akins_6846842.jpg?20250305110754",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-05 12:04:00",
        "Headline": "Lucas Akins, who has also played for Burton Albion, Stevenage, Tranmere and Huddersfield, admitted causing Adrian Daniel's death by careless or inconsiderate driving.",
        "Content": "Mansfield Town have said they are unable to comment after striker Lucas Akins started a League One match on the same day he admitted causing the death of a cyclist. The 36-year-old played in his side's 0-0 draw with Wigan on Tuesday night hours after pleading guilty at Leeds Crown Court to causing the death of Adrian Daniel in March 2022. Mr Daniel, 33, was struck by a Mercedes G350 in Huddersfield and died 10 days later. The footballer, who has also played for Burton Albion, Stevenage and Tranmere, admitted causing Mr Daniel's death by careless or inconsiderate driving and will be sentenced on 24 April. Akins has continued to line up for Mansfield since the incident - and appeared again at his club's One Call Stadium in Tuesday evening's encounter. Mansfield manager Nigel Clough was asked about the player's involvement. He told BBC Radio Nottingham: \"We can't comment on it, I'm afraid. \"We've known about it for some time, it's not just happened, but we're not in a position to comment.\" Read more from Sky News:Billions of pounds in spending cuts expectedWhat we know about rare storm nearing Australia Akins, who has also played for Huddersfield and represents Grenada at international level, missed a late penalty in the League One clash against his former club Burton at the weekend."
    },
    {
        "title": "Authorities' involvement with family - which sparked Leeds riot - 'was never about discrimination', judge says",
        "description": "Local authority involvement with a family in Leeds - which sparked a riot in the city - \"was not, and never had been, about discrimination,\" a judge has told a family court.",
        "url": "https://news.sky.com/story/authorities-involvement-with-family-which-sparked-leeds-riot-was-never-about-discrimination-judge-says-13322229",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-leeds-riot-disorder_6631601.jpg?20240719043635",
        "type": "UK",
        "Author": "Frazer Maude",
        "Date Published": "2025-03-05 18:53:00",
        "Headline": "Police and social workers became involved with the extended family and in July last year, four of the children in the house were removed. The incident led to an eruption of violence in the Harehills area of Leeds. ",
        "Content": "\n          North of England correspondent\n              @frazeratsky\n Local authority involvement with a family in Leeds - which sparked a riot in the city - \"was not, and never had been, about discrimination,\" a judge has told a family court. The hearing focused on an incident in April last year which led to a baby, who was one of seven children living in a house in Harehills, being taken to hospital with what turned out to be a fractured skull. Police and social workers then became involved with the extended family and on 18 July 2024, four of the children in the house were removed over concerns they would be taken out of the country. After the police arrived at the property, the area erupted in violence, with officers coming under attack, a patrol car overturned and a bus torched. Reading her judgement after a three-day, fact-finding hearing, Judge Helen Trotter-Jackson said: \"These entire proceedings have come about because of dishonesty of the parents.\" \"That dishonesty led to widespread public disorder,\" she added. Read more: How did the disorder spiral? \n                  Mansfield footballer Lucas Akins starts League One match hours after crash death guilty plea\n                 \n                  Miah brothers jailed for grooming and sexually abusing girls in Leeds and Barrow-in-Furness\n                 \n                  Surgeons remove tumour through patient's eye socket in UK first\n                 In the judgment, Judge Trotter-Jackson highlighted the inconsistent evidence given by the adults involved in the investigation, saying the mother of the injured child gave what she saw as a \"dishonest and deliberately evasive account\" of how the child was injured, and why medical assistance was not sought sooner. Earlier in the hearing, the boy's mother said she now accepted she should have sought medical attention for her son sooner, on the day he was injured. More from Sky News:British man jailed in Russia for 19 yearsChild dies after car driven on to sports pitch She insisted she did not see any swelling until the next day, but told the court: \"When the child had a fever and was agitated, I should have gone with him to hospital.\" The hearing also heard that three of the children involved have never been registered for secondary school."
    },
    {
        "title": "Trump tells Gazans 'you are dead' if Israeli hostages are not immediately handed over",
        "description": "US President Donald Trump has told Gazans to hand over Israeli hostages or \"you are dead\".",
        "url": "https://news.sky.com/story/us-holds-talks-with-hamas-13322252",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-congress-speech_6846562.jpg?20250305025603",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-05 19:20:00",
        "Headline": "Trump's warning, posted on social media, came after it was confirmed US officials had held direct talks with Hamas. Washington has a long-held policy of not negotiating with terrorists - and Hamas has been labelled as such by Washington since 1997.",
        "Content": " US President Donald Trump has told Gazans to hand over Israeli hostages or \"you are dead\". The threat, made over social media, came hours after the White House confirmed that US officials had broken with tradition to hold direct talks with Hamas. The US has previously avoided direct contact with the group owing to Washington's longstanding position not to negotiate with terrorists - with Hamas having been designated as a terrorist group in the US since 1997. In a press conference on Wednesday, White House press secretary Ms Keavitt said there had been \"ongoing talks and discussions\" between the US officials and Hamas. But she would not be drawn on the substance of the talks - taking place in Doha, Qatar - between US officials and Hamas, but said Israel had been consulted. Ms Leavitt continued: \"Dialogue and talking to people around the world to do what's in the best interest of the American people, is something that the president has proven is what he believes is a good faith, effort to do what's right for the American people.\" There are \"American lives at stake,\" she added. Adam Boehler, Mr Trump's pick to be special envoy for hostage affairs, participated in the direct talks with Hamas. A spokesperson for Benjamin Netanyahu's office said Israel had \"expressed to the United States its position regarding direct talks with Hamas\". Hours later, Mr Trump warned Hamas to hand over Israeli hostages or \"it's over for you\" - adding: \"This is your last warning\". On his Truth Social platform, Mr Trump wrote: \"Release all of the hostages now, not later, and immediately return all of the dead bodies of the people you murdered or it is over for you. \"Only sick and twisted people keep bodies and you are sick and twisted. I am sending Israel everything it needs to finish the job, not a single Hamas member will be safe if you don't do as I say.\" Mr Trump met with freed Israeli hostages on Wednesday, something he referenced in his social media post, before adding: \"This is your last warning. For the leadership of Hamas, now is the time to leave Gaza, while you still have a chance. \"Also, to the people of Gaza, a beautiful future awaits, but not if you hold hostages. If you do, you are dead. Make a smart decision. Release the hostages now, or there will be hell to pay later.\" Israel estimates about 24 living hostages, including American citizen Edan Alexander, and the bodies of at least 35 others, are still believed to be in Gaza. The US has a long-held policy of not negotiating with terrorists - which it is breaking with these talks as Hamas has been designated a foreign terrorist organisation by the US government's National Counterterrorism Center since 1997. The discussions come as a fragile Israel-Hamas ceasefire continues to hold, but its future is uncertain. Mr Trump has signalled he has no intention of pushing the Israeli prime minister away from a return to combat if Hamas does not agree to terms of a new ceasefire proposal - which, Israel says, has been drafted by US Middle East envoy Steve Witkoff. The new plan would require Hamas to release half its remaining hostages - the group's main bargaining chip - in exchange for a ceasefire extension and a promise to negotiate a lasting truce. Read more:The competing plans for rebuilding GazaFreed Israeli hostage details captivity Israel has made no mention of releasing more Palestinian prisoners, a key component of the first phase. Fighting in Gaza has been halted since 19 January. Hamas has exchanged 33 Israeli and five Thai hostages for some 2,000 Palestinian prisoners and detainees."
    },
    {
        "title": "Trump admits tariffs 'disturbance' as China says it is 'ready for any type of war' with US",
        "description": "Donald Trump has admitted his tariffs on major trading partners will cause \"a little disturbance\" - as China said it was \"ready\" for \"any type of war\" with the US.",
        "url": "https://news.sky.com/story/trump-admits-tariffs-disturbance-as-china-says-it-is-ready-for-any-type-of-war-with-us-13321754",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "World",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-05 06:44:00",
        "Headline": "As the rhetoric ramps up from China - and Canada - and slides on stock markets, following the imposition of tariffs on the two countries and Mexico, the US commerce secretary says Donald Trump will \"probably\" announce a compromise.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Donald Trump has admitted his tariffs on major trading partners will cause \"a little disturbance\" - as China said it was \"ready\" for \"any type of war\" with the US. The US president made his comments in an address to Congress, hours after the levies on imports came into effect. Producers in Mexico and Canada have been hit with a 25% tax on items they export to the US, while a 20% tariff has been applied to Chinese imports. Money blog: Do you have money dysmorphia?Trump latest: 'America is back,' US president brags Stock markets, which Mr Trump is said to pay close attention to, slid on the tariffs news. Exporters in the affected countries as well as businesses in the US and economists have raised concerns about the potential price-raising impact of the tariffs. Making imports more expensive will likely make goods more expensive and could push prices up across the board.  Concern over threat to interest rates A cycle of high inflation could lead to interest rates being higher for longer in the US, the world's largest economy, which could dampen economic activity. A slowed US economy would have global consequences but even without a hit to the States, there are fears of a global trade war - in which countries add their own trade barriers in the form of tariffs. The Chinese embassy in the US posted on X: \"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end.\" China imposes retaliatory tariffs The president, however, said he was \"just getting started\" after 43 days into his second term. China and Canada have retaliated with their own tariffs against the US. From next week China will add its own 15% levy on a range of agricultural products such as chicken, wheat, corn and cotton. An extra 10% will be added to soya beans, pork, beef, fruit, vegetables and dairy products imports. The country has also raised additional complaints against the US with the World Trade Organisation (WTO). Read more:Beijing's patience is running thin'Dumb': Canadian PM criticises Trump over tariffsPolitical division in US has never looked like this Speaking to Sky News presenter Yalda Hakim the US former deputy national security advisor Matt Pottinger said Chinese president Xi Jinping was turning the Chinese economy \"into a wartime economy\" \"He's preparing his economy for war so that it can withstand the shocks of war,\" he said on The World with Richard Engel and Yalda Hakim podcast \"That means he's willing to undergo massive inefficiencies in the economy. He's willing to stockpile food that otherwise would flow easily and more cheaply in from foreign vessels.\" \"He's stockpiling copper and all kinds of inputs into the economy. He is making sure that the private sector is wholly aligned with his broad goals, which are about increasing the Chinese Communist Party's control over the economy and creating a bigger, better defence industrial base,\" Mr Pottinger said. \"He's preparing for war.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Compromise 'as early as Wednesday'? Canada's prime minister Justin Trudeau said his country was launching its own WTO challenge and described the US tariffs as a \"dumb thing to do\". He also warned the move by the Trump administration would impact American workplaces and add to inflation in the US. Addressing the American public, he said: \"We don't want this... but your government has chosen to do this to you.\" Canada has announced the imposition of 25% tariffs on US imports worth C$30bn (£16.3bn). But US commerce secretary Howard Lutnick struck a different note on tariffs and on Monday said the president will \"probably\" announce a compromise with Canada and Mexico as early as Wednesday."
    },
    {
        "title": "China's patience with Donald Trump is running out - as trade war rhetoric ramps up",
        "description": "China's premier has warned \"changes unseen in a century are unfolding across the world\" as a trade war with the US intensifies.",
        "url": "https://news.sky.com/story/chinas-patience-with-donald-trump-is-running-out-as-trade-war-rhetoric-ramps-up-13321962",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-china-economy_6846959.jpg?20250305123540",
        "type": "World",
        "Author": "Nicole Johnston",
        "Date Published": "2025-03-05 12:29:00",
        "Headline": "Even before the latest tit-for-tat tariffs broke out, China has been facing severe economic challenges at home - as consumers cautiously save money instead of spending it.",
        "Content": "\n          Asia correspondent\n              @nicole_reporter\n  China's premier has warned \"changes unseen in a century are unfolding across the world\" as a trade war with the US intensifies. Li Qiang was speaking in parliament - a day after Washington slapped another 10% tariff on Chinese goods. Beijing has responded with 10% to 15% tariffs on US food and agricultural products. \"Global economic growth lacks steam, unilateralism and protectionism are on the rise... the multilateral trading system is experiencing disruptions and tariff barriers continue to increase,\" Premier Li added.  The Chinese Embassy in the US has also dialled up the pressure, writing on X: \"If war is what the US wants, be it tariff war, a trade war or any other type of war, we're ready to fight till the end.\" This statement was first made by China's ministry of foreign affairs on Tuesday. The fact that China has repeated it two days in a row is significant. It is a pointed message to the US that China's patience is running out - and its rhetoric about the tit-for-tat tariffs is growing harsher. It has called the tariff war \"pressure\", \"blackmail\", a \"smear campaign\" and \"shifting the blame\". But Mr Trump loves imposing tariffs on China and appears convinced the pressure will work. He blames China for exporting the chemical precursors used to make fentanyl, which has fuelled the US opioid epidemic. Meanwhile, China is facing severe economic challenges at home, with the country setting a growth target of \"about 5%\" for this year. The government's work report said a major task this year is to boost consumption and domestic demand. Money blog: Dollar sinks and market gains wiped out  The problem in China is people aren't spending enough money, instead they are cautiously saving. One reason for this is the weakness of China's social welfare system. People save their money in case they lose their job, or to pay for health and elderly care. The government says it wants to make domestic demand the engine of growth by turning several cities into \"international consumption centres\" - and expanding its trade-in system to encourage people to buy new products for the home. Shopping aside, thousands of delegates from provinces across China attended including high-profile figures like former basketball star Yao Ming, and Lei Jun, who co-founded the electric vehicle manufacturing company Xiaomi. After the session, delegates streamed into the square outside the Great Hall of the People. It is a chance to get their thoughts on the country's future. Congress delegate Liu Hui said: \"I think tariffs will have little impact on China because we treat others the way they treat us.\" Another delegate from Shaanxi province, Song Yaping, is proud of China's hi-tech prowess and said: \"Our technology develops so fast, just look at DeepSeek, look at how fast our AI develops.\" Read more:How Trump's tariffs could cost consumers hereAnalysis: The US may now be in a recession  Despite the confidence, the trade war is deepening. In the factory heartland of Guangzhou in southern China, a glassware exporter is bracing for the impact of the latest Trump tariffs. Marketing manager Anna said: \"I think the people will discuss these tariffs and of course 10% is a huge number. Some companies can't make a profit from this. \"But we can't change it. We just have to get used to it and let it be.\" Still, letting it be is not easy in a world where it feels like everything is changing fast."
    },
    {
        "title": "Are there signs that China is preparing for war?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>       ",
        "url": "https://news.sky.com/story/are-there-signs-that-china-is-preparing-for-war-13322022",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/2372503050321112207_6847077.png?20250305140037",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-05 13:57:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  \"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end,\" China's ministry of foreign affairs wrote in a statement on Tuesday, then shared by the Chinese US embassy on X. With the messy diplomacy of Trump's America and his tariffs on China, how will President Xi Jinping navigate the tit-for-tat on trade? More importantly, is he preparing for something much more dangerous? Nicole Johnston is our correspondent based in Beijing. She joins Niall Paterson to discuss. Producer: Soila ApparicioEditor: Philly Beaumont "
    },
    {
        "title": "Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister",
        "description": "India is walking a tightrope, harbouring deposed Bangladeshi prime minister Sheikh Hasina.",
        "url": "https://news.sky.com/story/sheikh-hasina-india-walks-a-tightrope-harbouring-deposed-bangladeshi-prime-minister-13322078",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sheikh-hasina-narendra-modi_6847301.jpg?20250305174122",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-03-05 15:04:00",
        "Headline": "Sheikh Hasina fled Bangladesh in August last year, and is wanted back in the country to face criminal charges over the deaths of hundreds of protesters during the uprising that toppled her.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n India is walking a tightrope, harbouring deposed Bangladeshi prime minister Sheikh Hasina. Ms Hasina lives with her family in a secure government bungalow in the capital New Delhi, as a state guest. With the threat on her life, the safe house is heavily guarded and has intelligence officers keeping journalists and the public away from the area. Bangladesh is in a very awkward and difficult position with the new interim government led by Nobel Peace Prize laureate Muhammad Yunus.  He previously spoke to Sky News - vowing to put Ms Hasina on trial. Ms Hasina fled the country on 5 August 2024 after a student uprising that ended her 15-year rule. She is wanted back in Bangladesh to face corruption and criminal charges over the deaths of hundreds of protesters during the uprising. \n                  'The ugliest thing': Bangladesh leader reacts to 'House of Mirrors' prison - and vows to put Sheikh Hasina on trial\n                 \n                  UK investigators may assist with Bangladeshi probes into alleged corruption\n                 \n                  Electrocuted on their genitals, mouths sewn up, nails ripped off: Inside Bangladesh's 'death squad' jails\n                 In December, the Bangladesh foreign ministry sent a note verbale, an unsigned diplomatic correspondence, seeking the repatriation of Ms Hasina. The same was acknowledged in New Delhi. Randhir Jaiswal, a spokesperson for the Ministry of External Affairs in India, said: \"We confirm that we have received a note verbale from the Bangladesh High Commission today in connection with an extradition request. \"At this time, we have no comment to offer on this matter.\" The India-Bangladesh extradition treaty of 2013 includes provisions under which an extradition request can be turned down under Article 6 of the treaty. The interim government of Mr Yunus does not represent the entire political spectrum of the country and once a democratically-elected government is in place, a legitimate demand could be considered by New Delhi. Cosy relationship India has had a very cosy relationship with Ms Hasina over her 20-year rule. Many in Bangladesh believe New Delhi played a pivotal role in bringing her to power in 2007, and allegedly helped her authoritarian rule over three terms. India has also been accused of turning a blind eye on issues of large-scale corruption, cronyism and human rights violations. Read more: Inside Bangladesh's 'death squad' jails  New Delhi played into Hasina's narrative The main opposition - Khalida Zia's Bangladesh Nationalist Party (BNP) - was not as friendly to India. Then there is the issue of keeping the Islamist party, Jammat-e-Islami, at bay, which Ms Hasina had banned. New Delhi played into Ms Hasina's narrative, \"that if not her\" then fundamentalists would take over Bangladesh in a sensitive and restive northeastern region of India. The fear blind-sided mandarins and the right-wing political leadership. New Delhi kept all its eggs in Hasina's basket India failed to foster good relations with opposition political parties and kept all its eggs in Ms Hasina's basket. An official from the Bangladesh high commission, who didn't want to be named, told Sky News: \"There were a number of times when former PM Khalida Zia and her BNP tried reaching out to New Delhi, especially during her long incarceration, only to be rejected and unaccommodated by the political establishment. \"It was done to keep Hasina on side.\" Since Indian Prime Minister Narendra Modi's right-wing Hindu nationalist government took over in 2014, this relationship has grown stronger. Close ties of the two nations Both countries share a 2,500-mile-long border, but more than that, the nations are steeped in cultural, social and economic bonds. There are more than 13 million Hindus living in Bangladesh, making up 8% of the population. Read more from Sky News:China's patience with Donald Trump is running outUS expected to scale back Mexico and Canada tariffsFlash floods in Gran Canaria sweep cars into sea During the unrest and its aftermath, there was violence against the community and a number of Hindu temples were targeted by protesters. Several times, Mr Modi's government raised concerns about the safety and security of the minority Hindu community. This is the second time that Ms Hasina has taken refuge in India. After the massacre of 18 of her family members, including her father Sheikh Mujibur Rahman in 1975, she, her husband and children lived in New Delhi for six years until 1981. There is some uncertainty about her future in India, but New Delhi will not be pressured into handing over the former premier anytime soon. This is shown in the shelter and unwavering support by India of the Dalai Lama since 1959, under tremendous Chinese pressure. New Delhi and Dhaka will get an impetus to reset their relationship when Mr Modi and Mr Yunus meet on the sidelines of a regional summit in Thailand in early April."
    },
    {
        "title": "Tesla charging stations set on fire as backlash against Elon Musk intensifies ",
        "description": "Tesla charging stations have been set on fire in the US state of Massachusetts as a backlash against Elon Musk grows.",
        "url": "https://news.sky.com/story/tesla-charging-stations-set-on-fire-as-backlash-against-elon-musk-intensifies-13321909",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-fire_6846944.jpg?20250305121536",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-05 11:13:00",
        "Headline": "The world's richest man and his companies have been targeted since he made what looked like a Nazi salute at Donald Trump's inauguration, and supported far-right movements in Europe.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Tesla charging stations have been set on fire in the US state of Massachusetts as a backlash against Elon Musk grows. Demonstrators have been protesting against his close ties to Donald Trump and embrace of far-right politicians around the world. Officers and firefighters rushed to The Point Shopping Center near Boston and found the charging stations \"engulfed in flames and heavy, dark smoke\".  Police said seven charging stations were damaged and the \"fire appears to have been intentionally set\", but no injuries were reported. Musk, the billionaire chief executive of Tesla, now heads up the president's Department of Government Efficiency (DOGE). Mr Musk has overseen the firing of thousands of government employees in recent weeks. The world's richest man and his companies have been targeted since he made what looked like a Nazi salute at Mr Trump's inauguration, with analysts saying Tesla's car sales have fallen. Tesla cars have been vandalised - and a woman was arrested after being accused of trying to burn down a Tesla dealership in Colorado. Some owners have put stickers on their cars announcing: \"I bought it before Elon went nuts.\" Mr Musk has also faced a backlash in Europe, where he has urged supporters of a German far-right party to move beyond their \"past guilt\", called for the release of jailed far-right activist Tommy Robinson, and described Sir Keir Starmer as an \"evil tyrant\". Read more from Sky News:China says it is 'ready for any type of war' with US after tariffsBillions of pounds in spending cuts expected in spring statementBangladesh's ousted PM 'to stand trial' A suspected arson attack caused a power outage and led to production being halted at a Tesla plant in the German state of Brandenburg, while an image of Musk making a straight-armed salute was also projected on a Tesla factory outside Berlin. In London a poster at a bus stop featured a similar image and branded Teslas as \"the swasticar\". Musk's political activism impacting sales Tesla saw its European sales figures drop by 45% in January, according to research firm Jato Dynamics, with sales in Germany and France down by about 60%. Senior analyst Felipe Munoz told Sky News \"it's hard to tell exactly how much his activism is impacting sales\" - but said it was clear his \"active role in politics\" was \"having an impact\" on the company. Some of the decline may be linked to prospective buyers holding off buying the latest version of Tesla's bestseller, the Model Y, with a new version due to be released later this year. But Mr Munoz said sales of the Model 3 had seen a \"worrying\" drop despite there being no reason for buyers to wait. Democrats protest in Congress with 'Musk steals' signs In a lengthy address to Congress on Tuesday, Mr Trump praised Mr Musk's work, prompting two standing ovations from Republicans in the chamber. The president made exaggerated claims about alleged government abuse Mr Musk and his team had uncovered - prompting Democrats to wave signs reading \"false\" and \"Musk steals\". Since Mr Trump's inauguration, Tesla's stock has fallen by 37% - representing a loss of $550bn (£429bn). Mr Munoz, said the long-term impact of the anger with Mr Musk may be easier to see in a few months. He added: \"Most of the drivers care about the car, they don't care about what the manager or owner of the company thinks, as long as their car doesn't break.\""
    },
    {
        "title": "James Scott Rhys Anderson: British man who 'fought for Ukraine' jailed for 19 years in Russia",
        "description": "A British man has been jailed for 19 years after a Russian court found him guilty of fighting for Ukraine in the country's Kursk region.",
        "url": "https://news.sky.com/story/james-scott-rhys-anderson-british-man-who-fought-for-ukraine-jailed-for-19-years-in-russia-13321751",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-storyful-james-scott-rhys-anderson_6847016.jpg?20250305131718",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-05 06:33:00",
        "Headline": "James Scott Rhys Anderson was charged with terrorist and mercenary offences, and should serve the first five years of his sentence in prison with the rest in a penal colony, a court said.",
        "Content": "A British man has been jailed for 19 years after a Russian court found him guilty of fighting for Ukraine in the country's Kursk region. James Scott Rhys Anderson, 22, had been charged with terrorist and mercenary offences and was convicted following a closed trial. The court said he should serve the first five years of his sentence in prison and the rest in a penal colony. In the trial, a Ukrainian soldier from the same unit was questioned as a witness. Ukrainian troops broke across the border into Kursk region on 6 August last year. They still hold some territory there seven months later, despite attempts by Russian forces to force them out. Investigators accused Anderson of illegally crossing into Kursk in November as part of an armed group that committed unspecified \"criminal acts against civilians\". Russian state media published video showing him being led in handcuffs and locked in a cage of the kind where defendants in Russian court cases are placed. It apparently showed Anderson saying he had served in the British army from 2019-2023 before deciding to join the foreign legion of Ukraine's armed forces. Read more:Ukraine war latest: 'US stops sharing intelligence''Long-range drone strikes weakening Russia's combat ability' Early on in the war, Ukraine's authorities said more than 20,000 people from 52 countries came to Ukraine's aid. Since then, the number of foreign fighters in Ukraine's military has been classified. 'False charges' The Foreign Office condemned the sentencing, demanding Russia respect its obligations to prisoners of war under international law. It also accused Moscow of using prisoners of war like Anderson for \"propaganda purposes\". In a statement, a spokesperson said: \"We strongly condemn the sentencing of British national James Anderson in a Russian court on these false charges. \"Under international law, prisoners of war cannot be prosecuted for participating in hostilities. \"We demand that Russia respect these obligations, including those under the Geneva Conventions, and stop using prisoners of war for political and propaganda purposes. \"We remain in close contact with Mr Anderson's family and are providing consular support.\""
    },
    {
        "title": "Gaza: Desperately ill children arrive in Jordan for specialist medical care",
        "description": "Twenty-nine sick children from Gaza have arrived in Jordan for emergency specialist medical care.",
        "url": "https://news.sky.com/story/gaza-desperately-ill-children-arrive-in-jordan-for-specialist-medical-care-13321732",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-children-bunkall_6846581.jpg?20250305053435",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-03-05 05:18:00",
        "Headline": "The World Health Organisation estimates around 4,500 children from Gaza are in need of urgent medical care.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  Twenty-nine sick children from Gaza have arrived in Jordan for emergency specialist medical care. They are the first of 2,000 children that the Jordanian government has agreed to take from the war-torn Gaza Strip and include amputees, babies with heart defects and children suffering from shrapnel wounds. Cancer patients will be evacuated in the coming days. The transfer was delayed by a number of days but finally went ahead on Tuesday. A few patients were airlifted from the Gaza border but most made the journey by road, through Israel and to the border with Jordan. The World Health Organisation estimates around 4,500 children are in need of urgent medical care. One of the children to be evacuated yesterday, six-month-old Naveen, has a hole in her heart and is dangerously underweight. \"It was difficult in Gaza, there was no treatment I could get for her,\" her mother Enas told Sky News. \"She was losing weight. She is now six months old and she hasn't put on even one kilogram in the last six months. And in the tents my daughter got ill, she is suffering a lot.\" Enas was also with her fifteen-year-old daughter Jenna but left behind many of her family, including twin sons, and travelled with only a few plastic carrier bags of belongings. Naveen is now in hospital in Amman undergoing tests. Read more from Sky News:'America is back,' Trump bragsChina 'ready for any type of war' with US Jordan has rejected Donald Trump's plan to forcibly remove Palestinians from Gaza, but offered to treat these children when King Abdullah met the US president in The White House a few weeks ago. Jordan insists the children and their guardians will be able to return to Gaza once their treatment is complete, although it's unclear whether Israel will allow them access, especially with the status of the ceasefire now extremely uncertain."
    },
    {
        "title": "Trump admits tariffs 'disturbance' as China says it is 'ready for any type of war' with US",
        "description": "Donald Trump has admitted his tariffs on major trading partners will cause \"a little disturbance\" - as China said it was \"ready\" for \"any type of war\" with the US.",
        "url": "https://news.sky.com/story/trump-admits-tariffs-disturbance-as-china-says-it-is-ready-for-any-type-of-war-with-us-13321754",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-05 06:44:00",
        "Headline": "As the rhetoric ramps up from China - and Canada - and slides on stock markets, following the imposition of tariffs on the two countries and Mexico, the US commerce secretary says Donald Trump will \"probably\" announce a compromise.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Donald Trump has admitted his tariffs on major trading partners will cause \"a little disturbance\" - as China said it was \"ready\" for \"any type of war\" with the US. The US president made his comments in an address to Congress, hours after the levies on imports came into effect. Producers in Mexico and Canada have been hit with a 25% tax on items they export to the US, while a 20% tariff has been applied to Chinese imports. Money blog: Do you have money dysmorphia?Trump latest: 'America is back,' US president brags Stock markets, which Mr Trump is said to pay close attention to, slid on the tariffs news. Exporters in the affected countries as well as businesses in the US and economists have raised concerns about the potential price-raising impact of the tariffs. Making imports more expensive will likely make goods more expensive and could push prices up across the board.  Concern over threat to interest rates A cycle of high inflation could lead to interest rates being higher for longer in the US, the world's largest economy, which could dampen economic activity. A slowed US economy would have global consequences but even without a hit to the States, there are fears of a global trade war - in which countries add their own trade barriers in the form of tariffs. The Chinese embassy in the US posted on X: \"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end.\" China imposes retaliatory tariffs The president, however, said he was \"just getting started\" after 43 days into his second term. China and Canada have retaliated with their own tariffs against the US. From next week China will add its own 15% levy on a range of agricultural products such as chicken, wheat, corn and cotton. An extra 10% will be added to soya beans, pork, beef, fruit, vegetables and dairy products imports. The country has also raised additional complaints against the US with the World Trade Organisation (WTO). Read more:Beijing's patience is running thin'Dumb': Canadian PM criticises Trump over tariffsPolitical division in US has never looked like this Speaking to Sky News presenter Yalda Hakim the US former deputy national security advisor Matt Pottinger said Chinese president Xi Jinping was turning the Chinese economy \"into a wartime economy\" \"He's preparing his economy for war so that it can withstand the shocks of war,\" he said on The World with Richard Engel and Yalda Hakim podcast \"That means he's willing to undergo massive inefficiencies in the economy. He's willing to stockpile food that otherwise would flow easily and more cheaply in from foreign vessels.\" \"He's stockpiling copper and all kinds of inputs into the economy. He is making sure that the private sector is wholly aligned with his broad goals, which are about increasing the Chinese Communist Party's control over the economy and creating a bigger, better defence industrial base,\" Mr Pottinger said. \"He's preparing for war.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Compromise 'as early as Wednesday'? Canada's prime minister Justin Trudeau said his country was launching its own WTO challenge and described the US tariffs as a \"dumb thing to do\". He also warned the move by the Trump administration would impact American workplaces and add to inflation in the US. Addressing the American public, he said: \"We don't want this... but your government has chosen to do this to you.\" Canada has announced the imposition of 25% tariffs on US imports worth C$30bn (£16.3bn). But US commerce secretary Howard Lutnick struck a different note on tariffs and on Monday said the president will \"probably\" announce a compromise with Canada and Mexico as early as Wednesday."
    },
    {
        "title": "Trump moves to exclude carmakers from tariff pain",
        "description": "Donald Trump is to exclude carmakers across North America from the pain of US tariffs levelled against Mexico and Canada, following apparent pressure from motor bosses.",
        "url": "https://news.sky.com/story/trump-moves-to-exclude-carmakers-from-tariff-pain-13322200",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-reuters-donald-trump_6845434.jpg?20250303200140",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-03-05 17:27:00",
        "Headline": "Big carmakers appear to have lobbied successfully for some leniency as corporate America frets over the repercussions of Donald Trump's trade war.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump is to exclude carmakers across North America from the pain of US tariffs levelled against Mexico and Canada, following apparent pressure from motor bosses. The White House confirmed the concession was made after the president spoke to the bosses of Ford, General Motors and Stellantis in a call on Wednesday. Each company has manufacturing operations and suppliers in Canada and Mexico. There will be a tariff exemption of at least a month on vehicles made across the continent but only if a previous agreement on so-called 'rules of origin' is implemented in full. It governs where a product is first sourced and where a tariff may apply during transit across borders. \"Reciprocal\" tariffs are still planned from April, the president's spokesman said. Money latest: Inside £7m home of popstar Manufacturers have complained of being worst affected by the imposition of 25% tariffs against both Canada and Mexico since Tuesday because flows of parts between the three countries can be hit by tariffs multiple times. The complicated nature of their operations can mean a single component crosses a border more than once during the production process. Such a big spike in costs from tariffs poses a big risk to sales as customers are asked to pay more to help compensate for the sanctions. Automakers' share prices have been among the worst hit since Mr Trump took office again in January.  The car bosses, according to Reuters news agency sources, pledged additional US investment but wanted clarity on tariffs ahead. Mr Trump urged them to shift their operations to the United States, according to a White House statement. The tariff concession marked the first compromise on the trade issue since the president signalled, on Tuesday, that there would be no U-turns and only more tariffs after Canada said it would respond in kind. There have been growing signs this week that corporate America is uneasy, at best, with the tariff policy against both Mexico and Canada Those US neighbours, along with China, which is facing 20% tariffs, are the country's three biggest trading partners. The imposition of tariffs on all goods has been received badly by financial market investors, worried that US profitability is at risk. One closely-watched forecast for US growth suggested that the threat of tariffs since Mr Trump's election victory was confirmed had hammered activity and plunged the country into recession. Read more:Trump may have talked US economy into recessionChina ready for 'any type of war' with US There are mounting reports of boycotts against US goods in Mexico and Canada. The nerves were publicly admitted by the boss of Jack Daniel's maker Brown Forman, Lawson Whiting, on Wednesday when he described Canadian provinces taking American-made alcohol off shop shelves as \"worse than a tariff\". US stock market values are sharply down since the inauguration and the dollar has lost more than three cents against rivals including the euro and the pound just this week amid the tariff turmoil. Such is the growing investor concern for the health of the US economy, the tariff implications have been partly blamed for a steep fall in oil prices. Brent crude was trading at $68 a barrel earlier on Wednesday - its lowest level for more than three years."
    },
    {
        "title": "Trump tells Gazans 'you are dead' if Israeli hostages are not immediately handed over",
        "description": "US President Donald Trump has told Gazans to hand over Israeli hostages or \"you are dead\".",
        "url": "https://news.sky.com/story/us-holds-talks-with-hamas-13322252",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-congress-speech_6846562.jpg?20250305025603",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-05 19:20:00",
        "Headline": "Trump's warning, posted on social media, came after it was confirmed US officials had held direct talks with Hamas. Washington has a long-held policy of not negotiating with terrorists - and Hamas has been labelled as such by Washington since 1997.",
        "Content": " US President Donald Trump has told Gazans to hand over Israeli hostages or \"you are dead\". The threat, made over social media, came hours after the White House confirmed that US officials had broken with tradition to hold direct talks with Hamas. The US has previously avoided direct contact with the group owing to Washington's longstanding position not to negotiate with terrorists - with Hamas having been designated as a terrorist group in the US since 1997. In a press conference on Wednesday, White House press secretary Ms Keavitt said there had been \"ongoing talks and discussions\" between the US officials and Hamas. But she would not be drawn on the substance of the talks - taking place in Doha, Qatar - between US officials and Hamas, but said Israel had been consulted. Ms Leavitt continued: \"Dialogue and talking to people around the world to do what's in the best interest of the American people, is something that the president has proven is what he believes is a good faith, effort to do what's right for the American people.\" There are \"American lives at stake,\" she added. Adam Boehler, Mr Trump's pick to be special envoy for hostage affairs, participated in the direct talks with Hamas. A spokesperson for Benjamin Netanyahu's office said Israel had \"expressed to the United States its position regarding direct talks with Hamas\". Hours later, Mr Trump warned Hamas to hand over Israeli hostages or \"it's over for you\" - adding: \"This is your last warning\". On his Truth Social platform, Mr Trump wrote: \"Release all of the hostages now, not later, and immediately return all of the dead bodies of the people you murdered or it is over for you. \"Only sick and twisted people keep bodies and you are sick and twisted. I am sending Israel everything it needs to finish the job, not a single Hamas member will be safe if you don't do as I say.\" Mr Trump met with freed Israeli hostages on Wednesday, something he referenced in his social media post, before adding: \"This is your last warning. For the leadership of Hamas, now is the time to leave Gaza, while you still have a chance. \"Also, to the people of Gaza, a beautiful future awaits, but not if you hold hostages. If you do, you are dead. Make a smart decision. Release the hostages now, or there will be hell to pay later.\" Israel estimates about 24 living hostages, including American citizen Edan Alexander, and the bodies of at least 35 others, are still believed to be in Gaza. The US has a long-held policy of not negotiating with terrorists - which it is breaking with these talks as Hamas has been designated a foreign terrorist organisation by the US government's National Counterterrorism Center since 1997. The discussions come as a fragile Israel-Hamas ceasefire continues to hold, but its future is uncertain. Mr Trump has signalled he has no intention of pushing the Israeli prime minister away from a return to combat if Hamas does not agree to terms of a new ceasefire proposal - which, Israel says, has been drafted by US Middle East envoy Steve Witkoff. The new plan would require Hamas to release half its remaining hostages - the group's main bargaining chip - in exchange for a ceasefire extension and a promise to negotiate a lasting truce. Read more:The competing plans for rebuilding GazaFreed Israeli hostage details captivity Israel has made no mention of releasing more Palestinian prisoners, a key component of the first phase. Fighting in Gaza has been halted since 19 January. Hamas has exchanged 33 Israeli and five Thai hostages for some 2,000 Palestinian prisoners and detainees."
    },
    {
        "title": "Three skiers buried up to 30 metres deep in Alaska avalanche presumed dead, officials say",
        "description": "An avalanche that swept away three skiers has likely killed them under the weight of the snow, officials have said.",
        "url": "https://news.sky.com/story/three-skiers-buried-up-to-30-metres-deep-in-alaska-avalanche-presumed-dead-officials-say-13322336",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alaska-girdwood_6847470.jpg?20250305211743",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-05 21:10:00",
        "Headline": "The trio were said to be heli-skiers who use helicopters to reach remote mountains far from commonly used ski lifts.",
        "Content": "An avalanche that swept away three skiers has likely killed them under the weight of the snow, officials have said. The trio had flown by helicopter to a remote mountain range near Anchorage in the US state of Alaska. However, according to state troopers, they were caught in an avalanche and trapped in snow at a depth of between 12 metres (40ft) and 30 metres (100ft). The deaths have not yet been confirmed, but Austin McDaniel, a spokesperson for Alaska State Troopers, said that \"based on the information provided by the operator, unfortunately, we do not believe that any of the three missing persons survived the avalanche\". The incident took place on Tuesday in the Chugach Mountains in an area along the Twentymile River, eight miles (13km) northeast of the airport in Girdwood, and about 40 miles (64km) south of Anchorage. The trio were said to be heli-skiers who use helicopters to reach remote mountains far from commonly used ski lifts. Mr McDaniel added that guides from the heli-skiing company had tried to locate the skiers using avalanche beacons and believed they had found a probable area where they were buried. \n                  Wreckage found in Alaska for missing Bering Air plane carrying 10 people\n                 \n                  Scientists monitoring Alaska volcano after rise in earthquakes beneath it\n                 \n                  Fat Bear Week delayed after contestant killed by rival\n                 Due to the depth, guides were unable to recover them, and there was a continued \"considerable avalanche risk in this area\", Mr McDaniel said. It has also been rainy, windy and foggy in Girdwood, with snow at higher levels. Read more from Sky News:Child dies after car driven on to sports pitchUK plan joint bid to host Women's World CupBoy, 16, shot dead near Tube station named A spokesperson for Alaska State Troopers told Sky News that the weather and the continued risk of avalanches were interferring with rescue efforts, which would resume when it was \"safe for personnel to return to the scene\". In the meantime, the situation was being \"actively monitored\"."
    },
    {
        "title": "Trump responds to Zelenskyy letter in marathon Congress speech",
        "description": "Donald Trump has said he \"appreciates\" President Zelenskyy's renewed pledge to work with him on a peace deal - and that Russia has sent \"strong signals\" it's also ready for a truce.",
        "url": "https://news.sky.com/story/trump-responds-to-zelenskyy-letter-in-marathon-congress-speech-13321716",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-speech_6846730.jpg?20250305092816",
        "type": "US",
        "Author": "Dan Cairns, news reporter",
        "Date Published": "2025-03-05 01:43:00",
        "Headline": "The president began his speech - which lasted around an hour and three-quarters - by proclaiming \"America is back!\" - prompting enthusiastic chants of \"USA\".",
        "Content": "By Dan Cairns, news reporter   Donald Trump has said he \"appreciates\" President Zelenskyy's renewed pledge to work with him on a peace deal - and that Russia has sent \"strong signals\" it's also ready for a truce. The US president made the comments during a marathon address to Congress in which he talked up his actions so far and set out priorities for the future. \"We have accomplished more in 43 days than most administrations accomplished in 4 years, 8 years - and we are just getting started,\" the president said. But it in a highly divided Congress, Democrats registered their dissent with stone faces, placards calling out \"lies\" and one member's ejection. Mr Trump said he'd received an \"important letter\" from the Ukrainian leader saying he would work under his leadership to reach a peace deal. Trump latest - 'We're just getting started' Quotes he read matched a post by Mr Zelenskyy earlier on Tuesday in which he expressed regret for last week's row and said he was ready to sign a minerals pact. \n                  Trump moves to exclude carmakers from tariff pain\n                 \n                  China's patience with Donald Trump is running out - as trade war rhetoric ramps up\n                 \n                  Day 45: What did Trump tell Congress?\n                 \"The letter reads Ukraine is ready to come to the negotiating table as soon as possible to bring lasting peace closer,\" Mr Trump said. \"I appreciate that he sent this letter. Just got it a little while ago,\" he added. The president told a packed House chamber that Moscow had also indicated that they were ready for peace. He said: \"Simultaneously, we've had serious discussions with Russia and have received strong signals that they are ready for peace. Wouldn't that be beautiful?\" Longest speech However, the majority of Mr Trump's speech in the Capitol in Washington DC focussed on domestic issues. At one hour and 39 minute, it was the longest annual address a president has delivered to Congress, breaking Bill Clinton's record of one hour and 28 minutes. Mr Trump lauded his nascent second stint in the White House and said he'd taken \"unrelenting action\" that had already achieved more than some administrations manage in years. The president began his speech by proclaiming \"America is back!\" - prompting enthusiastic chants of \"USA\". Mr Trump said \"the American Dream is surging - bigger and better than ever before\". However, his remarks were met with jeers from Democrats and the House speaker called on the serjeant-at-arms to eject representative Al Green for refusing to stay quiet. Mr Green had stood up and shouted at Mr Trump, gesturing toward the president with his cane.  Other Democrats waved paddles with statements including \"false\" and \"Musk steals\". Some wore blue and yellow in solidarity with Ukraine. With vice president JD Vance sat behind him, Mr Trump reeled off a list of his actions since he started his second term in January. Among others, he mentioned rolling back the Paris climate accords, removing the \"tyranny\" of diversity policies, leaving the World Health Organization and the naming of the 'Gulf of America'. \"Our country will be woke no longer,\" he declared. There was also a special mention for Elon Musk's government efficiency department, DOGE, which has controversially cut thousands of jobs already. President Trump claimed the billionaire's efforts were saving the country billions by cutting waste and fraud. Mr Musk was there in person, unusually in a suit, and stood to acknowledge the applause from the mass of Republicans in the chamber. \"Thank you very much, we appreciate it,\" Mr Trump told him. The president also reaffirmed his commitment to tariffs after measures targeting Canada, China and Mexico took effect yesterday. He said the US had been \"ripped off for decades by every country on earth\" and that tariffs were also about \"protecting the soul of our country\". The president has claimed previously they are in response to the three countries not doing enough to halt the flow of powerful drugs such as fentanyl. In response, China's US embassy tweeted ominously: \"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end.\"  The president also said he would \"make America affordable again\" and that President Biden hadn't done enough to control inflation. \"Joe Biden especially let the price of eggs get out of control - and we are working hard to get it back down. A major focus of our fight to defeat inflation is rapidly reducing the cost of energy,\" he added. Read more:Analysis - Trump's sales pitch quickly descended into a sporting eventPresident treads fine line between a deal and blackmail Illegal immigration also took up a chunk of his record-breaking speech. The president repeated his well-worn pledge to clamp down on people entering through the southern border and reverse what he called \"insane open-border policies\". To another burst of applause, he said he had designated some South America gangs as \"terrorist\" organisations. Greenland and the Panama Canal also got a mention. The president said America intended to reclaim the famous shipping passage - which it relinquished control over in 1999 - and repeated his ambition to own the vast Danish territory. Addressing Greenlanders, he said: \"We strongly support your right to determine your own future, and if you choose, we welcome you into the United States of America.\" \"We need Greenland for national security and even international security,\" he said. \"And we're working with everybody involved to try and get it... and I think we're going to get it, one way or the other.\" First lady Melania Trump watched the speech from on high in the gallery, with guests also including the family of the firefighter killed during the assassination attempt last summer, and a man recently freed from a Russian jail. There was also a heart-warming moment where a child recovering from brain cancer was summoned to stand up. Wearing a police uniform, 13-year-old DJ Daniel was lifted into the air in disbelief by his dad as President Trump told him: \"I am asking our new Secret Service director, Sean Curran, to officially make you an agent of the United States Secret Service. Thank you, DJ.\""
    },
    {
        "title": "Trump speech: In a chamber thick with acrimony, the sales pitch quickly descended into a sporting event",
        "description": "He made us wait for a punchline but he got there.",
        "url": "https://news.sky.com/story/trump-speech-in-a-chamber-thick-with-acrimony-the-sales-pitch-quickly-descended-into-a-sporting-event-13321724",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-congress-speech_6846571.jpg?20250305063951",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-03-05 04:15:00",
        "Headline": "US President Donald Trump delivers his longest ever speech to the joint sitting of Congress, but the mood in the chamber reflects the significant divisions in America, with Democratic representative Al Green ejected from the chamber in the Capitol. ",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  He made us wait for a punchline but he got there. For an address that was trailed as \"fireworks\" by Team Trump, finding a fresh news line was more hard work than firework. From Donald Trump, we'd heard it before. Until, that is, he got to Ukraine, Zelenskyy, the mineral deal and the \"peace\" beyond. He said the Ukrainian president had been in touch saying he was ready to sign an agreement on minerals with the US \"at any time that is convenient for you\". It's what he wanted to hear and his reaction sounded like a breakthrough, following the breakdown at the Oval Office between the pair. Live reaction to President Trump's speech to Congress Trump said: \"I appreciate that he sent this letter. Just got it a little while ago. Simultaneously, we've had serious discussions with Russia and have received strong signals that they are ready for peace. Wouldn't that be beautiful.\" \n                  Trump moves to exclude carmakers from tariff pain\n                 \n                  China's patience with Donald Trump is running out - as trade war rhetoric ramps up\n                 \n                  Day 45: What did Trump tell Congress?\n                  It was the big headline from a nearly two-hour speech that was disrupted and defined by Democratic protest. It's what America's political division looks like - like it's never looked before. Donald Trump arrived for his big night, a president unprecedented, divisive, and box-office. So was this. Read more:How Trump's tariffs could cost US and UKTrump responds to Zelensky letterFact check of Trump's speech Sign grabbed and thrown in the air In a Capitol chamber thick with acrimony, he was led in down an aisle where they cheered him on one side and on the other they remained silent, sullen and seated. One Democrat held a sign that read: \"This is not normal.\" It was grabbed by a Representative across the aisle and thrown into the air. This annual address to Congress is, typically, an occasion when a sitting president sits his people down, tells them where they are and where they're going. This was an opportunity to draw breath and reflect after 43 days of a presidency in perpetual motion.  Signs saying 'that's a lie' and shirts saying 'resist' In the event, the sales pitch quickly descended into a sporting event. Democrats held signs that read \"Musk Steals\" and \"That's a lie\". Female representatives dressed in pink to protest at Trump policies they said were negatively impacting women and families, and other Democrats took off jackets to reveal shirts with the slogans \"Resist\" and \"No more kings\". Then there was the ejection of Representative Al Green. He heckled Trump and later said that hearing the president talking about his mandate \"triggered something\" in him. Democrats yet to unify on how to oppose It all reflected where the Democrats are 43 days into this presidency - furious, yet fragmented. Earlier in the day, party members had been urged by their House leader Hakeem Jeffries to show opposition as a check and balance against the \"excesses of the administration\". The party hasn't come to a unified view on how to play this president - they share the personal animosity, if not the political instinct. On the podium, Donald Trump had a more comfortable night than his last joint address in 2020. Then, he had Democratic Speaker Nancy Pelosi rip up a copy of his speech. Last night, he was flanked by vice president JD Vance and Republican Speaker Mike Johnson bearing expressions of true love. Speech made as stock markets tumbled They laughed in all the right places to a speech that will have felt familiar. \"America is back,\" proclaimed Trump in kicking off an extended recap, a brag and not a humble one, of a presidency he said was \"just getting started\". A big story in the build-up had been tariffs, stock markets tumbling and worries that smouldering trade wars could destabilise the US economy. The concerns are shared by economists and Republican lawmakers and Trump's commerce secretary had suggested he might be preparing to announce a compromise. Not last night, he didn't."
    },
    {
        "title": "Donald Trump: Fact-checking the president - what did he get wrong... and right?",
        "description": "Donald Trump has given a 100-minute address to Congress - but many of his comments included false or misleading information.",
        "url": "https://news.sky.com/story/donald-trump-fact-checking-the-president-what-did-he-get-wrong-and-right-13321755",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-gfx-graphics_6846767.png?20250305094936",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-03-05 06:36:00",
        "Headline": "US President Donald Trump, during his speech to Congress, shared inaccurate statistics about autism, and misleading figures about America's contribution to the war in Ukraine.",
        "Content": "\n          News reporter\n              @ConnorSephton\n  Donald Trump has given a 100-minute address to Congress - but many of his comments included false or misleading information. Fact-checkers have been combing through his remarks to see whether his statements tally up with official data. Trump latest: 'America is back,' US president brags in Congress Autism The president claimed there has been a substantial rise in the number of young people diagnosed with autism. Mr Trump said: \"Not long ago, and you can't even believe these numbers, one in 10,000 children had autism. One in 10,000, and now it's one in 36. There's something wrong.\" Sky's US partner network NBC News says this statistic is often used to justify opposition to vaccines - with figures from the Centers for Disease Control and Prevention suggesting this ratio is incorrect. While it is true that one in 36 children are diagnosed with autism, estimates suggest this stood at about one in 150 back in 2000. Scientific studies clearly show that vaccines do not cause autism - and much of this recent rise can be linked to increasing awareness of the condition, changing definitions of autism, and advances in diagnostic technology.  Ukraine Elsewhere in his speech, Mr Trump said America has spent more on the war in Ukraine than Europe. While the US is by far the biggest provider of aid to Ukraine as a country, Europe as a whole has allocated more. According to the Kiel Institute for the World Economy, the US has provided £94.6bn in overall aid - and Europe, £109bn. Not all countries fully disclose the aid they have committed to Ukraine, making it difficult to calculate the complete amount of funding provided.  Benefits The president told Congress that millions of Americans over 100 years old - including some older than 160 - are receiving Social Security payments. Mr Trump pointed to records that suggested more than 20 million people well past life expectancy are getting cheques - including several people above the age of 220. But these numbers refer to a known problem with government data - and an official report from 2023 confirmed that while these citizens are in the database, \"almost none\" are receiving payments. NBC News says inspectors general at the agency have repeatedly identified the database issue, but the Social Security Administration has argued that updating old records is costly and unnecessary. Payments are automatically stopped to all those who are older than 115. Read more:Fact-checking Trump's claims about UkrainePolitical division in US has never looked like this'Dumb': Canadian PM criticises Trump over tariffs  Borders According to the president, 21 million people \"poured into the United States\" over the past four years. \"Many of them were murderers, human traffickers, gang members and other criminals from the streets of dangerous cities all throughout the world because of Joe Biden's insane and very dangerous open border policies,\" Mr Trump said. NBC News says this is misleading. Customs and Border Protection data suggests the Biden administration had about 14 million \"migrant encounters\" - and of those, approximately 118,000 with criminal backgrounds were apprehended. Mr Trump went on to say his administration has \"quickly achieved the lowest number of illegal border crossers ever recorded\". Official figures from 21 to 31 January do show that US Border Patrol apprehensions fell 85% year on year. It's the word \"ever\" that gets the president into difficulty here. Mr Trump recently posted on Truth Social that 8,326 people were arrested on the US-Mexico border last month, but the Border Patrol's monthly average was 1,752 back in 1961.  Tariffs The president also insisted his controversial tariffs \"are about making America rich again\". He told Congress: \"There'll be a little disturbance, but we're okay with that. It won't be much.\" Most economists disagree - and argue the tariffs will hurt the country because they are effectively tax increases that will likely lead to a rise in the cost of everyday items. According to The Yale Budget Lab, the newly unveiled tariffs on Mexico, Canada and China could cost US households up to £2,000 (£1,562) a year. Its estimates suggest inflation could rise by a full percentage point - with economic growth falling by half a percentage point."
    },
    {
        "title": "China's patience with Donald Trump is running out - as trade war rhetoric ramps up",
        "description": "China's premier has warned \"changes unseen in a century are unfolding across the world\" as a trade war with the US intensifies.",
        "url": "https://news.sky.com/story/chinas-patience-with-donald-trump-is-running-out-as-trade-war-rhetoric-ramps-up-13321962",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-china-economy_6846959.jpg?20250305123540",
        "type": "US",
        "Author": "Nicole Johnston",
        "Date Published": "2025-03-05 12:29:00",
        "Headline": "Even before the latest tit-for-tat tariffs broke out, China has been facing severe economic challenges at home - as consumers cautiously save money instead of spending it.",
        "Content": "\n          Asia correspondent\n              @nicole_reporter\n  China's premier has warned \"changes unseen in a century are unfolding across the world\" as a trade war with the US intensifies. Li Qiang was speaking in parliament - a day after Washington slapped another 10% tariff on Chinese goods. Beijing has responded with 10% to 15% tariffs on US food and agricultural products. \"Global economic growth lacks steam, unilateralism and protectionism are on the rise... the multilateral trading system is experiencing disruptions and tariff barriers continue to increase,\" Premier Li added.  The Chinese Embassy in the US has also dialled up the pressure, writing on X: \"If war is what the US wants, be it tariff war, a trade war or any other type of war, we're ready to fight till the end.\" This statement was first made by China's ministry of foreign affairs on Tuesday. The fact that China has repeated it two days in a row is significant. It is a pointed message to the US that China's patience is running out - and its rhetoric about the tit-for-tat tariffs is growing harsher. It has called the tariff war \"pressure\", \"blackmail\", a \"smear campaign\" and \"shifting the blame\". But Mr Trump loves imposing tariffs on China and appears convinced the pressure will work. He blames China for exporting the chemical precursors used to make fentanyl, which has fuelled the US opioid epidemic. Meanwhile, China is facing severe economic challenges at home, with the country setting a growth target of \"about 5%\" for this year. The government's work report said a major task this year is to boost consumption and domestic demand. Money blog: Dollar sinks and market gains wiped out  The problem in China is people aren't spending enough money, instead they are cautiously saving. One reason for this is the weakness of China's social welfare system. People save their money in case they lose their job, or to pay for health and elderly care. The government says it wants to make domestic demand the engine of growth by turning several cities into \"international consumption centres\" - and expanding its trade-in system to encourage people to buy new products for the home. Shopping aside, thousands of delegates from provinces across China attended including high-profile figures like former basketball star Yao Ming, and Lei Jun, who co-founded the electric vehicle manufacturing company Xiaomi. After the session, delegates streamed into the square outside the Great Hall of the People. It is a chance to get their thoughts on the country's future. Congress delegate Liu Hui said: \"I think tariffs will have little impact on China because we treat others the way they treat us.\" Another delegate from Shaanxi province, Song Yaping, is proud of China's hi-tech prowess and said: \"Our technology develops so fast, just look at DeepSeek, look at how fast our AI develops.\" Read more:How Trump's tariffs could cost consumers hereAnalysis: The US may now be in a recession  Despite the confidence, the trade war is deepening. In the factory heartland of Guangzhou in southern China, a glassware exporter is bracing for the impact of the latest Trump tariffs. Marketing manager Anna said: \"I think the people will discuss these tariffs and of course 10% is a huge number. Some companies can't make a profit from this. \"But we can't change it. We just have to get used to it and let it be.\" Still, letting it be is not easy in a world where it feels like everything is changing fast."
    },
    {
        "title": "Day 45: What did Trump tell Congress?",
        "description": "<strong><a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a></strong>",
        "url": "https://news.sky.com/story/day-45-what-did-trump-tell-congress-13321803",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-05 08:38:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On Day 45 of Trump 100 US correspondents Mark Stone and James Matthews break down Trump's marathon address to Congress. They discuss why division in American politics is deeper than ever as Democrats stage a protest. They also discuss if Mexico and Canada tariffs could already be on the way out - and if peace in Ukraine is any closer since Zelenskyy's letter to Trump. If you've got a question you'd like Mark, James and US correspondent Martha Kelner to answer, you can email it to trump100@sky.uk"
    },
    {
        "title": "Florida launches criminal investigation into Tate brothers",
        "description": "Florida has launched a criminal investigation into Andrew and Tristan Tate - days after their arrival in the US from Romania.",
        "url": "https://news.sky.com/story/florida-launches-criminal-investigation-into-tate-brothers-13321842",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-andrew-tate-tristan-tate_6846999.jpg?20250305125653",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-05 09:50:00",
        "Headline": "Andrew and Tristan Tate, who are fighting a series of legal battles in Romania, the UK and the US, arrived in Florida last week amid deepening ties with Donald Trump's inner circle - but the state's governor says they are not welcome.",
        "Content": "Florida has launched a criminal investigation into Andrew and Tristan Tate - days after their arrival in the US from Romania. The state's governor Ron DeSantis said the brothers were not welcome and he would be directing the attorney general to examine their alleged crimes. James Uthmeier, the state's attorney general, said its work was \"active\" into holding a preliminary inquiry into the Tate brothers. He said: \"Based on a thorough review of the evidence, I've directed the Office Of Statewide Prosecution to execute search warrants and issue subpoenas in the now-active criminal investigation into the Tate brothers.\" Andrew Tate, 38, hit back, claiming US authorities are \"trying to find crimes on an innocent man\". He and his brother Tristan, 36 - who are fighting a series of legal battles in Romania, the UK and the US and deny all the allegations against them - landed in Fort Lauderdale, Florida, in a private plane last Thursday after leaving Romania.  The brothers are facing charges in Romania of human trafficking, sexual misconduct and money laundering, as well as starting an organised crime group. Separate and unrelated allegations of rape and human trafficking are also being investigated by UK police. A recent lawsuit filed in Florida accuses both Tate brothers of conspiring to coerce a woman into sex work, luring her to Romania and defaming her after her testimony to Romanian authorities. The Tate brothers had previously sued her for defamation in 2023. Read more:Why is Andrew Tate so controversial?The Tates and Donald Trump's inner circleHow Tate made millions - despite serious chargesWhy is Trump backing an alleged 'rapist and human trafficker'?  'Misogynists' champion Donald Trump The Tates were arrested in late 2022 and formally indicted last year in Romania on charges they participated in a criminal ring that lured women to the country, where they were sexually exploited. The self-styled misogynists - who champion US President Donald Trump - are dual UK and US nationals whose controversial views are shared widely on social media platforms such as TikTok and X. Their arrival in Florida came after the Trump administration reportedly lobbied their Romanian counterparts to ease restrictions on the brothers while they face charges - although Mr Trump denied any knowledge of the case. Romanian prosecutors later said they had approved a request for the Tates to travel outside of the country, pending the outcome of a criminal investigation."
    },
    {
        "title": "Trump moves to exclude carmakers from tariff pain",
        "description": "Donald Trump is to exclude carmakers across North America from the pain of US tariffs levelled against Mexico and Canada, following apparent pressure from motor bosses.",
        "url": "https://news.sky.com/story/trump-moves-to-exclude-carmakers-from-tariff-pain-13322200",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-reuters-donald-trump_6845434.jpg?20250303200140",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-05 17:27:00",
        "Headline": "Big carmakers appear to have lobbied successfully for some leniency as corporate America frets over the repercussions of Donald Trump's trade war.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump is to exclude carmakers across North America from the pain of US tariffs levelled against Mexico and Canada, following apparent pressure from motor bosses. The White House confirmed the concession was made after the president spoke to the bosses of Ford, General Motors and Stellantis in a call on Wednesday. Each company has manufacturing operations and suppliers in Canada and Mexico. There will be a tariff exemption of at least a month on vehicles made across the continent but only if a previous agreement on so-called 'rules of origin' is implemented in full. It governs where a product is first sourced and where a tariff may apply during transit across borders. \"Reciprocal\" tariffs are still planned from April, the president's spokesman said. Money latest: Inside £7m home of popstar Manufacturers have complained of being worst affected by the imposition of 25% tariffs against both Canada and Mexico since Tuesday because flows of parts between the three countries can be hit by tariffs multiple times. The complicated nature of their operations can mean a single component crosses a border more than once during the production process. Such a big spike in costs from tariffs poses a big risk to sales as customers are asked to pay more to help compensate for the sanctions. Automakers' share prices have been among the worst hit since Mr Trump took office again in January.  The car bosses, according to Reuters news agency sources, pledged additional US investment but wanted clarity on tariffs ahead. Mr Trump urged them to shift their operations to the United States, according to a White House statement. The tariff concession marked the first compromise on the trade issue since the president signalled, on Tuesday, that there would be no U-turns and only more tariffs after Canada said it would respond in kind. There have been growing signs this week that corporate America is uneasy, at best, with the tariff policy against both Mexico and Canada Those US neighbours, along with China, which is facing 20% tariffs, are the country's three biggest trading partners. The imposition of tariffs on all goods has been received badly by financial market investors, worried that US profitability is at risk. One closely-watched forecast for US growth suggested that the threat of tariffs since Mr Trump's election victory was confirmed had hammered activity and plunged the country into recession. Read more:Trump may have talked US economy into recessionChina ready for 'any type of war' with US There are mounting reports of boycotts against US goods in Mexico and Canada. The nerves were publicly admitted by the boss of Jack Daniel's maker Brown Forman, Lawson Whiting, on Wednesday when he described Canadian provinces taking American-made alcohol off shop shelves as \"worse than a tariff\". US stock market values are sharply down since the inauguration and the dollar has lost more than three cents against rivals including the euro and the pound just this week amid the tariff turmoil. Such is the growing investor concern for the health of the US economy, the tariff implications have been partly blamed for a steep fall in oil prices. Brent crude was trading at $68 a barrel earlier on Wednesday - its lowest level for more than three years."
    },
    {
        "title": "Billions of pounds in spending cuts - including welfare - expected in spring statement",
        "description": "Several billion pounds in spending cuts - including from the welfare budget - are expected in the spring statement later this month.",
        "url": "https://news.sky.com/story/billions-of-pounds-in-spending-cuts-including-welfare-expected-in-spring-statement-13321764",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-rachel-reeves-media_6772166.jpg?20241210105047",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-05 07:12:00",
        "Headline": "Chancellor Rachel Reeves's self-imposed fiscal rules mean she cannot borrow for day-to-day spending - leaving cuts including welfare cuts as one of her only options.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Several billion pounds in spending cuts - including from the welfare budget - are expected in the spring statement later this month. The Treasury will put forward the proposed cuts to the Office of Budget Responsibility (OBR) on Wednesday, ahead of it providing a financial forecast on 26 March, alongside Chancellor Rachel Reeves announcing her spring statement. Sky's deputy political editor Sam Coates revealed on the Politics at Jack and Sam's podcast that welfare cuts are set to be part of the spring statement package to help the chancellor come within her borrowing limit. Politics latest: Ministers to make 'blizzard of announcements' Coates said there would be a \"four-point plan\" involving planning reform, Whitehall cuts, regulation cuts and welfare cuts. 👉Listen to Politics At Jack And Sam's on your podcast app👈 The Treasury believes Ms Reeves must maintain a £10bn headroom after months of economic downturn and geopolitical events since last October's budget. \n                  Starmer refuses to say if further tax rises will be imposed at spring statement\n                 \n                  Former Bank of England governor Lord King says income taxes must rise\n                 \n                  More pressure to raise taxes or cut spending - despite greatest budget surplus since records began\n                 Her self-imposed fiscal rules mean she cannot borrow for day-to-day spending, leaving spending cuts as one of her only options.  Poor economic climate forcing her hand Sir Keir Starmer said last week the government was in the \"early stages\" of looking at whether tax rises or spending cuts were needed to meet Labour's self-imposed fiscal rules. The prime minister refused to say whether further tax rises or spending cuts would be imposed. The OBR is required to produce two economic forecasts a year, but the chancellor said she would only give one budget a year to provide stability and certainty on upcoming tax changes. However, the poor economic climate since October is forcing her hand, with inflation hitting a 10-month high of 3% in January, a sharp rise in government bond yields and growth has not been as high as expected. Deputy political editor If you remember in October in the budget, Rachel Reeves set herself very tough limits on borrowing. She can't borrow for day-to-day spending from 2029. She's got to reduce the amount this government borrows.  But she also spent right up to the limit and borrowed right up to the limit, leaving herself historically low - what's known as headroom - just under £10bn. And since then, growth has been worse. Borrowing costs have been higher. All of which means that she's going to have to do more borrowing than she predicted in October.  But she's got almost no room before she breaches her fiscal rules.  The Treasury believes that the minimum headroom that they've got to have at the end of this process will still have to be £10 billion or so.  That's historically low as it is. You can not just allow that headroom to be eroded away by higher borrowing because of lower growth and high borrowing costs.  So in other words, for every billion of additional borrowing that the OBR thinks she's going to have to do, taking it closer or over her limit, she’s going to have to find spending cuts, possibly welfare cuts. It is not the case that she's got £10bn before there's a problem. She's got no billion pounds before she starts having to find public spending cuts. Because they don't want the headroom to get any smaller than it is at the moment. I have also noticed this over the last few weeks that Downing Street is fully invested in making Reeves look good at all points, whether it's on defence spending or if it's on the general government narrative.  Number 10 is absolutely doing everything it can to improve Reeves' standing because she's had a much rockier time than anyone expected.  The numbers are the numbers. She's good in the Commons chamber, but the fundamentals aren't great.  Number 10 is very invested in her because there cannot be any division between Starmer and Reeves. If something hurts Reeves, it just hurts Starmer as well because he's subcontracted so much to her. Read more:Everything you need to know about Starmer's Ukraine peace planJD Vance denies insulting British troops over 'random country' jibeBill to limit harms of smartphone use among children to be published British economy will be affected by US tariffs Donald Trump imposed tariffs on Canada, Mexico and China - the US's biggest trading partners - this week, prompting retaliation as stock markets fell sharply around the world. The UK has not been hit by tariffs yet, but the chancellor said the British economy will still be affected by the US president's trade war even if the UK strikes a deal with the White House. \"It's absolutely the case that even if tariffs aren't applied to the UK we will be affected by slowing global trade, by slower GDP growth and by higher inflation than otherwise would be the case,\" she told hundreds of top British manufacturers at a key industry conference on Tuesday."
    },
    {
        "title": "Tesla charging stations set on fire as backlash against Elon Musk intensifies ",
        "description": "Tesla charging stations have been set on fire in the US state of Massachusetts as a backlash against Elon Musk grows.",
        "url": "https://news.sky.com/story/tesla-charging-stations-set-on-fire-as-backlash-against-elon-musk-intensifies-13321909",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-fire_6846944.jpg?20250305121536",
        "type": "Business",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-05 11:13:00",
        "Headline": "The world's richest man and his companies have been targeted since he made what looked like a Nazi salute at Donald Trump's inauguration, and supported far-right movements in Europe.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Tesla charging stations have been set on fire in the US state of Massachusetts as a backlash against Elon Musk grows. Demonstrators have been protesting against his close ties to Donald Trump and embrace of far-right politicians around the world. Officers and firefighters rushed to The Point Shopping Center near Boston and found the charging stations \"engulfed in flames and heavy, dark smoke\".  Police said seven charging stations were damaged and the \"fire appears to have been intentionally set\", but no injuries were reported. Musk, the billionaire chief executive of Tesla, now heads up the president's Department of Government Efficiency (DOGE). Mr Musk has overseen the firing of thousands of government employees in recent weeks. The world's richest man and his companies have been targeted since he made what looked like a Nazi salute at Mr Trump's inauguration, with analysts saying Tesla's car sales have fallen. Tesla cars have been vandalised - and a woman was arrested after being accused of trying to burn down a Tesla dealership in Colorado. Some owners have put stickers on their cars announcing: \"I bought it before Elon went nuts.\" Mr Musk has also faced a backlash in Europe, where he has urged supporters of a German far-right party to move beyond their \"past guilt\", called for the release of jailed far-right activist Tommy Robinson, and described Sir Keir Starmer as an \"evil tyrant\". Read more from Sky News:China says it is 'ready for any type of war' with US after tariffsBillions of pounds in spending cuts expected in spring statementBangladesh's ousted PM 'to stand trial' A suspected arson attack caused a power outage and led to production being halted at a Tesla plant in the German state of Brandenburg, while an image of Musk making a straight-armed salute was also projected on a Tesla factory outside Berlin. In London a poster at a bus stop featured a similar image and branded Teslas as \"the swasticar\". Musk's political activism impacting sales Tesla saw its European sales figures drop by 45% in January, according to research firm Jato Dynamics, with sales in Germany and France down by about 60%. Senior analyst Felipe Munoz told Sky News \"it's hard to tell exactly how much his activism is impacting sales\" - but said it was clear his \"active role in politics\" was \"having an impact\" on the company. Some of the decline may be linked to prospective buyers holding off buying the latest version of Tesla's bestseller, the Model Y, with a new version due to be released later this year. But Mr Munoz said sales of the Model 3 had seen a \"worrying\" drop despite there being no reason for buyers to wait. Democrats protest in Congress with 'Musk steals' signs In a lengthy address to Congress on Tuesday, Mr Trump praised Mr Musk's work, prompting two standing ovations from Republicans in the chamber. The president made exaggerated claims about alleged government abuse Mr Musk and his team had uncovered - prompting Democrats to wave signs reading \"false\" and \"Musk steals\". Since Mr Trump's inauguration, Tesla's stock has fallen by 37% - representing a loss of $550bn (£429bn). Mr Munoz, said the long-term impact of the anger with Mr Musk may be easier to see in a few months. He added: \"Most of the drivers care about the car, they don't care about what the manager or owner of the company thinks, as long as their car doesn't break.\""
    },
    {
        "title": "Post Office chair warns postmasters on pay uplift amid Whitehall funding talks",
        "description": "The chairman of the Post Office has warned postmasters the state-owned company faces a fight to deliver a previously pledged pay uplift this year amid protracted government funding talks.",
        "url": "https://news.sky.com/story/post-office-chair-warns-postmasters-on-pay-uplift-amid-whitehall-funding-talks-13321895",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-paddington-post-office_6747204.jpg?20241113103312",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-05 10:55:00",
        "Headline": "Nigel Railton told thousands of postmasters this week that a previously pledged £120m pay increase this year remained uncertain as it awaits government approval, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The chairman of the Post Office has warned postmasters the state-owned company faces a fight to deliver a previously pledged pay uplift this year amid protracted government funding talks. Sky News has learnt that Nigel Railton, who was parachuted into the role last year, told thousands of Post Office managers this week that he had yet to gain certainty from Whitehall about a £120m increase for this year. The sum was promised in November as part of a strategy to rebuild the Post Office in the wake of the Horizon IT scandal. Money blog: Dollar sinks and market gains wiped out However, in remarks made to sub-postmasters on Tuesday, Mr Railton is understood to have said: \"Our funding discussions are positive and ongoing, but I want to be honest that we are operating in a challenging financial environment. \"We are able to pay an additional £17m in remuneration for April and May trading, representing a 25% year on year increase,\" he said, according to one person who attended the online conference. \"The reality is that as we build towards delivering a further £100m uplift is that we are likely to have a series of incremental announcements over the next 12 months, as we make progress with our funding submissions.\" \n                  Victims of second Post Office scandal criticise 'grinding wheels of bureaucracy' as they try to get compensation\n                 \n                  Post Office scandal: 21 ‘Capture’ cases now being investigated for miscarriages of justice\n                 \n                  Sub-postmasters still going through hell, lead campaigner Sir Alan Bates says\n                 Mr Railton is understood to have told managers he anticipated a further update from the government \"in the next few weeks, with a final decision likely in June\", the source said.  The Post Office chairman acknowledged that \"this is far from ideal - I want to give you more financial certainty for future years\", they added. The Post Office is reliant on funding from the government, and has outlined plans for an ambitious transformation plan which includes franchising more than 100 directly managed branches. A substantial number of jobs are also being cut at the company's head office as part of the restructuring."
    },
    {
        "title": "Hong Kong firm sells major Panama Canal ports to US firm after Trump pressure",
        "description": "Two major Panama Canal ports have been sold from their Hong Kong owner to a consortium including American multinational investment company BlackRock.",
        "url": "https://news.sky.com/story/hong-kong-firms-sells-major-panama-canal-ports-to-us-firm-after-trump-pressure-13321850",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-panama-canal-balboa_6847141.jpg?20250305144153",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-05 09:55:00",
        "Headline": "The sale is \"wholly unrelated to recent political news\", a managing director said but was welcomed by President Donald Trump who said his administration \"will be reclaiming\" the Panama Canal. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Two major Panama Canal ports have been sold from their Hong Kong owner to a consortium including American multinational investment company BlackRock. It comes after US President Donald Trump expressed a desire for America to \"take back\" the key shipping lane from alleged Chinese control. Hong Kong-based logistics giant CK Hutchison Holdings announced plans to sell a majority stake in the business that controls Balboa and Cristobal ports - which sit at each end of the shipping lane. The sale is of a 90% interest in Panama Ports Company, which is contracted to run the important ports until 2047. Money blog: Dollar sinks and market gains wiped out The Panamanian ports are being sold to a consortium including US financial behemoth BlackRock for nearly $23bn (£17.8bn). It comes after President Donald Trump applied pressure to end what he says is China's influence and control over the important shipping lane through which most goods pass. As part of wider comments, on taking control of other sovereign territories, Mr Trump threatened earlier this year to \"take [the canal] back\" having said, \"China is running the Panama Canal\". However, on Wednesday, CK Hutchinson Holdings insisted that the deal was \"wholly unrelated to recent political news\".  The deal was made a month after a visit to Panama City by US secretary of state Marco Rubio and was welcomed by Trump on Tuesday night. A happy Trump \"My administration will be reclaiming the Panama Canal, and we've already started doing it,\" Mr Trump told Congress. \"Just today, a large American company announced they are buying both ports around the Panama Canal and lots of other things having to do with the Panama Canal and a couple of other canals.\" The purchase is part of a wider deal for Hutchison Port's global business. In total, the consortium will control 43 ports in 23 countries, CK Hutchison Holdings said. The conglomerate pushed back against the idea the deal was impacted by politics. \"I would like to stress that the transaction is purely commercial in nature and wholly unrelated to recent political news reports concerning the Panama Ports,\" CK Hutchison co-managing director Frank Sixt said. Read more:Beijing insists it won't be bullied'Dumb': Canadian PM criticises Trump over tariffsPolitical division in US has never looked like this CK Hutchison Holdings is also the owner of UK mobile phone network Three, which is being merged with Vodafone to form the UK's biggest provider. Why does the Panama Canal matter? The shipping artery is of vital importance as more than three-quarters of vessels passing through originate or are bound for the United States. Roughly 12,000 ships used the Panama Canal last year."
    },
    {
        "title": "Adidas sells final pair of Yeezy trainers - years after cutting ties with Kanye West",
        "description": "Adidas has sold the last remaining pair of Yeezy trainers - more than two years after cutting ties with Kanye West.",
        "url": "https://news.sky.com/story/adidas-sells-final-pair-of-yeezy-trainers-years-after-cutting-ties-with-kanye-west-13321871",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kanye-west-bianca-censori_6825747.jpg?20250211160033",
        "type": "Business",
        "Author": "Connor Sephton",
        "Date Published": "2025-03-05 10:00:00",
        "Headline": "Ending the partnership continues to have a financial impact on Adidas - with sales in North America dropping by 2% last year.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Adidas has sold the last remaining pair of Yeezy trainers - more than two years after cutting ties with Kanye West. The sportswear giant distanced itself from the US rapper after he made a slew of antisemitic comments in 2022. But this left the company with a mountain of stock, and millions of Yeezy shoes with an estimated retail value of £1bn left sitting in warehouses.   Ending the partnership also contributed to Adidas posting its first annual loss for more than three decades. Back in 2023, the German brand had confirmed plans to start selling Yeezy merchandise - donating some of the proceeds to charity. \n                  Scarlett Johansson responds after her likeness is used in AI video of celebrities condemning Kanye West's antisemitism\n                 \n                  Kanye West's Yeezy online shopping platform taken down over swastika T-shirts\n                 \n                  Kanye West criticised over Super Bowl ad for website selling swastika T-shirt\n                 It made an operating profit of £250m from the stock that year, and a further £167m in 2024. Contributions were made to organisations including the Anti-Defamation League and Robert Kraft's Foundation to Combat Antisemitism. Defending the decision to sell the stock, Adidas chief executive Bjørn Gulden had said: \"This is much better than destroying and writing off the inventory.\" The partnership with West, also known as Ye, had been hugely lucrative for the brand and continues to have an impact on its bottom line. Announcing its annual financial results on Wednesday, Adidas said North America revenues in 2024 had fallen by 2% - and this was \"solely due to significantly lower Yeezy sales\". Looking ahead, the company warned that earnings for 2025 are also forecast to be lower than expected. Operating profits for last year stood at £1.12bn. Adidas is looking for new growth opportunities beyond its retro trainers, which include the Samba and Gazelle collections. And while Nike is the market leader in the US, the company says it has a \"clear ambition\" of being the top sportswear brand across all other markets.  Last month, West's Yeezy online shopping platform was taken down after it began selling T-shirts adorned with swastikas. The Nazi symbol is an image often used by the far right, and the rapper was criticised for promoting these clothes in a TV advert during the Super Bowl. West recently deleted his X account after making a series of offensive and \"hate-filled\" posts. As well as saying \"I love Hitler\" and \"I'm a Nazi\", the 47-year-old had declared: \"I'm never apologising for my Jewish comments.\" All legal proceedings between Kanye West and Adidas ended last October, when both parties reached an out-of-court settlement."
    },
    {
        "title": "'Money dysmorphia' searches are rocketing - here are telltale signs you have it",
        "description": "Searches for \"money dysmorphia\" have soared in the past year - climbing 136%.&#160;",
        "url": "https://news.sky.com/story/money-dysmorphia-searches-are-rocketing-here-are-telltale-signs-you-have-it-13321832",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-istock-shopping_6846755.jpg?20250305094052",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-03-05 09:34:00",
        "Headline": "\"Money dysmorphia\" is a term used to describe a disconnect between someone's financial reality and their perception of how wealthy they are.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n Searches for \"money dysmorphia\" have soared in the past year - climbing 136%.  But what is it? Why are people concerned about it? And is there a chance you suffer from it? The term is used to describe a disconnect between someone's financial reality and their perception of how wealthy they are. Read more: Live updates from the Money blog Though it is not a medical diagnosis, those who experience it can develop unhealthy spending habits. Sometimes people feel they have less money than they do, which can cause excessive panic and anxiety around finances. Christie Cook, finance expert at Hodge Bank, said some people may even avoid small expenses like going out for a meal, even if they can afford it, due to feeling financially insecure. \n                  Holyrood's winter fuel payment decision 'direct consequence' of Westminster move, court told\n                 \n                  Cost of living crisis set to intensify again as bills mount despite surprise fall in inflation\n                 \n                  Higher prices for 2025 as Christmas trading fails to meet expectations - BRC says\n                 In other cases, people believe they have more money than they do, which can lead to overspending and landing themselves in financial difficulty. \"With social media fuelling unrealistic comparisons and constant negative news about the cost of living crisis, it's no surprise that many people are experiencing financial anxiety,\" she told Money. The bank's research was very personal, with one of its employees, Emma Hull, experiencing money dysmorphia herself. The homeowner, 29, who has a good sum of money tucked away in savings and investments, told Money it has caused her to feel \"panicky\" at times. \"I recently had a speeding fine and when it came through it ruined my day hugely as it was an unexpected cost that I, in my head, couldn't afford. However, while I could definitely afford it, it just meant that I couldn't put as much into my savings as I wanted to,\" she said. \"Savings are there for emergencies and to be used, but when it gets lower than I'd like it to, I definitely freak out a little bit. \"We all have that post-night out fear of checking bank accounts, but even though I try and do things on the cheap... there are always costs on my bank that I don't want to see, and checking it and seeing money come out definitely makes me a bit panicky.\" Read more from Money:The new employment rights you will get - and the one you won'tBillions of pounds in spending cuts expected in spring statementCanadian PM sends bold message to Americans Money dysmorphia has also left her finding it difficult to splurge on things for herself, even when she can afford to. \"I would love to care less and be able to treat myself a little more, but my mindset often tells me that I can't do this even though my bank account tells me I can,\" she said. \"The main question that I ask myself constantly is 'do you really need that?' I'm also someone that checks their bank every single morning, so if I know I'm going to have slightly more money spare than normal, then I might stretch, but I'm definitely not an impulse buyer.\" To try to tackle the problem, Hull said she has set up different saving pots on the banking app Monzo to help set aside money for different events. \"When the time comes for those things, hopefully it won't be as such a burden as my bank has technically already accounted for that spending,\" she explained. Away from Hodge Bank, other companies have noticed clients facing similar issues - even if they are very wealthy. Ollie Saiman, co-founder of wealth manager Six Degrees, deals with clients who have made \"more wealth than they could ever spend\" but still feel as financially insecure. \"We find it extremely common to encounter feelings of financial insecurity - and concerns that there isn't enough money to last,\" he told Money. \"When identifying 'how much is enough' for the families we look after, we find it crucial to recognise the right-brain and left-brain dynamics at play. \"The rational left brain might know that there's sufficient capital to last a lifetime - or several lifetimes - but the emotive right brain still worries about being able to make ends meet. This concern can make it difficult for them to spend their wealth, and only by understanding a client's personal background can we help them overcome these emotions,\" he explained. The reason people suffer from money dysmorphia is unclear, by Cook believes there are three main potential causes. Cost of living crisis The cost of living crisis is one of them, leading people to panic-save due to hearing about financial uncertainty. \"People may feel more in control if they put every single pound away in case of emergencies when they already have a savings account that could get them through any unexpected costs,\" she explained. Childhood financial environment \"Growing up around people, such as parents, who suffered financial hardship can shape attitudes into your adulthood,\" Cook said. \"It's important to recognise your own worth, and how your finances are different.\" Past financial trauma Cook said those who've had bad financial experiences, such as bankruptcy or fraud, can be left feeling more anxious about money. They can feel this way even if their financial situation is now stable and there's no immediate risk, she explained. With many still unfamiliar with the term, it can be hard to recognise those who are experiencing money dysmorphia. Cook pointed out some signs that people can look out for. \"The most obvious way to recognise if you suffer from money dysmorphia is by worrying about money too much when there is no immediate danger, such as losing assets or heading into bankruptcy,\" she said. \"If checking your bank balance causes you stress or panic, or you feel guilty about how much you earn or save, then this could be a trait.\" At the other end of the spectrum, she said people might be displaying self-sabotaging habits, such as offering to cover the costs for other people even if they can't afford to. \"Equally, if you avoid bank statements or dealing with financial issues, then you could be in denial about how much you're spending - ignorance isn't always bliss, especially if it means you're paying interest or late fees by ignoring these,\" she said. If these feelings sound familiar, she said it is worth researching the issue or speaking to a therapist. Cook also offered some tips on how to overcome it, such as:"
    },
    {
        "title": "Trump admits tariffs 'disturbance' as China says it is 'ready for any type of war' with US",
        "description": "Donald Trump has admitted his tariffs on major trading partners will cause \"a little disturbance\" - as China said it was \"ready\" for \"any type of war\" with the US.",
        "url": "https://news.sky.com/story/trump-admits-tariffs-disturbance-as-china-says-it-is-ready-for-any-type-of-war-with-us-13321754",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-xi-jinping-donald-trump_6846827.jpg?20250305103723",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-05 06:44:00",
        "Headline": "As the rhetoric ramps up from China - and Canada - and slides on stock markets, following the imposition of tariffs on the two countries and Mexico, the US commerce secretary says Donald Trump will \"probably\" announce a compromise.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Donald Trump has admitted his tariffs on major trading partners will cause \"a little disturbance\" - as China said it was \"ready\" for \"any type of war\" with the US. The US president made his comments in an address to Congress, hours after the levies on imports came into effect. Producers in Mexico and Canada have been hit with a 25% tax on items they export to the US, while a 20% tariff has been applied to Chinese imports. Money blog: Do you have money dysmorphia?Trump latest: 'America is back,' US president brags Stock markets, which Mr Trump is said to pay close attention to, slid on the tariffs news. Exporters in the affected countries as well as businesses in the US and economists have raised concerns about the potential price-raising impact of the tariffs. Making imports more expensive will likely make goods more expensive and could push prices up across the board.  Concern over threat to interest rates A cycle of high inflation could lead to interest rates being higher for longer in the US, the world's largest economy, which could dampen economic activity. A slowed US economy would have global consequences but even without a hit to the States, there are fears of a global trade war - in which countries add their own trade barriers in the form of tariffs. The Chinese embassy in the US posted on X: \"If war is what the US wants, be it a tariff war, a trade war or any other type of war, we're ready to fight till the end.\" China imposes retaliatory tariffs The president, however, said he was \"just getting started\" after 43 days into his second term. China and Canada have retaliated with their own tariffs against the US. From next week China will add its own 15% levy on a range of agricultural products such as chicken, wheat, corn and cotton. An extra 10% will be added to soya beans, pork, beef, fruit, vegetables and dairy products imports. The country has also raised additional complaints against the US with the World Trade Organisation (WTO). Read more:Beijing's patience is running thin'Dumb': Canadian PM criticises Trump over tariffsPolitical division in US has never looked like this Speaking to Sky News presenter Yalda Hakim the US former deputy national security advisor Matt Pottinger said Chinese president Xi Jinping was turning the Chinese economy \"into a wartime economy\" \"He's preparing his economy for war so that it can withstand the shocks of war,\" he said on The World with Richard Engel and Yalda Hakim podcast \"That means he's willing to undergo massive inefficiencies in the economy. He's willing to stockpile food that otherwise would flow easily and more cheaply in from foreign vessels.\" \"He's stockpiling copper and all kinds of inputs into the economy. He is making sure that the private sector is wholly aligned with his broad goals, which are about increasing the Chinese Communist Party's control over the economy and creating a bigger, better defence industrial base,\" Mr Pottinger said. \"He's preparing for war.\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Compromise 'as early as Wednesday'? Canada's prime minister Justin Trudeau said his country was launching its own WTO challenge and described the US tariffs as a \"dumb thing to do\". He also warned the move by the Trump administration would impact American workplaces and add to inflation in the US. Addressing the American public, he said: \"We don't want this... but your government has chosen to do this to you.\" Canada has announced the imposition of 25% tariffs on US imports worth C$30bn (£16.3bn). But US commerce secretary Howard Lutnick struck a different note on tariffs and on Monday said the president will \"probably\" announce a compromise with Canada and Mexico as early as Wednesday."
    },
    {
        "title": "China's patience with Donald Trump is running out - as trade war rhetoric ramps up",
        "description": "China's premier has warned \"changes unseen in a century are unfolding across the world\" as a trade war with the US intensifies.",
        "url": "https://news.sky.com/story/chinas-patience-with-donald-trump-is-running-out-as-trade-war-rhetoric-ramps-up-13321962",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-china-economy_6846959.jpg?20250305123540",
        "type": "Business",
        "Author": "Nicole Johnston",
        "Date Published": "2025-03-05 12:29:00",
        "Headline": "Even before the latest tit-for-tat tariffs broke out, China has been facing severe economic challenges at home - as consumers cautiously save money instead of spending it.",
        "Content": "\n          Asia correspondent\n              @nicole_reporter\n  China's premier has warned \"changes unseen in a century are unfolding across the world\" as a trade war with the US intensifies. Li Qiang was speaking in parliament - a day after Washington slapped another 10% tariff on Chinese goods. Beijing has responded with 10% to 15% tariffs on US food and agricultural products. \"Global economic growth lacks steam, unilateralism and protectionism are on the rise... the multilateral trading system is experiencing disruptions and tariff barriers continue to increase,\" Premier Li added.  The Chinese Embassy in the US has also dialled up the pressure, writing on X: \"If war is what the US wants, be it tariff war, a trade war or any other type of war, we're ready to fight till the end.\" This statement was first made by China's ministry of foreign affairs on Tuesday. The fact that China has repeated it two days in a row is significant. It is a pointed message to the US that China's patience is running out - and its rhetoric about the tit-for-tat tariffs is growing harsher. It has called the tariff war \"pressure\", \"blackmail\", a \"smear campaign\" and \"shifting the blame\". But Mr Trump loves imposing tariffs on China and appears convinced the pressure will work. He blames China for exporting the chemical precursors used to make fentanyl, which has fuelled the US opioid epidemic. Meanwhile, China is facing severe economic challenges at home, with the country setting a growth target of \"about 5%\" for this year. The government's work report said a major task this year is to boost consumption and domestic demand. Money blog: Dollar sinks and market gains wiped out  The problem in China is people aren't spending enough money, instead they are cautiously saving. One reason for this is the weakness of China's social welfare system. People save their money in case they lose their job, or to pay for health and elderly care. The government says it wants to make domestic demand the engine of growth by turning several cities into \"international consumption centres\" - and expanding its trade-in system to encourage people to buy new products for the home. Shopping aside, thousands of delegates from provinces across China attended including high-profile figures like former basketball star Yao Ming, and Lei Jun, who co-founded the electric vehicle manufacturing company Xiaomi. After the session, delegates streamed into the square outside the Great Hall of the People. It is a chance to get their thoughts on the country's future. Congress delegate Liu Hui said: \"I think tariffs will have little impact on China because we treat others the way they treat us.\" Another delegate from Shaanxi province, Song Yaping, is proud of China's hi-tech prowess and said: \"Our technology develops so fast, just look at DeepSeek, look at how fast our AI develops.\" Read more:How Trump's tariffs could cost consumers hereAnalysis: The US may now be in a recession  Despite the confidence, the trade war is deepening. In the factory heartland of Guangzhou in southern China, a glassware exporter is bracing for the impact of the latest Trump tariffs. Marketing manager Anna said: \"I think the people will discuss these tariffs and of course 10% is a huge number. Some companies can't make a profit from this. \"But we can't change it. We just have to get used to it and let it be.\" Still, letting it be is not easy in a world where it feels like everything is changing fast."
    },
    {
        "title": "Billions of pounds in spending cuts - including welfare - expected in spring statement",
        "description": "Several billion pounds in spending cuts - including from the welfare budget - are expected in the spring statement later this month.",
        "url": "https://news.sky.com/story/billions-of-pounds-in-spending-cuts-including-welfare-expected-in-spring-statement-13321764",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-rachel-reeves-media_6772166.jpg?20241210105047",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-05 07:12:00",
        "Headline": "Chancellor Rachel Reeves's self-imposed fiscal rules mean she cannot borrow for day-to-day spending - leaving cuts including welfare cuts as one of her only options.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Several billion pounds in spending cuts - including from the welfare budget - are expected in the spring statement later this month. The Treasury will put forward the proposed cuts to the Office of Budget Responsibility (OBR) on Wednesday, ahead of it providing a financial forecast on 26 March, alongside Chancellor Rachel Reeves announcing her spring statement. Sky's deputy political editor Sam Coates revealed on the Politics at Jack and Sam's podcast that welfare cuts are set to be part of the spring statement package to help the chancellor come within her borrowing limit. Politics latest: Ministers to make 'blizzard of announcements' Coates said there would be a \"four-point plan\" involving planning reform, Whitehall cuts, regulation cuts and welfare cuts. 👉Listen to Politics At Jack And Sam's on your podcast app👈 The Treasury believes Ms Reeves must maintain a £10bn headroom after months of economic downturn and geopolitical events since last October's budget. \n                  Starmer refuses to say if further tax rises will be imposed at spring statement\n                 \n                  Former Bank of England governor Lord King says income taxes must rise\n                 \n                  More pressure to raise taxes or cut spending - despite greatest budget surplus since records began\n                 Her self-imposed fiscal rules mean she cannot borrow for day-to-day spending, leaving spending cuts as one of her only options.  Poor economic climate forcing her hand Sir Keir Starmer said last week the government was in the \"early stages\" of looking at whether tax rises or spending cuts were needed to meet Labour's self-imposed fiscal rules. The prime minister refused to say whether further tax rises or spending cuts would be imposed. The OBR is required to produce two economic forecasts a year, but the chancellor said she would only give one budget a year to provide stability and certainty on upcoming tax changes. However, the poor economic climate since October is forcing her hand, with inflation hitting a 10-month high of 3% in January, a sharp rise in government bond yields and growth has not been as high as expected. Deputy political editor If you remember in October in the budget, Rachel Reeves set herself very tough limits on borrowing. She can't borrow for day-to-day spending from 2029. She's got to reduce the amount this government borrows.  But she also spent right up to the limit and borrowed right up to the limit, leaving herself historically low - what's known as headroom - just under £10bn. And since then, growth has been worse. Borrowing costs have been higher. All of which means that she's going to have to do more borrowing than she predicted in October.  But she's got almost no room before she breaches her fiscal rules.  The Treasury believes that the minimum headroom that they've got to have at the end of this process will still have to be £10 billion or so.  That's historically low as it is. You can not just allow that headroom to be eroded away by higher borrowing because of lower growth and high borrowing costs.  So in other words, for every billion of additional borrowing that the OBR thinks she's going to have to do, taking it closer or over her limit, she’s going to have to find spending cuts, possibly welfare cuts. It is not the case that she's got £10bn before there's a problem. She's got no billion pounds before she starts having to find public spending cuts. Because they don't want the headroom to get any smaller than it is at the moment. I have also noticed this over the last few weeks that Downing Street is fully invested in making Reeves look good at all points, whether it's on defence spending or if it's on the general government narrative.  Number 10 is absolutely doing everything it can to improve Reeves' standing because she's had a much rockier time than anyone expected.  The numbers are the numbers. She's good in the Commons chamber, but the fundamentals aren't great.  Number 10 is very invested in her because there cannot be any division between Starmer and Reeves. If something hurts Reeves, it just hurts Starmer as well because he's subcontracted so much to her. Read more:Everything you need to know about Starmer's Ukraine peace planJD Vance denies insulting British troops over 'random country' jibeBill to limit harms of smartphone use among children to be published British economy will be affected by US tariffs Donald Trump imposed tariffs on Canada, Mexico and China - the US's biggest trading partners - this week, prompting retaliation as stock markets fell sharply around the world. The UK has not been hit by tariffs yet, but the chancellor said the British economy will still be affected by the US president's trade war even if the UK strikes a deal with the White House. \"It's absolutely the case that even if tariffs aren't applied to the UK we will be affected by slowing global trade, by slower GDP growth and by higher inflation than otherwise would be the case,\" she told hundreds of top British manufacturers at a key industry conference on Tuesday."
    },
    {
        "title": "Starmer pays tribute to 'sacrifice' of UK armed forces after Vance's 'British troops' comments",
        "description": "Sir Keir Starmer has paid tribute to the \"sacrifice\" of the UK's armed forces after US vice president JD Vance was accused of \"disrespecting\" British troops.",
        "url": "https://news.sky.com/story/starmer-pays-tribute-to-sacrifice-of-uk-armed-forces-after-vances-british-troops-comments-13321986",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-starmer-ukraine-nato_6846967.jpg?20250305124004",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-05 13:07:00",
        "Headline": "At Prime Minister's Questions, Sir Keir Starmer made a pointed reference - without mentioning the US - to British troops killed in Afghanistan, after JD Vance was perceived as suggesting the UK had not fought a war in 30 years.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has paid tribute to the \"sacrifice\" of the UK's armed forces after US vice president JD Vance was accused of \"disrespecting\" British troops. Beginning Prime Minister's Questions on Wednesday, Sir Keir said Thursday will be 13 years since six young British soldiers died while on patrol in Afghanistan and 18 years since Royal Marine Benjamin Reddy was killed in Helmand province, Afghanistan. He said 642 people died in Afghanistan and Iraq \"fighting for Britain alongside our allies\", adding: \"We will never forget their bravery and their sacrifice.\" Politics latest: PM asked why he's cut aid instead of taxing the rich His pointed remarks - without mentioning the US directly - about the conflicts fought alongside the US following the 9/11 attack in 2001 came after Mr Vance was accused of \"disrespecting\" UK forces in Iraq and Afghanistan. Mr Vance told Fox News on Tuesday a potential peacekeeping force in Ukraine would be \"20,000 troops from some random country that hasn't fought a war in 30 or 40 years\". The UK and France are the only countries to have pledged troops to a potential peacekeeping force. \n                  'Misunderstanding' in arrest of British couple in Afghanistan, Taliban says\n                 \n                  British couple in their 70s detained by Taliban in Afghanistan\n                 \n                  Ex-police chief condemns investigation into alleged Afghanistan war crimes by UK Special Forces\n                 However, Mr Vance later said the suggestion he was referring to those two allies is \"absurdly dishonest\". 'Should have a lot more respect' Sir Keir's spokesman, asked if the PM was annoyed with Mr Vance's comments, said it was \"totally legitimate\" for him to pay tribute to soldiers ahead of the anniversary of their deaths. \"You can draw your own conclusions,\" he added. Liberal Democrat MP and former British Army officer Richard Foord was more direct in his criticism of Mr Vance, telling PMQs the grandfather of a soldier who lost his life while serving in Iraq said the vice president should \"have a lot more respect for those who lost their lives\". He asked if Sir Keir would remind the US how the UK was there for them following 9/11, to which Sir Keir said: \"We do remember the role that we've played historically with our allies, and we particularly remember those that made the ultimate sacrifice in that duty for their country and for our allies. \"And that's why it's so important that we make that point today.\" Sir Keir also said: \"We need to do everything we can to ensure that the US, Europe and Ukraine are working together on lasting peace. And I'm doing everything I can to play my part in that, in regular contact with all the key players at the moment, including talking to President Zelenskyy yesterday afternoon.\" Read more:Billions of pounds expected in spending cuts - including welfareTrump responds to Zelenskyy letter in marathon Congress speech  'In national interest to provide a security guarantee' Conservative leader Kemi Badenoch asked what Sir Keir is doing to persuade the US that it is in their national interest to provide a security guarantee for any peace deal between Ukraine and Russia. He replied: \"On Thursday of last week, we did discuss security guarantees, the president made absolutely clear his commitment to Article 5 of NATO. \"Absolutely clear he would have our backs.\" Article 5 states if a NATO member country is attacked, all other members will come to its aid, including the use of armed forced if necessary."
    },
    {
        "title": "The plan to save Rachel Reeves",
        "description": "<a href='https://podfollow.com/politics-at-jack-and-sams'>👉Listen to Politics At Jack And Sam's on your podcast app👈</a>       ",
        "url": "https://news.sky.com/story/the-plan-to-save-rachel-reeves-13321740",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-pjas-politics-at-jack-and-sams_6709400.png?20250127102956",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-05 06:00:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics At Jack And Sam's on your podcast app👈  Sky News' deputy political editor Sam Coates and Politico's Anne McElvoy have their guide to the day ahead in British politics.   The domestic agenda is key today with some hints starting to emerge about what Chancellor Rachel Reeves is planning in her Spring Statement in three weeks' time. Sam reveals details of a four-point plan to get big government announcements out there before the statement itself. Andrew Bailey, the governor of the Bank of England, may or may not help the chancellor's preparations when he appears before the Treasury select committee today. You can send us a WhatsApp on 07511 867 633 or email us: jackandsam@sky.uk"
    },
    {
        "title": "Scottish Tories propose lowering school leaving age from 16 to 14",
        "description": "The minimum age for leaving school in Scotland should be lowered from 16 to 14, according to plans being proposed by the Scottish Conservatives.",
        "url": "https://news.sky.com/story/scottish-tories-propose-lowering-school-leaving-age-from-16-to-14-13321827",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-children-schoolchildren_6846928.jpg?20250305120309",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-05 09:24:00",
        "Headline": "Party leader Russell Findlay says teenagers would be able to pursue a \"hybrid education\" by going on to college or taking up an apprenticeship but Education Secretary Jenny Gilruth describes the proposal - previously championed by the Scottish Conservatives in 2011 - as \"Dickensian\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The minimum age for leaving school in Scotland should be lowered from 16 to 14, according to plans being proposed by the Scottish Conservatives. Party leader Russell Findlay said the \"bold idea\" would allow teenagers to escape a \"system that isn't working for them\" and instead pursue a \"hybrid education\" by going on to college or taking up an apprenticeship. The MSP for West Scotland will use a speech during Apprenticeship Week on Wednesday to propose the policy. He said: \"My party is putting forward a common sense agenda for change. \"This is not about writing off these young people. It is the very opposite of that. \"It is about guiding each individual onto the path best suited to their aspirations. \"It is about giving young people an opportunity to continue in a form of hybrid education that is better suited to their talents. \n                  Bill to limit harms of smartphone use among children to be published\n                 \n                  Parents must not pay mandatory extra charges to access free childcare, government says\n                 \n                  I spent 20 years as a London teacher - if a child wants to bring a knife to school they will find a way\n                 \"Upon leaving school at 15, maybe even 14, they would still be required to stay in education. \"But it would be a form of education that works for them. A fast track to opportunity, whether college or an apprenticeship. \"By developing our proposal hand in hand with businesses, we could make Scotland's economy fit for the future.\" If implemented, the school leaving age of 14 would be one of the lowest in Europe. In response, Education Secretary Jenny Gilruth described the proposal - which was previously championed by the Scottish Tories in 2011 - as \"Dickensian\". 'Tory values rooted in the Victorian era' She added: \"The Tories should say what they mean - they want to see working class children leave school at 14 and leave academic pursuits to the middle and upper class. That is not an approach this government will agree with. \"We will continue to take action to ensure every child in Scotland no matter their background has the opportunity to succeed in whatever path they choose. \"The last time the school leaving age was changed to 14 was over a century ago. \"Tory values may be rooted in the Victorian era - but we will not allow them to drag our education system into a bygone age with this Dickensian policy. \"As ever, what is common sense to the Tories makes no sense to anyone else.\" Read more from Sky News:PhD student guilty of drugging and raping 10 womenBillions of pounds in spending cuts expected in spring statementJD Vance denies insulting British troops over 'random country' jibe Calls to give 'equal weight' to apprenticeships The Scottish Tories' proposal comes amid a call by Skills Development Scotland (SDS) to set aside time in class for pupils to learn about apprenticeships to improve minority ethnic participation. The skills body has made 20 recommendations to the Scottish government and employers in a report published to coincide with Apprenticeship Week. According to the latest data, 4.5% of those starting apprenticeships in 2023/24 reported being from an ethnic minority, while the proportion in the population sits at 7.1%, according to the 2022 census results. Recommendations to Holyrood include ensuring schools give \"equal weighting\" to apprenticeships as positive destinations, while recommendations to employers include implementing anti-racism frameworks, paying the Living Wage and signing up to Fair Work practices. Recommendations to be 'considered' Schools are also being urged to ensure dedicated time is allocated in the curriculum for learning about apprenticeship opportunities, as well as provide support with the application process. A Scottish government spokesperson said it \"recognises the importance of improving ethnic minority representation in apprenticeships, which is why ministers welcome the report and the detailed recommendations made by the Race Commission\". \"We will now consider how these recommendations can be embedded in the skills system as we take forward our reform work,\" they added."
    },
    {
        "title": "'Eureka moment' as scientists discover how aspirin could stop some cancers spreading",
        "description": "Scientists have discovered how aspirin may stop some cancers from spreading, describing it as a \"Eureka moment\".",
        "url": "https://news.sky.com/story/eureka-moment-as-scientists-discover-how-aspirin-could-stop-some-cancers-spreading-13322196",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-aspirin-bayer-tablet_6269943.jpg?20230901074654",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-05 17:40:00",
        "Headline": "The new research suggests a path for aspirin to become a cancer treatment - but people are being warned not to start taking it daily without speaking to a doctor. ",
        "Content": "Scientists have discovered how aspirin may stop some cancers from spreading, describing it as a \"Eureka moment\". The new research builds on existing evidence suggesting aspirin supports a boost in the immune system to help catch deadly cancer cells. Clinical trials in cancer patients, examining how aspirin could stop the disease coming back, are ongoing - but experts warn against routinely taking aspirin without speaking to a doctor. The new research suggests a path for aspirin to become a cancer treatment, alongside the development of more effective drugs to prevent cancer spreading. Researchers screened 810 genes in mice and found 15 that impact the spread of cancer. Mice lacking a gene which produces a certain protein, called ARHGEF1, were less likely to have cancer spread to the lungs and liver, the study found. Scientists found that ARHGEF1 suppresses a type of immune cell called a T cell, which is important for recognising and killing metastatic (spreading to other parts of the body) cancer cells. \n                  Tattoos may be linked to increased risk of cancer, study suggests\n                 \n                  Breast cancer cases and deaths set to surge, study suggests\n                 \n                  'Life-saving' simple blood test could transform and personalise cancer care if trial succeeds\n                 They unexpectedly discovered the ARHGEF1 is switched on when T cells are exposed to a particular clotting factor, a protein that prevents excessive bleeding. The clotting factor, called thromboxane A2 (TXA2), is made by platelets in the blood - and aspirin is already known to cut its production. By decreasing TXA2 production, aspirin can prevent certain cancers from spreading, researchers found. In mice given aspirin, the frequency of metastases - the spread of cancer - was reduced compared with ones not on the drug, the research, published in the Nature journal and funded by the Medical Research Council and Wellcome Trust, found. Read more from Sky News:Tattoos may be linked to cancer risk levels - studyCancer death rates '60% higher' in deprived areas Dr Jie Yang, from the team which led the study at the University of Cambridge, described the discovery about TXA2 as a \"Eureka moment\". \"It was an entirely unexpected finding which sent us down quite a different path of inquiry than we had anticipated,\" Dr Yang said. \"Aspirin, or other drugs that could target this pathway, have the potential to be less expensive than antibody-based therapies, and therefore more accessible globally. Researchers are now working with Professor Ruth Langley at University College London, who is leading a study into whether aspirin can stop or delay early stage cancers from returning. Prof Langley said: \"This is an important discovery. It will enable us to interpret the results of ongoing clinical trials and work out who is most likely to benefit from aspirin after a cancer diagnosis.\" However, she warned: \"In a small proportion of people, aspirin can cause serious side-effects, including bleeding or stomach ulcers. \"Therefore, it is important to understand which people with cancer are likely to benefit, and always talk to your doctor before starting aspirin.\""
    },
    {
        "title": "Men with healthier sperm live longer, study suggests",
        "description": "Men with higher quality sperm live two to three years longer, according to a new study.",
        "url": "https://news.sky.com/story/men-with-healthier-sperm-live-longer-study-suggests-13321862",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sperm-fertility_6846809.jpg?20250305101325",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-05 10:05:00",
        "Headline": "The men had their semen tested due to reported couple infertility, and the study found those with a higher total motile count (or sperm that can move or swim) were expected to live longer.",
        "Content": "Men with higher quality sperm live two to three years longer, according to a new study. The study, published in the journal Human Reproduction, analysed data from 78,284 men in Denmark between 1965 and 2015. The men had their semen tested due to reported couple infertility. It was found that those with a higher total motile count (TMC) - or sperm that can move or swim - were expected to live longer. The findings mean testing semen could be used to predict and prevent future health problems, researchers say. Dr Larke Priskorn, a senior researcher in the department of growth and reproduction at Copenhagen University Hospital, said previous research had suggested male infertility and lower semen quality could be associated with mortality - this test was to try this hypothesis. \"We calculated the men's life expectancy according to their semen quality and found that men with the best quality could expect to live two to three years longer, on average, than men with the lowest semen quality.\" Men with a TMC of more than 120 million - which is considered healthy - lived 2.7 years longer than men with a TMC of between zero and five million. \n                  'Eureka moment' as scientists discover how aspirin could stop some cancers spreading\n                 \n                  Boots recall mislabelled packs of paracetamol - as customers urged to 'immediately' stop using tablet\n                 \n                  New 'superior' treatment discovered for people with severe food allergies\n                 \"The lower the semen quality, the lower the life expectancy,\" Dr Priskorn added. \"This association was not explained by any diseases in the ten years before semen quality assessment or the men's educational level.\" Read more from Sky News:Fact-checking Donald TrumpBillions in spending cuts expectedEmma Raducanu speaks on stalker Dr Niels Jorgensen, the chief andrologist at Copenhagen University Hospital, has cautioned that more needs to be done to understand this association. \"However, this study suggests that we can identify subgroups of men with impaired semen quality who are apparently healthy when their semen quality is assessed, but who are at increased risk of developing certain diseases later in life\". \"Fertility evaluations, which are typically conducted when the men are relatively young, would serve as an opportunity for detecting and mitigating the risks of other health problems in the longer term,\" he said. During the follow-up period, 8,600 men died, the equivalent of 11% of the total group. The study did not look at whether poor semen quality was associated with earlier deaths from particular causes, such as cancer or heart disease - this is something Dr Jorgensen said would be studied in the future."
    },
    {
        "title": "Cyclone Alfred: What we know about rare storm nearing Australian coast",
        "description": "Australians are preparing for a \"very rare\" cyclone to sweep across the east coast near Brisbane, the country's third most populated city.",
        "url": "https://news.sky.com/story/cyclone-alfred-what-we-know-about-rare-storm-nearing-australian-coast-13321839",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-cyclone-alfred-australia_6846892.jpg?20250305113457",
        "type": "Technology",
        "Author": "Jake Levison",
        "Date Published": "2025-03-05 09:37:00",
        "Headline": "Millions of residents have been warned about the risk of life-threatening flooding and dangerous gusts of wind. But what is a cyclone, what kind of threat does it pose and what is being done about it?",
        "Content": "\n          News reporter\n       Australians are preparing for a \"very rare\" cyclone to sweep across the east coast near Brisbane, the country's third most populated city. Residents are being told to brace themselves for the \"significant risks\" Cyclone Alfred poses, which will be the first to hit Southeast Queensland and northern New South Wales for 51 years. But what is a cyclone, what kind of threat does it pose and what is being done about it? What is a cyclone? A tropical cyclone is a rapidly rotating storm that begins over tropical oceans, which can vary in speed, size, and intensity. A storm begins being referred to as a cyclone once it reaches maximum sustained winds of 74mph or higher. A cyclone is the same phenomenon as a typhoon or hurricane, but they are referred to differently depending on where they occur. \n                  Blood donor who saved the lives of 2.4 million babies dies\n                 \n                  Man rowing solo across Pacific rescued from cyclone days out from completing feat\n                 \n                  Australian radio DJ Marty Sheargold taken off air after 'disgusting' comments about women's football\n                 The term cyclone is used when the storms occur in the South Pacific and Indian Ocean. They are referred to as typhoons when they appear in the Northwest Pacific and as a hurricane when they appear in the North Atlantic, central North Pacific and eastern North Pacific. What kind of threat is Cyclone Alfred? The cyclone was over the Pacific Ocean 250 miles east of Brisbane and tracking west on Wednesday, with sustained winds near the centre of 59mph and gusts up to 81mph. It is expected to cross the coast between the Queensland state capital Brisbane and the tourist city of Gold Coast to the south late on Thursday or early Friday. Meteorologists have warned that destructive wind gusts of up to 96mph could develop from Thursday afternoon and tropical cyclone Alfred is expected to land as a rare category-two storm early on Friday morning near Brisbane, Queensland's capital. Total rainfall could be as much as 80cm (31.5ins) in some regions - more than the average total for March, Australia's Bureau of Meteorology said. It has warned life-threatening flooding is expected as a consequence. \"Large swells and powerful waves have been observed along the Queensland coast for several days now with severe coastal erosion and inundation happening,\" Bureau of Meteorology manager Matt Collopy says. \"This will continue and likely get worse as the system approaches and makes landfall. \"The wave, wind, rainfall and particularly the storm surge present significant risks.\" What is being done about it? Cyclone Alfred weather warnings stretch cover more than 500km (311 miles) across the coast in the states of Queensland and New South Wales, impacting millions of people. Australian Prime Minister Anthony Albanese has stressed the importance of preparatory work ahead of the cyclone's arrival. He said heavy-lift helicopters have been deployed and offered to \"provide whatever resources are required\" for the state governments. The federal government says it is providing the Queensland government with 250,000 sandbags in addition to 80,000 the military has already delivered, and some residents have been seen stacking them to protect low-lying properties. Authorities have urged residents in flood-prone suburbs to evacuate by Thursday morning at the latest, with some already reported to have done so. Some schools in affected areas had already closed on Wednesday, with more to shut on Thursday. On Thursday and Friday, all schools in affected areas will be closed, hospitals will not carry out non-urgent surgeries and public transport will not run, Queensland Premier David Crisafulli said. Read more:Vast 'megaberg' the size of Gloucestershire runs agroundAustralian man whose blood saved 2.4 million babies dies Speaking on Wednesday, Mr Crisafulli said boats moored in the region would not be allowed to move without the permission of the Brisbane harbour master from Wednesday afternoon due to the cyclone danger. \"This is a very rare event for southeast Queensland, I acknowledge that, but I'm asking Queenslanders to take it seriously and I want you to know that we are taking it seriously,\" he said. \"If you are in a storm tide zone or you're in an area where you know there is riverine flooding, you really need to consider and think about your evacuation plan now,\" he added. A number of flights in the affected regions have been cancelled, and operators have warned more are likely over the coming days. Sports events have also been called off - most notably the Australian WPGA Championship and two Australian Football League matches in Queensland. On Monday, an adventurer had to be rescued by a warship in the Coral Sea around 460 miles east of the Queensland coast after getting caught up in the cyclone's 50mph winds.  Lithuanian rower Aurimas Mockus, 44, was in the final stages of his 7,500-mile voyage across the Pacific Ocean from the US to Australia, which he started in an enclosed boat in October, when he became stranded for three days before being rescued. A brief history of cyclones Cyclones are common in Queensland's tropical north but are rare in the state's temperate and densely populated southeast corner that borders New South Wales state. The last cyclone to hit Southeast Queensland and northern New South Wales was Cyclone Zoe in March 1974. It crossed the coast at the southern end of the Gold Coast on the New South Wales border and caused extensive flooding. The last time a cyclone threatened Brisbane was in 1990, but the system tracked south just before reaching the city. More than 1,900 disasters have been attributed to tropical cyclones worldwide since 1970, according to the World Meteorological Organisation, resulting in more than 790,000 deaths and $1.4trn-worth of damages."
    },
    {
        "title": "Sabrina Carpenter and Charli XCX BRIT Awards appearances spark hundreds of Ofcom complaints",
        "description": "Ofcom received 825 complaints over the Brit Awards, with the majority relating to Sabrina Carpenter's raunchy performance and Charli XCX's outfit, the media watchdog says.",
        "url": "https://news.sky.com/story/sabrina-carpenter-and-charli-xcx-brit-awards-appearances-spark-hundreds-of-ofcom-complaints-13322113",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sabrina-carpenter-brit-awards_6843775.jpg?20250301215926",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-05 15:59:00",
        "Headline": "US pop star Carpenter sported a short, red sparkly military-style blazer dress for a raunchy mash-up of her hit Espresso and Rule Britannia, before changing into a bra and shorts for her next track.",
        "Content": "Ofcom received 825 complaints over the Brit Awards, with the majority relating to Sabrina Carpenter's raunchy performance and Charli XCX's outfit, the media watchdog says. US pop star Carpenter, 25, sported a red sparkly military-style blazer dress for her performance at the awards show on Saturday night, paired with stockings and suspenders for a rendition of Espresso. The song was mixed with a Rule Britannia mash-up, as dancers in military parade dress followed her. She then switched to a red sparkly bra and shorts for her next song, Bad Chem, which she performed alongside dancers in bras and shorts while sitting suggestively on a large bed. Carpenter later received the global success award at the ceremony, and was also nominated in the international artist and international song of the year categories. But much of the buzz on social media surrounded her performance, which took place before the 9pm watershed.  Ofcom said some of the complaints were also aimed at British pop sensation Charli XCX, who dominated the night by winning five awards, including album of the year. \n                  BRITs 2025: Charli XCX makes it a Brat BRITs, winning five awards including album of the year\n                 \n                  Brit Awards moments: Sabrina Carpenter rules Britannia, and a tribute to Liam Payne\n                 \n                  BRIT Awards 2025 fashion: The best of the red carpet looks\n                 Some viewers took issue with her outfit - a black see-through dress. Read more:Explore other celebrity looks at the BRIT AwardsWhy is Noel Clarke suing The Guardian? The singer addressed the concerns during her acceptance speech for artist of the year, saying: \"I heard that ITV were complaining about my nipples. I feel like we're in the era of 'free the nipple' though, right?\" Carpenter paid tribute to the UK in her acceptance speech, saying: \"The Brits have given me this award, and this feels like such an insane honour in a very primarily tea-drinking country... you really understood my dry sense of humour because your sense of humour is so, so dry. So I love y'all more than you even understand.\""
    },
    {
        "title": "Sky News wins best News Channel at Royal Television Society awards - as Sophy Ridge named Presenter of the Year",
        "description": "Sky News has won News Channel of the Year and Sophy Ridge has been named Presenter of the Year at the Royal Television Society (RTS) Awards.",
        "url": "https://news.sky.com/story/sky-news-wins-news-channel-of-the-year-for-eighth-year-in-a-row-at-rts-journalism-awards-13322406",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rts-sophy-ridge-rts-awards_6847608.jpg?20250305235912",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-05 22:37:00",
        "Headline": "RTS judges praised the \"excellent journalism, high production values, and clear analysis\", adding that Sky News was \"hard to beat\" in the news channel category.",
        "Content": " Sky News has won News Channel of the Year and Sophy Ridge has been named Presenter of the Year at the Royal Television Society (RTS) Awards. Speaking about the News Channel of the Year award - which Sky News has won for the eighth year in a row - Jonathan Levy, Managing Director and Executive Editor of Sky News UK, said: \"The recognition of this award is particularly encouraging in such a big news year - a general election and a summer of discontent here at home, the re-election of Donald Trump and the wars in Ukraine and the Middle East abroad. \"As news organisations we choose where, and frankly where not to point our cameras, and last year at Sky News we chose to point them often at the devastating conflict in Sudan. \"It's heartening to see that journalism and that story getting some recognition.\" RTS judges praised the \"excellent journalism, high production values, and clear analysis\", adding that Sky News was \"hard to beat\" in the category. \"It [Sky News] had strong eye-witness coverage from around the world, and also produced highly watchable reporting on many UK stories,\" judges said. Africa correspondent Yousra Elbagir has repeatedly reported from the front lines of Sudan's civil war, while other notable international coverage has included chief correspondent Stuart Ramsay on the conflict in Myanmar and an exclusive with President Zelenskyy. In addition, Sophy Ridge, Sky News' lead political presenter who hosts a weeknight show from 7-8pm, won Network Presenter of the Year. She said: \"I feel very proud to work at Sky News. I feel very proud of the journalism we do at Sky News but for me the best thing about TV journalism is that we work as part of a team. \"At the moment journalism feels like it's under attack, the truth sometimes feels like it's under attack as well. What I keep in mind is that people have the perception that presenting is about talking, when it's about listening. Listening to our viewers, our audience... and all the people that we interview.\" RTS judges said: \"In a very strong field, this presenter stood out... combining disarming toughness with huge likeability. Moving effortlessly from politics to breaking news, she's in control, genuinely insightful and never domineering.\" In 2024, Sky News reported on stories such as the UK's general election - with highlights including Beth Rigby's questioning of Rishi Sunak and Sir Keir Starmer in Grimsby. The World With Yalda Hakim featured interviews including several exclusives with the Qatari prime minister, a key mediator in Gaza ceasefire talks."
    },
    {
        "title": "Liam Payne's girlfriend Kate Cassidy says she is 'still working on accepting' his death",
        "description": "Liam Payne's girlfriend Kate Cassidy has opened up about the singer's death, saying she is \"still working on accepting the fact that he's not here anymore\".",
        "url": "https://news.sky.com/story/liam-paynes-girlfriend-kate-cassidy-says-she-is-still-working-on-accepting-his-death-13321867",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-cassidy-liam_6725512.jpg?20241023171032",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-05 10:08:00",
        "Headline": "The American social media influencer, who began dating Payne in 2022, said she believed the late pop star had \"guided\" her towards mental health campaigning.",
        "Content": "Liam Payne's girlfriend Kate Cassidy has opened up about the singer's death, saying she is \"still working on accepting the fact that he's not here anymore\". The singer, 31, died in October last year after falling from a hotel balcony in Argentina. Cassidy was with Payne in Buenos Aires but flew to the US days before the British pop star star died. In an emotional interview with ITV presenter Lorraine Kelly, she said: \"It's hard for me to refer to him in the past tense, and when I do refer to him in the past tense it almost stings that little bit more because… it just … it's more official.\" Cassidy, 25, said she has her \"harder days\" and has sometimes struggled \"to get out of bed in the morning\", but added: \"I'm surrounded by such a great support system that I cannot thank enough.\" She praised Kelly and ITV for launching a new mental health initiative, which she is helping to promote, and said: \"I genuinely believe Liam, in a way, guided me to this campaign and wanted me to be involved in this, and to help other people.\" Cassidy, an American social media influencer, said that he \"was so open about his mental health\" and she is supporting the push as \"he no longer can help people\". \n                  Liam Payne's family criticise media for causing 'indescribable damage'\n                 \n                  Brit Awards moments: Sabrina Carpenter rules Britannia, and a tribute to Liam Payne\n                 \n                  Liam Payne death charges against friend and two hotel workers dropped in Argentina\n                 She added: \"I'm going through this healing journey, sometimes it's hard for me to get out of bed in the morning and something I don't want to do. \"But I have this responsibility and this obligation that I am almost in a way... I have no choice. I have to get out of bed [for my dog] Nala and whether it's a five-minute walk or 20-minute walk first thing in the morning. \"Either way, it just wakes me up and refreshes my mind instead of laying in bed all day just scrolling through social media or old photos, it gets me out of bed and really, really helps my mindset and my mental health.\" Cassidy, who began dating Payne in 2022, previously said he was \"the most humble, charming, normal person you could ever hope to come across, and genuinely one of the best people I've ever met in my life\". Court documents state that former One Direction star Payne fell from the balcony of his room on the third floor of the Casa Sur Hotel in Buenos Aires at about 5.10pm on 16 October. Read more:Payne's family criticise media for causing 'indescribable damage'Jay-Z sues woman who accused him of rape Toxicology tests revealed that before his death, he had traces of alcohol, cocaine, and a prescription antidepressant in his body. His cause of death was \"polytrauma\" from multiple injuries and internal and external bleeding, a postmortem found. Last month, manslaughter charges against Payne's friend Rogelio \"Roger\" Nores, hotel operator Gilda Martin, and head of reception Esteban Grassi were dropped following an appeal. Hotel employee Ezequiel Pereyra and waiter Braian Paiz are still facing prosecution for allegedly supplying Payne with drugs, having been charged in December. Supplying drugs in Argentina carries a sentence of up to 15 years in prison. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Adidas sells final pair of Yeezy trainers - years after cutting ties with Kanye West",
        "description": "Adidas has sold the last remaining pair of Yeezy trainers - more than two years after cutting ties with Kanye West.",
        "url": "https://news.sky.com/story/adidas-sells-final-pair-of-yeezy-trainers-years-after-cutting-ties-with-kanye-west-13321871",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kanye-west-bianca-censori_6825747.jpg?20250211160033",
        "type": "Entertainment",
        "Author": "Connor Sephton",
        "Date Published": "2025-03-05 10:00:00",
        "Headline": "Ending the partnership continues to have a financial impact on Adidas - with sales in North America dropping by 2% last year.",
        "Content": "\n          News reporter\n              @ConnorSephton\n Adidas has sold the last remaining pair of Yeezy trainers - more than two years after cutting ties with Kanye West. The sportswear giant distanced itself from the US rapper after he made a slew of antisemitic comments in 2022. But this left the company with a mountain of stock, and millions of Yeezy shoes with an estimated retail value of £1bn left sitting in warehouses.   Ending the partnership also contributed to Adidas posting its first annual loss for more than three decades. Back in 2023, the German brand had confirmed plans to start selling Yeezy merchandise - donating some of the proceeds to charity. \n                  Scarlett Johansson responds after her likeness is used in AI video of celebrities condemning Kanye West's antisemitism\n                 \n                  Kanye West's Yeezy online shopping platform taken down over swastika T-shirts\n                 \n                  Kanye West criticised over Super Bowl ad for website selling swastika T-shirt\n                 It made an operating profit of £250m from the stock that year, and a further £167m in 2024. Contributions were made to organisations including the Anti-Defamation League and Robert Kraft's Foundation to Combat Antisemitism. Defending the decision to sell the stock, Adidas chief executive Bjørn Gulden had said: \"This is much better than destroying and writing off the inventory.\" The partnership with West, also known as Ye, had been hugely lucrative for the brand and continues to have an impact on its bottom line. Announcing its annual financial results on Wednesday, Adidas said North America revenues in 2024 had fallen by 2% - and this was \"solely due to significantly lower Yeezy sales\". Looking ahead, the company warned that earnings for 2025 are also forecast to be lower than expected. Operating profits for last year stood at £1.12bn. Adidas is looking for new growth opportunities beyond its retro trainers, which include the Samba and Gazelle collections. And while Nike is the market leader in the US, the company says it has a \"clear ambition\" of being the top sportswear brand across all other markets.  Last month, West's Yeezy online shopping platform was taken down after it began selling T-shirts adorned with swastikas. The Nazi symbol is an image often used by the far right, and the rapper was criticised for promoting these clothes in a TV advert during the Super Bowl. West recently deleted his X account after making a series of offensive and \"hate-filled\" posts. As well as saying \"I love Hitler\" and \"I'm a Nazi\", the 47-year-old had declared: \"I'm never apologising for my Jewish comments.\" All legal proceedings between Kanye West and Adidas ended last October, when both parties reached an out-of-court settlement."
    },
    {
        "title": "Why is Noel Clarke suing The Guardian?",
        "description": "Actor Noel Clarke begins his High Court libel case against The Guardian's publisher today.",
        "url": "https://news.sky.com/story/why-is-noel-clarke-suing-the-guardian-13321785",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-noel-clarke-guardian_6336373.jpg?20231026134129",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-05 07:49:00",
        "Headline": "Noel Clarke, 49, known for his roles in the Kidulthood trilogy, Bulletproof, and Doctor Who, is suing Guardian News and Media (GNM) over a series of articles it published about him in April 2021. He \"vehemently\" denies \"any... wrongdoing\".",
        "Content": "Actor Noel Clarke begins his High Court libel case against The Guardian's publisher today. Clarke, 49, is suing Guardian News and Media (GNM) over a series of articles it published about him in April 2021. They were based on the claims of 20 women Clarke knew \"in a professional capacity\" who allege his behaviour towards them amounted to sexual misconduct. Clarke, known for his roles in the Kidulthood trilogy and Doctor Who, \"vehemently\" denies \"any sexual misconduct or wrongdoing\". What will the trial cover? Clarke is suing GNM for libel, sometimes also referred to as defamation. It's a civil tort - not a criminal offence - defined as false written statements that have damaged the person's reputation. This means Clarke can seek redress or damages but no one will face charges or prison. Clarke claims the articles The Guardian published in 2021 altered public opinion of him, damaged his reputation, and lost him work. He said after the allegations emerged: \"In a 20-year career, I have put inclusivity and diversity at the forefront of my work and never had a complaint made against me. \"If anyone who has worked with me has ever felt uncomfortable or disrespected, I sincerely apologise. I vehemently deny any sexual misconduct or wrongdoing and intend to defend myself against these false allegations.\" The Guardian is defending the claim on the basis of truth and public interest. Read more from Sky NewsJay Z sues woman who accused him of rapeBBC apologises over Gaza documentaryWhat we learnt from Meghan's new Netflix show It said in its statement: \"Our reporting on Noel Clarke in 2021 was based on the accounts of 20 brave women. After we published our first article, more women came forward. \"At trial, 32 witnesses are set to testify against Mr Clarke under oath. We look forward to a judge hearing the evidence.\" The trial will only focus on liability - not the amount of damages to be paid if Clarke is successful. The actor tried and failed to get the case struck out in January, with his legal team saying it had \"overwhelming evidence\" of \"perversion of the course of justice\". His lawyers told the High Court three of the journalists involved in the articles had \"deliberately and permanently\" deleted messages, which meant he could not get a fair trial. Lawyers for GNM told the court there was \"no adequate evidential basis\" for Clarke's application for a strike out and said it sought \"to smear Guardian journalists and editors without any proper justification\". The trial, which will be presided over by judge Mrs Justice Steyn, is expected to last between four and six weeks. What has happened since the articles were published?  A month before the articles about him were published in April 2021, Clarke received BAFTA's outstanding contribution to British cinema award. However, once the allegations against him emerged, he was suspended by the organisation and the prize rescinded. His management and production company 42M&P told Sky News they were no longer representing him and Sky cancelled its TV show Bulletproof, starring Clarke and Top Boy actor Ashley Walters as the lead roles. ITV also decided to pull the finale of another of his dramas, Viewpoint, following the Guardian articles. The Met Police looked into the allegations against Clarke for any potential criminal wrongdoing, but in March 2022 announced they \"did not meet the threshold for criminal investigation\". Clarke filed the libel claim the following month and has attended several of the preliminary hearings in person. He says he has faced a \"trial by media\" - and that the ordeal has left him suicidal and in need of professional help. 'Rising star'  Clarke made his TV debut in a revived version of Auf Wiedersehen Pet in 2002. Soon after he played Mickey Smith in Doctor Who and Kwame in the six-part Channel 4 series Metrosexuality. He wrote and starred in the film trilogy Kidulthood, Adulthood, and Brotherhood, which were based in west London, where he grew up, and explored the lives of a group of teenagers given time off school after a bullied classmate takes their own life. It was a box office success and eventually saw Clarke given BAFTA's rising star prize in 2009. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    }
]