[
    {
        "title": "Death cap mushroom killer Erin Patterson jailed for minimum of 33 years",
        "description": "An Australian mother who murdered her estranged husband's parents and aunt by feeding them a beef wellington laced with poisonous mushrooms has been jailed for life with a minimum of 33 years.",
        "url": "https://news.sky.com/story/death-cap-mushroom-killer-erin-patterson-jailed-for-minimum-of-33-years-13418079",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mushroom-poisoner-erin-patterson_7000697.jpg?20250825072157",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-07 23:00:00",
        "Headline": "Erin Patterson, 50, lured her former parents-in-law Don and Gail Patterson, both 70, Gail Patterson's sister, Heather Wilkinson, 66, and her husband Reverend Ian Wilkinson to lunch at her home in Leongatha, Victoria, on 29 July 2023.",
        "Content": "An Australian mother who murdered her estranged husband's parents and aunt by feeding them a beef wellington laced with poisonous mushrooms has been jailed for life with a minimum of 33 years. Erin Patterson, 50, lured her former parents-in-law Don and Gail Patterson, both 70, and Gail Patterson's sister, Heather Wilkinson, 66, to lunch at her home in Leongatha, Victoria, on 29 July 2023. Mrs Wilkinson's husband, Reverend Ian Wilkinson, also ate the meal, which was served alongside mashed potatoes and green beans, but survived after receiving a liver transplant and spending months in hospital. Patterson, a mother-of-two, had made the pastry dish with deadly death cap mushrooms, also known as amanita phalloides. At the sentencing hearing at the Supreme Court of Victoria in Melbourne, Justice Christopher Beale said the substantial planning of the murders and Patterson's lack of remorse meant her sentence should be lengthy. \"The devastating impact of your crimes is not limited to your direct victims. Your crimes have harmed a great many people,\" he said. \"Not only did you cut short three lives and cause lasting damage to Ian Wilkinson's health, thereby devastating theextended Patterson and Wilkinson families, you inflicted untold suffering on your own children, whom you robbed of their beloved grandparents.\" Patterson's trial in Morwell, southern Australia, heard that she fabricated a cancer diagnosis to use as an excuse not to invite her children, pretending to want to discuss how to break the news to them after the meal. The four guests fell ill immediately after eating her food. Mrs Wilkinson and Mrs Patterson died on 4 August, and Mr Patterson a day later. Reverend Wilkinson spent seven weeks in hospital but survived. Read moreMore details of mushroom case revealed In his victim impact statement, he said the poisoned food meant he had to have a liver transplant and was left feeling \"half alive\". Patterson, who maintains her innocence and that she poisoned her victims by accident, also invited the father of her children, Simon Patterson, to the fatal meal. He declined the invitation. In his victim impact statement, Mr Patterson said of the couple's children: \"The grim reality is they live in an irreparably broken home with only a solo parent, when almost everyone else knows their mother murdered their grandparents.\" In July, Patterson was found guilty of murdering Don and Gail Patterson, and Heather Wilkinson, and attempting to murder Ian Wilkinson. The death cap is one of the most toxic mushrooms on the planet and is involved in the majority of fatal mushroom poisonings worldwide.  The species contains three main groups of toxins: amatoxins, phallotoxins, and virotoxins.  From these, amatoxins are primarily responsible for the toxic effects in humans.  The alpha-amanitin amatoxin has been found to cause protein deficit and ultimately cell death, although other mechanisms are thought to be involved.  The liver is the main organ that fails due to the poison, but other organs are also affected, most notably the kidneys.  The effects usually begin after a short latent period and can include gastrointestinal disorders followed by jaundice, seizures, coma, and eventually, death.  Previous poisoning attempts left husband ill Following the guilty verdicts, more details of the case were revealed. Mr Patterson said he had rejected the lunch invite \"out of fear\" as he believed his former partner had tried to poison him three times before. After they separated in 2015, he stopped eating any food she had prepared, having become seriously ill after meals cooked by her. Reverend Wilkinson also revealed he and the other three guests were served their food on large grey dinner plates, while Patterson served her portion on a smaller, tan-coloured plate. The nine-week trial attracted intense interest in Australia - with podcasters, journalists and documentary-makers descending on the town of Morwell, around two hours east of Melbourne, where the court hearings took place."
    },
    {
        "title": "Russia lands symbolic blow as largest aerial attack on Ukraine's capital shows Moscow's strategy",
        "description": "The smoke spiralling above Kyiv's Cabinet of Ministers building was a stark reminder of the brutal calculus underpinning Russia's war in Ukraine.",
        "url": "https://news.sky.com/story/russia-lands-symbolic-blow-as-largest-aerial-attack-on-ukraines-capital-shows-moscows-strategy-13426788",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kyiv-ukraine_7013234.jpg?20250907152731",
        "type": "Home",
        "Author": "Alex Rossi",
        "Date Published": "2025-09-07 18:15:00",
        "Headline": "Missiles, along with more than 800 drones and decoys, were launched overnight, illustrating that might, rather than negotiation, is still the main thrust of Vladimir Putin's approach.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  The smoke spiralling above Kyiv's Cabinet of Ministers building was a stark reminder of the brutal calculus underpinning Russia's war in Ukraine. For all the talk of diplomacy - including US President Donald Trump's faltering mediation efforts - Moscow's assault underscores a strategy focused on overwhelming force rather than negotiation. Ukrainian authorities report that this was the largest aerial attack on the capital since the full-scale invasion began, with more than 800 drones and decoys launched alongside missiles. The scale of the barrage suggests a deliberate Russian strategy; launching larger salvos to achieve critical mass, overwhelming Ukraine's air defences and striking deep into the heart of the government district. For the first time, a symbolic target, the building that houses the Cabinet of Ministers, has been hit, sending a clear message of intimidation. The human toll was immediate. Residents described being jolted awake by thunderous explosions. Firefighters and rescue workers navigated choking plumes of smoke to extract survivors, while outside, families clung to each other amid the devastation. \n                  Death cap mushroom killer Erin Patterson jailed for minimum of 33 years\n                 \n                  Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack\n                 \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 Western officials warn that Moscow's campaign continues to target civilian areas, a pattern that has defined its broader offensive since February 2022.  In Kyiv, the attack has amplified calls for international support. Ukraine's government is urging allies to supply more advanced weaponry to bolster air defences and protect the population. Read more on Sky News:Putin warns West over troopsTrump ready to move to second stage of Moscow punishmentWhy fears of an attack on Europe are not 'hysteria' Meanwhile, the United States has signalled plans for additional sanctions. For now, any end to the conflict seems far from near."
    },
    {
        "title": "Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack",
        "description": "Donald Trump has said he is ready to move to a second stage of sanctioning Russia, just hours after Moscow launched the largest arial attack of the war so far. ",
        "url": "https://news.sky.com/story/trump-says-hes-ready-to-move-to-second-stage-of-russia-sanctions-after-moscow-launches-large-aerial-attack-13426670",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-government_7013727.jpg?20250907163053",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-07 15:20:00",
        "Headline": "At least four people have been killed, including a mother and a three-month-old baby, with more than 40 others injured after Russia launched a bombardment of drones overnight.",
        "Content": " Donald Trump has said he is ready to move to a second stage of sanctioning Russia, just hours after Moscow launched the largest arial attack of the war so far.  At least four people have been killed, including a mother and a three-month-old baby, with more than 40 others injured, after Russia launched a bombardment of drones overnight. While on his way to the final of the US Open tennis tournament, the president was asked if he was ready to move to the second stage of punishment for Moscow, to which he replied, \"Yes\". It echoes US Treasury Secretary Scott Bessent, who said additional economic pressure by the United States and Europe could prompt Putin to enter peace talks with Ukraine. \"We are prepared to increase pressure on Russia, but we need our European partners to follow us,\" Treasury Secretary Scott told NBC News' Meet the Press. Sir Keir Starmer said the latest attack shows Vladimir Putin is \"not serious about peace\" as he joined other allies in condemning Russia's actions. The prime minister said the \"brutal\" and \"cowardly\" assault on Kyiv - which resulted in a government building catching fire - proved the Russian leader feels he can \"act with impunity\". Russia attacked Kyiv with 805 drones and decoys, officials said, and Ukraine shot down and neutralised 747 drones and four missiles, the country's air force has said. The attack caused a fire to break out at a key government building, with the sky above Kyiv covered in smoke. Appeasement makes 'no sense' Polish premier Donald Tusk said the latest military onslaught showed any \"attempts to appease\" Putin make \"no sense\". \"The US and Europe must together force Russia to accept an immediate ceasefire. We have all the instruments,\" Mr Tusk said on Saturday. Read more:Putin's warning to Western alliesWhy fears of an attack on Europe are not 'hysteria' Meanwhile the European Commission president, Ursula von der Leyen, said the Kremlin was \"mocking diplomacy\". Vladimir Putin reportedly wants control of the eastern Donetsk and Luhansk regions of Ukraine - known as the Donbas - as a condition for ending the war. Russia occupies around 19% of Ukraine, including Crimea and the parts of the Donbas region it seized before the full-scale invasion in February 2022. But this attack comes after European nations pressed the Russian leader to work to end the war at a virtual meeting of the \"coalition of the willing\" - a group of countries led by France and Britain seeking to help protect Kyiv in the event of a ceasefire. Some 26 of Ukraine's allies pledged to provide security guarantees as part of a \"reassurance force\" for the war-torn country once the fighting ends, Mr Macron has said. Ukrainian president Volodymyr Zelenskyy has said he is ready to meet Mr Putin to negotiate a peace agreement, and has urged US president Donald Trump to put punishing sanctions on Russia to push it to end the war. \"The world can force the Kremlin criminals to stop the killings - all that is needed is political will,\" he said on Sunday."
    },
    {
        "title": "New home secretary to host talks on people smuggling as small-boat crossings hits 30,000",
        "description": "The new home secretary will host talks on how to stop people smuggling in her first major engagement in the role. ",
        "url": "https://news.sky.com/story/new-home-secretary-to-host-talks-on-people-smuggling-in-first-major-job-engagement-13426775",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-shabana-mahmood_7013937.jpg?20250907203347",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-07 17:55:00",
        "Headline": "The security alliance, hosted by Shabana Mahmood, comes after an estimated 1,000 people arrived by small boat in Britain over the course of a single day.",
        "Content": "The new home secretary will host talks on how to stop people smuggling in her first major engagement in the role.  Shabana Mahmood will host the so-called Five Eyes security alliance, holding talks between counterparts from the US, Australia, Canada and New Zealand. The security alliance discussion comes after an estimated 1,000 people arrived by small boat in Britain over the course of a single day, with French authorities saying 24 people were rescued while trying to cross the English Channel. Ms Mahmood said the numbers, which take the yearly total to more than 30,000 in record time, were \"utterly unacceptable\" and that she expected migrant returns under a deal agreed last month with France to begin \"imminently\". She was promoted into the role Friday during a dramatic reshuffle of Keir Starmer's top team, which followed in the wake of Angela Rayner's resignation over her tax affairs. Politics latest: 'One of the worst PMs in history' Sir Keir will now be hoping to draw a line under the fallout of his former deputy's departure, as well as a summer dominated by criticism of his government's handling of the small boats crisis. Ms Mahmood said the Five Eyes intelligence sharing pact would \"agree new measures to protect our border\". The group will also discuss new measures to tackle child sexual abuse online, as well as the spread of deadly synthetic opioids, the Home Office said. Ms Mahmood said: \"Rebuilding our reputation on the world stage is how we tackle serious organised crime and secure our borders.\" Read more from Sky News:Military sites could house migrantsRayner's rise to deputy PM \"The Five Eyes might be drawn from different corners of the globe, but we are united by our alliance,\" she added. \"As the security threats we all face become more complex and span continents, we are stronger and safer together.\" She will be joined at the talks by US secretary of homeland security Kristi Noem, Canadian public safety minister Gary Anandasangaree, Australian home affairs minister Tony Burke and New Zealand minister Judith Collins.  The Prime Minister has told his new ministers to \"go up a gear\" in delivering on Labour's agenda, part of which now involves a toughened immigration policy as he faces pressure in the polls from Nigel Farage's Reform UK. In Ms Mahmood's first full day in the job, she met the head of Scotland Yard to receive a briefing on the policing operation in response to protests in London. \"Supporting Palestine and supporting a proscribed terrorist group are not the same thing,\" she said. \"An honour to visit Sir Mark (Rowley) and the Metropolitan Police to see them at work policing protests yesterday.\" Almost 900 people were arrested in central London at a protest against the banning of Palestine Action."
    },
    {
        "title": "UK weather: Rain likely above average this autumn – but why it might not clear the drought",
        "description": "The public is being asked to prepare for the risk of flooding with above-average rain and wind likely this autumn.",
        "url": "https://news.sky.com/story/uk-weather-rain-likely-above-average-this-autumn-8211-but-why-it-might-not-clear-the-drought-13424921",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-weather-rain_7011555.jpg?20250905003902",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-07 23:01:00",
        "Headline": "The Met Office detects chances of above-average rain and wind for autumn - but some areas would be worse affected, and drought may persist.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The public is being asked to prepare for the risk of flooding with above-average rain and wind likely this autumn. The Met Office is picking up higher chances of a strong jet stream and westerly winds in the long-range forecast, raising the risk of a wet, windy, and potentially stormy season. Get your local weather forecast Although the heavy rain and wind aren't guaranteed, if they do hit, western and northern parts of the UK are expected to bear the brunt. Meanwhile eastern and southern areas may experience drier conditions than the national average. And the unsettled weather is unlikely to eliminate the current drought afflicting five areas of England any time soon, said Will Lang, chief meteorologist at the Met Office. \"The current forecast for unsettled weather is unlikely to be enough to reverse the effects of drought over the next few weeks and during the autumn, especially so in England. We're going to need more rain than that.\" He said it's too early to tell whether that will change later in autumn and into winter. But it means some areas could feasibly experience both drought and flooding at the same time, something symptomatic of a changing climate. It comes as the sunny season came to an abrupt end last week, with the UK's hottest summer on record giving way to heavy rain in some areas. Last September brought heavy downpours and major disruption to the Midlands, before Storm Bert forced a major incident in Wales in November.  Public urged to sign up to flood warnings The Floods Resilience Taskforce - including floods minister Emma Hardy, the emergency services, and the Environment Agency - will meet later to discuss how to prepare for the season ahead. Set up last year to tackle increasingly extreme weather, it is today urging the public to sign up to flood warnings in their area, avoid driving through flood water and prepare homes in order to speed up recovery. About 6.3m properties in England are at risk of flooding, whether from the sea, rivers or flash flooding, according to Environment Agency data. The government has committed a \"record\" two-year investment of £2.65bn to protect an extra 52,000 properties. It said it is on track to protect 25,000 homes this financial year, with 3,800 so far signed off. Read more from Sky News:London-born teenager becomes a saint890 arrested at Palestine Action protestLabour 'failing to deliver change' - TUC chief Officials confirmed 92.7% of the country's critical flood defences are at their required condition, with little change on the 92.6% last September, and still below the optimum level of 98%. Ms Hardy said the government is \"investing billions to build new flood defences, which will protect homes and businesses across the country\". Warmer than average autumn expected The new storm name season was launched last week, which officials say helps make people more aware of weather risks. This autumn is also likely to be warmer than average, \"a reflection mainly of our warming climate and how much things have changed in even just in the last 30 years,\" said Mr Lang. Warmer air also holds more moisture, making downpours heavier. In April, the country's climate advisers warned the country was on course for \"disaster\" without better protection against flooding and intense heat."
    },
    {
        "title": "Labour 'failing to deliver change that people voted for' - TUC chief",
        "description": "The leader of Britain's trade unions is to accuse Sir Keir Starmer of failing to deliver the change Labour promised during the election campaign last year.",
        "url": "https://news.sky.com/story/labour-failing-to-deliver-change-that-people-voted-for-tuc-chief-13426927",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-nowak-tuc-labour_7010526.jpg?20250903202337",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-09-07 23:01:00",
        "Headline": "After a troubled first year in government that has seen Labour lose support to Reform UK, general secretary Paul Nowak will warn the lack of change cannot continue and the government must deliver on jobs, public services and living standards.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  The leader of Britain's trade unions is to accuse Sir Keir Starmer of failing to deliver the change Labour promised during the election campaign last year. In his keynote speech at the TUC conference in Brighton, general secretary Paul Nowak will claim that for too many people change still feels like a slogan, not a reality. After a troubled first year in government that has seen Labour lose support to Reform UK, Mr Nowak will warn the lack of change cannot continue and the government must deliver on jobs, public services and living standards. And he will claim Rachel Reeves' budget on 26 November must include windfall taxes on bank profits and gambling companies, a wealth tax on millionaires and the lifting of the two-child benefit cap introduced by George Osborne during the coalition government. Mr Nowak's speech comes just days after the unions lost their champion in cabinet, Angela Rayner, prompting fears among delegates in Brighton that the government is poised to weaken its flagship legislation on workers' rights. The Conservatives have responded to Ms Rayner's demise by writing to the new business and trade secretary, Peter Kyle, calling on him to scrap the Employment Rights Bill, claiming it will reduce jobs and mean more red tape and bureaucracy. But Labour is losing support to Nigel Farage's party, not the Tories, and will also - potentially - to left-wing parties in future. And in an unusual move, the new left-wing leader of the Green Party, Zack Polanski, will also address the TUC later. \n                  Unions demand no retreat on workers' rights after Rayner quits\n                 \n                  Tax the rich to thwart Reform, TUC chief urges Labour\n                 \n                  Retired women effectively without a pension for four months a year due to gender gap, research finds\n                 Read more:Unite boss warns Labour's key backer may end supportUnions demand no retreat on workers' rights after Rayner quitsWithout Angela Rayner 'there will be no holding back' Labour's left wing Labour's election manifesto last year showed a black and white photo of a shirt-sleeved Sir Keir on the front cover with the single word \"Change\" in red. In his attack on the government's first year in office, Mr Nowak will say: \"The Tories took Britain to the brink. That's why last July, the government was elected on a manifesto that promised change. \"But we have to be honest - for too many people, change still feels like a slogan not a lived reality. \"This can't continue. Throughout our history, we've been at our best when we've been ambitious for working people. \"So today, my message to the government is simply this. \"Deliver the manifesto on which you won a huge majority last July. Deliver good jobs, decent public services and better living standards in every corner of the country. Deliver the change people voted for. \"And show working-class communities whose side you are on.\"  On the budget, which Labour MPs believe will be crucial to the government's hopes of recovery in its fortunes, Mr Nowak will declare: \"Introduce a windfall tax on record bank profits and gambling companies. And back it with new taxes on wealth. \"If billionaires can afford fleets of private yachts. Day trips into space. Weddings that shut down Venice - they can pay a bit more tax. \"Do what's best for those who go out to work, day in, day out, and still can't get by. Deliver the Employment Rights Bill and deliver it in full. \"And make it clear - a Labour government will never stand aside and watch a child's potential be wasted because of poverty. Lift the two-child cap, and give our kids the future they deserve.\"  And on the issue set to dominate this week's conference, workers' rights, Mr Nowak will say: \"The government has a manifesto promise to make work pay. \"Stronger rights at work are overwhelmingly popular with voters across the political spectrum. \"The public knows decent work is the best way to deliver the reset this country needs. \"The best way to improve living standards. \"And the best way to rebuild our communities hit hard by low pay and insecure work. \"So here is our challenge to government. \"Deliver that Employment Rights Bill in full and deliver the change you promised at the election.\" But the Tories' shadow business secretary Andrew Griffith, in a letter to Mr Kyle, claims the bill will be deeply damaging to economic growth and reduce living standards. \"Rather than proceed at this time with a measure which on the government's own impact assessment will reduce employment and growth, now is the time to put the national interest first,\" he wrote. \"Any credible 'reset' of this government requires that this bill be shelved and the government look afresh at measures to promote the growth and competitiveness of the UK economy.\""
    },
    {
        "title": "Cheers and boos as Donald Trump arrives for delayed Sinner-Alcaraz US Open men's final ",
        "description": "The men's US Open final has been delayed by extra security measures as Donald Trump's arrival was met by cheers and boos from fans at Flushing Meadows.",
        "url": "https://news.sky.com/story/cheers-and-boos-as-donald-trump-arrives-for-delayed-sinner-alcaraz-us-open-mens-final-13426794",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-us-open-tennis_7013885.jpg?20250907193123",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-07 18:17:00",
        "Headline": "The match between Jannik Sinner and Carlos Alcaraz was pushed back by half an hour as increased security checks delayed spectators entering the arena.",
        "Content": " The men's US Open final has been delayed by extra security measures as Donald Trump's arrival was met by cheers and boos from fans at Flushing Meadows. The match between Jannik Sinner and Carlos Alcaraz, the world's top two players, was pushed back by half an hour in New York on Sunday before Alcaraz won three sets to one. The US president was greeted with a mix of cheers and boos from early arriving spectators when he waved from a suite at the Arthur Ashe Stadium about 45 minutes before the match began. Increased security checks at entrances to the grounds and to get into the arena building prompted the US Tennis Association to move the start time to 2.30pm, local time, instead of 2pm. Organisers said it was \"to ensure that fans have additional time to get to their seats.\" A spokesperson for the US Tennis Association said it \"was not a request made by the White House\". Despite the change, the 24,000-capacity arena was only about two-thirds full when the first point was played, while thousands of fans still were standing outside the court, waiting in line to enter. \n                  Death cap mushroom killer Erin Patterson jailed for minimum of 33 years\n                 \n                  Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack\n                 \n                  Russia lands symbolic blow as largest aerial attack on Ukraine's capital shows Moscow's strategy\n                 Mr Trump, who is the first sitting president to attend the tournament at Flushing Meadows since Bill Clinton in 2000, was booed again when he appeared for the National Anthem. Standing up and saluting, the president was shown briefly on the arena's big screens during the anthem, and offered a smirk that briefly made the boos louder. Read more on Sky News: 'Chipocalypse Now': Trump threatens US cityTrump orders 'take down' of 44-year-old peace vigilThe proxy war that will redefine public health in America Always a big celebrity draw, the final attracted, among others, Manchester City manager Pep Guardiola, former Vogue editor Anna Wintour, Hollywood stars Ben Stiller and Danny DeVito, director Spike Lee and basketball player Steph Curry."
    },
    {
        "title": "890 people arrested at Palestine Action protest yesterday - including 17 on suspicion of assaulting police officers",
        "description": "The Metropolitan Police has said 890 people were arrested at a protest against the banning of Palestine Action as a terror group on Saturday - including 17 on suspicion of assaulting officers.",
        "url": "https://news.sky.com/story/890-people-arrested-at-palestine-action-protest-yesterday-including-17-on-suspicion-of-assaulting-police-officers-13413938",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-met-police-metropolitan-police_7013445.jpg?20250907161523",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-07 06:00:00",
        "Headline": "A total of 857 individuals were arrested under the Terrorism Act 2000 over alleged offences, while 33 people were detained for other offences.",
        "Content": " The Metropolitan Police has said 890 people were arrested at a protest against the banning of Palestine Action as a terror group on Saturday - including 17 on suspicion of assaulting officers. A total of 857 individuals were arrested in Parliament Square in London under the Terrorism Act 2000 over alleged offences, the force said. It added that a further 33 were arrested for other offences, with 17 of those detained on suspicion of assaulting officers. The Met Police did not say what the other 16 arrests were for. Deputy Assistant Commissioner Claire Smart, who led the policing operation, thanked Met Police officers for their \"professionalism and tireless work despite the level of abuse that they faced\". Ms Smart said: \"The violence we encountered during the operation was coordinated and carried out by a group of people, many wearing masks to conceal their identity, intent on creating as much disorder as possible. \"Many of those individuals have now been arrested and we have begun securing charges.\" Defend Our Juries, which organised the demonstrations, insisted the rally was \"the picture of peaceful protest\". \n                  100 firefighters tackle blaze at former BBC television centre in London's White City\n                 \n                  Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'\n                 \n                  Bus hits pedestrians injuring 17 people in Victoria Street, central London\n                  Ms Smart also claimed that the \"contrast between this demonstration and the other protests we policed yesterday, including the Palestine Coalition march attended by around 20,000 people, was stark\". She added: \"You can express your support for a cause without committing an offence under the Terrorism Act or descending into violence and disorder, and many thousands of people do that in London every week. \"We have a duty to enforce the law without fear or favour. If you advertise that you are intending to commit a crime, we have no option but to respond accordingly.\" Defend Our Juries previously estimated 1,500 had gathered for the rally on Saturday, where many held signs saying: \"I oppose genocide. I support Palestine Action.\" The group has been banned as a terror group since 5 July after MPs voted overwhelmingly in favour of the move proposed by then-home secretary Yvette Cooper, making it illegal to express support for the group. It came shortly after two Voyager aircraft suffered around £7m worth of damage at RAF Brize Norton in Oxfordshire on 20 June. Defence Secretary John Healey told Sky's Sunday Morning With Trevor Phillips that he expects newly appointed Home Secretary Shabana Mahmood to be \"just as tough\" as her predecessor on Palestine Action. He said: \"I expect her to defend the decision the government has taken to proscribe Palestine Action because of what some of its members are responsible for, and were planning for.\" Read more from Sky News:Israel warns Gaza City residents to fleeAnger over Israeli president's planned visit to UKSydney beaches closed after fatal shark attack The Met Police previously said the consequences for those charged under the Terrorism Act include a maximum sentence of six months' imprisonment. The Home Office is set to appeal against the High Court ruling allowing Palestine Action's co-founder, Huda Ammori, to proceed with a legal challenge against the government over the group's ban.  "
    },
    {
        "title": "890 people arrested at Palestine Action protest yesterday - including 17 on suspicion of assaulting police officers",
        "description": "The Metropolitan Police has said 890 people were arrested at a protest against the banning of Palestine Action as a terror group on Saturday - including 17 on suspicion of assaulting officers.",
        "url": "https://news.sky.com/story/890-people-arrested-at-palestine-action-protest-yesterday-including-17-on-suspicion-of-assaulting-police-officers-13413938",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-met-police-metropolitan-police_7013445.jpg?20250907161523",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-07 06:00:00",
        "Headline": "A total of 857 individuals were arrested under the Terrorism Act 2000 over alleged offences, while 33 people were detained for other offences.",
        "Content": " The Metropolitan Police has said 890 people were arrested at a protest against the banning of Palestine Action as a terror group on Saturday - including 17 on suspicion of assaulting officers. A total of 857 individuals were arrested in Parliament Square in London under the Terrorism Act 2000 over alleged offences, the force said. It added that a further 33 were arrested for other offences, with 17 of those detained on suspicion of assaulting officers. The Met Police did not say what the other 16 arrests were for. Deputy Assistant Commissioner Claire Smart, who led the policing operation, thanked Met Police officers for their \"professionalism and tireless work despite the level of abuse that they faced\". Ms Smart said: \"The violence we encountered during the operation was coordinated and carried out by a group of people, many wearing masks to conceal their identity, intent on creating as much disorder as possible. \"Many of those individuals have now been arrested and we have begun securing charges.\" Defend Our Juries, which organised the demonstrations, insisted the rally was \"the picture of peaceful protest\". \n                  100 firefighters tackle blaze at former BBC television centre in London's White City\n                 \n                  Two arrested as police suspect 'corrupt' council staff allocated 'hundreds of homes for cash'\n                 \n                  Bus hits pedestrians injuring 17 people in Victoria Street, central London\n                  Ms Smart also claimed that the \"contrast between this demonstration and the other protests we policed yesterday, including the Palestine Coalition march attended by around 20,000 people, was stark\". She added: \"You can express your support for a cause without committing an offence under the Terrorism Act or descending into violence and disorder, and many thousands of people do that in London every week. \"We have a duty to enforce the law without fear or favour. If you advertise that you are intending to commit a crime, we have no option but to respond accordingly.\" Defend Our Juries previously estimated 1,500 had gathered for the rally on Saturday, where many held signs saying: \"I oppose genocide. I support Palestine Action.\" The group has been banned as a terror group since 5 July after MPs voted overwhelmingly in favour of the move proposed by then-home secretary Yvette Cooper, making it illegal to express support for the group. It came shortly after two Voyager aircraft suffered around £7m worth of damage at RAF Brize Norton in Oxfordshire on 20 June. Defence Secretary John Healey told Sky's Sunday Morning With Trevor Phillips that he expects newly appointed Home Secretary Shabana Mahmood to be \"just as tough\" as her predecessor on Palestine Action. He said: \"I expect her to defend the decision the government has taken to proscribe Palestine Action because of what some of its members are responsible for, and were planning for.\" Read more from Sky News:Israel warns Gaza City residents to fleeAnger over Israeli president's planned visit to UKSydney beaches closed after fatal shark attack The Met Police previously said the consequences for those charged under the Terrorism Act include a maximum sentence of six months' imprisonment. The Home Office is set to appeal against the High Court ruling allowing Palestine Action's co-founder, Huda Ammori, to proceed with a legal challenge against the government over the group's ban.  "
    },
    {
        "title": "Millions of phones sound sirens as government tests emergency alert system ",
        "description": "Tens of millions of mobile phones in the UK received a message and sounded a loud alarm in the second nationwide test of the government's public alert system.",
        "url": "https://news.sky.com/story/millions-of-phones-sound-sirens-as-government-tests-emergency-alert-system-13426690",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-phone-alert-test_7013784.jpg?20250907171819",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-07 15:48:00",
        "Headline": "Several big sporting events across the country were halted as phones blared out emergency sirens and displayed a message from the government.",
        "Content": "Tens of millions of mobile phones in the UK received a message and sounded a loud alarm in the second nationwide test of the government's public alert system. The test came through on mobiles connected to 4G and 5G networks at around 3pm on Sunday, with the text explaining that the system would be used in future to \"warn you if there's a life-threatening emergency nearby\". Emergency alert as it happened Many across the nation paused to look at their phones, though some Sky News readers wrote in to say their devices hadn't sounded. After the test, the government said there were a number of reasons why some may not have received the alert, including that the device: • May not have had signal• Could have been in airplane mode• May have had emergency alerts settings disabled• Might not have been enabled for 4G and 5G• May have been switched off entirely  The government had warned about the alert in advance to avoid worrying recipients. \n                  890 people arrested at Palestine Action protest yesterday - including 17 on suspicion of assaulting police officers\n                 \n                  Without Angela Rayner 'there will be no holding back' Labour's left wing\n                 \n                  UK weather: Rain likely above average this autumn – but why it might not clear the drought\n                 The Super League derby between Hull KR and Hull FC was subsequently pushed back until 3.05pm, while the alarm happened between overs at England's third ODI cricket match against South Africa at Southampton. The Ireland v New Zealand Women's Rugby World Cup match at Brighton was briefly paused by the referee while the alert sounded. Fans had been warned via a message on the big screen about the alert. Darren Jones, chief secretary to the prime minister, said: \"Thank you for taking part in today's test, which saw tens of millions of phones successfully receive the message across the country. \"The test took just seconds, but will help the government keep the country safe 24 hours a day, 365 days a year. The next time you hear the siren, it may be a real emergency, so remember to stay calm and follow the advice in the Emergency Alert.\" The alarm system, which is intended to be used in situations such as extreme weather, flooding, and fires, was first tested in April 2023. It has been used to issue real warnings five times, including in January during Storm Eowyn to warn people in Scotland and Northern Ireland about severe weather, and in February last year to warn people in Plymouth about a 500kg unexploded Second World War bomb found in a local resident's back garden."
    },
    {
        "title": "Without Angela Rayner 'there will be no holding back' Labour's left wing",
        "description": "In the wake of Angela Rayner's departure, Number 10 has carried out a swift and drama-free reshuffle that is all about delivery, but they shouldn't congratulate themselves too soon.",
        "url": "https://news.sky.com/story/without-angela-rayner-there-will-be-no-holding-back-labours-left-wing-13426548",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-keir-starmer_7012045.jpg?20250907143344",
        "type": "UK",
        "Author": "Liz Bates",
        "Date Published": "2025-09-07 12:49:00",
        "Headline": "Political forces that have been threatening to destabilise the entire Starmer project are about to be unleashed as Labour heads towards a potentially drawn-out and damaging deputy leadership contest.",
        "Content": "\n          Political correspondent\n              @wizbates\n In the wake of Angela Rayner's departure, Number 10 has carried out a swift and drama-free reshuffle that is all about delivery, but they shouldn't congratulate themselves too soon. While they focus on pragmatism, political forces that have been threatening to destabilise the entire Starmer project are about to be unleashed. Firstly, the Labour party itself, which has always been an unwieldy beast, is getting ready to bite. Politics latest: Reform's withering verdict on Johnson With Rayner's exit, Number 10 has lost its working-class human shield, its bridge between the party and the prime minister, and the northern woman who made its pale, male leader more palatable to a sizable section of the movement. Any dwindling loyalty from the left was largely linked to her and, in her absence, there will be no holding back.  And for Sir Keir's critics, they have the perfect vehicle to air their grievances - a potentially drawn-out and damaging deputy leadership contest, which could easily overshadow the forthcoming conference. All of which will prompt a weary electorate to wonder if this really is a whole new public-facing Labour party or if the relentless infighting was simply paused while they secured power. This takes us to the next big obstacle of the local elections in May which, as things stand, will see them hammered from all sides. Much has been made of the Reform surge, but in reality the threat surrounds them, with the Greens likely to take big chunks of their support and the independent Muslim vote also threatening to eat into some of their most reliable heartlands, not to mention Jeremy Corbyn's new political project, which will make plenty of noise if nothing else. 👉 Listen to Electoral Dysfunction on your podcast app 👈 Read more from Sky News:Unions react after Rayner quitsMilitary sites could house migrantsRayner's rise to deputy PM This could push them from slightly unstable into some very serious soul searching, as the next general election edges closer and the record number of MPs with slim majorities get increasingly jittery. It is at that potentially precarious moment that the prime minister will need a figure like Rayner and find that he doesn't have one. At that point, the pragmatism over politics approach that has defined this reshuffle might not feel that smart after all."
    },
    {
        "title": "UK weather: Rain likely above average this autumn – but why it might not clear the drought",
        "description": "The public is being asked to prepare for the risk of flooding with above-average rain and wind likely this autumn.",
        "url": "https://news.sky.com/story/uk-weather-rain-likely-above-average-this-autumn-8211-but-why-it-might-not-clear-the-drought-13424921",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-weather-rain_7011555.jpg?20250905003902",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-07 23:01:00",
        "Headline": "The Met Office detects chances of above-average rain and wind for autumn - but some areas would be worse affected, and drought may persist.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The public is being asked to prepare for the risk of flooding with above-average rain and wind likely this autumn. The Met Office is picking up higher chances of a strong jet stream and westerly winds in the long-range forecast, raising the risk of a wet, windy, and potentially stormy season. Get your local weather forecast Although the heavy rain and wind aren't guaranteed, if they do hit, western and northern parts of the UK are expected to bear the brunt. Meanwhile eastern and southern areas may experience drier conditions than the national average. And the unsettled weather is unlikely to eliminate the current drought afflicting five areas of England any time soon, said Will Lang, chief meteorologist at the Met Office. \"The current forecast for unsettled weather is unlikely to be enough to reverse the effects of drought over the next few weeks and during the autumn, especially so in England. We're going to need more rain than that.\" He said it's too early to tell whether that will change later in autumn and into winter. But it means some areas could feasibly experience both drought and flooding at the same time, something symptomatic of a changing climate. It comes as the sunny season came to an abrupt end last week, with the UK's hottest summer on record giving way to heavy rain in some areas. Last September brought heavy downpours and major disruption to the Midlands, before Storm Bert forced a major incident in Wales in November.  Public urged to sign up to flood warnings The Floods Resilience Taskforce - including floods minister Emma Hardy, the emergency services, and the Environment Agency - will meet later to discuss how to prepare for the season ahead. Set up last year to tackle increasingly extreme weather, it is today urging the public to sign up to flood warnings in their area, avoid driving through flood water and prepare homes in order to speed up recovery. About 6.3m properties in England are at risk of flooding, whether from the sea, rivers or flash flooding, according to Environment Agency data. The government has committed a \"record\" two-year investment of £2.65bn to protect an extra 52,000 properties. It said it is on track to protect 25,000 homes this financial year, with 3,800 so far signed off. Read more from Sky News:London-born teenager becomes a saint890 arrested at Palestine Action protestLabour 'failing to deliver change' - TUC chief Officials confirmed 92.7% of the country's critical flood defences are at their required condition, with little change on the 92.6% last September, and still below the optimum level of 98%. Ms Hardy said the government is \"investing billions to build new flood defences, which will protect homes and businesses across the country\". Warmer than average autumn expected The new storm name season was launched last week, which officials say helps make people more aware of weather risks. This autumn is also likely to be warmer than average, \"a reflection mainly of our warming climate and how much things have changed in even just in the last 30 years,\" said Mr Lang. Warmer air also holds more moisture, making downpours heavier. In April, the country's climate advisers warned the country was on course for \"disaster\" without better protection against flooding and intense heat."
    },
    {
        "title": "Labour consider using military barracks to house small boat migrants - as almost 1,100 arrive in one day",
        "description": "Defence Secretary John Healey has told Sky News the government is considering using military barracks to house asylum seekers, as 1,097 people arrived in the UK on small boats on Saturday.",
        "url": "https://news.sky.com/story/labour-considering-using-military-barracks-to-house-asylum-seekers-13426406",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250805144234",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-07 03:46:00",
        "Headline": "Following widespread protests over asylum seekers in hotels, Defence Secretary John Healey tells Sky News that Labour is \"looking really hard\" at the potential use of military sites to house migrants while their asylum applications are assessed.",
        "Content": " Defence Secretary John Healey has told Sky News the government is considering using military barracks to house asylum seekers, as 1,097 people arrived in the UK on small boats on Saturday. \"We are looking at the potential use of military and non-military sites for temporary accommodation for the people who come across on these small boats that may not have a right to be here,\" he told Sunday Morning With Trevor Phillips. \"I'm looking really hard at it. I'm looking at it with the Home Office, and I recognise that the loss of confidence of the public over recent years in Britain's ability to control its borders needs to be satisfied. And we have to deal with this problem with the small boats,\" Mr Healey added. Politics latest: Labour considers housing migrants on military sites The measure follows widespread protests this summer over housing migrants in hotels. Two former military sites - MDP Wethersfield, a former RAF base in Essex, and Napier Barracks, a former military base in Kent - are already used to house a small number of asylum seekers. Fresh small boat arrivals were spotted on Sunday, as Home Office figures showed 1,097 people arrived on Saturday - when French authorities said 24 people were rescued while trying to cross the Channel. \n                  Revealed: Huge rise in protests being dealt with by police\n                 \n                  Ex-asylum seeker wants government to deport him to Somalia because it's 'safer' than Nuneaton\n                 \n                  Reform took advantage of the PM's holiday - and it's clear he's now changed strategy\n                 The figures come after a lull in crossings. In the previous seven days (30 August to 5 September) the Home Office recorded no small boat arrivals. Home Secretary Shabana Mahmood called the small boats crossings \"utterly unacceptable\" and accused the \"vile\" people smugglers of \"wreaking havoc on our borders\". She said that, thanks to the UK's deal with France, those arriving in small boats \"can now be detained and removed to France and I expect the first returns to take place imminently. \"Protecting the UK border is my priority as home secretary and I will explore all options to restore order to our immigration system.\" Zia Yusuf, head of policy at Reform UK, told Trevor Phillips that Britain has become a \"soft touch\" on migration, before suggesting between 15 and 25 detention sites will need to be built to detain asylum seekers. He described these as \"purpose-built modular steel structures\". \"We can look around the world at where things have worked and worked well. President Trump stood up 3,000 detention beds in eight days. That was this year in the state of Florida - using steel modular structures,\" Mr Yusuf said. He added that the president's crackdown has significantly reduced illegal border crossings and suggested the same could happen in the English Channel to deter migrants. \"These are unarmed, largely men in dinghies, we don't need a particularly formidable military to be able to take them to a detention centre,\" he said. Ms Mahmood will have the job of tackling illegal immigration after taking over from Yvette Cooper as home secretary on Friday - when Sir Keir Starmer carried out a major cabinet reshuffle following the resignation of his deputy prime minister Angela Rayner. National Crime Agency (NCA) figures show record levels of disruption of immigration crime networks in 2024/25. Join the Sky News immigration debate It’s hard to see inside Napier barracks, one of the few military sites already housing migrants. The perimeter wire fences are covered with blue tarpaulin. This large military complex is now housing over two hundred migrants, all waiting for their asylum claims to be processed. About half arrived on small boats, picked up by Border Force as they crossed the channel.\n I met a small group of the residents, who’d gathered in a nearby park. They were young men all from Eritrea and had all arrived in the last month on small boats. They told me conditions inside were poor, with fourteen people sleeping in each dormitory room. They said they share the same bathroom with another dorm of fourteen. A short while later, volunteers from a charity set up a stall outside the barracks handing out shoes. On a table there were pairs of trainers and shoes, with a long queue of people waiting to take them. This site has faced much opposition. It should have been shut down in August, but in recent weeks increasing numbers of asylum seekers have been sent here, and the deadline for its closure has already been extended. Officials believe this contributed to the lowest number of boats crossing the Channel in August since 2019. But, despite the 3,567 arrivals in August being the lowest since 2021, when looking across the whole of 2025, the figure of 29,003 is the highest on record for this point in a year. Sky's Political Correspondent Liz Bates said that after Labour scrapped the previous government's controversial Rwanda policy and shut down the Bibby Stockholm barge, ministers are \"hitting up against many of the same problems\" with \"a really broken and very slow asylum system\". \"The context to all of this is a huge shake-up at the Home Office, and I think something of an admission that [Yvette] Cooper, despite her years of experience, could not get a grip... of this problem of people coming across the Channel in small boats and then ending up in asylum hotels,\" she added. Army bases were previously used by the Conservative government, but this prompted local protests, and the sites were widely criticised for their poor conditions in some cases. Read more from Sky News:Farage wants Afghan women deportedHuge rise in asylum protestsAttack on Epping asylum seeker As Sky's Home Editor Jason Farrell writes, Ms Mahmood has become the home secretary of a country where the national flag is being hoisted as a symbol of dissatisfaction - with anger at the arrival of desperate migrants crossing the Channel in small boats. Sir Keir's sweeping changes Sir Keir Starmer has announced sweeping changes to his ministerial team in the Home Office as his government works to get a grip of illegal migration to the UK. Here's a list of who has been moved, besides the home secretary. Dame Angela Eagle, who was border security and asylum minister, has been moved to the environment department. Dame Diana Johnson, who was policing and crime minister, has been moved to the Department for Work and Pensions (DWP). She has said in a post on X that it was an \"honour\" to work with police officers, and she is \"delighted\" to be moving to the DWP. Dan Jarvis has been given a role in the Cabinet Office, in addition to his post as security minister in the Home Office. And Sarah Jones, who was industry minister, has been moved to the Home Office."
    },
    {
        "title": "New home secretary to host talks on people smuggling as small-boat crossings hits 30,000",
        "description": "The new home secretary will host talks on how to stop people smuggling in her first major engagement in the role. ",
        "url": "https://news.sky.com/story/new-home-secretary-to-host-talks-on-people-smuggling-in-first-major-job-engagement-13426775",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-shabana-mahmood_7013937.jpg?20250907203347",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-07 17:55:00",
        "Headline": "The security alliance, hosted by Shabana Mahmood, comes after an estimated 1,000 people arrived by small boat in Britain over the course of a single day.",
        "Content": "The new home secretary will host talks on how to stop people smuggling in her first major engagement in the role.  Shabana Mahmood will host the so-called Five Eyes security alliance, holding talks between counterparts from the US, Australia, Canada and New Zealand. The security alliance discussion comes after an estimated 1,000 people arrived by small boat in Britain over the course of a single day, with French authorities saying 24 people were rescued while trying to cross the English Channel. Ms Mahmood said the numbers, which take the yearly total to more than 30,000 in record time, were \"utterly unacceptable\" and that she expected migrant returns under a deal agreed last month with France to begin \"imminently\". She was promoted into the role Friday during a dramatic reshuffle of Keir Starmer's top team, which followed in the wake of Angela Rayner's resignation over her tax affairs. Politics latest: 'One of the worst PMs in history' Sir Keir will now be hoping to draw a line under the fallout of his former deputy's departure, as well as a summer dominated by criticism of his government's handling of the small boats crisis. Ms Mahmood said the Five Eyes intelligence sharing pact would \"agree new measures to protect our border\". The group will also discuss new measures to tackle child sexual abuse online, as well as the spread of deadly synthetic opioids, the Home Office said. Ms Mahmood said: \"Rebuilding our reputation on the world stage is how we tackle serious organised crime and secure our borders.\" Read more from Sky News:Military sites could house migrantsRayner's rise to deputy PM \"The Five Eyes might be drawn from different corners of the globe, but we are united by our alliance,\" she added. \"As the security threats we all face become more complex and span continents, we are stronger and safer together.\" She will be joined at the talks by US secretary of homeland security Kristi Noem, Canadian public safety minister Gary Anandasangaree, Australian home affairs minister Tony Burke and New Zealand minister Judith Collins.  The Prime Minister has told his new ministers to \"go up a gear\" in delivering on Labour's agenda, part of which now involves a toughened immigration policy as he faces pressure in the polls from Nigel Farage's Reform UK. In Ms Mahmood's first full day in the job, she met the head of Scotland Yard to receive a briefing on the policing operation in response to protests in London. \"Supporting Palestine and supporting a proscribed terrorist group are not the same thing,\" she said. \"An honour to visit Sir Mark (Rowley) and the Metropolitan Police to see them at work policing protests yesterday.\" Almost 900 people were arrested in central London at a protest against the banning of Palestine Action."
    },
    {
        "title": "Unite boss Sharon Graham criticises Starmer and Labour as she warns party's key backer may end support",
        "description": "Trade union firebrand Sharon Graham has told Sky News Sir Keir Starmer only has a year to recover from Labour's disastrous slump and said her union, Unite, may stop bankrolling the party if it doesn't start backing workers.",
        "url": "https://news.sky.com/story/unite-boss-sharon-graham-criticises-starmer-and-labour-as-she-warns-partys-key-backer-may-end-support-13426739",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-graham_7013840.png?20250907181012",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-07 16:36:00",
        "Headline": "Ms Graham, whose union hands £1.4m a year to the party, took aim at the government's approach to employment rights, zero-hours contracts and cuts to winter fuel payments, warning that her members would \"feel duped unless Labour stuck to its manifesto promises\". ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Trade union firebrand Sharon Graham has told Sky News Sir Keir Starmer only has a year to recover from Labour's disastrous slump and said her union, Unite, may stop bankrolling the party if it doesn't start backing workers. Speaking to Sky News as the TUC conference began in Brighton, the Unite leader said parts of the government's workers' rights legislation were now a \"burnt-out shell\" and her members would feel duped unless Labour stuck to its manifesto promises. In recent years, Unite has been one of Labour 's biggest backers, handing its previous leader, Jeremy Corbyn around £3m to fight the 2019 general election under Ms Graham's left-wing predecessor, \"Red Len\" McCluskey. Since succeeding Mr McCluskey in 2021, Ms Graham has said there will be no \"blank cheque\" for the party, yet the union's affiliation fees to Labour are currently £1.4 million a year. In a thinly-veiled threat to stop bankrolling Labour, she told Sky News: \"What they need to do is to be Labour. People were crying for them to get in, wanting them to get in. I wanted them to get in, but they're not doing the things we thought they would do. \"Winter fuel [payments], how did that happen? They're not backing workers. Grangemouth and Lindsey [oil] refineries look like they're going to close. Not backing council workers, cost of living crisis, a 38% increase in food since 2021. People need Labour to be Labour so they can relieve the pressure that's on them. \"We are affiliated to Labour, but it's harder and harder to justify that if they're not backing workers. We're a trade union. I am general secretary of a trade union that backs workers. I expect Labour to back workers. \"If they don't, then our members will make the decision. It's them who make the decisions and they may decide not to be affiliated to Labour for that reason.\" Condemning changes to the Employment Rights Bill, Ms Graham said: \"What the government has done is amend its own legislation. They've done their own amendment to make it easier to fire and rehire council workers and public sector workers. \"And so for me, there is no ban. And that is a huge watering down of what they said they would do. If they keep chipping away themselves and allow others to chip it away, it's going to be something that's not worth the paper that it's written on. \"We need to go back to what we said we would do, which was to put in some clear employment rights for workers to give them a better deal at work. If they don't do that, then workers are going to feel duped.  \"We were told there would be a ban on fire and rehire. We've been told there will be a ban on zero-hour contracts. Those two things are not true. What the government needs to do is to put this bill back where it was to make sure that it's worth something, that it's not a paper tiger in the end.\" Claiming the prime minister has a year to get his policies right or lose votes to Nigel Farage's Reform UK, Ms Graham said: \"Already some of the damage is done from when the winter fuel cuts came in. Some people will not forgive them for that. \"But when you've got council workers either losing their jobs or having their pay pushed down, they're looking at Labour and saying 'What are you doing?' They're not going to hold on forever. They will turn somewhere else unless Labour do something differently. \"What they need to do is deliver for workers, because that's what they promised. We're affiliated to Labour because they're supposed to be the voice of workers. That's what we're asking them to do. Stop shilly-shallying.\" Read more on Sky News:Almost 900 arrested at Palestine demoFarage admits house mistake In July, Unite members voted at a conference to suspend Angela Rayner's membership over her role in the Birmingham bin strike row when she was housing and local government secretary. Asked about her resignation from government and as Labour deputy leader, Ms Graham said: \"Angela was in charge of the department when we've had this debacle about Birmingham City Council workers who were losing up to £8,000 a year in pay. \"Why are workers in councils paying for [the] incompetence of councils and council debt? It's not acceptable.\" And asked to name her preferred candidate for deputy leader, she said: \"I've been around long enough to know it's not what people say, it's what they do. I'm going to be looking very much at their track record. Have they backed workers? That's what I'll be looking for.\""
    },
    {
        "title": "Labour 'failing to deliver change that people voted for' - TUC chief",
        "description": "The leader of Britain's trade unions is to accuse Sir Keir Starmer of failing to deliver the change Labour promised during the election campaign last year.",
        "url": "https://news.sky.com/story/labour-failing-to-deliver-change-that-people-voted-for-tuc-chief-13426927",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-nowak-tuc-labour_7010526.jpg?20250903202337",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-09-07 23:01:00",
        "Headline": "After a troubled first year in government that has seen Labour lose support to Reform UK, general secretary Paul Nowak will warn the lack of change cannot continue and the government must deliver on jobs, public services and living standards.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  The leader of Britain's trade unions is to accuse Sir Keir Starmer of failing to deliver the change Labour promised during the election campaign last year. In his keynote speech at the TUC conference in Brighton, general secretary Paul Nowak will claim that for too many people change still feels like a slogan, not a reality. After a troubled first year in government that has seen Labour lose support to Reform UK, Mr Nowak will warn the lack of change cannot continue and the government must deliver on jobs, public services and living standards. And he will claim Rachel Reeves' budget on 26 November must include windfall taxes on bank profits and gambling companies, a wealth tax on millionaires and the lifting of the two-child benefit cap introduced by George Osborne during the coalition government. Mr Nowak's speech comes just days after the unions lost their champion in cabinet, Angela Rayner, prompting fears among delegates in Brighton that the government is poised to weaken its flagship legislation on workers' rights. The Conservatives have responded to Ms Rayner's demise by writing to the new business and trade secretary, Peter Kyle, calling on him to scrap the Employment Rights Bill, claiming it will reduce jobs and mean more red tape and bureaucracy. But Labour is losing support to Nigel Farage's party, not the Tories, and will also - potentially - to left-wing parties in future. And in an unusual move, the new left-wing leader of the Green Party, Zack Polanski, will also address the TUC later. \n                  Unions demand no retreat on workers' rights after Rayner quits\n                 \n                  Tax the rich to thwart Reform, TUC chief urges Labour\n                 \n                  Retired women effectively without a pension for four months a year due to gender gap, research finds\n                 Read more:Unite boss warns Labour's key backer may end supportUnions demand no retreat on workers' rights after Rayner quitsWithout Angela Rayner 'there will be no holding back' Labour's left wing Labour's election manifesto last year showed a black and white photo of a shirt-sleeved Sir Keir on the front cover with the single word \"Change\" in red. In his attack on the government's first year in office, Mr Nowak will say: \"The Tories took Britain to the brink. That's why last July, the government was elected on a manifesto that promised change. \"But we have to be honest - for too many people, change still feels like a slogan not a lived reality. \"This can't continue. Throughout our history, we've been at our best when we've been ambitious for working people. \"So today, my message to the government is simply this. \"Deliver the manifesto on which you won a huge majority last July. Deliver good jobs, decent public services and better living standards in every corner of the country. Deliver the change people voted for. \"And show working-class communities whose side you are on.\"  On the budget, which Labour MPs believe will be crucial to the government's hopes of recovery in its fortunes, Mr Nowak will declare: \"Introduce a windfall tax on record bank profits and gambling companies. And back it with new taxes on wealth. \"If billionaires can afford fleets of private yachts. Day trips into space. Weddings that shut down Venice - they can pay a bit more tax. \"Do what's best for those who go out to work, day in, day out, and still can't get by. Deliver the Employment Rights Bill and deliver it in full. \"And make it clear - a Labour government will never stand aside and watch a child's potential be wasted because of poverty. Lift the two-child cap, and give our kids the future they deserve.\"  And on the issue set to dominate this week's conference, workers' rights, Mr Nowak will say: \"The government has a manifesto promise to make work pay. \"Stronger rights at work are overwhelmingly popular with voters across the political spectrum. \"The public knows decent work is the best way to deliver the reset this country needs. \"The best way to improve living standards. \"And the best way to rebuild our communities hit hard by low pay and insecure work. \"So here is our challenge to government. \"Deliver that Employment Rights Bill in full and deliver the change you promised at the election.\" But the Tories' shadow business secretary Andrew Griffith, in a letter to Mr Kyle, claims the bill will be deeply damaging to economic growth and reduce living standards. \"Rather than proceed at this time with a measure which on the government's own impact assessment will reduce employment and growth, now is the time to put the national interest first,\" he wrote. \"Any credible 'reset' of this government requires that this bill be shelved and the government look afresh at measures to promote the growth and competitiveness of the UK economy.\""
    },
    {
        "title": "Death cap mushroom killer Erin Patterson jailed for minimum of 33 years",
        "description": "An Australian mother who murdered her estranged husband's parents and aunt by feeding them a beef wellington laced with poisonous mushrooms has been jailed for life with a minimum of 33 years.",
        "url": "https://news.sky.com/story/death-cap-mushroom-killer-erin-patterson-jailed-for-minimum-of-33-years-13418079",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mushroom-poisoner-erin-patterson_7000697.jpg?20250825072157",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-07 23:00:00",
        "Headline": "Erin Patterson, 50, lured her former parents-in-law Don and Gail Patterson, both 70, Gail Patterson's sister, Heather Wilkinson, 66, and her husband Reverend Ian Wilkinson to lunch at her home in Leongatha, Victoria, on 29 July 2023.",
        "Content": "An Australian mother who murdered her estranged husband's parents and aunt by feeding them a beef wellington laced with poisonous mushrooms has been jailed for life with a minimum of 33 years. Erin Patterson, 50, lured her former parents-in-law Don and Gail Patterson, both 70, and Gail Patterson's sister, Heather Wilkinson, 66, to lunch at her home in Leongatha, Victoria, on 29 July 2023. Mrs Wilkinson's husband, Reverend Ian Wilkinson, also ate the meal, which was served alongside mashed potatoes and green beans, but survived after receiving a liver transplant and spending months in hospital. Patterson, a mother-of-two, had made the pastry dish with deadly death cap mushrooms, also known as amanita phalloides. At the sentencing hearing at the Supreme Court of Victoria in Melbourne, Justice Christopher Beale said the substantial planning of the murders and Patterson's lack of remorse meant her sentence should be lengthy. \"The devastating impact of your crimes is not limited to your direct victims. Your crimes have harmed a great many people,\" he said. \"Not only did you cut short three lives and cause lasting damage to Ian Wilkinson's health, thereby devastating theextended Patterson and Wilkinson families, you inflicted untold suffering on your own children, whom you robbed of their beloved grandparents.\" Patterson's trial in Morwell, southern Australia, heard that she fabricated a cancer diagnosis to use as an excuse not to invite her children, pretending to want to discuss how to break the news to them after the meal. The four guests fell ill immediately after eating her food. Mrs Wilkinson and Mrs Patterson died on 4 August, and Mr Patterson a day later. Reverend Wilkinson spent seven weeks in hospital but survived. Read moreMore details of mushroom case revealed In his victim impact statement, he said the poisoned food meant he had to have a liver transplant and was left feeling \"half alive\". Patterson, who maintains her innocence and that she poisoned her victims by accident, also invited the father of her children, Simon Patterson, to the fatal meal. He declined the invitation. In his victim impact statement, Mr Patterson said of the couple's children: \"The grim reality is they live in an irreparably broken home with only a solo parent, when almost everyone else knows their mother murdered their grandparents.\" In July, Patterson was found guilty of murdering Don and Gail Patterson, and Heather Wilkinson, and attempting to murder Ian Wilkinson. The death cap is one of the most toxic mushrooms on the planet and is involved in the majority of fatal mushroom poisonings worldwide.  The species contains three main groups of toxins: amatoxins, phallotoxins, and virotoxins.  From these, amatoxins are primarily responsible for the toxic effects in humans.  The alpha-amanitin amatoxin has been found to cause protein deficit and ultimately cell death, although other mechanisms are thought to be involved.  The liver is the main organ that fails due to the poison, but other organs are also affected, most notably the kidneys.  The effects usually begin after a short latent period and can include gastrointestinal disorders followed by jaundice, seizures, coma, and eventually, death.  Previous poisoning attempts left husband ill Following the guilty verdicts, more details of the case were revealed. Mr Patterson said he had rejected the lunch invite \"out of fear\" as he believed his former partner had tried to poison him three times before. After they separated in 2015, he stopped eating any food she had prepared, having become seriously ill after meals cooked by her. Reverend Wilkinson also revealed he and the other three guests were served their food on large grey dinner plates, while Patterson served her portion on a smaller, tan-coloured plate. The nine-week trial attracted intense interest in Australia - with podcasters, journalists and documentary-makers descending on the town of Morwell, around two hours east of Melbourne, where the court hearings took place."
    },
    {
        "title": "Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack",
        "description": "Donald Trump has said he is ready to move to a second stage of sanctioning Russia, just hours after Moscow launched the largest arial attack of the war so far. ",
        "url": "https://news.sky.com/story/trump-says-hes-ready-to-move-to-second-stage-of-russia-sanctions-after-moscow-launches-large-aerial-attack-13426670",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ukraine-government_7013727.jpg?20250907163053",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-07 15:20:00",
        "Headline": "At least four people have been killed, including a mother and a three-month-old baby, with more than 40 others injured after Russia launched a bombardment of drones overnight.",
        "Content": " Donald Trump has said he is ready to move to a second stage of sanctioning Russia, just hours after Moscow launched the largest arial attack of the war so far.  At least four people have been killed, including a mother and a three-month-old baby, with more than 40 others injured, after Russia launched a bombardment of drones overnight. While on his way to the final of the US Open tennis tournament, the president was asked if he was ready to move to the second stage of punishment for Moscow, to which he replied, \"Yes\". It echoes US Treasury Secretary Scott Bessent, who said additional economic pressure by the United States and Europe could prompt Putin to enter peace talks with Ukraine. \"We are prepared to increase pressure on Russia, but we need our European partners to follow us,\" Treasury Secretary Scott told NBC News' Meet the Press. Sir Keir Starmer said the latest attack shows Vladimir Putin is \"not serious about peace\" as he joined other allies in condemning Russia's actions. The prime minister said the \"brutal\" and \"cowardly\" assault on Kyiv - which resulted in a government building catching fire - proved the Russian leader feels he can \"act with impunity\". Russia attacked Kyiv with 805 drones and decoys, officials said, and Ukraine shot down and neutralised 747 drones and four missiles, the country's air force has said. The attack caused a fire to break out at a key government building, with the sky above Kyiv covered in smoke. Appeasement makes 'no sense' Polish premier Donald Tusk said the latest military onslaught showed any \"attempts to appease\" Putin make \"no sense\". \"The US and Europe must together force Russia to accept an immediate ceasefire. We have all the instruments,\" Mr Tusk said on Saturday. Read more:Putin's warning to Western alliesWhy fears of an attack on Europe are not 'hysteria' Meanwhile the European Commission president, Ursula von der Leyen, said the Kremlin was \"mocking diplomacy\". Vladimir Putin reportedly wants control of the eastern Donetsk and Luhansk regions of Ukraine - known as the Donbas - as a condition for ending the war. Russia occupies around 19% of Ukraine, including Crimea and the parts of the Donbas region it seized before the full-scale invasion in February 2022. But this attack comes after European nations pressed the Russian leader to work to end the war at a virtual meeting of the \"coalition of the willing\" - a group of countries led by France and Britain seeking to help protect Kyiv in the event of a ceasefire. Some 26 of Ukraine's allies pledged to provide security guarantees as part of a \"reassurance force\" for the war-torn country once the fighting ends, Mr Macron has said. Ukrainian president Volodymyr Zelenskyy has said he is ready to meet Mr Putin to negotiate a peace agreement, and has urged US president Donald Trump to put punishing sanctions on Russia to push it to end the war. \"The world can force the Kremlin criminals to stop the killings - all that is needed is political will,\" he said on Sunday."
    },
    {
        "title": "Russia lands symbolic blow as largest aerial attack on Ukraine's capital shows Moscow's strategy",
        "description": "The smoke spiralling above Kyiv's Cabinet of Ministers building was a stark reminder of the brutal calculus underpinning Russia's war in Ukraine.",
        "url": "https://news.sky.com/story/russia-lands-symbolic-blow-as-largest-aerial-attack-on-ukraines-capital-shows-moscows-strategy-13426788",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kyiv-ukraine_7013234.jpg?20250907152731",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-09-07 18:15:00",
        "Headline": "Missiles, along with more than 800 drones and decoys, were launched overnight, illustrating that might, rather than negotiation, is still the main thrust of Vladimir Putin's approach.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  The smoke spiralling above Kyiv's Cabinet of Ministers building was a stark reminder of the brutal calculus underpinning Russia's war in Ukraine. For all the talk of diplomacy - including US President Donald Trump's faltering mediation efforts - Moscow's assault underscores a strategy focused on overwhelming force rather than negotiation. Ukrainian authorities report that this was the largest aerial attack on the capital since the full-scale invasion began, with more than 800 drones and decoys launched alongside missiles. The scale of the barrage suggests a deliberate Russian strategy; launching larger salvos to achieve critical mass, overwhelming Ukraine's air defences and striking deep into the heart of the government district. For the first time, a symbolic target, the building that houses the Cabinet of Ministers, has been hit, sending a clear message of intimidation. The human toll was immediate. Residents described being jolted awake by thunderous explosions. Firefighters and rescue workers navigated choking plumes of smoke to extract survivors, while outside, families clung to each other amid the devastation. \n                  Death cap mushroom killer Erin Patterson jailed for minimum of 33 years\n                 \n                  Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack\n                 \n                  Madeleine McCann case: Sky News tracks down woman at centre of hit-and-run theory investigated by police\n                 Western officials warn that Moscow's campaign continues to target civilian areas, a pattern that has defined its broader offensive since February 2022.  In Kyiv, the attack has amplified calls for international support. Ukraine's government is urging allies to supply more advanced weaponry to bolster air defences and protect the population. Read more on Sky News:Putin warns West over troopsTrump ready to move to second stage of Moscow punishmentWhy fears of an attack on Europe are not 'hysteria' Meanwhile, the United States has signalled plans for additional sanctions. For now, any end to the conflict seems far from near."
    },
    {
        "title": "Cheers and boos as Donald Trump arrives for delayed Sinner-Alcaraz US Open men's final ",
        "description": "The men's US Open final has been delayed by extra security measures as Donald Trump's arrival was met by cheers and boos from fans at Flushing Meadows.",
        "url": "https://news.sky.com/story/cheers-and-boos-as-donald-trump-arrives-for-delayed-sinner-alcaraz-us-open-mens-final-13426794",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-us-open-tennis_7013885.jpg?20250907193123",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-07 18:17:00",
        "Headline": "The match between Jannik Sinner and Carlos Alcaraz was pushed back by half an hour as increased security checks delayed spectators entering the arena.",
        "Content": " The men's US Open final has been delayed by extra security measures as Donald Trump's arrival was met by cheers and boos from fans at Flushing Meadows. The match between Jannik Sinner and Carlos Alcaraz, the world's top two players, was pushed back by half an hour in New York on Sunday before Alcaraz won three sets to one. The US president was greeted with a mix of cheers and boos from early arriving spectators when he waved from a suite at the Arthur Ashe Stadium about 45 minutes before the match began. Increased security checks at entrances to the grounds and to get into the arena building prompted the US Tennis Association to move the start time to 2.30pm, local time, instead of 2pm. Organisers said it was \"to ensure that fans have additional time to get to their seats.\" A spokesperson for the US Tennis Association said it \"was not a request made by the White House\". Despite the change, the 24,000-capacity arena was only about two-thirds full when the first point was played, while thousands of fans still were standing outside the court, waiting in line to enter. \n                  Death cap mushroom killer Erin Patterson jailed for minimum of 33 years\n                 \n                  Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack\n                 \n                  Russia lands symbolic blow as largest aerial attack on Ukraine's capital shows Moscow's strategy\n                 Mr Trump, who is the first sitting president to attend the tournament at Flushing Meadows since Bill Clinton in 2000, was booed again when he appeared for the National Anthem. Standing up and saluting, the president was shown briefly on the arena's big screens during the anthem, and offered a smirk that briefly made the boos louder. Read more on Sky News: 'Chipocalypse Now': Trump threatens US cityTrump orders 'take down' of 44-year-old peace vigilThe proxy war that will redefine public health in America Always a big celebrity draw, the final attracted, among others, Manchester City manager Pep Guardiola, former Vogue editor Anna Wintour, Hollywood stars Ben Stiller and Danny DeVito, director Spike Lee and basketball player Steph Curry."
    },
    {
        "title": "Japan's prime minister Shigeru Ishiba resigns",
        "description": "Japan's prime minister Shigeru Ishiba has resigned after pressure from within his Liberal Democratic Party (LDP) and the potential for a leadership vote against him.",
        "url": "https://news.sky.com/story/japans-prime-minister-shigeru-ishiba-resigns-13426477",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-shigeru-ishiba-japan_7013354.jpg?20250907112848",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-07 09:52:00",
        "Headline": "Support for the Liberal Democratic Party (LDP) has steadily eroded as it struggled to improve Japan's sluggish economic growth and contain consumer price rises that have fuelled growing discontent over squeezed earnings.",
        "Content": "Japan's prime minister Shigeru Ishiba has resigned after pressure from within his Liberal Democratic Party (LDP) and the potential for a leadership vote against him. Mr Ishiba, 68, who took office in October, had resisted demands - from mostly right-wing opponents within his own party for more than a month - to take responsibility for a historic defeat in July's parliamentary election. He has overseen three election defeats: in the upper house in July, local polls in June, as well as in the lower house in October, when his party was mired in a political donations scandal that forced his predecessor to resign. Support for his ruling coalition has also steadily eroded as his government struggled to improve Japan's sluggish economic growth and contain consumer price rises that fuelled growing discontent over squeezed earnings. Mr Ishiba announced his resignation at a news conference, one day before his party was to decide whether to hold an early leadership election which, if approved, would have effectively been a no-confidence motion against him. He said he would start a process to hold a party leadership vote to choose his replacement. His decision came after meeting agriculture minister Shinjiro Koizumi and his perceived mentor, former prime minister Yoshihide Suga, who apparently suggested Mr Ishiba's resignation ahead of Monday's vote. Mr Ishiba had previously insisted on staying on in the role, stressing the need to avoid a political vacuum at a time Japan faces big challenges, including US tariffs and their impact on the economy, rising prices, rice policy reforms and growing tensions in the region. In the upper house election in July, voters handed Mr Ishiba a resounding defeat. The LDP and its coalition partner Komeito lost their majority in the chamber. Many voters backed opposition groups, including the far-right Sanseito party, which had promised tax cuts and tighter controls on immigration, which has been blamed for depressing wages. Read more from Sky News:AI video of Mount Fuji eruptionHiroshima: 80 years after bombWoman conned by astronaut scam Mr Ishiba was initially seen as a figure popular with the public who could revive the LDP's standing when he was elevated to leader. But he had clashed with previous leaders within the party and his colleagues were not prepared to forgive him for the electoral defeats. The LDP and Komeito are now reliant on opposition support to stay in power, although opposition parties are too splintered to form a big enough coalition to topple the government."
    },
    {
        "title": "Internet access in Middle East and Asia disrupted after 'undersea cables cut'",
        "description": "Internet access in parts of Asia and the Middle East was disrupted after undersea cables were cut, experts have said.",
        "url": "https://news.sky.com/story/internet-access-in-middle-east-and-asia-disrupted-after-undersea-cables-cut-13426652",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-undersea-cables-underwater_7013657.jpg?20250907155357",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-07 14:51:00",
        "Headline": "Microsoft said in a status update that the Middle East \"may experience increased latency due to undersea fibre cuts in the Red Sea,\" but gave no other details.",
        "Content": "Internet access in parts of Asia and the Middle East was disrupted after undersea cables were cut, experts have said. The Middle East \"may experience increased latency due to undersea fibre cuts in the Red Sea,\" Microsoft said on its Azure status website. The tech giant gave no other details, but said internet traffic not moving through the region \"is not impacted\". NetBlocks, which monitors internet access, said \"a series of subsea cable outages in the Red Sea has degraded internet connectivity in multiple countries\", which it said included India and Pakistan. The firm blamed \"failures affecting the SMW4 and IMEWE cable systems near Jeddah, Saudi Arabia\". Posts on X included graphics showing a sharp drop in connectivity on Saturday. SMW4, the South East Asia/Middle East/Western Europe 4 cable is run by Tata Communications, part of the Indian conglomerate. IMEWE, or the India/Middle East/Western Europe cable, is run by another consortium overseen by Alcatel Submarine Networks. Neither firm has commented. Pakistan Telecommunications, a major telecommunication firm, said cuts had taken place in a statement issued on Saturday. Saudi Arabia did not acknowledge the disruption and authorities did not respond to a request for comment. In the United Arab Emirates, internet users on the country's state-owned Du and Etisalat networks complained of slower internet speeds but the government did not acknowledge the disruption. NetBlocks confirmed in a second post that the UAE had suffered \"slow speeds and intermittent access as engineers work to resolve the issue impacting multiple countries\". While the cause of the disruption has not been confirmed, there has been concern about Houthi rebels, based in neighbouring Yemen, targeting Red Sea cables. The insurgent group is engaged in a campaign against Israel to pressure it to end its war on Hamas in the Gaza Strip. In early 2024, Yemen's government-in-exile alleged that the Houthis planned to attack undersea cables in the Red Sea. Several were cut, but the Houthis denied being responsible. Undersea cables, as well as satellite connections and land-based cables, are one of the backbones of the internet. Service providers usually have multiple access points and reroute traffic if one fails, although it can slow access for users. Read more on Sky News:A different Zuckerberg sues MetaJapanese PM resignsLondon teen made a saint Anchors dropped from ships and dragged along the sea floor can cut cables, which can also be targeted in attacks and repairs can take weeks. "
    },
    {
        "title": "10 people injured, two in serious condition, after coach overturns in Catalonia",
        "description": "10 people are injured with two in a serious condition after a coach overturned in Catalonia, local reports say.",
        "url": "https://news.sky.com/story/10-people-injured-two-in-serious-condition-after-coach-overturns-in-catalonia-13426574",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-santa-susanna-catalonia_7013570.jpg?20250907145639",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-07 13:40:00",
        "Headline": "More than 50 people were reportedly on board the coach when it overturned in Santa Susanna, northeast of Barcelona.",
        "Content": "10 people are injured with two in a serious condition after a coach overturned in Catalonia, local reports say. The vehicle came off the C-32 in Santa Susanna, 33 miles (53km) northeast of Barcelona, according to SEM (Sistema d'Emergències Mèdiques), the public health emergency system operated by the Catalan government. A post on X said eight ambulances, two helicopters and several fire crews were deployed to the scene on Sunday. SEM wrote that 53 people were on board the coach when it overturned, and those hurt had been transferred to local hospitals. It added that two people were in a serious condition, although no further details were released about the passengers or their injuries. Pictures posted on X by the fire department of Catalonia showed fire crews inside the overturned coach. The department posted that the overturned coach had been stabilised and a clear-up operation was underway. \n                  Can Lamine Yamal handle the heat of stardom?\n                 \n                  Lamine Yamal: Disability rights group threatens legal action after people with dwarfism reportedly hired for star's birthday party\n                 \n                  Anti-tourism protests break out in Spain, Italy and Portugal\n                 It added that the coach company had sent another vehicle to the scene to pick up the uninjured passengers. SEM said passengers had been transferred to a local leisure centre in nearby Pineda de Mar, where \"psychological support\" was being offered. Fire crews said most of the passengers had been able to leave the overturned coach themselves and had climbed up the embankment to safety. The C-32 highway was shut while emergency teams attended the scene, although the Catalan Transit Service said one lane had reopened."
    },
    {
        "title": "Cheers and boos as Donald Trump arrives for delayed Sinner-Alcaraz US Open men's final ",
        "description": "The men's US Open final has been delayed by extra security measures as Donald Trump's arrival was met by cheers and boos from fans at Flushing Meadows.",
        "url": "https://news.sky.com/story/cheers-and-boos-as-donald-trump-arrives-for-delayed-sinner-alcaraz-us-open-mens-final-13426794",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-us-open-tennis_7013885.jpg?20250907193123",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-07 18:17:00",
        "Headline": "The match between Jannik Sinner and Carlos Alcaraz was pushed back by half an hour as increased security checks delayed spectators entering the arena.",
        "Content": " The men's US Open final has been delayed by extra security measures as Donald Trump's arrival was met by cheers and boos from fans at Flushing Meadows. The match between Jannik Sinner and Carlos Alcaraz, the world's top two players, was pushed back by half an hour in New York on Sunday before Alcaraz won three sets to one. The US president was greeted with a mix of cheers and boos from early arriving spectators when he waved from a suite at the Arthur Ashe Stadium about 45 minutes before the match began. Increased security checks at entrances to the grounds and to get into the arena building prompted the US Tennis Association to move the start time to 2.30pm, local time, instead of 2pm. Organisers said it was \"to ensure that fans have additional time to get to their seats.\" A spokesperson for the US Tennis Association said it \"was not a request made by the White House\". Despite the change, the 24,000-capacity arena was only about two-thirds full when the first point was played, while thousands of fans still were standing outside the court, waiting in line to enter. \n                  Death cap mushroom killer Erin Patterson jailed for minimum of 33 years\n                 \n                  Trump says he's ready to move to second stage of Russia sanctions after Moscow launches large aerial attack\n                 \n                  Russia lands symbolic blow as largest aerial attack on Ukraine's capital shows Moscow's strategy\n                 Mr Trump, who is the first sitting president to attend the tournament at Flushing Meadows since Bill Clinton in 2000, was booed again when he appeared for the National Anthem. Standing up and saluting, the president was shown briefly on the arena's big screens during the anthem, and offered a smirk that briefly made the boos louder. Read more on Sky News: 'Chipocalypse Now': Trump threatens US cityTrump orders 'take down' of 44-year-old peace vigilThe proxy war that will redefine public health in America Always a big celebrity draw, the final attracted, among others, Manchester City manager Pep Guardiola, former Vogue editor Anna Wintour, Hollywood stars Ben Stiller and Danny DeVito, director Spike Lee and basketball player Steph Curry."
    },
    {
        "title": "'Chipocalypse Now': Trump threatens 'war' on Chicago in immigration crackdown",
        "description": "Donald Trump has signalled his intention to send troops to Chicago to ramp up the deportation of illegal immigrants - by posting an AI-generated parody image from Apocalypse Now on social media.",
        "url": "https://news.sky.com/story/chipocalypse-now-trump-threatens-war-on-chicago-in-immigration-crackdown-13426413",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-truth-social_7013248.png?20250907145837",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-07 05:45:00",
        "Headline": "Donald Trump alludes to immigration raids in Chicago in an Apocalypse Now-themed Truth Social post.",
        "Content": "Donald Trump has signalled his intention to send troops to Chicago to ramp up the deportation of illegal immigrants - by posting an AI-generated parody image from Apocalypse Now on social media. There were protests in the city, the largest in Illinois, on Saturday night, with thousands of people marching past Trump Tower to demonstrate against possible immigration raids. That came as the US president ramped up his threats to deploy federal authorities and military personnel in Chicago, as he has done in Los Angeles and Washington DC. In a post on Truth Social, Mr Trump shared an AI-generated image of himself as a military officer in the movie Apocalypse Now, with the title changed to \"Chipocalypse Now\" over flames and the city skyline. The post - a screenshot from X - said: \"'I love the smell of deportations in the morning...'. Chicago about to find out why it's called the Department of WAR.\"   Mr Trump signed an executive order on Friday to rename the Pentagon as the Department of War. \"The President of the United States is threatening to go to war with an American city. This is not a joke,\" Illinois Governor JB Pritzker, a Democrat, wrote in a post on X, responding to Mr Trump's post. \"This is not normal. Donald Trump isn't a strongman, he's a scared man. Illinois won't be intimidated by a wannabe dictator.\" Mr Pritzker previously said that he believed Immigration and Customs Enforcement (ICE) raids would coincide with Mexican Independence Day festivals scheduled for this weekend and next weekend. Some Mexican festivals in the Chicago area were postponed or cancelled over the threatened stings.  A military deployment in Chicago has long been reported. Last month, the Pentagon was said to be drafting plans to send the US Army to Illinois. In a statement responding to that report, originally from The Washington Post, Mr Pritzker said the state had \"made no requests for federal intervention\" and accused Mr Trump of \"attempting to manufacture a crisis\". Vice president JD Vance said on Wednesday that there were \"no immediate plans\" to send the National Guard to Chicago. Read more from Sky News:Trump orders 'take down' of 44-year-old peace vigilFormer President Biden has skin cancer surgeryThe proxy war that will redefine public health in America ICE arrests 475 Hyundai workers On Thursday, ICE agents carried out a raid at a Hyundai car battery plant in Georgia, saying 475 people, mostly South Koreans, were found to be illegally working there. It marked the largest single-site enforcement operation in the history of the Department of Homeland Security, which includes ICE. The day after the raid, ICE posted a video and photos of workers shackled at the wrists, waist and ankles getting on a bus. South Korean junior foreign minister Park Yoon-joo told a US government official in a phone call that the video release was regrettable. Seoul's foreign ministry added the post came \"at a critical time, when the momentum of trust and cooperation\" between the two countries, forged through their first summit, \"must be maintained\"."
    },
    {
        "title": "Staveley forced to clarify Spurs bid intention after Levy exit",
        "description": "Amanda Staveley, the former Newcastle United Football Club joint-owner, will on Monday be forced to clarify her interest in bidding for Premier League club Tottenham Hotspur following veteran chairman Daniel Levy's unexpected departure last week.",
        "url": "https://news.sky.com/story/staveley-forced-to-clarify-spurs-bid-intention-after-levy-exit-13426785",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-amanda-staveley_7013892.jpg?20250907194504",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-07 18:13:00",
        "Headline": "Amanda Staveley’s privately held vehicle will issue a statement to the stock market amid speculation in the wake of Daniel Levy’s exit as Tottenham Hotspur chairman, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Amanda Staveley, the former Newcastle United Football Club joint-owner, will on Monday be forced to clarify her interest in bidding for Premier League club Tottenham Hotspur following veteran chairman Daniel Levy's unexpected departure last week. Sky News has learnt that PCP International Finance, a vehicle controlled by Ms Staveley, is expected to issue a statement following discussions with the UK takeover watchdog saying that she does not intend to make a formal offer for Spurs. People close to the situation said on Sunday that Ms Staveley had been in discussions with prospective backers of a bid for the club in recent weeks. Spurs' ownership is complicated by the fact that it is subject to the UK Takeover Code - governed by the Takeover Panel. Under the provisions in the Code, PCP could yet return with a formal takeover bid for Spurs if invited to do so by the board of Enic, or if a rival bidder announces its intention to make a firms offer for last season's Europa League winners. City sources pointed to these caveats as being particularly relevant to Ms Staveley's potential ongoing interest in Spurs. Enic owns a stake of nearly 87% in the club, with the remaining shares owned by a group of minority investors. \n                  Unions demand no retreat on workers' rights after Rayner quits\n                 \n                  France on brink of economic and political crisis as PM looks set to lose confidence vote\n                 \n                  Tube strikes: Full list of dates and lines affected in September walkout\n                 Mr Levy reportedly owns a stake of almost 30% in Enic, while Joe Lewis, Enic's majority-owner, transferred control of his stake in Spurs to his family trust in 2022. A source close to the Lewis family said on Sunday evening: \"The club is not for sale.\" His exit last week after nearly 25 years as Tottenham chairman was apparently driven by a desire to inject fresh momentum into the leadership of the club. In a statement last week, it said: \"Tottenham Hotspur has been transformed over the last quarter of a century. \"It has played in European competitions in the last 18 of 20 seasons, becoming one of the world's most recognised football clubs, consistently investing in its academy, players and facilities, including a new, world-class stadium and state of the art training centre.\" Rothschild, the investment bank, had previously been engaged by Mr Levy to raise hundreds of millions of capital to invest in Spurs. Those discussions are understood to have involved a range of parties in the past year. Any takeover bid for Spurs, regardless of the identity of the bidder, would be likely to value at well in excess of £3.5bn for it to be deemed acceptable. A spokesman for Ms Staveley declined to comment on Sunday evening."
    },
    {
        "title": "Lloyds closes in on £120m takeover of fintech Curve",
        "description": "Britain's biggest high street lender is closing in on a deal to buy Curve, a provider of digital wallet technology that its new owner hopes will give it an edge in the race to build smarter online payments systems.",
        "url": "https://news.sky.com/story/lloyds-closes-in-on-163120m-takeover-of-fintech-curve-13426450",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lloyds-bank-money_6963171.jpg?20250712090927",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-07 08:21:00",
        "Headline": "Britain's biggest high street bank network could announce the acquisition of a company once-feted as one of the country's hottest fintech start-ups as soon as this week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest high street lender is closing in on a deal to buy Curve, a provider of digital wallet technology that its new owner hopes will give it an edge in the race to build smarter online payments systems. Sky News has learnt that Lloyds Banking Group could announce the acquisition of Curve for about £120m as soon as this week. City sources said this weekend that the terms of a transaction had been agreed, although a formal announcement could yet slip to later in the month. Lloyds has been in talks with Curve about a takeover for some time, with Sky News revealing that discussions were taking place in July. The financial services giant, which owns the Halifax brand and operates the biggest bank branch network in the UK, believes Curve's digital wallet platform will be a valuable asset amid growing regulatory pressure on Apple to open its payment services to rivals. Curve was founded by Shachar Bialick, a former Israeli special forces soldier, in 2016, and was hailed as one of Britain's most promising fintechs. Three years later, Mr Bialick told an interviewer: \"In 10 years' time we are going to be IPOed [listed on the public equity markets]... and hopefully worth around $50bn to $60bn.\" \n                  Staveley forced to clarify Spurs bid intention after Levy exit\n                 \n                  Unions demand no retreat on workers' rights after Rayner quits\n                 \n                  France on brink of economic and political crisis as PM looks set to lose confidence vote\n                 The sale price may therefore be a disappointment to long-standing Curve shareholders, given that it raised £133m in its Series C funding round, which concluded in 2023. That round included backing from Britannia, IDC Ventures, Cercano Management - the venture arm of Microsoft co-founder Paul Allen's estate - and Outward VC. Curve was also reported to have raised more than £40m last year, while reducing employee numbers and suspending its US expansion. In total, the company has raised more than £200m in equity since it was founded. Curve is being advised by KBW, part of the investment bank Stifel, on the discussions with Lloyds. The company is chaired by the City grandee Lord Fink, who is also a shareholder in the company. Curve has been positioned as a rival to Apple Pay in recent years, having initially launched as an app enabling consumers to combine their debit and credit cards in a single wallet. Lloyds is said to have identified Curve as a strategically attractive bid target as it pushes deeper into payments infrastructure under chief executive Charlie Nunn. In March, the Financial Conduct Authority and Payment Systems Regulator began working with the Competition and Markets Authority to examine the implications of the growth of digital wallets owned by Apple and Google. Lloyds owns stakes in a number of fintechs, including the banking-as-a-service platform Thought Machine, but has set expanding its tech capabilities as a key strategic objective. The group employs more than 70,000 people and operates more than 700 branches across Britain. Curve is chaired by Lord Fink, the former Man Group chief executive who has become a prolific investor in British technology start-ups. Read more from Sky News:Unions demand no retreat on workers' rightsTube strikes: Everything you need to know  When he was appointed to the role in January, he said: \"Working alongside Curve as an investor, I have had a ringside seat to the company's unassailable and well-earned rise. \"Beginning as a card which combines all your cards into one, to the all-encompassing digital wallet it has evolved into, Curve offers a transformative financial management experience to its users. \"I am proud to have been part of the journey so far, and welcome the chance to support the company through its next, very significant period of growth.\" IDC Ventures, one of the investors in Curve's Series C funding round, said at the time of its last major fundraising: \"Thanks to their unique technology… they have the capability to intercept the transaction and supercharge the customer experience, with its Double Dip Rewards, [and] eliminating nasty hidden fees. \"And they do it seamlessly, without any need for the customer to change the cards they pay with.\" News of the talks between Lloyds and Curve comes days before Rachel Reeves, the chancellor, is expected to outline plans to bolster Britain's fintech sector by endorsing a concierge service to match start-ups with investors. Lloyds declined to comment, while Curve has been contacted for comment."
    },
    {
        "title": "Unite boss Sharon Graham criticises Starmer and Labour as she warns party's key backer may end support",
        "description": "Trade union firebrand Sharon Graham has told Sky News Sir Keir Starmer only has a year to recover from Labour's disastrous slump and said her union, Unite, may stop bankrolling the party if it doesn't start backing workers.",
        "url": "https://news.sky.com/story/unite-boss-sharon-graham-criticises-starmer-and-labour-as-she-warns-partys-key-backer-may-end-support-13426739",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-graham_7013840.png?20250907181012",
        "type": "Business",
        "Author": "Jon Craig",
        "Date Published": "2025-09-07 16:36:00",
        "Headline": "Ms Graham, whose union hands £1.4m a year to the party, took aim at the government's approach to employment rights, zero-hours contracts and cuts to winter fuel payments, warning that her members would \"feel duped unless Labour stuck to its manifesto promises\". ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Trade union firebrand Sharon Graham has told Sky News Sir Keir Starmer only has a year to recover from Labour's disastrous slump and said her union, Unite, may stop bankrolling the party if it doesn't start backing workers. Speaking to Sky News as the TUC conference began in Brighton, the Unite leader said parts of the government's workers' rights legislation were now a \"burnt-out shell\" and her members would feel duped unless Labour stuck to its manifesto promises. In recent years, Unite has been one of Labour 's biggest backers, handing its previous leader, Jeremy Corbyn around £3m to fight the 2019 general election under Ms Graham's left-wing predecessor, \"Red Len\" McCluskey. Since succeeding Mr McCluskey in 2021, Ms Graham has said there will be no \"blank cheque\" for the party, yet the union's affiliation fees to Labour are currently £1.4 million a year. In a thinly-veiled threat to stop bankrolling Labour, she told Sky News: \"What they need to do is to be Labour. People were crying for them to get in, wanting them to get in. I wanted them to get in, but they're not doing the things we thought they would do. \"Winter fuel [payments], how did that happen? They're not backing workers. Grangemouth and Lindsey [oil] refineries look like they're going to close. Not backing council workers, cost of living crisis, a 38% increase in food since 2021. People need Labour to be Labour so they can relieve the pressure that's on them. \"We are affiliated to Labour, but it's harder and harder to justify that if they're not backing workers. We're a trade union. I am general secretary of a trade union that backs workers. I expect Labour to back workers. \"If they don't, then our members will make the decision. It's them who make the decisions and they may decide not to be affiliated to Labour for that reason.\" Condemning changes to the Employment Rights Bill, Ms Graham said: \"What the government has done is amend its own legislation. They've done their own amendment to make it easier to fire and rehire council workers and public sector workers. \"And so for me, there is no ban. And that is a huge watering down of what they said they would do. If they keep chipping away themselves and allow others to chip it away, it's going to be something that's not worth the paper that it's written on. \"We need to go back to what we said we would do, which was to put in some clear employment rights for workers to give them a better deal at work. If they don't do that, then workers are going to feel duped.  \"We were told there would be a ban on fire and rehire. We've been told there will be a ban on zero-hour contracts. Those two things are not true. What the government needs to do is to put this bill back where it was to make sure that it's worth something, that it's not a paper tiger in the end.\" Claiming the prime minister has a year to get his policies right or lose votes to Nigel Farage's Reform UK, Ms Graham said: \"Already some of the damage is done from when the winter fuel cuts came in. Some people will not forgive them for that. \"But when you've got council workers either losing their jobs or having their pay pushed down, they're looking at Labour and saying 'What are you doing?' They're not going to hold on forever. They will turn somewhere else unless Labour do something differently. \"What they need to do is deliver for workers, because that's what they promised. We're affiliated to Labour because they're supposed to be the voice of workers. That's what we're asking them to do. Stop shilly-shallying.\" Read more on Sky News:Almost 900 arrested at Palestine demoFarage admits house mistake In July, Unite members voted at a conference to suspend Angela Rayner's membership over her role in the Birmingham bin strike row when she was housing and local government secretary. Asked about her resignation from government and as Labour deputy leader, Ms Graham said: \"Angela was in charge of the department when we've had this debacle about Birmingham City Council workers who were losing up to £8,000 a year in pay. \"Why are workers in councils paying for [the] incompetence of councils and council debt? It's not acceptable.\" And asked to name her preferred candidate for deputy leader, she said: \"I've been around long enough to know it's not what people say, it's what they do. I'm going to be looking very much at their track record. Have they backed workers? That's what I'll be looking for.\""
    },
    {
        "title": "Labour 'failing to deliver change that people voted for' - TUC chief",
        "description": "The leader of Britain's trade unions is to accuse Sir Keir Starmer of failing to deliver the change Labour promised during the election campaign last year.",
        "url": "https://news.sky.com/story/labour-failing-to-deliver-change-that-people-voted-for-tuc-chief-13426927",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paul-nowak-tuc-labour_7010526.jpg?20250903202337",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-07 23:01:00",
        "Headline": "After a troubled first year in government that has seen Labour lose support to Reform UK, general secretary Paul Nowak will warn the lack of change cannot continue and the government must deliver on jobs, public services and living standards.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  The leader of Britain's trade unions is to accuse Sir Keir Starmer of failing to deliver the change Labour promised during the election campaign last year. In his keynote speech at the TUC conference in Brighton, general secretary Paul Nowak will claim that for too many people change still feels like a slogan, not a reality. After a troubled first year in government that has seen Labour lose support to Reform UK, Mr Nowak will warn the lack of change cannot continue and the government must deliver on jobs, public services and living standards. And he will claim Rachel Reeves' budget on 26 November must include windfall taxes on bank profits and gambling companies, a wealth tax on millionaires and the lifting of the two-child benefit cap introduced by George Osborne during the coalition government. Mr Nowak's speech comes just days after the unions lost their champion in cabinet, Angela Rayner, prompting fears among delegates in Brighton that the government is poised to weaken its flagship legislation on workers' rights. The Conservatives have responded to Ms Rayner's demise by writing to the new business and trade secretary, Peter Kyle, calling on him to scrap the Employment Rights Bill, claiming it will reduce jobs and mean more red tape and bureaucracy. But Labour is losing support to Nigel Farage's party, not the Tories, and will also - potentially - to left-wing parties in future. And in an unusual move, the new left-wing leader of the Green Party, Zack Polanski, will also address the TUC later. \n                  Unions demand no retreat on workers' rights after Rayner quits\n                 \n                  Tax the rich to thwart Reform, TUC chief urges Labour\n                 \n                  Retired women effectively without a pension for four months a year due to gender gap, research finds\n                 Read more:Unite boss warns Labour's key backer may end supportUnions demand no retreat on workers' rights after Rayner quitsWithout Angela Rayner 'there will be no holding back' Labour's left wing Labour's election manifesto last year showed a black and white photo of a shirt-sleeved Sir Keir on the front cover with the single word \"Change\" in red. In his attack on the government's first year in office, Mr Nowak will say: \"The Tories took Britain to the brink. That's why last July, the government was elected on a manifesto that promised change. \"But we have to be honest - for too many people, change still feels like a slogan not a lived reality. \"This can't continue. Throughout our history, we've been at our best when we've been ambitious for working people. \"So today, my message to the government is simply this. \"Deliver the manifesto on which you won a huge majority last July. Deliver good jobs, decent public services and better living standards in every corner of the country. Deliver the change people voted for. \"And show working-class communities whose side you are on.\"  On the budget, which Labour MPs believe will be crucial to the government's hopes of recovery in its fortunes, Mr Nowak will declare: \"Introduce a windfall tax on record bank profits and gambling companies. And back it with new taxes on wealth. \"If billionaires can afford fleets of private yachts. Day trips into space. Weddings that shut down Venice - they can pay a bit more tax. \"Do what's best for those who go out to work, day in, day out, and still can't get by. Deliver the Employment Rights Bill and deliver it in full. \"And make it clear - a Labour government will never stand aside and watch a child's potential be wasted because of poverty. Lift the two-child cap, and give our kids the future they deserve.\"  And on the issue set to dominate this week's conference, workers' rights, Mr Nowak will say: \"The government has a manifesto promise to make work pay. \"Stronger rights at work are overwhelmingly popular with voters across the political spectrum. \"The public knows decent work is the best way to deliver the reset this country needs. \"The best way to improve living standards. \"And the best way to rebuild our communities hit hard by low pay and insecure work. \"So here is our challenge to government. \"Deliver that Employment Rights Bill in full and deliver the change you promised at the election.\" But the Tories' shadow business secretary Andrew Griffith, in a letter to Mr Kyle, claims the bill will be deeply damaging to economic growth and reduce living standards. \"Rather than proceed at this time with a measure which on the government's own impact assessment will reduce employment and growth, now is the time to put the national interest first,\" he wrote. \"Any credible 'reset' of this government requires that this bill be shelved and the government look afresh at measures to promote the growth and competitiveness of the UK economy.\""
    },
    {
        "title": "New home secretary to host talks on people smuggling as small-boat crossings hits 30,000",
        "description": "The new home secretary will host talks on how to stop people smuggling in her first major engagement in the role. ",
        "url": "https://news.sky.com/story/new-home-secretary-to-host-talks-on-people-smuggling-in-first-major-job-engagement-13426775",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-shabana-mahmood_7013937.jpg?20250907203347",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-07 17:55:00",
        "Headline": "The security alliance, hosted by Shabana Mahmood, comes after an estimated 1,000 people arrived by small boat in Britain over the course of a single day.",
        "Content": "The new home secretary will host talks on how to stop people smuggling in her first major engagement in the role.  Shabana Mahmood will host the so-called Five Eyes security alliance, holding talks between counterparts from the US, Australia, Canada and New Zealand. The security alliance discussion comes after an estimated 1,000 people arrived by small boat in Britain over the course of a single day, with French authorities saying 24 people were rescued while trying to cross the English Channel. Ms Mahmood said the numbers, which take the yearly total to more than 30,000 in record time, were \"utterly unacceptable\" and that she expected migrant returns under a deal agreed last month with France to begin \"imminently\". She was promoted into the role Friday during a dramatic reshuffle of Keir Starmer's top team, which followed in the wake of Angela Rayner's resignation over her tax affairs. Politics latest: 'One of the worst PMs in history' Sir Keir will now be hoping to draw a line under the fallout of his former deputy's departure, as well as a summer dominated by criticism of his government's handling of the small boats crisis. Ms Mahmood said the Five Eyes intelligence sharing pact would \"agree new measures to protect our border\". The group will also discuss new measures to tackle child sexual abuse online, as well as the spread of deadly synthetic opioids, the Home Office said. Ms Mahmood said: \"Rebuilding our reputation on the world stage is how we tackle serious organised crime and secure our borders.\" Read more from Sky News:Military sites could house migrantsRayner's rise to deputy PM \"The Five Eyes might be drawn from different corners of the globe, but we are united by our alliance,\" she added. \"As the security threats we all face become more complex and span continents, we are stronger and safer together.\" She will be joined at the talks by US secretary of homeland security Kristi Noem, Canadian public safety minister Gary Anandasangaree, Australian home affairs minister Tony Burke and New Zealand minister Judith Collins.  The Prime Minister has told his new ministers to \"go up a gear\" in delivering on Labour's agenda, part of which now involves a toughened immigration policy as he faces pressure in the polls from Nigel Farage's Reform UK. In Ms Mahmood's first full day in the job, she met the head of Scotland Yard to receive a briefing on the policing operation in response to protests in London. \"Supporting Palestine and supporting a proscribed terrorist group are not the same thing,\" she said. \"An honour to visit Sir Mark (Rowley) and the Metropolitan Police to see them at work policing protests yesterday.\" Almost 900 people were arrested in central London at a protest against the banning of Palestine Action."
    },
    {
        "title": "Without Angela Rayner 'there will be no holding back' Labour's left wing",
        "description": "In the wake of Angela Rayner's departure, Number 10 has carried out a swift and drama-free reshuffle that is all about delivery, but they shouldn't congratulate themselves too soon.",
        "url": "https://news.sky.com/story/without-angela-rayner-there-will-be-no-holding-back-labours-left-wing-13426548",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-angela-rayner-keir-starmer_7012045.jpg?20250907143344",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-09-07 12:49:00",
        "Headline": "Political forces that have been threatening to destabilise the entire Starmer project are about to be unleashed as Labour heads towards a potentially drawn-out and damaging deputy leadership contest.",
        "Content": "\n          Political correspondent\n              @wizbates\n In the wake of Angela Rayner's departure, Number 10 has carried out a swift and drama-free reshuffle that is all about delivery, but they shouldn't congratulate themselves too soon. While they focus on pragmatism, political forces that have been threatening to destabilise the entire Starmer project are about to be unleashed. Firstly, the Labour party itself, which has always been an unwieldy beast, is getting ready to bite. Politics latest: Reform's withering verdict on Johnson With Rayner's exit, Number 10 has lost its working-class human shield, its bridge between the party and the prime minister, and the northern woman who made its pale, male leader more palatable to a sizable section of the movement. Any dwindling loyalty from the left was largely linked to her and, in her absence, there will be no holding back.  And for Sir Keir's critics, they have the perfect vehicle to air their grievances - a potentially drawn-out and damaging deputy leadership contest, which could easily overshadow the forthcoming conference. All of which will prompt a weary electorate to wonder if this really is a whole new public-facing Labour party or if the relentless infighting was simply paused while they secured power. This takes us to the next big obstacle of the local elections in May which, as things stand, will see them hammered from all sides. Much has been made of the Reform surge, but in reality the threat surrounds them, with the Greens likely to take big chunks of their support and the independent Muslim vote also threatening to eat into some of their most reliable heartlands, not to mention Jeremy Corbyn's new political project, which will make plenty of noise if nothing else. 👉 Listen to Electoral Dysfunction on your podcast app 👈 Read more from Sky News:Unions react after Rayner quitsMilitary sites could house migrantsRayner's rise to deputy PM This could push them from slightly unstable into some very serious soul searching, as the next general election edges closer and the record number of MPs with slim majorities get increasingly jittery. It is at that potentially precarious moment that the prime minister will need a figure like Rayner and find that he doesn't have one. At that point, the pragmatism over politics approach that has defined this reshuffle might not feel that smart after all."
    },
    {
        "title": "Unite boss Sharon Graham criticises Starmer and Labour as she warns party's key backer may end support",
        "description": "Trade union firebrand Sharon Graham has told Sky News Sir Keir Starmer only has a year to recover from Labour's disastrous slump and said her union, Unite, may stop bankrolling the party if it doesn't start backing workers.",
        "url": "https://news.sky.com/story/unite-boss-sharon-graham-criticises-starmer-and-labour-as-she-warns-partys-key-backer-may-end-support-13426739",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sharon-graham_7013840.png?20250907181012",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-07 16:36:00",
        "Headline": "Ms Graham, whose union hands £1.4m a year to the party, took aim at the government's approach to employment rights, zero-hours contracts and cuts to winter fuel payments, warning that her members would \"feel duped unless Labour stuck to its manifesto promises\". ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Trade union firebrand Sharon Graham has told Sky News Sir Keir Starmer only has a year to recover from Labour's disastrous slump and said her union, Unite, may stop bankrolling the party if it doesn't start backing workers. Speaking to Sky News as the TUC conference began in Brighton, the Unite leader said parts of the government's workers' rights legislation were now a \"burnt-out shell\" and her members would feel duped unless Labour stuck to its manifesto promises. In recent years, Unite has been one of Labour 's biggest backers, handing its previous leader, Jeremy Corbyn around £3m to fight the 2019 general election under Ms Graham's left-wing predecessor, \"Red Len\" McCluskey. Since succeeding Mr McCluskey in 2021, Ms Graham has said there will be no \"blank cheque\" for the party, yet the union's affiliation fees to Labour are currently £1.4 million a year. In a thinly-veiled threat to stop bankrolling Labour, she told Sky News: \"What they need to do is to be Labour. People were crying for them to get in, wanting them to get in. I wanted them to get in, but they're not doing the things we thought they would do. \"Winter fuel [payments], how did that happen? They're not backing workers. Grangemouth and Lindsey [oil] refineries look like they're going to close. Not backing council workers, cost of living crisis, a 38% increase in food since 2021. People need Labour to be Labour so they can relieve the pressure that's on them. \"We are affiliated to Labour, but it's harder and harder to justify that if they're not backing workers. We're a trade union. I am general secretary of a trade union that backs workers. I expect Labour to back workers. \"If they don't, then our members will make the decision. It's them who make the decisions and they may decide not to be affiliated to Labour for that reason.\" Condemning changes to the Employment Rights Bill, Ms Graham said: \"What the government has done is amend its own legislation. They've done their own amendment to make it easier to fire and rehire council workers and public sector workers. \"And so for me, there is no ban. And that is a huge watering down of what they said they would do. If they keep chipping away themselves and allow others to chip it away, it's going to be something that's not worth the paper that it's written on. \"We need to go back to what we said we would do, which was to put in some clear employment rights for workers to give them a better deal at work. If they don't do that, then workers are going to feel duped.  \"We were told there would be a ban on fire and rehire. We've been told there will be a ban on zero-hour contracts. Those two things are not true. What the government needs to do is to put this bill back where it was to make sure that it's worth something, that it's not a paper tiger in the end.\" Claiming the prime minister has a year to get his policies right or lose votes to Nigel Farage's Reform UK, Ms Graham said: \"Already some of the damage is done from when the winter fuel cuts came in. Some people will not forgive them for that. \"But when you've got council workers either losing their jobs or having their pay pushed down, they're looking at Labour and saying 'What are you doing?' They're not going to hold on forever. They will turn somewhere else unless Labour do something differently. \"What they need to do is deliver for workers, because that's what they promised. We're affiliated to Labour because they're supposed to be the voice of workers. That's what we're asking them to do. Stop shilly-shallying.\" Read more on Sky News:Almost 900 arrested at Palestine demoFarage admits house mistake In July, Unite members voted at a conference to suspend Angela Rayner's membership over her role in the Birmingham bin strike row when she was housing and local government secretary. Asked about her resignation from government and as Labour deputy leader, Ms Graham said: \"Angela was in charge of the department when we've had this debacle about Birmingham City Council workers who were losing up to £8,000 a year in pay. \"Why are workers in councils paying for [the] incompetence of councils and council debt? It's not acceptable.\" And asked to name her preferred candidate for deputy leader, she said: \"I've been around long enough to know it's not what people say, it's what they do. I'm going to be looking very much at their track record. Have they backed workers? That's what I'll be looking for.\""
    },
    {
        "title": "Labour consider using military barracks to house small boat migrants - as almost 1,100 arrive in one day",
        "description": "Defence Secretary John Healey has told Sky News the government is considering using military barracks to house asylum seekers, as 1,097 people arrived in the UK on small boats on Saturday.",
        "url": "https://news.sky.com/story/labour-considering-using-military-barracks-to-house-asylum-seekers-13426406",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-france-gravelines-coast-guard_6966790.jpg?20250805144234",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-07 03:46:00",
        "Headline": "Following widespread protests over asylum seekers in hotels, Defence Secretary John Healey tells Sky News that Labour is \"looking really hard\" at the potential use of military sites to house migrants while their asylum applications are assessed.",
        "Content": " Defence Secretary John Healey has told Sky News the government is considering using military barracks to house asylum seekers, as 1,097 people arrived in the UK on small boats on Saturday. \"We are looking at the potential use of military and non-military sites for temporary accommodation for the people who come across on these small boats that may not have a right to be here,\" he told Sunday Morning With Trevor Phillips. \"I'm looking really hard at it. I'm looking at it with the Home Office, and I recognise that the loss of confidence of the public over recent years in Britain's ability to control its borders needs to be satisfied. And we have to deal with this problem with the small boats,\" Mr Healey added. Politics latest: Labour considers housing migrants on military sites The measure follows widespread protests this summer over housing migrants in hotels. Two former military sites - MDP Wethersfield, a former RAF base in Essex, and Napier Barracks, a former military base in Kent - are already used to house a small number of asylum seekers. Fresh small boat arrivals were spotted on Sunday, as Home Office figures showed 1,097 people arrived on Saturday - when French authorities said 24 people were rescued while trying to cross the Channel. \n                  Revealed: Huge rise in protests being dealt with by police\n                 \n                  Ex-asylum seeker wants government to deport him to Somalia because it's 'safer' than Nuneaton\n                 \n                  Reform took advantage of the PM's holiday - and it's clear he's now changed strategy\n                 The figures come after a lull in crossings. In the previous seven days (30 August to 5 September) the Home Office recorded no small boat arrivals. Home Secretary Shabana Mahmood called the small boats crossings \"utterly unacceptable\" and accused the \"vile\" people smugglers of \"wreaking havoc on our borders\". She said that, thanks to the UK's deal with France, those arriving in small boats \"can now be detained and removed to France and I expect the first returns to take place imminently. \"Protecting the UK border is my priority as home secretary and I will explore all options to restore order to our immigration system.\" Zia Yusuf, head of policy at Reform UK, told Trevor Phillips that Britain has become a \"soft touch\" on migration, before suggesting between 15 and 25 detention sites will need to be built to detain asylum seekers. He described these as \"purpose-built modular steel structures\". \"We can look around the world at where things have worked and worked well. President Trump stood up 3,000 detention beds in eight days. That was this year in the state of Florida - using steel modular structures,\" Mr Yusuf said. He added that the president's crackdown has significantly reduced illegal border crossings and suggested the same could happen in the English Channel to deter migrants. \"These are unarmed, largely men in dinghies, we don't need a particularly formidable military to be able to take them to a detention centre,\" he said. Ms Mahmood will have the job of tackling illegal immigration after taking over from Yvette Cooper as home secretary on Friday - when Sir Keir Starmer carried out a major cabinet reshuffle following the resignation of his deputy prime minister Angela Rayner. National Crime Agency (NCA) figures show record levels of disruption of immigration crime networks in 2024/25. Join the Sky News immigration debate It’s hard to see inside Napier barracks, one of the few military sites already housing migrants. The perimeter wire fences are covered with blue tarpaulin. This large military complex is now housing over two hundred migrants, all waiting for their asylum claims to be processed. About half arrived on small boats, picked up by Border Force as they crossed the channel.\n I met a small group of the residents, who’d gathered in a nearby park. They were young men all from Eritrea and had all arrived in the last month on small boats. They told me conditions inside were poor, with fourteen people sleeping in each dormitory room. They said they share the same bathroom with another dorm of fourteen. A short while later, volunteers from a charity set up a stall outside the barracks handing out shoes. On a table there were pairs of trainers and shoes, with a long queue of people waiting to take them. This site has faced much opposition. It should have been shut down in August, but in recent weeks increasing numbers of asylum seekers have been sent here, and the deadline for its closure has already been extended. Officials believe this contributed to the lowest number of boats crossing the Channel in August since 2019. But, despite the 3,567 arrivals in August being the lowest since 2021, when looking across the whole of 2025, the figure of 29,003 is the highest on record for this point in a year. Sky's Political Correspondent Liz Bates said that after Labour scrapped the previous government's controversial Rwanda policy and shut down the Bibby Stockholm barge, ministers are \"hitting up against many of the same problems\" with \"a really broken and very slow asylum system\". \"The context to all of this is a huge shake-up at the Home Office, and I think something of an admission that [Yvette] Cooper, despite her years of experience, could not get a grip... of this problem of people coming across the Channel in small boats and then ending up in asylum hotels,\" she added. Army bases were previously used by the Conservative government, but this prompted local protests, and the sites were widely criticised for their poor conditions in some cases. Read more from Sky News:Farage wants Afghan women deportedHuge rise in asylum protestsAttack on Epping asylum seeker As Sky's Home Editor Jason Farrell writes, Ms Mahmood has become the home secretary of a country where the national flag is being hoisted as a symbol of dissatisfaction - with anger at the arrival of desperate migrants crossing the Channel in small boats. Sir Keir's sweeping changes Sir Keir Starmer has announced sweeping changes to his ministerial team in the Home Office as his government works to get a grip of illegal migration to the UK. Here's a list of who has been moved, besides the home secretary. Dame Angela Eagle, who was border security and asylum minister, has been moved to the environment department. Dame Diana Johnson, who was policing and crime minister, has been moved to the Department for Work and Pensions (DWP). She has said in a post on X that it was an \"honour\" to work with police officers, and she is \"delighted\" to be moving to the DWP. Dan Jarvis has been given a role in the Cabinet Office, in addition to his post as security minister in the Home Office. And Sarah Jones, who was industry minister, has been moved to the Home Office."
    },
    {
        "title": "What's Zack Polanski's story?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>   ",
        "url": "https://news.sky.com/story/whats-zack-polanskis-story-13425572",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-daily-050925-zack-polanski_7012007.png?20250905143954",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-07 00:00:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  Zack Polanski is the fresh face of the Green Party. He already sits on the London Assembly - the capital's elected body that scrutinises the activities of the mayor. But he's got his eyes set on the Commons - with ambitions to join the four Green MPs already there.  Polanski wants to offer a different approach to politics with policies that include a wealth tax on billionaires and renationalising water companies. And to be a threat to both Labour and Reform UK. To find out more about Polanski's ambitions, Niall Paterson is joined by Caroline Russell, Green leader of the London Assembly who has worked alongside him and backed his campaign, plus George Monaghan, commissioning editor at the New Statesman. Producer: Soila Apparicio"
    },
    {
        "title": "UK weather: Rain likely above average this autumn – but why it might not clear the drought",
        "description": "The public is being asked to prepare for the risk of flooding with above-average rain and wind likely this autumn.",
        "url": "https://news.sky.com/story/uk-weather-rain-likely-above-average-this-autumn-8211-but-why-it-might-not-clear-the-drought-13424921",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-weather-rain_7011555.jpg?20250905003902",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-07 23:01:00",
        "Headline": "The Met Office detects chances of above-average rain and wind for autumn - but some areas would be worse affected, and drought may persist.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The public is being asked to prepare for the risk of flooding with above-average rain and wind likely this autumn. The Met Office is picking up higher chances of a strong jet stream and westerly winds in the long-range forecast, raising the risk of a wet, windy, and potentially stormy season. Get your local weather forecast Although the heavy rain and wind aren't guaranteed, if they do hit, western and northern parts of the UK are expected to bear the brunt. Meanwhile eastern and southern areas may experience drier conditions than the national average. And the unsettled weather is unlikely to eliminate the current drought afflicting five areas of England any time soon, said Will Lang, chief meteorologist at the Met Office. \"The current forecast for unsettled weather is unlikely to be enough to reverse the effects of drought over the next few weeks and during the autumn, especially so in England. We're going to need more rain than that.\" He said it's too early to tell whether that will change later in autumn and into winter. But it means some areas could feasibly experience both drought and flooding at the same time, something symptomatic of a changing climate. It comes as the sunny season came to an abrupt end last week, with the UK's hottest summer on record giving way to heavy rain in some areas. Last September brought heavy downpours and major disruption to the Midlands, before Storm Bert forced a major incident in Wales in November.  Public urged to sign up to flood warnings The Floods Resilience Taskforce - including floods minister Emma Hardy, the emergency services, and the Environment Agency - will meet later to discuss how to prepare for the season ahead. Set up last year to tackle increasingly extreme weather, it is today urging the public to sign up to flood warnings in their area, avoid driving through flood water and prepare homes in order to speed up recovery. About 6.3m properties in England are at risk of flooding, whether from the sea, rivers or flash flooding, according to Environment Agency data. The government has committed a \"record\" two-year investment of £2.65bn to protect an extra 52,000 properties. It said it is on track to protect 25,000 homes this financial year, with 3,800 so far signed off. Read more from Sky News:London-born teenager becomes a saint890 arrested at Palestine Action protestLabour 'failing to deliver change' - TUC chief Officials confirmed 92.7% of the country's critical flood defences are at their required condition, with little change on the 92.6% last September, and still below the optimum level of 98%. Ms Hardy said the government is \"investing billions to build new flood defences, which will protect homes and businesses across the country\". Warmer than average autumn expected The new storm name season was launched last week, which officials say helps make people more aware of weather risks. This autumn is also likely to be warmer than average, \"a reflection mainly of our warming climate and how much things have changed in even just in the last 30 years,\" said Mr Lang. Warmer air also holds more moisture, making downpours heavier. In April, the country's climate advisers warned the country was on course for \"disaster\" without better protection against flooding and intense heat."
    }
]