[
    {
        "title": "Lando Norris wins F1 World Championship after dramatic decider in Abu Dhabi",
        "description": "Lando Norris won his maiden Formula 1 World Drivers' Championship on Sunday after coming third in the deciding showdown in Abu Dhabi.",
        "url": "https://news.sky.com/story/lando-norris-wins-f1-world-championship-after-dramatic-decider-in-abu-dhabi-13480422",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lando-norris-formula-1_7103794.jpg?20251207151401",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-07 07:26:00",
        "Headline": "Norris is the first British driver to win the top prize in Formula 1 since Sir Lewis Hamilton in 2020.",
        "Content": " Lando Norris won his maiden Formula 1 World Drivers' Championship on Sunday after coming third in the deciding showdown in Abu Dhabi. The accolade wraps up a clean sweep for his McLaren team, after they claimed the Constructors' Championship in Singapore in October. Red Bull's Max Verstappen won the final race of the season from pole position, but Norris coming in third meant the Dutchman was unable to overcome Norris's season points total of 423 - with Verstappen just two points short. Norris's title victory also ends Verstappen's four-year reign at the top of Formula 1. The Dutchman was hoping to retain his crown and win a record-equalling fifth-straight Drivers' Championship, which would have seen him draw level with F1 legend Michael Schumacher. Norris's teammate and title rival, Oscar Piastri, finished in second place in the race but third in the overall standings finishing on 410 points. The 26-year-old Norris is the 11th British driver to win the championship and first since Sir Lewis Hamilton in 2020. \"Thank you guys, oh my God. You have made my dreams come true, thank you so much. I love you guys. Thanks for everything, you deserve it. I love you mum, I love you dad. Thanks for everything. I'm not crying!\" he said on the team radio as he crossed the line. His victory marks a remarkable comeback to secure the title, after falling 34 points behind Piastri following the Dutch Grand Prix in August, when he suffered a late mechanical problem in his car while running second to his Australian teammate. But in the nine grand prix that followed, this was only the second time he was beaten by Piastri in a race. That sequence saw him secure dominant wins in Mexico and Brazil, putting him in pole position for the maiden title. \"I've not cried in a while! I didn't think I would cry but I did!\" Norris told Sky Sports in his post-race interview. \"It's a long journey. First of all, I want to say a big thanks to my guys, everyone at McLaren, my parents - my mum, my dad - they are the ones who have supported me since the beginning. \"It feels amazing. I now know what Max feels like a little bit! I want to congratulate Max and Oscar, my two biggest competitors the whole season. It's been a pleasure to race against both of them. It's been an honour, I've learned a lot from both. \"I've enjoyed it. It's been a long year. We did it and I'm so proud for everyone.\" Lando Norris, who completed his seventh season in Formula 1, was born 13 November 1999 in Bristol and raised in Glastonbury by English father Adam and Belgian mother Cisca. He began karting at the age of seven, while he attended the Millfield School in Somerset for nine years alongside his elder brother. He left at Year 10 aged 16 to focus on his racing career, when he signed with Carlin Motorsport in Formula 4, winning the title in 2015. After working his way up through the ranks, he finished runner-up to fellow Briton George Russell in the 2018 Formula 2 World Championship. He made his Formula 1 debut in 2019 for McLaren, racing alongside Carlos Sainz Jr., where he finished 11th. He secured his maiden podium in 2020 with third in that year's Austrian Grand Prix, before securing his first pole position at the 2021 Russian Grand Prix.  However, it wasn't until 2024 that he secured his maiden race win in the Miami Grand Prix. His win saw him tie the record for the most podiums before taking his first win. After conducting celebratory 'donuts' on the start-finish straight after completing his slow-down lap, Norris was embraced by his parents, Cisca and Adam, after getting out of the car along with his girlfriend, Margarida Corceiro. Norris received congratulations from across the globe after his win, including from Prime Minister Sir Keir Starmer. In a post on X, Sir Keir said: \"Congratulations @LandoNorris, Britain's new @F1 champion! An unbelievable season and so well deserved.\" Midlands correspondent It was clear who fans at this watch party wanted to see win, and they got their wish. There were cheers, tears and hugs of celebration as Lando Norris became the first Brit to win the World Championship in five years. \"Great race, great result,\" says Jamie, who attended the watch party with his girlfriend Lottie. \"We cheered every time he came on screen.\" Lottie has seen Norris race at Silverstone before, but today was even more special. \"I've never felt like this before,\" says Lottie. \"It was such an amazing experience.\" She admits, though, that for much of the afternoon she \"felt sick,\" nervous about how the race would pan out.  Norris only needed to be in the top three to win, but was amongst stiff competition with Max Verstappen and team mate Oscar Piastri hot on his heels. There were groans in the crowd each time Norris slipped behind, and raucous cheers each time he closed the gap. But it was the reaction from the Jenner family that caught my attention, crying and embracing each other when it became clear Norris had brought it home. \"The fact he has managed to get here is just everything. It's amazing,\" said Mrs Jenner.  \"Pure joy that he had done it, we all love F1 as a family, it just means everything.\"  But not everyone was happy. Abhi was among the few who came to support another driver.  \"Go Max every time,\" he says, admitting that he is \"a bit gutted\" by the results. \"It stings a bit, but that's the nature of the race.\"  When asked what it was like to be one of the only people not there to witness Norris take the win, he says, \"I felt a bit intimidated to be honest, and a bit stressed as well, but I held my own.\""
    },
    {
        "title": "Man arrested after people 'pepper sprayed' in Heathrow suitcase robbery",
        "description": "One man has been arrested, and further suspects are being traced, after 21 people needed medical attention following a \"pepper spray\" incident at London's Heathrow Airport.",
        "url": "https://news.sky.com/story/man-arrested-after-people-pepper-sprayed-in-heathrow-suitcase-robbery-13480438",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-london-heathrow-airport_7103444.jpg?20251207101749",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-07 09:01:00",
        "Headline": "London Ambulance Service treated 21 people, including a three-year-old girl. Their injuries are not believed to be life-changing or life-threatening.",
        "Content": " One man has been arrested, and further suspects are being traced, after 21 people needed medical attention following a \"pepper spray\" incident at London's Heathrow Airport. Officers were called at 8.11am on Sunday to a multi-storey car park at Terminal 3 following reports of multiple people being assaulted, said the Metropolitan Police. A statement from the force said: \"Armed officers responded to the incident and arrested a 31-year-old man on suspicion of assault, within nine minutes of the report coming in. \"He remains in custody and enquiries remain ongoing to locate further suspects.\" What we know so far:• Police say a group of four men \"robbed a woman of her suitcase\" in a car park lift• They sprayed a substance believed to be pepper spray in her direction• People in the lift and the surrounding area were impacted• Those directly involved are \"known to each other\"• A total of 21 people were treated at the scene, including a three-year-old• Passengers faced delays and difficulties accessing the airport• Most of the disruption has now cleared Met Police Commander Peter Stevens said on Sunday afternoon that the force believes \"a woman was robbed of her suitcase by a group of four men, who sprayed a substance believed to be pepper spray in her direction\". \"This occurred within a car park lift, with those in the lift and surrounding area affected by the spray,\" he continued. \n                  Heathrow Airport live: Woman targeted in suitcase robbery before 'pepper spray' incident, police say\n                 \n                  Heathrow Airport's £33bn third runway plan chosen by government\n                 \n                  Jansen ready for take-off as next chairman of Heathrow Airport\n                 \"Our officers are working to determine the full circumstances around what happened but we do believe this to be an isolated incident with those directly involved known to each other.\" London Ambulance Service attended the scene and treated 21 people, including a three-year-old girl. Five people were taken to hospital. Their injuries are not believed to be life-changing or life-threatening. There was some disruption to traffic in the area and Terminal 3 remains open. Eyewitness describes 'absolutely terrifying' ordeal Witness Tom Bate told Sky's Matt Barbet that he saw three \"young men, dressed in black with their heads covered\" suddenly bolt from the elevator area. That's when \"people started coughing\", he said. \"Suddenly... everyone in the room was coughing, including me, and there was a burning in my throat. \"It was one of the weirdest things I've ever experienced.\"  Mr Bate was in the multi-storey car park at Terminal 3, having just landed from Dallas, Texas. As he was leaving the car park, he saw \"10-20 armed police officers\" run in. \"The [police] did, in fact, point their gun at someone and order him to the ground and detain him,\" he said. \"And they got me out of the vehicle to ID the person.\" Mr Bate described the incident as \"pretty intense\" and \"absolutely terrifying\". 'Significant incident' The London Ambulance Service said a \"significant incident\" was declared and there was a \"full deployment\" of resources. A London Fire Brigade spokesperson said it was also called to the incident. Heathrow advised passengers to allow extra time when travelling to the airport and to check with their airline for any queries. Some passengers said they were forced to wait three hours for a shuttle bus to the long-stay car park after their flight. The service usually runs every 15 minutes. Bottles of water were handed out by staff to people waiting for buses from Terminal 3. There was disruption to train and Tube services, with some delays on the Elizabeth Line and the Piccadilly Line, but all lines are now operating normally. Traffic also piled up at the M4 junction for the airport but this has since cleared. People on social media said vehicles were being searched at the airport. A user on X said there was a \"major backlog of cars unable to leave the vicinity or enter the drop-off zone\" at Terminal 3. In footage on X, several armed police were seen in a car park."
    },
    {
        "title": "President Trump may walk away from Ukraine peace process, his eldest son says",
        "description": "Donald Trump's eldest son has said his father may walk away from the Ukraine peace process, claiming the issue is not a priority for Americans, and signalling Europe needs a better plan.",
        "url": "https://news.sky.com/story/president-trump-may-walk-away-from-ukraine-peace-process-his-eldest-son-says-13480476",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-zelenskyy_6994969.jpg?20250819035248",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-07 11:26:00",
        "Headline": "Speaking to Sky's lead world news presenter Yalda Hakim at Doha Forum 2025, Donald Trump Jr also said Elon Musk was \"100%\" back in the president's good books.",
        "Content": " Donald Trump's eldest son has said his father may walk away from the Ukraine peace process, claiming the issue is not a priority for Americans, and signalling Europe needs a better plan. In a wide-ranging discussion with Sky's lead world news presenter Yalda Hakim at Doha Forum 2025, Donald Trump Jr addressed issues including the US administration's recent diplomatic efforts around the world. He was speaking in his capacity as a business leader, setting out his agenda for \"America first\" investments in defence technology and artificial intelligence (AI), drawing a direct line between global stability and economic prosperity. Ukraine war latest - follow live updates  When asked directly if he believed the US president would walk away from Ukraine, he answered: \"I think he may, what's good about my father and what's unique about my father is you don't know what he's going to do. He's unpredictable.\" President Trump has led renewed efforts for a ceasefire deal with Russia in recent months. \n                  Dismissal of criminal charges against opponents derails Trump's revenge tour\n                 \n                  Charlie Kirk's widow forgives his killer\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 Drawing a parallel with his father's current \"war\" on drug cartels, Donald Trump Jr described gangs bringing illegal drugs into America as a \"far greater clear and present danger to the US than anything [going on] in the Ukraine or Russia\". While he said he did not believe Ukraine would be \"abandoned\", he said: \"The American public doesn't have the appetite [for endless wars and further funding of Ukraine's military efforts].\" Describing Ukraine as \"a far more corrupt country than Russia\", he characterised Ukrainian President Zelenskyy as \"one of the great marketeers of all time\", who he said had become \"a borderline deity, especially to the left\". He went on to describe President Trump's approach as \"common sense\". Lead world news presenter In a country and at a conference which is friendly, even admiring of the Trump administration, Don Jr was in his element. He's here in his capacity as a business leader, promoting his venture, 1789 Capital which claims to be focused on \"America First\" investments. But he wasn't shy about discussing his father's foreign policy achievements, boasting that Donald Trump had resolved seven or eight wars - conflicts that most ordinary Americans were unaware of. His pitch is bullish and direct - the current US administration is projecting strength globally, stopping wars and creating investment opportunities which serves the American economy. It's the MAGA mentality for the global audience. It's clear that the rivalry with China is their biggest focus, especially finding ways to combat their dominance over critical minerals. \"America can no longer just sit there and hope that China is going to be a good actor... I think the rest of the world understands that they want America to be at the forefront of all of that.\" When I asked him about recent efforts by President Trump to bring the war in Ukraine to an end, he responded forcefully. \"We want peace, we want to stop the death.\" But he went on to say that Europe needed to shoulder the burden and currently they have no plan. As he sat on the stage in Qatar, the country which has been at the centre of the ceasefire efforts for Gaza, he expressed hope that peace would prevail, but balanced expectations America would fund its re-construction. This would have to be a global effort. \"If there's one thing my father is, it's a builder... I think he can be the greatest construction manager in the history of the world, but no one in America wants to bear the entire responsibility of that.\" And, away from international diplomatic efforts, he was happy to announce a breakthrough closer to home. The \"bromance\" with Elon Musk and President Trump is back on - calling the entrepreneur a \"generational talent, a generational level of genius\". 'Bromance' back on He also confirmed that Tesla billionaire Elon Musk was \"100% back in the fold\", after previously appearing to fall out with the president. Earlier this year, Donald Trump Jr's investment company, 1789 Capital, heavily invested in some of Musk's companies, including SpaceX. Directly comparing President Trump with Musk, he said: \"Imagine dealing with one Donald Trump - now I have to deal with two. \"They're very similar that way, so it created some headaches… but the reality is they're both very much aligned, they're on message with what we want to do with our country. What we want to do with freedom of speech.\" He went on: \"Elon did incredible things for Twitter, really allowed the democratisation of truth and freedom and free speech to occur. That's something that is a true threat in America right now.\" He also praised Musk as \"changing the face of free speech, science and technology\", adding, \"we have to protect our geniuses\". When asked whether Mr Trump would stand for a third term, he joked that he could be \"just trolling\" those on the left. He went on, \"He's the most unpredictable person, probably in the history of politics. Which is why he's able to get something done. We'll see.\""
    },
    {
        "title": "Benin's government says coup attempt 'foiled' after soldiers claimed to have seized power",
        "description": "Benin's government says its armed forces have \"foiled\" an attempted coup after soldiers claimed on national television they had seized power.",
        "url": "https://news.sky.com/story/benin-government-says-coup-attempt-foiled-after-soldiers-claimed-to-have-seized-power-13480487",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-soldiers-benin-coup-attempt_7103676.jpg?20251207141603",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-07 11:41:00",
        "Headline": "A government spokesperson said 14 people had been arrested in connection with the coup attempt.",
        "Content": "Benin's government says its armed forces have \"foiled\" an attempted coup after soldiers claimed on national television they had seized power. Interior minister Alassane Seidou said in a Facebook video that on Sunday morning \"a small group of soldiers launched a mutiny with the aim of destabilising the state and its institutions\". \"Faced with this situation, the Beninese armed forces and their leadership, true to their oath, remained committed to the republic.\" A government spokesperson said 14 people had been arrested in connection with the coup attempt as of Sunday afternoon. They did not provide further details. Earlier, a group of at least eight soldiers had appeared on state television to announce the dissolution of the West African country's government in an apparent coup. The \"military committee for refoundation\" said the country's president Patrice Talon had been removed and it had taken over. Lieutenant Colonel Tigri Pascal had been appointed the group's president, the soldiers added. The committee said it was dissolving national institutions, suspending the constitution, and closing land, air and sea borders. \"The army solemnly commits to give the Beninese people the hope of a truly new era, where fraternity, justice and work prevail,\" said a statement read by one of the troops. But foreign minister Olushegun Adjadi Bakari said the coup plotters only had control of state TV. The signal for both state television and public radio was cut off but has since been restored. Gunfire was heard in several neighbourhoods in Cotonou, the country's largest city and economic hub, including near Mr Talon's presidential residence. Mr Talon's whereabouts were unknown on Sunday afternoon but he later made an appearance on state television, where he said the situation was \"totally under control\" and that \"the treachery would not go unpunished\". The French embassy said on Facebook that gunfire had been reported near Mr Talon's home and it urged citizens to stay at home. The US embassy also urged people to stay away from the area, monitor local media for updates, and avoid crowds and demonstrations. Read more from Sky News:Trump may walk away from Ukraine, son saysSalah says he's been 'thrown under bus' by Liverpool It comes as Benin prepares for a presidential election next April, after Mr Talon announced he was stepping down, having been in power since 2016. The ruling coalition had nominated finance minister Romuald Wadagni as its candidate for the contest. Last month, the country extended the presidential term of office from five years to seven, while keeping a two-term limit. In January, two associates of Mr Talon were sentenced to 20 years in prison for an alleged coup plot in 2024. In recent years, the military has seized power in two of Benin's neighbouring countries Niger and Burkina Faso, as well as Mali, Guinea, and, last month, Guinea-Bissau."
    },
    {
        "title": "Reform UK denies Nigel Farage broke electoral law",
        "description": "Reform UK has denied claims of Nigel Farage breaking electoral law.",
        "url": "https://news.sky.com/story/reform-uk-denies-nigel-farage-broke-electoral-law-13480773",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-farage-nigel_7104253.jpg?20251208001029",
        "type": "Home",
        "Author": "Mhari Aurora",
        "Date Published": "2025-12-07 22:13:00",
        "Headline": "It follows reports Nigel Farage has been referred to the police over claims he falsified election expenses.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Reform UK has denied claims of Nigel Farage breaking electoral law. It follows a report in Monday's The Daily Telegraph that Mr Farage has been referred to the police by a former member of his campaign team over claims he falsified election expenses. The claims relate to Mr Farage's campaign in Clacton-on-Sea, the seat he won for Reform UK in the 2024 General Election. In a statement, a Reform UK spokesperson said: \"These inaccurate claims come from a disgruntled former councillor... the party denies breaking electoral law. We look forward to clearing our name.\" According to the Telegraph, the claims have been made by Richard Everett, a former Reform councillor. It is reported by the Telegraph that Mr Everett has submitted documents to the Metropolitan Police. Mr Everett was one of four councillors who defected from the Conservatives to Reform UK on the eve of the 2024 General Election campaign. Sky News has not verified the allegations and the Metropolitan Police and the Electoral Commission are yet to comment. Both Labour and the Conservatives have called for answers from Mr Farage."
    },
    {
        "title": "Young people may lose benefits if they don't engage with help from new £820m scheme, government warns",
        "description": "Young people could lose their right to universal credit&#160;if they refuse to engage with help from a new scheme without good reason, the government has warned.",
        "url": "https://news.sky.com/story/young-people-may-lose-benefits-if-they-dont-engage-with-help-from-new-163820m-scheme-government-warns-13480447",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bricklayer-job_7103524.jpg?20251207195202",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-07 09:54:00",
        "Headline": "Around 900,000 people on universal credit will be given a \"dedicated work support session\", followed by four weeks of \"intensive support\" to help them find work.",
        "Content": " Young people could lose their right to universal credit if they refuse to engage with help from a new scheme without good reason, the government has warned. Almost one million will gain from plans to get them off benefits and into the workforce, according to officials. Latest updates from the Politics Hub It comes as the number of young people not in employment, education or training (NEET) has risen by more than a quarter since the COVID pandemic, with around 940,000 16 to 24-year-olds considered as NEET as of September this year, said the Office for National Statistics. That is an increase of 195,000 in the last two years, mainly driven by increasing sickness and disability rates. The £820m package includes funding to create 350,000 new workplace opportunities, including training and work experience, which will be offered in industries including construction, hospitality and healthcare. Around 900,000 people on universal credit will be given a \"dedicated work support session\". That will be followed by four weeks of \"intensive support\" to help them find work in one of up to six \"pathways\", which are: work, work experience, apprenticeships, wider training, learning, or a workplace training programme with a guaranteed interview at the end. However, Work and Pensions Secretary Pat McFadden has warned that young people could lose some of their benefits if they refuse to engage with the scheme without good reason. \"Doing nothing should not be an option,\" he told Sky News' Sunday Morning with Trevor Phillips. \"If someone just took that attitude, yes, they would then be subject to, you know, the obligations that are already part of the system.\" \"What I want to see is young people in the habit of getting up in the morning, doing the right thing, going to work,\" he added. \"That experience of that obligation, but also the sense of pride and purpose that comes with having a job.\" Read more from Sky News:Child poverty strategy unveiled - but not everyone's happyUniversal credit claimants soar by over million in a year The government says these pathways will be delivered in coordination with employers, while government-backed guaranteed jobs will be provided for up to 55,000 young people from spring 2026, but only in those areas with the highest need. However, shadow work and pensions secretary Helen Whately, from the Conservatives, said the scheme is \"an admission the government has no plan for growth, no plan to create real jobs, and no way of measuring whether any of this money delivers results\". She told Sky News the proposals are a \"classic Labour approach\" for tackling youth unemployment.  \"What we've seen today announced by the government is funding the best part of £1bn on work placements, and government-created jobs for young people. That sounds all very well,\" she told Sunday Morning with Trevor Phillips. \"But the fact is, and that's the absurdity of it is, just two weeks ago, we had a budget from the chancellor, which is expected to destroy 200,000 jobs. \"So the problem we have here is a government whose policies are destroying jobs, destroying opportunities for young people, now saying they're going to spend taxpayers' money on creating work placements. It's just simply the wrong answer.\" Ms Whately also said the government needs to tackle people who are unmotivated to work at all, and agreed with Mr McFadden on taking away the right to universal credit if they refuse opportunities to work. But she said the \"main reason\" young people are out of work is because \"they're moving on to sickness benefits\". Ms Whately also pointed to the government's diminished attempt to slash benefits earlier in the year, where planned welfare cuts were significantly scaled down after opposition from their own MPs. The funding will also expand youth hubs to help provide advice on writing CVs or seeking training, and also provide housing and mental health support. Some £34m from the funding will be used to launch a new \"Risk of NEET indicator tool\", aimed at identifying those young people who need support before they leave education and become unemployed. Monitoring of attendance in further education will be bolstered, and automatic enrolment in further education will also be piloted for young people without a place."
    },
    {
        "title": "A peace deal isn't a sure thing, Zelenskyy's UK visit needs more than a warm welcome",
        "description": "Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op.",
        "url": "https://news.sky.com/story/a-peace-deal-isnt-a-sure-thing-zelenskyys-uk-visit-needs-more-than-a-warm-welcome-13480755",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6990409.jpg?20250814100632",
        "type": "Home",
        "Author": "Mhari Aurora",
        "Date Published": "2025-12-07 20:52:00",
        "Headline": "On Monday Sir Keir Starmer will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op. On Monday the prime minister will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine. French President Emmanuel Macron and German Chancellor Friedrich Merz will join Sir Keir in showing solidarity and support for Ukraine and its leader, but it's the update on the peace negotiations that will be the main focus of the meet up. The four leaders are said to be set to not only discuss those talks between Ukraine, the US and Russia, but also to talk about next steps if a deal were to be reached and what that might look like. Ahead of the discussions, Sir Keir spoke with the Dutch leader Dick Schoof where both leaders agreed Ukraine's defence still needs international support, and that Ukraine's security is vital to European security. But while Russia's war machine shows no signs of abating, a warm welcome and kind words won't be enough to satisfy the embattled Ukrainian president at a time when Russian drone and missile attacks continue to bombard Kyiv. What is the latest in negotiations? Over the weekend, Mr Zelenskyy said he had discussed \"next steps\" with US President Donald Trump's advisers and was \"determined to keep working in good faith\". \"The American representatives know the basic Ukrainian positions,\" Mr Zelenskyy said in his nightly video address. \"The conversation was constructive, although not easy.\" But on Sunday evening, ahead of an event at the Kennedy Center, President Trump said he was \"disappointed\" with Mr Zelenskyy, as was asked about the next steps in Russia-Ukraine talks following negotiations. He said: \"We've been speaking to President Putin and we've been speaking to Ukrainian leaders, including Zelenskyy, President Zelenskyy. \"And I have to say that I'm a little bit disappointed that President Zelenskyy hasn't yet read the proposal. That was as of a few hours ago. \"His people love it. But he hasn't - Russia's fine with it. Russia's you know, Russia, I guess, would rather have the whole country when you think of it. But Russia is, I believe, fine with it, but I'm not sure that Zelenskyy's fine with it. His people love it but he hasn't read it.\" Read more:Ukraine has become Europe's war - so why doesn't it act like it?Inside a secret underground military base in eastern Ukraine On Saturday, Keith Kellogg, Trump's outgoing Ukraine envoy, had told the Reagan National Defence Forum that efforts to resolve the conflict were in \"the last 10 metres\". Kremlin spokesman Dmitry Peskov praised new US security strategy over the weekend, adding that Russia hopes this would lead to \"further constructive cooperation with Washington on the Ukrainian settlement\"."
    },
    {
        "title": "Man arrested after people 'pepper sprayed' in Heathrow suitcase robbery",
        "description": "One man has been arrested, and further suspects are being traced, after 21 people needed medical attention following a \"pepper spray\" incident at London's Heathrow Airport.",
        "url": "https://news.sky.com/story/man-arrested-after-people-pepper-sprayed-in-heathrow-suitcase-robbery-13480438",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-london-heathrow-airport_7103444.jpg?20251207101749",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-07 09:01:00",
        "Headline": "London Ambulance Service treated 21 people, including a three-year-old girl. Their injuries are not believed to be life-changing or life-threatening.",
        "Content": " One man has been arrested, and further suspects are being traced, after 21 people needed medical attention following a \"pepper spray\" incident at London's Heathrow Airport. Officers were called at 8.11am on Sunday to a multi-storey car park at Terminal 3 following reports of multiple people being assaulted, said the Metropolitan Police. A statement from the force said: \"Armed officers responded to the incident and arrested a 31-year-old man on suspicion of assault, within nine minutes of the report coming in. \"He remains in custody and enquiries remain ongoing to locate further suspects.\" What we know so far:• Police say a group of four men \"robbed a woman of her suitcase\" in a car park lift• They sprayed a substance believed to be pepper spray in her direction• People in the lift and the surrounding area were impacted• Those directly involved are \"known to each other\"• A total of 21 people were treated at the scene, including a three-year-old• Passengers faced delays and difficulties accessing the airport• Most of the disruption has now cleared Met Police Commander Peter Stevens said on Sunday afternoon that the force believes \"a woman was robbed of her suitcase by a group of four men, who sprayed a substance believed to be pepper spray in her direction\". \"This occurred within a car park lift, with those in the lift and surrounding area affected by the spray,\" he continued. \n                  Heathrow Airport live: Woman targeted in suitcase robbery before 'pepper spray' incident, police say\n                 \n                  Heathrow Airport's £33bn third runway plan chosen by government\n                 \n                  Jansen ready for take-off as next chairman of Heathrow Airport\n                 \"Our officers are working to determine the full circumstances around what happened but we do believe this to be an isolated incident with those directly involved known to each other.\" London Ambulance Service attended the scene and treated 21 people, including a three-year-old girl. Five people were taken to hospital. Their injuries are not believed to be life-changing or life-threatening. There was some disruption to traffic in the area and Terminal 3 remains open. Eyewitness describes 'absolutely terrifying' ordeal Witness Tom Bate told Sky's Matt Barbet that he saw three \"young men, dressed in black with their heads covered\" suddenly bolt from the elevator area. That's when \"people started coughing\", he said. \"Suddenly... everyone in the room was coughing, including me, and there was a burning in my throat. \"It was one of the weirdest things I've ever experienced.\"  Mr Bate was in the multi-storey car park at Terminal 3, having just landed from Dallas, Texas. As he was leaving the car park, he saw \"10-20 armed police officers\" run in. \"The [police] did, in fact, point their gun at someone and order him to the ground and detain him,\" he said. \"And they got me out of the vehicle to ID the person.\" Mr Bate described the incident as \"pretty intense\" and \"absolutely terrifying\". 'Significant incident' The London Ambulance Service said a \"significant incident\" was declared and there was a \"full deployment\" of resources. A London Fire Brigade spokesperson said it was also called to the incident. Heathrow advised passengers to allow extra time when travelling to the airport and to check with their airline for any queries. Some passengers said they were forced to wait three hours for a shuttle bus to the long-stay car park after their flight. The service usually runs every 15 minutes. Bottles of water were handed out by staff to people waiting for buses from Terminal 3. There was disruption to train and Tube services, with some delays on the Elizabeth Line and the Piccadilly Line, but all lines are now operating normally. Traffic also piled up at the M4 junction for the airport but this has since cleared. People on social media said vehicles were being searched at the airport. A user on X said there was a \"major backlog of cars unable to leave the vicinity or enter the drop-off zone\" at Terminal 3. In footage on X, several armed police were seen in a car park."
    },
    {
        "title": "Lando Norris wins F1 World Championship after dramatic decider in Abu Dhabi",
        "description": "Lando Norris won his maiden Formula 1 World Drivers' Championship on Sunday after coming third in the deciding showdown in Abu Dhabi.",
        "url": "https://news.sky.com/story/lando-norris-wins-f1-world-championship-after-dramatic-decider-in-abu-dhabi-13480422",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lando-norris-formula-1_7103794.jpg?20251207151401",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-07 07:26:00",
        "Headline": "Norris is the first British driver to win the top prize in Formula 1 since Sir Lewis Hamilton in 2020.",
        "Content": " Lando Norris won his maiden Formula 1 World Drivers' Championship on Sunday after coming third in the deciding showdown in Abu Dhabi. The accolade wraps up a clean sweep for his McLaren team, after they claimed the Constructors' Championship in Singapore in October. Red Bull's Max Verstappen won the final race of the season from pole position, but Norris coming in third meant the Dutchman was unable to overcome Norris's season points total of 423 - with Verstappen just two points short. Norris's title victory also ends Verstappen's four-year reign at the top of Formula 1. The Dutchman was hoping to retain his crown and win a record-equalling fifth-straight Drivers' Championship, which would have seen him draw level with F1 legend Michael Schumacher. Norris's teammate and title rival, Oscar Piastri, finished in second place in the race but third in the overall standings finishing on 410 points. The 26-year-old Norris is the 11th British driver to win the championship and first since Sir Lewis Hamilton in 2020. \"Thank you guys, oh my God. You have made my dreams come true, thank you so much. I love you guys. Thanks for everything, you deserve it. I love you mum, I love you dad. Thanks for everything. I'm not crying!\" he said on the team radio as he crossed the line. His victory marks a remarkable comeback to secure the title, after falling 34 points behind Piastri following the Dutch Grand Prix in August, when he suffered a late mechanical problem in his car while running second to his Australian teammate. But in the nine grand prix that followed, this was only the second time he was beaten by Piastri in a race. That sequence saw him secure dominant wins in Mexico and Brazil, putting him in pole position for the maiden title. \"I've not cried in a while! I didn't think I would cry but I did!\" Norris told Sky Sports in his post-race interview. \"It's a long journey. First of all, I want to say a big thanks to my guys, everyone at McLaren, my parents - my mum, my dad - they are the ones who have supported me since the beginning. \"It feels amazing. I now know what Max feels like a little bit! I want to congratulate Max and Oscar, my two biggest competitors the whole season. It's been a pleasure to race against both of them. It's been an honour, I've learned a lot from both. \"I've enjoyed it. It's been a long year. We did it and I'm so proud for everyone.\" Lando Norris, who completed his seventh season in Formula 1, was born 13 November 1999 in Bristol and raised in Glastonbury by English father Adam and Belgian mother Cisca. He began karting at the age of seven, while he attended the Millfield School in Somerset for nine years alongside his elder brother. He left at Year 10 aged 16 to focus on his racing career, when he signed with Carlin Motorsport in Formula 4, winning the title in 2015. After working his way up through the ranks, he finished runner-up to fellow Briton George Russell in the 2018 Formula 2 World Championship. He made his Formula 1 debut in 2019 for McLaren, racing alongside Carlos Sainz Jr., where he finished 11th. He secured his maiden podium in 2020 with third in that year's Austrian Grand Prix, before securing his first pole position at the 2021 Russian Grand Prix.  However, it wasn't until 2024 that he secured his maiden race win in the Miami Grand Prix. His win saw him tie the record for the most podiums before taking his first win. After conducting celebratory 'donuts' on the start-finish straight after completing his slow-down lap, Norris was embraced by his parents, Cisca and Adam, after getting out of the car along with his girlfriend, Margarida Corceiro. Norris received congratulations from across the globe after his win, including from Prime Minister Sir Keir Starmer. In a post on X, Sir Keir said: \"Congratulations @LandoNorris, Britain's new @F1 champion! An unbelievable season and so well deserved.\" Midlands correspondent It was clear who fans at this watch party wanted to see win, and they got their wish. There were cheers, tears and hugs of celebration as Lando Norris became the first Brit to win the World Championship in five years. \"Great race, great result,\" says Jamie, who attended the watch party with his girlfriend Lottie. \"We cheered every time he came on screen.\" Lottie has seen Norris race at Silverstone before, but today was even more special. \"I've never felt like this before,\" says Lottie. \"It was such an amazing experience.\" She admits, though, that for much of the afternoon she \"felt sick,\" nervous about how the race would pan out.  Norris only needed to be in the top three to win, but was amongst stiff competition with Max Verstappen and team mate Oscar Piastri hot on his heels. There were groans in the crowd each time Norris slipped behind, and raucous cheers each time he closed the gap. But it was the reaction from the Jenner family that caught my attention, crying and embracing each other when it became clear Norris had brought it home. \"The fact he has managed to get here is just everything. It's amazing,\" said Mrs Jenner.  \"Pure joy that he had done it, we all love F1 as a family, it just means everything.\"  But not everyone was happy. Abhi was among the few who came to support another driver.  \"Go Max every time,\" he says, admitting that he is \"a bit gutted\" by the results. \"It stings a bit, but that's the nature of the race.\"  When asked what it was like to be one of the only people not there to witness Norris take the win, he says, \"I felt a bit intimidated to be honest, and a bit stressed as well, but I held my own.\""
    },
    {
        "title": "Mohamed Salah says he has been 'thrown under the bus' by Liverpool",
        "description": "Liverpool star Mohamed Salah says he has been \"thrown under the bus\" by the club, and his relationship with manager Arne Slot has broken down.",
        "url": "https://news.sky.com/story/mohamed-salah-says-he-has-been-thrown-under-the-bus-by-liverpool-13480421",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mo-salah-mohamed-salah_7103370.jpg?20251207082741",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-07 07:23:00",
        "Headline": "The Liverpool star says he has invited his family to come and watch the Brighton match next Saturday, in case it's his last for the club.",
        "Content": "Liverpool star Mohamed Salah says he has been \"thrown under the bus\" by the club, and his relationship with manager Arne Slot has broken down. The 33-year-old player also suggested that next Saturday's match against Brighton could be his last for the Reds, who are the reigning Premier League champions. Speaking after Saturday's 3-3 draw at Leeds, the Egypt forward told journalists he was in disbelief he had been left on the bench for the third game running. \"I have done so much for this club down the years and especially last season,\" said Salah, who signed a new deal at Anfield at the end of last season. \"Now I'm sitting on the bench, and I don't know why. \"It seems like the club has thrown me under the bus. That is how I am feeling. I think it is very clear that someone wanted me to get all of the blame. \"I got a lot of promises in the summer and so far, I am on the bench for three games so I can't say they keep the promise. \"I said many times before that I had a good relationship with the manager and all of a sudden, we don't have any relationship. I don't know why, but it seems to me, how I see it, that someone doesn't want me in the club.\" \n                  Elderly woman killed in hit-and-run crash on way to shops in Liverpool\n                 \n                  Four years after Sarah Everard's murder, women still feel unsafe on Britain's streets\n                 \n                  Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference\n                 He joined the club in June 2017, and has been one of the Premier League's best players. Asked if his relationship with Slot had broken down, he said: \"Yeah, there's no relationship between us. It was a very good relationship and now all of a sudden there is no relationship.\" Salah will play at the Africa Cup of Nations (AFCON) for Egypt on 15 December and has been linked with a January move to the Saudi Pro League. On Tuesday, Liverpool face Inter Milan away in the Champions League. Speaking about the Brighton match at Anfield next Saturday, he admitted: \"I said to [my family], come to the Brighton game. I don't know if I am going to play or not, but I am going to enjoy it. In my head, I'm going to enjoy that game because I don't know what is going to happen now. \"I will be in Anfield to say goodbye to the fans and go the Africa cup. I don't know what is going to happen when I am there.\" Asked if it could be his final game for Liverpool, Salah said: \"In football you never know. I don't accept this situation. I have done so much for this club.\""
    },
    {
        "title": "Young people may lose benefits if they don't engage with help from new £820m scheme, government warns",
        "description": "Young people could lose their right to universal credit&#160;if they refuse to engage with help from a new scheme without good reason, the government has warned.",
        "url": "https://news.sky.com/story/young-people-may-lose-benefits-if-they-dont-engage-with-help-from-new-163820m-scheme-government-warns-13480447",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bricklayer-job_7103524.jpg?20251207195202",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-07 09:54:00",
        "Headline": "Around 900,000 people on universal credit will be given a \"dedicated work support session\", followed by four weeks of \"intensive support\" to help them find work.",
        "Content": " Young people could lose their right to universal credit if they refuse to engage with help from a new scheme without good reason, the government has warned. Almost one million will gain from plans to get them off benefits and into the workforce, according to officials. Latest updates from the Politics Hub It comes as the number of young people not in employment, education or training (NEET) has risen by more than a quarter since the COVID pandemic, with around 940,000 16 to 24-year-olds considered as NEET as of September this year, said the Office for National Statistics. That is an increase of 195,000 in the last two years, mainly driven by increasing sickness and disability rates. The £820m package includes funding to create 350,000 new workplace opportunities, including training and work experience, which will be offered in industries including construction, hospitality and healthcare. Around 900,000 people on universal credit will be given a \"dedicated work support session\". That will be followed by four weeks of \"intensive support\" to help them find work in one of up to six \"pathways\", which are: work, work experience, apprenticeships, wider training, learning, or a workplace training programme with a guaranteed interview at the end. However, Work and Pensions Secretary Pat McFadden has warned that young people could lose some of their benefits if they refuse to engage with the scheme without good reason. \"Doing nothing should not be an option,\" he told Sky News' Sunday Morning with Trevor Phillips. \"If someone just took that attitude, yes, they would then be subject to, you know, the obligations that are already part of the system.\" \"What I want to see is young people in the habit of getting up in the morning, doing the right thing, going to work,\" he added. \"That experience of that obligation, but also the sense of pride and purpose that comes with having a job.\" Read more from Sky News:Child poverty strategy unveiled - but not everyone's happyUniversal credit claimants soar by over million in a year The government says these pathways will be delivered in coordination with employers, while government-backed guaranteed jobs will be provided for up to 55,000 young people from spring 2026, but only in those areas with the highest need. However, shadow work and pensions secretary Helen Whately, from the Conservatives, said the scheme is \"an admission the government has no plan for growth, no plan to create real jobs, and no way of measuring whether any of this money delivers results\". She told Sky News the proposals are a \"classic Labour approach\" for tackling youth unemployment.  \"What we've seen today announced by the government is funding the best part of £1bn on work placements, and government-created jobs for young people. That sounds all very well,\" she told Sunday Morning with Trevor Phillips. \"But the fact is, and that's the absurdity of it is, just two weeks ago, we had a budget from the chancellor, which is expected to destroy 200,000 jobs. \"So the problem we have here is a government whose policies are destroying jobs, destroying opportunities for young people, now saying they're going to spend taxpayers' money on creating work placements. It's just simply the wrong answer.\" Ms Whately also said the government needs to tackle people who are unmotivated to work at all, and agreed with Mr McFadden on taking away the right to universal credit if they refuse opportunities to work. But she said the \"main reason\" young people are out of work is because \"they're moving on to sickness benefits\". Ms Whately also pointed to the government's diminished attempt to slash benefits earlier in the year, where planned welfare cuts were significantly scaled down after opposition from their own MPs. The funding will also expand youth hubs to help provide advice on writing CVs or seeking training, and also provide housing and mental health support. Some £34m from the funding will be used to launch a new \"Risk of NEET indicator tool\", aimed at identifying those young people who need support before they leave education and become unemployed. Monitoring of attendance in further education will be bolstered, and automatic enrolment in further education will also be piloted for young people without a place."
    },
    {
        "title": "Cruise ship stuck in port after shipping containers carrying bananas fall off cargo ship",
        "description": "A cruise ship has been forced to delay its departure after shipping containers carrying bananas fell overboard from a cargo ship off the Isle of Wight.",
        "url": "https://news.sky.com/story/cruise-ship-stuck-in-port-after-shipping-containers-carrying-bananas-fall-off-cargo-ship-13480542",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-iona-cruise-ship_7104164.jpg?20251207193544",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-07 13:47:00",
        "Headline": "The ship was due to depart Southampton for a 14-day cruise around Spain, Portugal and the Canary Islands.",
        "Content": " A cruise ship has been forced to delay its departure after shipping containers carrying bananas fell overboard from a cargo ship off the Isle of Wight. The P&O Cruises ship Iona was set to leave Southampton on Saturday evening for a two-week trip to Spain, Portugal and the Canary Islands, but has been stuck in port after the incident near the Nab tower lighthouse off Bembridge just before its departure. A Maritime Coastguard Agency spokeswoman said: \"HM Coastguard is continuing to work with the relevant authorities after 16 containers went overboard from the cargo ship Baltic Klipper in the Solent on December 6.\" No crew members were injured. While five of the containers were empty, eight were carrying bananas, two held plantain, and one was full of avocados, she added. Some of the cargo - and the containers themselves - began washing up on Selsey beach, West Sussex, on Sunday. \"HM Coastguard, alongside West Sussex Fire and Rescue Service and Sussex Police, have put cordons in place and are asking people not to go near the containers,\" the spokeswoman added. \"Other containers have been sighted adrift off the shoreline and an HM Coastguard helicopter and fixed wing aircraft have been carrying out searches.\" Read more from Sky News:British passenger missing after falling from cruise shipSecond arrest in connection with cruise ship death She continued: \"The public are advised to avoid the area and are reminded that all wreck material found in the UK has to be reported to HM Coastguard's Receiver of Wreck. \"Those who fail to declare items within 28 days are breaking the law and may have further action taken against them.\" Meanwhile, Iona, which has a capacity of 5,200 passengers, is understood to be remaining in port while the containers are recovered."
    },
    {
        "title": "A peace deal isn't a sure thing, Zelenskyy's UK visit needs more than a warm welcome",
        "description": "Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op.",
        "url": "https://news.sky.com/story/a-peace-deal-isnt-a-sure-thing-zelenskyys-uk-visit-needs-more-than-a-warm-welcome-13480755",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6990409.jpg?20250814100632",
        "type": "UK",
        "Author": "Mhari Aurora",
        "Date Published": "2025-12-07 20:52:00",
        "Headline": "On Monday Sir Keir Starmer will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op. On Monday the prime minister will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine. French President Emmanuel Macron and German Chancellor Friedrich Merz will join Sir Keir in showing solidarity and support for Ukraine and its leader, but it's the update on the peace negotiations that will be the main focus of the meet up. The four leaders are said to be set to not only discuss those talks between Ukraine, the US and Russia, but also to talk about next steps if a deal were to be reached and what that might look like. Ahead of the discussions, Sir Keir spoke with the Dutch leader Dick Schoof where both leaders agreed Ukraine's defence still needs international support, and that Ukraine's security is vital to European security. But while Russia's war machine shows no signs of abating, a warm welcome and kind words won't be enough to satisfy the embattled Ukrainian president at a time when Russian drone and missile attacks continue to bombard Kyiv. What is the latest in negotiations? Over the weekend, Mr Zelenskyy said he had discussed \"next steps\" with US President Donald Trump's advisers and was \"determined to keep working in good faith\". \"The American representatives know the basic Ukrainian positions,\" Mr Zelenskyy said in his nightly video address. \"The conversation was constructive, although not easy.\" But on Sunday evening, ahead of an event at the Kennedy Center, President Trump said he was \"disappointed\" with Mr Zelenskyy, as was asked about the next steps in Russia-Ukraine talks following negotiations. He said: \"We've been speaking to President Putin and we've been speaking to Ukrainian leaders, including Zelenskyy, President Zelenskyy. \"And I have to say that I'm a little bit disappointed that President Zelenskyy hasn't yet read the proposal. That was as of a few hours ago. \"His people love it. But he hasn't - Russia's fine with it. Russia's you know, Russia, I guess, would rather have the whole country when you think of it. But Russia is, I believe, fine with it, but I'm not sure that Zelenskyy's fine with it. His people love it but he hasn't read it.\" Read more:Ukraine has become Europe's war - so why doesn't it act like it?Inside a secret underground military base in eastern Ukraine On Saturday, Keith Kellogg, Trump's outgoing Ukraine envoy, had told the Reagan National Defence Forum that efforts to resolve the conflict were in \"the last 10 metres\". Kremlin spokesman Dmitry Peskov praised new US security strategy over the weekend, adding that Russia hopes this would lead to \"further constructive cooperation with Washington on the Ukrainian settlement\"."
    },
    {
        "title": "British documentary photographer Martin Parr dies ",
        "description": "Martin Parr CBE, the famed British documentary photographer hailed as \"a giant\" of his craft,&#160;has died aged 73.",
        "url": "https://news.sky.com/story/british-documentary-photographer-martin-parr-dies-13480590",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-martin-parr_7103906.jpg?20251207155844",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-07 15:12:00",
        "Headline": "Parr was recognised in the Queen's 2021 birthday honours with a CBE for services to photography and was \"one of the best-known documentary photographers of his generation\", according to a description on his foundation's website.",
        "Content": "Martin Parr CBE, the famed British documentary photographer hailed as \"a giant\" of his craft, has died aged 73. The Martin Parr Foundation announced his death in a statement on their website on Sunday saying: \"It is with great sadness that we announce that Martin Parr (1952-2025) died yesterday at home in Bristol. \"He is survived by his wife Susie, his daughter Ellen, his sister Vivien and his grandson George. The family asks for privacy at this time. \"The Martin Parr Foundation and Magnum Photos will work together to preserve and share Martin's legacy. \"More information on this will follow in due course. Martin will be greatly missed.\" Parr was recognised in the Queen's 2021 birthday honours with a CBE for services to photography and was \"one of the best-known documentary photographers of his generation\", according to a description on his foundation's website. Parr, who was born in Surrey and based his career in Bristol, had been a member of Magnum Photos since 1994 and was president from 2013 to 2017. \n                  Man arrested after people 'pepper sprayed' in Heathrow suitcase robbery\n                 \n                  Lando Norris wins F1 World Championship after dramatic decider in Abu Dhabi\n                 \n                  Politics latest: Benefits warning for young as jobs plan announced; Tory calls on Farage to be 'straight' about past\n                 Read more from Sky News:Lando Norris wins first F1 World ChampionshipCruise ship stuck in port after banana containers fall into sea In 2017, Parr established the Martin Parr Foundation as a home for British photography. 'A giant of photography' In a quote about his style on a dedicated page on Magnum, Parr said: \"With photography, I like to create fiction out of reality. I try and do this by taking society's natural prejudice and giving this a twist.\" His work has been collected by some of the world's leading museums, including the Tate in the UK, the Centre Pompidou in Paris and the Museum of Modern Art in New York. The British Journal of Photography paid tribute to him, with a statement saying: \"A giant of photography, Martin Parr helped foster a seachange in documentary at Magnum Photos and went on to publish scores of photobooks and win retrospectives at Barbican Art Gallery and Jeu de Paume, Paris. \"He also championed other image-makers, supporting them through his collection and through his publishing activities and gallery space.\""
    },
    {
        "title": "President Trump may walk away from Ukraine peace process, his eldest son says",
        "description": "Donald Trump's eldest son has said his father may walk away from the Ukraine peace process, claiming the issue is not a priority for Americans, and signalling Europe needs a better plan.",
        "url": "https://news.sky.com/story/president-trump-may-walk-away-from-ukraine-peace-process-his-eldest-son-says-13480476",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-zelenskyy_6994969.jpg?20250819035248",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 11:26:00",
        "Headline": "Speaking to Sky's lead world news presenter Yalda Hakim at Doha Forum 2025, Donald Trump Jr also said Elon Musk was \"100%\" back in the president's good books.",
        "Content": " Donald Trump's eldest son has said his father may walk away from the Ukraine peace process, claiming the issue is not a priority for Americans, and signalling Europe needs a better plan. In a wide-ranging discussion with Sky's lead world news presenter Yalda Hakim at Doha Forum 2025, Donald Trump Jr addressed issues including the US administration's recent diplomatic efforts around the world. He was speaking in his capacity as a business leader, setting out his agenda for \"America first\" investments in defence technology and artificial intelligence (AI), drawing a direct line between global stability and economic prosperity. Ukraine war latest - follow live updates  When asked directly if he believed the US president would walk away from Ukraine, he answered: \"I think he may, what's good about my father and what's unique about my father is you don't know what he's going to do. He's unpredictable.\" President Trump has led renewed efforts for a ceasefire deal with Russia in recent months. \n                  Dismissal of criminal charges against opponents derails Trump's revenge tour\n                 \n                  Charlie Kirk's widow forgives his killer\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 Drawing a parallel with his father's current \"war\" on drug cartels, Donald Trump Jr described gangs bringing illegal drugs into America as a \"far greater clear and present danger to the US than anything [going on] in the Ukraine or Russia\". While he said he did not believe Ukraine would be \"abandoned\", he said: \"The American public doesn't have the appetite [for endless wars and further funding of Ukraine's military efforts].\" Describing Ukraine as \"a far more corrupt country than Russia\", he characterised Ukrainian President Zelenskyy as \"one of the great marketeers of all time\", who he said had become \"a borderline deity, especially to the left\". He went on to describe President Trump's approach as \"common sense\". Lead world news presenter In a country and at a conference which is friendly, even admiring of the Trump administration, Don Jr was in his element. He's here in his capacity as a business leader, promoting his venture, 1789 Capital which claims to be focused on \"America First\" investments. But he wasn't shy about discussing his father's foreign policy achievements, boasting that Donald Trump had resolved seven or eight wars - conflicts that most ordinary Americans were unaware of. His pitch is bullish and direct - the current US administration is projecting strength globally, stopping wars and creating investment opportunities which serves the American economy. It's the MAGA mentality for the global audience. It's clear that the rivalry with China is their biggest focus, especially finding ways to combat their dominance over critical minerals. \"America can no longer just sit there and hope that China is going to be a good actor... I think the rest of the world understands that they want America to be at the forefront of all of that.\" When I asked him about recent efforts by President Trump to bring the war in Ukraine to an end, he responded forcefully. \"We want peace, we want to stop the death.\" But he went on to say that Europe needed to shoulder the burden and currently they have no plan. As he sat on the stage in Qatar, the country which has been at the centre of the ceasefire efforts for Gaza, he expressed hope that peace would prevail, but balanced expectations America would fund its re-construction. This would have to be a global effort. \"If there's one thing my father is, it's a builder... I think he can be the greatest construction manager in the history of the world, but no one in America wants to bear the entire responsibility of that.\" And, away from international diplomatic efforts, he was happy to announce a breakthrough closer to home. The \"bromance\" with Elon Musk and President Trump is back on - calling the entrepreneur a \"generational talent, a generational level of genius\". 'Bromance' back on He also confirmed that Tesla billionaire Elon Musk was \"100% back in the fold\", after previously appearing to fall out with the president. Earlier this year, Donald Trump Jr's investment company, 1789 Capital, heavily invested in some of Musk's companies, including SpaceX. Directly comparing President Trump with Musk, he said: \"Imagine dealing with one Donald Trump - now I have to deal with two. \"They're very similar that way, so it created some headaches… but the reality is they're both very much aligned, they're on message with what we want to do with our country. What we want to do with freedom of speech.\" He went on: \"Elon did incredible things for Twitter, really allowed the democratisation of truth and freedom and free speech to occur. That's something that is a true threat in America right now.\" He also praised Musk as \"changing the face of free speech, science and technology\", adding, \"we have to protect our geniuses\". When asked whether Mr Trump would stand for a third term, he joked that he could be \"just trolling\" those on the left. He went on, \"He's the most unpredictable person, probably in the history of politics. Which is why he's able to get something done. We'll see.\""
    },
    {
        "title": "Nigerian government secures release of 100 abducted schoolchildren - reports",
        "description": "Nigeria's government has secured the release of 100 schoolchildren who were abducted from a Catholic boarding school last month, according to local media.",
        "url": "https://news.sky.com/story/nigerian-government-secures-release-of-100-abducted-schoolchildren-reports-13480745",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-st-marys-school-nigeria_7088284.jpg?20251122100122",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 20:15:00",
        "Headline": "More than 300 children and 12 teachers were taken from a  Catholic boarding school in Niger state last month, in one of Nigeria's worst mass kidnappings to date. ",
        "Content": "Nigeria's government has secured the release of 100 schoolchildren who were abducted from a Catholic boarding school last month, according to local media. The Christian Association of Nigeria (CAN) said 303 children were kidnapped from St Mary's School in Agwara, Niger state, on 21 November. Twelve teachers were also abducted. At least 50 of the children escaped in the two days after the abduction, but until now, there had been no updates on the whereabouts of the other children - some as young as six - and the missing staff. Local broadcaster Channels Television did not immediately provide details about the release, while CAN and Niger state authorities said they were not officially notified of the children being freed. Daniel Atori, a CAN spokesperson, said: \"We are not officially aware and have not been duly notified by the federal government. We hope and pray it's true and will be looking forward to when the remaining will be released.\" The Nigerian government has not commented.  The attack was one of Nigeria's worst mass kidnappings to date. It came days after 25 schoolgirls were kidnapped from a boarding school in the neighbouring Kebbi state. At least 1,500 students have been abducted in the country since Boko Haram extremists seized 276 Chibok schoolgirls more than a decade ago. Nigeria's security situation has faced fresh scrutiny since Donald Trump threatened military action in the West African country over the treatment of Christians. The Nigerian government has said the US president's claim that Christians face persecution there is a misrepresentation of the country's complex security challenges."
    },
    {
        "title": "Lando Norris wins F1 World Championship after dramatic decider in Abu Dhabi",
        "description": "Lando Norris won his maiden Formula 1 World Drivers' Championship on Sunday after coming third in the deciding showdown in Abu Dhabi.",
        "url": "https://news.sky.com/story/lando-norris-wins-f1-world-championship-after-dramatic-decider-in-abu-dhabi-13480422",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lando-norris-formula-1_7103794.jpg?20251207151401",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 07:26:00",
        "Headline": "Norris is the first British driver to win the top prize in Formula 1 since Sir Lewis Hamilton in 2020.",
        "Content": " Lando Norris won his maiden Formula 1 World Drivers' Championship on Sunday after coming third in the deciding showdown in Abu Dhabi. The accolade wraps up a clean sweep for his McLaren team, after they claimed the Constructors' Championship in Singapore in October. Red Bull's Max Verstappen won the final race of the season from pole position, but Norris coming in third meant the Dutchman was unable to overcome Norris's season points total of 423 - with Verstappen just two points short. Norris's title victory also ends Verstappen's four-year reign at the top of Formula 1. The Dutchman was hoping to retain his crown and win a record-equalling fifth-straight Drivers' Championship, which would have seen him draw level with F1 legend Michael Schumacher. Norris's teammate and title rival, Oscar Piastri, finished in second place in the race but third in the overall standings finishing on 410 points. The 26-year-old Norris is the 11th British driver to win the championship and first since Sir Lewis Hamilton in 2020. \"Thank you guys, oh my God. You have made my dreams come true, thank you so much. I love you guys. Thanks for everything, you deserve it. I love you mum, I love you dad. Thanks for everything. I'm not crying!\" he said on the team radio as he crossed the line. His victory marks a remarkable comeback to secure the title, after falling 34 points behind Piastri following the Dutch Grand Prix in August, when he suffered a late mechanical problem in his car while running second to his Australian teammate. But in the nine grand prix that followed, this was only the second time he was beaten by Piastri in a race. That sequence saw him secure dominant wins in Mexico and Brazil, putting him in pole position for the maiden title. \"I've not cried in a while! I didn't think I would cry but I did!\" Norris told Sky Sports in his post-race interview. \"It's a long journey. First of all, I want to say a big thanks to my guys, everyone at McLaren, my parents - my mum, my dad - they are the ones who have supported me since the beginning. \"It feels amazing. I now know what Max feels like a little bit! I want to congratulate Max and Oscar, my two biggest competitors the whole season. It's been a pleasure to race against both of them. It's been an honour, I've learned a lot from both. \"I've enjoyed it. It's been a long year. We did it and I'm so proud for everyone.\" Lando Norris, who completed his seventh season in Formula 1, was born 13 November 1999 in Bristol and raised in Glastonbury by English father Adam and Belgian mother Cisca. He began karting at the age of seven, while he attended the Millfield School in Somerset for nine years alongside his elder brother. He left at Year 10 aged 16 to focus on his racing career, when he signed with Carlin Motorsport in Formula 4, winning the title in 2015. After working his way up through the ranks, he finished runner-up to fellow Briton George Russell in the 2018 Formula 2 World Championship. He made his Formula 1 debut in 2019 for McLaren, racing alongside Carlos Sainz Jr., where he finished 11th. He secured his maiden podium in 2020 with third in that year's Austrian Grand Prix, before securing his first pole position at the 2021 Russian Grand Prix.  However, it wasn't until 2024 that he secured his maiden race win in the Miami Grand Prix. His win saw him tie the record for the most podiums before taking his first win. After conducting celebratory 'donuts' on the start-finish straight after completing his slow-down lap, Norris was embraced by his parents, Cisca and Adam, after getting out of the car along with his girlfriend, Margarida Corceiro. Norris received congratulations from across the globe after his win, including from Prime Minister Sir Keir Starmer. In a post on X, Sir Keir said: \"Congratulations @LandoNorris, Britain's new @F1 champion! An unbelievable season and so well deserved.\" Midlands correspondent It was clear who fans at this watch party wanted to see win, and they got their wish. There were cheers, tears and hugs of celebration as Lando Norris became the first Brit to win the World Championship in five years. \"Great race, great result,\" says Jamie, who attended the watch party with his girlfriend Lottie. \"We cheered every time he came on screen.\" Lottie has seen Norris race at Silverstone before, but today was even more special. \"I've never felt like this before,\" says Lottie. \"It was such an amazing experience.\" She admits, though, that for much of the afternoon she \"felt sick,\" nervous about how the race would pan out.  Norris only needed to be in the top three to win, but was amongst stiff competition with Max Verstappen and team mate Oscar Piastri hot on his heels. There were groans in the crowd each time Norris slipped behind, and raucous cheers each time he closed the gap. But it was the reaction from the Jenner family that caught my attention, crying and embracing each other when it became clear Norris had brought it home. \"The fact he has managed to get here is just everything. It's amazing,\" said Mrs Jenner.  \"Pure joy that he had done it, we all love F1 as a family, it just means everything.\"  But not everyone was happy. Abhi was among the few who came to support another driver.  \"Go Max every time,\" he says, admitting that he is \"a bit gutted\" by the results. \"It stings a bit, but that's the nature of the race.\"  When asked what it was like to be one of the only people not there to witness Norris take the win, he says, \"I felt a bit intimidated to be honest, and a bit stressed as well, but I held my own.\""
    },
    {
        "title": "A peace deal isn't a sure thing, Zelenskyy's UK visit needs more than a warm welcome",
        "description": "Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op.",
        "url": "https://news.sky.com/story/a-peace-deal-isnt-a-sure-thing-zelenskyys-uk-visit-needs-more-than-a-warm-welcome-13480755",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6990409.jpg?20250814100632",
        "type": "World",
        "Author": "Mhari Aurora",
        "Date Published": "2025-12-07 20:52:00",
        "Headline": "On Monday Sir Keir Starmer will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op. On Monday the prime minister will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine. French President Emmanuel Macron and German Chancellor Friedrich Merz will join Sir Keir in showing solidarity and support for Ukraine and its leader, but it's the update on the peace negotiations that will be the main focus of the meet up. The four leaders are said to be set to not only discuss those talks between Ukraine, the US and Russia, but also to talk about next steps if a deal were to be reached and what that might look like. Ahead of the discussions, Sir Keir spoke with the Dutch leader Dick Schoof where both leaders agreed Ukraine's defence still needs international support, and that Ukraine's security is vital to European security. But while Russia's war machine shows no signs of abating, a warm welcome and kind words won't be enough to satisfy the embattled Ukrainian president at a time when Russian drone and missile attacks continue to bombard Kyiv. What is the latest in negotiations? Over the weekend, Mr Zelenskyy said he had discussed \"next steps\" with US President Donald Trump's advisers and was \"determined to keep working in good faith\". \"The American representatives know the basic Ukrainian positions,\" Mr Zelenskyy said in his nightly video address. \"The conversation was constructive, although not easy.\" But on Sunday evening, ahead of an event at the Kennedy Center, President Trump said he was \"disappointed\" with Mr Zelenskyy, as was asked about the next steps in Russia-Ukraine talks following negotiations. He said: \"We've been speaking to President Putin and we've been speaking to Ukrainian leaders, including Zelenskyy, President Zelenskyy. \"And I have to say that I'm a little bit disappointed that President Zelenskyy hasn't yet read the proposal. That was as of a few hours ago. \"His people love it. But he hasn't - Russia's fine with it. Russia's you know, Russia, I guess, would rather have the whole country when you think of it. But Russia is, I believe, fine with it, but I'm not sure that Zelenskyy's fine with it. His people love it but he hasn't read it.\" Read more:Ukraine has become Europe's war - so why doesn't it act like it?Inside a secret underground military base in eastern Ukraine On Saturday, Keith Kellogg, Trump's outgoing Ukraine envoy, had told the Reagan National Defence Forum that efforts to resolve the conflict were in \"the last 10 metres\". Kremlin spokesman Dmitry Peskov praised new US security strategy over the weekend, adding that Russia hopes this would lead to \"further constructive cooperation with Washington on the Ukrainian settlement\"."
    },
    {
        "title": "Woman, 60, and young boy die in house fire",
        "description": "A murder investigation is underway after a woman and young boy died in a house fire in Edenderry, Co Offaly.",
        "url": "https://news.sky.com/story/woman-60-and-young-boy-die-in-house-fire-13480503",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-co-offaly-fire-castleview-park_7103561.jpg?20251207131620",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 13:05:00",
        "Headline": "The house on Castleview Park has been declared a crime scene, and Irish police are appealing for witnesses to come forward.",
        "Content": "A murder investigation is underway after a woman and young boy died in a house fire in Edenderry, Co Offaly. Another woman is being treated in hospital for her injuries following the blaze on Saturday at roughly 7.45pm. Irish police said the house on Castleview Park had been declared a crime scene. A Garda spokesperson said on Sunday morning that they could confirm two people had died as a result of the fire. \"A female, aged 60 years, and a young boy were fatally injured,\" they said. \"A second female, aged in her 50s, is receiving treatment for serious injuries at a hospital in the Midlands. Gardai in Tullamore are appealing for witnesses to come forward."
    },
    {
        "title": "Hundreds of books at the Louvre damaged in water leak just weeks after £76m heist",
        "description": "A water leak at the Louvre has damaged hundreds of books &#8211; just weeks after jewels worth &#163;76m were stolen from the famous Paris museum.",
        "url": "https://news.sky.com/story/hundreds-of-books-at-the-louvre-damaged-in-water-leak-just-weeks-after-16376m-heist-13480700",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-louvre-paris_7104100.jpg?20251207184259",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 18:32:00",
        "Headline": "The leak underscores concerns over the deteriorating state of the world's most visited museum.",
        "Content": "A water leak at the Louvre has damaged hundreds of books – just weeks after jewels worth £76m were stolen from the famous Paris museum. The Louvre's deputy administrator Francis Steinbock told French broadcaster BFM TV the leak affected one of the three rooms of the Egyptian antiquities department's library. He said staff have identified \"between 300 and 400 works\" that have been damaged, adding that \"the count is ongoing\". The volumes lost were \"those consulted by Egyptologists but no precious books\", he added. Mr Steinbock also acknowledged the problem had been known for years and said repairs were scheduled for September next year. The leak, which took place last month but has only been revealed today, underscores concerns over the deteriorating state of the world's most-visited museum. In November, the Campana gallery - which houses ancient Greek ceramics - was temporarily closed due to structural weaknesses. The gallery's nine rooms are adjacent to the Apollo gallery, which was targeted by thieves who stole items some of the French Crown Jewels in October.  The audacious smash-and-grab saw two men escape with £76m-worth of jewels after accessing the museum's first floor with a furniture lift and cracking open display cases with angle grinders - all while the Paris museum was open to visitors. French police have made multiple arrests in relation to the theft but the stolen artefacts have not been recovered. Read more:Louvre director offers to resignProsecutor furious over heist arrest leaks  Before the heist, the Louvre's top administrator had warned about conditions inside the museum, which was visited by 8.7 million people last year. Valerie Baud from the CFDT, a French trade union federation, said staff representatives had been warning about the state of the building for years because \"it affects working conditions and visitors\". \"But we didn't realise it was this bad,\" she said. \"It is a major deterioration in the situation.\""
    },
    {
        "title": "Benin's government says coup attempt 'foiled' after soldiers claimed to have seized power",
        "description": "Benin's government says its armed forces have \"foiled\" an attempted coup after soldiers claimed on national television they had seized power.",
        "url": "https://news.sky.com/story/benin-government-says-coup-attempt-foiled-after-soldiers-claimed-to-have-seized-power-13480487",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-soldiers-benin-coup-attempt_7103676.jpg?20251207141603",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 11:41:00",
        "Headline": "A government spokesperson said 14 people had been arrested in connection with the coup attempt.",
        "Content": "Benin's government says its armed forces have \"foiled\" an attempted coup after soldiers claimed on national television they had seized power. Interior minister Alassane Seidou said in a Facebook video that on Sunday morning \"a small group of soldiers launched a mutiny with the aim of destabilising the state and its institutions\". \"Faced with this situation, the Beninese armed forces and their leadership, true to their oath, remained committed to the republic.\" A government spokesperson said 14 people had been arrested in connection with the coup attempt as of Sunday afternoon. They did not provide further details. Earlier, a group of at least eight soldiers had appeared on state television to announce the dissolution of the West African country's government in an apparent coup. The \"military committee for refoundation\" said the country's president Patrice Talon had been removed and it had taken over. Lieutenant Colonel Tigri Pascal had been appointed the group's president, the soldiers added. The committee said it was dissolving national institutions, suspending the constitution, and closing land, air and sea borders. \"The army solemnly commits to give the Beninese people the hope of a truly new era, where fraternity, justice and work prevail,\" said a statement read by one of the troops. But foreign minister Olushegun Adjadi Bakari said the coup plotters only had control of state TV. The signal for both state television and public radio was cut off but has since been restored. Gunfire was heard in several neighbourhoods in Cotonou, the country's largest city and economic hub, including near Mr Talon's presidential residence. Mr Talon's whereabouts were unknown on Sunday afternoon but he later made an appearance on state television, where he said the situation was \"totally under control\" and that \"the treachery would not go unpunished\". The French embassy said on Facebook that gunfire had been reported near Mr Talon's home and it urged citizens to stay at home. The US embassy also urged people to stay away from the area, monitor local media for updates, and avoid crowds and demonstrations. Read more from Sky News:Trump may walk away from Ukraine, son saysSalah says he's been 'thrown under bus' by Liverpool It comes as Benin prepares for a presidential election next April, after Mr Talon announced he was stepping down, having been in power since 2016. The ruling coalition had nominated finance minister Romuald Wadagni as its candidate for the contest. Last month, the country extended the presidential term of office from five years to seven, while keeping a two-term limit. In January, two associates of Mr Talon were sentenced to 20 years in prison for an alleged coup plot in 2024. In recent years, the military has seized power in two of Benin's neighbouring countries Niger and Burkina Faso, as well as Mali, Guinea, and, last month, Guinea-Bissau."
    },
    {
        "title": "Japan accuses Chinese fighter of locking fire-control radar on its jets",
        "description": "Japan has claimed a Chinese military jet locked its radar on Japanese fighter jets near the southern island of Okinawa in a \"dangerous act\".",
        "url": "https://news.sky.com/story/japan-accuses-chinese-fighter-of-locking-fire-control-radar-on-its-jets-13480416",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-j-15-china_7103361.jpg?20251207045158",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-07 04:06:00",
        "Headline": "A fire-control radar lock is one of the most threatening acts a military aircraft can take, as it signals a potential attack - often forcing the targeted aircraft to take evasive action.",
        "Content": "Japan has claimed a Chinese military jet locked its radar on Japanese fighter jets near the southern island of Okinawa in a \"dangerous act\". Japan's defence ministry said a Chinese J-15 \"intermittently\" targeted its fire-control radar at Japanese F-15s on two occasions on Saturday. A fire-control radar lock is one of the most threatening acts a military aircraft can take, as it signals a potential attack - often forcing the targeted aircraft to take evasive action. The alleged use of the system by the Chinese aircraft was detected by different Japanese fighters that had scrambled against a possible airspace violation by China, according to the ministry. The jets were targeted for about three minutes in the late afternoon and for about 30 minutes in the evening, said the ministry. Japan said the Chinese J-15 was launched from China's Liaoning aircraft carrier, which was manoeuvring south of the Okinawan islands with three missile destroyers. It is believed to be the first instance of a radar lock involving Japanese and Chinese military aircraft. \n                  Government delays Chinese 'super embassy' decision\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Death toll rises to 146 in Hong Kong apartment complex fire as more bodies found in burned buildings\n                 Japan insisted there was no breach of Japanese airspace, and no injury or damage was reported from the incident. A Chinese navy spokesperson refuted the claims, and said Japan's allegations were completely inconsistent with the facts. The spokesperson said a Japanese self-defence force aircraft repeatedly approached and disrupted the Chinese navy as it was training. Japanese defence minister Shinjiro Koizumi said in the early hours of Sunday that Japan had protested to China over the incident. He said the move \"exceeded the scope necessary for safe aircraft operations\", and that Japan had \"demanded strict preventive measures\" from China. It comes as relations between the two countries have worsened in recent weeks following remarks made by Japan's prime minister, Sanae Takaichi, over Taiwan. China was angered after the Japanese leader suggested its military could get involved if China were to take action against Taiwan, the self-governing island that Beijing says must come under its rule. Read more from Sky News:Irish police investigating drone sightings during Zelenskyy visitGaza ceasefire negotiations at 'critical moment' - Qatar PM  The comments went much further than those of her predecessors, while Chinese foreign minister Wang Yi said the remarks \"crossed a red line\"."
    },
    {
        "title": "President Trump may walk away from Ukraine peace process, his eldest son says",
        "description": "Donald Trump's eldest son has said his father may walk away from the Ukraine peace process, claiming the issue is not a priority for Americans, and signalling Europe needs a better plan.",
        "url": "https://news.sky.com/story/president-trump-may-walk-away-from-ukraine-peace-process-his-eldest-son-says-13480476",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-zelenskyy_6994969.jpg?20250819035248",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-07 11:26:00",
        "Headline": "Speaking to Sky's lead world news presenter Yalda Hakim at Doha Forum 2025, Donald Trump Jr also said Elon Musk was \"100%\" back in the president's good books.",
        "Content": " Donald Trump's eldest son has said his father may walk away from the Ukraine peace process, claiming the issue is not a priority for Americans, and signalling Europe needs a better plan. In a wide-ranging discussion with Sky's lead world news presenter Yalda Hakim at Doha Forum 2025, Donald Trump Jr addressed issues including the US administration's recent diplomatic efforts around the world. He was speaking in his capacity as a business leader, setting out his agenda for \"America first\" investments in defence technology and artificial intelligence (AI), drawing a direct line between global stability and economic prosperity. Ukraine war latest - follow live updates  When asked directly if he believed the US president would walk away from Ukraine, he answered: \"I think he may, what's good about my father and what's unique about my father is you don't know what he's going to do. He's unpredictable.\" President Trump has led renewed efforts for a ceasefire deal with Russia in recent months. \n                  Dismissal of criminal charges against opponents derails Trump's revenge tour\n                 \n                  Charlie Kirk's widow forgives his killer\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 Drawing a parallel with his father's current \"war\" on drug cartels, Donald Trump Jr described gangs bringing illegal drugs into America as a \"far greater clear and present danger to the US than anything [going on] in the Ukraine or Russia\". While he said he did not believe Ukraine would be \"abandoned\", he said: \"The American public doesn't have the appetite [for endless wars and further funding of Ukraine's military efforts].\" Describing Ukraine as \"a far more corrupt country than Russia\", he characterised Ukrainian President Zelenskyy as \"one of the great marketeers of all time\", who he said had become \"a borderline deity, especially to the left\". He went on to describe President Trump's approach as \"common sense\". Lead world news presenter In a country and at a conference which is friendly, even admiring of the Trump administration, Don Jr was in his element. He's here in his capacity as a business leader, promoting his venture, 1789 Capital which claims to be focused on \"America First\" investments. But he wasn't shy about discussing his father's foreign policy achievements, boasting that Donald Trump had resolved seven or eight wars - conflicts that most ordinary Americans were unaware of. His pitch is bullish and direct - the current US administration is projecting strength globally, stopping wars and creating investment opportunities which serves the American economy. It's the MAGA mentality for the global audience. It's clear that the rivalry with China is their biggest focus, especially finding ways to combat their dominance over critical minerals. \"America can no longer just sit there and hope that China is going to be a good actor... I think the rest of the world understands that they want America to be at the forefront of all of that.\" When I asked him about recent efforts by President Trump to bring the war in Ukraine to an end, he responded forcefully. \"We want peace, we want to stop the death.\" But he went on to say that Europe needed to shoulder the burden and currently they have no plan. As he sat on the stage in Qatar, the country which has been at the centre of the ceasefire efforts for Gaza, he expressed hope that peace would prevail, but balanced expectations America would fund its re-construction. This would have to be a global effort. \"If there's one thing my father is, it's a builder... I think he can be the greatest construction manager in the history of the world, but no one in America wants to bear the entire responsibility of that.\" And, away from international diplomatic efforts, he was happy to announce a breakthrough closer to home. The \"bromance\" with Elon Musk and President Trump is back on - calling the entrepreneur a \"generational talent, a generational level of genius\". 'Bromance' back on He also confirmed that Tesla billionaire Elon Musk was \"100% back in the fold\", after previously appearing to fall out with the president. Earlier this year, Donald Trump Jr's investment company, 1789 Capital, heavily invested in some of Musk's companies, including SpaceX. Directly comparing President Trump with Musk, he said: \"Imagine dealing with one Donald Trump - now I have to deal with two. \"They're very similar that way, so it created some headaches… but the reality is they're both very much aligned, they're on message with what we want to do with our country. What we want to do with freedom of speech.\" He went on: \"Elon did incredible things for Twitter, really allowed the democratisation of truth and freedom and free speech to occur. That's something that is a true threat in America right now.\" He also praised Musk as \"changing the face of free speech, science and technology\", adding, \"we have to protect our geniuses\". When asked whether Mr Trump would stand for a third term, he joked that he could be \"just trolling\" those on the left. He went on, \"He's the most unpredictable person, probably in the history of politics. Which is why he's able to get something done. We'll see.\""
    },
    {
        "title": "Events group CloserStill's owner picks banks for £1bn sale",
        "description": "The owners of one of Britain's biggest trade show operators has picked bankers to oversee a sale next year which could fetch well over &#163;1bn.",
        "url": "https://news.sky.com/story/events-group-closerstills-owner-picks-banks-for-1631bn-sale-13480581",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-closerstill-logo_7103818.jpg?20251207152128",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-07 15:05:00",
        "Headline": "Providence Equity Partners has hired Jefferies and The Raine Group to oversee an auction in 2026 of the events business it acquired seven years ago, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of one of Britain's biggest trade show operators has picked bankers to oversee a sale next year which could fetch well over £1bn. Sky News has learnt that Providence Equity Partners, which has backed CloserStill Media since 2018, has hired Jefferies and The Raine Group to orchestrate talks with potential buyers. City sources said this weekend that CloserStill's earnings trajectory meant that £1bn was likely to be the minimum price tag offered by prospective new owners of the business. The company operates more than 200 specialist events, in sectors including healthcare and technology. In September, it acquired Billington Cybersecurity, an operator of shows in the US. CloserStill's performance has, like many of its peers, rebounded since the nadir of the Covid pandemic, when many conference organisers feared for their survival. Alongside Searchlight, another private equity firm, Providence also owns Hyve, another major events organiser. \n                  Piers Morgan's Uncensored nears £100m valuation after stake sale\n                 \n                  'There are 15-year-olds sitting on millions - and their parents are clueless of their crimes' | Money blog\n                 \n                  Netflix agrees blockbuster $72bn deal for Warner Bros studios \n                 Other players in the sector include Clarion, which is owned by Blackstone and which conducted an aborted sale process earlier this year. Bidders for CloserStill are expected to include trade rivals and other financial investors. Providence has been contacted for comment."
    },
    {
        "title": "Young people may lose benefits if they don't engage with help from new £820m scheme, government warns",
        "description": "Young people could lose their right to universal credit&#160;if they refuse to engage with help from a new scheme without good reason, the government has warned.",
        "url": "https://news.sky.com/story/young-people-may-lose-benefits-if-they-dont-engage-with-help-from-new-163820m-scheme-government-warns-13480447",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bricklayer-job_7103524.jpg?20251207195202",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-07 09:54:00",
        "Headline": "Around 900,000 people on universal credit will be given a \"dedicated work support session\", followed by four weeks of \"intensive support\" to help them find work.",
        "Content": " Young people could lose their right to universal credit if they refuse to engage with help from a new scheme without good reason, the government has warned. Almost one million will gain from plans to get them off benefits and into the workforce, according to officials. Latest updates from the Politics Hub It comes as the number of young people not in employment, education or training (NEET) has risen by more than a quarter since the COVID pandemic, with around 940,000 16 to 24-year-olds considered as NEET as of September this year, said the Office for National Statistics. That is an increase of 195,000 in the last two years, mainly driven by increasing sickness and disability rates. The £820m package includes funding to create 350,000 new workplace opportunities, including training and work experience, which will be offered in industries including construction, hospitality and healthcare. Around 900,000 people on universal credit will be given a \"dedicated work support session\". That will be followed by four weeks of \"intensive support\" to help them find work in one of up to six \"pathways\", which are: work, work experience, apprenticeships, wider training, learning, or a workplace training programme with a guaranteed interview at the end. However, Work and Pensions Secretary Pat McFadden has warned that young people could lose some of their benefits if they refuse to engage with the scheme without good reason. \"Doing nothing should not be an option,\" he told Sky News' Sunday Morning with Trevor Phillips. \"If someone just took that attitude, yes, they would then be subject to, you know, the obligations that are already part of the system.\" \"What I want to see is young people in the habit of getting up in the morning, doing the right thing, going to work,\" he added. \"That experience of that obligation, but also the sense of pride and purpose that comes with having a job.\" Read more from Sky News:Child poverty strategy unveiled - but not everyone's happyUniversal credit claimants soar by over million in a year The government says these pathways will be delivered in coordination with employers, while government-backed guaranteed jobs will be provided for up to 55,000 young people from spring 2026, but only in those areas with the highest need. However, shadow work and pensions secretary Helen Whately, from the Conservatives, said the scheme is \"an admission the government has no plan for growth, no plan to create real jobs, and no way of measuring whether any of this money delivers results\". She told Sky News the proposals are a \"classic Labour approach\" for tackling youth unemployment.  \"What we've seen today announced by the government is funding the best part of £1bn on work placements, and government-created jobs for young people. That sounds all very well,\" she told Sunday Morning with Trevor Phillips. \"But the fact is, and that's the absurdity of it is, just two weeks ago, we had a budget from the chancellor, which is expected to destroy 200,000 jobs. \"So the problem we have here is a government whose policies are destroying jobs, destroying opportunities for young people, now saying they're going to spend taxpayers' money on creating work placements. It's just simply the wrong answer.\" Ms Whately also said the government needs to tackle people who are unmotivated to work at all, and agreed with Mr McFadden on taking away the right to universal credit if they refuse opportunities to work. But she said the \"main reason\" young people are out of work is because \"they're moving on to sickness benefits\". Ms Whately also pointed to the government's diminished attempt to slash benefits earlier in the year, where planned welfare cuts were significantly scaled down after opposition from their own MPs. The funding will also expand youth hubs to help provide advice on writing CVs or seeking training, and also provide housing and mental health support. Some £34m from the funding will be used to launch a new \"Risk of NEET indicator tool\", aimed at identifying those young people who need support before they leave education and become unemployed. Monitoring of attendance in further education will be bolstered, and automatic enrolment in further education will also be piloted for young people without a place."
    },
    {
        "title": "A peace deal isn't a sure thing, Zelenskyy's UK visit needs more than a warm welcome",
        "description": "Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op.",
        "url": "https://news.sky.com/story/a-peace-deal-isnt-a-sure-thing-zelenskyys-uk-visit-needs-more-than-a-warm-welcome-13480755",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6990409.jpg?20250814100632",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2025-12-07 20:52:00",
        "Headline": "On Monday Sir Keir Starmer will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Volodymyr Zelenskyy is heading to Downing Street once again, but Prime Minister Sir Keir Starmer will be keen to make this meeting more than just a photo op. On Monday the prime minister will welcome not only the Ukrainian president, but also E3 allies France and Germany to discuss the state of the war in Ukraine. French President Emmanuel Macron and German Chancellor Friedrich Merz will join Sir Keir in showing solidarity and support for Ukraine and its leader, but it's the update on the peace negotiations that will be the main focus of the meet up. The four leaders are said to be set to not only discuss those talks between Ukraine, the US and Russia, but also to talk about next steps if a deal were to be reached and what that might look like. Ahead of the discussions, Sir Keir spoke with the Dutch leader Dick Schoof where both leaders agreed Ukraine's defence still needs international support, and that Ukraine's security is vital to European security. But while Russia's war machine shows no signs of abating, a warm welcome and kind words won't be enough to satisfy the embattled Ukrainian president at a time when Russian drone and missile attacks continue to bombard Kyiv. What is the latest in negotiations? Over the weekend, Mr Zelenskyy said he had discussed \"next steps\" with US President Donald Trump's advisers and was \"determined to keep working in good faith\". \"The American representatives know the basic Ukrainian positions,\" Mr Zelenskyy said in his nightly video address. \"The conversation was constructive, although not easy.\" But on Sunday evening, ahead of an event at the Kennedy Center, President Trump said he was \"disappointed\" with Mr Zelenskyy, as was asked about the next steps in Russia-Ukraine talks following negotiations. He said: \"We've been speaking to President Putin and we've been speaking to Ukrainian leaders, including Zelenskyy, President Zelenskyy. \"And I have to say that I'm a little bit disappointed that President Zelenskyy hasn't yet read the proposal. That was as of a few hours ago. \"His people love it. But he hasn't - Russia's fine with it. Russia's you know, Russia, I guess, would rather have the whole country when you think of it. But Russia is, I believe, fine with it, but I'm not sure that Zelenskyy's fine with it. His people love it but he hasn't read it.\" Read more:Ukraine has become Europe's war - so why doesn't it act like it?Inside a secret underground military base in eastern Ukraine On Saturday, Keith Kellogg, Trump's outgoing Ukraine envoy, had told the Reagan National Defence Forum that efforts to resolve the conflict were in \"the last 10 metres\". Kremlin spokesman Dmitry Peskov praised new US security strategy over the weekend, adding that Russia hopes this would lead to \"further constructive cooperation with Washington on the Ukrainian settlement\"."
    },
    {
        "title": "Reform UK denies Nigel Farage broke electoral law",
        "description": "Reform UK has denied claims of Nigel Farage breaking electoral law.",
        "url": "https://news.sky.com/story/reform-uk-denies-nigel-farage-broke-electoral-law-13480773",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-farage-nigel_7104253.jpg?20251208001029",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2025-12-07 22:13:00",
        "Headline": "It follows reports Nigel Farage has been referred to the police over claims he falsified election expenses.",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  Reform UK has denied claims of Nigel Farage breaking electoral law. It follows a report in Monday's The Daily Telegraph that Mr Farage has been referred to the police by a former member of his campaign team over claims he falsified election expenses. The claims relate to Mr Farage's campaign in Clacton-on-Sea, the seat he won for Reform UK in the 2024 General Election. In a statement, a Reform UK spokesperson said: \"These inaccurate claims come from a disgruntled former councillor... the party denies breaking electoral law. We look forward to clearing our name.\" According to the Telegraph, the claims have been made by Richard Everett, a former Reform councillor. It is reported by the Telegraph that Mr Everett has submitted documents to the Metropolitan Police. Mr Everett was one of four councillors who defected from the Conservatives to Reform UK on the eve of the 2024 General Election campaign. Sky News has not verified the allegations and the Metropolitan Police and the Electoral Commission are yet to comment. Both Labour and the Conservatives have called for answers from Mr Farage."
    },
    {
        "title": "British documentary photographer Martin Parr dies ",
        "description": "Martin Parr CBE, the famed British documentary photographer hailed as \"a giant\" of his craft,&#160;has died aged 73.",
        "url": "https://news.sky.com/story/british-documentary-photographer-martin-parr-dies-13480590",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-martin-parr_7103906.jpg?20251207155844",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-07 15:12:00",
        "Headline": "Parr was recognised in the Queen's 2021 birthday honours with a CBE for services to photography and was \"one of the best-known documentary photographers of his generation\", according to a description on his foundation's website.",
        "Content": "Martin Parr CBE, the famed British documentary photographer hailed as \"a giant\" of his craft, has died aged 73. The Martin Parr Foundation announced his death in a statement on their website on Sunday saying: \"It is with great sadness that we announce that Martin Parr (1952-2025) died yesterday at home in Bristol. \"He is survived by his wife Susie, his daughter Ellen, his sister Vivien and his grandson George. The family asks for privacy at this time. \"The Martin Parr Foundation and Magnum Photos will work together to preserve and share Martin's legacy. \"More information on this will follow in due course. Martin will be greatly missed.\" Parr was recognised in the Queen's 2021 birthday honours with a CBE for services to photography and was \"one of the best-known documentary photographers of his generation\", according to a description on his foundation's website. Parr, who was born in Surrey and based his career in Bristol, had been a member of Magnum Photos since 1994 and was president from 2013 to 2017. \n                  Man arrested after people 'pepper sprayed' in Heathrow suitcase robbery\n                 \n                  Lando Norris wins F1 World Championship after dramatic decider in Abu Dhabi\n                 \n                  Politics latest: Benefits warning for young as jobs plan announced; Tory calls on Farage to be 'straight' about past\n                 Read more from Sky News:Lando Norris wins first F1 World ChampionshipCruise ship stuck in port after banana containers fall into sea In 2017, Parr established the Martin Parr Foundation as a home for British photography. 'A giant of photography' In a quote about his style on a dedicated page on Magnum, Parr said: \"With photography, I like to create fiction out of reality. I try and do this by taking society's natural prejudice and giving this a twist.\" His work has been collected by some of the world's leading museums, including the Tate in the UK, the Centre Pompidou in Paris and the Museum of Modern Art in New York. The British Journal of Photography paid tribute to him, with a statement saying: \"A giant of photography, Martin Parr helped foster a seachange in documentary at Magnum Photos and went on to publish scores of photobooks and win retrospectives at Barbican Art Gallery and Jeu de Paume, Paris. \"He also championed other image-makers, supporting them through his collection and through his publishing activities and gallery space.\""
    }
]