[
    {
        "title": "'I'm deprived of my UK citizenship but I'm not a convicted terrorist'",
        "description": "Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria.",
        "url": "https://news.sky.com/story/im-deprived-of-my-uk-citizenship-but-im-not-a-convicted-terrorist-13415693",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tauqir-sharif-uk-citizenship-stripped_6999685.jpg?20250824022103",
        "type": "Home",
        "Author": "Tom Cheshire",
        "Date Published": "2025-08-23 23:01:00",
        "Headline": "The UK uses deprivation of citizenship orders \"more than almost any country in the world\" - but there are now questions over what it means for those who travelled to Syria.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria. It was a monumental transformation for them, their country and the wider Middle East. But potentially too for British people who went to Syria - and who were stripped of their citizenship as a result, on the grounds of national security. Tauqir Sharif, better known as Tox, went to Syria in 2012 as an aid worker. He was accused of being part of a group affiliated with al Qaeda, which he denies, and the then-home secretary Amber Rudd deprived him of his British citizenship in 2017. \"As of now, I am deprived of my UK citizenship but I'm not a convicted terrorist - and the reason for that is because we refused, we boycotted, the SIAC [Special Immigration Appeals Commission] secret courts, which don't allow you to see any of the evidence presented against you,\" he said. \"And one of the things that I always called for was, look, put me in front of a jury, let's have an open hearing.\" HTS is still a proscribed terrorist organisation but the British government has now established relations with it. Foreign Secretary David Lammy travelled to Damascus to meet the jihadist-turned-Syrian interim president - the man who swapped his nom de guerre of al Jolani for Ahmed al Sharaa. If the UK government takes HTS off the terror list, what does that mean for those who lost their citizenship after being accused of being part of it? People who joined HTS are only a subset among the scores of people who have had their citizenship revoked - a tool the UK government has been quick to use. According to a report by the Parliamentary Joint Human Rights Committee, the UK \"uses deprivation of citizenship orders more than almost any country in the world\". The peak of that was in 2017, and mainly in relation to Syria - especially in the case of people joining Islamic State, perhaps most famously Shamima Begum. And because people cannot be made entirely stateless, and need to have a second nationality, or be potentially eligible for one, there are worries of racism in who the orders apply to. Countries like Pakistan and Bangladesh offer dual nationality, whereas other nations do not. In 2022, the Institute of Race Relations said \"the vast majority of those deprived are Muslim men with South Asian or Middle Eastern/North African heritage\". Legal grey areas Sky News submitted Freedom of Information requests to the Home Office asking for a breakdown of second nationalities of those deprived of citizenship, but was refused twice on national security grounds. The independent reviewer of terrorism legislation, Jonathan Hall KC, told Sky News there are issues around transparency. \"I do think there is a problem when you have people whose relationship with the country that they're left with is really technical and they may never have realised that they had that citizenship before and may never gone to that country,\" he said. \"Me and my predecessors have all said, owing to how frequently this power is used, it should be something that the independent reviewer should have the power to review. I asked, my predecessor asked, we've both been told no, so I agree there's a lack of transparency.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend No automatic reversal Even if the government does remove HTS from the terror list, it would not automatically invalidate decisions to deprive people of their citizenship. Macer Gifford gave up a career as a banker in London to join the Kurdish People's Protection Units (YPG) as a foreign volunteer between 2015 and 2017. He told Sky News that decisions \"made years ago in the interest of the British public have to remain\". \"We can't sort of go through previous cases nitpicking through it, wasting time and money to bring it up to date,\" he added. \"We can't be naive because the intent to go out, the decision to go in itself is a huge decision for them. So it shows commitment when they're there, they then, if they take an active participation in the organisations that they've been accused of joining, again, that involves training and perseverance and dedication to the cause.\" But those born and raised in Britain, who joined the same cause, and lost their citizenship as a result, might reasonably ask why that should remain the case."
    },
    {
        "title": "Criminals could be banned from pubs and sports grounds under new plans",
        "description": "Criminals face being banned from pubs, sports grounds and concerts under new government plans to give judges powers to pass tougher community sentences.",
        "url": "https://news.sky.com/story/criminals-could-be-banned-from-pubs-and-sports-grounds-under-new-plans-13417328",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-officer-prisons_6932011.jpg?20250531160740",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:46:00",
        "Headline": "The new measures, which would apply to people in England and Wales, \"should remind all offenders that, under this government, crime does not pay\", Justice Secretary Shabana Mahmood said.",
        "Content": "Criminals face being banned from pubs, sports grounds and concerts under new government plans to give judges powers to pass tougher community sentences. The new measures, which would apply to people in England and Wales, \"should remind all offenders that, under this government, crime does not pay\", Justice Secretary Shabana Mahmood said. Offenders' freedom could also be curtailed with limits on driving, travel bans and restriction zones confining them to specific areas, the government said. Similar measures could also apply to prisoners let out on licence, while drug testing would be expanded to include all those released, rather than just those with a history of substance misuse. While judges are currently able to impose limited bans for specific crimes, such as football bans for crimes committed inside a stadium on match day, the new measures would allow for such bans to be handed down for any offence.  The justice secretary said: \"When criminals break society's rules, they must be punished. \"Those serving their sentences in the community must have their freedom restricted there too. \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 \n                  Man guilty over Dalston gangland shooting that left nine-year-old girl with bullet lodged in brain\n                 \"These new punishments should remind all offenders that, under this government, crime does not pay. \"Rightly, the public expect the government to do everything in its power to keep Britain safe, and that's what we're doing.\" The proposals are part of the Labour government's efforts to tackle overcrowding in prisons. Back in June, it emerged that prisoners were to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government. Sky News reported earlier this month how the prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, according to an independent review by former chief inspector of prisons, Dame Anne Owers. The report said there was a systemic problem which has led to recurring prison capacity crises over the last 18 years."
    },
    {
        "title": "UK braces for more protests over the use of hotels to house asylum seekers",
        "description": "Protests by groups opposed to asylum seeker hotels and counter-demonstrations have taken place in towns and cities across the UK - and further action is expected today.",
        "url": "https://news.sky.com/story/police-separate-anti-immigration-and-anti-racism-protesters-across-the-country-13416694",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-asylum-hotel-protests_6999682.jpg?20250824010002",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-23 14:08:00",
        "Headline": "Protesters gathered across the country on Saturday as groups demonstrated against asylum seeker housing and were met by anti-racism campaigners.",
        "Content": " Protests by groups opposed to asylum seeker hotels and counter-demonstrations have taken place in towns and cities across the UK - and further action is expected today. On Saturday, demonstrations under the Abolish Asylum System slogan were held in England, Scotland and Wales, including in Bristol, Exeter, Tamworth, Cannock, Aberdeen, Mold, Perth, Nuneaton, Liverpool, Wakefield, Newcastle, Horley and Canary Wharf. Counter-protests were also organised by campaign group Stand Up to Racism. In Bristol, mounted police separated the two groups in the Castle Park, with officers scuffling with protesters. A 37-year-old woman was arrested on suspicion of assaulting an emergency worker.  Avon and Somerset Police said no officer sustained serious physical injury or has required hospital treatment, but inquiries will be carried out after reports of assaults on officers. Chief Inspector Keith Smith said: \"While there were moments of disturbance, we're pleased to say the two protests have passed without significant incident.\" \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  The latest migration stats are going in the wrong direction - and the argument might get more vicious\n                 \n                  Asylum seekers in hotels rise by 8% under Labour\n                 Police kept around 200 anti-immigration protesters draped in English flags away from roughly 50 Stand Up to Racism protesters in Horley, Surrey. One man, wearing a West Ham United football shirt, was held by police as he yelled: \"You're not welcome here, you're not welcome here, you're not welcome here\" at anti-racism protesters. Read more:Who says what on asylum hotels18 councils pursuing or considering legal action to block asylum hotelsMigration stats going in the wrong directionLabour may have walked into political trap over Epping hotel Anti-immigration protesters also chanted: \"Tommy, Tommy, Tommy, Tommy Robinson\" in support of the far-right activist, whose real name is Stephen Yaxley-Lennon. The anti-racism protesters chanted \"say it loud, say it clear, refugees are welcome here\" and held signs calling for solidarity and to \"stop deportations\". The Stand Up to Racism protesters were shepherded into a smaller area as they continued to chant: \"No hate, no fear, refugees are welcome here\", which was met with \"No they're f****** not\" from the other side of the street. Three people were arrested - two for breach of the peace and one for breaching the conditions of a community protection notice, Surrey Police said. In Perth, protesters gathered outside the Radisson Hotel. The anti-migration protesters held up signs with slogans such as \"Perth is full - empty the hotels\" and \"get them out\". Stand Up to Racism Scotland said it had achieved \"victory\" in Perth, with more than 200 gathering to oppose the Abolish Asylum System demonstration. Merseyside Police said 11 arrests were made for various offences, including being drunk and disorderly, assault and affray, after a UKIP protest and a counter-protest in Liverpool city centre on Saturday. A dispersal order was issued in the city to try to contain the protests. Protests today are expected to take place in Manchester, Birmingham, Dudley, Norwich, Epping, and London. The weekend of action comes amid continued tension around the use of the hotels for asylum seekers. Regular protests had been held outside the Bell Hotel in Epping, Essex, which started after an asylum seeker housed there was charged with sexually assaulting a 14-year-old girl on 10 July. Hadush Gerberslasie Kebatu, 38, was charged with trying to kiss a teenage girl and denies the allegations. He is due to stand trial later this month. In the wake of those protests, Epping Forest District Council sought and won an interim High Court injunction to stop migrants from being accommodated there - a decision which the government is seeking permission to appeal. Prime Minister Sir Keir Starmer posted on X saying: \"We are tackling illegal migration. Since July last year, 5,300 foreign national offenders have been returned. \"This is our Plan for Change in action.\""
    },
    {
        "title": "Reform UK's new immigration plans would have been seen as extreme just a few years ago",
        "description": "Mass deportations. Prison camps. Quitting the Refugee Convention and the UN Convention on Torture.",
        "url": "https://news.sky.com/story/reform-uks-new-immigration-plans-wouldve-been-extreme-just-a-few-years-ago-13416752",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-data-forensics_6983605.png?20250805184125",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-23 13:26:00",
        "Headline": "While the government has made some progress in reducing the cost of asylum hotels - down from £8.3m a day in 2023/4 to £5.77m a day in 2024/5 - the overall numbers accommodated in this way have gone up by 8% since Labour took charge, thanks to the surge in new claims.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Mass deportations. Prison camps. Quitting the Refugee Convention and the UN Convention on Torture. A shrug of the shoulders at the idea of the UK sending asylum seekers back to places like Afghanistan or Eritrea, where they could be tortured or executed. \"I'm really sorry, but we can't be responsible for everything that happens in the whole of the world,\" says Nigel Farage. \"Who is our priority?\" The Reform UK leader has been setting out his party's new plans to address illegal migration in an interview with The Times newspaper - a set of policies, and a use of language, which would surely have been seen as extreme just a few years ago. Only last autumn the Reform leader repeatedly shied away from the concept of \"mass deportations\", describing the idea as \"a political impossibility\". But now he's embraced Trump-style immigration rhetoric. \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 \n                  Labour may have walked into political trap over housing asylum seekers in hotels\n                 It's not surprising that Reform want to capitalise on the outpouring of public anger over the use of hotels to house asylum seekers. The policy was started by the previous Conservative government, in response to housing shortages - and Labour has failed to make significant progress on its promise to stop it.  But all the major parties have shifted firmly to the right on this issue. There's been very little political criticism of the aggressiveness of Farage's policy suggestions, and the premise that the UK should no longer offer sanctuary to anyone who arrives here illegally. The Tory response has been to complain that he's just copying the ideas they didn't quite get round to implementing before calling the general election. \"Four months late, this big reveal is just recycling many ideas the Conservatives have already announced,\" said Chris Philp MP, the shadow home secretary. \"Labour's border crisis does urgently need to be fixed with tough and radical measures, but only the Conservatives have done - and will continue to do - the detailed work to deliver a credible plan that will actually work in practice.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomFive killed after tour bus returning from Niagara Falls crashes Certainly, the ambition to arrest and deport everyone who arrives in a small boat - regardless of whether or not they have legitimate grounds for asylum - has clear echoes of the Tories' Rwanda policy. Despite spending £700m on the controversial idea, only four volunteers were ever sent to Kigali before it was cancelled by Sir Keir Starmer, who branded it a gimmick.  Labour have suggested they've diverted Home Office resources that were freed up by that decision into processing asylum claims more quickly and increasing deportations. They're hoping tougher action against the criminal gangs and the new \"one in one out\" deal with France will help deter the number of people crossing the Channel in small boats in the first place, currently at record levels. But rather than offering any defence of the principle of offering asylum to genuine refugees - Labour's Angela Eagle MP, the border security minister, has also focused on the feasibility of Farage's policies. \"Nigel Farage is simply plucking numbers out of the air, another pie in the sky policy from a party that will say anything for a headline,\" she said. \"We are getting a grip of the broken asylum system. Making sure those with no right to be here are removed or deported.\" Even the Liberal Democrats have taken a similar approach. \"This plan sums up Nigel Farage perfectly, as like him it doesn't offer any real solutions,\" they said. \"Whilst Farage continues to stoke division, we Liberal Democrats are more interested in delivering for our local communities.\" It's been left to the Refugee Council to defend the principle of asylum. \"After the horrors of the Second World War, Britain and its allies committed to protecting those fleeing persecution,\" said CEO Enver Solomon. \"The Refugee Convention was our collective vow of 'never again' - a legal framework ensuring that people who come to our country seeking safety get a fair chance to apply for asylum. \"That commitment remains vital today. Whether escaping conflict in Sudan or repression under regimes like the Taliban, people still need protection. \"Most find refuge in neighbouring countries. But some will seek sanctuary in Europe, including Britain. \"We can meet this challenge by upholding a fair, managed system that determines who qualifies for protection and who does not.\" But with Reform leading in the polls, and protests outside hotels across the country - politicians of all stripes are under pressure to respond to public frustration over the issue. A recent YouGov poll found half of voters now believe immigration over the last ten years has been mostly bad for the country - double the figure just three years ago. While the government has made some progress in reducing the cost of asylum hotels - down from £8.3m a day in 2023/4 to £5.77m a day in 2024/5 - the overall numbers accommodated in this way have gone up by 8% since Labour took charge, thanks to the surge in new claims. Sir Keir has previously said he won't make a promise he can't keep. But current efforts to end the use of asylum hotels by 2029 are clearly not working. That's a credibility gap Farage is more than ready to exploit."
    },
    {
        "title": "Three people in a life-threatening condition after 'arson attack' at restaurant",
        "description": "Three people are in a&#160;life-threatening condition after a suspected arson attack at a restaurant in Ilford, say police.",
        "url": "https://news.sky.com/story/three-people-in-a-life-threatening-condition-after-arson-attack-at-restaurant-13416616",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ilford-arson_6998580.jpg?20250823123205",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-23 10:32:00",
        "Headline": "Five people were injured in the fire. Nine others were able to get out, according to London Fire Brigade.",
        "Content": " Three people are in a life-threatening condition after a suspected arson attack at a restaurant in Ilford, say police. Five people - three women and two men - were injured in the fire, which broke out shortly after 9pm on Friday at Indian Aroma on Woodford Avenue, Gants Hill. No arrests have been made. Hospital porter Edward Thawe went to help with his son after hearing screams from his nearby home. He described the scene as \"horrible\" and \"more than scary and the sort of thing that you don't want to look at twice\". He said: \"I heard screaming and people saying they had called the police.\" The 43-year-old said he saw a woman and a severely burned man who may have been customers. \n                  Metropolitan Police officer charged with multiple counts of rape and sexual assault\n                 \n                  Bromley burglary: £500,000 worth of gold stolen from home\n                 \n                  Man stabbed to death in New Cross named - as two arrested on suspicion of murder\n                 He added that the man's \"whole body was burnt\", including his shirt, but he was still wearing his trousers. After being treated at the scene by paramedics from the London Ambulance Service, the victims were taken to hospital. Nine others were able to get out beforehand, London Fire Brigade (LFB) said in a statement. \"The brigade's control officers received seven calls about the fire and mobilised crews from Ilford, Hainault, Leytonstone and Woodford fire stations to the scene. The fire was extinguished by 10.32pm,\" said an LFB spokesperson. \"We understand this incident will cause concern within the community. My team of specialist detectives are working at speed to piece the incident together,\" said Detective Chief Inspector Mark Rogers, of the Met's Central Specialist Crime North unit. \"Locals can expect to see a large police presence in the area. If you have any concerns, please speak to those officers on the ground.\" Read more from Sky News:What Epstein's right-hand woman says about Prince AndrewThird arrest over sex toy throwing at women's basketball gamesWhy Donald Trump believes he 'deserves the Nobel Peace Prize' Another Ilford resident, who did not want to be named, said he came outside after hearing screaming and sirens, where he saw three \"severely burned\" people being doused by the emergency services and given oxygen. \"I can only imagine the pain they were going through,\" he said. \"I could not sleep properly last night over it. It was just [an] absolutely horrible situation.\" The London Ambulance Service told Sky News: \"We sent resources to the scene, including ambulance crews, an advanced paramedic, an incident response officer and paramedics from our hazardous area response team. \"We treated five people for burns and smoke inhalation. We took two patients to a major trauma centre and three others to local hospitals.\" Health secretary Wes Streeting, who is the MP for Ilford North, posted on X to thank the emergency services for their response to the fire. He also asked his constituents to \"please avoid the area for now\". Anyone with information is urged to contact the Met via 101, quoting 7559/22AUG. If you wish to remain anonymous, please speak with Crimestoppers on 0800 555 111."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador threatened with deportation to Uganda one day after release",
        "description": "A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-threatened-with-deportation-to-uganda-one-day-after-release-13417392",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:56:00",
        "Headline": "Lawyers for Kilmar Abrego Garcia said in a filing that ICE officials offered the 29-year-old deportation to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison.",
        "Content": "A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers. Kilmar Abrego Garcia, 29 and originally from El Salvador, has been charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US. He was released from federal detention on Friday after being held since March, when he was arrested and then deported back to his home country by Immigration and Customs Enforcement (ICE) officials. In a new filing to the Tennessee court on Saturday, Mr Garcia's defence lawyers said that immigration officials threatened the 29-year-old with deportation to Uganda earlier in the week. According to the filing, while he was held in Putnam County Jail on Thursday, Mr Garcia declined an offer to be deported to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison. After he left jail on Friday, ICE notified his attorneys that he would be deported to Uganda and should report to immigration authorities on Monday. That same day, the Trump administration \"informed Mr Abrego that he has until first thing Monday morning - precisely when he must report to ICE's Baltimore Field Office - to accept a plea in exchange for deportation to Costa Rica, or else that offer will be off the table forever\". \n                  Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador released after months in federal custody\n                 \n                  Why Donald Trump believes he 'deserves the Nobel Peace Prize' and 'ended seven wars'\n                 \n                  Donald Trump makes announcement in the Oval Office\n                 Filed along with the brief was a letter from the Costa Rican government stating that Mr Garcia would be welcomed to that country as a legal immigrant and wouldn't face the possibility of detention. Justice Department spokesperson Chad Gilmartin responded in a statement and said: \"A federal grand jury has charged Abrego Garcia with serious federal crimes... underscoring the clear danger this defendant presents to the community. \"This defendant can plead guilty and accept responsibility or stand trial before a jury. Either way, we will hold Abrego Garcia accountable and protect the American people.\" Simon Sandoval-Moshenberg, one of Mr Garcia's attorneys, said he would \"fight tooth and nail against any form of deportation to Uganda\" or nearby countries in Africa. \"It is preposterous that they would send him to Africa, to a country where he doesn't even speak the language, a country with documented human rights violations, when there are so many other options,\" he said. \"This family has suffered enough.\" However, Mr Sandoval-Moshenberg appeared to suggest that deportation to Costa Rica might be favourable for his client, saying: \"That's a pretty reasonable option, right? I mean, Costa Rica makes sense. \"It's a Spanish-speaking country. It's proximate to the United States. His family can visit him there easily.\" Mr Garcia, who lived in Maryland with his American wife and son, was deported to El Salvador under a controversial 18th-century law. He was then imprisoned in its notorious maximum security Terrorism Confinement Center (CECOT). This was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country. Democrat senator Chris Van Hollen, who met Mr Garcia in CECOT, said the 29-year-old was \"traumatised\" by the experience. Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend The Trump administration admitted that deporting Mr Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador. After eventually returning him to the US in June, the Trump administration detained Mr Garcia on criminal charges that were filed in May. The criminal indictment alleges Mr Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Homeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Mr Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs. Mr Garcia's lawyers strongly deny the claims."
    },
    {
        "title": "Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year",
        "description": "A new fast-track asylum appeals process will be introduced to speed up the process of deporting people without a right to remain in the UK, the home secretary has said.",
        "url": "https://news.sky.com/story/fast-track-asylum-appeals-process-to-be-introduced-as-average-time-for-decisions-is-more-than-one-year-13417386",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-home-secretary-yvette-cooper_6983493.jpg?20250805161518",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:27:00",
        "Headline": "As it currently takes, on average, more than a year to reach a decision on asylum appeals, the government plans to set up a new independent panel focused on asylum appeals to help reduce the backlog, as first reported by The Sunday Times.",
        "Content": " A new fast-track asylum appeals process will be introduced to speed up the process of deporting people without a right to remain in the UK, the home secretary has said. As it currently takes, on average, more than a year to reach a decision on asylum appeals, the government plans to set up a new independent panel focused on asylum appeals to help reduce the backlog. Home Secretary Yvette Cooper said \"completely unacceptable\" delays in the appeals process left failed asylum seekers in the system for years. There are about 51,000 asylum appeals waiting to be heard. The new independent body will use professionally-trained adjudicators, rather than relying on judges. Ministers are introducing a new 24-week deadline for the first-tier tribunal to determine asylum appeals by those receiving accommodation support and appeals by foreign offenders.  But they believe the current tribunal system, which covers a wide range of different cases, is still failing to ensure failed asylum seekers can be returned as swiftly as possible, nor can it accommodate a fast-track system for safe countries. \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 \n                  Labour may have walked into political trap over housing asylum seekers in hotels\n                 It comes amid protests about the use of hotel accommodation for migrants. The home secretary said the overhaul would result in a system which is \"swift, fair and independent, with high standards in place\". Read more from Sky News:UK set to bask in 30C sunshine over bank holiday weekendCoca-Cola brews up sale of high street coffee giant Costa She said: \"We inherited an asylum system in complete chaos with a soaring backlog of asylum cases and a broken appeals system with thousands of people in the system for years on end. \"That is why we are taking practical steps to fix the foundations and restore control and order to the system. \"We are determined to substantially reduce the number of people in the asylum system as part of our plan to end asylum hotels. \"Already since the election, we have reduced the backlog of people waiting for initial decisions by 24% and increased failed asylum returns by 30%. \"But we cannot carry on with these completely unacceptable delays in appeals as a result of the system we have inherited which mean that failed asylum seekers stay in the system for years on end at huge cost to the taxpayer.\" Official figures released earlier this month showed a total of 111,084 people applied for asylum in the UK in the year to June 2025, the highest number for any 12-month period since current records began in 2001."
    },
    {
        "title": "UK set to bask in 30C sunshine over bank holiday weekend",
        "description": "Britons are set to bask in more sunshine this bank holiday weekend, with temperatures set to rise to 30C in some areas.&#160;",
        "url": "https://news.sky.com/story/uk-set-to-bask-in-30c-sunshine-over-bank-holiday-weekend-13417222",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-uk-summer-weather-heatwave_6988933.jpg?20250812130712",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-23 18:45:00",
        "Headline": "According to the Met Office, the weather will get gradually better over the long weekend, with Sunday being a bit warmer than Saturday but both days seeing a mix of cloud and sunshine.",
        "Content": "Britons are set to bask in more sunshine this bank holiday weekend, with temperatures set to rise to 30C in some areas.  According to the Met Office, the weather will get gradually better over the long weekend, with Sunday being a bit warmer than Saturday but both days seeing a mix of cloud and sunshine. Temperatures on Saturday are expected to reach 24C (75F), while on Sunday they should be around 25-26C (77-79F). On Monday, temperatures are expected to hit a maximum of 29C (84F) or even 30C (86F). Met Office meteorologist Craig Snell said: \"It's looking fairly fair, it's going to turn increasingly warm, the warmest day is going to be Monday. \"Each day there will be more sunshine developing.\" Saturday will see some showers breaking out in Northern Ireland, western parts of Scotland and northwest England, the forecaster said. \n                  Millions of people threatened by wildfires near their homes, research finds\n                 \n                  Hurricane Erin reaches wind speeds of up to 160mph near Caribbean\n                 \n                  UK weather: Amber heat health alert issued for large parts of England\n                 Like Saturday, Sunday will be a mix of cloud and sunshine, but it may be sunnier. There is also a risk of a few showers around northern and western parts of Scotland, Mr Snell said. After Monday, the sunny weather is due to end as remnants of Hurricane Erin are set to bring rain. Mr Snell said: \"It does stay for most of next week to the north west of the UK, so really strong winds stay offshore, the main impacts for us is it will bring a return of some rain. \"From Tuesday onwards some of the rain will be heavy so we'll keep an eye on that. \"Temperatures return back down to average, low 20s in the south. \"It will be a little bit blustery. There will be some more larger waves towards the western coasts. \"If you are planning to head towards the beach early next week, stay up to date with forecasts on our website... and keep up to date with the RNLI.\" Read more from Sky News:Coca-Cola brews up sale of high street coffee giant CostaBridgerton creator reacts to claims of 'woke' casting Chris Cousens, RNLI water safety lead, said: \"We want people to enjoy the bank holiday and stay safe, and with this unusually big surf forecast for this time of year likely to peak later in the bank holiday weekend and early next week, it's important for people to be aware so they can keep themselves and their families safe. \"Big surf means greater risk from rip currents and the swell also coincides with spring tides - which means more powerful tidal water movement at greater speed.\" He added: \"We always advise people to visit a lifeguarded beach where possible - but we also appreciate people will be out on the coast where lifeguards are not present.\""
    },
    {
        "title": "Coca-Cola brews up sale of high street coffee giant Costa",
        "description": "The Coca-Cola Company is brewing up a sale of Costa, Britain&#8217;s biggest high street coffee chain, more than six years after acquiring the business in a move aimed at helping it reduce its reliance on sugary soft drinks.",
        "url": "https://news.sky.com/story/coca-cola-brews-up-sale-of-high-street-coffee-giant-costa-13416553",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-costa-costa-coffee_6998429.jpg?20250823073743",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-23 05:54:00",
        "Headline": " The Atlanta-based soft drinks giant is working with bankers at Lazard to gauge interest in a sale of the coffee chain it agreed to buy in 2018 for £3.9bn, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Coca-Cola Company is brewing up a sale of Costa, Britain’s biggest high street coffee chain, more than six years after acquiring the business in a move aimed at helping it reduce its reliance on sugary soft drinks. Sky News can exclusively reveal that Coca-Cola is working with bankers to hold exploratory talks about a sale of Costa. Initial talks have already been held with a small number of potential bidders, including private equity firms, City sources said on Saturday. Lazard, the investment bank, is understood to have been engaged by Coca-Cola to review options for the business and gauge interest from prospective buyers. Indicative offers are said to be due in the early part of the autumn, although one source cautioned that Coca-Cola could yet decide not to proceed with a sale. Costa trades from more than 2,000 stores in the UK, and well over 3,000 globally, according to the latest available figures. It has been reported to have a global workforce numbering 35,000, although Coca-Cola did not respond to several attempts to establish the precise number of outlets currently in operation, or its employee numbers. \n                  'I'm deprived of my UK citizenship but I'm not a convicted terrorist'\n                 \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  UK braces for more protests over the use of hotels to house asylum seekers\n                 This weekend, analysts said that a sale could crystallise a multibillion pound loss on the £3.9bn sum Coca-Cola agreed to pay to buy Costa from Whitbread, the London-listed owner of the Premier Inn hotel chain, in 2018. One suggested that Costa might now command a price tag of just £2bn in a sale process. The disposal proceeds would, in any case, not be material to the Atlanta-based company, which had a market capitalisation at Friday's closing share price of $304.2bn (£224.9bn). At the time of the acquisition, Coca-Cola's chief executive, James Quincey, said: \"Costa gives Coca-Cola new capabilities and expertise in coffee, and our system can create opportunities to grow the Costa brand worldwide. \"Hot beverages is one of the few segments of the total beverage landscape where Coca-Cola does not have a global brand. \"Costa gives us access to this market with a strong coffee platform.\" However, accounts filed at Companies House for Costa show that in 2023 - the last year for which standalone results are available - the coffee chain recorded revenues of £1.22bn. While this represented a 9% increase on the previous year, it was below the £1.3bn recorded in 2018, the final year before Coca-Cola took control of the business. Read more from Sky News:TikTok puts hundreds of UK jobs at riskConsumer confidence at highest point this year Coca-Cola has been grappling with the weak performance of Costa for some time, with Mr Quincey saying on an earnings call last month: \"We're in the mode of reflecting on what we've learned, thinking about how we might want to find new avenues to grow in the coffee category while continuing to run the Costa business successfully.\" \"It's still a lot of money we put down, and we wanted that money to work as hard as possible.\" Costa's 2022 accounts referred to the financial pressures it faced from \"the economic environment and inflationary pressures\", resulting in it launching \"a restructuring programme to address the scale of overheads and invest for growth\". Filings show that despite its lacklustre performance, Costa has paid more than £250m in dividends to its owner since the acquisition. The deal was intended to provide Coca-Cola with a global platform in a growing area of the beverages market. Costa trades in dozens of countries, including India, Japan, Mexico and Poland, and operates a network of thousands of coffee vending machines internationally under the Costa Express brand. The chain was founded in 1971 by Italian brothers Sergio and Bruno Costa. It was sold to Whitbread for £19m in 1995, when it traded from fewer than 40 stores. The business is now one of Britain's biggest private sector employers, and has become a ubiquitous presence on high streets across the country. Its main rivals include Starbucks, Caffe Nero and Pret a Manger - the last of which is being prepared for a stake sale and possible public market flotation. It has also faced growing competition from more upmarket chains such as Gail's, the bakeries group, which has also been exploring a sale. Coca-Cola communications executives in the US and UK did not respond to a series of emails and calls from Sky News seeking comment on its plans for Costa. A Lazard spokesperson declined to comment."
    },
    {
        "title": "'I'm deprived of my UK citizenship but I'm not a convicted terrorist'",
        "description": "Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria.",
        "url": "https://news.sky.com/story/im-deprived-of-my-uk-citizenship-but-im-not-a-convicted-terrorist-13415693",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tauqir-sharif-uk-citizenship-stripped_6999685.jpg?20250824022103",
        "type": "UK",
        "Author": "Tom Cheshire",
        "Date Published": "2025-08-23 23:01:00",
        "Headline": "The UK uses deprivation of citizenship orders \"more than almost any country in the world\" - but there are now questions over what it means for those who travelled to Syria.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria. It was a monumental transformation for them, their country and the wider Middle East. But potentially too for British people who went to Syria - and who were stripped of their citizenship as a result, on the grounds of national security. Tauqir Sharif, better known as Tox, went to Syria in 2012 as an aid worker. He was accused of being part of a group affiliated with al Qaeda, which he denies, and the then-home secretary Amber Rudd deprived him of his British citizenship in 2017. \"As of now, I am deprived of my UK citizenship but I'm not a convicted terrorist - and the reason for that is because we refused, we boycotted, the SIAC [Special Immigration Appeals Commission] secret courts, which don't allow you to see any of the evidence presented against you,\" he said. \"And one of the things that I always called for was, look, put me in front of a jury, let's have an open hearing.\" HTS is still a proscribed terrorist organisation but the British government has now established relations with it. Foreign Secretary David Lammy travelled to Damascus to meet the jihadist-turned-Syrian interim president - the man who swapped his nom de guerre of al Jolani for Ahmed al Sharaa. If the UK government takes HTS off the terror list, what does that mean for those who lost their citizenship after being accused of being part of it? People who joined HTS are only a subset among the scores of people who have had their citizenship revoked - a tool the UK government has been quick to use. According to a report by the Parliamentary Joint Human Rights Committee, the UK \"uses deprivation of citizenship orders more than almost any country in the world\". The peak of that was in 2017, and mainly in relation to Syria - especially in the case of people joining Islamic State, perhaps most famously Shamima Begum. And because people cannot be made entirely stateless, and need to have a second nationality, or be potentially eligible for one, there are worries of racism in who the orders apply to. Countries like Pakistan and Bangladesh offer dual nationality, whereas other nations do not. In 2022, the Institute of Race Relations said \"the vast majority of those deprived are Muslim men with South Asian or Middle Eastern/North African heritage\". Legal grey areas Sky News submitted Freedom of Information requests to the Home Office asking for a breakdown of second nationalities of those deprived of citizenship, but was refused twice on national security grounds. The independent reviewer of terrorism legislation, Jonathan Hall KC, told Sky News there are issues around transparency. \"I do think there is a problem when you have people whose relationship with the country that they're left with is really technical and they may never have realised that they had that citizenship before and may never gone to that country,\" he said. \"Me and my predecessors have all said, owing to how frequently this power is used, it should be something that the independent reviewer should have the power to review. I asked, my predecessor asked, we've both been told no, so I agree there's a lack of transparency.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend No automatic reversal Even if the government does remove HTS from the terror list, it would not automatically invalidate decisions to deprive people of their citizenship. Macer Gifford gave up a career as a banker in London to join the Kurdish People's Protection Units (YPG) as a foreign volunteer between 2015 and 2017. He told Sky News that decisions \"made years ago in the interest of the British public have to remain\". \"We can't sort of go through previous cases nitpicking through it, wasting time and money to bring it up to date,\" he added. \"We can't be naive because the intent to go out, the decision to go in itself is a huge decision for them. So it shows commitment when they're there, they then, if they take an active participation in the organisations that they've been accused of joining, again, that involves training and perseverance and dedication to the cause.\" But those born and raised in Britain, who joined the same cause, and lost their citizenship as a result, might reasonably ask why that should remain the case."
    },
    {
        "title": "Criminals could be banned from pubs and sports grounds under new plans",
        "description": "Criminals face being banned from pubs, sports grounds and concerts under new government plans to give judges powers to pass tougher community sentences.",
        "url": "https://news.sky.com/story/criminals-could-be-banned-from-pubs-and-sports-grounds-under-new-plans-13417328",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-officer-prisons_6932011.jpg?20250531160740",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:46:00",
        "Headline": "The new measures, which would apply to people in England and Wales, \"should remind all offenders that, under this government, crime does not pay\", Justice Secretary Shabana Mahmood said.",
        "Content": "Criminals face being banned from pubs, sports grounds and concerts under new government plans to give judges powers to pass tougher community sentences. The new measures, which would apply to people in England and Wales, \"should remind all offenders that, under this government, crime does not pay\", Justice Secretary Shabana Mahmood said. Offenders' freedom could also be curtailed with limits on driving, travel bans and restriction zones confining them to specific areas, the government said. Similar measures could also apply to prisoners let out on licence, while drug testing would be expanded to include all those released, rather than just those with a history of substance misuse. While judges are currently able to impose limited bans for specific crimes, such as football bans for crimes committed inside a stadium on match day, the new measures would allow for such bans to be handed down for any offence.  The justice secretary said: \"When criminals break society's rules, they must be punished. \"Those serving their sentences in the community must have their freedom restricted there too. \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 \n                  Man guilty over Dalston gangland shooting that left nine-year-old girl with bullet lodged in brain\n                 \"These new punishments should remind all offenders that, under this government, crime does not pay. \"Rightly, the public expect the government to do everything in its power to keep Britain safe, and that's what we're doing.\" The proposals are part of the Labour government's efforts to tackle overcrowding in prisons. Back in June, it emerged that prisoners were to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government. Sky News reported earlier this month how the prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, according to an independent review by former chief inspector of prisons, Dame Anne Owers. The report said there was a systemic problem which has led to recurring prison capacity crises over the last 18 years."
    },
    {
        "title": "UK braces for more protests over the use of hotels to house asylum seekers",
        "description": "Protests by groups opposed to asylum seeker hotels and counter-demonstrations have taken place in towns and cities across the UK - and further action is expected today.",
        "url": "https://news.sky.com/story/police-separate-anti-immigration-and-anti-racism-protesters-across-the-country-13416694",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-asylum-hotel-protests_6999682.jpg?20250824010002",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 14:08:00",
        "Headline": "Protesters gathered across the country on Saturday as groups demonstrated against asylum seeker housing and were met by anti-racism campaigners.",
        "Content": " Protests by groups opposed to asylum seeker hotels and counter-demonstrations have taken place in towns and cities across the UK - and further action is expected today. On Saturday, demonstrations under the Abolish Asylum System slogan were held in England, Scotland and Wales, including in Bristol, Exeter, Tamworth, Cannock, Aberdeen, Mold, Perth, Nuneaton, Liverpool, Wakefield, Newcastle, Horley and Canary Wharf. Counter-protests were also organised by campaign group Stand Up to Racism. In Bristol, mounted police separated the two groups in the Castle Park, with officers scuffling with protesters. A 37-year-old woman was arrested on suspicion of assaulting an emergency worker.  Avon and Somerset Police said no officer sustained serious physical injury or has required hospital treatment, but inquiries will be carried out after reports of assaults on officers. Chief Inspector Keith Smith said: \"While there were moments of disturbance, we're pleased to say the two protests have passed without significant incident.\" \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  The latest migration stats are going in the wrong direction - and the argument might get more vicious\n                 \n                  Asylum seekers in hotels rise by 8% under Labour\n                 Police kept around 200 anti-immigration protesters draped in English flags away from roughly 50 Stand Up to Racism protesters in Horley, Surrey. One man, wearing a West Ham United football shirt, was held by police as he yelled: \"You're not welcome here, you're not welcome here, you're not welcome here\" at anti-racism protesters. Read more:Who says what on asylum hotels18 councils pursuing or considering legal action to block asylum hotelsMigration stats going in the wrong directionLabour may have walked into political trap over Epping hotel Anti-immigration protesters also chanted: \"Tommy, Tommy, Tommy, Tommy Robinson\" in support of the far-right activist, whose real name is Stephen Yaxley-Lennon. The anti-racism protesters chanted \"say it loud, say it clear, refugees are welcome here\" and held signs calling for solidarity and to \"stop deportations\". The Stand Up to Racism protesters were shepherded into a smaller area as they continued to chant: \"No hate, no fear, refugees are welcome here\", which was met with \"No they're f****** not\" from the other side of the street. Three people were arrested - two for breach of the peace and one for breaching the conditions of a community protection notice, Surrey Police said. In Perth, protesters gathered outside the Radisson Hotel. The anti-migration protesters held up signs with slogans such as \"Perth is full - empty the hotels\" and \"get them out\". Stand Up to Racism Scotland said it had achieved \"victory\" in Perth, with more than 200 gathering to oppose the Abolish Asylum System demonstration. Merseyside Police said 11 arrests were made for various offences, including being drunk and disorderly, assault and affray, after a UKIP protest and a counter-protest in Liverpool city centre on Saturday. A dispersal order was issued in the city to try to contain the protests. Protests today are expected to take place in Manchester, Birmingham, Dudley, Norwich, Epping, and London. The weekend of action comes amid continued tension around the use of the hotels for asylum seekers. Regular protests had been held outside the Bell Hotel in Epping, Essex, which started after an asylum seeker housed there was charged with sexually assaulting a 14-year-old girl on 10 July. Hadush Gerberslasie Kebatu, 38, was charged with trying to kiss a teenage girl and denies the allegations. He is due to stand trial later this month. In the wake of those protests, Epping Forest District Council sought and won an interim High Court injunction to stop migrants from being accommodated there - a decision which the government is seeking permission to appeal. Prime Minister Sir Keir Starmer posted on X saying: \"We are tackling illegal migration. Since July last year, 5,300 foreign national offenders have been returned. \"This is our Plan for Change in action.\""
    },
    {
        "title": "Reform UK's new immigration plans would have been seen as extreme just a few years ago",
        "description": "Mass deportations. Prison camps. Quitting the Refugee Convention and the UN Convention on Torture.",
        "url": "https://news.sky.com/story/reform-uks-new-immigration-plans-wouldve-been-extreme-just-a-few-years-ago-13416752",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-data-forensics_6983605.png?20250805184125",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-23 13:26:00",
        "Headline": "While the government has made some progress in reducing the cost of asylum hotels - down from £8.3m a day in 2023/4 to £5.77m a day in 2024/5 - the overall numbers accommodated in this way have gone up by 8% since Labour took charge, thanks to the surge in new claims.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Mass deportations. Prison camps. Quitting the Refugee Convention and the UN Convention on Torture. A shrug of the shoulders at the idea of the UK sending asylum seekers back to places like Afghanistan or Eritrea, where they could be tortured or executed. \"I'm really sorry, but we can't be responsible for everything that happens in the whole of the world,\" says Nigel Farage. \"Who is our priority?\" The Reform UK leader has been setting out his party's new plans to address illegal migration in an interview with The Times newspaper - a set of policies, and a use of language, which would surely have been seen as extreme just a few years ago. Only last autumn the Reform leader repeatedly shied away from the concept of \"mass deportations\", describing the idea as \"a political impossibility\". But now he's embraced Trump-style immigration rhetoric. \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 \n                  Labour may have walked into political trap over housing asylum seekers in hotels\n                 It's not surprising that Reform want to capitalise on the outpouring of public anger over the use of hotels to house asylum seekers. The policy was started by the previous Conservative government, in response to housing shortages - and Labour has failed to make significant progress on its promise to stop it.  But all the major parties have shifted firmly to the right on this issue. There's been very little political criticism of the aggressiveness of Farage's policy suggestions, and the premise that the UK should no longer offer sanctuary to anyone who arrives here illegally. The Tory response has been to complain that he's just copying the ideas they didn't quite get round to implementing before calling the general election. \"Four months late, this big reveal is just recycling many ideas the Conservatives have already announced,\" said Chris Philp MP, the shadow home secretary. \"Labour's border crisis does urgently need to be fixed with tough and radical measures, but only the Conservatives have done - and will continue to do - the detailed work to deliver a credible plan that will actually work in practice.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomFive killed after tour bus returning from Niagara Falls crashes Certainly, the ambition to arrest and deport everyone who arrives in a small boat - regardless of whether or not they have legitimate grounds for asylum - has clear echoes of the Tories' Rwanda policy. Despite spending £700m on the controversial idea, only four volunteers were ever sent to Kigali before it was cancelled by Sir Keir Starmer, who branded it a gimmick.  Labour have suggested they've diverted Home Office resources that were freed up by that decision into processing asylum claims more quickly and increasing deportations. They're hoping tougher action against the criminal gangs and the new \"one in one out\" deal with France will help deter the number of people crossing the Channel in small boats in the first place, currently at record levels. But rather than offering any defence of the principle of offering asylum to genuine refugees - Labour's Angela Eagle MP, the border security minister, has also focused on the feasibility of Farage's policies. \"Nigel Farage is simply plucking numbers out of the air, another pie in the sky policy from a party that will say anything for a headline,\" she said. \"We are getting a grip of the broken asylum system. Making sure those with no right to be here are removed or deported.\" Even the Liberal Democrats have taken a similar approach. \"This plan sums up Nigel Farage perfectly, as like him it doesn't offer any real solutions,\" they said. \"Whilst Farage continues to stoke division, we Liberal Democrats are more interested in delivering for our local communities.\" It's been left to the Refugee Council to defend the principle of asylum. \"After the horrors of the Second World War, Britain and its allies committed to protecting those fleeing persecution,\" said CEO Enver Solomon. \"The Refugee Convention was our collective vow of 'never again' - a legal framework ensuring that people who come to our country seeking safety get a fair chance to apply for asylum. \"That commitment remains vital today. Whether escaping conflict in Sudan or repression under regimes like the Taliban, people still need protection. \"Most find refuge in neighbouring countries. But some will seek sanctuary in Europe, including Britain. \"We can meet this challenge by upholding a fair, managed system that determines who qualifies for protection and who does not.\" But with Reform leading in the polls, and protests outside hotels across the country - politicians of all stripes are under pressure to respond to public frustration over the issue. A recent YouGov poll found half of voters now believe immigration over the last ten years has been mostly bad for the country - double the figure just three years ago. While the government has made some progress in reducing the cost of asylum hotels - down from £8.3m a day in 2023/4 to £5.77m a day in 2024/5 - the overall numbers accommodated in this way have gone up by 8% since Labour took charge, thanks to the surge in new claims. Sir Keir has previously said he won't make a promise he can't keep. But current efforts to end the use of asylum hotels by 2029 are clearly not working. That's a credibility gap Farage is more than ready to exploit."
    },
    {
        "title": "Three people in a life-threatening condition after 'arson attack' at restaurant",
        "description": "Three people are in a&#160;life-threatening condition after a suspected arson attack at a restaurant in Ilford, say police.",
        "url": "https://news.sky.com/story/three-people-in-a-life-threatening-condition-after-arson-attack-at-restaurant-13416616",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ilford-arson_6998580.jpg?20250823123205",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 10:32:00",
        "Headline": "Five people were injured in the fire. Nine others were able to get out, according to London Fire Brigade.",
        "Content": " Three people are in a life-threatening condition after a suspected arson attack at a restaurant in Ilford, say police. Five people - three women and two men - were injured in the fire, which broke out shortly after 9pm on Friday at Indian Aroma on Woodford Avenue, Gants Hill. No arrests have been made. Hospital porter Edward Thawe went to help with his son after hearing screams from his nearby home. He described the scene as \"horrible\" and \"more than scary and the sort of thing that you don't want to look at twice\". He said: \"I heard screaming and people saying they had called the police.\" The 43-year-old said he saw a woman and a severely burned man who may have been customers. \n                  Metropolitan Police officer charged with multiple counts of rape and sexual assault\n                 \n                  Bromley burglary: £500,000 worth of gold stolen from home\n                 \n                  Man stabbed to death in New Cross named - as two arrested on suspicion of murder\n                 He added that the man's \"whole body was burnt\", including his shirt, but he was still wearing his trousers. After being treated at the scene by paramedics from the London Ambulance Service, the victims were taken to hospital. Nine others were able to get out beforehand, London Fire Brigade (LFB) said in a statement. \"The brigade's control officers received seven calls about the fire and mobilised crews from Ilford, Hainault, Leytonstone and Woodford fire stations to the scene. The fire was extinguished by 10.32pm,\" said an LFB spokesperson. \"We understand this incident will cause concern within the community. My team of specialist detectives are working at speed to piece the incident together,\" said Detective Chief Inspector Mark Rogers, of the Met's Central Specialist Crime North unit. \"Locals can expect to see a large police presence in the area. If you have any concerns, please speak to those officers on the ground.\" Read more from Sky News:What Epstein's right-hand woman says about Prince AndrewThird arrest over sex toy throwing at women's basketball gamesWhy Donald Trump believes he 'deserves the Nobel Peace Prize' Another Ilford resident, who did not want to be named, said he came outside after hearing screaming and sirens, where he saw three \"severely burned\" people being doused by the emergency services and given oxygen. \"I can only imagine the pain they were going through,\" he said. \"I could not sleep properly last night over it. It was just [an] absolutely horrible situation.\" The London Ambulance Service told Sky News: \"We sent resources to the scene, including ambulance crews, an advanced paramedic, an incident response officer and paramedics from our hazardous area response team. \"We treated five people for burns and smoke inhalation. We took two patients to a major trauma centre and three others to local hospitals.\" Health secretary Wes Streeting, who is the MP for Ilford North, posted on X to thank the emergency services for their response to the fire. He also asked his constituents to \"please avoid the area for now\". Anyone with information is urged to contact the Met via 101, quoting 7559/22AUG. If you wish to remain anonymous, please speak with Crimestoppers on 0800 555 111."
    },
    {
        "title": "Family of Briton feared killed in Ukraine 'still don't have death certificate two months on'",
        "description": "The family of a British aid volunteer reportedly killed in a drone strike in Ukraine has said they are \"very disappointed\" by the response from authorities.",
        "url": "https://news.sky.com/story/family-of-briton-feared-killed-in-ukraine-still-dont-have-death-certificate-two-months-on-13416726",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-annie-lewis-marffy_6997779.jpg?20250823140840",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 13:03:00",
        "Headline": "The family of Annie Lewis Marffy, 69, is living in 'horrible red tape limbo' after police in Ukraine reported she had been killed in a drone strike.",
        "Content": "The family of a British aid volunteer reportedly killed in a drone strike in Ukraine has said they are \"very disappointed\" by the response from authorities. Annie Lewis Marffy, 69, travelled from her home in Silverton, near Exeter, in late May to deliver a green Toyota Rav4 packed with supplies. Her mission, arranged by non-profit organisation Aid Ukraine UK, was to take the vehicle in convoy with a British volunteer to the city of Kramatorsk in the Donetsk region - an area of intense fighting. Ms Lewis Marffy had travelled through Europe with a former soldier from Wales, who had to return to the UK after becoming unwell in Poland. The volunteer arrived in Ukraine on 4 June. The non-profit said she last contacted them on the evening of 10 June, saying she was 55 minutes from her destination. Ms Lewis Marffy reportedly sustained \"injuries incompatible with life\" in a Russian drone strike on the morning of 11 June, according to a police file.The Kramatorsk district police department said her body \"remains in an area of active hostilities, making it impossible to conduct evacuation measures to transfer the body to the forensic medical examination department\".Her family has requested that a death certificate be issued based on this information, either by local authorities or the Foreign, Commonwealth and Development Office (FCDO). They believe that having the certificate will help them properly mourn the \"brave, capable, and determined\" mother of three and start the probate proceedings. \n                  'I'm deprived of my UK citizenship but I'm not a convicted terrorist'\n                 \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  UK braces for more protests over the use of hotels to house asylum seekers\n                 The family said: \"All the family, the sisters and the sons, have been very disappointed at the reaction of the FCDO and the lack of response from the police.\"After all this time, we haven't got any report at all from the Ukrainian police. That has to come from Ukraine and would be sent to Devon and Cornwall Police.\" Read more from Sky News:Plans for huge new Chinese embassy delayed by governmentCoca-Cola brews up sale of high street coffee giant CostaThey said police had kept Ms Lewis Marffy's computer for examination, as it held information important for handling her affairs. A spokesperson for the FCDO said: \"We are supporting the family of a British woman who is missing in Ukraine and are in contact with the local authorities.\" Katarzyna Bylok, founder of Aid Ukraine, said that issuing a death certificate could take months or years, as Ms Lewis Marffy's remains cannot be safely recovered.She described the area where the volunteer allegedly died as a \"kill zone\".\"It leaves her family in a horrible red tape limbo,\" she added."
    },
    {
        "title": "Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year",
        "description": "A new fast-track asylum appeals process will be introduced to speed up the process of deporting people without a right to remain in the UK, the home secretary has said.",
        "url": "https://news.sky.com/story/fast-track-asylum-appeals-process-to-be-introduced-as-average-time-for-decisions-is-more-than-one-year-13417386",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-home-secretary-yvette-cooper_6983493.jpg?20250805161518",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:27:00",
        "Headline": "As it currently takes, on average, more than a year to reach a decision on asylum appeals, the government plans to set up a new independent panel focused on asylum appeals to help reduce the backlog, as first reported by The Sunday Times.",
        "Content": " A new fast-track asylum appeals process will be introduced to speed up the process of deporting people without a right to remain in the UK, the home secretary has said. As it currently takes, on average, more than a year to reach a decision on asylum appeals, the government plans to set up a new independent panel focused on asylum appeals to help reduce the backlog. Home Secretary Yvette Cooper said \"completely unacceptable\" delays in the appeals process left failed asylum seekers in the system for years. There are about 51,000 asylum appeals waiting to be heard. The new independent body will use professionally-trained adjudicators, rather than relying on judges. Ministers are introducing a new 24-week deadline for the first-tier tribunal to determine asylum appeals by those receiving accommodation support and appeals by foreign offenders.  But they believe the current tribunal system, which covers a wide range of different cases, is still failing to ensure failed asylum seekers can be returned as swiftly as possible, nor can it accommodate a fast-track system for safe countries. \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 \n                  Labour may have walked into political trap over housing asylum seekers in hotels\n                 It comes amid protests about the use of hotel accommodation for migrants. The home secretary said the overhaul would result in a system which is \"swift, fair and independent, with high standards in place\". Read more from Sky News:UK set to bask in 30C sunshine over bank holiday weekendCoca-Cola brews up sale of high street coffee giant Costa She said: \"We inherited an asylum system in complete chaos with a soaring backlog of asylum cases and a broken appeals system with thousands of people in the system for years on end. \"That is why we are taking practical steps to fix the foundations and restore control and order to the system. \"We are determined to substantially reduce the number of people in the asylum system as part of our plan to end asylum hotels. \"Already since the election, we have reduced the backlog of people waiting for initial decisions by 24% and increased failed asylum returns by 30%. \"But we cannot carry on with these completely unacceptable delays in appeals as a result of the system we have inherited which mean that failed asylum seekers stay in the system for years on end at huge cost to the taxpayer.\" Official figures released earlier this month showed a total of 111,084 people applied for asylum in the UK in the year to June 2025, the highest number for any 12-month period since current records began in 2001."
    },
    {
        "title": "Human remains found in Lancashire may belong to children, say police",
        "description": "Human remains found by builders in Lancashire may belong to children, according to police.",
        "url": "https://news.sky.com/story/human-remains-found-in-lancashire-may-belong-to-children-say-police-13416582",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lytham-human-remains_6998465.png?20250823092120",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 07:59:00",
        "Headline": "The bones were found by builders working on renovations for a property in the town of Lytham.",
        "Content": "Human remains found by builders in Lancashire may belong to children, according to police. Fylde police officers were contacted at 12.37pm on 15 August after builders working on a house in Cleveland Road in Lytham found what they believed to be bones. After confirming the remains are human, police have said that \"they may be that of children\". The discovery is not being treated as suspicious, however, and officers believe \"this is an isolated historical burial\". \"This is an incredibly sad discovery, and we are continuing our inquiries to establish the identity of the remains, including their age and how they died,\" said DI Andrew Crook of West CID. Read more from Sky News:What Epstein's right-hand woman says about Trump and Prince AndrewThird arrest over sex toy throwing at women's basketball gamesWhy Donald Trump believes he 'deserves the Nobel Peace Prize' \"Whilst we are keeping an open mind, I want to make it clear that we are not treating this as suspicious. We believe at this stage that the burial is a historic one. \n                  Husband's tribute to mother-of-two killed by falling tree branch in Blackburn\n                 \n                  Ashvir Singh Johal takes charge at Morecambe and becomes first British Sikh to manage in England's top five leagues\n                 \n                  Drug dealer on e-bike who killed great-grandfather is jailed\n                 \"We would like to thank the homeowners and contractors for their patience whilst our inquiries were ongoing at the property.\" The remains have now been removed from the property, and inquiries will continue to attempt to identify who they are, police said. Police have asked for anyone with information that could assist in identifying them to get in touch on 101 quoting log 0616 of 15 August."
    },
    {
        "title": "UK set to bask in 30C sunshine over bank holiday weekend",
        "description": "Britons are set to bask in more sunshine this bank holiday weekend, with temperatures set to rise to 30C in some areas.&#160;",
        "url": "https://news.sky.com/story/uk-set-to-bask-in-30c-sunshine-over-bank-holiday-weekend-13417222",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-uk-summer-weather-heatwave_6988933.jpg?20250812130712",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-23 18:45:00",
        "Headline": "According to the Met Office, the weather will get gradually better over the long weekend, with Sunday being a bit warmer than Saturday but both days seeing a mix of cloud and sunshine.",
        "Content": "Britons are set to bask in more sunshine this bank holiday weekend, with temperatures set to rise to 30C in some areas.  According to the Met Office, the weather will get gradually better over the long weekend, with Sunday being a bit warmer than Saturday but both days seeing a mix of cloud and sunshine. Temperatures on Saturday are expected to reach 24C (75F), while on Sunday they should be around 25-26C (77-79F). On Monday, temperatures are expected to hit a maximum of 29C (84F) or even 30C (86F). Met Office meteorologist Craig Snell said: \"It's looking fairly fair, it's going to turn increasingly warm, the warmest day is going to be Monday. \"Each day there will be more sunshine developing.\" Saturday will see some showers breaking out in Northern Ireland, western parts of Scotland and northwest England, the forecaster said. \n                  Millions of people threatened by wildfires near their homes, research finds\n                 \n                  Hurricane Erin reaches wind speeds of up to 160mph near Caribbean\n                 \n                  UK weather: Amber heat health alert issued for large parts of England\n                 Like Saturday, Sunday will be a mix of cloud and sunshine, but it may be sunnier. There is also a risk of a few showers around northern and western parts of Scotland, Mr Snell said. After Monday, the sunny weather is due to end as remnants of Hurricane Erin are set to bring rain. Mr Snell said: \"It does stay for most of next week to the north west of the UK, so really strong winds stay offshore, the main impacts for us is it will bring a return of some rain. \"From Tuesday onwards some of the rain will be heavy so we'll keep an eye on that. \"Temperatures return back down to average, low 20s in the south. \"It will be a little bit blustery. There will be some more larger waves towards the western coasts. \"If you are planning to head towards the beach early next week, stay up to date with forecasts on our website... and keep up to date with the RNLI.\" Read more from Sky News:Coca-Cola brews up sale of high street coffee giant CostaBridgerton creator reacts to claims of 'woke' casting Chris Cousens, RNLI water safety lead, said: \"We want people to enjoy the bank holiday and stay safe, and with this unusually big surf forecast for this time of year likely to peak later in the bank holiday weekend and early next week, it's important for people to be aware so they can keep themselves and their families safe. \"Big surf means greater risk from rip currents and the swell also coincides with spring tides - which means more powerful tidal water movement at greater speed.\" He added: \"We always advise people to visit a lifeguarded beach where possible - but we also appreciate people will be out on the coast where lifeguards are not present.\""
    },
    {
        "title": "Coca-Cola brews up sale of high street coffee giant Costa",
        "description": "The Coca-Cola Company is brewing up a sale of Costa, Britain&#8217;s biggest high street coffee chain, more than six years after acquiring the business in a move aimed at helping it reduce its reliance on sugary soft drinks.",
        "url": "https://news.sky.com/story/coca-cola-brews-up-sale-of-high-street-coffee-giant-costa-13416553",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-costa-costa-coffee_6998429.jpg?20250823073743",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-23 05:54:00",
        "Headline": " The Atlanta-based soft drinks giant is working with bankers at Lazard to gauge interest in a sale of the coffee chain it agreed to buy in 2018 for £3.9bn, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Coca-Cola Company is brewing up a sale of Costa, Britain’s biggest high street coffee chain, more than six years after acquiring the business in a move aimed at helping it reduce its reliance on sugary soft drinks. Sky News can exclusively reveal that Coca-Cola is working with bankers to hold exploratory talks about a sale of Costa. Initial talks have already been held with a small number of potential bidders, including private equity firms, City sources said on Saturday. Lazard, the investment bank, is understood to have been engaged by Coca-Cola to review options for the business and gauge interest from prospective buyers. Indicative offers are said to be due in the early part of the autumn, although one source cautioned that Coca-Cola could yet decide not to proceed with a sale. Costa trades from more than 2,000 stores in the UK, and well over 3,000 globally, according to the latest available figures. It has been reported to have a global workforce numbering 35,000, although Coca-Cola did not respond to several attempts to establish the precise number of outlets currently in operation, or its employee numbers. \n                  'I'm deprived of my UK citizenship but I'm not a convicted terrorist'\n                 \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  UK braces for more protests over the use of hotels to house asylum seekers\n                 This weekend, analysts said that a sale could crystallise a multibillion pound loss on the £3.9bn sum Coca-Cola agreed to pay to buy Costa from Whitbread, the London-listed owner of the Premier Inn hotel chain, in 2018. One suggested that Costa might now command a price tag of just £2bn in a sale process. The disposal proceeds would, in any case, not be material to the Atlanta-based company, which had a market capitalisation at Friday's closing share price of $304.2bn (£224.9bn). At the time of the acquisition, Coca-Cola's chief executive, James Quincey, said: \"Costa gives Coca-Cola new capabilities and expertise in coffee, and our system can create opportunities to grow the Costa brand worldwide. \"Hot beverages is one of the few segments of the total beverage landscape where Coca-Cola does not have a global brand. \"Costa gives us access to this market with a strong coffee platform.\" However, accounts filed at Companies House for Costa show that in 2023 - the last year for which standalone results are available - the coffee chain recorded revenues of £1.22bn. While this represented a 9% increase on the previous year, it was below the £1.3bn recorded in 2018, the final year before Coca-Cola took control of the business. Read more from Sky News:TikTok puts hundreds of UK jobs at riskConsumer confidence at highest point this year Coca-Cola has been grappling with the weak performance of Costa for some time, with Mr Quincey saying on an earnings call last month: \"We're in the mode of reflecting on what we've learned, thinking about how we might want to find new avenues to grow in the coffee category while continuing to run the Costa business successfully.\" \"It's still a lot of money we put down, and we wanted that money to work as hard as possible.\" Costa's 2022 accounts referred to the financial pressures it faced from \"the economic environment and inflationary pressures\", resulting in it launching \"a restructuring programme to address the scale of overheads and invest for growth\". Filings show that despite its lacklustre performance, Costa has paid more than £250m in dividends to its owner since the acquisition. The deal was intended to provide Coca-Cola with a global platform in a growing area of the beverages market. Costa trades in dozens of countries, including India, Japan, Mexico and Poland, and operates a network of thousands of coffee vending machines internationally under the Costa Express brand. The chain was founded in 1971 by Italian brothers Sergio and Bruno Costa. It was sold to Whitbread for £19m in 1995, when it traded from fewer than 40 stores. The business is now one of Britain's biggest private sector employers, and has become a ubiquitous presence on high streets across the country. Its main rivals include Starbucks, Caffe Nero and Pret a Manger - the last of which is being prepared for a stake sale and possible public market flotation. It has also faced growing competition from more upmarket chains such as Gail's, the bakeries group, which has also been exploring a sale. Coca-Cola communications executives in the US and UK did not respond to a series of emails and calls from Sky News seeking comment on its plans for Costa. A Lazard spokesperson declined to comment."
    },
    {
        "title": "Plans for huge new Chinese embassy delayed by government",
        "description": "Approval of a huge new Chinese embassy in London has been delayed by the government over redacted areas on the embassy's plans.",
        "url": "https://news.sky.com/story/plans-for-huge-new-chinese-embassy-delayed-by-government-13416567",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chinese-embassy-mega_6936787.jpg?20250608113825",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-23 06:50:00",
        "Headline": "Opposition from local residents, lawmakers and pro-democracy campaigners means planning approval has been delayed for the past three years.",
        "Content": "Approval of a huge new Chinese embassy in London has been delayed by the government over redacted areas on the embassy's plans. Beijing hasn't fully explained why there are blacked-out areas in its planning application after housing minister Angela Rayner demanded an explanation earlier this month. The government has now delayed its decision over whether construction can go ahead from 9 September to 21 October, saying it needed more time to consider the application. The Chinese embassy in London expressed \"serious concern\" over the delay and said host countries have an \"international obligation\" to support the construction of diplomatic buildings. \"The Chinese side urges the UK side to fulfil its obligation and approve the planning application without delay,\" said the embassy in a statement. \"The planning and design of the new Chinese Embassy project is of high quality, which has been well recognised by various professional bodies. \"The planning application has followed the customary diplomatic practices, as well as necessary protocol and procedures.  \n                  Labubu maker's profits soar by nearly 400% in six months as ugly-cute toys become global sensation\n                 \n                  Swatch apologises for 'slanted eye' ad after backlash\n                 \n                  The Philippines condemns 'dangerous manoeuvres ' as Chinese vessels collide in Scarborough Shoal\n                 \"In our reply to [the Ministry of Housing, Communities & Local Government], we have provided a comprehensive response to the questions concerning the planning application. \"It is an international obligation of the host country to provide support and facilitation for the construction of diplomatic premises. Both China and the UK plan to build new embassies in each other's capitals.\" DP9, the planning consultancy working for the Chinese government, said its client felt it would be inappropriate to provide full internal layout plans. It added that additional drawings provided an acceptable level of detail, after the government asked why several areas were blacked out. \"The Applicant considers the level of detail shown on the unredacted plans is sufficient to identify the main uses,\" said DP9 in a letter to the government. \"In these circumstances, we consider it is neither necessary nor appropriate to provide additional more detailed internal layout plans or details.\" The embassy, which would be the largest in Europe, is planned for the 216-year-old site of the old Royal Mint Court next to the Tower of London. However, opposition from local residents, lawmakers and pro-democracy campaigners means planning approval has been delayed for the past three years. Read more from Sky News:What Epstein's right-hand woman says about Trump and Prince AndrewThird arrest over sex toy throwing at women's basketball gamesWhy Donald Trump believes he 'deserves the Nobel Peace Prize' Earlier this month, the embassy described claims that the building could have \"secret facilities\" used to harm Britain'snational security as \"despicable slandering\". However, the executive director of the Inter-Parliamentary Alliance on China, which has ties to a network of politicians critical of the country, called the explanations \"far from satisfactory\". Luke de Pulford, who is a long-standing critic of the embassy plans, said the \"assurances amount to 'trust me bro'\"."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador threatened with deportation to Uganda one day after release",
        "description": "A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-threatened-with-deportation-to-uganda-one-day-after-release-13417392",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:56:00",
        "Headline": "Lawyers for Kilmar Abrego Garcia said in a filing that ICE officials offered the 29-year-old deportation to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison.",
        "Content": "A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers. Kilmar Abrego Garcia, 29 and originally from El Salvador, has been charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US. He was released from federal detention on Friday after being held since March, when he was arrested and then deported back to his home country by Immigration and Customs Enforcement (ICE) officials. In a new filing to the Tennessee court on Saturday, Mr Garcia's defence lawyers said that immigration officials threatened the 29-year-old with deportation to Uganda earlier in the week. According to the filing, while he was held in Putnam County Jail on Thursday, Mr Garcia declined an offer to be deported to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison. After he left jail on Friday, ICE notified his attorneys that he would be deported to Uganda and should report to immigration authorities on Monday. That same day, the Trump administration \"informed Mr Abrego that he has until first thing Monday morning - precisely when he must report to ICE's Baltimore Field Office - to accept a plea in exchange for deportation to Costa Rica, or else that offer will be off the table forever\". \n                  Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador released after months in federal custody\n                 \n                  Why Donald Trump believes he 'deserves the Nobel Peace Prize' and 'ended seven wars'\n                 \n                  Donald Trump makes announcement in the Oval Office\n                 Filed along with the brief was a letter from the Costa Rican government stating that Mr Garcia would be welcomed to that country as a legal immigrant and wouldn't face the possibility of detention. Justice Department spokesperson Chad Gilmartin responded in a statement and said: \"A federal grand jury has charged Abrego Garcia with serious federal crimes... underscoring the clear danger this defendant presents to the community. \"This defendant can plead guilty and accept responsibility or stand trial before a jury. Either way, we will hold Abrego Garcia accountable and protect the American people.\" Simon Sandoval-Moshenberg, one of Mr Garcia's attorneys, said he would \"fight tooth and nail against any form of deportation to Uganda\" or nearby countries in Africa. \"It is preposterous that they would send him to Africa, to a country where he doesn't even speak the language, a country with documented human rights violations, when there are so many other options,\" he said. \"This family has suffered enough.\" However, Mr Sandoval-Moshenberg appeared to suggest that deportation to Costa Rica might be favourable for his client, saying: \"That's a pretty reasonable option, right? I mean, Costa Rica makes sense. \"It's a Spanish-speaking country. It's proximate to the United States. His family can visit him there easily.\" Mr Garcia, who lived in Maryland with his American wife and son, was deported to El Salvador under a controversial 18th-century law. He was then imprisoned in its notorious maximum security Terrorism Confinement Center (CECOT). This was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country. Democrat senator Chris Van Hollen, who met Mr Garcia in CECOT, said the 29-year-old was \"traumatised\" by the experience. Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend The Trump administration admitted that deporting Mr Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador. After eventually returning him to the US in June, the Trump administration detained Mr Garcia on criminal charges that were filed in May. The criminal indictment alleges Mr Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Homeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Mr Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs. Mr Garcia's lawyers strongly deny the claims."
    },
    {
        "title": "Multiple workers dead after 'tensioning operation' causes bridge in China to collapse",
        "description": "At least 12 people are dead after a railway bridge that was under construction in China collapsed.",
        "url": "https://news.sky.com/story/multiple-workers-dead-after-tensioning-operation-causes-bridge-in-china-to-collapse-13416592",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bridge-china_6998486.jpg?20250823101418",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-23 08:58:00",
        "Headline": "27 boats, a helicopter and five robots were being used to search for the missing workers.",
        "Content": "At least 12 people are dead after a railway bridge that was under construction in China collapsed. Four others are missing, according to state media. Sixteen workers were on the bridge in Qinghai province when a steel cable snapped during a \"tensioning operation\" at roughly 3am on Friday, according to the Xinhua News Agency. The bridge was being built on the Qinghai section of the Sichuan-Qinghai Railway. Aerial photos show a large section missing from the bridge's curved aquamarine arch, while a bent portion of the bridge deck, which usually sits around 55m above the surface of the Yellow River, hangs downward. Twenty-seven boats, a helicopter and five robots were being used to search for the missing workers, along with over 800 personnel and 91 vehicles, according to the English-language newspaper China Daily."
    },
    {
        "title": "'I'm deprived of my UK citizenship but I'm not a convicted terrorist'",
        "description": "Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria.",
        "url": "https://news.sky.com/story/im-deprived-of-my-uk-citizenship-but-im-not-a-convicted-terrorist-13415693",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tauqir-sharif-uk-citizenship-stripped_6999685.jpg?20250824022103",
        "type": "World",
        "Author": "Tom Cheshire",
        "Date Published": "2025-08-23 23:01:00",
        "Headline": "The UK uses deprivation of citizenship orders \"more than almost any country in the world\" - but there are now questions over what it means for those who travelled to Syria.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria. It was a monumental transformation for them, their country and the wider Middle East. But potentially too for British people who went to Syria - and who were stripped of their citizenship as a result, on the grounds of national security. Tauqir Sharif, better known as Tox, went to Syria in 2012 as an aid worker. He was accused of being part of a group affiliated with al Qaeda, which he denies, and the then-home secretary Amber Rudd deprived him of his British citizenship in 2017. \"As of now, I am deprived of my UK citizenship but I'm not a convicted terrorist - and the reason for that is because we refused, we boycotted, the SIAC [Special Immigration Appeals Commission] secret courts, which don't allow you to see any of the evidence presented against you,\" he said. \"And one of the things that I always called for was, look, put me in front of a jury, let's have an open hearing.\" HTS is still a proscribed terrorist organisation but the British government has now established relations with it. Foreign Secretary David Lammy travelled to Damascus to meet the jihadist-turned-Syrian interim president - the man who swapped his nom de guerre of al Jolani for Ahmed al Sharaa. If the UK government takes HTS off the terror list, what does that mean for those who lost their citizenship after being accused of being part of it? People who joined HTS are only a subset among the scores of people who have had their citizenship revoked - a tool the UK government has been quick to use. According to a report by the Parliamentary Joint Human Rights Committee, the UK \"uses deprivation of citizenship orders more than almost any country in the world\". The peak of that was in 2017, and mainly in relation to Syria - especially in the case of people joining Islamic State, perhaps most famously Shamima Begum. And because people cannot be made entirely stateless, and need to have a second nationality, or be potentially eligible for one, there are worries of racism in who the orders apply to. Countries like Pakistan and Bangladesh offer dual nationality, whereas other nations do not. In 2022, the Institute of Race Relations said \"the vast majority of those deprived are Muslim men with South Asian or Middle Eastern/North African heritage\". Legal grey areas Sky News submitted Freedom of Information requests to the Home Office asking for a breakdown of second nationalities of those deprived of citizenship, but was refused twice on national security grounds. The independent reviewer of terrorism legislation, Jonathan Hall KC, told Sky News there are issues around transparency. \"I do think there is a problem when you have people whose relationship with the country that they're left with is really technical and they may never have realised that they had that citizenship before and may never gone to that country,\" he said. \"Me and my predecessors have all said, owing to how frequently this power is used, it should be something that the independent reviewer should have the power to review. I asked, my predecessor asked, we've both been told no, so I agree there's a lack of transparency.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend No automatic reversal Even if the government does remove HTS from the terror list, it would not automatically invalidate decisions to deprive people of their citizenship. Macer Gifford gave up a career as a banker in London to join the Kurdish People's Protection Units (YPG) as a foreign volunteer between 2015 and 2017. He told Sky News that decisions \"made years ago in the interest of the British public have to remain\". \"We can't sort of go through previous cases nitpicking through it, wasting time and money to bring it up to date,\" he added. \"We can't be naive because the intent to go out, the decision to go in itself is a huge decision for them. So it shows commitment when they're there, they then, if they take an active participation in the organisations that they've been accused of joining, again, that involves training and perseverance and dedication to the cause.\" But those born and raised in Britain, who joined the same cause, and lost their citizenship as a result, might reasonably ask why that should remain the case."
    },
    {
        "title": "Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador threatened with deportation to Uganda one day after release",
        "description": "A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers.",
        "url": "https://news.sky.com/story/kilmar-abrego-garcia-man-wrongly-deported-from-us-to-el-salvador-threatened-with-deportation-to-uganda-one-day-after-release-13417392",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kilmar-abrego-garcia_6876345.jpg?20250404233516",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:56:00",
        "Headline": "Lawyers for Kilmar Abrego Garcia said in a filing that ICE officials offered the 29-year-old deportation to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison.",
        "Content": "A man who was wrongly deported to El Salvador by the Trump administration has been threatened with removal again, according to a court filing by his lawyers. Kilmar Abrego Garcia, 29 and originally from El Salvador, has been charged in an indictment filed in federal court in Tennessee with conspiring to transport illegal immigrants into the US. He was released from federal detention on Friday after being held since March, when he was arrested and then deported back to his home country by Immigration and Customs Enforcement (ICE) officials. In a new filing to the Tennessee court on Saturday, Mr Garcia's defence lawyers said that immigration officials threatened the 29-year-old with deportation to Uganda earlier in the week. According to the filing, while he was held in Putnam County Jail on Thursday, Mr Garcia declined an offer to be deported to Costa Rica in exchange for pleading guilty to human smuggling charges and remaining in prison. After he left jail on Friday, ICE notified his attorneys that he would be deported to Uganda and should report to immigration authorities on Monday. That same day, the Trump administration \"informed Mr Abrego that he has until first thing Monday morning - precisely when he must report to ICE's Baltimore Field Office - to accept a plea in exchange for deportation to Costa Rica, or else that offer will be off the table forever\". \n                  Kilmar Abrego Garcia: Man wrongly deported from US to El Salvador released after months in federal custody\n                 \n                  Why Donald Trump believes he 'deserves the Nobel Peace Prize' and 'ended seven wars'\n                 \n                  Donald Trump makes announcement in the Oval Office\n                 Filed along with the brief was a letter from the Costa Rican government stating that Mr Garcia would be welcomed to that country as a legal immigrant and wouldn't face the possibility of detention. Justice Department spokesperson Chad Gilmartin responded in a statement and said: \"A federal grand jury has charged Abrego Garcia with serious federal crimes... underscoring the clear danger this defendant presents to the community. \"This defendant can plead guilty and accept responsibility or stand trial before a jury. Either way, we will hold Abrego Garcia accountable and protect the American people.\" Simon Sandoval-Moshenberg, one of Mr Garcia's attorneys, said he would \"fight tooth and nail against any form of deportation to Uganda\" or nearby countries in Africa. \"It is preposterous that they would send him to Africa, to a country where he doesn't even speak the language, a country with documented human rights violations, when there are so many other options,\" he said. \"This family has suffered enough.\" However, Mr Sandoval-Moshenberg appeared to suggest that deportation to Costa Rica might be favourable for his client, saying: \"That's a pretty reasonable option, right? I mean, Costa Rica makes sense. \"It's a Spanish-speaking country. It's proximate to the United States. His family can visit him there easily.\" Mr Garcia, who lived in Maryland with his American wife and son, was deported to El Salvador under a controversial 18th-century law. He was then imprisoned in its notorious maximum security Terrorism Confinement Center (CECOT). This was despite an immigration judge's 2019 order granting him protection from deportation after finding he was likely to be persecuted by local gangs if he was returned to his native country. Democrat senator Chris Van Hollen, who met Mr Garcia in CECOT, said the 29-year-old was \"traumatised\" by the experience. Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend The Trump administration admitted that deporting Mr Garcia was an \"administrative error\", but said at the time they could not bring him back as they do not have jurisdiction over El Salvador. After eventually returning him to the US in June, the Trump administration detained Mr Garcia on criminal charges that were filed in May. The criminal indictment alleges Mr Garcia worked with at least five co-conspirators to bring immigrants to the US illegally and transport them from the border to other destinations in the country. Homeland Security secretary Kristi Noem, US President Donald Trump, vice president JD Vance and other officials claim Mr Garcia was a member of MS-13 - an international criminal gang formed by immigrants who had fled El Salvador's civil war to protect Salvadoran immigrants from rival gangs. Mr Garcia's lawyers strongly deny the claims."
    },
    {
        "title": "Coca-Cola brews up sale of high street coffee giant Costa",
        "description": "The Coca-Cola Company is brewing up a sale of Costa, Britain&#8217;s biggest high street coffee chain, more than six years after acquiring the business in a move aimed at helping it reduce its reliance on sugary soft drinks.",
        "url": "https://news.sky.com/story/coca-cola-brews-up-sale-of-high-street-coffee-giant-costa-13416553",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-costa-costa-coffee_6998429.jpg?20250823073743",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-23 05:54:00",
        "Headline": " The Atlanta-based soft drinks giant is working with bankers at Lazard to gauge interest in a sale of the coffee chain it agreed to buy in 2018 for £3.9bn, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Coca-Cola Company is brewing up a sale of Costa, Britain’s biggest high street coffee chain, more than six years after acquiring the business in a move aimed at helping it reduce its reliance on sugary soft drinks. Sky News can exclusively reveal that Coca-Cola is working with bankers to hold exploratory talks about a sale of Costa. Initial talks have already been held with a small number of potential bidders, including private equity firms, City sources said on Saturday. Lazard, the investment bank, is understood to have been engaged by Coca-Cola to review options for the business and gauge interest from prospective buyers. Indicative offers are said to be due in the early part of the autumn, although one source cautioned that Coca-Cola could yet decide not to proceed with a sale. Costa trades from more than 2,000 stores in the UK, and well over 3,000 globally, according to the latest available figures. It has been reported to have a global workforce numbering 35,000, although Coca-Cola did not respond to several attempts to establish the precise number of outlets currently in operation, or its employee numbers. \n                  'I'm deprived of my UK citizenship but I'm not a convicted terrorist'\n                 \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  UK braces for more protests over the use of hotels to house asylum seekers\n                 This weekend, analysts said that a sale could crystallise a multibillion pound loss on the £3.9bn sum Coca-Cola agreed to pay to buy Costa from Whitbread, the London-listed owner of the Premier Inn hotel chain, in 2018. One suggested that Costa might now command a price tag of just £2bn in a sale process. The disposal proceeds would, in any case, not be material to the Atlanta-based company, which had a market capitalisation at Friday's closing share price of $304.2bn (£224.9bn). At the time of the acquisition, Coca-Cola's chief executive, James Quincey, said: \"Costa gives Coca-Cola new capabilities and expertise in coffee, and our system can create opportunities to grow the Costa brand worldwide. \"Hot beverages is one of the few segments of the total beverage landscape where Coca-Cola does not have a global brand. \"Costa gives us access to this market with a strong coffee platform.\" However, accounts filed at Companies House for Costa show that in 2023 - the last year for which standalone results are available - the coffee chain recorded revenues of £1.22bn. While this represented a 9% increase on the previous year, it was below the £1.3bn recorded in 2018, the final year before Coca-Cola took control of the business. Read more from Sky News:TikTok puts hundreds of UK jobs at riskConsumer confidence at highest point this year Coca-Cola has been grappling with the weak performance of Costa for some time, with Mr Quincey saying on an earnings call last month: \"We're in the mode of reflecting on what we've learned, thinking about how we might want to find new avenues to grow in the coffee category while continuing to run the Costa business successfully.\" \"It's still a lot of money we put down, and we wanted that money to work as hard as possible.\" Costa's 2022 accounts referred to the financial pressures it faced from \"the economic environment and inflationary pressures\", resulting in it launching \"a restructuring programme to address the scale of overheads and invest for growth\". Filings show that despite its lacklustre performance, Costa has paid more than £250m in dividends to its owner since the acquisition. The deal was intended to provide Coca-Cola with a global platform in a growing area of the beverages market. Costa trades in dozens of countries, including India, Japan, Mexico and Poland, and operates a network of thousands of coffee vending machines internationally under the Costa Express brand. The chain was founded in 1971 by Italian brothers Sergio and Bruno Costa. It was sold to Whitbread for £19m in 1995, when it traded from fewer than 40 stores. The business is now one of Britain's biggest private sector employers, and has become a ubiquitous presence on high streets across the country. Its main rivals include Starbucks, Caffe Nero and Pret a Manger - the last of which is being prepared for a stake sale and possible public market flotation. It has also faced growing competition from more upmarket chains such as Gail's, the bakeries group, which has also been exploring a sale. Coca-Cola communications executives in the US and UK did not respond to a series of emails and calls from Sky News seeking comment on its plans for Costa. A Lazard spokesperson declined to comment."
    },
    {
        "title": "Reform UK's new immigration plans would have been seen as extreme just a few years ago",
        "description": "Mass deportations. Prison camps. Quitting the Refugee Convention and the UN Convention on Torture.",
        "url": "https://news.sky.com/story/reform-uks-new-immigration-plans-wouldve-been-extreme-just-a-few-years-ago-13416752",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-farage-data-forensics_6983605.png?20250805184125",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-23 13:26:00",
        "Headline": "While the government has made some progress in reducing the cost of asylum hotels - down from £8.3m a day in 2023/4 to £5.77m a day in 2024/5 - the overall numbers accommodated in this way have gone up by 8% since Labour took charge, thanks to the surge in new claims.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Mass deportations. Prison camps. Quitting the Refugee Convention and the UN Convention on Torture. A shrug of the shoulders at the idea of the UK sending asylum seekers back to places like Afghanistan or Eritrea, where they could be tortured or executed. \"I'm really sorry, but we can't be responsible for everything that happens in the whole of the world,\" says Nigel Farage. \"Who is our priority?\" The Reform UK leader has been setting out his party's new plans to address illegal migration in an interview with The Times newspaper - a set of policies, and a use of language, which would surely have been seen as extreme just a few years ago. Only last autumn the Reform leader repeatedly shied away from the concept of \"mass deportations\", describing the idea as \"a political impossibility\". But now he's embraced Trump-style immigration rhetoric. \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 \n                  Labour may have walked into political trap over housing asylum seekers in hotels\n                 It's not surprising that Reform want to capitalise on the outpouring of public anger over the use of hotels to house asylum seekers. The policy was started by the previous Conservative government, in response to housing shortages - and Labour has failed to make significant progress on its promise to stop it.  But all the major parties have shifted firmly to the right on this issue. There's been very little political criticism of the aggressiveness of Farage's policy suggestions, and the premise that the UK should no longer offer sanctuary to anyone who arrives here illegally. The Tory response has been to complain that he's just copying the ideas they didn't quite get round to implementing before calling the general election. \"Four months late, this big reveal is just recycling many ideas the Conservatives have already announced,\" said Chris Philp MP, the shadow home secretary. \"Labour's border crisis does urgently need to be fixed with tough and radical measures, but only the Conservatives have done - and will continue to do - the detailed work to deliver a credible plan that will actually work in practice.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomFive killed after tour bus returning from Niagara Falls crashes Certainly, the ambition to arrest and deport everyone who arrives in a small boat - regardless of whether or not they have legitimate grounds for asylum - has clear echoes of the Tories' Rwanda policy. Despite spending £700m on the controversial idea, only four volunteers were ever sent to Kigali before it was cancelled by Sir Keir Starmer, who branded it a gimmick.  Labour have suggested they've diverted Home Office resources that were freed up by that decision into processing asylum claims more quickly and increasing deportations. They're hoping tougher action against the criminal gangs and the new \"one in one out\" deal with France will help deter the number of people crossing the Channel in small boats in the first place, currently at record levels. But rather than offering any defence of the principle of offering asylum to genuine refugees - Labour's Angela Eagle MP, the border security minister, has also focused on the feasibility of Farage's policies. \"Nigel Farage is simply plucking numbers out of the air, another pie in the sky policy from a party that will say anything for a headline,\" she said. \"We are getting a grip of the broken asylum system. Making sure those with no right to be here are removed or deported.\" Even the Liberal Democrats have taken a similar approach. \"This plan sums up Nigel Farage perfectly, as like him it doesn't offer any real solutions,\" they said. \"Whilst Farage continues to stoke division, we Liberal Democrats are more interested in delivering for our local communities.\" It's been left to the Refugee Council to defend the principle of asylum. \"After the horrors of the Second World War, Britain and its allies committed to protecting those fleeing persecution,\" said CEO Enver Solomon. \"The Refugee Convention was our collective vow of 'never again' - a legal framework ensuring that people who come to our country seeking safety get a fair chance to apply for asylum. \"That commitment remains vital today. Whether escaping conflict in Sudan or repression under regimes like the Taliban, people still need protection. \"Most find refuge in neighbouring countries. But some will seek sanctuary in Europe, including Britain. \"We can meet this challenge by upholding a fair, managed system that determines who qualifies for protection and who does not.\" But with Reform leading in the polls, and protests outside hotels across the country - politicians of all stripes are under pressure to respond to public frustration over the issue. A recent YouGov poll found half of voters now believe immigration over the last ten years has been mostly bad for the country - double the figure just three years ago. While the government has made some progress in reducing the cost of asylum hotels - down from £8.3m a day in 2023/4 to £5.77m a day in 2024/5 - the overall numbers accommodated in this way have gone up by 8% since Labour took charge, thanks to the surge in new claims. Sir Keir has previously said he won't make a promise he can't keep. But current efforts to end the use of asylum hotels by 2029 are clearly not working. That's a credibility gap Farage is more than ready to exploit."
    },
    {
        "title": "Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year",
        "description": "A new fast-track asylum appeals process will be introduced to speed up the process of deporting people without a right to remain in the UK, the home secretary has said.",
        "url": "https://news.sky.com/story/fast-track-asylum-appeals-process-to-be-introduced-as-average-time-for-decisions-is-more-than-one-year-13417386",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-home-secretary-yvette-cooper_6983493.jpg?20250805161518",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:27:00",
        "Headline": "As it currently takes, on average, more than a year to reach a decision on asylum appeals, the government plans to set up a new independent panel focused on asylum appeals to help reduce the backlog, as first reported by The Sunday Times.",
        "Content": " A new fast-track asylum appeals process will be introduced to speed up the process of deporting people without a right to remain in the UK, the home secretary has said. As it currently takes, on average, more than a year to reach a decision on asylum appeals, the government plans to set up a new independent panel focused on asylum appeals to help reduce the backlog. Home Secretary Yvette Cooper said \"completely unacceptable\" delays in the appeals process left failed asylum seekers in the system for years. There are about 51,000 asylum appeals waiting to be heard. The new independent body will use professionally-trained adjudicators, rather than relying on judges. Ministers are introducing a new 24-week deadline for the first-tier tribunal to determine asylum appeals by those receiving accommodation support and appeals by foreign offenders.  But they believe the current tribunal system, which covers a wide range of different cases, is still failing to ensure failed asylum seekers can be returned as swiftly as possible, nor can it accommodate a fast-track system for safe countries. \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 \n                  Labour may have walked into political trap over housing asylum seekers in hotels\n                 It comes amid protests about the use of hotel accommodation for migrants. The home secretary said the overhaul would result in a system which is \"swift, fair and independent, with high standards in place\". Read more from Sky News:UK set to bask in 30C sunshine over bank holiday weekendCoca-Cola brews up sale of high street coffee giant Costa She said: \"We inherited an asylum system in complete chaos with a soaring backlog of asylum cases and a broken appeals system with thousands of people in the system for years on end. \"That is why we are taking practical steps to fix the foundations and restore control and order to the system. \"We are determined to substantially reduce the number of people in the asylum system as part of our plan to end asylum hotels. \"Already since the election, we have reduced the backlog of people waiting for initial decisions by 24% and increased failed asylum returns by 30%. \"But we cannot carry on with these completely unacceptable delays in appeals as a result of the system we have inherited which mean that failed asylum seekers stay in the system for years on end at huge cost to the taxpayer.\" Official figures released earlier this month showed a total of 111,084 people applied for asylum in the UK in the year to June 2025, the highest number for any 12-month period since current records began in 2001."
    },
    {
        "title": "Criminals could be banned from pubs and sports grounds under new plans",
        "description": "Criminals face being banned from pubs, sports grounds and concerts under new government plans to give judges powers to pass tougher community sentences.",
        "url": "https://news.sky.com/story/criminals-could-be-banned-from-pubs-and-sports-grounds-under-new-plans-13417328",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-officer-prisons_6932011.jpg?20250531160740",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-23 21:46:00",
        "Headline": "The new measures, which would apply to people in England and Wales, \"should remind all offenders that, under this government, crime does not pay\", Justice Secretary Shabana Mahmood said.",
        "Content": "Criminals face being banned from pubs, sports grounds and concerts under new government plans to give judges powers to pass tougher community sentences. The new measures, which would apply to people in England and Wales, \"should remind all offenders that, under this government, crime does not pay\", Justice Secretary Shabana Mahmood said. Offenders' freedom could also be curtailed with limits on driving, travel bans and restriction zones confining them to specific areas, the government said. Similar measures could also apply to prisoners let out on licence, while drug testing would be expanded to include all those released, rather than just those with a history of substance misuse. While judges are currently able to impose limited bans for specific crimes, such as football bans for crimes committed inside a stadium on match day, the new measures would allow for such bans to be handed down for any offence.  The justice secretary said: \"When criminals break society's rules, they must be punished. \"Those serving their sentences in the community must have their freedom restricted there too. \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 \n                  Man guilty over Dalston gangland shooting that left nine-year-old girl with bullet lodged in brain\n                 \"These new punishments should remind all offenders that, under this government, crime does not pay. \"Rightly, the public expect the government to do everything in its power to keep Britain safe, and that's what we're doing.\" The proposals are part of the Labour government's efforts to tackle overcrowding in prisons. Back in June, it emerged that prisoners were to be transferred to lower security jails in an effort to ease overcrowding, as part of a new measure quietly unveiled by the government. Sky News reported earlier this month how the prison system was close to collapse on a number of occasions between autumn 2023 and summer 2024, according to an independent review by former chief inspector of prisons, Dame Anne Owers. The report said there was a systemic problem which has led to recurring prison capacity crises over the last 18 years."
    }
]