[
    {
        "title": "Water bills in England and Wales to rise by average of £10 per month",
        "description": "The average annual water bill will rise by &#163;26% or &#163;123 in the next financial year alone, according to industry figures covering England and Wales.",
        "url": "https://news.sky.com/story/water-bills-in-england-and-wales-to-rise-by-average-of-16310-per-month-13298957",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-water-bill_6806360.jpg?20250121133134",
        "type": "Home",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 15:36:00",
        "Headline": "Households now have a much better idea of their bill increases from April, which will rise at a time when many other bills are also tipped to go up sharply.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The average annual water bill will rise by £26% or £123 in the next financial year alone, according to industry figures covering England and Wales. Water UK confirmed how inflation-busting hikes, determined by the regulator Ofwat in December, would play out from 1 April when a new five-year pricing period begins. The watchdog allowed bills to rise sharply from 2025-30, but not by as much as suppliers had wanted, to help fund badly needed infrastructure upgrades in key areas, such as storm overflows to prevent sewage spills. Water UK, which represents the water firms, said the average water and wastewater bill would go up from £480 to £603 during 2025/26 - an increase of about £10 a month. But the increases will be even harder to swallow for many. Southern Water customers will see the largest in percentage terms, a 47% increase, taking their average bill to £703. Bills for households covered by Hafren Dyfrdwy and South West Water will rise by 32%. Thames Water's 16 million customers face a 31% hike to £639 - a rise of £151 - at a time when the company is still scrambling to secure its financial future amid a massive debt pile that could yet tip it towards a special administration process. Water UK explained that the rises may be higher than customers were expecting as the annual totals now included inflation calculations. The body also said that the increases across households would also vary, depending on circumstances such as water use and whether a water meter was installed.  They will come into force at a time when consumers are facing a surge in other costs. Industry estimates suggest another hefty increase in energy bills will be seen from April, when the energy price cap is adjusted to reflect higher wholesale prices. Council tax is also among the bills set for above-inflation rises. Poorer households get support Water UK said that it recognised the impact that rising water bills would have on poorer households, pledging that more than three million would receive support worth £4.1bn over the five-year pricing period. It urged those concerned about paying the increase to contact their supplier. Water UK also sought to reassure customers that they would see a return, following widespread anger over historic dividends for shareholders. Water UK said firms would invest around £20bn each year to 2030.  Read more from Sky News:Chancellor announces backing for third Heathrow runwayLove Island star freed on bail after being jailed for dog attack Upgrade works will include nine new reservoirs and increased capacity at 1,700 wastewater treatment works to reduce pollution and clear up rivers. Water UK admits rises 'will be difficult' Water UK chief executive David Henderson said: \"We understand increasing bills is never welcome and, while we urgently need investment in our water and sewage infrastructure, we know that for many this increase will be difficult. \"Water companies will invest a record £20bn in 2025-26 to support economic growth, build more homes, secure our water supplies and end sewage entering our rivers and seas.\" The industry has argued that constraints on bills over 15 years, coupled with climate change and population growth, have been responsible for the growing pollution crisis. Regulator says bill rises are 'challenge' Ofwat has denied this, saying companies must take responsibility. Its chief executive David Black said of the bill rises ahead: \"We recognise the challenge that some customers are facing with increasing financial pressures and understand that the water sector is not the only area where customers are faced with rising costs. \"While water bills will vary depending on the circumstances of each household, the average increase forecasted for 2025/26 will be 26% or £123. \"We have pushed companies to double the amount of support over the next five-year period and strongly encourage customers who are struggling to pay their water bills to contact their water company to access this.\""
    },
    {
        "title": "Chancellor Rachel Reeves announces backing for third Heathrow runway",
        "description": "The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-announces-backing-for-third-heathrow-runway-13298590",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813432.jpg?20250129110052",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-29 10:50:00",
        "Headline": "The chancellor says the expansion of Europe's busiest airport is \"badly needed\" - but the Green Party's Sian Berry calls it \"the most irresponsible announcement from any government I have seen since the Liz Truss budget\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced. Ms Reeves said the expansion of Europe's busiest airport was \"badly needed\" to connect the UK to the world and open up new opportunities for growth. A third runway will \"unlock further growth, boost investment increase exports and make the UK more open and more connected\", she said. Politics latest: Reaction to third runway decision It could increase potential GDP (Gross Domestic Product) by 0.43% by 2050 according to a Frontier Economics study, she said. 60% of that boost would go to areas outside London and the southeast, increasing trade opportunities like Scotch whiskey and Scottish salmon, she added. Ms Reeves said an expansion could create more than 100,000 jobs. The announcement has been welcomed by some business groups but has been met with anger from London's Labour mayor Sadiq Khan, the Lib Dems, the Green Party and environmental groups. Conservative leader Kemi Badenoch told Sky News over the weekend she supports a third runway. Read more:Analysis - The big points in chancellor's speech that won't get the headlines As part of a speech on funding infrastructure across the UK to promote growth, Ms Reeves said: \"Persistent delays have caused doubts about our seriousness towards improving our economic prospects.\" She added that business groups like the Confederation of British Industry (CBI), the Federation of Small Businesses (FSB) and the Chambers of Commerce (BCC), as well as trade unions \"are clear - a third runway is badly needed\". 'Britain is a country of huge potential that is untapped' Speaking afterwards to Sky's economics and data editor Ed Conway, Ms Reeves said: \"I want Britain to be a magnet for foreign investment… we should be welcoming the best businesses and the best talent in the world. I want businesses around the world, investors around the world, to see in Britain, what I see, which is a country of huge potential that is untapped.\" The chancellor also spoke of helping British companies to scale up. She said: \"We are introducing the capital market reforms, particularly around pension reform, unlocking £80bn of long-term patient capital by creating these mega funds, the mergers of defined contribution and local government pension schemes, to create those larger funds that can invest at scale in the exciting opportunities in the UK. \"Building on what countries like Australia and Canada do with their big pension funds, to support British industry, and particularly that stage of a business career when they've had the start-up and the seed funding, but now they're looking to scale up, but they find that the access to finance isn't available in the UK, and often look, to example, for the United States.\"  Investments in green aviation fuel Ms Reeves said in her speech that the UK is \"already making great strides in transitioning to cleaner and greener aviation\" and announced the government is investing £63m over the next year into the Advanced Fuel Fund grant programme to support the development of sustainable aviation fuel production plants. The government will be accepting proposals until the summer and will then carry out a \"full assessment\" through the Airport National Policy Statement to \"ensure a third runway is delivered in line with our legal, environmental and climate objectives\".  Ms Reeves said the government expects any associated surface transport costs to the third runway's construction to be financed through private funding. She added a decision on plans to expand Gatwick and Luton, which are currently under way, will be made by the transport secretary \"shortly\". Read more:A long history of Heathrow's third runway plansGreen groups criticise Heathrow campaigner's role in Labour policy creation  A decades-old debate The debate around whether Europe's busiest airport should expand has been circling over British politics for decades. Ms Reeves's decision will likely put her at odds with Climate Secretary Ed Miliband, who has said airport expansions will not go ahead if they cannot meet climate targets. However, he said last week he would not resign if the government approved a third runway despite threatening to resign from Gordon Brown's cabinet as climate change secretary in 2009 over the plans and in 2018 he said an expansion was \"very likely\" to make air pollution worse. He has now said the government can meet both its growth and net zero missions together. London mayor opposes runway Sadiq Khan said he remained opposed to a third runway \"because of the severe impact it will have on noise, air pollution and meeting our climate change targets\". He said he will carefully scrutinise any new proposals, \"including the impact it will have on people living in the area and the huge knock-on effects for our transport infrastructure\". \"Despite the progress that's been made in the aviation sector to make it more sustainable, I'm simply not convinced that you can have hundreds of thousands of additional flights at Heathrow every year without a hugely damaging impact on our environment,\" he added. Green Party MP Sian Berry said expanding airports \"in the face of a climate emergency is the most irresponsible announcement from any government I have seen since the Liz Truss budget\". Conservative shadow chancellor Mel Stride accused Ms Reeves and Sir Keir Starmer and \"their job-destroying budget\" of being \"the biggest barriers to growth\". \"What's worse, the anti-growth chancellor could not rule out coming back with yet more tax rises in March,\" he added. \"This is a Labour government run by politicians who do not understand business, or where wealth comes from. Under new leadership, the Conservatives will continue to back businesses and hold this government to account.\""
    },
    {
        "title": "Money and public backlash are not the only issues Heathrow expansion plans face",
        "description": "Rachel Reeves is supposedly someone who understands tight budgets.",
        "url": "https://news.sky.com/story/heathrow-expansion-as-the-chancellor-grapples-with-growth-she-has-another-tight-budget-to-consider-13298870",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-heathrow-airport_6806613.jpg?20250121171534",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-01-29 12:36:00",
        "Headline": "Under the Climate Change Act successive governments have a legal responsibility to meet successive five-year carbon budgets.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Rachel Reeves is supposedly someone who understands tight budgets. While she may not have all the cash she'd like to deliver her airport expansion plans, the real constraint is carbon. And Britain's carbon budget has, to use the fiscal parlance of the Treasury, very little headroom at all. This isn't an academic point. Under the Climate Change Act, successive governments have a legal responsibility to meet successive five-year carbon budgets. The watchdog that oversees those budgets, the Office for Budget Responsibility (OBR) of climate if you will, is the Committee on Climate Change. Its current advice is very clear that expansion of air travel in the UK will blow the budget unless cuts are found in other sectors. This probably explains why the chancellor announced a new plan, coming later this year, on how the government will meet its carbon budgets. But it's very hard to see how she might do it. Read moreA long history of Heathrow expansion plansGreen groups criticise planned expansionJet breaks sound barrier for first time Using figures from the Department for Transport and airport operators, the growth in flight numbers as a result of more and more frequently used runways will increase UK carbon emissions by 92 million tonnes CO2 equivalent) by 2050. (The \"equivalent\" bit is important as flights have an additional global warming impact due to particles and water vapour they add to the atmosphere). There's the sustainable aviation fuel mandate that requires airlines to use an increasing mix of zero carbon fuel in the kerosene burned by jets. But the mandate is already factored into our carbon budgets and assumes no airport expansion.  This all leaves a lot of extra carbon \"spending\" to find cuts elsewhere in the economy to cover. So much in fact, a recent study estimated it will cancel out all the emissions saved by the government's other key strategy of clean power by 2030. So that saving isn't going to help. The Department for Net Zero has yet to publish plans to cut emissions from gas boilers and road vehicles, but all evidence suggests they'll struggle to meet existing carbon budgets even with the most well designed and rapidly executed policies. So what else can Rachel Reeves do? Planting trees is popular. It might even help deflect some of the heat she'll be getting from environmentalists after effectively blaming bats and newts for Britain's failure at building infrastructure. But new analysis by Carbon Brief finds that a forest twice the size of greater London would have to be in the ground and growing in short order to absorb all the CO2 those busier airports would bring. That won't leave much space for all those homes, railways and enterprise hubs Britain also desperately needs."
    },
    {
        "title": "Donald Trump says thousands of migrants will be housed in new Guantanamo Bay detention centre",
        "description": "Donald Trump has signed an executive order to open a migrant detention centre at Guantanamo Bay.",
        "url": "https://news.sky.com/story/donald-trump-says-thousands-of-migrants-will-be-housed-in-new-guantanamo-bay-detention-centre-13299062",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-white-house_6813999.jpg?20250129215913",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-29 18:57:00",
        "Headline": "The US President said up to 30,000 migrants who cannot be returned to their home countries will be held at the notorious naval base and military prison on the island of Cuba.",
        "Content": "Donald Trump has signed an executive order to open a migrant detention centre at Guantanamo Bay. Speaking before making the act official, Mr Trump said that thousands of migrants who cannot be deported to their home countries will be held at the complex, on the island of Cuba. \"I'm also signing an executive order to instruct the Departments of Defense and Homeland Security to begin preparing the 30,000-person migrant facility at Guantanamo Bay,\" he said. Follow latest: White House U-turns on funding pause \"Most people don't even know about it. We have 30,000 beds in Guantanamo to detain the worst criminal illegal aliens threatening the American people. \"Some of them are so bad we don't even trust the countries to hold them, because we don't want them coming back.\" It comes as Mr Trump's controversial pick for health secretary - Robert F. Kennedy Jr. - faced a hearing committee where he was grilled on his views, including on vaccines and abortion. Guantanamo Bay was set up in 2002 by then president George W. Bush to hold detainees in the wake of 9/11 and the War on Terror. Only 15 prisoners - including Ramzi bin al Shibh, accused of being a 9/11 co-conspirator - remain at the detention centre. US correspondent Guantanamo Bay is infamous.  A strip of land on the Cuban coast - leased in perpetuity from Cuba since 1903. It's the site of a notorious US military prison where detainees were taken and held after the September 11 attacks.\n\n It has become synonymous with the US \"war on terror\", with CIA rendition, with torture and with orange jumpsuits.\n\n Beyond the prison (which only has 15 inmates remaining) the site houses a US naval base and a small migrant holding centre - used at the moment to hold migrants who are intercepted at sea trying to reach America. President Trump's announcement that he has ordered the Department of Defence to prepare \"Gitmo\", as it's called, to house many more migrants is unexpected. 30,000 beds represents a colossal facility. It is not clear, yet, whether the migrants to be held here will be those intercepted or those rounded up in the US to be deported.\n The numbers of migrants currently crossing into the US are very low and the numbers being rounded up are high - this gives an indication of who could be housed there.\n\n In fulfilling its immigration mass deportation pledge, the White House is likely to be faced with significant logistical challenges with holding facilities. The optics of using Guantanamo to house deported migrants is stark - reflective of the hardline policy being pursued by Trump. At its peak, about 680 people, most suspected of terrorism and being \"illegal enemy combatants\", were held at the American-run prison in Cuba. The facility has been criticised by human rights groups and legal campaigners over potential breaches of international laws and conditions. Cuban President Miguel Díaz-Canel deemed the decision as \"an act of brutality\" in a message on his X account, and he described the base as one \"located in illegally occupied Cuba territory\". In response to Mr Trump's announcement, former White House communications director Anthony Scaramucci - who briefly served under the previous Trump administration - said: \"Also known as a concentration camp. \"Yet no dissent. No courageous political leader willing to stand up to this.\" Read more from Sky News:Chicago's streets empty over Trump's immigration crackdownTrump offers federal employees eight months' pay to quit RFK Jr faces Senate hearing Earlier on Wednesday, Mr Kennedy - the president's pick to be health secretary - faced a grilling over his views on vaccines, abortion and Medicaid at a Senate confirmation hearing. Appearing at the Capitol, Democratic senators raised some of the 71-year-old's previous remarks comparing the Centers for Disease Control and Prevention (CDC) to Nazi death camps, linking school shootings to antidepressants, and his claim that \"no vaccine is safe and effective\". One senator, Sheldon Whitehouse, told Mr Kennedy \"frankly, you frighten people\" when discussing an outbreak of measles in Rhode Island - its first since 2013. Read more:Who is the man set to become Trump's health chief? The nominee said he did \"not have a broad proposal for dismantling\" Medicaid - a state and federal taxpayer-funded healthcare programme - and dismissed claims he was anti-vaccine by saying his children were vaccinated. Mr Kennedy - the son of Robert F Kennedy and nephew of former US president John F Kennedy - was also questioned on his previous support for abortion and was shown statements as recent as from when he was running for president as an independent. He said he now agrees with the president that \"every abortion is a tragedy\". Federal funding pause memo rescinded It also comes after Mr Trump's budget office rescinded an order freezing spending on federal grants - less than two days after it sparked legal challenges across the US. The order on Monday sparked uncertainty over a financial lifeline for states, schools and organisations that rely on trillions of dollars from Washington. However, White House press secretary Karoline Leavitt told Sky's US partner network NBC that the freeze itself has not been withdrawn and that it was simply a cancellation of the memo ordering it."
    },
    {
        "title": "Scientists monitoring football-pitch sized asteroid that could hit Earth in the future",
        "description": "The European Space Agency (ESA) has revealed it is closely monitoring an asteroid the size of a football pitch that could hit the Earth in a little over seven years.",
        "url": "https://news.sky.com/story/scientists-monitoring-football-pitch-sized-asteroid-that-could-hit-earth-in-the-future-13299214",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-asteroid-2024-yr4_6814006.jpg?20250129221348",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-01-29 21:55:00",
        "Headline": "The asteroid, called 2024 YR4, measures 100m by 40m. The Earth takes a direct hit from an asteroid of that size only once every few thousand years.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n The European Space Agency (ESA) has revealed it is closely monitoring an asteroid the size of a football pitch that could hit the Earth in a little over seven years. The asteroid, called 2024 YR4, is estimated to have a one in 83 chance of a direct hit, causing \"severe damage to a local region\", according to ESA. The space rock, which measures 100m by 40m, is currently at a distance of around 27 million miles and moving away from the planet. But its path will cross the Earth's orbit on 22 December 2032. Most likely there would be a near miss, with the asteroid passing within a few thousand miles. The Space Mission Planning Advisory Group, which is chaired by ESA, will discuss the latest observations of the asteroid at a meeting in Vienna next week. If the impact risk is confirmed it will make official recommendations to the United Nations and work may begin on options for a \"spacecraft-based response to the potential hazard\", the agency said in a statement. Dr Simeon Barber, a space scientist at the Open University, told Sky News: \"We shouldn't be overly worried - at least not just yet. \"That's because our early detection systems quite often overestimate the likelihood of an impact with Earth. \"In the early stages, we can't determine its trajectory very accurately, and so the probability of impact has to take into account this uncertainty. \"It's likely that as our technologies for detecting Earth-bound objects improve, we may see an increasing number of alerts such as this. \"It's important that we find the right balance between treating the threat seriously, but not over-reacting in these early stages of discovery when the trajectory is still not well-defined.\" Read more:'New Concorde' prototype jet breaks sound barrier for first timeSimple blood test could revolutionise dementia diagnosisCalorie labelling could make eating disorders worse 'Protect our home planet' Just over two years ago NASA smashed a spacecraft into the 160m-wide asteroid Dimorphos and successfully changed its orbit. At the time NASA administrator Bill Nelson said: \"All of us have a responsibility to protect our home planet. After all, it's the only one we have.\" Near-Earth Asteroid 2024 YR4 was first spotted by a telescope in Chile. Since the start of January, astronomers have been tracking the asteroid to gauge its size and movement. The asteroid is expected to fade from view within the next few months as it moves further from the Earth. Increasingly powerful telescopes will be trained on the rock to gather as much data as possible on its trajectory. Once it disappears it won't come back into view until 2028. How much damage would such an impact do? The Earth takes a direct hit from an asteroid of that size only once every few thousand years. In 1908, a slightly smaller asteroid - thought to have measured 60m across - exploded over Siberia. It flattened 80 million trees over an area of 830 square miles."
    },
    {
        "title": "New bowel cancer detection method more than 90% accurate, research finds",
        "description": "A new method for detecting bowel cancer is more than 90% accurate at predicting which higher risk people will develop the disease, research found.",
        "url": "https://news.sky.com/story/new-bowel-cancer-detection-method-more-than-90-accurate-research-finds-13298882",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bowel-cancer_6813609.jpg?20250129140159",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-29 12:58:00",
        "Headline": "The study, funded by Cancer Research UK, could lead to a blood test which will inform doctors which inflammatory bowel disease patients are most at risk of cancer.",
        "Content": "A new method for detecting bowel cancer is more than 90% accurate at predicting which higher risk people will develop the disease, research found. People with inflammatory bowel disease (IBD), such as Crohn's and ulcerative colitis, are known to have an increased chance of bowel cancer, but not all will develop it. Now, a study funded by Cancer Research UK has shown more than 90% accuracy in predicting bowel cancer risk in the next five years in a high-risk group of people with IBD. This could lead to a blood test which will inform doctors which IBD patients are most at risk of bowel cancer. IBD can irritate the lining of the bowel and can cause abnormal pre-cancerous cells to form if left untreated. To identify people's cancer risk, scientists at the Institute of Cancer Research (ICR), working with doctors at St Mark's in London, the UK's specialist bowel hospital, found that people with IBD whose pre-cancerous cells had lost multiple copies of their DNA were far more likely to go on to develop bowel cancer. The scientists also created an algorithm that calculates the risk of future bowel cancer, based on the exact pattern of the DNA which is altered in the pre-cancerous cells. \n                  Doctors look for clues on why 'super survivors' overcome cancer in first global study\n                 \n                  Surgeons remove tumour through patient's eye socket in UK first\n                 \n                  Princess of Wales says 'it's a relief to now be in remission' from cancer\n                 Samples of pre-cancerous cells were taken from 122 patients with IBD for the study published in the journal Gut. About half of the patients went on to develop bowel cancer within five years, while the other half remained cancer-free. Professor Ailsa Hart, co-lead of the study, from St Mark's, said: \"Patients with inflammatory bowel disease have a higher risk of developing colorectal cancer than people without IBD, and need to undergo assessment with regular colonoscopies to try to detect early signs of cancer. \"These tests are onerous and unpleasant for patients, imperfect at detecting early cancer changes and costly to health services. \"If early signs of cancer are detected, surgery, which involves removing the colon, is advocated. Finding smarter ways to assess these colons is much needed. \"Here we describe a potential biomarker, which can be readily translated into clinical practice, to improve assessment of patients with IBD and early signs of cancer to help with the decision for surgery.\" Around 500,000 people in the UK are thought to have Crohn's or ulcerative colitis. Scientists hope their findings could spare people who are at much lower risk from the stress of needing regular colonoscopies or undergoing surgery to remove the colon. Read more:Doctors look for clues on why 'super survivors' overcome cancerSurgeons remove tumour through patient's eye socket'Pioneering' drug for rare eye cancer to be rolled out Professor Trevor Graham, from the ICR, which co-led the research, said: \"Most people with ulcerative colitis or Crohn's disease won't develop bowel cancer. \"But for those that have these conditions and are showing signs of pre-cancer in their colon, there are some tough decisions to make. \"Either they have it monitored regularly, in the hope that it doesn't become cancer, or they have their bowel removed to guarantee they don't get cancer in the future. Neither of these options are particularly pleasant. \"Our test and algorithm give people with IBD, and the doctors who care for them, the best possible information so that they can make the right decision about how to manage their cancer risk.\" Executive director of research and innovation at Cancer Research UK, Dr Iain Foulkes, said: \"Genome sequencing is now far cheaper and more widespread than ever before, and it's changing how we look at cancer. \"Getting a full readout of tumour DNA means we can see a much bigger picture of how someone's cancer started and how it is likely to change over time. \"With this research, we can focus resources on treating people with IBD who are at really high risk, saving health services valuable time and money.\""
    },
    {
        "title": "Surreal scenes as foreign soldiers sent to Rwanda alongside Congolese troops as rebels take capital",
        "description": "On the doorstep of Goma - the site of the UN's biggest peacekeeping mission in the world - there are signs of surrendered soldiers and fierce battles.",
        "url": "https://news.sky.com/story/watch-moment-sky-news-challenges-m23-rebels-over-rwandas-support-13298961",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-romanian-romania-congo_6813560.jpg?20250129130117",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-01-29 16:46:00",
        "Headline": "The Rwandan-backed M23 rebels have released captured Romanian mercenaries who were fighting with the Congolese army. As they passed a border, they were chastised by Willy Ngoma, who tapped them mockingly one by one.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  On the doorstep of Goma - the site of the UN's biggest peacekeeping mission in the world - there are signs of surrendered soldiers and fierce battles. As we walked on the road in front of the United Nations' main base, we stepped around fatigues, rounds and helmets once belonging to the Congolese army fighting the Rwandan-backed M23 rebels. The rebels now control the strategic city of Goma after fighting for the border post with Rwanda. It sits south of the swathes of mineral-rich mining territory the rebels have been seizing through last year. We see them packed on the back of trucks still marked by the FARDC logo of the Congolese army. I ask one man watching from the side of the road what he makes of this extreme shift. \"This is bad!\" he says to me discreetly on the side of the road, with our car as cover from the prying eyes of the junior M23 soldiers. \"My family is not good. I am not good - we don't know what comes next.\" \n                  Rwandan-backed M23 rebels complete takeover of key Democratic Republic of Congo city\n                 \n                  Inside Congolese city overrun by rebels as echoing blasts and crack of bullets force families to hide\n                 \n                  What is the fighting in Democratic Republic of Congo about - and is Rwanda invading?\n                  Small groups are meeting the rebels with cheers and clapping. We cannot tell if it is relief from the Congolese state or a necessary precaution for many who do not want to leave their hometown on the cusp of a new administration. But before they can settle in and set up a local authority, M23 have time to stop and humiliate their former enemy. Not just the Congolese troops, but the Romanian mercenaries fighting alongside them. MONUSCO, the United Nations's peacekeeping group in the DRC, brokered an evacuation convoy for the paid fighters to go to Rwanda with trucks full of Uruguayan peacekeeping troops watching as M23 led the handover through their newly-captured border. As the Romanian men pass through in a single file, they are chastised by M23 spokesperson Willy Ngoma who taps them mockingly one by one. \"Come on soldier!\" he said. \"You were fighting for money - we were fighting for our life!\" Read more:Hospitals overwhelmed as rebels complete takeover of GomaInside the Congolese city overrun by rebels I corner him as he flags the buses through - could you have come this far without Rwanda's support? He tries to keep busy, and after the fourth time I repeat the question, he yells into my face in French: \"We are a Congolese army, we are Congolese! We fight for a fair and noble cause - we are Congolese. We are not helped by Rwanda!\" It will take more than a feverish denial to undermine the widely known support of Rwanda for M23 - one that has been condemned at the highest levels of the United Nations and senior diplomats from around the world. As the \"Welcome to Rwanda\" sign gets closer, the last Romanian mercenary limps across with a wounded leg flanked by a UN security advisor and an Indian medic. A surreal sight of a man heading home after fighting a war in a foreign country surrounded by Congolese families fleeing the war at home."
    },
    {
        "title": "Ryanair puts customers on notice of more unruly passenger lawsuits",
        "description": "The chief executive of Europe's largest airline has put customers on notice it will prosecute disruptive passengers as between two and three flights a week are diverted due to poor behaviour on Ryanair flights.",
        "url": "https://news.sky.com/story/ryanair-airline-puts-customers-on-notice-of-more-unruly-passenger-prosecutions-13298989",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-ryanair-michael-oleary_6813922.jpg?20250129203120",
        "type": "Home",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-01-29 16:34:00",
        "Headline": "Ryanair CEO Michael O'Leary said there's a \"slim\" chance of Heathrow getting a third runway, but the airline wouldn't use the airport, even if it were free.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  The chief executive of Europe's largest airline has put customers on notice it will prosecute disruptive passengers as between two and three flights a week are diverted due to poor behaviour on Ryanair flights. Ryanair boss Michael O'Leary told Sky News: \"If passengers continue disrupting our flights, we will sue you for the cost of those diversions and those disruptions.\" He later told Sky's Politics Hub with Sophy Ridge: \"Airports are still the only places where there are no licensing laws. You could be buying pints at 6am in the morning. Who needs to be drinking pints at 6am in the morning? \"We're trying to be a bit more sensible. Just behave. We don't allow you to drink and drive. All we're saying is drink a little less before you fly, and then let everybody have a better flight experience.\" Earlier this month the low-cost airline said it had launched legal action against a passenger who, Ryanair said, cost the carrier £12,500 as it was forced to land early and put passengers up in Porto for a night, rather than continue to the end destination. Money blog: Anti-tourist sentiment 'dangerous', Jet2 boss warns While such diversions are a minority of the 3,500 daily Ryanair flights, Mr O'Leary said: \"We're having two or three of these diversions a week. That's two or three too many.\" He reiterated his call for a two-alcoholic drink limit in airports but said he would be happy for a three-drink cap. \"We don't care what the number is, but there just needs to be a little bit more common sense about it,\" Mr O'Leary said. Ryanair was happy to restrict alcohol sales on its flights, he added. Criticism of Heathrow and Ms Reeves The call for a drinks limit has not been received well by airports, Mr O'Leary said: \"Airports have responded badly as they always do, they want to be filling people full of alcohol, particularly when flights are delayed.\" Criticism was levelled not just at Chancellor Rachel Reeves's newly announced support for a third runway at Heathrow, but at the airport itself. When asked if a third runway at the UK's busiest airport would induce Ryanair to fly to and from the site, Mr O'Leary said the airline had no interest and it would \"never go there\" as it was so \"incredibly operationally inefficient\". \"Even if it was free, we wouldn't go to Heathrow. Because if we have to take an hour, an hour and 15 to turn around a plane, we lose those two extra flights per day per aircraft in our operation.\" Mr O'Leary said the \"odds are against\" a third runway even being built. The problem was not capacity at airports, he added: \"There's lots of underused airports that we could start growing in today.\" The airline is Europe's biggest by route, passenger and aircraft numbers. Heathrow has been contacted for comment."
    },
    {
        "title": "Coca-Cola, Sprite and Appletiser cans recalled in UK after chemical found in testing",
        "description": "A small number of Coca-Cola, Sprite and Appletiser cans in the UK have been recalled.",
        "url": "https://news.sky.com/story/coca-cola-sprite-and-appletiser-cans-recalled-in-uk-after-chemical-found-in-testing-13299294",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-coca-cola-cans_6814089.jpg?20250129232314",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-29 22:59:00",
        "Headline": "The UK recall affects a \"small amount\" of tall cans of Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero. It also includes a \"small number\" of cans of Appletiser.",
        "Content": "A small number of Coca-Cola, Sprite and Appletiser cans in the UK have been recalled. It comes after high levels of a chemical by-product from chlorine disinfectants were found in some of the drinks in overseas tests. Batches of Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero were pulled from shelves in Belgium, Luxembourg and the Netherlands after testing revealed \"elevated levels\" of chlorate, according to Coca-Cola Europacific Partners. It said the UK recall affects a \"small amount\" of tall, imported cans of Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero, which were only sent to cafes and restaurants during a limited time period. It also includes a \"small number\" of imported cans of 6x250ml Appletiser multipacks which were sent only to supermarkets in the UK. All affected cans have production codes from 328 GE to 338 GE, which can be found on the base of the can. Chlorate is a by-product of the breakdown of chlorine-based sanitisers and chlorine chemicals, which are often used to sterilise water. It can cause iodine deficiency in people and is regulated with legal maximum residue limits for a range of foods, including fresh produce, according to Food Standards Scotland. Coca-Cola Europacific Partners said: \"The majority of Coca-Cola products, including standard cans, and all glass and plastic bottles sold in the UK are not impacted.\" It added: \"Whilst independent analysis concluded that the likelihood of any associated risk of feeling temporarily unwell from consuming these products is very low, for the reassurance of consumers, we encourage anyone with an affected can to please call our customer service team on 0800 227711 who will be able to help. \"No other Coca-Cola products are affected by the issue.\" It apologised as it admitted a \"small number of our products have not met our high standards\". It has also been talking to the Food Standards Agency (FSA) about the matter. Read more:Read more from Sky News:Farage now 'has a laugh' with King despite past disagreementsHarvey Weinstein begs judge for earlier retrialStudent accused of being 'persistent sexual predator and rapist' On Tuesday, the FSA said there had been a \"limited distribution to the UK\" of Coca-Cola soft drinks containing higher levels of chlorate. In 2015 the European Food Safety Authority found that levels of chlorate in drinking water and foods were too high and could result in serious health effects, especially among infants and children. These included impaired functioning of the thyroid due to inhibited iodine uptake."
    },
    {
        "title": "Bishop of Liverpool should 'step aside' amid misconduct claims, say senior church leaders in city",
        "description": "A group of senior church leaders in Liverpool have said the city's bishop, who faces misconduct allegations from two women, should \"step aside\".",
        "url": "https://news.sky.com/story/bishop-of-liverpool-should-step-aside-amid-misconduct-claims-say-senior-church-leaders-in-city-13299111",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-john-perumbalath-bishop-of-liverpool_6814026.jpg?20250129223849",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-29 20:32:00",
        "Headline": "One woman has accused the bishop of kissing her without consent and groping her, and another woman accused him of sexual harassment. He has denied the allegations. ",
        "Content": "A group of senior church leaders in Liverpool have said the city's bishop, who faces misconduct allegations from two women, should \"step aside\". The Right Reverend Dr John Perumbalath's position is \"untenable\", said the senior leadership of the Diocese of Liverpool in a letter signed by six people including the Dean of Liverpool, Sue Jones. It comes after one woman accused the bishop of kissing her without consent and groping her, and another woman accused him of sexual harassment, Channel 4 News reported. Bishop Perumbalath said he has \"consistently denied\" the allegations and complied with any investigation from the National Safeguarding Team (NST). The diocese statement said: \"Having listened to clergy, congregations and staff at the diocesan offices and the cathedral, it is with deep regret that the senior leadership of the Diocese of Liverpool feel that the position of the Rt Revd Dr John Perumbalath is currently untenable. \"We believe that the allegations made by the female bishop need to be fully and properly investigated. \"We also believe that while these proper investigations are conducted, the Bishop of Liverpool will need to step aside from all ministry in the Diocese of Liverpool.\" The letter was also signed by Debra Walker, the chair of the House of Laity; the chair of the House of Clergy Peter Dawkin; Pete Spiers, who is the Archdeacon of Knowsley & Sefton; the Archbeacon of Liverpool Miranda Threlfall-Holmes; and the Archdeacon of St Helens and Warrington, Simon Fisher. What does the Church of England say? Following the Channel 4 programme, a Church of England spokesman said in 2023 a complaint of alleged misconduct against Bishop Perumbalath was brought to the NST. The spokesman said it concluded there was not sufficient evidence to bring a safeguarding-related complaint under the Clergy Discipline Measure (CDM) itself but offered the woman support if she wished to do so. They also said the complaint was investigated by police which resulted in no further action. A further disclosure was made by another woman, and the information was \"explored and assessed not to be a safeguarding matter but a matter of alleged misconduct\", the spokesman said. The second complainant did not bring a CDM complaint within the one-year deadline. She later applied for permission to bring it after the deadline, which the Archbishop of York supported, but this was refused by an independent judge, the Deputy President of Tribunals, they added. Bishop of Newcastle 'appalled' Meanwhile, the Bishop of Newcastle, the Right Reverend Dr Helen-Ann Hartley, said on X she was \"shocked and appalled\" at the allegations against the Bishop of Liverpool. She said: \"Yet again failures at the heart of the institution of the Church of England, and specifically by its leadership, undermine credibility and confidence in the church.\" Ms Hartley added: \"I have already spoken out in the strongest of terms about safeguarding failures and do so again. My views have not changed including those regarding the position of the Archbishop of York [Stephen Cottrell].\" She previously called for Mr Cottrell to resign and questioned how he could have any credibility after revelations emerged that a priest at the centre of a sexual abuse case was twice reappointed under him while he was serving as Bishop of Chelmsford. A statement to Sky News from the Archbishop of York said he is \"committed to the work of securing independent scrutiny of safeguarding, the changing of culture and the revisiting of policies in light of learning and critical examination of the Church of England\". \"This will be achieved through committed action undertaken consistently. It will not be achieved overnight.\" The former victim's commissioner Dame Vera Baird has repeatedly called for an overhaul of the regulation of complaints in the Church. She told Sky News: \"It's been dealt with totally internally by people who protect the hierarchy over the people it should be serving. \"But what is shocking is frankly that the Church of England has got so foul that there are these repeated allegations again and again and again, which are not dealt with properly.\""
    },
    {
        "title": "Water bills in England and Wales to rise by average of £10 per month",
        "description": "The average annual water bill will rise by &#163;26% or &#163;123 in the next financial year alone, according to industry figures covering England and Wales.",
        "url": "https://news.sky.com/story/water-bills-in-england-and-wales-to-rise-by-average-of-16310-per-month-13298957",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-water-bill_6806360.jpg?20250121133134",
        "type": "UK",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 15:36:00",
        "Headline": "Households now have a much better idea of their bill increases from April, which will rise at a time when many other bills are also tipped to go up sharply.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The average annual water bill will rise by £26% or £123 in the next financial year alone, according to industry figures covering England and Wales. Water UK confirmed how inflation-busting hikes, determined by the regulator Ofwat in December, would play out from 1 April when a new five-year pricing period begins. The watchdog allowed bills to rise sharply from 2025-30, but not by as much as suppliers had wanted, to help fund badly needed infrastructure upgrades in key areas, such as storm overflows to prevent sewage spills. Water UK, which represents the water firms, said the average water and wastewater bill would go up from £480 to £603 during 2025/26 - an increase of about £10 a month. But the increases will be even harder to swallow for many. Southern Water customers will see the largest in percentage terms, a 47% increase, taking their average bill to £703. Bills for households covered by Hafren Dyfrdwy and South West Water will rise by 32%. Thames Water's 16 million customers face a 31% hike to £639 - a rise of £151 - at a time when the company is still scrambling to secure its financial future amid a massive debt pile that could yet tip it towards a special administration process. Water UK explained that the rises may be higher than customers were expecting as the annual totals now included inflation calculations. The body also said that the increases across households would also vary, depending on circumstances such as water use and whether a water meter was installed.  They will come into force at a time when consumers are facing a surge in other costs. Industry estimates suggest another hefty increase in energy bills will be seen from April, when the energy price cap is adjusted to reflect higher wholesale prices. Council tax is also among the bills set for above-inflation rises. Poorer households get support Water UK said that it recognised the impact that rising water bills would have on poorer households, pledging that more than three million would receive support worth £4.1bn over the five-year pricing period. It urged those concerned about paying the increase to contact their supplier. Water UK also sought to reassure customers that they would see a return, following widespread anger over historic dividends for shareholders. Water UK said firms would invest around £20bn each year to 2030.  Read more from Sky News:Chancellor announces backing for third Heathrow runwayLove Island star freed on bail after being jailed for dog attack Upgrade works will include nine new reservoirs and increased capacity at 1,700 wastewater treatment works to reduce pollution and clear up rivers. Water UK admits rises 'will be difficult' Water UK chief executive David Henderson said: \"We understand increasing bills is never welcome and, while we urgently need investment in our water and sewage infrastructure, we know that for many this increase will be difficult. \"Water companies will invest a record £20bn in 2025-26 to support economic growth, build more homes, secure our water supplies and end sewage entering our rivers and seas.\" The industry has argued that constraints on bills over 15 years, coupled with climate change and population growth, have been responsible for the growing pollution crisis. Regulator says bill rises are 'challenge' Ofwat has denied this, saying companies must take responsibility. Its chief executive David Black said of the bill rises ahead: \"We recognise the challenge that some customers are facing with increasing financial pressures and understand that the water sector is not the only area where customers are faced with rising costs. \"While water bills will vary depending on the circumstances of each household, the average increase forecasted for 2025/26 will be 26% or £123. \"We have pushed companies to double the amount of support over the next five-year period and strongly encourage customers who are struggling to pay their water bills to contact their water company to access this.\""
    },
    {
        "title": "Chancellor Rachel Reeves announces backing for third Heathrow runway",
        "description": "The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-announces-backing-for-third-heathrow-runway-13298590",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813432.jpg?20250129110052",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-29 10:50:00",
        "Headline": "The chancellor says the expansion of Europe's busiest airport is \"badly needed\" - but the Green Party's Sian Berry calls it \"the most irresponsible announcement from any government I have seen since the Liz Truss budget\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced. Ms Reeves said the expansion of Europe's busiest airport was \"badly needed\" to connect the UK to the world and open up new opportunities for growth. A third runway will \"unlock further growth, boost investment increase exports and make the UK more open and more connected\", she said. Politics latest: Reaction to third runway decision It could increase potential GDP (Gross Domestic Product) by 0.43% by 2050 according to a Frontier Economics study, she said. 60% of that boost would go to areas outside London and the southeast, increasing trade opportunities like Scotch whiskey and Scottish salmon, she added. Ms Reeves said an expansion could create more than 100,000 jobs. The announcement has been welcomed by some business groups but has been met with anger from London's Labour mayor Sadiq Khan, the Lib Dems, the Green Party and environmental groups. Conservative leader Kemi Badenoch told Sky News over the weekend she supports a third runway. Read more:Analysis - The big points in chancellor's speech that won't get the headlines As part of a speech on funding infrastructure across the UK to promote growth, Ms Reeves said: \"Persistent delays have caused doubts about our seriousness towards improving our economic prospects.\" She added that business groups like the Confederation of British Industry (CBI), the Federation of Small Businesses (FSB) and the Chambers of Commerce (BCC), as well as trade unions \"are clear - a third runway is badly needed\". 'Britain is a country of huge potential that is untapped' Speaking afterwards to Sky's economics and data editor Ed Conway, Ms Reeves said: \"I want Britain to be a magnet for foreign investment… we should be welcoming the best businesses and the best talent in the world. I want businesses around the world, investors around the world, to see in Britain, what I see, which is a country of huge potential that is untapped.\" The chancellor also spoke of helping British companies to scale up. She said: \"We are introducing the capital market reforms, particularly around pension reform, unlocking £80bn of long-term patient capital by creating these mega funds, the mergers of defined contribution and local government pension schemes, to create those larger funds that can invest at scale in the exciting opportunities in the UK. \"Building on what countries like Australia and Canada do with their big pension funds, to support British industry, and particularly that stage of a business career when they've had the start-up and the seed funding, but now they're looking to scale up, but they find that the access to finance isn't available in the UK, and often look, to example, for the United States.\"  Investments in green aviation fuel Ms Reeves said in her speech that the UK is \"already making great strides in transitioning to cleaner and greener aviation\" and announced the government is investing £63m over the next year into the Advanced Fuel Fund grant programme to support the development of sustainable aviation fuel production plants. The government will be accepting proposals until the summer and will then carry out a \"full assessment\" through the Airport National Policy Statement to \"ensure a third runway is delivered in line with our legal, environmental and climate objectives\".  Ms Reeves said the government expects any associated surface transport costs to the third runway's construction to be financed through private funding. She added a decision on plans to expand Gatwick and Luton, which are currently under way, will be made by the transport secretary \"shortly\". Read more:A long history of Heathrow's third runway plansGreen groups criticise Heathrow campaigner's role in Labour policy creation  A decades-old debate The debate around whether Europe's busiest airport should expand has been circling over British politics for decades. Ms Reeves's decision will likely put her at odds with Climate Secretary Ed Miliband, who has said airport expansions will not go ahead if they cannot meet climate targets. However, he said last week he would not resign if the government approved a third runway despite threatening to resign from Gordon Brown's cabinet as climate change secretary in 2009 over the plans and in 2018 he said an expansion was \"very likely\" to make air pollution worse. He has now said the government can meet both its growth and net zero missions together. London mayor opposes runway Sadiq Khan said he remained opposed to a third runway \"because of the severe impact it will have on noise, air pollution and meeting our climate change targets\". He said he will carefully scrutinise any new proposals, \"including the impact it will have on people living in the area and the huge knock-on effects for our transport infrastructure\". \"Despite the progress that's been made in the aviation sector to make it more sustainable, I'm simply not convinced that you can have hundreds of thousands of additional flights at Heathrow every year without a hugely damaging impact on our environment,\" he added. Green Party MP Sian Berry said expanding airports \"in the face of a climate emergency is the most irresponsible announcement from any government I have seen since the Liz Truss budget\". Conservative shadow chancellor Mel Stride accused Ms Reeves and Sir Keir Starmer and \"their job-destroying budget\" of being \"the biggest barriers to growth\". \"What's worse, the anti-growth chancellor could not rule out coming back with yet more tax rises in March,\" he added. \"This is a Labour government run by politicians who do not understand business, or where wealth comes from. Under new leadership, the Conservatives will continue to back businesses and hold this government to account.\""
    },
    {
        "title": "'I was wrong to call Trump a danger to the world,' says Lord Mandelson",
        "description": "Lord Mandelson says calling Donald Trump a \"danger to the world\" in 2019 was \"ill-judged and wrong\".",
        "url": "https://news.sky.com/story/i-was-wrong-to-call-trump-a-danger-to-the-world-says-lord-mandelson-13298956",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-peter-mandelson-eu_6780845.jpg?20241219202811",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 15:39:00",
        "Headline": "Lord Mandelson is set to become the next UK ambassador. However, the peer's previous comments about Donald Trump have led to rumours he might not be accepted in Washington DC.",
        "Content": "Lord Mandelson says calling Donald Trump a \"danger to the world\" in 2019 was \"ill-judged and wrong\". The former Labour minister has been named as the next UK ambassador to the US, although there have been questions about whether President Trump will accept him. Speaking to Fox News, Lord Mandelson walked back his criticisms from the president's first term in office. Politics latest: Government announces growth plans The 71-year-old told the conservative-backing US TV channel: \"I consider my remarks about President Trump as ill-judged and wrong. \"I think times and attitudes towards the president have changed since then. \"I think people have been impressed, not just by the extraordinary second mandate that he has received from the American people, but the dynamism and energy with which he approached not just the campaign but government as well.\"  Many Labour figures, including the now Foreign Secretary David Lammy, criticised Mr Trump before, during and after his first term in the White House. Now they are in government and Mr Trump is back in power in Washington DC, language has become more diplomatic. Read more:No one is safe in TrumplandTrump aide calls Mandelson a 'moron' Lord Mandelson told the Alain Elkann Interviews podcast previously: \"What Donald Trump represents and believes is an anathema to mainstream British opinion.\" He added: \"Even those who have a sneaking admiration for Donald Trump because of his personality, nonetheless regard him as reckless, and a danger to the world.\" The likely new ambassador criticised Mr Trump's attitude to a previous holder of that office, and said the president was \"little short of a white nationalist and a racist\". 👉 Follow Trump 100 on your podcast app 👈 Speaking now, Lord Mandelson praised Mr Trump, saying he was a \"nice\" and \"fair-minded person\" who could become \"one of the most consequential American presidents I have known in my adult life\". He added: \"I think that with the approach he is taking to government, which frankly just seems to us in Britain so much more organised, it's so much more coherent, he seems to be so much more clear in what he wants to do, we take encouragement from that, that gives us greater confidence.\""
    },
    {
        "title": "Bristol Rovers legend taking legal action against FA over brain condition says he has just years to live",
        "description": "In Bristol, Ian Alexander is a footballing legend.",
        "url": "https://news.sky.com/story/bristol-rovers-legend-taking-legal-action-against-fa-over-brain-condition-says-he-has-just-years-to-live-13299029",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-ian-alexander-rob-harris_6813924.png?20250129203223",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-01-29 18:02:00",
        "Headline": "Ian Alexander, who won the third-tier title and reached a Wembley final with Bristol Rovers in 1990, was given just years to live over suspected chronic traumatic encephalopathy. He is one of 30 former footballers taking legal action again the FA.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  In Bristol, Ian Alexander is a footballing legend. Recognised in the shops - remembered as a stalwart for Rovers, winning the third-tier title and reaching a Wembley final for lower-league clubs in 1990. He was never nationally famous, but like so many in the game, he was playing for the love of it rather than becoming a millionaire. But the memories are fading and muddled for the 62-year-old. Not just forgetting those he played with or against. But, at times, unable to even remember to use a fork to eat. Suspected chronic traumatic encephalopathy (CTE) is blamed - a brain condition linked to repeated blows to the head that can only be definitely diagnosed when the brain is analysed after death. \"We are football addicts, footballers,\" Alexander told Sky News. \"I don't know about the damage it does, and it's the damage from collisions, headers and stuff you don't know about when you play football.\" Now the hope is the High Court uncovers how much football should be blamed. Read more:Hull City legend Dean Windass diagnosed with dementiaBeckham joins calls for more dementia support for footballers Alexander is among more than 30 former players and their families taking legal action against the sport's authorities, including the Football Association. How much were they aware going back decades of the long-term damage caused by repeated blows to the head, concussions and repetitive heading, particularly in training? Finding out the answer is dragging on. A year after the first hearing, they were back in court today in central London, to hear of more delays, more obstacles being put in their way by the sport's governing body. Martin Porter KC, representing the FA, claimed there was a lack of clear direction in the case to narrow down what is being sought from a \"shed loads of documents\" held by such a \"venerable organisation\". \"We are in the middle of a football season, it is a very difficult time, a busy time,\" Mr Porter said. \"We would be putting a lot of demands on our clients to uncover information.\" That prompted an irritated response from Shaman Kapoor, the barrister representing the former players, pointing out the FA executives are not the ones playing. We did hear the initial hint of a defence by the FA, among procedural legal arguments, highlighting health benefits of playing. \"Nobody can play sport without some risk of injury,\" Mr Porter said. \"Are we to discourage the playing of sport?\" But central to the case will be whether anything can be found in the FA archives going back to the 1950s showing, for example, if there was scientific evidence to show heading should have been reduced or removed from the game entirely. The parties are due back in court in June. But Mr Kapoor became increasingly exacerbated and told the court: \"The idea has been to ambush the progress of this litigation\". For Alexander and wife Janet, the slow pace of the case is infuriating. \"Why don't you just get the case going? Get to the bottom of it and let us get on with the rest of our life,\" he said. It is the feeling of justice, not fortunes, they seek, but enough compensation for treatment and to enjoy the life he has left. \"The professor said from your age and your symptoms and stuff, he reckons I've got between two and six years,\" Alexander said. \"So I've got the back of my head. That's what I've got left. And that was a year ago.\" Anxiety attacks make even going to football now a struggle. Read more from Sky News:Chancellor backs third Heathrow runwayCaptain Sir Tom Moore's name dropped from charity Nothing extravagant is planned, just hoping for a caravan strip around his homeland in Scotland. And more trips to neurological experts to discover just what is wrong with his brain and whether football caused it. A tattoo inked on his left arm reads: \"The mind may not remember, but the heart will never forget.\" The hope is football does not forget, with former Leeds player John Stiles leading the lobbying of the government for the football's looming independent regulator to have powers over the long-term impact of head injuries. The concern is of a widespread brain disease epidemic in the game and not enough being done to help the victims. \"Would you go back and do it again? My answer would be yes,\" Alexander said. \"I wouldn't have changed anything in my life. \"Football was my life. I had great times.\" He just wishes it could have been safer. But whether football authorities neglected his, and other players' health, is a matter a judge could end up determining."
    },
    {
        "title": "Coca-Cola, Sprite and Appletiser cans recalled in UK after chemical found in testing",
        "description": "A small number of Coca-Cola, Sprite and Appletiser cans in the UK have been recalled.",
        "url": "https://news.sky.com/story/coca-cola-sprite-and-appletiser-cans-recalled-in-uk-after-chemical-found-in-testing-13299294",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-coca-cola-cans_6814089.jpg?20250129232314",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 22:59:00",
        "Headline": "The UK recall affects a \"small amount\" of tall cans of Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero. It also includes a \"small number\" of cans of Appletiser.",
        "Content": "A small number of Coca-Cola, Sprite and Appletiser cans in the UK have been recalled. It comes after high levels of a chemical by-product from chlorine disinfectants were found in some of the drinks in overseas tests. Batches of Appletiser, Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero were pulled from shelves in Belgium, Luxembourg and the Netherlands after testing revealed \"elevated levels\" of chlorate, according to Coca-Cola Europacific Partners. It said the UK recall affects a \"small amount\" of tall, imported cans of Coca-Cola Original Taste, Coca-Cola Zero Sugar, Diet Coke and Sprite Zero, which were only sent to cafes and restaurants during a limited time period. It also includes a \"small number\" of imported cans of 6x250ml Appletiser multipacks which were sent only to supermarkets in the UK. All affected cans have production codes from 328 GE to 338 GE, which can be found on the base of the can. Chlorate is a by-product of the breakdown of chlorine-based sanitisers and chlorine chemicals, which are often used to sterilise water. It can cause iodine deficiency in people and is regulated with legal maximum residue limits for a range of foods, including fresh produce, according to Food Standards Scotland. Coca-Cola Europacific Partners said: \"The majority of Coca-Cola products, including standard cans, and all glass and plastic bottles sold in the UK are not impacted.\" It added: \"Whilst independent analysis concluded that the likelihood of any associated risk of feeling temporarily unwell from consuming these products is very low, for the reassurance of consumers, we encourage anyone with an affected can to please call our customer service team on 0800 227711 who will be able to help. \"No other Coca-Cola products are affected by the issue.\" It apologised as it admitted a \"small number of our products have not met our high standards\". It has also been talking to the Food Standards Agency (FSA) about the matter. Read more:Read more from Sky News:Farage now 'has a laugh' with King despite past disagreementsHarvey Weinstein begs judge for earlier retrialStudent accused of being 'persistent sexual predator and rapist' On Tuesday, the FSA said there had been a \"limited distribution to the UK\" of Coca-Cola soft drinks containing higher levels of chlorate. In 2015 the European Food Safety Authority found that levels of chlorate in drinking water and foods were too high and could result in serious health effects, especially among infants and children. These included impaired functioning of the thyroid due to inhibited iodine uptake."
    },
    {
        "title": "How paternity leave in the UK compares to other countries",
        "description": "Statutory paternity leave in the UK is the least generous in Europe - with new dads getting less than half the minimum wage for a maximum of two weeks.",
        "url": "https://news.sky.com/story/how-paternity-leave-in-the-uk-compares-to-other-countries-13298835",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-father-baby_6814112.jpg?20250130014639",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 11:20:00",
        "Headline": "Dads in the UK get some of the least generous paternity leave in Europe. Some new dads describe working just 24 hours after the birth of their child - while their counterparts in Scandinavia say generous policies have helped them bond with their children.",
        "Content": " Statutory paternity leave in the UK is the least generous in Europe - with new dads getting less than half the minimum wage for a maximum of two weeks. Other countries have far better paternity offers, with experts in one Scandinavian country saying it has made its society more equal. Here, we take a look at what the UK offers new dads and co-parents and how it compares to what's available abroad. What does the UK government offer? Employees are able to take one or two weeks of paid leave. This applies if they are having a baby, adopting a child or having a baby through a surrogacy agreement. The rules also apply for same-sex couples. The government either pays £184.03 a week or 90% of an employee's average weekly earnings - whichever amount is lower. Some companies will offer their own deals as part of benefits packages to staff - but many firms may not be able to afford their own schemes. If you are self-employed, you have no rights to statutory paternity leave at all. A partner's maternity leave can be shared provided both employers have opted into the scheme. It is not additional leave and involves the person on maternity leave giving their partner some of their time off. Up to 50 weeks of leave and up to 37 weeks of pay can be shared. How does the UK compare with other countries? Along with being the least generous in Europe, the UK's paternity leave is among the worst of the world's richest countries. For example, Norway allocates 15 weeks of parental leave exclusively for dads - and it is paid at more than 90% of the average salary. In the UK, less than a fifth of the average salary is paid. In Sweden, leave for new fathers is a normal part of society. NGO worker Otto took nine months off - and this was after his wife Rebecca had already taken nine months of parental leave when their daughter Vivian was born. Parents in Sweden are given 480 days of paid parental leave between them. They have the flexibility to split that how they like, but they both have 90 days reserved exclusively for them - if it is not used, it is lost. The amount you get paid in Sweden is based on your income. It is usually up to 80% of your salary, but it is capped so it could be a bit less if you earn a high wage. Fathers account for about 30% of all parental leave in Sweden. People in Sweden pay far more tax than in the UK - but dads appear happy to pay as it can mean more time with their kids. What could better UK paternity leave mean for women? Joeli Brearley is the founder of Pregnant Then Screwed, a charity supporting mothers, and thinks better paternity leave can reduce the gender pay gap. \"We did some research with the Centre For Progressive Policy, which looked at other countries that have at least six weeks' paternity leave, paid at a decent percentage of salary,\" she said. \"And we found that in countries that do that have on average a 4% less gender pay gap. \"And that's because you have more women in work and more women working longer hours.\" Campaigners say the current paternity leave offer means the mum stays at home to look after the baby, while the dad is rushed back to work. Maternity leave is one of the big drivers of the gender pay gap between men and women - which currently sits at about 7% in the UK, according to the Office For National Statistics. The more time women take away from work, the more likely they are to miss out on promotions and career progression - and it also establishes the mum as the primary caregiver. What has Sweden's parental leave policy done for society? Some believe it has made society more equal - especially since 90 days were ring-fenced for individual parents in Sweden in 2005. Arvid Vikman Rindevall represents the left-wing Social Democrats party - and heads up both the Stockholm Labour Market Committee and the city's Equalities Committee - and said fathers can create \"closer bonds\" with their children. \"When we are asking fathers in Sweden today, 'Why aren't you taking more parental leave?' - the most common answer is that it's not seen as a good thing in their company,\" he told Sky News. \"So when we say that the father has to take three months, it's easier for them to go back to their bosses and say that I'm planning to stay at home and it is actually my right to by law.\" Otto told Sky News that Sweden's paternity leave allows fathers and children to create a special bond. \"It's very different from working your day job. But it's also a great opportunity and very rewarding,\" Otto told Sky News in Stockholm. \"It's a big word but it's empowering to have that responsibility as well, and to share it.\" What do people demanding better paternal leave say in the UK? Campaigners believe things are changing - and the movement is growing as it impacts all sections of society. Some new dads said they were working just 24 hours after the birth of their child, describing the period as a \"blur\" - one that passed so quickly it was now difficult to recall. Marvyn Harrison, from Dope Black Dads, said: \"This is not left or right. This is not party aligned. This is literally for us as real people being impacted. \"It's not just working class people that get this. It's not just upper middle class people. This is for everybody. \"There's no movement to counter what we're saying. And I think that's a really important indicator of just how important this is.\" What action is the UK government taking? The Labour government plans to change things - slightly. It has pledged to make paternity leave available to all employees as soon as they start a job rather than requiring employees to have been in a job for six months to claim. And the government claims more changes could be on the way. A Department for Business and Trade spokesperson said it was planning a review of \"wider statutory parental leave to ensure it offers the best possible support to working families around the country and boost economic growth\". There is also a push for MPs to vote for an amendment to the employment bill around this issue. At PMQs on Wednesday, Sir Keir Starmer said his government was \"extending parental rights\". \"We are conducting a review into parental leave because you can't grow the economy if parents have to choose between work and their children,\" he said. \"Thanks to the employment rights bill, 30,000 more fathers will get paternity leave.\""
    },
    {
        "title": "Bishop of Liverpool should 'step aside' amid misconduct claims, say senior church leaders in city",
        "description": "A group of senior church leaders in Liverpool have said the city's bishop, who faces misconduct allegations from two women, should \"step aside\".",
        "url": "https://news.sky.com/story/bishop-of-liverpool-should-step-aside-amid-misconduct-claims-say-senior-church-leaders-in-city-13299111",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-john-perumbalath-bishop-of-liverpool_6814026.jpg?20250129223849",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 20:32:00",
        "Headline": "One woman has accused the bishop of kissing her without consent and groping her, and another woman accused him of sexual harassment. He has denied the allegations. ",
        "Content": "A group of senior church leaders in Liverpool have said the city's bishop, who faces misconduct allegations from two women, should \"step aside\". The Right Reverend Dr John Perumbalath's position is \"untenable\", said the senior leadership of the Diocese of Liverpool in a letter signed by six people including the Dean of Liverpool, Sue Jones. It comes after one woman accused the bishop of kissing her without consent and groping her, and another woman accused him of sexual harassment, Channel 4 News reported. Bishop Perumbalath said he has \"consistently denied\" the allegations and complied with any investigation from the National Safeguarding Team (NST). The diocese statement said: \"Having listened to clergy, congregations and staff at the diocesan offices and the cathedral, it is with deep regret that the senior leadership of the Diocese of Liverpool feel that the position of the Rt Revd Dr John Perumbalath is currently untenable. \"We believe that the allegations made by the female bishop need to be fully and properly investigated. \"We also believe that while these proper investigations are conducted, the Bishop of Liverpool will need to step aside from all ministry in the Diocese of Liverpool.\" The letter was also signed by Debra Walker, the chair of the House of Laity; the chair of the House of Clergy Peter Dawkin; Pete Spiers, who is the Archdeacon of Knowsley & Sefton; the Archbeacon of Liverpool Miranda Threlfall-Holmes; and the Archdeacon of St Helens and Warrington, Simon Fisher. What does the Church of England say? Following the Channel 4 programme, a Church of England spokesman said in 2023 a complaint of alleged misconduct against Bishop Perumbalath was brought to the NST. The spokesman said it concluded there was not sufficient evidence to bring a safeguarding-related complaint under the Clergy Discipline Measure (CDM) itself but offered the woman support if she wished to do so. They also said the complaint was investigated by police which resulted in no further action. A further disclosure was made by another woman, and the information was \"explored and assessed not to be a safeguarding matter but a matter of alleged misconduct\", the spokesman said. The second complainant did not bring a CDM complaint within the one-year deadline. She later applied for permission to bring it after the deadline, which the Archbishop of York supported, but this was refused by an independent judge, the Deputy President of Tribunals, they added. Bishop of Newcastle 'appalled' Meanwhile, the Bishop of Newcastle, the Right Reverend Dr Helen-Ann Hartley, said on X she was \"shocked and appalled\" at the allegations against the Bishop of Liverpool. She said: \"Yet again failures at the heart of the institution of the Church of England, and specifically by its leadership, undermine credibility and confidence in the church.\" Ms Hartley added: \"I have already spoken out in the strongest of terms about safeguarding failures and do so again. My views have not changed including those regarding the position of the Archbishop of York [Stephen Cottrell].\" She previously called for Mr Cottrell to resign and questioned how he could have any credibility after revelations emerged that a priest at the centre of a sexual abuse case was twice reappointed under him while he was serving as Bishop of Chelmsford. A statement to Sky News from the Archbishop of York said he is \"committed to the work of securing independent scrutiny of safeguarding, the changing of culture and the revisiting of policies in light of learning and critical examination of the Church of England\". \"This will be achieved through committed action undertaken consistently. It will not be achieved overnight.\" The former victim's commissioner Dame Vera Baird has repeatedly called for an overhaul of the regulation of complaints in the Church. She told Sky News: \"It's been dealt with totally internally by people who protect the hierarchy over the people it should be serving. \"But what is shocking is frankly that the Church of England has got so foul that there are these repeated allegations again and again and again, which are not dealt with properly.\""
    },
    {
        "title": "New bowel cancer detection method more than 90% accurate, research finds",
        "description": "A new method for detecting bowel cancer is more than 90% accurate at predicting which higher risk people will develop the disease, research found.",
        "url": "https://news.sky.com/story/new-bowel-cancer-detection-method-more-than-90-accurate-research-finds-13298882",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bowel-cancer_6813609.jpg?20250129140159",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 12:58:00",
        "Headline": "The study, funded by Cancer Research UK, could lead to a blood test which will inform doctors which inflammatory bowel disease patients are most at risk of cancer.",
        "Content": "A new method for detecting bowel cancer is more than 90% accurate at predicting which higher risk people will develop the disease, research found. People with inflammatory bowel disease (IBD), such as Crohn's and ulcerative colitis, are known to have an increased chance of bowel cancer, but not all will develop it. Now, a study funded by Cancer Research UK has shown more than 90% accuracy in predicting bowel cancer risk in the next five years in a high-risk group of people with IBD. This could lead to a blood test which will inform doctors which IBD patients are most at risk of bowel cancer. IBD can irritate the lining of the bowel and can cause abnormal pre-cancerous cells to form if left untreated. To identify people's cancer risk, scientists at the Institute of Cancer Research (ICR), working with doctors at St Mark's in London, the UK's specialist bowel hospital, found that people with IBD whose pre-cancerous cells had lost multiple copies of their DNA were far more likely to go on to develop bowel cancer. The scientists also created an algorithm that calculates the risk of future bowel cancer, based on the exact pattern of the DNA which is altered in the pre-cancerous cells. \n                  Doctors look for clues on why 'super survivors' overcome cancer in first global study\n                 \n                  Surgeons remove tumour through patient's eye socket in UK first\n                 \n                  Princess of Wales says 'it's a relief to now be in remission' from cancer\n                 Samples of pre-cancerous cells were taken from 122 patients with IBD for the study published in the journal Gut. About half of the patients went on to develop bowel cancer within five years, while the other half remained cancer-free. Professor Ailsa Hart, co-lead of the study, from St Mark's, said: \"Patients with inflammatory bowel disease have a higher risk of developing colorectal cancer than people without IBD, and need to undergo assessment with regular colonoscopies to try to detect early signs of cancer. \"These tests are onerous and unpleasant for patients, imperfect at detecting early cancer changes and costly to health services. \"If early signs of cancer are detected, surgery, which involves removing the colon, is advocated. Finding smarter ways to assess these colons is much needed. \"Here we describe a potential biomarker, which can be readily translated into clinical practice, to improve assessment of patients with IBD and early signs of cancer to help with the decision for surgery.\" Around 500,000 people in the UK are thought to have Crohn's or ulcerative colitis. Scientists hope their findings could spare people who are at much lower risk from the stress of needing regular colonoscopies or undergoing surgery to remove the colon. Read more:Doctors look for clues on why 'super survivors' overcome cancerSurgeons remove tumour through patient's eye socket'Pioneering' drug for rare eye cancer to be rolled out Professor Trevor Graham, from the ICR, which co-led the research, said: \"Most people with ulcerative colitis or Crohn's disease won't develop bowel cancer. \"But for those that have these conditions and are showing signs of pre-cancer in their colon, there are some tough decisions to make. \"Either they have it monitored regularly, in the hope that it doesn't become cancer, or they have their bowel removed to guarantee they don't get cancer in the future. Neither of these options are particularly pleasant. \"Our test and algorithm give people with IBD, and the doctors who care for them, the best possible information so that they can make the right decision about how to manage their cancer risk.\" Executive director of research and innovation at Cancer Research UK, Dr Iain Foulkes, said: \"Genome sequencing is now far cheaper and more widespread than ever before, and it's changing how we look at cancer. \"Getting a full readout of tumour DNA means we can see a much bigger picture of how someone's cancer started and how it is likely to change over time. \"With this research, we can focus resources on treating people with IBD who are at really high risk, saving health services valuable time and money.\""
    },
    {
        "title": "Chinese PhD student accused of being 'persistent sexual predator, voyeur and rapist'",
        "description": "A Chinese PhD student who has been accused of drugging and raping 10 women was \"a persistent sexual predator, a voyeur and a rapist,\" a jury has heard.",
        "url": "https://news.sky.com/story/chinese-phd-student-accused-of-being-persistent-sexual-predator-voyeur-and-rapist-13298997",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-zhenhao-zou-inner-london-crown-court_6813844.jpg?20250129183113",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 17:09:00",
        "Headline": "Zhenhao Zou faces 11 counts of rape, three counts of voyeurism, 12 of possession of an extreme pornographic image, one of false imprisonment and eight of possession of a controlled substance with intent to supply. He denies all the charges.",
        "Content": "A Chinese PhD student who has been accused of drugging and raping 10 women was \"a persistent sexual predator, a voyeur and a rapist,\" a jury has heard. Zhenhao Zou, 27, faces 11 counts of rape, three counts of voyeurism, 12 of possession of an extreme pornographic image, one of false imprisonment and eight of possession of a controlled substance with intent to supply. The student appeared at Inner London Crown Court on Wednesday and denied all charges. Mr Zou moved to Belfast in 2017 to study at Queen's University before relocating to London in 2019 to do a master's degree and then a PhD at UCL. He is accused of raping the women between September 2019 and May 2023. Catherine Farrelly opened the prosecution case by saying: \"To the outside world, he undoubtedly presents as a smart and charming young man. \"However, as you know from the indictment in this case, the document which contains 35 separate criminal allegations against him, the prosecution say that he is also a persistent sexual predator; a voyeur and a rapist.\" She added: \"The prosecution case at this trial is that he would meet women, he would stupefy them, either with drink or drugs, and, once they were significantly under the influence of those drinks or drugs, he would then rape them. \"Often, he would record himself doing so and during this trial, you will be shown several recordings which the prosecution says are the defendant's souvenirs of many rapes that he had committed. \"Items that he kept for his own private sexual gratification so that he could watch, at his leisure, his rapes of these women, who he had rendered often unconscious and totally vulnerable to his will.\" Alleged video recordings of nine of 10 women Police have identified two of the 10 alleged victims, the court was told. It is claimed there are video recordings relating to nine of the 10 women, for which Mr Zou is charged with possessing extreme pornographic images. There are also two other recordings in which the male involved cannot be identified. Mr Zou will argue the sexual interactions were consensual, the judge told jurors. He will say drugs and alcohol were voluntarily consumed by the women and some of the footage captured involved role playing. Mr Zou is also accused of eight counts of possession of a controlled drug with intent to supply, allegedly MDMA, ketamine, butanediol and alprazolam. He denies possessing MDMA or ketamine and claims the butanediol and alprazolam were for personal use."
    },
    {
        "title": "Merchandise stand catches fire outside Manchester City's stadium ahead of Champions League match",
        "description": "A merchandise stand caught fire outside Manchester City's stadium ahead of a Champions League game tonight.",
        "url": "https://news.sky.com/story/merchandise-stand-catches-fire-outside-man-citys-stadium-ahead-of-champions-league-match-13298967",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-fire-merchandise-kiosk_6813849.jpg?20250129183656",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-29 16:10:00",
        "Headline": "The blaze started shortly before 6pm, close to where the team had been due to enter the stadium at around 6.30pm.",
        "Content": " A merchandise stand caught fire outside Manchester City's stadium ahead of a Champions League game tonight. An area near the ground was evacuated and video online showed flames and smoke coming from the kiosk, which is located near the players' entrance. The blaze started shortly before 6pm, close to where the team had been due to enter the Etihad Stadium at around 6.30pm. Fire crews were on the scene within minutes and the blaze has since been brought under control. The fire broke out near the entrance to the Colin Bell West Stand. Fans had gathered nearby for a pre-match entertainment show that included on-stage interviews with Manchester City's new January signings Omar Marmoush, Vitor Reis and Abdukodir Khusanov. At the time of the blaze, the show had already begun with women's players Rebecca Knaak and Aemu Oyama on stage. \n                  Champions League draw: UEFA insists no risk AI-assisted system will be manipulated by cyber attacks\n                 \n                  Champions League pitch invader banned from games after '£250k Belarusian vlogger prank'\n                 \n                  Wembley security at Champions League final was an improvement - but lessons still to be learnt\n                 The event was suspended as flames took hold of the stand and stewards moved fans away before fire crews arrived on the scene. At 6.22pm, it was announced the stadium was open and fans could enter, but three entrance gates inside the cordoned-off area near the scene of the blaze were still shut. The match kicked off on time at 8pm. City face Belgian side Club Brugge as the new-look league phase of the Champions League reaches its conclusion tonight. City, who are 25th in the standings, must win the game to make the knockout play-offs. The remainder of the pre-match show was cancelled. Read more from Sky News:Chancellor announces backing for third Heathrow runwayLove Island star freed on bail after being jailed for dog attack A club statement read: \"Manchester City FC can confirm that there has been a fire in one of the outside merchandise kiosks, located near the entrance to the Colin Bell West Stand. \"Emergency services are present at the scene and the fire has now been extinguished. \"The safety of all attending the match tonight is our top priority, and as such all events planned for West Stand reception have been cancelled, including the welcome event for new players, and the first team arrival. \"All entrances are open, and fans can move around the Etihad Stadium as per usual. Thank you for your cooperation. \"We can confirm that tonight's match will kick off at 8pm as originally planned. We look forward to welcoming everyone to the Etihad Stadium for tonight's match.\""
    },
    {
        "title": "Surreal scenes as foreign soldiers sent to Rwanda alongside Congolese troops as rebels take capital",
        "description": "On the doorstep of Goma - the site of the UN's biggest peacekeeping mission in the world - there are signs of surrendered soldiers and fierce battles.",
        "url": "https://news.sky.com/story/watch-moment-sky-news-challenges-m23-rebels-over-rwandas-support-13298961",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-romanian-romania-congo_6813560.jpg?20250129130117",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-01-29 16:46:00",
        "Headline": "The Rwandan-backed M23 rebels have released captured Romanian mercenaries who were fighting with the Congolese army. As they passed a border, they were chastised by Willy Ngoma, who tapped them mockingly one by one.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n  On the doorstep of Goma - the site of the UN's biggest peacekeeping mission in the world - there are signs of surrendered soldiers and fierce battles. As we walked on the road in front of the United Nations' main base, we stepped around fatigues, rounds and helmets once belonging to the Congolese army fighting the Rwandan-backed M23 rebels. The rebels now control the strategic city of Goma after fighting for the border post with Rwanda. It sits south of the swathes of mineral-rich mining territory the rebels have been seizing through last year. We see them packed on the back of trucks still marked by the FARDC logo of the Congolese army. I ask one man watching from the side of the road what he makes of this extreme shift. \"This is bad!\" he says to me discreetly on the side of the road, with our car as cover from the prying eyes of the junior M23 soldiers. \"My family is not good. I am not good - we don't know what comes next.\" \n                  Rwandan-backed M23 rebels complete takeover of key Democratic Republic of Congo city\n                 \n                  Inside Congolese city overrun by rebels as echoing blasts and crack of bullets force families to hide\n                 \n                  What is the fighting in Democratic Republic of Congo about - and is Rwanda invading?\n                  Small groups are meeting the rebels with cheers and clapping. We cannot tell if it is relief from the Congolese state or a necessary precaution for many who do not want to leave their hometown on the cusp of a new administration. But before they can settle in and set up a local authority, M23 have time to stop and humiliate their former enemy. Not just the Congolese troops, but the Romanian mercenaries fighting alongside them. MONUSCO, the United Nations's peacekeeping group in the DRC, brokered an evacuation convoy for the paid fighters to go to Rwanda with trucks full of Uruguayan peacekeeping troops watching as M23 led the handover through their newly-captured border. As the Romanian men pass through in a single file, they are chastised by M23 spokesperson Willy Ngoma who taps them mockingly one by one. \"Come on soldier!\" he said. \"You were fighting for money - we were fighting for our life!\" Read more:Hospitals overwhelmed as rebels complete takeover of GomaInside the Congolese city overrun by rebels I corner him as he flags the buses through - could you have come this far without Rwanda's support? He tries to keep busy, and after the fourth time I repeat the question, he yells into my face in French: \"We are a Congolese army, we are Congolese! We fight for a fair and noble cause - we are Congolese. We are not helped by Rwanda!\" It will take more than a feverish denial to undermine the widely known support of Rwanda for M23 - one that has been condemned at the highest levels of the United Nations and senior diplomats from around the world. As the \"Welcome to Rwanda\" sign gets closer, the last Romanian mercenary limps across with a wounded leg flanked by a UN security advisor and an Indian medic. A surreal sight of a man heading home after fighting a war in a foreign country surrounded by Congolese families fleeing the war at home."
    },
    {
        "title": "Deadly stampede kills 30, injures dozens, at Maha Kumbh Hindu festival in northern India",
        "description": "At least 30 people have died and 60 have been injured in a stampede at a Hindu festival in northern India.",
        "url": "https://news.sky.com/story/many-feared-dead-after-stampede-at-hindu-festival-in-northern-india-13298709",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-india-stampede-prayagraj_6813247.jpg?20250129011933",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-29 01:16:00",
        "Headline": "Authorities had expected a record 100 million people to visit Prayagraj for the Maha Kumbh, or \"festival of the Sacred Pitcher\", on Wednesday.",
        "Content": " At least 30 people have died and 60 have been injured in a stampede at a Hindu festival in northern India. Images from the scene in the city of Prayagraj, in Uttar Pradesh state, show bodies being stretchered away and rescuers helping those who were hurt. All 60 people injured have been taken to hospital, according to local police. Millions of people were attempting to take a holy bath in the river at the massive Maha Kumbh festival when there was an initial stampede at 1am local time (7.30pm UK time) on Wednesday. Authorities said people trying to escape it were then caught in a second - and more serious - stampede at an exit. Devotees had congregated to bathe at the confluence of the Ganges, the Yamuna and the mythical Saraswati rivers. Authorities took more than 16 hours to release precise numbers of those injured and killed. A Rapid Action Force unit, a special team deployed during crisis situations, was sent to the scene. The state's most senior official, Yogi Adityanath, made a televised statement later on Wednesday, urging those still planning to bathe in the Ganges to do it elsewhere on the riverbank. \"The situation is now under control, but there is a massive crowd of pilgrims,\" he said. Around 30 million people had taken the holy bath by 8am local time on Wednesday, he added. Prime Minister Narendra Modi said he has spoken to Mr Adityanath, calling for \"immediate support measures\", according to the ANI news agency. Authorities had expected a record 100 million people to visit Prayagraj for the Maha Kumbh - \"festival of the Sacred Pitcher\" - on Wednesday for the holy dip. It is regarded as a significant day for Hindus, due to a rare alignment of celestial bodies after 144 years. The Maha Kumbh festival, which is held every 12 years, started on 13 January, lasts six weeks, and is the world's largest religious gathering. Organisers had forecast that more than 400 million people would attend the pilgrimage site over the course of the festival. Authorities have built a sprawling tent city on the riverbanks, equipped with 3,000 kitchens, 150,000 toilets and 11 hospitals. Stampedes are relatively common around Indian religious festivals, where large crowds can gather in small areas."
    },
    {
        "title": "Microsoft hit as AI spending in sharp focus after DeepSeek market shock",
        "description": "Shares in Microsoft have fallen sharply after investment spending came in higher than expected in its latest results, released just days after the DeepSeek market shock for tech stocks.",
        "url": "https://news.sky.com/story/microsoft-hit-as-ai-spending-in-sharp-focus-after-deepseek-market-shock-13299044",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-microsoft-computing_6586997.jpg?20240621061508",
        "type": "World",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 18:44:00",
        "Headline": "Microsoft is not only investing heavily in AI but a big shareholder in research-led OpenAI, making the firm heavily exposed to shifts in investor sentiment.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shares in Microsoft have fallen sharply after investment spending came in higher than expected in its latest results, released just days after the DeepSeek market shock for tech stocks. The company, which has received reprimands from shareholders previously over AI-related bills, had already let it be known it expected to spend $80bn this year ahead of its earnings report on Wednesday night. That AI spending forecast came before Monday's rout for AI-linked stocks that saw the leading AI chipmaker Nvidia suffer the worst one-day loss in history, with almost $600m erased from its market value. Money latest: Ryanair boss launches blistering attack on chancellor While it has since clawed back some of those losses, it has left investors pondering whether the levels of investment planned by big US tech as a whole is completely necessary. It's all a consequence of the emergence of DeepSeek - the Chinese-owned and developed chatbot currently sitting atop Apple's app store free downloads. It toppled ChatGPT to get there. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 Read more: What is DeepSeek and why the fuss?AI race now a contest between superpowers DeepSeek's claims to have created the assistant on a shoestring budget - when compared to the vast US investment to date - forced US tech investors to not only question the huge sums involved but also the lofty market values of exposed firms. Ahead of Monday's market reaction that saw constituents of the Nasdaq bleed a combined total above €1trn, there had been an 18-month stampede for AI-linked shares. Microsoft was among those to benefit in that time and among those to face pressure on Monday. The company, a major shareholder in privately owned OpenAI, lost $7bn in market value. Read more from Sky News:Lloyds to cut 136 group branchesChancellor backs Heathrow third runwayPost Office unveils new wave of cuts Analysts said that Microsoft's latest share price pain was related to slower-than-expected growth in its crucial Azure cloud business between October and December despite an increasing contribution from AI. Capital expenditure came in $1.6bn higher than consensus forecasts. Just hours earlier, the company announced that it had added DeepSeek's model to its offerings on Azure. Shares were up to 4% lower in after-hours trading despite both group revenue and profits beating estimates."
    },
    {
        "title": "Scientists monitoring football-pitch sized asteroid that could hit Earth in the future",
        "description": "The European Space Agency (ESA) has revealed it is closely monitoring an asteroid the size of a football pitch that could hit the Earth in a little over seven years.",
        "url": "https://news.sky.com/story/scientists-monitoring-football-pitch-sized-asteroid-that-could-hit-earth-in-the-future-13299214",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-asteroid-2024-yr4_6814006.jpg?20250129221348",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-01-29 21:55:00",
        "Headline": "The asteroid, called 2024 YR4, measures 100m by 40m. The Earth takes a direct hit from an asteroid of that size only once every few thousand years.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n The European Space Agency (ESA) has revealed it is closely monitoring an asteroid the size of a football pitch that could hit the Earth in a little over seven years. The asteroid, called 2024 YR4, is estimated to have a one in 83 chance of a direct hit, causing \"severe damage to a local region\", according to ESA. The space rock, which measures 100m by 40m, is currently at a distance of around 27 million miles and moving away from the planet. But its path will cross the Earth's orbit on 22 December 2032. Most likely there would be a near miss, with the asteroid passing within a few thousand miles. The Space Mission Planning Advisory Group, which is chaired by ESA, will discuss the latest observations of the asteroid at a meeting in Vienna next week. If the impact risk is confirmed it will make official recommendations to the United Nations and work may begin on options for a \"spacecraft-based response to the potential hazard\", the agency said in a statement. Dr Simeon Barber, a space scientist at the Open University, told Sky News: \"We shouldn't be overly worried - at least not just yet. \"That's because our early detection systems quite often overestimate the likelihood of an impact with Earth. \"In the early stages, we can't determine its trajectory very accurately, and so the probability of impact has to take into account this uncertainty. \"It's likely that as our technologies for detecting Earth-bound objects improve, we may see an increasing number of alerts such as this. \"It's important that we find the right balance between treating the threat seriously, but not over-reacting in these early stages of discovery when the trajectory is still not well-defined.\" Read more:'New Concorde' prototype jet breaks sound barrier for first timeSimple blood test could revolutionise dementia diagnosisCalorie labelling could make eating disorders worse 'Protect our home planet' Just over two years ago NASA smashed a spacecraft into the 160m-wide asteroid Dimorphos and successfully changed its orbit. At the time NASA administrator Bill Nelson said: \"All of us have a responsibility to protect our home planet. After all, it's the only one we have.\" Near-Earth Asteroid 2024 YR4 was first spotted by a telescope in Chile. Since the start of January, astronomers have been tracking the asteroid to gauge its size and movement. The asteroid is expected to fade from view within the next few months as it moves further from the Earth. Increasingly powerful telescopes will be trained on the rock to gather as much data as possible on its trajectory. Once it disappears it won't come back into view until 2028. How much damage would such an impact do? The Earth takes a direct hit from an asteroid of that size only once every few thousand years. In 1908, a slightly smaller asteroid - thought to have measured 60m across - exploded over Siberia. It flattened 80 million trees over an area of 830 square miles."
    },
    {
        "title": "Elizabeth Rose Struhs's parents and members of religious sect guilty of her manslaughter",
        "description": "The parents of an eight-year-old Australian girl - and 12 other members of their hardline religious sect - have been found guilty of her manslaughter after withholding her diabetes medication.",
        "url": "https://news.sky.com/story/elizabeth-rose-struhss-parents-and-members-of-religious-sect-guilty-of-her-manslaughter-13298774",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-elizabeth-struh-australia_6813351.jpg?20250129091155",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-29 08:52:00",
        "Headline": "Elizabeth Rose Struhs died on 7 January 2022 at home in Toowoomba, Queensland, after six days without insulin injections for her type 1 diabetes.",
        "Content": "The parents of an eight-year-old Australian girl - and 12 other members of their hardline religious sect - have been found guilty of her manslaughter after withholding her diabetes medication. Elizabeth Rose Struhs died on 7 January 2022 at home in Toowoomba, Queensland, after six days without insulin injections for her type 1 diabetes. Her father Jason Struhs, 53, mother Kerrie Elizabeth, 49, brother Zachary Alan Struhs, 22, and the leader of the family's religious group The Saints, Brendan Luke Stevens, 63, were among the 14 convicted over her death. During the nine-week trial last year, the jury heard the faith healing group, which has been described by many in Australia as a cult, withheld her medication on purpose - believing God would save her.  After his arrest, Elizabeth Struhs's father told a police officer: \"I'm not jumping up and down in joy, but I'm at peace. \"I don't feel sorry, I feel happy because now she's at peace and so am I… she's not dependent on me for her life now. I'm not trapped by diabetes as well.\" Read more from Sky NewsMany feared dead in Indian stampedeBritish man dies in sea off TenerifeMajor recall of Coca Cola over health risks Both he and Stevens were initially charged with murder - but Queensland Supreme Court judge Martin Burns found them guilty of manslaughter instead. He said the prosecution had failed to prove the pair had shown reckless indifference to life. \"There remained a reasonable possibility that, in the cloistered atmosphere of the church which enveloped Struhs... that he [the father] never came to the full realisation Elizabeth would probably die,\" the judge said. But he found both Elizabeth's parents had shown an \"egregious departure from the standard of care\", with the support and encouragement of the other defendants, he said. Elizabeth's older sister Jayde Struths told reporters outside court on Tuesday: \"Although we had a good outcome today, I have to acknowledge the system failed to protect Elizabeth in the first place. \"We are only here today because more wasn't done sooner to protect her or remove her from a credibly unsafe situation in her own home.\" All 14 have been remanded in custody ahead of sentencing on 11 February. They face life in prison - with the judge urging them to employ lawyers before the sentencing."
    },
    {
        "title": "Poll shows 85% of Greenlanders oppose joining US as Denmark shores up European support",
        "description": "Around 85% of Greenlanders do not want to become part of the US, a new poll has found, as Denmark's prime minister shored up support for its current status.",
        "url": "https://news.sky.com/story/poll-shows-85-of-greenlanders-oppose-joining-us-as-denmark-shores-up-european-support-13298736",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-greenland_6813276.jpg?20250129065918",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-29 06:46:00",
        "Headline": "The US military has a permanent presence in Greenland which is a strategic location for its ballistic missile early-warning system.",
        "Content": "Around 85% of Greenlanders do not want to become part of the US, a new poll has found, as Denmark's prime minister shored up support for its current status. It comes after Donald Trump said the Arctic island was vital to US security and Denmark should give up control of its semi-autonomous territory. According to Danish daily newspaper Berlingske, which commissioned the survey by pollster Verian, only 6% of Greenlanders are in favour of becoming part of the US, with 9% undecided. On Tuesday, Denmark's prime minister Mette Frederiksen said political leaders in Europe and beyond have given full backing for its control of the island. \"The clear message from friends in the Nordic countries and Europe, and also outside Europe, is that there must of course be respect for territories and the sovereignty of states,\" she said. \"This is crucial for the international community we have built together since the Second World War.\"  Meanwhile, Denmark has announced it will spend £1.6bn on boosting its military presence in the Arctic. Greenland - with a land mass larger than Mexico and a population of 57,000 - was granted broad self-governing autonomy in 2009, including the right to declare independence from Denmark through a referendum. Read more:Analysis: Trump's threats could test NATOEchoes of 1812 war with Canada threats Greenland Prime Minister Mute Egede, who has stepped up a push for independence, has repeatedly said the island is not for sale and that it is up to its people to decide their future. The US military has a permanent presence at the Pituffik Space Base in the northwest of the island - a strategic location for its ballistic missile early-warning system."
    },
    {
        "title": "Elon Musk's praise for European right-wing branded 'disgusting' by German chancellor",
        "description": "German Chancellor Olaf Scholz has called Elon Musk's backing of right-wing parties in the European Union&#160;\"really disgusting\".&#160;",
        "url": "https://news.sky.com/story/elon-musks-praise-for-european-right-wing-branded-disgusting-by-german-chancellor-13298802",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-olaf-scholz-elon-musk_6813451.jpg?20250129112316",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-29 10:04:00",
        "Headline": "Elon Musk has openly backed the far-right Alternative for Germany (AfD) party, calling it Germany's only saviour. At a recent AfD campaign event, he urged supporters to move beyond their \"past guilt\" - an apparent reference to the country's Nazi past.",
        "Content": "German Chancellor Olaf Scholz has called Elon Musk's backing of right-wing parties in the European Union \"really disgusting\".  The tech mogul, who is a close ally of US President Donald Trump, has openly backed the far-right Alternative for Germany (AfD) party, which is labelled as right-wing extremist by the country's security services. He has also called for Mr Scholz to resign, saying that AfD is the country's only saviour. When asked if he would raise issues about Mr Musk to the president, Mr Scholz said: \"What is new is that he is intervening in favour of right-wing politicians all over Europe. \"And this is really disgusting, and it is not good for the democratic development in all the European Union.\" Last week Mr Musk made a surprise appearance at an AfD campaign event in the central city of Halle, during which he urged supporters to move beyond their \"past guilt\" - an apparent reference to Germany's Nazi past. Speaking via video link, the world's richest man said: \"Children should not be guilty of the sins of their parents, let alone their great-grandparents. \"There is too much focus on past guilt, and we need to move beyond that. \"It's good to be proud of German culture, German values, and not to lose that in some sort of multiculturalism that dilutes everything.\" Hitting back at the comments, Mr Scholz said he is \"absolutely critical\" of what Mr Musk said about the history of Germany, adding that his country has \"historic responsibility\". \"Germany is thankful to the US for freeing it from Nazis and helping it to become a democracy again,\" the German leader said, adding: \"This is why I am so angry about Elon Musk intervening for the far-right.\" Mr Musk also came under fire over a hand gesture he made at Mr Trump's inauguration, which some likened to a Nazi salute. People took to social media platform X - which Mr Musk owns - to hit out at the tech mogul for placing his right hand on his chest and then putting his whole arm up in the air in front of him. Read more:Analysis: No doubts about Musk's attitude to Germany's far rightElon Musk's starring role in Donald Trump's government confirmed  Mr Musk later responded, writing on X: \"Frankly, they need better dirty tricks. The 'everyone is Hitler' attack is sooo tired.\" Germany is gearing up for next month's snap election, after the collapse of the current three-party ruling coalition - consisting of the Mr Scholz's Social Democratic Party (SPD), The Greens and the fiscally conservative Free Democratic Party (FDP). The anti-immigration, anti-Islam AfD is currently polling second, according to nationwide surveys."
    },
    {
        "title": "Italian PM Giorgia Meloni investigated for repatriating Libyan warlord wanted on international arrest warrant",
        "description": "An investigation has been launched into Italian Prime Minister Giorgia Meloni after she repatriated a Libyan warlord wanted on an international arrest warrant, she said on Tuesday.",
        "url": "https://news.sky.com/story/italian-pm-giorgia-meloni-investigated-for-repatriating-libyan-warlord-wanted-on-international-arrest-warrant-13298740",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-giorgia-meloni-italy_6813284.jpg?20250129072317",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-29 07:13:00",
        "Headline": "Ossama Anjem, also known as Ossama al Masri, is accused of war crimes and crimes against humanity. He was arrested in Italy, but released and put on a repatriation flight days later. ",
        "Content": "An investigation has been launched into Italian Prime Minister Giorgia Meloni after she repatriated a Libyan warlord wanted on an international arrest warrant, she said on Tuesday. Ossama Anjem, also known as Ossama al Masri, was arrested in Turin on 19 January but was freed and put on a repatriation flight days later. The International Criminal Court (ICC) issued a warrant for his arrest over allegations of war crimes and crimes against humanity committed in Libya's Mitiga prison from 2015 onwards. ICC prosecutors have accused him of murder, torture, rape, and sexual violence. Ms Meloni has come under fire for releasing al Masri on what's been termed a technicality, In a video on social media, she claimed the arrest warrant had not been properly communicated with the Italian justice ministry, as is required by law. She claims the ICC issued the warrant after al Masri had been in three other European countries for around 12 days. Ms Meloni sanctioned his repatriation on a government plane on 21 January. \"At this point, this subject was free in Italian territory, and rather than letting him free, we decided to expel and repatriate him immediately for security reasons with a flight, as happens in other similar cases,\" she said in the video. She added that she \"cannot be blackmailed\" and \"will not be intimidated\". Her justice minister Carlo Nordio, interior minister Matte Piantedosi, and undersecretary Alfredo Mantovani are also part of the investigation. Read more from Sky NewsEx-French president on trial over Gaddafi chargesMany feared dead in Indian stampedePalestinians walk back to destroyed homes Ms Meloni claims the probe was sparked by a complaint from a member of the opposition. In Italy, prosecutors are obliged to investigate all complaints - and it is then up to the preliminary hearing judge whether a case is filed or not. Interior minister Mr Piantedosi will face questions on the matter in parliament on Wednesday. He told the senate last week al Masri was repatriated \"for urgent security reasons, with my expulsion order, in view of the danger posed by the subject\". Al Masri is the head of the Reform and Rehabilitation Institution in Tripoli - a network of notorious detention centres run by the government-backed Special Deterrence Forces (SDF). Like other militias in Libya, the SDF has been implicated in atrocities committed in the country since Muammar Gaddafi's death in 2011."
    },
    {
        "title": "Hamas to release three Israeli and five Thai hostages amid ceasefire",
        "description": "Hamas is set to release three Israeli hostages as well as five Thai nationals on Thursday, according to officials from the group and Israel.",
        "url": "https://news.sky.com/story/hamas-to-release-three-israeli-and-five-thai-hostages-amid-ceasefire-13299114",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-israeli-hostages-arbel-yehoud_6813968.jpg?20250129211712",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-29 20:39:00",
        "Headline": "The expected release is part of a fragile ceasefire between the militant group and Israel, which began earlier this month and brought a pause to 15 months of war.",
        "Content": "Hamas is set to release three Israeli hostages as well as five Thai nationals on Thursday, according to officials from the group and Israel. Hamas is set to release three Israeli hostages and five Thai nationals on Thursday, according to officials from the group and Israel. The two Israeli women being released are Arbel Yehoud, 29, and Agam Berger, 20, while the man is Gadi Moses, 80. The identities of the Thai nationals have not yet been revealed. Several foreign workers were taken captive along with over 100 Israeli civilians and soldiers when Hamas attacked Israel on 7 October 2023. The expected release is part of a fragile ceasefire between the militant group and Israel, which began earlier this month and brought a pause to 15 months of war.  Hamas is releasing hostages in phases in exchange for hundreds of Palestinian prisoners held by Israel. The release on Thursday had not originally been scheduled but came after Israel and Hamas disagreed over the identities of the hostages released over the weekend. Israel had demanded Ms Yehoud, a civilian, be released as part of the group and when she was not freed it held up the movement of hundreds of thousands of Palestinians looking to return to what remains of their homes in Gaza. Another release scheduled for Saturday will free male hostages, according to Israeli Prime Minister Benjamin Netanyahu's office. Dozens of Palestinian prisoners are scheduled to be released on Thursday and Saturday. Read more from Sky News:Farage now 'has a laugh' with King despite past disagreementsHarvey Weinstein begs judge for earlier retrialStudent accused of being 'persistent sexual predator and rapist' The ceasefire has revealed the sheer destruction of Gaza and prompted Donald Trump to suggest neighbouring Egypt and Jordan take in displaced Palestinians so \"we just clean out that thing\", describing the strip as \"literally a demolition site right now\". But the US president's suggestion was rejected by the two Arab nations and annoyed his Arab-American supporters in America. It remains unclear how Mr Trump might get Egypt or Jordan to agree, but he has threatened heavy tariffs against other American allies to get his way. More than 47,000 Palestinians have been killed in the war, most of them women and children, according to Gaza's Hamas-run health ministry, which does not distinguish between civilians and combatants in its count. Around 90% of Gaza's population of 2.3 million have been displaced during the fighting, many multiple times. When Hamas attacked Israel on 7 October 2023 it took 250 people hostage and killed around 1,200."
    },
    {
        "title": "Donald Trump says thousands of migrants will be housed in new Guantanamo Bay detention centre",
        "description": "Donald Trump has signed an executive order to open a migrant detention centre at Guantanamo Bay.",
        "url": "https://news.sky.com/story/donald-trump-says-thousands-of-migrants-will-be-housed-in-new-guantanamo-bay-detention-centre-13299062",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-white-house_6813999.jpg?20250129215913",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 18:57:00",
        "Headline": "The US President said up to 30,000 migrants who cannot be returned to their home countries will be held at the notorious naval base and military prison on the island of Cuba.",
        "Content": "Donald Trump has signed an executive order to open a migrant detention centre at Guantanamo Bay. Speaking before making the act official, Mr Trump said that thousands of migrants who cannot be deported to their home countries will be held at the complex, on the island of Cuba. \"I'm also signing an executive order to instruct the Departments of Defense and Homeland Security to begin preparing the 30,000-person migrant facility at Guantanamo Bay,\" he said. Follow latest: White House U-turns on funding pause \"Most people don't even know about it. We have 30,000 beds in Guantanamo to detain the worst criminal illegal aliens threatening the American people. \"Some of them are so bad we don't even trust the countries to hold them, because we don't want them coming back.\" It comes as Mr Trump's controversial pick for health secretary - Robert F. Kennedy Jr. - faced a hearing committee where he was grilled on his views, including on vaccines and abortion. Guantanamo Bay was set up in 2002 by then president George W. Bush to hold detainees in the wake of 9/11 and the War on Terror. Only 15 prisoners - including Ramzi bin al Shibh, accused of being a 9/11 co-conspirator - remain at the detention centre. US correspondent Guantanamo Bay is infamous.  A strip of land on the Cuban coast - leased in perpetuity from Cuba since 1903. It's the site of a notorious US military prison where detainees were taken and held after the September 11 attacks.\n\n It has become synonymous with the US \"war on terror\", with CIA rendition, with torture and with orange jumpsuits.\n\n Beyond the prison (which only has 15 inmates remaining) the site houses a US naval base and a small migrant holding centre - used at the moment to hold migrants who are intercepted at sea trying to reach America. President Trump's announcement that he has ordered the Department of Defence to prepare \"Gitmo\", as it's called, to house many more migrants is unexpected. 30,000 beds represents a colossal facility. It is not clear, yet, whether the migrants to be held here will be those intercepted or those rounded up in the US to be deported.\n The numbers of migrants currently crossing into the US are very low and the numbers being rounded up are high - this gives an indication of who could be housed there.\n\n In fulfilling its immigration mass deportation pledge, the White House is likely to be faced with significant logistical challenges with holding facilities. The optics of using Guantanamo to house deported migrants is stark - reflective of the hardline policy being pursued by Trump. At its peak, about 680 people, most suspected of terrorism and being \"illegal enemy combatants\", were held at the American-run prison in Cuba. The facility has been criticised by human rights groups and legal campaigners over potential breaches of international laws and conditions. Cuban President Miguel Díaz-Canel deemed the decision as \"an act of brutality\" in a message on his X account, and he described the base as one \"located in illegally occupied Cuba territory\". In response to Mr Trump's announcement, former White House communications director Anthony Scaramucci - who briefly served under the previous Trump administration - said: \"Also known as a concentration camp. \"Yet no dissent. No courageous political leader willing to stand up to this.\" Read more from Sky News:Chicago's streets empty over Trump's immigration crackdownTrump offers federal employees eight months' pay to quit RFK Jr faces Senate hearing Earlier on Wednesday, Mr Kennedy - the president's pick to be health secretary - faced a grilling over his views on vaccines, abortion and Medicaid at a Senate confirmation hearing. Appearing at the Capitol, Democratic senators raised some of the 71-year-old's previous remarks comparing the Centers for Disease Control and Prevention (CDC) to Nazi death camps, linking school shootings to antidepressants, and his claim that \"no vaccine is safe and effective\". One senator, Sheldon Whitehouse, told Mr Kennedy \"frankly, you frighten people\" when discussing an outbreak of measles in Rhode Island - its first since 2013. Read more:Who is the man set to become Trump's health chief? The nominee said he did \"not have a broad proposal for dismantling\" Medicaid - a state and federal taxpayer-funded healthcare programme - and dismissed claims he was anti-vaccine by saying his children were vaccinated. Mr Kennedy - the son of Robert F Kennedy and nephew of former US president John F Kennedy - was also questioned on his previous support for abortion and was shown statements as recent as from when he was running for president as an independent. He said he now agrees with the president that \"every abortion is a tragedy\". Federal funding pause memo rescinded It also comes after Mr Trump's budget office rescinded an order freezing spending on federal grants - less than two days after it sparked legal challenges across the US. The order on Monday sparked uncertainty over a financial lifeline for states, schools and organisations that rely on trillions of dollars from Washington. However, White House press secretary Karoline Leavitt told Sky's US partner network NBC that the freeze itself has not been withdrawn and that it was simply a cancellation of the memo ordering it."
    },
    {
        "title": "Microsoft hit as AI spending in sharp focus after DeepSeek market shock",
        "description": "Shares in Microsoft have fallen sharply after investment spending came in higher than expected in its latest results, released just days after the DeepSeek market shock for tech stocks.",
        "url": "https://news.sky.com/story/microsoft-hit-as-ai-spending-in-sharp-focus-after-deepseek-market-shock-13299044",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-microsoft-computing_6586997.jpg?20240621061508",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 18:44:00",
        "Headline": "Microsoft is not only investing heavily in AI but a big shareholder in research-led OpenAI, making the firm heavily exposed to shifts in investor sentiment.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shares in Microsoft have fallen sharply after investment spending came in higher than expected in its latest results, released just days after the DeepSeek market shock for tech stocks. The company, which has received reprimands from shareholders previously over AI-related bills, had already let it be known it expected to spend $80bn this year ahead of its earnings report on Wednesday night. That AI spending forecast came before Monday's rout for AI-linked stocks that saw the leading AI chipmaker Nvidia suffer the worst one-day loss in history, with almost $600m erased from its market value. Money latest: Ryanair boss launches blistering attack on chancellor While it has since clawed back some of those losses, it has left investors pondering whether the levels of investment planned by big US tech as a whole is completely necessary. It's all a consequence of the emergence of DeepSeek - the Chinese-owned and developed chatbot currently sitting atop Apple's app store free downloads. It toppled ChatGPT to get there. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 Read more: What is DeepSeek and why the fuss?AI race now a contest between superpowers DeepSeek's claims to have created the assistant on a shoestring budget - when compared to the vast US investment to date - forced US tech investors to not only question the huge sums involved but also the lofty market values of exposed firms. Ahead of Monday's market reaction that saw constituents of the Nasdaq bleed a combined total above €1trn, there had been an 18-month stampede for AI-linked shares. Microsoft was among those to benefit in that time and among those to face pressure on Monday. The company, a major shareholder in privately owned OpenAI, lost $7bn in market value. Read more from Sky News:Lloyds to cut 136 group branchesChancellor backs Heathrow third runwayPost Office unveils new wave of cuts Analysts said that Microsoft's latest share price pain was related to slower-than-expected growth in its crucial Azure cloud business between October and December despite an increasing contribution from AI. Capital expenditure came in $1.6bn higher than consensus forecasts. Just hours earlier, the company announced that it had added DeepSeek's model to its offerings on Azure. Shares were up to 4% lower in after-hours trading despite both group revenue and profits beating estimates."
    },
    {
        "title": "'I was wrong to call Trump a danger to the world,' says Lord Mandelson",
        "description": "Lord Mandelson says calling Donald Trump a \"danger to the world\" in 2019 was \"ill-judged and wrong\".",
        "url": "https://news.sky.com/story/i-was-wrong-to-call-trump-a-danger-to-the-world-says-lord-mandelson-13298956",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-peter-mandelson-eu_6780845.jpg?20241219202811",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 15:39:00",
        "Headline": "Lord Mandelson is set to become the next UK ambassador. However, the peer's previous comments about Donald Trump have led to rumours he might not be accepted in Washington DC.",
        "Content": "Lord Mandelson says calling Donald Trump a \"danger to the world\" in 2019 was \"ill-judged and wrong\". The former Labour minister has been named as the next UK ambassador to the US, although there have been questions about whether President Trump will accept him. Speaking to Fox News, Lord Mandelson walked back his criticisms from the president's first term in office. Politics latest: Government announces growth plans The 71-year-old told the conservative-backing US TV channel: \"I consider my remarks about President Trump as ill-judged and wrong. \"I think times and attitudes towards the president have changed since then. \"I think people have been impressed, not just by the extraordinary second mandate that he has received from the American people, but the dynamism and energy with which he approached not just the campaign but government as well.\"  Many Labour figures, including the now Foreign Secretary David Lammy, criticised Mr Trump before, during and after his first term in the White House. Now they are in government and Mr Trump is back in power in Washington DC, language has become more diplomatic. Read more:No one is safe in TrumplandTrump aide calls Mandelson a 'moron' Lord Mandelson told the Alain Elkann Interviews podcast previously: \"What Donald Trump represents and believes is an anathema to mainstream British opinion.\" He added: \"Even those who have a sneaking admiration for Donald Trump because of his personality, nonetheless regard him as reckless, and a danger to the world.\" The likely new ambassador criticised Mr Trump's attitude to a previous holder of that office, and said the president was \"little short of a white nationalist and a racist\". 👉 Follow Trump 100 on your podcast app 👈 Speaking now, Lord Mandelson praised Mr Trump, saying he was a \"nice\" and \"fair-minded person\" who could become \"one of the most consequential American presidents I have known in my adult life\". He added: \"I think that with the approach he is taking to government, which frankly just seems to us in Britain so much more organised, it's so much more coherent, he seems to be so much more clear in what he wants to do, we take encouragement from that, that gives us greater confidence.\""
    },
    {
        "title": "Super Bowl performances by Rihanna, Jennifer Lopez and Janet Jackson criticised as 'vulgar' by Republicans calling for more 'family friendly' shows",
        "description": "This year's famous Super Bowl half-time show needs to be more \"family friendly\", a group of critics has said - following what they describe as \"vulgar\" past performances by Jennifer Lopez and Rihanna, and the infamous Janet Jackson \"wardrobe malfunction\".",
        "url": "https://news.sky.com/story/super-bowl-performances-by-rihanna-jennifer-lopez-and-janet-jackson-criticised-as-vulgar-by-republicans-calling-for-more-family-friendly-shows-13298821",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-jennifer-lopez-rihanna_6813485.jpg?20250129115030",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 10:52:00",
        "Headline": "Kendrick Lamar is due to headline this year's Super Bowl half-time show next month. But ahead of the event, a group of Republicans and campaigners in Louisiana have complained about previous performances by artists including Rihanna and Jennifer Lopez.",
        "Content": "This year's famous Super Bowl half-time show needs to be more \"family friendly\", a group of critics has said - following what they describe as \"vulgar\" past performances by Jennifer Lopez and Rihanna, and the infamous Janet Jackson \"wardrobe malfunction\". Republican politicians and campaigners in Louisiana have written a letter to organisers raising \"serious concerns\" ahead of this year's Super Bowl, which is due to take place at the Caesars Superdome in New Orleans in February. Grammy-winning rapper Kendrick Lamar will headline the half-time show. In a letter signed by 17 Republican senators and representatives for Louisiana, as well as 15 pro-family organisations, critics called out Lopez's performance alongside Shakira in Florida in 2020, saying the star \"wore little clothing and was groped by male and female dancers on stage\", and also \"made sexually suggestive gestures and performed on a stripper pole\".  Criticising Rihanna's performance at the 2023 half-time show in Arizona - when the star revealed she was pregnant with her second child - they said she was shown \"groping herself\" while singing lyrics \"that were so offensive that few Louisiana adults could read those lyrics before an audience without shame\". The letter continued: \"We realize that these past vulgar performances may have been acceptable to the residents of those states where those Super Bowls were held but, in Louisiana, these lewd acts are inappropriate for viewing by children, objectify women, and are simply NOT welcomed by the majority of Louisiana parents.\" Read more: What you need to know about the Super Bowl 'It would have violated obscenity law' Jackson's performance with Justin Timberlake in Texas in 2004, during which he exposed one of her breasts, was also highlighted. \"Had that 2004 performance taken place in Louisiana and been proven to be intentional, it would have violated Louisiana's obscenity law,\" the letter said. CBS, which aired that year's Super Bowl, was fined $550,000 by the Federal Communications Commission over the incident - but this was later overturned. In 2021, following the release of the Framing Britney Spears documentary, which included details of Timberlake's relationship with the star and their break-up, conversation around his Super Bowl performance with Jackson was also reignited. At the time of the incident, Jackson bore the brunt of the criticism, while Timberlake's solo career flourished. In 2021, Timberlake issued an apology, saying: \"I specifically want to apologise to Britney Spears and Janet Jackson both individually, because I care for and respect these women and I know I failed.\" The Republicans' letter did not mention Timberlake but said Jackson's \"exposed bare breast was excused by one of her fellow performers as a 'wardrobe malfunction'.\" Super Bowl half-time performances have become \"increasingly vile\", it continued, and therefore it could be \"reasonably anticipated that the half-time performance this year in New Orleans will be inappropriate for children to watch\". Sky News has contacted the celebrities for a response to the criticism. Senator Valarie Hodges, who signed the letter and shared details on X, said: \"My hope is that Louisiana can set an example for future hosting states of the Super Bowl in advocating for entertainment suitable for viewers of all ages without needing a content rating.\" It has also been shared by the Family Research Council. President Tony Perkins, a former Louisiana state representative who is also one of the signatories, said their complaint was \"not only about protecting children, important as that is, but also upholding community standards\". The letter is addressed to Phillip Sherman, chairman of the Greater New Orleans Sports Foundation, and Robert Vosbein Jr, chairman of the Louisiana Stadium and Exposition District, which oversees the superdrome venue. In a statement sent to Sky News, Jay Cicero, president and chief executive of the Greater New Orleans Sports Foundation, said: \"We respect and value the comments of our legislators, who play a critical role in our ability to secure large events providing an economic boost to our city and state. \"We have shared the letter with the NFL and we are all in agreement that this year's half-time show will be a family-friendly event befitting New Orleans' storied history hosting Super Bowls.\" Mr Vosbein told the Louisiana Illuminator news outlet it was \"unfortunate\" Ms Hodges had waited until less than a few weeks before the event to share her concerns. Sky News has contacted both organisations for comment."
    },
    {
        "title": "Streets empty in Chicago over fears of arrest under Donald Trump's immigration crackdown",
        "description": "Look at parts of Chicago, and they look a little different under Donald Trump.",
        "url": "https://news.sky.com/story/streets-empty-in-chicago-over-fears-of-arrest-under-donald-trumps-immigration-crackdown-13298708",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-immigration-chicago_6813265.png?20250129042751",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-01-29 00:34:00",
        "Headline": "People in Chicago with, and without, the correct paperwork fear being arrested as part of a fresh immigration crackdown and are remaining indoors.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Look at parts of Chicago, and they look a little different under Donald Trump. Take for example Little Village, a Hispanic neighbourhood on the city's south side, where the streets look empty. Locals told us far fewer people were venturing outdoors as a result of the ICE (Immigration and Customs Enforcement) raids, some of which have taken place here. The initial crackdown, we are told, is targeting migrant criminals but there is also the prospect of 'collateral arrest'. People with, and without, paperwork fear the risk and so are remaining indoors. A community has retreated into the shadows. One man, Steve, told us of the anxieties of his mother, who came from Mexico years ago and is without the appropriate documentation. He said: \"She crossed the border over here to get a better life for us when we were born, to get education and all. She's scared to go out there, that she might get picked up.\" \n                  Four people shot dead 'execution-style as they slept in their seats' on Chicago area train\n                 \n                  School worker jailed for stealing chicken wings worth $1.5m\n                 \n                  Woman dies after getting stuck in Chicago airport conveyer belt system\n                 We attended one community centre which offers support to migrants. They had placed a notice on the front door giving instructions on what to do if ICE comes calling. A gate at the entrance is drawn closed, where it wasn't before. The staff have changed their routine, following a raid round the corner. Their morning starts with a recce of the roads around the building to check for immigration officials. Inside, we met Oliber, a Venezuelan who is in the US legally, has a work permit and has been employed in construction. In the current circumstances, he is reluctant to go to his place of work for fear of arrest, even though his paperwork is in place. Read more from Sky News:Stampede at Hindu festivalXL bully ban costing millionsBishop denies misconduct \"I feel scared,\" he told us. \"I go out feeling frightened. I don't go out now like I used to. I used to go out every day until night-time, I'd work at any time, but now I can't go out anywhere.\" He added: \"There are rumours about migrants and I'm scared, that they might catch me, deport me. My family depends on me. I can't go out like I used to, I'm scared, I'm scared.\" It is a story of government policy with humans at its heart. Immigration enforcement officials publish figures that show an increase on Joe Biden's daily average for deportations in his final year. The choreography of the crackdown, certainly, is eye-catching. Much of America will applaud. Not so much, the communities centre-stage."
    },
    {
        "title": "Trump offers federal employees eight months' pay to quit",
        "description": "Donald Trump is aggressively pushing forward with plans to shrink the US government by offering eight months' pay to federal employees who quit their jobs.",
        "url": "https://news.sky.com/story/trump-offers-federal-employees-eight-months-pay-to-quit-13298714",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-trump-musk_6807413.jpg?20250122123113",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 04:19:00",
        "Headline": "Up to 10% of employees are expected to accept the offer as part of a wide-ranging attempt by Donald Trump and Elon Musk to slash government costs.",
        "Content": "Donald Trump is aggressively pushing forward with plans to shrink the US government by offering eight months' pay to federal employees who quit their jobs. They have until 6 February to decide whether to accept the deal, according to a memo from the Office of Personnel Management. The US government's human resources agency also warned of future downsizing, reduced remote working and said in future it would enforce \"enhanced standards of suitability and conduct\". There are more than three million federal government employees and the impact of significant job cuts would be unclear. The government-wide \"deferred resignation\" scheme excludes immigration and national security-related positions, along with US Postal Service staff. Up to 10% of employees are expected to accept the offer, according to Sky's US partner NBC News. Union: Attempt to entice or scare A union representing federal employees described the plan as a \"purge\" targeting workers not considered loyal to the new administration. \"It is clear that the Trump administration's goal is to turn the federal government into a toxic environment where workers cannot stay even if they want to,\" said Everett Kelley, president of the American Federation of Government Employees. The National Treasury Employees Union, which represents about 150,000 federal workers, warned its members \"the email is designed to entice or scare you into resigning\", adding: \"We strongly urge you not to resign in response.\" The memo, sent by email to millions of federal employees, said: \"If you resign under this program, you will retain all pay and benefits regardless of your daily workload and will be exempted from all applicable in-person work requirements until September 30.\" Elon Musk: Fork in the road The email subject line \"Fork in the road\" was referenced in a post on X by billionaire Elon Musk, who is overseeing a government cost-cutting effort. Mr Musk sent an email in 2022 to Twitter employees matching the same subject line. The emailed message includes a \"deferred resignation letter\" for federal employees to begin leaving their posts and invites them to accept by sending a reply with \"Resign\" in the message body. Mr Musk posted a message on X, urging federal workers to \"hit send\". Read more from Sky News:Immigration crackdown in ChicagoStampede at Hindu festival in IndiaMuslim charities still being debanked Legal challenge to US funding freeze Meanwhile, Mr Trump's government-wide funding freeze, affecting grants and loans, has created widespread confusion and a legal challenge. The planned freeze is part of a sweeping effort to eliminate certain government spending. The Office of Management and Budget sent a two-page memo to all federal agencies on Monday, directing them to \"temporarily pause\" spending that could conflict with the president's agenda. On Tuesday, non-profit organisations said they were unable to get into a system used to access federal funds to pay for expenses, like salaries and rent. 👉 Follow Trump 100 on your podcast app 👈 A lawsuit filed by non-profit groups has already led to a legal challenge which put Mr Trump's plan on hold. US District Judge Loren L AliKhan blocked the funding freeze only minutes before it was scheduled to take effect on Tuesday evening. Another court hearing is scheduled on Monday to consider the issue."
    },
    {
        "title": "Harvey Weinstein begs judge for earlier retrial: 'I want this to be over with'",
        "description": "Harvey Weinstein has begged a New York judge to hear the retrial in his landmark #MeToo case as soon as possible due to his deteriorating health, telling him: \"I don't know how much longer I can hold on.\"",
        "url": "https://news.sky.com/story/harvey-weinstein-begs-judge-for-earlier-retrial-i-want-this-to-be-over-with-13298912",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-harvey-weinstein-court_6813757.jpg?20250129164952",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 14:00:00",
        "Headline": "During a court hearing in Manhattan, New York, ahead of his retrial, disgraced movie mogul Harvey Weinstein said he was facing a \"serious emergency situation\" in prison and wants to \"get out of this hellhole as quickly as possible\".",
        "Content": "Harvey Weinstein has begged a New York judge to hear the retrial in his landmark #MeToo case as soon as possible due to his deteriorating health, telling him: \"I don't know how much longer I can hold on.\" Weinstein has chronic myeloid leukaemia, diabetes and heart problems, and told the judge he was struggling amid harsh conditions at New York City's Rikers Island jail complex. \"Every day I'm at Rikers Island, it's a mystery to me how I'm still walking,\" he told the court in Manhattan. \"I'm holding on because I want justice for myself and I want this to be over with.\" The 72-year-old is facing a retrial after his 2020 rape and sexual assault conviction involving two women was overturned by New York's highest court in April last year. He has always maintained any sexual activity he was involved in was consensual. At the hearing on Wednesday, Judge Curtis Farber said the retrial would start on 15 April. However, Weinstein asked him to swap with another, unrelated case the judge has scheduled in March. The disgraced movie mogul had arrived at the court in a wheelchair more than half an hour after the hearing's scheduled start time. In court, he complained that jail officers had given him the wrong medication and failed to pick him up on time. \"I'm asking and begging you, your honour,\" Weinstein said. He told the judge he was facing a \"serious emergency situation\" and wanted to \"get out of this hellhole as quickly as possible\". He told the court that at times he finds himself gasping for air and predicted he would soon need to be treated in hospital again. In December, he was rushed to hospital following an \"alarming blood test result\". In court last week, Weinstein's lawyer Arthur Aidala also appealed for the retrial to happen earlier in \"the interest of humanity\", saying his client was \"dying of cancer and is an innocent man right now in the state of New York\". Judge Farber said he would look into starting the trial a few days earlier than planned if time allows, but the decision had been made following consultation with Weinstein's lawyers as well as prosecutors. The judge also issued a key ruling on the retrial - upholding a separate charge based on an allegation from a woman who was not part of the original case. Weinstein's lawyers had tried to get the charge thrown out, arguing that prosecutors only brought it to bolster their case with a third accuser, but were unsuccessful. Despite the New York conviction being overturned, he remains in custody due to another conviction in 2022, for the rape of an actress in Los Angeles in 2013. His lawyers have appealed that case. Weinstein was one of the most powerful people in Hollywood - the co-founder of film and television production companies Miramax and The Weinstein Company, he produced films such as the Oscar-winning Shakespeare In Love, Pulp Fiction, and The Crying Game. However, charges were brought after several women went public with allegations about him in 2017, fuelling the rise of the #MeToo movement. In September last year, prosecutors in the UK dropped two charges of indecent assault brought against Weinstein in 2022, saying there was \"no longer a realistic prospect of conviction\"."
    },
    {
        "title": "Poll shows 85% of Greenlanders oppose joining US as Denmark shores up European support",
        "description": "Around 85% of Greenlanders do not want to become part of the US, a new poll has found, as Denmark's prime minister shored up support for its current status.",
        "url": "https://news.sky.com/story/poll-shows-85-of-greenlanders-oppose-joining-us-as-denmark-shores-up-european-support-13298736",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-greenland_6813276.jpg?20250129065918",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 06:46:00",
        "Headline": "The US military has a permanent presence in Greenland which is a strategic location for its ballistic missile early-warning system.",
        "Content": "Around 85% of Greenlanders do not want to become part of the US, a new poll has found, as Denmark's prime minister shored up support for its current status. It comes after Donald Trump said the Arctic island was vital to US security and Denmark should give up control of its semi-autonomous territory. According to Danish daily newspaper Berlingske, which commissioned the survey by pollster Verian, only 6% of Greenlanders are in favour of becoming part of the US, with 9% undecided. On Tuesday, Denmark's prime minister Mette Frederiksen said political leaders in Europe and beyond have given full backing for its control of the island. \"The clear message from friends in the Nordic countries and Europe, and also outside Europe, is that there must of course be respect for territories and the sovereignty of states,\" she said. \"This is crucial for the international community we have built together since the Second World War.\"  Meanwhile, Denmark has announced it will spend £1.6bn on boosting its military presence in the Arctic. Greenland - with a land mass larger than Mexico and a population of 57,000 - was granted broad self-governing autonomy in 2009, including the right to declare independence from Denmark through a referendum. Read more:Analysis: Trump's threats could test NATOEchoes of 1812 war with Canada threats Greenland Prime Minister Mute Egede, who has stepped up a push for independence, has repeatedly said the island is not for sale and that it is up to its people to decide their future. The US military has a permanent presence at the Pituffik Space Base in the northwest of the island - a strategic location for its ballistic missile early-warning system."
    },
    {
        "title": "Father watching school athletics killed by hammer weight in Colorado",
        "description": "A father watching a high school athletics competition in Colorado has died after a being hit by a weight in a hammer throw event.",
        "url": "https://news.sky.com/story/father-watching-school-athletics-killed-by-hammer-weight-in-colorado-13298795",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wade-langston_6813390.jpg?20250129100020",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-29 09:53:00",
        "Headline": "Wade Langston, 57, was watching the track and field meet when a hammer weight cleared barriers and struck him on Sunday morning, officials said.",
        "Content": "A father watching a high school athletics competition in Colorado has died after a being hit by a weight in a hammer throw event. Wade Langston, 57, was watching the track and field competition when a hammer weight cleared barriers and struck him on Sunday morning, the El Paso County coroner's office said, adding he died at the scene. Witnesses at the University of Colorado Colorado Springs (UCCS) campus event reported Mr Langston was trying to shield his wife and son from the incoming weight. The hammer is a ball on a chain which competitors throw after spinning in a circle to gain momentum. They weigh 7kg for men and 4kg for women in adult competitions, according to World Athletics, the international track and field governing body. A number of GoFundMe pages have been made to raise money in memory of Mr Langston, whose family described him as a dedicated father and husband with a great sense of humour. One set up by his niece-in-law Tamara Rocha has raised more than $7,500 to help Mr Langston's son, a high school senior, with his university tuition, while another started by Colorado United Track Club coach Erik Huffman had raised over $10,500 for his family. Read more:Streets empty in Chicago over Trump's immigration crackdownMatthew Perry Foundation launches addiction medicine fellowship \"Wade was a devoted husband, loving father, cherished brother and brother-in-law, fun uncle, and an even more fun great-uncle,\" Ms Rocha wrote on the fundraising page. \"He was a truly wonderful person who brought laughter to every room he entered with his great sense of humour.\" \"We are heartbroken at this horrible accident and are focused on supporting all involved,\" the university's chancellor Jennifer Sobanet said in a statement. The university declined to comment on Tuesday when asked by the Associated Press whether potential factors in the accident, including who set up the barriers and how, were being investigated. Sky News has contacted the university for comment."
    },
    {
        "title": "Water bills in England and Wales to rise by average of £10 per month",
        "description": "The average annual water bill will rise by &#163;26% or &#163;123 in the next financial year alone, according to industry figures covering England and Wales.",
        "url": "https://news.sky.com/story/water-bills-in-england-and-wales-to-rise-by-average-of-16310-per-month-13298957",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-water-bill_6806360.jpg?20250121133134",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 15:36:00",
        "Headline": "Households now have a much better idea of their bill increases from April, which will rise at a time when many other bills are also tipped to go up sharply.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The average annual water bill will rise by £26% or £123 in the next financial year alone, according to industry figures covering England and Wales. Water UK confirmed how inflation-busting hikes, determined by the regulator Ofwat in December, would play out from 1 April when a new five-year pricing period begins. The watchdog allowed bills to rise sharply from 2025-30, but not by as much as suppliers had wanted, to help fund badly needed infrastructure upgrades in key areas, such as storm overflows to prevent sewage spills. Water UK, which represents the water firms, said the average water and wastewater bill would go up from £480 to £603 during 2025/26 - an increase of about £10 a month. But the increases will be even harder to swallow for many. Southern Water customers will see the largest in percentage terms, a 47% increase, taking their average bill to £703. Bills for households covered by Hafren Dyfrdwy and South West Water will rise by 32%. Thames Water's 16 million customers face a 31% hike to £639 - a rise of £151 - at a time when the company is still scrambling to secure its financial future amid a massive debt pile that could yet tip it towards a special administration process. Water UK explained that the rises may be higher than customers were expecting as the annual totals now included inflation calculations. The body also said that the increases across households would also vary, depending on circumstances such as water use and whether a water meter was installed.  They will come into force at a time when consumers are facing a surge in other costs. Industry estimates suggest another hefty increase in energy bills will be seen from April, when the energy price cap is adjusted to reflect higher wholesale prices. Council tax is also among the bills set for above-inflation rises. Poorer households get support Water UK said that it recognised the impact that rising water bills would have on poorer households, pledging that more than three million would receive support worth £4.1bn over the five-year pricing period. It urged those concerned about paying the increase to contact their supplier. Water UK also sought to reassure customers that they would see a return, following widespread anger over historic dividends for shareholders. Water UK said firms would invest around £20bn each year to 2030.  Read more from Sky News:Chancellor announces backing for third Heathrow runwayLove Island star freed on bail after being jailed for dog attack Upgrade works will include nine new reservoirs and increased capacity at 1,700 wastewater treatment works to reduce pollution and clear up rivers. Water UK admits rises 'will be difficult' Water UK chief executive David Henderson said: \"We understand increasing bills is never welcome and, while we urgently need investment in our water and sewage infrastructure, we know that for many this increase will be difficult. \"Water companies will invest a record £20bn in 2025-26 to support economic growth, build more homes, secure our water supplies and end sewage entering our rivers and seas.\" The industry has argued that constraints on bills over 15 years, coupled with climate change and population growth, have been responsible for the growing pollution crisis. Regulator says bill rises are 'challenge' Ofwat has denied this, saying companies must take responsibility. Its chief executive David Black said of the bill rises ahead: \"We recognise the challenge that some customers are facing with increasing financial pressures and understand that the water sector is not the only area where customers are faced with rising costs. \"While water bills will vary depending on the circumstances of each household, the average increase forecasted for 2025/26 will be 26% or £123. \"We have pushed companies to double the amount of support over the next five-year period and strongly encourage customers who are struggling to pay their water bills to contact their water company to access this.\""
    },
    {
        "title": "More than 130 Lloyds, Halifax and Bank of Scotland branches to close",
        "description": "Lloyds Banking Group is to close a further 136 branches.",
        "url": "https://news.sky.com/story/lloyds-to-close-136-more-branches-across-its-bank-brands-13298871",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-lloyds-bank_6531355.jpg?20240424072847",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 12:34:00",
        "Headline": "The country is estimated to have lost well in excess of 6,000 branches since 2015, with alternatives struggling to help fill the void for people especially outside major towns or cities.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Lloyds Banking Group is to close a further 136 branches. Britain's biggest mortgage lender said it will shut 61 Lloyds, 61 Halifax, and 14 Bank of Scotland sites between May this year and March 2026. All workers affected by the closures would be offered alternative roles, the group said. Money latest: People who only watch Netflix or Disney 'may have to pay BBC licence fee' A list of the affected branches, with their expected closure date: Lloyds • Lloyds Biggleswade - 05/11/2025• Lloyds Bishop Auckland - 08/05/2025• Lloyds Blandford - 10/11/2025• Lloyds Bolton Farnworth - 28/05/2025• Lloyds Bridgnorth - 20/05/2025• Lloyds Brigg - 05/03/2026• Lloyds Bristol Bishopsworth - 06/11/2025• Lloyds Bristol Clifton - 21/05/2025• Lloyds Bristol Patchway - 28/05/2025• Lloyds Bromsgrove - 07/05/2025• Lloyds Bury - 21/10/2025• Lloyds Cardiff Whitchurch - 29/05/2025• Lloyds Caterham - 05/03/2026• Lloyds Chard - 11/11/2025• Lloyds Coventry Foleshill - 04/11/2025• Lloyds Dorchester - 19/06/2025• Lloyds Dunstable - 04/11/2025• Lloyds East Grinstead - 12/11/2025• Lloyds Falmouth - 13/11/2025• Lloyds Feltham - 04/11/2025• Lloyds Ferndown - 17/11/2025• Lloyds Fulham - 27/05/2025• Lloyds Glossop - 09/03/2026• Lloyds Godalming - 29/05/2025• Lloyds Herne Bay - 21/05/2025• Lloyds Hexham - 05/11/2025• Lloyds Hornchurch Station Lane - 11/09/2025• Lloyds Houghton le Spring - 10/03/2026• Lloyds Hucknall - 04/03/2026• Lloyds Kidderminster - 16/10/2025• Lloyds Launceston - 12/05/2025• Lloyds Leeds Crossgates - 20/08/2025• Lloyds Leominster - 18/11/2025• Lloyds Leyland - 08/05/2025• Lloyds Liverpool Breck Rd - 04/03/2026• Lloyds Loughton - 12/11/2025• Lloyds Louth - 07/05/2025• Lloyds Ludlow - 20/05/2025• Lloyds Manchester Moston - 11/03/2026• Lloyds Manchester Newton Heath - 05/11/2025• Lloyds Margate - 14/05/2025• Lloyds Pembroke Dock - 26/06/2025• Lloyds Peterlee Yoden Way - 03/03/2026• Lloyds Plymstock - 04/11/2025• Lloyds Pontardawe - 19/11/2025• Lloyds Pontyclun - 12/05/2025• Lloyds Prudhoe - 15/05/2025• Lloyds Rayleigh - 20/05/2025• Lloyds Seaton - 11/03/20265• Lloyds Sheffield Woodhouse - 11/11/2025• Lloyds Shipston-on-Stour - 11/11/2025• Lloyds Sleaford - 12/03/2026• Lloyds Southall - 15/10/2025• Lloyds Southsea - 02/06/2025• Lloyds Stoke-on-Trent - 30/10/2026• Lloyds Thornbury Avon - 26/02/2026• Lloyds Tooting - 08/10/2025• Lloyds Tunstall - 09/03/2026• Lloyds Walthamstow - 22/10/2025• Lloyds Welwyn Garden City - 11/06/2025• Lloyds Wymondham - 12/03/2026 Halifax• Halifax Balham - 22/05/2025• Halifax Bangor (N Ireland) - 29/05/2025• Halifax Barrow in Furness - 10/09/2025• Halifax Bexleyheath - 23/10/2025• Halifax Birmingham Bearwood - 02/03/2026• Halifax Blackpool Lytham Road - 29/10/2025• Halifax Bolton - 20/11/2025• Halifax Brentwood - 10/09/2025• Halifax Bromsgrove - 29/05/2025• Halifax Cannon Street - 28/05/2025• Halifax Carmarthen - 06/10/2025• Halifax Castleford - 08/09/2025• Halifax Cirencester - 25/09/2025• Halifax Clapham Junction - 23/09/2025• Halifax Crewe - 14/10/2025• Halifax Derby East St - 23/10/2025• Halifax Eltham - 29/10/2025• Halifax Epsom - 15/09/2025• Halifax Erdington - 24/09/2025• Halifax Felixstowe - 02/06/2025• Halifax Fleetwood - 25/06/2025• Halifax Folkestone - 09/10/2025• Halifax Fulham - 08/05/2025• Halifax Gainsborough - 02/06/2025• Halifax Hayes - 06/10/2025• Halifax Hexham - 05/11/2025• Halifax Horsforth - 24/02/2025• Halifax Hove - 20/10/2025• Halifax Huntingdon - 15/05/2025• Halifax Kingsbury - 02/06/2025• Halifax Kingswood - 08/10/2025• Halifax Launceston - 03/06/2025• Halifax Leek - 04/06/2025• Halifax Letchworth - 03/06/2025• Halifax London Strand - 08/05/2025• Halifax Long Eaton - 18/09/2025• Halifax Mold - 16/10/2025• Halifax Nelson - 04/03/2026• Halifax Northwich - 03/09/2025• Halifax Omagh - 19/05/2025• Halifax Peterlee - 03/03/2026• Halifax Pontypridd - 15/07/2025• Halifax Rayleigh - 20/05/2025• Halifax Rhyl - 23/09/2025• Halifax Richmond (Surrey) - 16/09/2025• Halifax Sittingbourne - 15/10/2025• Halifax Skegness - 03/09/2025• Halifax Sleaford - 06/11/2025• Halifax Southport - 07/10/2025• Halifax St Annes - 12/06/2025• Halifax St Austell - 13/05/2025• Halifax Stevenage Queensway - 23/10/2026• Halifax Telford - 22/10/2025• Halifax Walkden - 25/09/2025• Halifax Wallasey - 04/09/2025• Halifax Waltham Cross - 27/05/2025• Halifax Welwyn Garden City - 11/06/2025• Halifax Wickford - 10/11/2025• Halifax Wilmslow - 19/05/2025• Halifax Winton - 04/06/2025• Halifax Woolwich - 01/10/2025 Bank of Scotland• Bank of Scotland Alexandria - 02/03/2026• Bank of Scotland Annan - 02/03/2026• Bank of Scotland Barrhead - 21/05/2025• Bank of Scotland Bishopbriggs - 04/03/2026• Bank of Scotland Edinburgh Corstorphine West - 29/10/2025• Bank of Scotland Edinburgh Wester Hailes - 27/05/2025• Bank of Scotland Helensburgh - 05/03/2026• Bank of Scotland Kirkintilloch - 22/05/2025• Bank of Scotland Moffat - 04/06/2025• Bank of Scotland Peebles - 27/05/2025• Bank of Scotland Pitlochry - 30/10/2025• Bank of Scotland Sanquhar - 28/05/2025• Bank of Scotland Thornhill - 03/11/2025• Bank of Scotland Uddingston - 22/05/2025 Lloyds blamed the move on customers shifting away from banking in person to using online services, meaning there is less need for physical sites. It made the announcement just weeks after taking the decision to allow its customers to access on-site services across any of the group's branded branches. Lloyds also revealed the planned closure of two major offices - in Liverpool and Dunfermline - affecting more than 1,000 staff.  A spokesperson said: \"Over 20 million customers are using our apps for on-demand access to their money and customers have more choice and flexibility than ever for their day-to-day banking. \"Alongside our apps, customers can also use telephone banking, visit a community banker or use any Halifax, Lloyds or Bank of Scotland branch, giving access to many more branches. \"Customers can also do their everyday banking at over 11,000 branches of the Post Office or in a Banking Hub.\" The UK's big banking brands have been shutting branches at pace since the fallout from the financial crisis in 2008 which sparked a rush to cut costs. The uptake of digital banking services has seen more than 6,000 sites go to the wall since 2015, according to the consumer group Which? The closure plan revealed on Wednesday will bring the Lloyds brand down to 386 branches, Halifax down to 281 branches and Bank of Scotland to 90 branches once completed. Campaigners have long argued that the rate of closures has been too quick to allow alternatives, such as banking hubs, to fill the void. The elderly are least likely to bank online while rural communities have been particularly hard hit through the loss of banking services altogether. Banking hubs are physical sites where services are shared. As of September 2024, there were 76 across the UK though that number was set to more than double within months, according to Cash Access UK."
    },
    {
        "title": "Microsoft hit as AI spending in sharp focus after DeepSeek market shock",
        "description": "Shares in Microsoft have fallen sharply after investment spending came in higher than expected in its latest results, released just days after the DeepSeek market shock for tech stocks.",
        "url": "https://news.sky.com/story/microsoft-hit-as-ai-spending-in-sharp-focus-after-deepseek-market-shock-13299044",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-microsoft-computing_6586997.jpg?20240621061508",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-01-29 18:44:00",
        "Headline": "Microsoft is not only investing heavily in AI but a big shareholder in research-led OpenAI, making the firm heavily exposed to shifts in investor sentiment.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shares in Microsoft have fallen sharply after investment spending came in higher than expected in its latest results, released just days after the DeepSeek market shock for tech stocks. The company, which has received reprimands from shareholders previously over AI-related bills, had already let it be known it expected to spend $80bn this year ahead of its earnings report on Wednesday night. That AI spending forecast came before Monday's rout for AI-linked stocks that saw the leading AI chipmaker Nvidia suffer the worst one-day loss in history, with almost $600m erased from its market value. Money latest: Ryanair boss launches blistering attack on chancellor While it has since clawed back some of those losses, it has left investors pondering whether the levels of investment planned by big US tech as a whole is completely necessary. It's all a consequence of the emergence of DeepSeek - the Chinese-owned and developed chatbot currently sitting atop Apple's app store free downloads. It toppled ChatGPT to get there. \n                  How Chinese DeepSeek can be as good as US AI rivals at fraction of cost\n                 \n                  Donald Trump warns DeepSeek should be 'wakeup call' for America's AI industry\n                 \n                  AI now not just a contest between Californian tech bros with macho budgets, but between superpowers\n                 Read more: What is DeepSeek and why the fuss?AI race now a contest between superpowers DeepSeek's claims to have created the assistant on a shoestring budget - when compared to the vast US investment to date - forced US tech investors to not only question the huge sums involved but also the lofty market values of exposed firms. Ahead of Monday's market reaction that saw constituents of the Nasdaq bleed a combined total above €1trn, there had been an 18-month stampede for AI-linked shares. Microsoft was among those to benefit in that time and among those to face pressure on Monday. The company, a major shareholder in privately owned OpenAI, lost $7bn in market value. Read more from Sky News:Lloyds to cut 136 group branchesChancellor backs Heathrow third runwayPost Office unveils new wave of cuts Analysts said that Microsoft's latest share price pain was related to slower-than-expected growth in its crucial Azure cloud business between October and December despite an increasing contribution from AI. Capital expenditure came in $1.6bn higher than consensus forecasts. Just hours earlier, the company announced that it had added DeepSeek's model to its offerings on Azure. Shares were up to 4% lower in after-hours trading despite both group revenue and profits beating estimates."
    },
    {
        "title": "Ryanair puts customers on notice of more unruly passenger lawsuits",
        "description": "The chief executive of Europe's largest airline has put customers on notice it will prosecute disruptive passengers as between two and three flights a week are diverted due to poor behaviour on Ryanair flights.",
        "url": "https://news.sky.com/story/ryanair-airline-puts-customers-on-notice-of-more-unruly-passenger-prosecutions-13298989",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-ryanair-michael-oleary_6813922.jpg?20250129203120",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-01-29 16:34:00",
        "Headline": "Ryanair CEO Michael O'Leary said there's a \"slim\" chance of Heathrow getting a third runway, but the airline wouldn't use the airport, even if it were free.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  The chief executive of Europe's largest airline has put customers on notice it will prosecute disruptive passengers as between two and three flights a week are diverted due to poor behaviour on Ryanair flights. Ryanair boss Michael O'Leary told Sky News: \"If passengers continue disrupting our flights, we will sue you for the cost of those diversions and those disruptions.\" He later told Sky's Politics Hub with Sophy Ridge: \"Airports are still the only places where there are no licensing laws. You could be buying pints at 6am in the morning. Who needs to be drinking pints at 6am in the morning? \"We're trying to be a bit more sensible. Just behave. We don't allow you to drink and drive. All we're saying is drink a little less before you fly, and then let everybody have a better flight experience.\" Earlier this month the low-cost airline said it had launched legal action against a passenger who, Ryanair said, cost the carrier £12,500 as it was forced to land early and put passengers up in Porto for a night, rather than continue to the end destination. Money blog: Anti-tourist sentiment 'dangerous', Jet2 boss warns While such diversions are a minority of the 3,500 daily Ryanair flights, Mr O'Leary said: \"We're having two or three of these diversions a week. That's two or three too many.\" He reiterated his call for a two-alcoholic drink limit in airports but said he would be happy for a three-drink cap. \"We don't care what the number is, but there just needs to be a little bit more common sense about it,\" Mr O'Leary said. Ryanair was happy to restrict alcohol sales on its flights, he added. Criticism of Heathrow and Ms Reeves The call for a drinks limit has not been received well by airports, Mr O'Leary said: \"Airports have responded badly as they always do, they want to be filling people full of alcohol, particularly when flights are delayed.\" Criticism was levelled not just at Chancellor Rachel Reeves's newly announced support for a third runway at Heathrow, but at the airport itself. When asked if a third runway at the UK's busiest airport would induce Ryanair to fly to and from the site, Mr O'Leary said the airline had no interest and it would \"never go there\" as it was so \"incredibly operationally inefficient\". \"Even if it was free, we wouldn't go to Heathrow. Because if we have to take an hour, an hour and 15 to turn around a plane, we lose those two extra flights per day per aircraft in our operation.\" Mr O'Leary said the \"odds are against\" a third runway even being built. The problem was not capacity at airports, he added: \"There's lots of underused airports that we could start growing in today.\" The airline is Europe's biggest by route, passenger and aircraft numbers. Heathrow has been contacted for comment."
    },
    {
        "title": "Chancellor Rachel Reeves announces backing for third Heathrow runway",
        "description": "The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-announces-backing-for-third-heathrow-runway-13298590",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813432.jpg?20250129110052",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-29 10:50:00",
        "Headline": "The chancellor says the expansion of Europe's busiest airport is \"badly needed\" - but the Green Party's Sian Berry calls it \"the most irresponsible announcement from any government I have seen since the Liz Truss budget\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced. Ms Reeves said the expansion of Europe's busiest airport was \"badly needed\" to connect the UK to the world and open up new opportunities for growth. A third runway will \"unlock further growth, boost investment increase exports and make the UK more open and more connected\", she said. Politics latest: Reaction to third runway decision It could increase potential GDP (Gross Domestic Product) by 0.43% by 2050 according to a Frontier Economics study, she said. 60% of that boost would go to areas outside London and the southeast, increasing trade opportunities like Scotch whiskey and Scottish salmon, she added. Ms Reeves said an expansion could create more than 100,000 jobs. The announcement has been welcomed by some business groups but has been met with anger from London's Labour mayor Sadiq Khan, the Lib Dems, the Green Party and environmental groups. Conservative leader Kemi Badenoch told Sky News over the weekend she supports a third runway. Read more:Analysis - The big points in chancellor's speech that won't get the headlines As part of a speech on funding infrastructure across the UK to promote growth, Ms Reeves said: \"Persistent delays have caused doubts about our seriousness towards improving our economic prospects.\" She added that business groups like the Confederation of British Industry (CBI), the Federation of Small Businesses (FSB) and the Chambers of Commerce (BCC), as well as trade unions \"are clear - a third runway is badly needed\". 'Britain is a country of huge potential that is untapped' Speaking afterwards to Sky's economics and data editor Ed Conway, Ms Reeves said: \"I want Britain to be a magnet for foreign investment… we should be welcoming the best businesses and the best talent in the world. I want businesses around the world, investors around the world, to see in Britain, what I see, which is a country of huge potential that is untapped.\" The chancellor also spoke of helping British companies to scale up. She said: \"We are introducing the capital market reforms, particularly around pension reform, unlocking £80bn of long-term patient capital by creating these mega funds, the mergers of defined contribution and local government pension schemes, to create those larger funds that can invest at scale in the exciting opportunities in the UK. \"Building on what countries like Australia and Canada do with their big pension funds, to support British industry, and particularly that stage of a business career when they've had the start-up and the seed funding, but now they're looking to scale up, but they find that the access to finance isn't available in the UK, and often look, to example, for the United States.\"  Investments in green aviation fuel Ms Reeves said in her speech that the UK is \"already making great strides in transitioning to cleaner and greener aviation\" and announced the government is investing £63m over the next year into the Advanced Fuel Fund grant programme to support the development of sustainable aviation fuel production plants. The government will be accepting proposals until the summer and will then carry out a \"full assessment\" through the Airport National Policy Statement to \"ensure a third runway is delivered in line with our legal, environmental and climate objectives\".  Ms Reeves said the government expects any associated surface transport costs to the third runway's construction to be financed through private funding. She added a decision on plans to expand Gatwick and Luton, which are currently under way, will be made by the transport secretary \"shortly\". Read more:A long history of Heathrow's third runway plansGreen groups criticise Heathrow campaigner's role in Labour policy creation  A decades-old debate The debate around whether Europe's busiest airport should expand has been circling over British politics for decades. Ms Reeves's decision will likely put her at odds with Climate Secretary Ed Miliband, who has said airport expansions will not go ahead if they cannot meet climate targets. However, he said last week he would not resign if the government approved a third runway despite threatening to resign from Gordon Brown's cabinet as climate change secretary in 2009 over the plans and in 2018 he said an expansion was \"very likely\" to make air pollution worse. He has now said the government can meet both its growth and net zero missions together. London mayor opposes runway Sadiq Khan said he remained opposed to a third runway \"because of the severe impact it will have on noise, air pollution and meeting our climate change targets\". He said he will carefully scrutinise any new proposals, \"including the impact it will have on people living in the area and the huge knock-on effects for our transport infrastructure\". \"Despite the progress that's been made in the aviation sector to make it more sustainable, I'm simply not convinced that you can have hundreds of thousands of additional flights at Heathrow every year without a hugely damaging impact on our environment,\" he added. Green Party MP Sian Berry said expanding airports \"in the face of a climate emergency is the most irresponsible announcement from any government I have seen since the Liz Truss budget\". Conservative shadow chancellor Mel Stride accused Ms Reeves and Sir Keir Starmer and \"their job-destroying budget\" of being \"the biggest barriers to growth\". \"What's worse, the anti-growth chancellor could not rule out coming back with yet more tax rises in March,\" he added. \"This is a Labour government run by politicians who do not understand business, or where wealth comes from. Under new leadership, the Conservatives will continue to back businesses and hold this government to account.\""
    },
    {
        "title": "The big points in the chancellor's speech that won't get the headlines",
        "description": "Rarely has a speech been so heavily trailed in the media, with so many of the details - from the third runway at Heathrow to the revived Oxford-Cambridge corridor and the nine new reservoirs across the country - pre-briefed and leaked to the press in advance.",
        "url": "https://news.sky.com/story/the-big-points-in-the-chancellors-speech-that-wont-get-the-headlines-13299000",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813832.jpg?20250129181436",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-01-29 17:13:00",
        "Headline": "Sky's Ed Conway writes that there were many intriguing lines in Rachel Reeves' remarks, with the approach to some key challenges likely to go down badly in Labour circles.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Rarely has a speech been so heavily trailed in the media, with so many of the details - from the third runway at Heathrow to the revived Oxford-Cambridge corridor and the nine new reservoirs across the country - pre-briefed and leaked to the press in advance. So you might have thought there were no surprises left from the chancellor's big speech today. But here are a few intriguing lines worth pondering. The first was something Rachel Reeves said quite early on in the speech itself. Before she even made any of those big announcements, she said a key priority was \"building on our special relationship with the United States under President Trump.\" Money latest: Ryanair boss launches blistering attack on chancellor That the relationship with the US was given such prominence, mentioned before the EU, is not without significance. It's a coded message intended for the White House - that while it may be set on slapping tariffs on many of its allies, Britain is keen to do business. Doing a deal with Donald Trump might stick in the craw for some in the Labour Party, but if there was one overarching message from this speech it's that sometimes, if you want the economy to grow, you have to do stuff that might stick in the craw. Consider: one of the biggest problems with Britain's economy is that it's way too dependent on what happens in London and the South East. That's where most of the gross domestic product (GDP) is generated, it's the most productive region of the country, where house prices are highest, and transport links are, already, better than anywhere else. \n                  Growth is a fight Starmer and Reeves want to have - and they can't afford to lose\n                 \n                  Majority of public support cap on political donations, including half of Reform voters, poll finds\n                 \n                  Is Rachel Reeves ignoring the North?\n                 Many if not most of the plans unveiled by the chancellor today will only widen that divide: new runways in London will make the country yet more London-centric. A rail link between Oxford and Cambridge is unlikely to benefit the people of Manchester or Sheffield. But one of the easiest ways of generating extra growth is to further boost the areas which are already growing fastest. It means cosying up to financial services (at which Britain is already very good) more than manufacturing or steelmaking. Being growth-friendly means being friendly to your biggest market for services, the United States, even if you're not a big fan of the president. A second line that leapt out to me came a bit further down in the speech: \"There is no trade-off between economic growth and net zero. Quite the opposite. Net zero is the industrial opportunity of the 21st century, and Britain must lead the way.\" I have mixed feelings about this, having written an entire book which documents the fact that net zero is indeed the industrial opportunity of the 21st century. However, and this is really important, that does mean that in the short run it's also quite expensive. Replacing your fossil fuel power systems with wind and hydrogen backup is massively costly. It will mean power prices rise even further in the coming years. Hopefully, they will come down thereafter, but it's quite hard to escape the fact that in the short run power prices will stay high. And that matters enormously. Because high energy costs are the reason this country is currently deindustrialising. High power costs are one of the reasons this country is struggling to deploy as much computer server capacity (for which, read: AI) as, for instance, the United States. It's very hard to build anything if your energy is expensive - and the upshot is the UK is mostly importing green tech made in China instead. All of which is to say, growth is not always straightforward. It involves many trade-offs. More planes at Heathrow might mean more growth, but it also means more emissions. Let me give you another example. In my interview with the chancellor today, I asked her whether she thought the company we were at - Siemens Healthineers - was a British success story. Because to some people's minds, it is better cast as a corporate failure. After all, the key technology behind MRI scanners - the things they're making there in Oxford - was invented in Oxford. However, the company behind that invention, Oxford Instruments, never managed to turn it into a corporate success. Instead, it was American companies which turned it into a money-spinner. And Oxford Instruments' MRI business was eventually bought by a German giant, Siemens. Crucially, many of the jobs have stayed here - indeed, Siemens still makes its MRI magnets here and is actually expanding its plant. And the traditional economists' answer is that the nationality of a firm doesn't matter in the slightest. But, in an era characterised by trade war and nationalism, that might not always apply. And it turns out what happened to Oxford Instruments is hardly an isolated example. There are many important technologies Britain invented: CT Scanners, LCDs, fibre optics, radar, the lithium-ion battery (also invented, in part, in Oxford). But none of these inventions gave birth to a world-leading company. Instead, they were mostly snapped up by foreign companies, which proved far better at scaling them up. In most cases, there were far fewer jobs created than by Siemens with its MRI business. Why? No one really knows. But it's a real problem. British start-ups are very good at growing up to a certain size, and then they're very good at getting sold to American or European corporations, earning a hefty payout in the process. This pattern is actually probably quite good for growth - it helps boost gross domestic product. But is it the model Britain should be aiming for in future? Read more from Sky News:Lloyds to cut 136 group branchesLidl allowed to open first in-store pubPost Office unveils new wave of cuts That's a knotty question. And while the attention today was understandably on Heathrow, the politics of the speech and the other more eye-catching announcements, her response to my question - about why businesses struggle to scale up here - was quite instructive. \"You're absolutely right, that is a challenge,\" she said. \"It's why we are introducing the capital market reforms, particularly around pension reform, are unlocking £80bn of long-term patient capital by creating mega-funds, merging defined contribution and local government pension schemes to create larger funds that can invest at scale in the exciting opportunities in The UK.\" Whether these funds move the dial remains to be seen. In some cases, staying independent and resisting foreign takeovers could actually be growth-negative in the short run. But it's something Britain has not historically been very good at. It may be a skill we need to re-learn."
    },
    {
        "title": "Lidl wins legal battle to open first ever in-store pub in Northern Ireland",
        "description": "Lidl has been given approval by a High Court to open its first ever pub in Northern Ireland.",
        "url": "https://news.sky.com/story/lidl-wins-legal-battle-to-open-first-ever-in-store-pub-in-northern-ireland-13298859",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-lidl-pub-northern-ireland_6813581.jpg?20250129132607",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-01-29 12:20:00",
        "Headline": "Residents of Dundonald, near Belfast, will soon be able to pop to Lidl for a pint after a High Court in Northern Ireland approved plans for a pub at the supermarket. ",
        "Content": "Lidl has been given approval by a High Court to open its first ever pub in Northern Ireland. The German supermarket chain will be able to move forward with the plan to open a bar inside its store in Dundonald, near Belfast, after a judge dismissed an appeal brought by another trader. Making the ruling on Monday, Mr Justice Colton said he saw \"no good reason for refusing the application\". Money blog: Asda ditches Aldi and Lidl price match Lidl's plan involves opening a pub which would seat around 45 customers as well as an off-licence area, according to court records. The pub would allow customers to buy draft and bottled beer, wine, cider and spirits with the off-licence stocking products normally available on Lidl supermarket shelves. The supermarket initially secured planning permission for the pub in August 2020, but it was objected to by Philip Russell Ltd - which runs a number of convenience stores across Northern Ireland. Philip Russell Ltd argued that Lidl had failed to establish that there was an inadequate number of other licenced premises near the site. This is a requirement of licencing laws in Northern Ireland, which state that no new alcohol sale licences can be granted unless another one is surrendered. It also said Lidl's application for an off-licence was an \"impermissible attempt\" to get around the Licencing (Northern Ireland) Order 1996. Read more from Sky News:Chancellor announces backing for third Heathrow runwayLove Island winner jailed over dog attacksPrincess Beatrice gives birth But Mr Justice Colton determined that Lidl had established the \"inadequacy\" of local pub offerings. He said Lidl's pub would replace two pubs that were previously in the area, and it would spend at least £410,000 doing so. He added that the pub would be located near transport and shopping facilities and in an area that has a growing adult population. \"I am satisfied that this is a bona fide application and that the applicant fully intends to operate the premises as a public on/off-licence,\" Mr Justice Colton said."
    },
    {
        "title": "Saga sets sail with £450m HPS refinancing boost",
        "description": "Saga, the financial services and travel provider to the over-50s, is tapping one of the world's biggest investment firms as part of a refinancing aimed at relieving pressure on its balance sheet.",
        "url": "https://news.sky.com/story/saga-sets-sail-with-163450m-hps-refinancing-boost-13298940",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-saga-cruises_6497039.jpg?20240321165155",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-29 15:14:00",
        "Headline": "The over-50s cruises and finance specialist is likely to announce a debt deal to provide more breathing space alongside a trading update on Thursday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Saga, the financial services and travel provider to the over-50s, is tapping one of the world's biggest investment firms as part of a refinancing aimed at relieving pressure on its balance sheet. Sky News has learnt that London-listed Saga is lining up HPS - which is in the process of being taken over by the asset management behemoth BlackRock - to help refinance more than £450m of its existing debt. Financiers said an agreement was likely to be announced alongside a scheduled trading update from the company on Thursday morning. Money latest: People who only watch Netflix or Disney 'may have to pay BBC licence fee' The debt involved in the deal comprises a bond, a loan from chairman Sir Roger De Haan and Saga's revolving credit facility. A refinancing will be a boost to Saga, which has been weighed down by a debt pile which is huge relative to the value of its equity. It will come months after the company struck a partnership deal with the Belgian insurer Ageas, which involves a series of cash payments to the British business. \n                  Water bills in England and Wales to rise by average of £10 per month\n                 \n                  More than 130 Lloyds, Halifax and Bank of Scotland branches to close\n                 \n                  Money blog: Ryanair boss launches blistering attack on chancellor\n                 In February last year, it also held talks with Open, an Australian company, about a sale of the division but the discussions fell apart. Saga has previously signalled that it would explore a similar partnership model for its cruises division, although a transaction is not thought to be imminent. Shares in Saga have fallen by just over 20% during the last 12 months, leaving it with a market capitalisation of about £165m. Read more from Sky News:Lloyds to cut 136 group branchesChancellor backs Heathrow third runwayPost Office unveils new wave of cuts Sir Roger, the company's former chief executive, was parachuted back in to lead a turnaround in the summer of 2020, investing £100m as part of a broader capital-raising. That came after it spurned a takeover bid for the whole company from private equity investors. A Saga spokesperson declined to comment on Wednesday evening."
    },
    {
        "title": "Post Office unveils new wave of cuts to fuel transformation plan",
        "description": "The Post Office has unveiled plans for scores more job cuts as part of a transformation plan aimed at boosting payouts for thousands of sub-postmasters.",
        "url": "https://news.sky.com/story/post-office-unveils-new-wave-of-cuts-to-fuel-transformation-plan-13298830",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-post-office-paddington_6747201.jpg?20241113103215",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-29 11:10:00",
        "Headline": "The state-owned company informed about 100 senior employees on Wednesday about proposed changes to their roles as part of a wider overhaul, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Post Office has unveiled plans for scores more job cuts as part of a transformation plan aimed at boosting payouts for thousands of sub-postmasters. Sky News has learnt the state-owned company was in the process of informing about 100 senior managers on Wednesday that their roles would be affected by its proposals. Some of those individuals are expected to see their jobs disappear, although the precise number was unclear. Money blog: Netflix and Disney users could pay licence fee - even if they don't watch traditional TV The changes represent the latest phase of an overhaul outlined by chairman Nigel Railton last November, in which he said he wanted to add £250m annually to Post Office sub-postmaster remuneration. \"The Post Office has a 360-year history of public service and today we want to secure that service for the future by learning from past mistakes and moving forward for the benefit of all postmasters,\" Mr Railton said at the time. \"We can, and will, restore pride in working for a business with a legacy of service, rather than one of scandal.\" \n                  Business and Trade Committee calls for government to be fined as Post Office victims face 'second trial' in struggle for redress\n                 \n                  'At least 70' people in Post Office and Royal Mail knew of Horizon IT flaws, Fujitsu lawyer tells inquiry\n                 \n                  Victims of Post Office Capture accounting software scandal 'to be offered compensation' - minister\n                 The Post Office has been engulfed in crisis since the scale of the Horizon IT scandal became clear, with hundreds of sub-postmasters wrongly prosecuted for theft and fraud offences. Read more from Sky News:Chancellor announces backing for third Heathrow runwayMuslim charities still being debanked despite Farage furore Brought to a wider public audience by the ITV drama Mr Bates vs The Post Office, it has been labelled Britain's biggest miscarriage of justice. Many of those affected suffered ill health, marital breakdowns or died before they were exonerated. Former chief executive Paula Vennells, who insisted for years that the Horizon system was robust, was effectively stripped of her damehood in disgrace last year. The Department for Business and Trade (DBT) has asked BCG, the management consultancy, to examine options for mutualising the Post Office, with further details expected to become clear this year. A Post Office spokesman declined to comment on Wednesday morning."
    },
    {
        "title": "Growth is a fight Starmer and Reeves want to have - and they can't afford to lose",
        "description": "Deregulation, streamlining planning decisions, and clamping down on judicial reviews - you might have found much of what Rachel Reeves said on Wednesday a bit dry and abstract.",
        "url": "https://news.sky.com/story/growth-is-a-fight-starmer-and-reeves-want-to-have-and-they-cant-afford-to-lose-13298990",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-beth-rigby-starmer_6813765.png?20250129170240",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-01-29 16:42:00",
        "Headline": "Chancellor Rachel Reeves and Prime Minister Sir Keir Starmer need the growth they are promising if they want to have a chance of winning the next election.",
        "Content": "\n          Political editor\n              @BethRigby\n Deregulation, streamlining planning decisions, and clamping down on judicial reviews - you might have found much of what Rachel Reeves said on Wednesday a bit dry and abstract. But keep reading, because it is also a very big deal, and years down the track will probably be looked back on - for good or for ill - as a definitive moment for Sir Keir Starmer's Labour government. That's because, on Wednesday, the chancellor finally laid out in no uncertain terms the scale of her ambition to deliver economic growth and the scale of the fights this government is prepared to have to achieve it. Politics latest: Clashes over government growth plans The promises were bold. She was going to unlock planning and cut down on judicial reviews in order to build 1.5 million homes across the UK. Her government was going to crack on with the OxCam Arc to create \"Europe's Silicon Valley\" with a new rail line to connect Oxford and Cambridge, better roads, and up to 18 new towns along that corridor. And she was going to be the first chancellor to get planning approval for a third runway at Heathrow before the end of this parliament. It's quite the list: The third runway for Heathrow was first mooted in 2001 before being bogged down in years of political wrangling and legal challenges. The OxCam Arc - first mooted in 2003 - was a key priority of successive Conservative governments, only to be shelved by Boris Johnson in 2021 as he shifted focus to \"levelling up\" in the north of England. As for house building, prices remain well over five times average earnings, with previous governments' building targets consistently missed. Courageous or audacious? Take your pick. What was clear from this speech is that Ms Reeves thinks she can succeed where so many politicians have failed and overcome significant opposition - from environmentalists, NIMBYs, MPs, her own Labour mayors - to do what countless other politicians have failed to do before her. Read more:Chancellor announces support for new runway'Europe's Silicon Valley' at heart of government's growth plansPM vows to take on the NIMBYs Many will be betting she and Sir Keir will fail, and even if they succeed in getting these projects off the ground, it will take years, even decades, for the benefits to be felt - which isn't much use for Sir Keir at the ballot box in four years. The political calculation is that there will always be challenges and facing those down with a huge parliament majority is easier than without. The government also hopes the battles and the beginnings of development will be enough of a proof point to win over voters. \"[The long length of delivery] was always going to be the challenge, there's no alternative,\" said one Treasury figure. \"But if people see change - cranes in the sky, new buildings - that will give them faith.\"  Without those cranes in the sky, Labour has no hope at all in turning around bad polling because the entire Starmer project rests on growth. Without it, Labour won't be able to invest in public services and improve people's living standards. That's why this is a definitive moment - the government have no option but to pull this off. Critics will argue that if recent months are anything to go by, this Labour government doesn't look like a bunch of politicians that can succeed in delivering growth where others have not. The budget, which Ms Reeves again on Wednesday defended as being a necessary part of delivering economic stability, dented confidence and hit employers with a £25bn tax bill they were not expecting. Last week Sainsbury cut 3,000 jobs in the face of a \"challenging cost environment\", while today Tesco announced 400 job cuts shortly after the chancellor wrapped up her speech. Meanwhile, there are contradictions. On the one hand, the government says it wants to remove barriers to growth and the chancellor announced on Wednesday she will publish an action plan in March to rip up anti-growth regulations. But on the other, the government is facing criticism from businesses that growth will be hampered and jobs hit by the new workers' rights package Labour is pushing through - something the Conservative leader Kemi Badenoch took aim at on Wednesday during Prime Minister's Questions. The government's own analysis says it could cost businesses up to £5bn a year. As Ms Reeves talks about growth, the Conservatives hit back with cries of indignation over taxes and regulation. Ask businesses, and they will concur on this - saying the Conservatives have a point. But what Ms Reeves wanted to do today was show that she wants to move past the gloom of last autumn and give businesses something to think about beyond the consequences of tax rises, in the hope that it might change the perception that this Labour government is all about tax and spend. 👉Listen to Politics At Jack And Sam's on your podcast app👈 This was a chancellor openly borrowing from the Conservative playbook of supply-side reform in order to find economic growth, while Sir Keir wrote an article in The Times in which he compared his endeavour on deregulation with the Thatcherite financial reforms that precipitated the 1980s big bang. Of course, the big unknown is whether Ms Reeves and Sir Keir will really follow through. Many past Conservative governments folded in the face of fierce resistance. They say they are up for the fight - and it is one they can ill afford to lose."
    },
    {
        "title": "'I was wrong to call Trump a danger to the world,' says Lord Mandelson",
        "description": "Lord Mandelson says calling Donald Trump a \"danger to the world\" in 2019 was \"ill-judged and wrong\".",
        "url": "https://news.sky.com/story/i-was-wrong-to-call-trump-a-danger-to-the-world-says-lord-mandelson-13298956",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-peter-mandelson-eu_6780845.jpg?20241219202811",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-01-29 15:39:00",
        "Headline": "Lord Mandelson is set to become the next UK ambassador. However, the peer's previous comments about Donald Trump have led to rumours he might not be accepted in Washington DC.",
        "Content": "Lord Mandelson says calling Donald Trump a \"danger to the world\" in 2019 was \"ill-judged and wrong\". The former Labour minister has been named as the next UK ambassador to the US, although there have been questions about whether President Trump will accept him. Speaking to Fox News, Lord Mandelson walked back his criticisms from the president's first term in office. Politics latest: Government announces growth plans The 71-year-old told the conservative-backing US TV channel: \"I consider my remarks about President Trump as ill-judged and wrong. \"I think times and attitudes towards the president have changed since then. \"I think people have been impressed, not just by the extraordinary second mandate that he has received from the American people, but the dynamism and energy with which he approached not just the campaign but government as well.\"  Many Labour figures, including the now Foreign Secretary David Lammy, criticised Mr Trump before, during and after his first term in the White House. Now they are in government and Mr Trump is back in power in Washington DC, language has become more diplomatic. Read more:No one is safe in TrumplandTrump aide calls Mandelson a 'moron' Lord Mandelson told the Alain Elkann Interviews podcast previously: \"What Donald Trump represents and believes is an anathema to mainstream British opinion.\" He added: \"Even those who have a sneaking admiration for Donald Trump because of his personality, nonetheless regard him as reckless, and a danger to the world.\" The likely new ambassador criticised Mr Trump's attitude to a previous holder of that office, and said the president was \"little short of a white nationalist and a racist\". 👉 Follow Trump 100 on your podcast app 👈 Speaking now, Lord Mandelson praised Mr Trump, saying he was a \"nice\" and \"fair-minded person\" who could become \"one of the most consequential American presidents I have known in my adult life\". He added: \"I think that with the approach he is taking to government, which frankly just seems to us in Britain so much more organised, it's so much more coherent, he seems to be so much more clear in what he wants to do, we take encouragement from that, that gives us greater confidence.\""
    },
    {
        "title": "Chancellor Rachel Reeves announces backing for third Heathrow runway",
        "description": "The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-announces-backing-for-third-heathrow-runway-13298590",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813432.jpg?20250129110052",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-29 10:50:00",
        "Headline": "The chancellor says the expansion of Europe's busiest airport is \"badly needed\" - but the Green Party's Sian Berry calls it \"the most irresponsible announcement from any government I have seen since the Liz Truss budget\".",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The government supports a third runway at Heathrow, Chancellor Rachel Reeves has announced. Ms Reeves said the expansion of Europe's busiest airport was \"badly needed\" to connect the UK to the world and open up new opportunities for growth. A third runway will \"unlock further growth, boost investment increase exports and make the UK more open and more connected\", she said. Politics latest: Reaction to third runway decision It could increase potential GDP (Gross Domestic Product) by 0.43% by 2050 according to a Frontier Economics study, she said. 60% of that boost would go to areas outside London and the southeast, increasing trade opportunities like Scotch whiskey and Scottish salmon, she added. Ms Reeves said an expansion could create more than 100,000 jobs. The announcement has been welcomed by some business groups but has been met with anger from London's Labour mayor Sadiq Khan, the Lib Dems, the Green Party and environmental groups. Conservative leader Kemi Badenoch told Sky News over the weekend she supports a third runway. Read more:Analysis - The big points in chancellor's speech that won't get the headlines As part of a speech on funding infrastructure across the UK to promote growth, Ms Reeves said: \"Persistent delays have caused doubts about our seriousness towards improving our economic prospects.\" She added that business groups like the Confederation of British Industry (CBI), the Federation of Small Businesses (FSB) and the Chambers of Commerce (BCC), as well as trade unions \"are clear - a third runway is badly needed\". 'Britain is a country of huge potential that is untapped' Speaking afterwards to Sky's economics and data editor Ed Conway, Ms Reeves said: \"I want Britain to be a magnet for foreign investment… we should be welcoming the best businesses and the best talent in the world. I want businesses around the world, investors around the world, to see in Britain, what I see, which is a country of huge potential that is untapped.\" The chancellor also spoke of helping British companies to scale up. She said: \"We are introducing the capital market reforms, particularly around pension reform, unlocking £80bn of long-term patient capital by creating these mega funds, the mergers of defined contribution and local government pension schemes, to create those larger funds that can invest at scale in the exciting opportunities in the UK. \"Building on what countries like Australia and Canada do with their big pension funds, to support British industry, and particularly that stage of a business career when they've had the start-up and the seed funding, but now they're looking to scale up, but they find that the access to finance isn't available in the UK, and often look, to example, for the United States.\"  Investments in green aviation fuel Ms Reeves said in her speech that the UK is \"already making great strides in transitioning to cleaner and greener aviation\" and announced the government is investing £63m over the next year into the Advanced Fuel Fund grant programme to support the development of sustainable aviation fuel production plants. The government will be accepting proposals until the summer and will then carry out a \"full assessment\" through the Airport National Policy Statement to \"ensure a third runway is delivered in line with our legal, environmental and climate objectives\".  Ms Reeves said the government expects any associated surface transport costs to the third runway's construction to be financed through private funding. She added a decision on plans to expand Gatwick and Luton, which are currently under way, will be made by the transport secretary \"shortly\". Read more:A long history of Heathrow's third runway plansGreen groups criticise Heathrow campaigner's role in Labour policy creation  A decades-old debate The debate around whether Europe's busiest airport should expand has been circling over British politics for decades. Ms Reeves's decision will likely put her at odds with Climate Secretary Ed Miliband, who has said airport expansions will not go ahead if they cannot meet climate targets. However, he said last week he would not resign if the government approved a third runway despite threatening to resign from Gordon Brown's cabinet as climate change secretary in 2009 over the plans and in 2018 he said an expansion was \"very likely\" to make air pollution worse. He has now said the government can meet both its growth and net zero missions together. London mayor opposes runway Sadiq Khan said he remained opposed to a third runway \"because of the severe impact it will have on noise, air pollution and meeting our climate change targets\". He said he will carefully scrutinise any new proposals, \"including the impact it will have on people living in the area and the huge knock-on effects for our transport infrastructure\". \"Despite the progress that's been made in the aviation sector to make it more sustainable, I'm simply not convinced that you can have hundreds of thousands of additional flights at Heathrow every year without a hugely damaging impact on our environment,\" he added. Green Party MP Sian Berry said expanding airports \"in the face of a climate emergency is the most irresponsible announcement from any government I have seen since the Liz Truss budget\". Conservative shadow chancellor Mel Stride accused Ms Reeves and Sir Keir Starmer and \"their job-destroying budget\" of being \"the biggest barriers to growth\". \"What's worse, the anti-growth chancellor could not rule out coming back with yet more tax rises in March,\" he added. \"This is a Labour government run by politicians who do not understand business, or where wealth comes from. Under new leadership, the Conservatives will continue to back businesses and hold this government to account.\""
    },
    {
        "title": "Nigel Farage now 'has a laugh' with King despite past disagreements",
        "description": "Nigel Farage said he has \"had a laugh\" with the King despite past disagreements with him.",
        "url": "https://news.sky.com/story/nigel-farage-now-has-a-laugh-with-king-despite-past-disagreements-13299077",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nigel-farage-election_6813716.jpg?20250129154853",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-01-29 19:37:00",
        "Headline": "The Reform UK MP and party leader attended a reception at Buckingham Palace for newly elected politicians after last year's vote. He also criticised the Duke and Duchess of Sussex.",
        "Content": "Nigel Farage said he has \"had a laugh\" with the King despite past disagreements with him. The Reform UK leader met with members of the royal family at Buckingham Palace at a reception for newly elected MPs. Also present was the Queen, alongside the Duke and Duchess of Edinburgh and the Duke and Duchess of Gloucester. Politics latest: Reeves admits change will hit growth Mr Farage said he has met the King \"many times\", and added he knew if he saw him \"some of the exchanges would be interesting\" as they \"have disagreed in the past\". He added: \"He came to the European Parliament many years ago and gave a big speech to which he got a standing ovation. \"Apart from me, I sat there with arms folded. So we've had a laugh about it ever since, it's not nasty, it's climate change and stuff like that.\" \n                  Muslim charities still being debanked despite Farage furore \n                 \n                  Farage and Candy to host £25,000-a-head Reform fundraiser\n                 \n                  Reform within touching distance of Labour as poll suggests 'new era' for British politics\n                 The Clacton MP criticised the Duke and Duchess of Sussex - saying other members of the royal family were having to pick up the slack. The MP said the Duke and Duchess of Edinburgh - Prince Edward and Princess Sophie - were \"charming\" and they are \"doing a lot of the heavy lifting\". Asked if it was the first time he had met them, he said: \"I met them [a] long, long, long time ago. \"But no, they're charming, and they do a lot of the heavy lifting, because there's one or two gaps out there.\" Mr Farage added it had been \"a difficult few years\" for the royal family. He said: \"You know, wonder boy and wonder girl disappear off to America, you know, [Queen Elizabeth II] dies, the King's not been well, Andrew's not in the public eye, Princess Anne is 74 or 75 or whatever she is. So they're doing a lot of the heavy lifting. And I think doing it very well.\" Mr Farage said he had \"a laugh about life\" with Edward. On the reception at the palace as a whole, he said: \"It's really funny being at this, because this is not the first one of these I've been to. \"I came to a reception for new MEPs. So we're going back 26 years, and there were about 30 of us, and that was with [Queen Elizabeth II] and as he was then, the Duke of Edinburgh.\""
    },
    {
        "title": "The big points in the chancellor's speech that won't get the headlines",
        "description": "Rarely has a speech been so heavily trailed in the media, with so many of the details - from the third runway at Heathrow to the revived Oxford-Cambridge corridor and the nine new reservoirs across the country - pre-briefed and leaked to the press in advance.",
        "url": "https://news.sky.com/story/the-big-points-in-the-chancellors-speech-that-wont-get-the-headlines-13299000",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chancellor-rachel-reeves_6813832.jpg?20250129181436",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-01-29 17:13:00",
        "Headline": "Sky's Ed Conway writes that there were many intriguing lines in Rachel Reeves' remarks, with the approach to some key challenges likely to go down badly in Labour circles.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Rarely has a speech been so heavily trailed in the media, with so many of the details - from the third runway at Heathrow to the revived Oxford-Cambridge corridor and the nine new reservoirs across the country - pre-briefed and leaked to the press in advance. So you might have thought there were no surprises left from the chancellor's big speech today. But here are a few intriguing lines worth pondering. The first was something Rachel Reeves said quite early on in the speech itself. Before she even made any of those big announcements, she said a key priority was \"building on our special relationship with the United States under President Trump.\" Money latest: Ryanair boss launches blistering attack on chancellor That the relationship with the US was given such prominence, mentioned before the EU, is not without significance. It's a coded message intended for the White House - that while it may be set on slapping tariffs on many of its allies, Britain is keen to do business. Doing a deal with Donald Trump might stick in the craw for some in the Labour Party, but if there was one overarching message from this speech it's that sometimes, if you want the economy to grow, you have to do stuff that might stick in the craw. Consider: one of the biggest problems with Britain's economy is that it's way too dependent on what happens in London and the South East. That's where most of the gross domestic product (GDP) is generated, it's the most productive region of the country, where house prices are highest, and transport links are, already, better than anywhere else. \n                  Growth is a fight Starmer and Reeves want to have - and they can't afford to lose\n                 \n                  Majority of public support cap on political donations, including half of Reform voters, poll finds\n                 \n                  Is Rachel Reeves ignoring the North?\n                 Many if not most of the plans unveiled by the chancellor today will only widen that divide: new runways in London will make the country yet more London-centric. A rail link between Oxford and Cambridge is unlikely to benefit the people of Manchester or Sheffield. But one of the easiest ways of generating extra growth is to further boost the areas which are already growing fastest. It means cosying up to financial services (at which Britain is already very good) more than manufacturing or steelmaking. Being growth-friendly means being friendly to your biggest market for services, the United States, even if you're not a big fan of the president. A second line that leapt out to me came a bit further down in the speech: \"There is no trade-off between economic growth and net zero. Quite the opposite. Net zero is the industrial opportunity of the 21st century, and Britain must lead the way.\" I have mixed feelings about this, having written an entire book which documents the fact that net zero is indeed the industrial opportunity of the 21st century. However, and this is really important, that does mean that in the short run it's also quite expensive. Replacing your fossil fuel power systems with wind and hydrogen backup is massively costly. It will mean power prices rise even further in the coming years. Hopefully, they will come down thereafter, but it's quite hard to escape the fact that in the short run power prices will stay high. And that matters enormously. Because high energy costs are the reason this country is currently deindustrialising. High power costs are one of the reasons this country is struggling to deploy as much computer server capacity (for which, read: AI) as, for instance, the United States. It's very hard to build anything if your energy is expensive - and the upshot is the UK is mostly importing green tech made in China instead. All of which is to say, growth is not always straightforward. It involves many trade-offs. More planes at Heathrow might mean more growth, but it also means more emissions. Let me give you another example. In my interview with the chancellor today, I asked her whether she thought the company we were at - Siemens Healthineers - was a British success story. Because to some people's minds, it is better cast as a corporate failure. After all, the key technology behind MRI scanners - the things they're making there in Oxford - was invented in Oxford. However, the company behind that invention, Oxford Instruments, never managed to turn it into a corporate success. Instead, it was American companies which turned it into a money-spinner. And Oxford Instruments' MRI business was eventually bought by a German giant, Siemens. Crucially, many of the jobs have stayed here - indeed, Siemens still makes its MRI magnets here and is actually expanding its plant. And the traditional economists' answer is that the nationality of a firm doesn't matter in the slightest. But, in an era characterised by trade war and nationalism, that might not always apply. And it turns out what happened to Oxford Instruments is hardly an isolated example. There are many important technologies Britain invented: CT Scanners, LCDs, fibre optics, radar, the lithium-ion battery (also invented, in part, in Oxford). But none of these inventions gave birth to a world-leading company. Instead, they were mostly snapped up by foreign companies, which proved far better at scaling them up. In most cases, there were far fewer jobs created than by Siemens with its MRI business. Why? No one really knows. But it's a real problem. British start-ups are very good at growing up to a certain size, and then they're very good at getting sold to American or European corporations, earning a hefty payout in the process. This pattern is actually probably quite good for growth - it helps boost gross domestic product. But is it the model Britain should be aiming for in future? Read more from Sky News:Lloyds to cut 136 group branchesLidl allowed to open first in-store pubPost Office unveils new wave of cuts That's a knotty question. And while the attention today was understandably on Heathrow, the politics of the speech and the other more eye-catching announcements, her response to my question - about why businesses struggle to scale up here - was quite instructive. \"You're absolutely right, that is a challenge,\" she said. \"It's why we are introducing the capital market reforms, particularly around pension reform, are unlocking £80bn of long-term patient capital by creating mega-funds, merging defined contribution and local government pension schemes to create larger funds that can invest at scale in the exciting opportunities in The UK.\" Whether these funds move the dial remains to be seen. In some cases, staying independent and resisting foreign takeovers could actually be growth-negative in the short run. But it's something Britain has not historically been very good at. It may be a skill we need to re-learn."
    },
    {
        "title": "A long history of Heathrow's third runway plans",
        "description": "A third runway for Heathrow is back in the offing as the chancellor has backed expansion of Europe's busiest airport.",
        "url": "https://news.sky.com/story/a-long-history-of-heathrows-third-runway-plans-13298778",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-emirates-airbus-a380_6806347.jpg?20250121132517",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-29 09:11:00",
        "Headline": "Chancellor Rachel Reeves has announced the government will support an expansion of Heathrow as part of its growth plans.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  A third runway for Heathrow is back in the offing as the chancellor has backed expansion of Europe's busiest airport. This is not the first time an extra runway has been proposed, with Heathrow's expansion having a chequered past. The first plans for Heathrow had six runways in a hexagon shape (pictured below), with a proposal for three more to be added. Politics latest: Chancellor unveils major growth plan It was initially built with those six runways in 1946 but by the 1970s three had been closed due to new planes needing longer runways. A fourth was decommissioned in 2003, leaving the two current runways. Discussions about a third parallel runway began in the 1980s and in 2009 Gordon Brown's Labour government approved an expansion, saying it was needed for economic reasons. The Conservative-Liberal Democrat coalition scrapped it in 2010, with then prime minister David Cameron saying there would be no expansion \"no ifs, no buts\". Mr Cameron's government established the independent Airports Commission to look at London's airport capacity problems and in 2015 it recommended Heathrow as the preferred site for a new runway. In 2018, Theresa May's government approved the plan but it was opposed by several local MPs, including Boris Johnson who said he would lie down in front of bulldozers to stop its construction. However, Mr Johnson, then foreign secretary, was not there for the vote as he was in Afghanistan. Sir Keir Starmer, current Net Zero Secretary Ed Miliband, Culture Secretary Lisa Nandy, Environment Secretary Steve Reed and Northern Ireland Secretary Hilary Benn also voted against the plans at the time. Read more:What are Heathrow Airport's expansion plans? In early 2020, London Mayor Sadiq Khan, city councils and environmental groups applied for a judicial review against the plans. The Court of Appeal ruled the expansion decision was unlawful as it did not take climate commitments into account. However, later that year the ruling was overturned by the Supreme Court after Heathrow appealed it, allowing a planning application to go ahead. The plan was stalled by the pandemic and falling passenger numbers post-COVID, as well as concerns about cost. In 2024, Heathrow's boss said building a third runway is \"still part of the strategy\" for coping with ever-increasing passenger traffic at Europe's busiest airport. Last year, the airport broke its record for the highest number of passengers, with 83.9 million using Heathrow in 2024 - three million more than its previous record in 2019. It is consistently in the world's top five busiest air hubs and is forecast to serve 84.2m passengers this year."
    },
    {
        "title": "Majority of public support cap on political donations, including half of Reform voters, poll finds",
        "description": "A majority of the public support a cap on political donations, including half of Reform UK voters, according to a new poll.",
        "url": "https://news.sky.com/story/majority-of-public-support-cap-on-political-donations-including-half-of-reform-voters-poll-finds-13298986",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-nigel-farage-elon-musk_6786355.jpg?20250103182940",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-01-29 16:36:00",
        "Headline": "The data, shared exclusively with Sky News, was conducted by Survation for Campaign Group 38 Degrees, and indicates widespread concern about the influence of money in British politics.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n A majority of the public support a cap on political donations, including half of Reform UK voters, according to a new poll. Data shared exclusively with Sky News indicates widespread concern about the influence of money in British politics. Politics latest: PM and Badenoch clash over government's growth plans There is no upper limit on what an individual or company can give to a party it supports. The survey, conducted by Survation for Campaign Group 38 Degrees, shows 60% of people would back imposing a cap. This includes over two-thirds of Labour and Lib Dem voters at the 2024 general election and more than half of Conservative and Reform UK voters. The Reform data comes amid speculation that Elon Musk could make a multi-million-pound donation to the party - something leader Nigel Farage and other senior figures have said they would welcome.  Matthew McGregor, CEO at 38 Degrees, told Sky News that if this happened it would give the world's richest man \"terrifying levels of influence\" and ministers \"cannot afford to sit this one out\". He said: \"The research is clear, if the government capped political donations, they'd have the backing of the British public - from two-thirds of Labour voters to the majority of Reform voters. \"It's time for new legislation to cap political donations, to protect our precious British democracy from outside influence.\" This comes after former Labour Home Secretary Lord Blunkett told Sky News there should be an \"upper ceiling\" on how much companies and trade unions can donate to parties, as well as stricter rules on \"where money originates\". Labour pledged to \"protect democracy by strengthening the rules around donations to political parties\" in its manifesto. However, ministers have said a cap is \"not their priority\" and different proposals will be set out in \"due course\". Calls to close 'loopholes' Democracy groups like Transparency International have previously called for an annual donation cap of £10,000 for individuals and organisations, as recommended by parliament's Committee on Standards in Public Life in 2011. Experts have also called for political parties to be required by law to identify the true source of funds, as well as a limit on company donations so they don't exceed profits generated within the UK. While political parties are banned from accepting foreign donations, there are loopholes which allow people from overseas to give money via a UK-based company. It means US citizen Mr Musk wouldn't be able to make a personal donation to a UK political party, but he could do so through the UK subsidiaries of his companies.  Ministers are under pressure given concerns around the tech tycoon, who has made vocal interventions about British politics on his X platform. However, the issue is not new and all parties have faced questions over the money they receive, with Labour's first weeks in office blighted by a donations and freebies row. Shadow justice secretary Robert Jenrick also recently came under scrutiny for accepting a £75,000 donation from a company which had received a loan from a firm registered in the British Virgin Islands (BVI). Those arguing for less money in politics say the issue is having a corrosive impact on trust, while putting democracy at risk of foreign interference and undue influence of high-level donors. There is now more money in politics than ever, after the Conservatives quietly increased party spending limits on election campaigns in line with inflation and raised the threshold for parties to report accepted donations to the Electoral Commission. Sky News has contacted the government for comment. A Ministry for Housing, Communities and Local Government spokesperson has previously said: \"It is vital we protect our democracy from malign actors who seek to interfere in UK elections through illegitimate political donations. \"That's why the government committed in its manifesto to strengthen the rules around donations to political parties, and work is ongoing to meet this commitment.\""
    },
    {
        "title": "Scientists monitoring football-pitch sized asteroid that could hit Earth in the future",
        "description": "The European Space Agency (ESA) has revealed it is closely monitoring an asteroid the size of a football pitch that could hit the Earth in a little over seven years.",
        "url": "https://news.sky.com/story/scientists-monitoring-football-pitch-sized-asteroid-that-could-hit-earth-in-the-future-13299214",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-asteroid-2024-yr4_6814006.jpg?20250129221348",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-01-29 21:55:00",
        "Headline": "The asteroid, called 2024 YR4, measures 100m by 40m. The Earth takes a direct hit from an asteroid of that size only once every few thousand years.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n The European Space Agency (ESA) has revealed it is closely monitoring an asteroid the size of a football pitch that could hit the Earth in a little over seven years. The asteroid, called 2024 YR4, is estimated to have a one in 83 chance of a direct hit, causing \"severe damage to a local region\", according to ESA. The space rock, which measures 100m by 40m, is currently at a distance of around 27 million miles and moving away from the planet. But its path will cross the Earth's orbit on 22 December 2032. Most likely there would be a near miss, with the asteroid passing within a few thousand miles. The Space Mission Planning Advisory Group, which is chaired by ESA, will discuss the latest observations of the asteroid at a meeting in Vienna next week. If the impact risk is confirmed it will make official recommendations to the United Nations and work may begin on options for a \"spacecraft-based response to the potential hazard\", the agency said in a statement. Dr Simeon Barber, a space scientist at the Open University, told Sky News: \"We shouldn't be overly worried - at least not just yet. \"That's because our early detection systems quite often overestimate the likelihood of an impact with Earth. \"In the early stages, we can't determine its trajectory very accurately, and so the probability of impact has to take into account this uncertainty. \"It's likely that as our technologies for detecting Earth-bound objects improve, we may see an increasing number of alerts such as this. \"It's important that we find the right balance between treating the threat seriously, but not over-reacting in these early stages of discovery when the trajectory is still not well-defined.\" Read more:'New Concorde' prototype jet breaks sound barrier for first timeSimple blood test could revolutionise dementia diagnosisCalorie labelling could make eating disorders worse 'Protect our home planet' Just over two years ago NASA smashed a spacecraft into the 160m-wide asteroid Dimorphos and successfully changed its orbit. At the time NASA administrator Bill Nelson said: \"All of us have a responsibility to protect our home planet. After all, it's the only one we have.\" Near-Earth Asteroid 2024 YR4 was first spotted by a telescope in Chile. Since the start of January, astronomers have been tracking the asteroid to gauge its size and movement. The asteroid is expected to fade from view within the next few months as it moves further from the Earth. Increasingly powerful telescopes will be trained on the rock to gather as much data as possible on its trajectory. Once it disappears it won't come back into view until 2028. How much damage would such an impact do? The Earth takes a direct hit from an asteroid of that size only once every few thousand years. In 1908, a slightly smaller asteroid - thought to have measured 60m across - exploded over Siberia. It flattened 80 million trees over an area of 830 square miles."
    },
    {
        "title": "New bowel cancer detection method more than 90% accurate, research finds",
        "description": "A new method for detecting bowel cancer is more than 90% accurate at predicting which higher risk people will develop the disease, research found.",
        "url": "https://news.sky.com/story/new-bowel-cancer-detection-method-more-than-90-accurate-research-finds-13298882",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bowel-cancer_6813609.jpg?20250129140159",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-29 12:58:00",
        "Headline": "The study, funded by Cancer Research UK, could lead to a blood test which will inform doctors which inflammatory bowel disease patients are most at risk of cancer.",
        "Content": "A new method for detecting bowel cancer is more than 90% accurate at predicting which higher risk people will develop the disease, research found. People with inflammatory bowel disease (IBD), such as Crohn's and ulcerative colitis, are known to have an increased chance of bowel cancer, but not all will develop it. Now, a study funded by Cancer Research UK has shown more than 90% accuracy in predicting bowel cancer risk in the next five years in a high-risk group of people with IBD. This could lead to a blood test which will inform doctors which IBD patients are most at risk of bowel cancer. IBD can irritate the lining of the bowel and can cause abnormal pre-cancerous cells to form if left untreated. To identify people's cancer risk, scientists at the Institute of Cancer Research (ICR), working with doctors at St Mark's in London, the UK's specialist bowel hospital, found that people with IBD whose pre-cancerous cells had lost multiple copies of their DNA were far more likely to go on to develop bowel cancer. The scientists also created an algorithm that calculates the risk of future bowel cancer, based on the exact pattern of the DNA which is altered in the pre-cancerous cells. \n                  Doctors look for clues on why 'super survivors' overcome cancer in first global study\n                 \n                  Surgeons remove tumour through patient's eye socket in UK first\n                 \n                  Princess of Wales says 'it's a relief to now be in remission' from cancer\n                 Samples of pre-cancerous cells were taken from 122 patients with IBD for the study published in the journal Gut. About half of the patients went on to develop bowel cancer within five years, while the other half remained cancer-free. Professor Ailsa Hart, co-lead of the study, from St Mark's, said: \"Patients with inflammatory bowel disease have a higher risk of developing colorectal cancer than people without IBD, and need to undergo assessment with regular colonoscopies to try to detect early signs of cancer. \"These tests are onerous and unpleasant for patients, imperfect at detecting early cancer changes and costly to health services. \"If early signs of cancer are detected, surgery, which involves removing the colon, is advocated. Finding smarter ways to assess these colons is much needed. \"Here we describe a potential biomarker, which can be readily translated into clinical practice, to improve assessment of patients with IBD and early signs of cancer to help with the decision for surgery.\" Around 500,000 people in the UK are thought to have Crohn's or ulcerative colitis. Scientists hope their findings could spare people who are at much lower risk from the stress of needing regular colonoscopies or undergoing surgery to remove the colon. Read more:Doctors look for clues on why 'super survivors' overcome cancerSurgeons remove tumour through patient's eye socket'Pioneering' drug for rare eye cancer to be rolled out Professor Trevor Graham, from the ICR, which co-led the research, said: \"Most people with ulcerative colitis or Crohn's disease won't develop bowel cancer. \"But for those that have these conditions and are showing signs of pre-cancer in their colon, there are some tough decisions to make. \"Either they have it monitored regularly, in the hope that it doesn't become cancer, or they have their bowel removed to guarantee they don't get cancer in the future. Neither of these options are particularly pleasant. \"Our test and algorithm give people with IBD, and the doctors who care for them, the best possible information so that they can make the right decision about how to manage their cancer risk.\" Executive director of research and innovation at Cancer Research UK, Dr Iain Foulkes, said: \"Genome sequencing is now far cheaper and more widespread than ever before, and it's changing how we look at cancer. \"Getting a full readout of tumour DNA means we can see a much bigger picture of how someone's cancer started and how it is likely to change over time. \"With this research, we can focus resources on treating people with IBD who are at really high risk, saving health services valuable time and money.\""
    },
    {
        "title": "Money and public backlash are not the only issues Heathrow expansion plans face",
        "description": "Rachel Reeves is supposedly someone who understands tight budgets.",
        "url": "https://news.sky.com/story/heathrow-expansion-as-the-chancellor-grapples-with-growth-she-has-another-tight-budget-to-consider-13298870",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-heathrow-airport_6806613.jpg?20250121171534",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-01-29 12:36:00",
        "Headline": "Under the Climate Change Act successive governments have a legal responsibility to meet successive five-year carbon budgets.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Rachel Reeves is supposedly someone who understands tight budgets. While she may not have all the cash she'd like to deliver her airport expansion plans, the real constraint is carbon. And Britain's carbon budget has, to use the fiscal parlance of the Treasury, very little headroom at all. This isn't an academic point. Under the Climate Change Act, successive governments have a legal responsibility to meet successive five-year carbon budgets. The watchdog that oversees those budgets, the Office for Budget Responsibility (OBR) of climate if you will, is the Committee on Climate Change. Its current advice is very clear that expansion of air travel in the UK will blow the budget unless cuts are found in other sectors. This probably explains why the chancellor announced a new plan, coming later this year, on how the government will meet its carbon budgets. But it's very hard to see how she might do it. Read moreA long history of Heathrow expansion plansGreen groups criticise planned expansionJet breaks sound barrier for first time Using figures from the Department for Transport and airport operators, the growth in flight numbers as a result of more and more frequently used runways will increase UK carbon emissions by 92 million tonnes CO2 equivalent) by 2050. (The \"equivalent\" bit is important as flights have an additional global warming impact due to particles and water vapour they add to the atmosphere). There's the sustainable aviation fuel mandate that requires airlines to use an increasing mix of zero carbon fuel in the kerosene burned by jets. But the mandate is already factored into our carbon budgets and assumes no airport expansion.  This all leaves a lot of extra carbon \"spending\" to find cuts elsewhere in the economy to cover. So much in fact, a recent study estimated it will cancel out all the emissions saved by the government's other key strategy of clean power by 2030. So that saving isn't going to help. The Department for Net Zero has yet to publish plans to cut emissions from gas boilers and road vehicles, but all evidence suggests they'll struggle to meet existing carbon budgets even with the most well designed and rapidly executed policies. So what else can Rachel Reeves do? Planting trees is popular. It might even help deflect some of the heat she'll be getting from environmentalists after effectively blaming bats and newts for Britain's failure at building infrastructure. But new analysis by Carbon Brief finds that a forest twice the size of greater London would have to be in the ground and growing in short order to absorb all the CO2 those busier airports would bring. That won't leave much space for all those homes, railways and enterprise hubs Britain also desperately needs."
    },
    {
        "title": "Calorie labelling could make eating disorders worse, study suggests",
        "description": "Calorie labels on menus could be making eating disorders worse, according to new research.",
        "url": "https://news.sky.com/story/calorie-labelling-could-make-eating-disorders-worse-study-suggests-13298951",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-menu-restaurant-order_6813703.jpg?20250129153734",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-01-29 15:27:00",
        "Headline": "The study's authors said the focus of calorie labelling policy is on reducing obesity - without considering how people with eating disorders could be negatively impacted. ",
        "Content": "Calorie labels on menus could be making eating disorders worse, according to new research. The review, published in the British Medical Journal Public Health, examined 16 existing studies from the UK, US, Canada and Saudi Arabia which included 8,074 participants, with a focus on how nutritional labels on menus impacted people with a lived experience of eating disorders. The researchers found evidence suggesting there is a \"cause for concern regarding negative impacts, particularly for those with restrictive eating disorders\" and called for further research. They said such impacts included avoiding restaurants based on the menus, triggering eating disorder thoughts and paying more attention to calorie labels, as identified by eye-tracking research. The review highlighted one American study which showed people with anorexia or bulimia selected food with an average of 550 calories when they were given calorie labels, compared to 1,615 calories when they didn't have calorie labels. In another study in England, researchers found 55% of participants with an eating disorder reported that calorie labelling may worsen their eating disorder symptoms. The academics involved in the review said more research was needed to better understand the impact calorie labelling was having on people with eating disorders, rather than the focus being predominantly on tackling obesity. A law introducing calories to menus in restaurants, takeaways and cafes with more than 250 staff came into force in England in 2022 in a bid to help reduce obesity levels. But recent studies have raised doubts over its effectiveness, with a Cochrane review published earlier this month suggesting calorie labels on menus and food packaging lead to people eating one less crisp than usual - though experts said that was a \"small but potentially meaningful effect on people's food choices\". The new review's co-author, Dr Nora Trompeter, said: \"Typically, there is a lot of focus on whether policies are effective in reducing obesity, but it is also critical to investigate whether these policies inadvertently harm people with eating disorders. \"Our review also shows that more research is needed to fully understand the impact of calorie labels on individuals with eating disorders. For example, none of the studies included young people.\" Fellow co-author Dr Tom Jewell added: \"Our study highlights that people with lived experience of eating disorders are frustrated at being left out of the conversation around calorie labels. \"Striking a balance between the positive and harmful impacts of calorie labels on menus is vital in any public health policies. \"Policymakers should consider the impact on both obesity and eating disorders when making decisions about nutrition labelling. \"A recent review found that calorie labelling has a modest effect on people's behaviour but this needs to be counterbalanced with the potential harm it does for people with eating disorders.\" Read more:Poorest must spend 45% of disposable income for 'healthy' dietARFID: The little-known eating disorder that is on the rise Reacting to the study, Tom Quinn, director of external affairs at eating disorder charity Beat, said: \"This vital research adds to a growing bank of evidence: calorie labelling on menus doesn't help anyone. \"People with eating disorders are harmed, and the general population see such a negligible benefit that it can't be justified as an effective health policy. \"For those with eating disorders, calorie labelling can worsen feelings of anxiety and stress and lead to harmful behaviours such as binge eating, exercising excessively or restricting food. \"Going out for meals is also an integral part of eating disorder recovery and having calories on display can make this much more challenging and keep people unwell for longer. \"We hope that the government now takes this into account and chooses to prioritise the 1.25 million people affected by these serious mental illnesses, rather than continuing with a so-called health measure that simply doesn't work.\" A Department of Health and Social Care spokesperson told Sky News: \"This government is committed to tackling the obesity crisis head on, shifting our focus from treatment to prevention as part of our 10 Year Health Plan. \"We will continue to evaluate the impact of out of home calorie labelling on people with eating disorders and overhaul the NHS to ensure those living with eating disorders are given the support they need. \"This includes delivering talking therapies to an extra 380,000 patients, recruiting an extra 8,500 adult and child mental health staff and providing access to mental health support in every school.\""
    },
    {
        "title": "Love Island star Jack Fincham released on bail after being jailed for dog attack",
        "description": "Love Island winner Jack Fincham has been released on bail pending an appeal - hours after being jailed for his cane corso dog attacking a man while he was running.",
        "url": "https://news.sky.com/story/love-island-star-jack-fincham-released-on-bail-after-being-jailed-for-dog-attack-13298845",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-jack-fincham-love-island_6813479.jpg?20250129114752",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-29 17:10:00",
        "Headline": "Jack Fincham appeared at Southend Magistrates' Court, where he gave a thumbs up sign after being jailed for six weeks. The Love Island star had pleaded guilty to two counts of being in charge of a dangerously out of control dog.",
        "Content": "Love Island winner Jack Fincham has been released on bail pending an appeal - hours after being jailed for his cane corso dog attacking a man while he was running. The 32-year-old had pleaded guilty at Southend Magistrates' Court to two counts of being in charge of a dangerously out-of-control dog, with one of the incidents causing injury. As well as being jailed for six weeks, he was ordered to pay £3,680 in total, including a £2,000 contribution to kennelling costs, a fine of £961 and £200 compensation. But after being sentenced at the court on Wednesday, it emerged he had successfully lodged an appeal and had been granted conditional bail. Fincham's solicitor told Sky News District Judge Williams heard the bail application in open court. After the sentence was announced, Fincham gave a thumbs up as he was led to the cells, as a woman in the public gallery cried. The court heard his dog Elvis bit a runner in his home town of Swanley, Kent, in September 2022. Fincham was going to be cautioned and take part in a responsible dog ownership course after the man accepted an apology, said prosecutor Erin Peck. Conditions were made including that his dog must be muzzled, she added. However, in June last year, there was a second incident in Grays, Essex, when the dog was out of control. Fincham was later charged. Presiding magistrate Anne Wade, sentencing, originally said Fincham was subject to a suspended sentence order at the time of the incident in Swanley. This was for 12 weeks custody, suspended for 18 months, for an unrelated driving matter. Ms Wade said this order would be activated in part and issued the six-week prison sentence. \"The dog was in a public place not abiding by the conditions to be muzzled and kept on a lead,\" she said. Richard Cooper, representing Fincham, said the defendant had \"no savings\" to pay the £3,680. Ms Wade said he could pay in instalments, initially at £400 per month. She made an order that the dog must be muzzled in public places, be kept on a lead, and not be left alone with anyone under the age of 16. Fincham rose to fame after winning the fourth series of Love Island with his then-girlfriend Dani Dyer in 2018. The pair were favourites throughout the series after being \"coupled up\" from the start. They announced their break-up six months after leaving the show's villa in Majorca."
    },
    {
        "title": "Noel Clarke loses bid to throw out Guardian publisher's defence in libel claim",
        "description": "Noel Clarke has lost his bid to get The Guardian newspaper's publisher's defence in his libel claim struck out ahead of a trial.",
        "url": "https://news.sky.com/story/noel-clarke-loses-bid-to-throw-out-guardian-publishers-defence-in-libel-claim-13298946",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-noel-clarke-courts_6813408.jpg?20250129102458",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-29 15:19:00",
        "Headline": "Actor Noel Clarke was present at the High Court for the latest hearing in his libel claim against the publisher of The Guardian newspaper. He is suing over a series of articles, the first from April 2021, which included allegations of sexual misconduct against him.",
        "Content": "Noel Clarke has lost his bid to get The Guardian newspaper's publisher's defence in his libel claim struck out ahead of a trial. The 49-year-old actor, best known for his film Kidulthood and starring in Doctor Who, is suing Guardian News and Media (GNM) for libel over a series of articles which began with an investigative feature in April 2021. Some 20 women who knew him in a professional capacity had come forward with allegations against him, the newspaper reported. Clarke, who was present in court for the latest hearing, wearing a grey suit and dark-rimmed glasses, vehemently denied any sexual misconduct or criminal wrongdoing in a statement released at the time. GNM is defending the legal action at the High Court in London on the grounds of truth and public interest. At a hearing on Wednesday ahead of a full trial, lawyers for Clarke applied for GNM's defence case to be struck out, but were unsuccessful. The trial is expected to be heard in March. Philip Williams, representing Clarke, said in a written submission to the court that they believe there is \"overwhelming evidence not just of an attempt to pervert... but actual perversion of the course of justice\". He also alleged there had been \"deliberate and permanent deletion of personal correspondence between the three journalists that undertook the purported investigations, as well as fabrication\". This makes it \"impossible for the defendant to legitimately put forward a positive case that it reasonably believed publishing the defamatory articles were in the public interest\", he argued. Mr Williams claimed two freelance journalists were instructed to \"carry out wholesale deletion\" of threads on the encrypted messaging app Signal. He also told the hearing one of the messages said: \"Delete this entire thread. I'll create a new thread which will likely be disclosable in court.\" Another message allegedly said: \"Can we delete all these threads and use the final thread from now on?\" In his written submissions, Mr Williams said the messages illustrated \"intent and taking steps to fabricate evidence\". He described the alleged \"destruction of evidence\" as \"widespread and wholesale\", and added: \"It is something which they frankly admit. \"For example, the claimant maintains that four other group chats were set to auto-delete. This is admitted by the defendant.\" Read more from Sky News:TV antiques expert diesJake Paul and Logan Paul tease fight Mr Williams said it was \"notable\" the messages instructed the two more junior journalists to delete messages, and that there was also the creation of a \"carefully curated thread\", which would assist the publisher's case. He added: \"The crux of the strike-out application is whether there had been perversion of the course of justice, or spoliation of evidence which renders a fair trial impossible.\" Gavin Millar, representing GNM, told the court in written submissions that Clarke seeks to deprive the publisher \"of its right to the trial of its defences of truth and public interest\". He described the application as \"a poor and opportunistic one for which there is no adequate evidential basis\" and said it sought \"to smear Guardian journalists and editors without any proper justification\". Mr Millar added: \"There is no evidence either that any evidence was 'fabricated'.\" He told the court: \"None of this 'evidence' raises an arguable prima facie case of bad faith, still less criminal conduct against anyone.\" Mr Williams also addressed evidence The Guardian submitted alleging Clarke sent an unsolicited explicit photo to one woman. In his written submission, he said the picture was dated 15 May 2015, but the woman did not meet Clarke until the following month, so it was \"therefore chronologically impossible\". In court, Mr Williams said The Guardian was \"alive to this issue... they ignored when they knew at the very least the dates didn't match, and we say it's possible, ran with it anyway\". Mr Millar, for The Guardian, said it was \"regrettable\" the \"hearing is being used to make these sorts of submission and allegations\". After the hearing, a spokesperson for The Guardian said: \"Today, the judge rejected Noel Clarke's application to strike-out our defence. \"Lawyers for The Guardian told the court there is not one scintilla of evidence that journalists 'fabricated' evidence - a very serious claim made to launder into the public domain allegations that couldn't have been made outside court. \"Our reporting on Noel Clarke in 2021 was based on the accounts of 20 brave women. After we published our first article, more women came forward. \"At trial, 32 witnesses are set to testify against Mr Clarke under oath. We look forward to a judge hearing the evidence.\" After the initial allegations emerged, Clarke had his BAFTA membership suspended and several TV channels also cut ties with him. Scotland Yard said in a statement in March 2022 that, following a thorough assessment by specialist detectives, officers decided that the information they received did not meet the threshold for a criminal investigation."
    },
    {
        "title": "Harvey Weinstein begs judge for earlier retrial: 'I want this to be over with'",
        "description": "Harvey Weinstein has begged a New York judge to hear the retrial in his landmark #MeToo case as soon as possible due to his deteriorating health, telling him: \"I don't know how much longer I can hold on.\"",
        "url": "https://news.sky.com/story/harvey-weinstein-begs-judge-for-earlier-retrial-i-want-this-to-be-over-with-13298912",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-harvey-weinstein-court_6813757.jpg?20250129164952",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-29 14:00:00",
        "Headline": "During a court hearing in Manhattan, New York, ahead of his retrial, disgraced movie mogul Harvey Weinstein said he was facing a \"serious emergency situation\" in prison and wants to \"get out of this hellhole as quickly as possible\".",
        "Content": "Harvey Weinstein has begged a New York judge to hear the retrial in his landmark #MeToo case as soon as possible due to his deteriorating health, telling him: \"I don't know how much longer I can hold on.\" Weinstein has chronic myeloid leukaemia, diabetes and heart problems, and told the judge he was struggling amid harsh conditions at New York City's Rikers Island jail complex. \"Every day I'm at Rikers Island, it's a mystery to me how I'm still walking,\" he told the court in Manhattan. \"I'm holding on because I want justice for myself and I want this to be over with.\" The 72-year-old is facing a retrial after his 2020 rape and sexual assault conviction involving two women was overturned by New York's highest court in April last year. He has always maintained any sexual activity he was involved in was consensual. At the hearing on Wednesday, Judge Curtis Farber said the retrial would start on 15 April. However, Weinstein asked him to swap with another, unrelated case the judge has scheduled in March. The disgraced movie mogul had arrived at the court in a wheelchair more than half an hour after the hearing's scheduled start time. In court, he complained that jail officers had given him the wrong medication and failed to pick him up on time. \"I'm asking and begging you, your honour,\" Weinstein said. He told the judge he was facing a \"serious emergency situation\" and wanted to \"get out of this hellhole as quickly as possible\". He told the court that at times he finds himself gasping for air and predicted he would soon need to be treated in hospital again. In December, he was rushed to hospital following an \"alarming blood test result\". In court last week, Weinstein's lawyer Arthur Aidala also appealed for the retrial to happen earlier in \"the interest of humanity\", saying his client was \"dying of cancer and is an innocent man right now in the state of New York\". Judge Farber said he would look into starting the trial a few days earlier than planned if time allows, but the decision had been made following consultation with Weinstein's lawyers as well as prosecutors. The judge also issued a key ruling on the retrial - upholding a separate charge based on an allegation from a woman who was not part of the original case. Weinstein's lawyers had tried to get the charge thrown out, arguing that prosecutors only brought it to bolster their case with a third accuser, but were unsuccessful. Despite the New York conviction being overturned, he remains in custody due to another conviction in 2022, for the rape of an actress in Los Angeles in 2013. His lawyers have appealed that case. Weinstein was one of the most powerful people in Hollywood - the co-founder of film and television production companies Miramax and The Weinstein Company, he produced films such as the Oscar-winning Shakespeare In Love, Pulp Fiction, and The Crying Game. However, charges were brought after several women went public with allegations about him in 2017, fuelling the rise of the #MeToo movement. In September last year, prosecutors in the UK dropped two charges of indecent assault brought against Weinstein in 2022, saying there was \"no longer a realistic prospect of conviction\"."
    },
    {
        "title": "Super Bowl performances by Rihanna, Jennifer Lopez and Janet Jackson criticised as 'vulgar' by Republicans calling for more 'family friendly' shows",
        "description": "This year's famous Super Bowl half-time show needs to be more \"family friendly\", a group of critics has said - following what they describe as \"vulgar\" past performances by Jennifer Lopez and Rihanna, and the infamous Janet Jackson \"wardrobe malfunction\".",
        "url": "https://news.sky.com/story/super-bowl-performances-by-rihanna-jennifer-lopez-and-janet-jackson-criticised-as-vulgar-by-republicans-calling-for-more-family-friendly-shows-13298821",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-jennifer-lopez-rihanna_6813485.jpg?20250129115030",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-29 10:52:00",
        "Headline": "Kendrick Lamar is due to headline this year's Super Bowl half-time show next month. But ahead of the event, a group of Republicans and campaigners in Louisiana have complained about previous performances by artists including Rihanna and Jennifer Lopez.",
        "Content": "This year's famous Super Bowl half-time show needs to be more \"family friendly\", a group of critics has said - following what they describe as \"vulgar\" past performances by Jennifer Lopez and Rihanna, and the infamous Janet Jackson \"wardrobe malfunction\". Republican politicians and campaigners in Louisiana have written a letter to organisers raising \"serious concerns\" ahead of this year's Super Bowl, which is due to take place at the Caesars Superdome in New Orleans in February. Grammy-winning rapper Kendrick Lamar will headline the half-time show. In a letter signed by 17 Republican senators and representatives for Louisiana, as well as 15 pro-family organisations, critics called out Lopez's performance alongside Shakira in Florida in 2020, saying the star \"wore little clothing and was groped by male and female dancers on stage\", and also \"made sexually suggestive gestures and performed on a stripper pole\".  Criticising Rihanna's performance at the 2023 half-time show in Arizona - when the star revealed she was pregnant with her second child - they said she was shown \"groping herself\" while singing lyrics \"that were so offensive that few Louisiana adults could read those lyrics before an audience without shame\". The letter continued: \"We realize that these past vulgar performances may have been acceptable to the residents of those states where those Super Bowls were held but, in Louisiana, these lewd acts are inappropriate for viewing by children, objectify women, and are simply NOT welcomed by the majority of Louisiana parents.\" Read more: What you need to know about the Super Bowl 'It would have violated obscenity law' Jackson's performance with Justin Timberlake in Texas in 2004, during which he exposed one of her breasts, was also highlighted. \"Had that 2004 performance taken place in Louisiana and been proven to be intentional, it would have violated Louisiana's obscenity law,\" the letter said. CBS, which aired that year's Super Bowl, was fined $550,000 by the Federal Communications Commission over the incident - but this was later overturned. In 2021, following the release of the Framing Britney Spears documentary, which included details of Timberlake's relationship with the star and their break-up, conversation around his Super Bowl performance with Jackson was also reignited. At the time of the incident, Jackson bore the brunt of the criticism, while Timberlake's solo career flourished. In 2021, Timberlake issued an apology, saying: \"I specifically want to apologise to Britney Spears and Janet Jackson both individually, because I care for and respect these women and I know I failed.\" The Republicans' letter did not mention Timberlake but said Jackson's \"exposed bare breast was excused by one of her fellow performers as a 'wardrobe malfunction'.\" Super Bowl half-time performances have become \"increasingly vile\", it continued, and therefore it could be \"reasonably anticipated that the half-time performance this year in New Orleans will be inappropriate for children to watch\". Sky News has contacted the celebrities for a response to the criticism. Senator Valarie Hodges, who signed the letter and shared details on X, said: \"My hope is that Louisiana can set an example for future hosting states of the Super Bowl in advocating for entertainment suitable for viewers of all ages without needing a content rating.\" It has also been shared by the Family Research Council. President Tony Perkins, a former Louisiana state representative who is also one of the signatories, said their complaint was \"not only about protecting children, important as that is, but also upholding community standards\". The letter is addressed to Phillip Sherman, chairman of the Greater New Orleans Sports Foundation, and Robert Vosbein Jr, chairman of the Louisiana Stadium and Exposition District, which oversees the superdrome venue. In a statement sent to Sky News, Jay Cicero, president and chief executive of the Greater New Orleans Sports Foundation, said: \"We respect and value the comments of our legislators, who play a critical role in our ability to secure large events providing an economic boost to our city and state. \"We have shared the letter with the NFL and we are all in agreement that this year's half-time show will be a family-friendly event befitting New Orleans' storied history hosting Super Bowls.\" Mr Vosbein told the Louisiana Illuminator news outlet it was \"unfortunate\" Ms Hodges had waited until less than a few weeks before the event to share her concerns. Sky News has contacted both organisations for comment."
    },
    {
        "title": "Jake Paul and Logan Paul tease fight between brothers",
        "description": "Jake and Logan Paul have teased a fight in March, with both sharing a photo of them in an apparent face-off.",
        "url": "https://news.sky.com/story/jake-paul-and-logan-paul-tease-fight-between-brothers-13298869",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-logan-paul-jake-paul_6813530.jpg?20250129123558",
        "type": "Entertainment",
        "Author": "Jake Levison",
        "Date Published": "2025-01-29 12:32:00",
        "Headline": "The controversial brothers, who both found fame on YouTube before transitioning to boxing, have said before that they are willing to fight one another - but reports suggest something else could be on the cards.",
        "Content": "\n          News reporter\n       Jake and Logan Paul have teased a fight in March, with both sharing a photo of them in an apparent face-off. The brothers, who both found fame on YouTube before transitioning to boxing, shared the photo in a social media post on 28 January with the caption: \"The moment you've waited a decade for… March 27th on @StreamOnMax.\" Max, HBO's streaming service, retweeted both posts, lending legitimacy to its involvement in some sort of Paul brothers spectacle. Many fans believe it could be a boxing fight, while others have suggested it might be a mixed martial arts (MMA) event, as both have a background in wrestling. But those hoping to watch the Pauls have a punch-up may be left disappointed, according to ESPN boxing pundit Mike Coppinger, who says he's been told by multiple sources that the teasers relate to a reality series rather than a fight. The brothers have helped pioneer the now thriving influencer boxing scene. Logan Paul, 29, faced British star KSI in two huge pay-per-view events in 2018 and 2019, drawing the first and losing the latter, before he took on retired great Floyd Mayweather in 2021. Jake Paul, 28, was on the undercard of Logan's first fight, beating KSI's younger brother Deji - and while his brother has stepped away from boxing, he's gone on to turn pro, earning an 11-1 record with his most recent win coming controversially against 58-year-old Mike Tyson. Competitive Pauls have teased fight before The Pauls have discussed getting in the ring together before - though they appeared to have been teasing one another. On Logan's Impaulsive podcast in November, he asked Jake: \"Who are you fighting next? Me?\" \"Yeah, I'll fight you,\" Jake responded. \"Why not? You're f****** tiny.\" After pointing out he was taller than his brother, Logan added: \"Me and you fighting would go crazy, bro.\" \"It would suck to be the one that has to deal with losing,\" Jake said, adding he wouldn't be the one that had to \"deal with that\". Read more:Love Island winner jailed over dog attacksBlake Lively and Justin Baldoni could go to trial \"I have the opposite perspective,\" Logan retorted. \"I feel like ruining my little brother's boxing career would be so bad - and mean.\" A fight between the pair, who have had plenty of public heated exchanges since rising to fame in the mid-2010s, would be sure to attract huge viewership numbers. Promoters said in November that the Tyson-Paul fight was the highest-grossing combat sports event ever in Texas, pulling in $18.1m (£14.6m), while Logan has reached new levels of fame after becoming a part-time World Wrestling Entertainment (WWE) star."
    }
]