[
    {
        "title": "Sean 'Diddy' Combs denied bail after being convicted over prostitution-related offences",
        "description": "Sean \"Diddy\" Combs has been found guilty of transportation for prostitution following a landmark trial in New York - but cleared of more serious charges of sex trafficking and racketeering conspiracy.",
        "url": "https://news.sky.com/story/sean-diddy-combs-guilty-of-prostitution-offences-but-cleared-of-sex-trafficking-and-racketeering-13389065",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-2017_6907253.jpg?20250625170536",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-02 14:15:00",
        "Headline": "Jurors in the high-profile trial of hip-hop mogul Sean \"Diddy\" Combs have reached their verdict after seven weeks of evidence.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Sean \"Diddy\" Combs has been found guilty of transportation for prostitution following a landmark trial in New York - but cleared of more serious charges of sex trafficking and racketeering conspiracy. The hip-hop mogul was accused by prosecutors of abusing and coercing three alleged victims, including his former long-term partner, singer and model Cassie Ventura, and other crimes including kidnapping, arson and blackmail. Jurors decided not all the allegations were proven - but Combs still faces several years in prison after being convicted of transporting people across the US, including Cassie and another former girlfriend \"Jane\", and paying male escorts to engage in sexual encounters. However, with the not guilty verdict on three other more serious charges - racketeering conspiracy and two of sex trafficking - the 55-year-old has avoided a maximum possible sentence of life behind bars. Despite a request by his defence team, he was denied bail ahead of sentencing - which has been scheduled for Friday 3 October. Marc Agnifilo, part of Diddy's defence team, described the ruling as \"a victory of all victories\". Outside the courthouse, he said the jury \"got the situation right, or certainly right enough\". Another of his lawyers, Nicole Westmoreland, said: \"He actually battled for his freedom, for his innocence, and he did it. \"And, you know, a lot of times, people are too afraid to do it. Today is a major win to show what the system can do.\" The mixed result from the jury came not long into their third day of deliberations. In the courtroom in Manhattan, there were cheers from Combs's family - and the rapper himself held his hands up in a prayer motion, looking at the jury, and hugged his defence lawyer Teny Geragos. His mood seemed very different to just a day earlier - when he learned the jury had reached a verdict on four of the five charges, but were split on the racketeering charge. After deliberating for longer on Wednesday, they came to a unanimous decision. As the verdict sunk in, Combs appeared overwhelmed, kneeling at his chair and bowing his head in prayer once again. \"I'll be home soon,\" he said as he faced his family members. \"I love you, Mum.\" The application for bail Combs's defence team argued that as he had been cleared of the most serious charges, he should be bailed ahead of sentencing. His lawyer Marc Agnifilo said he had been a model prisoner and added: \"He's not going to flee. He's been given his life back.\" But prosecutor Maurene Comey argued Combs had a history of violence, which Judge Arub Subramanian agreed with. \"At trial, the defence conceded the defendant's violence in his personal relationships,\" he said. After being denied bail, Combs attempted get the judge's attention - but after consulting with Mr Agnifilo, he did not speak. Cassie 'paved the way' Reacting to the verdict, Cassie's lawyer Douglas H Wigdor said that although jurors did not find Combs guilty of sex-trafficking Cassie, she had \"paved the way\" for the other guilty verdicts. \"By coming forward with her experience, Cassie has left an indelible mark on both the entertainment industry and the fight for justice,\" he said. \"We must repeat - with no reservation - that we believe and support our client, who showed exemplary courage throughout this trial.\" Cassie, who testified heavily pregnant just three weeks before giving birth, displayed \"unquestionable strength\", he added, and \"brought attention to the realities of powerful men in our orbit\". Videos of \"freak off\" sex sessions with male escorts were shown to jurors only during the seven-week trial, with the footage kept private from members of the public and media in court. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs Former employees, along with escorts, hotel staff and police officers were among those to give evidence. Cassie and Jane, who used a pseudonym, also testified. They told the court they were coerced into drug-fuelled \"freak offs\" - which were also referred to as \"hotel nights\" or \"wild king nights\" - with male escorts, and abused throughout their relationships. Combs's defence team presented a very different picture to show that sexual acts, including freak offs, were consensual. They conceded the music star could be violent, had a bad temper and used drugs. He also had multiple relationships at the same time. But crucially, they said, while he was \"not proud\" of some of his behaviour, none of it made him guilty of the charges against him. After hearing evidence of flights and travel for escorts and Cassie and Jane, paid for by Combs, as well as hotel bookings across the US and the Caribbean, jurors found him guilty of the transportation to engage in prostitution charges. However, they did not find that the allegations against the rapper amounted to sex trafficking or racketeering.  The Cassie hotel tape Combs, known variously as Puff Daddy, P Diddy, and Diddy over the years, was once one of the most influential figures in hip-hop - famous as a producer, founder of Bad Boy Records and manager of the late Notorious BIG in the 1990s, as well as a rapper in his own right. As an artist, he won three Grammys during his career, and had hits including I'll Be Missing You, Come With Me, and Bad Boy For Life. In September 2023, he received the \"global icon\" award from MTV and was given the key to New York City at a ceremony in Times Square, just a few miles away from the streets in Harlem where he spent his first years. Allegations first came to prominence in November 2023, when Cassie filed a bombshell lawsuit accusing him of coercing her into unwanted sex sessions, as well as blackmail and several incidences of violence. The suit was settled in 24 hours - for $20m, it emerged during the trial - but months later CNN aired hotel security footage showing Combs punching and kicking Cassie and throwing her to the floor in 2016. He apologised after the video aired, saying: \"I was disgusted when I did it.\" Footage from the hotel incident was shown during the trial. Following the verdict, the rapper now awaits sentencing. He also still faces several civil lawsuits, most of which were filed in the wake of his arrest in September 2024."
    },
    {
        "title": "Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News",
        "description": "Two senior Labour MPs have suggested the prime minister may have to go within months if the government continues to perform poorly.",
        "url": "https://news.sky.com/story/starmer-put-on-notice-and-may-have-to-step-down-as-leader-within-months-13391677",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-tears_6955349.jpg?20250702130000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-02 22:27:00",
        "Headline": "A member of the government and a prominent MP said Sir Keir Starmer could be ousted unless Labour has a strong showing in May's elections.",
        "Content": "Two senior Labour MPs have suggested the prime minister may have to go within months if the government continues to perform poorly. Sky News' deputy political editor Sam Coates said his sources - a member of the government and a prominent politician - have \"put Sir Keir Starmer on notice\". Both warned that, if Labour performs badly in next May's elections across Wales, Scotland and London, it could mark the end of his time in Downing Street. Coates added: \"The level of unhappiness and despair in parts of the Labour Party is so striking that right now, on the first anniversary, I am hearing from ministers in government that Starmer might have to go in months.\" Reform UK is surging in the polls in Wales, while Labour faces a threat from left-wing parties such as the Greens in London.  It comes as the prime minister made it clear that Rachel Reeves has his \"complete support\" as chancellor and remains integral to his project, Sky News's political editor Beth Rigby understands. She looked visibly upset during Prime Minister's Questions, with a spokesperson claiming she had been affected by a \"personal matter\". A day earlier, Sir Keir's controversial welfare bill was passed despite a sizeable rebellion from Labour MPs, with major U-turns meaning a new £5bn black hole has appeared in the country's finances. One senior figure told Rigby that the pair were as \"as close politically\" as any chancellor and prime minister have ever been. \"She is going absolutely nowhere,\" they added.  Ms Reeves's tears sent markets spiralling, with the value of the pound and long-term government bonds falling sharply. Later in the day Sir Keir, said Ms Reeves will be chancellor for a \"very long time to come\". The prime minister said it was \"absolutely wrong\" to suggest her tearful appearance in the Commons related to the welfare U-turn. \"It's got nothing to do with politics, nothing to do with what's happened this week. It was a personal matter for her,\" he said while speaking to the BBC's podcast Political Thinking with Nick Robinson. \"I'm not going to intrude on her privacy by talking to you about that. It is a personal matter.\" Read more from Sky News:Just 25% of public think Starmer will win next electionAnalysis: Emotional Reeves a reminder of tough decisions ahead Asked if she will remain in post, he said: \"She will be chancellor by the time this is broadcast, she will be chancellor for a very long time to come, because this project that we've been working on to change the Labour party, to win the election, change the country, that is a project which the chancellor and I've been working on together.\" He said Ms Reeves has done a \"fantastic job\" and added: \"She and I work together, we think together. In the past, there have been examples - I won't give any specific - of chancellors and prime ministers who weren't in lockstep. We're in lockstep.\""
    },
    {
        "title": "Four charged after £7m of damage caused to aircraft at RAF Brize Norton",
        "description": "Four people have been charged after &#163;7m of damage was caused to two Voyager aircraft at RAF Brize Norton.",
        "url": "https://news.sky.com/story/four-charged-after-1637m-of-damage-caused-to-aircraft-at-raf-brize-norton-13391678",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-plane-brize_6946805.jpg?20250620155035",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-02 23:07:00",
        "Headline": "Last month's incident was claimed by the activist group Palestine Action. Yesterday, MPs voted to proscribe the group as a terrorist organisation.",
        "Content": "Four people have been charged after £7m of damage was caused to two Voyager aircraft at RAF Brize Norton. The investigation into the incident early on Friday 20 June was led by counter-terror police. They have been charged with conspiracy to enter a prohibited place knowingly for a purpose prejudicial to the safety or interests of the UK - and conspiracy to commit criminal damage. The four charged have been identified as: • Amy Gardiner-Gibson, 29, of no fixed abode • Daniel Jeronymides-Norie, 35, from London • Jony Cink, 24, of no fixed abode \n                  Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News\n                 \n                  Starmer to set out 10-year vision for NHS\n                 \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 • Lewie Chiaramello, 22, from London They will appear at Westminster Magistrates' Court later today. A 41-year-old woman arrested last week on suspicion of assisting an offender has been released on bail until 19 September. Meanwhile, a 23-year-old man detained on Saturday was released without charge. Last month's incident at RAF Brize Norton in Oxfordshire was claimed by the activist group Palestine Action. Yesterday, MPs voted to proscribe the group as a terrorist organisation. The legislation passed with 385 MPs voting in favour, while 26 were against."
    },
    {
        "title": "Rise in Gaza deaths linked to aid distributions by controversial group",
        "description": "Sky News analysis shows that aid distributions by the Gaza Humanitarian Foundation (GHF) are associated with a significant increase in deaths.",
        "url": "https://news.sky.com/story/rise-in-gaza-deaths-linked-to-aid-distributions-by-controversial-group-13391481",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-dandf-teaser-aid_6955653.jpg?20250702172834",
        "type": "Home",
        "Author": "Ben van der Merwe, Saywah Mahmood and Michelle Inez Simon, Data &amp; Forensics Unit",
        "Date Published": "2025-07-02 13:54:00",
        "Headline": "New analysis by Sky News shows that deaths in Gaza are increasing when there are more aid distributions by controversial US and Israeli-backed group.",
        "Content": "By Ben van der Merwe, Saywah Mahmood and Michelle Inez Simon, Data & Forensics Unit  Sky News analysis shows that aid distributions by the Gaza Humanitarian Foundation (GHF) are associated with a significant increase in deaths. Warning: This article contains descriptions of people being killed and images of blood on a hospital floor. The US and Israeli-backed group has been primarily responsible for aid distribution since Israel lifted its 11-week blockade of the Gaza Strip last month. The GHF distributes aid from four militarised Secure Distribution Sites (SDSs) - three of which are in the far south of the Gaza Strip. Under the previous system, the UN had distributed aid through hundreds of sites across the territory. According to Gaza's health ministry, 600 Palestinians have been killed while seeking aid from GHF sites, which charities and the UN have branded \"death traps\". The UN put the figure at 410, but has not updated this number since 24 June. Both the UN and health ministry source their figures from hospitals near the aid sites. Speaking to Sky News, GHF chief Johnnie Moore disputed that these deaths were connected with his organisation's operations. \"Almost anything that happens in the Gaza Strip is going to take place in proximity to something,\" he said. \"Our effort is actually working despite a disinformation campaign, that is very deliberate and meant to shut down our efforts. \"We just want to feed Gazans. That's the only thing that we want to do.\" However, new analysis by Sky's Data & Forensics Unit shows that deaths in Gaza have spiked during days with more GHF distributions. On days when GHF conducts just two distributions or fewer, health officials report an average of 48 deaths and 189 injuries across the Gaza Strip. On days with five or six GHF distributions, authorities have reported almost three times as many casualties. Out of 77 distributions at GHF sites between 5 June and 1 July, Sky News found that 23 ended in reports of bloodshed (30%). At one site, SDS4 in the central Gaza Strip, as many as half of all distributions were followed by reports of fatal shootings. Sky News spoke to one woman who had been attending SDS4 for 10 days straight. \"I witnessed death first-hand - bodies lay bleeding on the ground all around me,\" says Huda. \"This is not right. Food should be delivered to UN warehouses, and this entire operation must be shut down.\" Huda says that the crowds are forced to dodge bombs and bullets \"just to get a bag of rice or pasta\". \"You may come back, you may not,\" she says. \"I was injured by shrapnel in my leg. Despite that, I go back, because we really have nothing in our tent.\" One of the deadliest incidents at SDS4 took place in the early hours of 24 June. According to eyewitnesses, Israeli forces opened fire as people advanced towards aid trucks carrying food to the site, which was due to open. \"It was a massacre,\" said Ahmed Halawa. He said that tanks and drones fired at people \"even as we were fleeing\". At least 31 people were killed, according to medics at two nearby hospitals. Footage from that morning shows the floor of one of the hospitals, al Awda, covered in blood. The IDF says it is reviewing the incident.  Issues of crowd control  Unnamed soldiers who served near the aid sites told Israeli newspaper Haaretz that they were instructed to use gunfire as a method of crowd control. An IDF spokesperson told Sky News that it \"strongly rejected\" the accusations that its forces were instructed to deliberately shoot at civilians. \"To be clear, IDF directives prohibit deliberate attacks on civilians,\" the spokesperson said, adding that the incidents are \"being examined by the relevant IDF authorities\". Eyewitness testimony and footage posted to social media suggest that crowd control is a frequent problem at the sites. The video below, uploaded on 12 June, shows a crowd rushing into SDS1, in Gaza's far southwest. What sounds like explosions are audible in the background. Footage from the same site, uploaded on 15 June, shows Palestinians searching for food among hundreds of aid parcels scattered across the ground. Sam Rose, the director of UNRWA operations in Gaza, describes the distribution process as a \"free-for-all\". \"What they're doing is they're loading up the boxes on the ground and then people just rush in,\" he says. Sky News has found that the sites typically run out of food within just nine minutes. In a quarter of cases (23%), the food is finished by the time the site was due to officially open.  Confusing communications  Sky News analysis suggests that the issue may be being compounded by poor communications from GHF. Between 19 June and 1 July, 86% of distributions were announced with less than 30 minutes' notice. One in five distributions was not announced at all prior to the site opening. The GHF instructs Palestinians to take particular routes to the aid centres, and to wait at specified locations until the official opening times. The map for SDS1 instructs Palestinians to take a narrow agricultural lane that no longer exists, while the maps for SDS2 and SDS3 give waiting points that are deep inside IDF-designated combat zones. The maps do not make the boundaries of combat zones clear or specify when it is safe for Palestinians to enter them. The same is true for SDS4, the only distribution site outside Gaza's far south. Its waiting point is located 1.2 miles (2km) inside an IDF combat zone. The official map also provides no access route from the northern half of Gaza, including Gaza City, across the heavily militarised Netzarim corridor. \"They don't know what they're doing,\" says UNRWA's Sam Rose. \"They don't have anyone working on these operations who has any experience of operating, of administering food distributions because anyone who did have that experience wouldn't want to be part of it because this isn't how you treat people.\" Once the sites are officially open, Palestinians are allowed to travel the rest of the way. The distance from waiting point to aid site is typically over a kilometre, making it difficult for Palestinians to reach the aid site before the food runs out. The shortest distance is at SDS4 - 689m. At a pace of 4km per hour, this would take around 10 minutes to cover. But of the 18 distributions at this site which were announced in advance, just two lasted longer than 10 minutes before the food ran out. \"We don't have time to pick anything up,\" says Huda, who has been visiting SDS4 for the past 10 days. In all that time, she says, all she had managed to take was a small bag of rice. \"I got it from the floor,\" she says. \"We didn't get anything else.\" More than 200 charities and non-governmental organisations have called for the closure of GHF and the reinstatement of previous, UN-led mechanisms of aid distribution. In a joint statement issued on 1 July, some of the world's largest humanitarian groups accused the GHF of violating international humanitarian principles. They said the scheme was forcing two million people into overcrowded, militarised zones where they face daily gunfire. Additional reporting by OSINT producers Sam Doak and Lina-Serene. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Starmer to set out 10-year vision for NHS",
        "description": "Sir Keir Starmer will set out his 10-year vision for the NHS in what the government says is \"one of the most seismic shifts\" in the health service's history.",
        "url": "https://news.sky.com/story/starmer-to-set-out-10-year-vision-for-nhs-13391633",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-nhs_6955859.jpg?20250703025645",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-02 19:21:00",
        "Headline": "The prime minister has made reforming the NHS one of his main priorities, with public satisfaction with the health service having been decimated since the pandemic.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Sir Keir Starmer will set out his 10-year vision for the NHS in what the government says is \"one of the most seismic shifts\" in the health service's history. He will pledge three main facets of the plan: moving care into the community, digitising the NHS, and a focus on sickness prevention. The prime minister will announce neighbourhood health services will be rolled out across England to improve access to the NHS and to shift care out of overstrained hospitals. PM 'might have to go in months' - politics latest  Sir Keir has already promised thousands more GPs will be trained, and to end the 8am \"scramble\" for an appointment. He also previously said his government will bring the NHS into the digital age, with \"groundbreaking\" new tools to support GPs rolled out over the next two years - including AI to take notes, draft letters and enter data. And he will promise new contracts that will encourage and allow GP practices to cover a wider geographical area, so small practices will get more support. Unite, one of the UK's largest healthcare unions, welcomed the plan cautiously but said staff need to be the focus to ensure people are better looked after. Read more:Hundreds of NHS quangos to be axedHow pilot scheme from Brazil is helping NHS  'Reform or die' Sir Keir said: \"The NHS should be there for everyone, whenever they need it. \"But we inherited a health system in crisis, addicted to a sticking plaster approach, and unable to face up to the challenges we face now, let alone in the future. \"That ends now. Because it's reform or die.\" He said the government's plan \"will fundamentally rewire and futureproof our NHS, so that it puts care on people's doorsteps, harnesses game-changing tech and prevents illness in the first place\". The PM said it would not be an \"overnight fix\", but claimed Labour are \"already turning the tide on years of decline\", pointing towards more than four million extra appointments, 1,900 more GPs, and waiting lists at a two-year low. \"But there's more to come,\" he promised. \"This government is giving patients easier, quicker and more convenient care, wherever they live.\"  Neighbourhood health services The newly announced neighbourhood health services will provide \"pioneering teams\" in local communities, so patients can more conveniently access a full range of healthcare services close to home. Local areas will be encouraged to trial innovative schemes like community outreach door-to-door to detect early signs of illness and reduce pressure on GPs and A&E. The aim is to eventually have new health centres open 12 hours a day, six days a week to offer GP services as well as diagnostics, post-operative care and rehab. They will also offer services like debt advice, employment support, stop smoking help or weight management. More NHS dentists Dentists will also be part of the plan, with dental care professionals part of the neighbourhood teams. Dental \"therapists\" will carry out check-ups, treatments and referrals, while dental nurses could give education and advice to parents or work with schools and community groups. Newly qualified dentists will be required to practice in the NHS for a minimum period, which they have said will be three years."
    },
    {
        "title": "Bryan Kohberger pleads guilty to murdering four University of Idaho students in 2022",
        "description": "A man has pleaded guilty to murdering four University of Idaho students in November 2022 after agreeing to a deal which means he will likely avoid the death penalty.",
        "url": "https://news.sky.com/story/bryan-kohberger-pleads-guilty-to-murdering-four-university-of-idaho-students-in-2022-13391527",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-idaho-usa_6009693.jpg?20221230180407",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-02 15:27:00",
        "Headline": "Bryan Kohberger had initially denied the murders of Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves before changing his plea.",
        "Content": " A man has pleaded guilty to murdering four University of Idaho students in November 2022 after agreeing to a deal which means he will likely avoid the death penalty. Bryan Kohberger, a 30-year-old former criminal justice student, was arrested at his parents' home in Pennsylvania weeks after the killings following a nationwide search. He was accused of sneaking into the rented home in Moscow, Idaho, which is not far from the university campus, and attacking Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves. Post-mortems showed the four were stabbed multiple times and were likely asleep when they were attacked, though some had defensive wounds. Kohberger has never revealed his motive and it is not clear why he spared two roommates who were in the home. There was also no indication he knew any of the victims, who were all friends. Kohberger previously pleaded not guilty to charges of murder and burglary. However he has now agreed to a plea deal, just weeks before his trial was set to begin in August, in a bid to avoid the death penalty - which prosecutors said they intended to pursue. Despite that, the deal must be approved by Idaho Fourth Judicial District Judge Steven Hippler. Although judges in Idaho can reject plea agreements, such incidents are rare. \"This court cannot require the prosecutor to seek the death penalty, nor would it be appropriate for this court to do that,\" Hippler said. The family of one of the victims, Ms Goncalves, opposed the agreement and said they would seek to stop it. They also argued that any such deal should require Kohberger to make a full confession, detail the facts of what happened and provide the location of the murder weapon. They wrote in a Facebook post on Monday they were \"beyond furious at the State of Idaho\" for offering Kohberger a plea deal. It came as the family of Mr Chapin supported the deal, their spokesperson, said on Tuesday. Read more:Surviving Idaho student 'saw masked man in black clothing'Idaho suspect 'warned after making creepy comments' Meanwhile Ms Mogen's father, Ben Mogen, told CBS News he was relieved by the agreement. \"We can actually put this behind us and not have these future dates and future things that we don't want to have to be at, that we shouldn't have to be at, that have to do with this terrible person,\" he said. \"We get to just think about the rest of lives and have to try and figure out how to do it without Maddie and the rest of the kids.\" Kohberger, who remained expressionless as he entered his guilty pleas, will be sentenced on 23 July. How police caught Kohberger The small farming community of Moscow, in the northern Idaho panhandle, had not had a homicide in about five years when the murders took place. The killings grabbed headlines around the world and set off a nationwide hunt. Police arrested Kohberger after investigators said they matched his DNA to genetic material recovered from a knife sheath found at the crime scene. They were also able to access mobile phone data to pinpoint his movements on the night of the killings. Online shopping records showed that Kohberger had purchased a military-style knife months earlier - as well as a sheath like the one found at the scene. At the time of the murders, Kohberger was a criminal justice graduate student at nearby Washington State University who had just completed his first semester and was a teaching assistant."
    },
    {
        "title": "Jodie Sheeran: Family of grooming gang victim call for case to be reopened after 'failings' ",
        "description": "The family of a woman who conceived a baby after being groomed by a gang in Stoke-on-Trent are calling for the police to reopen her case, saying she was \"failed all those years ago\".",
        "url": "https://news.sky.com/story/jodie-sheeran-family-of-grooming-gang-victim-call-for-case-to-be-reopened-after-failings-13391559",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sheeran-jodie_6955668.jpg?20250702174016",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-02 16:23:00",
        "Headline": "Jodie Sheeran had a baby after becoming a victim of a grooming gang. Now, her son has joined his grandparents in fighting for justice.",
        "Content": " The family of a woman who conceived a baby after being groomed by a gang in Stoke-on-Trent are calling for the police to reopen her case, saying she was \"failed all those years ago\". Jodie Sheeran, then aged 15, was allegedly taken to a hotel and raped in November 2004. She is believed to have been groomed by a group of young men of Pakistani heritage for a year beforehand. Jodie's son, Jayden, was born nine months after the attack. Following the allegation, a man was charged, but the case was dropped the day before the trial was due to start in September 2005. Jodie died in November 2022 from an alcohol-related death. Speaking on The UK Tonight with Sarah-Jane Mee, Jodie's mother Angela has welcomed the national grooming gangs inquiry, saying: \"This could be my chance to get justice for Jodie… I've fought so long.\" As part of the inquiry, more than 800 cold cases will be followed up on by the National Crime Agency (NCA). And Angela is calling for Jodie's to be one of them. \"I'm just hoping that poor Jodie is included,\" she said. \"Because they just keep telling me she's dead and there's nothing they can do, it's her word against his. But I don't want to forget Jodie. \"Just because she's dead, it shouldn't mean that she doesn't matter. \"She should be with us because they failed her all those years ago,\" Angela added. Angela and Jodie's father, David, say there were multiple failings when Jodie's case was first investigated. The case went to trial but before proceedings were due to begin, a police officer knocked on the family's door to tell them the charges had been dropped. Jodie's father David said the family were told this was because of the teenager's \"reckless lifestyle\" and that they were later told their daughter was \"an unreliable witness\". \"They bottled it, they were scared of being called racist,\" he told Sky News. The family say they never received any formal communication on why the charges were dropped. A Crown Prosecution Service spokesperson said: \"The failure in 2005 to explain to Jodie and her family why her case was discontinued was wrong. This should not have happened, and we are profoundly sorry for the devastating consequences this has had. \"Though the records from 2005 no longer exist, we worked carefully in 2019 to review the available evidence from police files, and a separate prosecutor concluded that there was insufficient evidence to charge the suspect with rape. We wrote to Jodie explaining this decision. \"Subsequently, as part of our handling of a complaint in 2023, we reviewed the available evidence again and concluded that there was insufficient evidence to support a prosecution for either rape or sexual assault - which we communicated to Jodie's family. \"The way the CPS handles these cases has changed significantly over the last two decades; we have since established a dedicated Organised Child Sexual Abuse Unit to tackle these awful crimes and recruited victim liaison officers across the country so every victim has a dedicated point of contact. \"But we recognise these improvements bring little comfort to Jodie's family - and we continue to offer them our deepest condolences for the loss they have endured.\" 'I felt nothing but loved' by my mum, says Jodie's son Jodie's son Jayden has now joined his grandparents in fighting for justice. \"In primary school, I was questioning who I am and what am I,\" he said. \"Why am I with this family when I'm completely different to them? \"Friends used to ask me in primary school, 'why are you a different colour to your nan and grandad', 'why don't you see your mum? Why don't you see your dad?'.\" \"I know my mum did everything she could for me,\" he said. \"When I was with her, I felt nothing but loved.\" Jayden said he knows who his father is and saw him locally just two weeks ago, \"but he didn't even recognise me.\" Read more from Sky News:Prosecutors consider more charges against Lucy LetbyMan charged with murder of 93-year-old  In a statement issued to Sky News, Staffordshire Police said it met with Angela Sheeran in both 2023 and 2024 to discuss her daughter's case. It said: \"One suspect was identified and, while several reviews have been conducted, including speaking to potential witnesses and victims that Mrs Sheeran provided contact details for, we regret that no new evidence has emerged that would allow us to take further action at this time.\""
    },
    {
        "title": "Princess of Wales reveals pressure to put on 'brave face' after cancer diagnosis",
        "description": "The Princess of Wales has spoken of the pressure to put on a \"brave face\" after being diagnosed with cancer and the intense expectations to \"crack on, get back to normal\" once treatment is finished.",
        "url": "https://news.sky.com/story/princess-of-wales-reveals-pressure-to-put-on-brave-face-after-cancer-diagnosis-13391477",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-princess-of-wales_6955303.jpg?20250702123417",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-02 13:35:00",
        "Headline": "What felt like her most personal and extensive public reflections on her recovery journey to date came as she met fellow patients at a cancer wellbeing centre at Colchester Hospital.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The Princess of Wales has spoken of the pressure to put on a \"brave face\" after being diagnosed with cancer and the intense expectations to \"crack on, get back to normal\" once treatment is finished. What felt like her most personal and extensive public reflections on her recovery journey to date came as she met fellow patients at a cancer wellbeing centre at Colchester Hospital, helping to plant roses in a garden designed to help visitors find peace. It follows recent media coverage about her decision not to attend Royal Ascot two weeks ago. The Princess is in remission from cancer and the palace has consistently insisted there would be flexibility around her public engagements as she continues her recovery. Appearing to address the issue herself, Kate said: \"There is a whole phase when you finish your treatment. Everybody expects you to be better - go. You're done, you should be back. But it's not the case at all.\"  Speaking to other cancer patients and volunteers, she added: \"You put on a sort of brave face, stoicism through treatment, treatment's done, then it's like 'I can crack on, get back to normal', but actually the phase afterwards is really difficult. You're not necessarily under the clinical team any longer, but you're not able to function normally at home as you perhaps once used to.\" Describing a first diagnosis as \"a very scary journey\", she explained how in recovery it feels like \"you have to find your new normal and that takes time\". \n                  Dermot Murnaghan: Former Sky News presenter diagnosed with stage four prostate cancer\n                 \n                  New leukaemia treatment hailed as 'milestone' in cancer management\n                 \n                  Cancer patients missing holidays or travelling uninsured amid unfair insurance costs, charity says\n                 Speaking to a volunteer who had also been through her own cancer diagnosis, Kate said: \"It's life-changing for anyone, through first diagnosis or post-treatment and things like that, it is a life-changing experience both for the patient but also for the families as well. \"And actually, it sometimes goes unrecognised, you don't necessarily, particularly when it's the first time, appreciate how much impact it is going to have. You have to find your new normal and that takes time… and it's a rollercoaster, it's not one smooth plain, which you expect it to be. But the reality is it's not, you go through hard times.\" The wellbeing centre was built outside of the main hospital building, but close enough that patients can easily find it.  Many newly diagnosed patients at Colchester Hospital now visit the centre immediately for counselling and advice. They also provide holistic treatments, including reflexology. Read more:End of the line for royal trainIs anyone listening to William?New Kate waxwork unveiled The princess, speaking to therapist Amanda Green during a walkabout in heavy rain afterwards, said she had not yet tried reflexology but had had acupuncture as part of her own health journey.  Repeatedly praising the focus on \"mind, body and spirit\" that the centre provides, Kate said \"someone to help talk you through that, show you and guide you through that sort of phase that comes after treatment, I think is really valuable.\" Talking about how difficult it can be for patients to know where to find support she said: \"To have a place like this, to have the support network, through creativity and singing or gardening, whatever it might be, is so valuable and it's great this community has it, it would be great if lots of communities had this kind of support.\" The visit came with a donation of 50 'Catherine's Rose' plants, which she helped to plant in the garden surrounding the wellbeing centre. Named for the princess by the Royal Horticultural Society, the funds from sales of the plants go to the Royal Marsden Cancer Charity."
    },
    {
        "title": "MPs vote to proscribe Palestine Action as terrorist organisation",
        "description": "MPs have voted to proscribe Palestine Action as a terrorist organisation after the group targeted an RAF base and an Israeli defence company's UK headquarters.",
        "url": "https://news.sky.com/story/mps-approve-plans-to-proscribe-palestine-action-as-terrorist-organisation-13391291",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brandon-palestine-action_6954446.jpg?20250701125410",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-02 07:03:00",
        "Headline": "The legislation was passed by the vast majority of MPs. However, several argued that proscribing the group \"sets a dangerous precedent for political dissent\".",
        "Content": "MPs have voted to proscribe Palestine Action as a terrorist organisation after the group targeted an RAF base and an Israeli defence company's UK headquarters. The legislation passed with 385 MPs voting to proscribe the group, while 26 voted against the move. The amendment to the Terrorism Act 2000 to include Palestine Action and two white supremacist groups, Maniacs Murder Cult and Russia Imperial Movement, will go to the House of Lords on Thursday and become law at midnight on 9 July if it passes through successfully. Politics latest: PM tells chancellor she has his complete support It means it will become a criminal offence - punishable by up to 14 years in prison - to be a member of the three groups or to support them, if any legal challenges by the groups prove to be unsuccessful. Security minister Dan Jarvis told MPs protesters expressing support for Palestine \"have always been able to, and can continue to do so\". He said: \"Palestine Action is not a legitimate protest group. \"People engaged in lawful protest don't need weapons. People engaged in lawful protest do not throw smoke bombs and fire pyrotechnics around innocent members of the public. \"And people engaged in lawful protest do not cause millions of pounds of damage to national security infrastructure, including submarines and defence equipment for NATO.\" However, several Labour MPs made impassioned speeches about why they think Palestine Action should not be a terrorist organisation, and raised concerns it was grouped in with the other two. They argued that proscribing the group \"threatens basic freedoms and sets a dangerous precedent for political dissent\". Independent MP Zarah Sultana, a former Labour MP, said: \"To equate a spray can of paint with a suicide bomb isn't just absurd, it is grotesque. \"It is a deliberate distortion of the law to chill dissent, criminalise solidarity and suppress the truth.\" Read more:Two more people arrested over damage to RAF aircraftWhat does being proscribed mean? Palestine Action is seeking a legal challenge against the government's bid to proscribe it, with a hearing expected on Friday to decide whether its proscription can be temporarily blocked, pending further proceedings to decide whether a legal challenge can be brought. Members of Palestine Action are accused of entering RAF Brize Norton in Oxfordshire on 20 June and vandalising two aircraft with red paint. Five people have been arrested over the incident on suspicion of a terror offence. A security review was launched across the \"whole defence estate\" following the breach."
    },
    {
        "title": "Four charged after £7m of damage caused to aircraft at RAF Brize Norton",
        "description": "Four people have been charged after &#163;7m of damage was caused to two Voyager aircraft at RAF Brize Norton.",
        "url": "https://news.sky.com/story/four-charged-after-1637m-of-damage-caused-to-aircraft-at-raf-brize-norton-13391678",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-plane-brize_6946805.jpg?20250620155035",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 23:07:00",
        "Headline": "Last month's incident was claimed by the activist group Palestine Action. Yesterday, MPs voted to proscribe the group as a terrorist organisation.",
        "Content": "Four people have been charged after £7m of damage was caused to two Voyager aircraft at RAF Brize Norton. The investigation into the incident early on Friday 20 June was led by counter-terror police. They have been charged with conspiracy to enter a prohibited place knowingly for a purpose prejudicial to the safety or interests of the UK - and conspiracy to commit criminal damage. The four charged have been identified as: • Amy Gardiner-Gibson, 29, of no fixed abode • Daniel Jeronymides-Norie, 35, from London • Jony Cink, 24, of no fixed abode \n                  Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News\n                 \n                  Starmer to set out 10-year vision for NHS\n                 \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 • Lewie Chiaramello, 22, from London They will appear at Westminster Magistrates' Court later today. A 41-year-old woman arrested last week on suspicion of assisting an offender has been released on bail until 19 September. Meanwhile, a 23-year-old man detained on Saturday was released without charge. Last month's incident at RAF Brize Norton in Oxfordshire was claimed by the activist group Palestine Action. Yesterday, MPs voted to proscribe the group as a terrorist organisation. The legislation passed with 385 MPs voting in favour, while 26 were against."
    },
    {
        "title": "Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News",
        "description": "Two senior Labour MPs have suggested the prime minister may have to go within months if the government continues to perform poorly.",
        "url": "https://news.sky.com/story/starmer-put-on-notice-and-may-have-to-step-down-as-leader-within-months-13391677",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-tears_6955349.jpg?20250702130000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 22:27:00",
        "Headline": "A member of the government and a prominent MP said Sir Keir Starmer could be ousted unless Labour has a strong showing in May's elections.",
        "Content": "Two senior Labour MPs have suggested the prime minister may have to go within months if the government continues to perform poorly. Sky News' deputy political editor Sam Coates said his sources - a member of the government and a prominent politician - have \"put Sir Keir Starmer on notice\". Both warned that, if Labour performs badly in next May's elections across Wales, Scotland and London, it could mark the end of his time in Downing Street. Coates added: \"The level of unhappiness and despair in parts of the Labour Party is so striking that right now, on the first anniversary, I am hearing from ministers in government that Starmer might have to go in months.\" Reform UK is surging in the polls in Wales, while Labour faces a threat from left-wing parties such as the Greens in London.  It comes as the prime minister made it clear that Rachel Reeves has his \"complete support\" as chancellor and remains integral to his project, Sky News's political editor Beth Rigby understands. She looked visibly upset during Prime Minister's Questions, with a spokesperson claiming she had been affected by a \"personal matter\". A day earlier, Sir Keir's controversial welfare bill was passed despite a sizeable rebellion from Labour MPs, with major U-turns meaning a new £5bn black hole has appeared in the country's finances. One senior figure told Rigby that the pair were as \"as close politically\" as any chancellor and prime minister have ever been. \"She is going absolutely nowhere,\" they added.  Ms Reeves's tears sent markets spiralling, with the value of the pound and long-term government bonds falling sharply. Later in the day Sir Keir, said Ms Reeves will be chancellor for a \"very long time to come\". The prime minister said it was \"absolutely wrong\" to suggest her tearful appearance in the Commons related to the welfare U-turn. \"It's got nothing to do with politics, nothing to do with what's happened this week. It was a personal matter for her,\" he said while speaking to the BBC's podcast Political Thinking with Nick Robinson. \"I'm not going to intrude on her privacy by talking to you about that. It is a personal matter.\" Read more from Sky News:Just 25% of public think Starmer will win next electionAnalysis: Emotional Reeves a reminder of tough decisions ahead Asked if she will remain in post, he said: \"She will be chancellor by the time this is broadcast, she will be chancellor for a very long time to come, because this project that we've been working on to change the Labour party, to win the election, change the country, that is a project which the chancellor and I've been working on together.\" He said Ms Reeves has done a \"fantastic job\" and added: \"She and I work together, we think together. In the past, there have been examples - I won't give any specific - of chancellors and prime ministers who weren't in lockstep. We're in lockstep.\""
    },
    {
        "title": "Starmer to set out 10-year vision for NHS",
        "description": "Sir Keir Starmer will set out his 10-year vision for the NHS in what the government says is \"one of the most seismic shifts\" in the health service's history.",
        "url": "https://news.sky.com/story/starmer-to-set-out-10-year-vision-for-nhs-13391633",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-nhs_6955859.jpg?20250703025645",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-02 19:21:00",
        "Headline": "The prime minister has made reforming the NHS one of his main priorities, with public satisfaction with the health service having been decimated since the pandemic.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Sir Keir Starmer will set out his 10-year vision for the NHS in what the government says is \"one of the most seismic shifts\" in the health service's history. He will pledge three main facets of the plan: moving care into the community, digitising the NHS, and a focus on sickness prevention. The prime minister will announce neighbourhood health services will be rolled out across England to improve access to the NHS and to shift care out of overstrained hospitals. PM 'might have to go in months' - politics latest  Sir Keir has already promised thousands more GPs will be trained, and to end the 8am \"scramble\" for an appointment. He also previously said his government will bring the NHS into the digital age, with \"groundbreaking\" new tools to support GPs rolled out over the next two years - including AI to take notes, draft letters and enter data. And he will promise new contracts that will encourage and allow GP practices to cover a wider geographical area, so small practices will get more support. Unite, one of the UK's largest healthcare unions, welcomed the plan cautiously but said staff need to be the focus to ensure people are better looked after. Read more:Hundreds of NHS quangos to be axedHow pilot scheme from Brazil is helping NHS  'Reform or die' Sir Keir said: \"The NHS should be there for everyone, whenever they need it. \"But we inherited a health system in crisis, addicted to a sticking plaster approach, and unable to face up to the challenges we face now, let alone in the future. \"That ends now. Because it's reform or die.\" He said the government's plan \"will fundamentally rewire and futureproof our NHS, so that it puts care on people's doorsteps, harnesses game-changing tech and prevents illness in the first place\". The PM said it would not be an \"overnight fix\", but claimed Labour are \"already turning the tide on years of decline\", pointing towards more than four million extra appointments, 1,900 more GPs, and waiting lists at a two-year low. \"But there's more to come,\" he promised. \"This government is giving patients easier, quicker and more convenient care, wherever they live.\"  Neighbourhood health services The newly announced neighbourhood health services will provide \"pioneering teams\" in local communities, so patients can more conveniently access a full range of healthcare services close to home. Local areas will be encouraged to trial innovative schemes like community outreach door-to-door to detect early signs of illness and reduce pressure on GPs and A&E. The aim is to eventually have new health centres open 12 hours a day, six days a week to offer GP services as well as diagnostics, post-operative care and rehab. They will also offer services like debt advice, employment support, stop smoking help or weight management. More NHS dentists Dentists will also be part of the plan, with dental care professionals part of the neighbourhood teams. Dental \"therapists\" will carry out check-ups, treatments and referrals, while dental nurses could give education and advice to parents or work with schools and community groups. Newly qualified dentists will be required to practice in the NHS for a minimum period, which they have said will be three years."
    },
    {
        "title": "Prosecutors consider more charges against Lucy Letby",
        "description": "Prosecutors are considering whether to bring further criminal charges against Lucy Letby over the deaths of babies at two hospitals where she worked.",
        "url": "https://news.sky.com/story/prosecutors-consider-more-charges-against-lucy-letby-13391159",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-lucy-letby-murder_6529932.jpg?20250109171012",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 08:40:00",
        "Headline": "Letby, 35, is serving 15 whole-life orders after being found guilty of murdering seven children and attempting to murder seven more between June 2015 and June 2016. Letby's lawyers are claiming there is \"overwhelming and compelling evidence\" that her convictions are unsafe.",
        "Content": "Prosecutors are considering whether to bring further criminal charges against Lucy Letby over the deaths of babies at two hospitals where she worked. The Crown Prosecution Service said it had received \"a full file of evidence from Cheshire Constabulary asking us to consider further allegations in relation to deaths and non-fatal collapses of babies at the Countess of Chester Hospital and Liverpool Women's Hospital\". \"We will now carefully consider the evidence to determine whether any further criminal charges should be brought,\" it added. \"As always, we will make that decision independently, based on the evidence and in line with our legal test.\" Letby, 35, was found guilty of murdering seven children and attempting to murder seven more between June 2015 and June 2016 while working in the neonatal unit of the Countess of Chester Hospital and is currently serving 15 whole-life orders. She is understood to have carried out two work placements at Liverpool Women's Hospital, where she trained as a student, between October and December 2012, and January and February 2015. Police said in December that Letby was interviewed in prison as part of an investigation into more baby deaths and non-fatal collapses. A Cheshire Constabulary spokesperson said: \"We can confirm that Cheshire Constabulary has submitted a full file of evidence to the CPS for charging advice regarding the ongoing investigation into deaths and non-fatal collapses of babies at the neo-natal units of both the Countess of Chester Hospital and the Liverpool Women's Hospital as part of Operation Hummingbird.\" Detectives previously said the investigation was looking into the full period of time that Letby worked as a nurse, covering the period from 2012 to 2016 and including a review of 4,000 admissions of babies. Letby's lawyer Mark McDonald said: \"The evidence of the innocence of Lucy Letby is overwhelming,\" adding: \"We will cross every bridge when we get to it but if Lucy is charged I know we have a whole army of internationally renowned medical experts who will totally undermine the prosecution's unfounded allegations.\"  On Tuesday, it was confirmed that three managers at the Countess of Chester hospital had been arrested on suspicion of gross negligence manslaughter in a separate investigation. Read more from Sky News:'Catastrophic failure' that led to Heathrow power outage revealedMan charged with murder of 93-year-old woman in Cornwall Police said the suspects, who occupied senior positions at the hospital between 2015 and 2016, have all been bailed pending further inquiries. There is also an investigation into corporate manslaughter at the hospital, which began in October 2023. A public inquiry has also been examining the hospital's response to concerns raised about Letby before her arrest. In May, it was announced the inquiry's final report into how the former nurse was able to commit her crimes will now be published early next year. Earlier this year, Letby's lawyers called for the suspension of the inquiry, claiming there was \"overwhelming and compelling evidence\" that her convictions were unsafe. In February, an international panel of neonatologists and paediatric specialists told reporters that poor medical care and natural causes were the reasons for the collapses and deaths. Their evidence has been passed to the Criminal Cases Review Commission (CCRC), which investigates potential miscarriages of justice, and Letby's legal team hopes her case will be referred back to the Court of Appeal."
    },
    {
        "title": "Jodie Sheeran: Family of grooming gang victim call for case to be reopened after 'failings' ",
        "description": "The family of a woman who conceived a baby after being groomed by a gang in Stoke-on-Trent are calling for the police to reopen her case, saying she was \"failed all those years ago\".",
        "url": "https://news.sky.com/story/jodie-sheeran-family-of-grooming-gang-victim-call-for-case-to-be-reopened-after-failings-13391559",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sheeran-jodie_6955668.jpg?20250702174016",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 16:23:00",
        "Headline": "Jodie Sheeran had a baby after becoming a victim of a grooming gang. Now, her son has joined his grandparents in fighting for justice.",
        "Content": " The family of a woman who conceived a baby after being groomed by a gang in Stoke-on-Trent are calling for the police to reopen her case, saying she was \"failed all those years ago\". Jodie Sheeran, then aged 15, was allegedly taken to a hotel and raped in November 2004. She is believed to have been groomed by a group of young men of Pakistani heritage for a year beforehand. Jodie's son, Jayden, was born nine months after the attack. Following the allegation, a man was charged, but the case was dropped the day before the trial was due to start in September 2005. Jodie died in November 2022 from an alcohol-related death. Speaking on The UK Tonight with Sarah-Jane Mee, Jodie's mother Angela has welcomed the national grooming gangs inquiry, saying: \"This could be my chance to get justice for Jodie… I've fought so long.\" As part of the inquiry, more than 800 cold cases will be followed up on by the National Crime Agency (NCA). And Angela is calling for Jodie's to be one of them. \"I'm just hoping that poor Jodie is included,\" she said. \"Because they just keep telling me she's dead and there's nothing they can do, it's her word against his. But I don't want to forget Jodie. \"Just because she's dead, it shouldn't mean that she doesn't matter. \"She should be with us because they failed her all those years ago,\" Angela added. Angela and Jodie's father, David, say there were multiple failings when Jodie's case was first investigated. The case went to trial but before proceedings were due to begin, a police officer knocked on the family's door to tell them the charges had been dropped. Jodie's father David said the family were told this was because of the teenager's \"reckless lifestyle\" and that they were later told their daughter was \"an unreliable witness\". \"They bottled it, they were scared of being called racist,\" he told Sky News. The family say they never received any formal communication on why the charges were dropped. A Crown Prosecution Service spokesperson said: \"The failure in 2005 to explain to Jodie and her family why her case was discontinued was wrong. This should not have happened, and we are profoundly sorry for the devastating consequences this has had. \"Though the records from 2005 no longer exist, we worked carefully in 2019 to review the available evidence from police files, and a separate prosecutor concluded that there was insufficient evidence to charge the suspect with rape. We wrote to Jodie explaining this decision. \"Subsequently, as part of our handling of a complaint in 2023, we reviewed the available evidence again and concluded that there was insufficient evidence to support a prosecution for either rape or sexual assault - which we communicated to Jodie's family. \"The way the CPS handles these cases has changed significantly over the last two decades; we have since established a dedicated Organised Child Sexual Abuse Unit to tackle these awful crimes and recruited victim liaison officers across the country so every victim has a dedicated point of contact. \"But we recognise these improvements bring little comfort to Jodie's family - and we continue to offer them our deepest condolences for the loss they have endured.\" 'I felt nothing but loved' by my mum, says Jodie's son Jodie's son Jayden has now joined his grandparents in fighting for justice. \"In primary school, I was questioning who I am and what am I,\" he said. \"Why am I with this family when I'm completely different to them? \"Friends used to ask me in primary school, 'why are you a different colour to your nan and grandad', 'why don't you see your mum? Why don't you see your dad?'.\" \"I know my mum did everything she could for me,\" he said. \"When I was with her, I felt nothing but loved.\" Jayden said he knows who his father is and saw him locally just two weeks ago, \"but he didn't even recognise me.\" Read more from Sky News:Prosecutors consider more charges against Lucy LetbyMan charged with murder of 93-year-old  In a statement issued to Sky News, Staffordshire Police said it met with Angela Sheeran in both 2023 and 2024 to discuss her daughter's case. It said: \"One suspect was identified and, while several reviews have been conducted, including speaking to potential witnesses and victims that Mrs Sheeran provided contact details for, we regret that no new evidence has emerged that would allow us to take further action at this time.\""
    },
    {
        "title": "MPs vote to proscribe Palestine Action as terrorist organisation",
        "description": "MPs have voted to proscribe Palestine Action as a terrorist organisation after the group targeted an RAF base and an Israeli defence company's UK headquarters.",
        "url": "https://news.sky.com/story/mps-approve-plans-to-proscribe-palestine-action-as-terrorist-organisation-13391291",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brandon-palestine-action_6954446.jpg?20250701125410",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 07:03:00",
        "Headline": "The legislation was passed by the vast majority of MPs. However, several argued that proscribing the group \"sets a dangerous precedent for political dissent\".",
        "Content": "MPs have voted to proscribe Palestine Action as a terrorist organisation after the group targeted an RAF base and an Israeli defence company's UK headquarters. The legislation passed with 385 MPs voting to proscribe the group, while 26 voted against the move. The amendment to the Terrorism Act 2000 to include Palestine Action and two white supremacist groups, Maniacs Murder Cult and Russia Imperial Movement, will go to the House of Lords on Thursday and become law at midnight on 9 July if it passes through successfully. Politics latest: PM tells chancellor she has his complete support It means it will become a criminal offence - punishable by up to 14 years in prison - to be a member of the three groups or to support them, if any legal challenges by the groups prove to be unsuccessful. Security minister Dan Jarvis told MPs protesters expressing support for Palestine \"have always been able to, and can continue to do so\". He said: \"Palestine Action is not a legitimate protest group. \"People engaged in lawful protest don't need weapons. People engaged in lawful protest do not throw smoke bombs and fire pyrotechnics around innocent members of the public. \"And people engaged in lawful protest do not cause millions of pounds of damage to national security infrastructure, including submarines and defence equipment for NATO.\" However, several Labour MPs made impassioned speeches about why they think Palestine Action should not be a terrorist organisation, and raised concerns it was grouped in with the other two. They argued that proscribing the group \"threatens basic freedoms and sets a dangerous precedent for political dissent\". Independent MP Zarah Sultana, a former Labour MP, said: \"To equate a spray can of paint with a suicide bomb isn't just absurd, it is grotesque. \"It is a deliberate distortion of the law to chill dissent, criminalise solidarity and suppress the truth.\" Read more:Two more people arrested over damage to RAF aircraftWhat does being proscribed mean? Palestine Action is seeking a legal challenge against the government's bid to proscribe it, with a hearing expected on Friday to decide whether its proscription can be temporarily blocked, pending further proceedings to decide whether a legal challenge can be brought. Members of Palestine Action are accused of entering RAF Brize Norton in Oxfordshire on 20 June and vandalising two aircraft with red paint. Five people have been arrested over the incident on suspicion of a terror offence. A security review was launched across the \"whole defence estate\" following the breach."
    },
    {
        "title": "Princess of Wales reveals pressure to put on 'brave face' after cancer diagnosis",
        "description": "The Princess of Wales has spoken of the pressure to put on a \"brave face\" after being diagnosed with cancer and the intense expectations to \"crack on, get back to normal\" once treatment is finished.",
        "url": "https://news.sky.com/story/princess-of-wales-reveals-pressure-to-put-on-brave-face-after-cancer-diagnosis-13391477",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-princess-of-wales_6955303.jpg?20250702123417",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-07-02 13:35:00",
        "Headline": "What felt like her most personal and extensive public reflections on her recovery journey to date came as she met fellow patients at a cancer wellbeing centre at Colchester Hospital.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The Princess of Wales has spoken of the pressure to put on a \"brave face\" after being diagnosed with cancer and the intense expectations to \"crack on, get back to normal\" once treatment is finished. What felt like her most personal and extensive public reflections on her recovery journey to date came as she met fellow patients at a cancer wellbeing centre at Colchester Hospital, helping to plant roses in a garden designed to help visitors find peace. It follows recent media coverage about her decision not to attend Royal Ascot two weeks ago. The Princess is in remission from cancer and the palace has consistently insisted there would be flexibility around her public engagements as she continues her recovery. Appearing to address the issue herself, Kate said: \"There is a whole phase when you finish your treatment. Everybody expects you to be better - go. You're done, you should be back. But it's not the case at all.\"  Speaking to other cancer patients and volunteers, she added: \"You put on a sort of brave face, stoicism through treatment, treatment's done, then it's like 'I can crack on, get back to normal', but actually the phase afterwards is really difficult. You're not necessarily under the clinical team any longer, but you're not able to function normally at home as you perhaps once used to.\" Describing a first diagnosis as \"a very scary journey\", she explained how in recovery it feels like \"you have to find your new normal and that takes time\". \n                  Dermot Murnaghan: Former Sky News presenter diagnosed with stage four prostate cancer\n                 \n                  New leukaemia treatment hailed as 'milestone' in cancer management\n                 \n                  Cancer patients missing holidays or travelling uninsured amid unfair insurance costs, charity says\n                 Speaking to a volunteer who had also been through her own cancer diagnosis, Kate said: \"It's life-changing for anyone, through first diagnosis or post-treatment and things like that, it is a life-changing experience both for the patient but also for the families as well. \"And actually, it sometimes goes unrecognised, you don't necessarily, particularly when it's the first time, appreciate how much impact it is going to have. You have to find your new normal and that takes time… and it's a rollercoaster, it's not one smooth plain, which you expect it to be. But the reality is it's not, you go through hard times.\" The wellbeing centre was built outside of the main hospital building, but close enough that patients can easily find it.  Many newly diagnosed patients at Colchester Hospital now visit the centre immediately for counselling and advice. They also provide holistic treatments, including reflexology. Read more:End of the line for royal trainIs anyone listening to William?New Kate waxwork unveiled The princess, speaking to therapist Amanda Green during a walkabout in heavy rain afterwards, said she had not yet tried reflexology but had had acupuncture as part of her own health journey.  Repeatedly praising the focus on \"mind, body and spirit\" that the centre provides, Kate said \"someone to help talk you through that, show you and guide you through that sort of phase that comes after treatment, I think is really valuable.\" Talking about how difficult it can be for patients to know where to find support she said: \"To have a place like this, to have the support network, through creativity and singing or gardening, whatever it might be, is so valuable and it's great this community has it, it would be great if lots of communities had this kind of support.\" The visit came with a donation of 50 'Catherine's Rose' plants, which she helped to plant in the garden surrounding the wellbeing centre. Named for the princess by the Royal Horticultural Society, the funds from sales of the plants go to the Royal Marsden Cancer Charity."
    },
    {
        "title": "Former head of Royal Navy sacked ",
        "description": "The former head of the Royal Navy Admiral Sir Ben Key has been sacked following an investigation.",
        "url": "https://news.sky.com/story/former-head-of-royal-navy-sacked-13391552",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-admiral-sir-ben-key_5839905.jpg?20220719211556",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 16:12:00",
        "Headline": "The service of the former First Sea Lord has ended in disgrace after an investigation found he had failed to meet the \"standards expected\".",
        "Content": "The former head of the Royal Navy Admiral Sir Ben Key has been sacked following an investigation. Sir Ben stepped back from his role as First Sea Lord in May after an investigation was launched into an alleged relationship with a female colleague. A full investigation has resulted in the termination of his service and commission, the Ministry of Defence said. In a statement today, Chief of Defence Staff Admiral Sir Tony Radakin said: \"We expect the highest standards of behaviour from our service personnel and our civil servants. \"We investigate all allegations of inappropriate behaviour and will take robust action against anyone found to have fallen short of our standards, regardless of their seniority.\" Sir Ben 'sorry to those I have hurt' In a statement after his sacking was announced, Sir Ben said: \"Serving as First Sea Lord has been one of the greatest privileges of my life, and I pay tribute to the dedicated and professional officers, sailors, Royal Marines and civil servants who make up the Royal Navy. \n                  Four charged after £7m of damage caused to aircraft at RAF Brize Norton\n                 \n                  Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News\n                 \n                  Starmer to set out 10-year vision for NHS\n                 \"I deeply regret my conduct in the spring of last year, which fell well below the standard I set for myself and that which I set for the Royal Navy. As such, I fully accept the decision of the Defence Council. \"I am very sorry to those I have hurt personally, and I apologise to everyone who serves with the Royal Navy. \"Finally, I am very grateful for the support of my wife, family and friends during a very difficult time.\" It is not thought that the person involved was in his immediate chain of command. But as head of the Navy, the First Sea Lord is in overall charge of all naval personnel. Sir Ben, who was appointed as First Sea Lord in 2021, had placed a strong focus on eliminating unacceptable behaviour in the Navy. In 2024, he declared \"zero tolerance for unacceptable behaviours\". In 2022, he said: \"Those who do not wish to serve in accordance with the values and standards of life in the United Kingdom's armed forces will be removed. \"There is no place for you.\" Read more from Sky News:'Catastrophic failure' that led to Heathrow power outage revealedMan charged with murder of 93-year-old woman in Cornwall Sir Ben was succeeded by General Sir Gwyn Jenkins of the Royal Marines. Educated at Bromsgrove School, in Worcestershire, Admiral Sir Ben joined the navy in 1984 as a university cadet. He qualified as both helicopter aircrew and as a principal warfare officer. As a junior officer, he saw service around the world in a variety of frigates and destroyers. He was made a Commander of the British Empire (CBE) in 2016 and a Knight Commander of the Order of the Bath (KCB) in 2021."
    },
    {
        "title": "Bob Vylan to no longer headline festival in Manchester after Glastonbury controversy",
        "description": "Punk rap duo Bob Vylan will no longer headline the Radar Festival in Manchester days after leading chants of \"death to the IDF\" at Glastonbury.",
        "url": "https://news.sky.com/story/bob-vylan-to-no-longer-headline-festival-in-manchester-after-glastonbury-controversy-13391486",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952866.jpg?20250628221842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-02 14:00:00",
        "Headline": "The punk rap due are facing two police investigations: one for chants at Glastonbury and another over comments allegedly made during a concert in London in May. ",
        "Content": "Punk rap duo Bob Vylan will no longer headline the Radar Festival in Manchester days after leading chants of \"death to the IDF\" at Glastonbury. The performance on the West Holts Stage on Saturday was livestreamed on the BBC - leading the corporation to apologise as it described the chants referencing the Israeli military as \"antisemitic\" and \"unacceptable\". Avon and Somerset Police announced on Monday that it had opened a criminal investigation after reviewing footage of performances at Glastonbury by Bob Vylan and Irish hip hop trio Kneecap. The Metropolitan Police has now said it has launched a separate investigation after Bob Vylan allegedly called for \"death to every single IDF soldier out there\" at a gig one month before Glastonbury. \"Officers are investigating comments allegedly made during a concert at Alexandra Palace earlier this year,\" A Met spokesperson said on Wednesday. \"The decision to investigate follows the emergence of footage which appears to have been filmed at the venue on 28 May 2025.\" The pair had supported Iggy Pop at the London venue. In a post on Instagram on Wednesday, the Radar Festival, which takes place at the O2 Victoria Warehouse in Manchester, wrote: \"Bob Vylan will not be appearing at Radar Festival this weekend.\" The festival has not explained why the duo will no longer appear on Saturday night - with its line-up now reading \"headliner TBC\". In response, the group shared the festival's statement on their Instagram story, adding the caption: \"Silence is not an option. We will be fine, the people of Palestine are hurting. Manchester we will be back.\" It comes after the band were barred from the US, where they were due to tour in autumn with performances in Chicago, Brooklyn and Philadelphia. US deputy secretary of state Christopher Landau said the duo's visas were revoked for their \"hateful tirade at Glastonbury\". The band have also been pulled from an upcoming performance at a German music venue. In a statement on Tuesday, the duo said they were being \"targeted for speaking up\" after police opened their investigation. They wrote: \"We are not for the death of Jews, Arabs or any other race or group of people. \"We are for the dismantling of a violent military machine. A machine whose own soldiers were told to use \"unnecessary lethal force\" against innocent civilians waiting for aid. \"A machine that has destroyed much of Gaza.\" The statement added: \"We, like those in the spotlight before us, are not the story. \"We are a distraction from the story. And whatever sanctions we receive will be a distraction.\" Read more:Chief rabbi condemns BBC over Bob Vylan chantsBob Vylan have US visas revokedCulture secretary Lisa Nandy hits out at BBC During the performance on Saturday, Bobby Vylan, one half of the duo, also led his crowd in chants that included \"Free, free Palestine\". Bob Vylan performed on the West Holts Stage slot directly before Kneecap, whose member Liam Og O hAnnaidh, also known as Mo Chara, appeared in court in June charged with a terror offence. He is accused of displaying a flag in support of Hezbollah, a proscribed organisation in the UK, at a gig last year. Kneecap also led the Glastonbury crowd in \"Free Palestine\" chants. The BBC has faced strong criticism for continuing to livestream the Bob Vylan performance on iPlayer with on-screen warnings about discriminatory language. It has since been revealed that BBC director-general Tim Davie was at Glastonbury when the chants were broadcast. A BBC spokesperson said: \"The director-general was informed of the incident after the performance and at that point he was clear it should not feature in any other Glastonbury coverage.\" Culture Secretary Lisa Nandy criticised the BBC over its decision not to pull the Bob Vylan livestream during the chants on Saturday and said there is \"a problem of leadership\" at the corporation. The group was formed in Ipswich in 2017, and are known for addressing political issues in their albums, including racism, masculinity and class. The group are scheduled to perform at the Boardmasters surfing and music festival in Newquay, Cornwall in August."
    },
    {
        "title": "Rise in Gaza deaths linked to aid distributions by controversial group",
        "description": "Sky News analysis shows that aid distributions by the Gaza Humanitarian Foundation (GHF) are associated with a significant increase in deaths.",
        "url": "https://news.sky.com/story/rise-in-gaza-deaths-linked-to-aid-distributions-by-controversial-group-13391481",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-dandf-teaser-aid_6955653.jpg?20250702172834",
        "type": "World",
        "Author": "Ben van der Merwe, Saywah Mahmood and Michelle Inez Simon, Data &amp; Forensics Unit",
        "Date Published": "2025-07-02 13:54:00",
        "Headline": "New analysis by Sky News shows that deaths in Gaza are increasing when there are more aid distributions by controversial US and Israeli-backed group.",
        "Content": "By Ben van der Merwe, Saywah Mahmood and Michelle Inez Simon, Data & Forensics Unit  Sky News analysis shows that aid distributions by the Gaza Humanitarian Foundation (GHF) are associated with a significant increase in deaths. Warning: This article contains descriptions of people being killed and images of blood on a hospital floor. The US and Israeli-backed group has been primarily responsible for aid distribution since Israel lifted its 11-week blockade of the Gaza Strip last month. The GHF distributes aid from four militarised Secure Distribution Sites (SDSs) - three of which are in the far south of the Gaza Strip. Under the previous system, the UN had distributed aid through hundreds of sites across the territory. According to Gaza's health ministry, 600 Palestinians have been killed while seeking aid from GHF sites, which charities and the UN have branded \"death traps\". The UN put the figure at 410, but has not updated this number since 24 June. Both the UN and health ministry source their figures from hospitals near the aid sites. Speaking to Sky News, GHF chief Johnnie Moore disputed that these deaths were connected with his organisation's operations. \"Almost anything that happens in the Gaza Strip is going to take place in proximity to something,\" he said. \"Our effort is actually working despite a disinformation campaign, that is very deliberate and meant to shut down our efforts. \"We just want to feed Gazans. That's the only thing that we want to do.\" However, new analysis by Sky's Data & Forensics Unit shows that deaths in Gaza have spiked during days with more GHF distributions. On days when GHF conducts just two distributions or fewer, health officials report an average of 48 deaths and 189 injuries across the Gaza Strip. On days with five or six GHF distributions, authorities have reported almost three times as many casualties. Out of 77 distributions at GHF sites between 5 June and 1 July, Sky News found that 23 ended in reports of bloodshed (30%). At one site, SDS4 in the central Gaza Strip, as many as half of all distributions were followed by reports of fatal shootings. Sky News spoke to one woman who had been attending SDS4 for 10 days straight. \"I witnessed death first-hand - bodies lay bleeding on the ground all around me,\" says Huda. \"This is not right. Food should be delivered to UN warehouses, and this entire operation must be shut down.\" Huda says that the crowds are forced to dodge bombs and bullets \"just to get a bag of rice or pasta\". \"You may come back, you may not,\" she says. \"I was injured by shrapnel in my leg. Despite that, I go back, because we really have nothing in our tent.\" One of the deadliest incidents at SDS4 took place in the early hours of 24 June. According to eyewitnesses, Israeli forces opened fire as people advanced towards aid trucks carrying food to the site, which was due to open. \"It was a massacre,\" said Ahmed Halawa. He said that tanks and drones fired at people \"even as we were fleeing\". At least 31 people were killed, according to medics at two nearby hospitals. Footage from that morning shows the floor of one of the hospitals, al Awda, covered in blood. The IDF says it is reviewing the incident.  Issues of crowd control  Unnamed soldiers who served near the aid sites told Israeli newspaper Haaretz that they were instructed to use gunfire as a method of crowd control. An IDF spokesperson told Sky News that it \"strongly rejected\" the accusations that its forces were instructed to deliberately shoot at civilians. \"To be clear, IDF directives prohibit deliberate attacks on civilians,\" the spokesperson said, adding that the incidents are \"being examined by the relevant IDF authorities\". Eyewitness testimony and footage posted to social media suggest that crowd control is a frequent problem at the sites. The video below, uploaded on 12 June, shows a crowd rushing into SDS1, in Gaza's far southwest. What sounds like explosions are audible in the background. Footage from the same site, uploaded on 15 June, shows Palestinians searching for food among hundreds of aid parcels scattered across the ground. Sam Rose, the director of UNRWA operations in Gaza, describes the distribution process as a \"free-for-all\". \"What they're doing is they're loading up the boxes on the ground and then people just rush in,\" he says. Sky News has found that the sites typically run out of food within just nine minutes. In a quarter of cases (23%), the food is finished by the time the site was due to officially open.  Confusing communications  Sky News analysis suggests that the issue may be being compounded by poor communications from GHF. Between 19 June and 1 July, 86% of distributions were announced with less than 30 minutes' notice. One in five distributions was not announced at all prior to the site opening. The GHF instructs Palestinians to take particular routes to the aid centres, and to wait at specified locations until the official opening times. The map for SDS1 instructs Palestinians to take a narrow agricultural lane that no longer exists, while the maps for SDS2 and SDS3 give waiting points that are deep inside IDF-designated combat zones. The maps do not make the boundaries of combat zones clear or specify when it is safe for Palestinians to enter them. The same is true for SDS4, the only distribution site outside Gaza's far south. Its waiting point is located 1.2 miles (2km) inside an IDF combat zone. The official map also provides no access route from the northern half of Gaza, including Gaza City, across the heavily militarised Netzarim corridor. \"They don't know what they're doing,\" says UNRWA's Sam Rose. \"They don't have anyone working on these operations who has any experience of operating, of administering food distributions because anyone who did have that experience wouldn't want to be part of it because this isn't how you treat people.\" Once the sites are officially open, Palestinians are allowed to travel the rest of the way. The distance from waiting point to aid site is typically over a kilometre, making it difficult for Palestinians to reach the aid site before the food runs out. The shortest distance is at SDS4 - 689m. At a pace of 4km per hour, this would take around 10 minutes to cover. But of the 18 distributions at this site which were announced in advance, just two lasted longer than 10 minutes before the food ran out. \"We don't have time to pick anything up,\" says Huda, who has been visiting SDS4 for the past 10 days. In all that time, she says, all she had managed to take was a small bag of rice. \"I got it from the floor,\" she says. \"We didn't get anything else.\" More than 200 charities and non-governmental organisations have called for the closure of GHF and the reinstatement of previous, UN-led mechanisms of aid distribution. In a joint statement issued on 1 July, some of the world's largest humanitarian groups accused the GHF of violating international humanitarian principles. They said the scheme was forcing two million people into overcrowded, militarised zones where they face daily gunfire. Additional reporting by OSINT producers Sam Doak and Lina-Serene. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Gaza ceasefire proposal a significant moment - but there are still many unanswered questions",
        "description": "In the long Gaza war, this is a significant moment.",
        "url": "https://news.sky.com/story/gaza-ceasefire-proposal-a-significant-moment-but-there-are-still-many-unanswered-questions-13391292",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6879194.jpg?20250407183847",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-07-02 07:09:00",
        "Headline": "We know Israel has agreed to a 60-day ceasefire due to its domestic politics, but it is not clear what proposals Hamas must accept and what is expected of them in return.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  In the long Gaza war, this is a significant moment. For the people of Gaza, for the Israeli hostages and their families - this could be the moment it ends. But we have been here before, so many times. The key question - will Hamas accept what Israel has agreed to: a 60-day ceasefire? At the weekend, a source at the heart of the negotiations told me: \"Both Hamas and Israel are refusing to budge from their position - Hamas wants the ceasefire to last until a permanent agreement is reached. \"Israel is opposed to this. At this point, only President Trump can break this deadlock.\" The source added: \"Unless Trump pushes, we are in a stalemate.\" Israel-Gaza - live updates  The problem is that the announcement made now by Donald Trump - which is his social-media-summarised version of whatever Israel has actually agreed to - may just amount to Israel's already-established position. We don't know the details and conditions attached to Israel's proposals. Would Israeli troops withdraw from Gaza? Totally? Or partially? How many Palestinian prisoners would they agree to release from Israel's jails? And why only 60 days? Why not a total ceasefire? What are they asking of Hamas in return? We just don't know the answers to any of these questions, except one.  We do know why Israel wants a 60-day ceasefire, not a permanent one. It's all about domestic politics. If Israeli Prime Minister Benjamin Netanyahu were to agree now to a permanent ceasefire, the extreme right-wingers in his coalition would collapse his government. Itamar Ben-Gvir and Bezalel Smotrich have both been clear about their desire for the war to continue. They hold the balance of power in Mr Netanyahu's coalition. Read more:British-Israeli soldier killed in Gaza'Almost 60 killed in Israeli strikes' If Mr Netanyahu instead agrees to just 60 days - which domestically he can sell as just a pause - then that may placate the extreme right-wingers for a few weeks until the Israeli parliament, the Knesset, is adjourned for the summer. It is also no coincidence that the US president has called for Mr Netanyahu's corruption trial to be scrapped. Without the prospect of jail, Mr Netanyahu might be more willing to quit the war, safe in the knowledge that focus will not shift immediately to his own political and legal vulnerability."
    },
    {
        "title": "Dalai Lama says he plans to reincarnate - but how is a successor chosen and why is it controversial?",
        "description": "The Dalai Lama says he will have a successor after his death, ending years of speculation over whether he would be the last Tibetan spiritual leader.",
        "url": "https://news.sky.com/story/dalai-lama-says-he-plans-to-reincarnate-but-how-is-a-successor-chosen-and-why-is-it-controversial-13391392",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-dalai-lama-tibet-china_6852885.jpg?20250702190445",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-02 11:13:00",
        "Headline": "The Dalai Lama marked his 90th birthday by making his succession plans clear. But there could end up being rival spiritual leaders - one appointed by Beijing, and one by senior monks loyal to the current Dalai Lama.",
        "Content": " The Dalai Lama says he will have a successor after his death, ending years of speculation over whether he would be the last Tibetan spiritual leader. Tenzin Gyatso, who became the 14th reincarnation of the Dalai Lama in 1940, made the announcement at prayer celebrations on Monday, which marked his 90th birthday in the Tibetan calendar. His birthday in the Gregorian calendar is this Sunday. He said the next Dalai Lama should be found in line with Buddhist traditions, signalling that China should stay away from the process of identifying his successor. But China's communist authorities have long insisted they should be the ones to select the next reincarnated figure. Here, we look at the tensions with China, how a successor is chosen and what the spiritual leader's role is. Tensions since Dalai Lama fled Tibet The Dalai Lama and thousands of other Tibetans fled to India after a failed uprising against Chinese Communist rule in 1959. He has been living in the town of Dharamshala in India since then, helping establish a democratic government-in-exile while also travelling the world to advocate autonomy for the Tibetan people. Beijing has campaigned for decades to counteract the international influence of the Dalai Lama, whose world travels draw attention to the Communist government's often harsh 60-year rule over Tibet. How is the next Dalai Lama chosen? To understand why there is anxiety over the next Dalai Lama, it's important to understand how the next one is chosen - or rather, identified. Tibetan Buddhists believe the Dalai Lama can choose the body into which he is reincarnated. The search for a Dalai Lama's reincarnation begins only upon the incumbent's death, and it can take several years. In the past, the successor has been identified by senior monastic disciples while they are still a baby, based on spiritual signs and visions, and they have been groomed to take the reins. Tenzin Gyatso was identified as a baby in 1937, and formally recognised as the 14th Dalai Lama two years later before being enthroned in 1940. The searchers from the Tibetan government were convinced when the toddler identified belongings of the 13th Dalai Lama with the phrase, \"It's mine, it's mine\". What is the Dalai Lama's succession stance? He said in 2011 that the institution of the Dalai Lama did not necessarily have to continue, and that he would leave it up to the Tibetan Buddhist community. Then in his book Voice For The Voiceless, which was published earlier this year, he wrote that his successor would be born in the \"free world\", meaning outside China. He made his succession plans more explicit in a recorded statement that was televised at a religious gathering of Buddhist monks in Dharamshala on 30 June, saying the next Dalai Lama should be found and recognised as per past Buddhist traditions, while indicating China should not be involved. He stated reincarnation lies solely with the Gaden Phodrang Trust - a non-profit he founded in 2015 that oversees matters related to the spiritual leader and the institute of the Dalai Lama. \"No one else has any such authority to interfere in this matter,\" he said, adding that the search for a future Dalai Lama should be carried out in \"accordance with past tradition.\" Hours after the Dalai Lama's latest announcement, a spokesperson for the Chinese foreign ministry reiterated that his succession must be approved by China. Read more:Trump's USAID cuts 'could lead to 14 million deaths'Thai PM suspended and faces sack over leaked phone call Before the Dalai Lama's announcement, the Tibetan Buddhist community had rallied for him to change his stance and pledge that there would be a successor, with many fearing the Chinese authorities would name their own reincarnation if he didn't. Many believe the dispute will mean there are eventually rival Dalai Lamas - one appointed by Beijing, and one by senior monks loyal to the current Dalai Lama. What does the Dalai Lama do? The Dalai Lama is believed to be the manifestation of Chenrezig or Avalokiteshvara, the god of compassion and the patron saint of Tibet, who chose to reincarnate to serve the people. There have been 14 incarnations since the creation of the Tibetan Buddhist institution in 1587. Dalai Lama means Ocean of Wisdom, and Tibetans normally refer to him as Yeshin Norbu, the Wish-Fulfilling Gem, or simply Kundun, meaning The Presence. He has travelled the world in efforts to promote peace, and in 1989 was awarded the Nobel Peace Prize for his non-violent struggle for the liberation of Tibet. The Dalai Lama once headed the self-proclaimed Tibetan government-in-exile, before relinquishing his political role in 2011 and allowing a democratic president to take his place. He said he was retiring politically to focus solely on his spiritual affairs, ending a 368-year-old tradition of the Dalai Lamas functioning as both the spiritual and temporal head of Tibet. He has also authored or co-authored more than 110 books."
    },
    {
        "title": "Snake captured on passenger plane - as expert reveals how it got there",
        "description": "A flight in Australia was delayed for two hours after a stowaway snake was found in the plane's cargo hold.",
        "url": "https://news.sky.com/story/snake-on-a-plane-flight-delayed-for-two-hours-as-catcher-comes-to-the-rescue-13391249",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-snake-plane_6954978.jpg?20250702044110",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-02 03:16:00",
        "Headline": "The reptile was found as passengers were boarding Virgin Australia Flight VA337 at Melbourne Airport bound for Brisbane.",
        "Content": " A flight in Australia was delayed for two hours after a stowaway snake was found in the plane's cargo hold. The reptile was found as passengers were boarding Virgin Australia Flight VA337 at Melbourne Airport bound for Brisbane. Snake catcher Mark Pelley said he thought it could be venomous when he approached it in the darkened hold. But it turned out to be a harmless 60cm green tree snake. \"It wasn't until after I caught the snake that I realised that it wasn't venomous. Until that point, it looked very dangerous to me,\" Mr Pelley said. He said when he entered the cargo hold, the snake was half hidden behind a panel and he feared it could flee deeper into the plane. \"I had one chance to grab it, and if it escaped past me it would have gone into the panels, and then that would have been extremely hard to catch,\" he told Sky News. \"Snakes are very fast-moving, thin and agile,\" he added. Mr Pelley said he told an aircraft engineer and airline staff they would have to evacuate the aircraft if the snake disappeared inside the plane. \"I said to them if I don't get this in one shot, it's going to sneak through the panels and you're going to have to evacuate the plane because at that stage I did not know what kind of snake it was,\" he explained in a separate interview. \"But thankfully, I got it on the first try and captured it,\" he added. \"If I didn't get it that first time, the engineers and I would be pulling apart a [Boeing] 737 looking for a snake still right now.\" Read more from Sky News:Trump claims Israel has agreed to 60-day ceasefire in Gaza'Diddy' holds head in his hands as jury reaches partial verdict Mr Pelley said because the snake is native to the Brisbane region he suspects it came on board inside a passenger's luggage and escaped. \"It's actually very uncommon for snakes to be on the plane,\" he told Sky News. For quarantine reasons the snake cannot be returned to the wild. The animal, a protected species, has been given to a Melbourne vet to find a home with a licensed snake keeper."
    },
    {
        "title": "Sean 'Diddy' Combs denied bail after being convicted over prostitution-related offences",
        "description": "Sean \"Diddy\" Combs has been found guilty of transportation for prostitution following a landmark trial in New York - but cleared of more serious charges of sex trafficking and racketeering conspiracy.",
        "url": "https://news.sky.com/story/sean-diddy-combs-guilty-of-prostitution-offences-but-cleared-of-sex-trafficking-and-racketeering-13389065",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-2017_6907253.jpg?20250625170536",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-02 14:15:00",
        "Headline": "Jurors in the high-profile trial of hip-hop mogul Sean \"Diddy\" Combs have reached their verdict after seven weeks of evidence.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Sean \"Diddy\" Combs has been found guilty of transportation for prostitution following a landmark trial in New York - but cleared of more serious charges of sex trafficking and racketeering conspiracy. The hip-hop mogul was accused by prosecutors of abusing and coercing three alleged victims, including his former long-term partner, singer and model Cassie Ventura, and other crimes including kidnapping, arson and blackmail. Jurors decided not all the allegations were proven - but Combs still faces several years in prison after being convicted of transporting people across the US, including Cassie and another former girlfriend \"Jane\", and paying male escorts to engage in sexual encounters. However, with the not guilty verdict on three other more serious charges - racketeering conspiracy and two of sex trafficking - the 55-year-old has avoided a maximum possible sentence of life behind bars. Despite a request by his defence team, he was denied bail ahead of sentencing - which has been scheduled for Friday 3 October. Marc Agnifilo, part of Diddy's defence team, described the ruling as \"a victory of all victories\". Outside the courthouse, he said the jury \"got the situation right, or certainly right enough\". Another of his lawyers, Nicole Westmoreland, said: \"He actually battled for his freedom, for his innocence, and he did it. \"And, you know, a lot of times, people are too afraid to do it. Today is a major win to show what the system can do.\" The mixed result from the jury came not long into their third day of deliberations. In the courtroom in Manhattan, there were cheers from Combs's family - and the rapper himself held his hands up in a prayer motion, looking at the jury, and hugged his defence lawyer Teny Geragos. His mood seemed very different to just a day earlier - when he learned the jury had reached a verdict on four of the five charges, but were split on the racketeering charge. After deliberating for longer on Wednesday, they came to a unanimous decision. As the verdict sunk in, Combs appeared overwhelmed, kneeling at his chair and bowing his head in prayer once again. \"I'll be home soon,\" he said as he faced his family members. \"I love you, Mum.\" The application for bail Combs's defence team argued that as he had been cleared of the most serious charges, he should be bailed ahead of sentencing. His lawyer Marc Agnifilo said he had been a model prisoner and added: \"He's not going to flee. He's been given his life back.\" But prosecutor Maurene Comey argued Combs had a history of violence, which Judge Arub Subramanian agreed with. \"At trial, the defence conceded the defendant's violence in his personal relationships,\" he said. After being denied bail, Combs attempted get the judge's attention - but after consulting with Mr Agnifilo, he did not speak. Cassie 'paved the way' Reacting to the verdict, Cassie's lawyer Douglas H Wigdor said that although jurors did not find Combs guilty of sex-trafficking Cassie, she had \"paved the way\" for the other guilty verdicts. \"By coming forward with her experience, Cassie has left an indelible mark on both the entertainment industry and the fight for justice,\" he said. \"We must repeat - with no reservation - that we believe and support our client, who showed exemplary courage throughout this trial.\" Cassie, who testified heavily pregnant just three weeks before giving birth, displayed \"unquestionable strength\", he added, and \"brought attention to the realities of powerful men in our orbit\". Videos of \"freak off\" sex sessions with male escorts were shown to jurors only during the seven-week trial, with the footage kept private from members of the public and media in court. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs Former employees, along with escorts, hotel staff and police officers were among those to give evidence. Cassie and Jane, who used a pseudonym, also testified. They told the court they were coerced into drug-fuelled \"freak offs\" - which were also referred to as \"hotel nights\" or \"wild king nights\" - with male escorts, and abused throughout their relationships. Combs's defence team presented a very different picture to show that sexual acts, including freak offs, were consensual. They conceded the music star could be violent, had a bad temper and used drugs. He also had multiple relationships at the same time. But crucially, they said, while he was \"not proud\" of some of his behaviour, none of it made him guilty of the charges against him. After hearing evidence of flights and travel for escorts and Cassie and Jane, paid for by Combs, as well as hotel bookings across the US and the Caribbean, jurors found him guilty of the transportation to engage in prostitution charges. However, they did not find that the allegations against the rapper amounted to sex trafficking or racketeering.  The Cassie hotel tape Combs, known variously as Puff Daddy, P Diddy, and Diddy over the years, was once one of the most influential figures in hip-hop - famous as a producer, founder of Bad Boy Records and manager of the late Notorious BIG in the 1990s, as well as a rapper in his own right. As an artist, he won three Grammys during his career, and had hits including I'll Be Missing You, Come With Me, and Bad Boy For Life. In September 2023, he received the \"global icon\" award from MTV and was given the key to New York City at a ceremony in Times Square, just a few miles away from the streets in Harlem where he spent his first years. Allegations first came to prominence in November 2023, when Cassie filed a bombshell lawsuit accusing him of coercing her into unwanted sex sessions, as well as blackmail and several incidences of violence. The suit was settled in 24 hours - for $20m, it emerged during the trial - but months later CNN aired hotel security footage showing Combs punching and kicking Cassie and throwing her to the floor in 2016. He apologised after the video aired, saying: \"I was disgusted when I did it.\" Footage from the hotel incident was shown during the trial. Following the verdict, the rapper now awaits sentencing. He also still faces several civil lawsuits, most of which were filed in the wake of his arrest in September 2024."
    },
    {
        "title": "Bryan Kohberger pleads guilty to murdering four University of Idaho students in 2022",
        "description": "A man has pleaded guilty to murdering four University of Idaho students in November 2022 after agreeing to a deal which means he will likely avoid the death penalty.",
        "url": "https://news.sky.com/story/bryan-kohberger-pleads-guilty-to-murdering-four-university-of-idaho-students-in-2022-13391527",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-idaho-usa_6009693.jpg?20221230180407",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-02 15:27:00",
        "Headline": "Bryan Kohberger had initially denied the murders of Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves before changing his plea.",
        "Content": " A man has pleaded guilty to murdering four University of Idaho students in November 2022 after agreeing to a deal which means he will likely avoid the death penalty. Bryan Kohberger, a 30-year-old former criminal justice student, was arrested at his parents' home in Pennsylvania weeks after the killings following a nationwide search. He was accused of sneaking into the rented home in Moscow, Idaho, which is not far from the university campus, and attacking Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves. Post-mortems showed the four were stabbed multiple times and were likely asleep when they were attacked, though some had defensive wounds. Kohberger has never revealed his motive and it is not clear why he spared two roommates who were in the home. There was also no indication he knew any of the victims, who were all friends. Kohberger previously pleaded not guilty to charges of murder and burglary. However he has now agreed to a plea deal, just weeks before his trial was set to begin in August, in a bid to avoid the death penalty - which prosecutors said they intended to pursue. Despite that, the deal must be approved by Idaho Fourth Judicial District Judge Steven Hippler. Although judges in Idaho can reject plea agreements, such incidents are rare. \"This court cannot require the prosecutor to seek the death penalty, nor would it be appropriate for this court to do that,\" Hippler said. The family of one of the victims, Ms Goncalves, opposed the agreement and said they would seek to stop it. They also argued that any such deal should require Kohberger to make a full confession, detail the facts of what happened and provide the location of the murder weapon. They wrote in a Facebook post on Monday they were \"beyond furious at the State of Idaho\" for offering Kohberger a plea deal. It came as the family of Mr Chapin supported the deal, their spokesperson, said on Tuesday. Read more:Surviving Idaho student 'saw masked man in black clothing'Idaho suspect 'warned after making creepy comments' Meanwhile Ms Mogen's father, Ben Mogen, told CBS News he was relieved by the agreement. \"We can actually put this behind us and not have these future dates and future things that we don't want to have to be at, that we shouldn't have to be at, that have to do with this terrible person,\" he said. \"We get to just think about the rest of lives and have to try and figure out how to do it without Maddie and the rest of the kids.\" Kohberger, who remained expressionless as he entered his guilty pleas, will be sentenced on 23 July. How police caught Kohberger The small farming community of Moscow, in the northern Idaho panhandle, had not had a homicide in about five years when the murders took place. The killings grabbed headlines around the world and set off a nationwide hunt. Police arrested Kohberger after investigators said they matched his DNA to genetic material recovered from a knife sheath found at the crime scene. They were also able to access mobile phone data to pinpoint his movements on the night of the killings. Online shopping records showed that Kohberger had purchased a military-style knife months earlier - as well as a sheath like the one found at the scene. At the time of the murders, Kohberger was a criminal justice graduate student at nearby Washington State University who had just completed his first semester and was a teaching assistant."
    },
    {
        "title": "Bryan Kohberger: Last-minute plea deal in Idaho student murders case sparks media storm",
        "description": "The fatal stabbing of four university students in their off-campus home in Idaho stunned America.",
        "url": "https://news.sky.com/story/bryan-kohberger-last-minute-plea-deal-in-idaho-student-murders-case-sparks-media-storm-13391502",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bryan-kohberger-idaho_6955631.jpg?20250702194700",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-07-02 14:47:00",
        "Headline": "An 11th-hour deal between prosecution and defence has divided the families of the victims.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n The fatal stabbing of four university students in their off-campus home in Idaho stunned America. But two-and-a-half years later, a plea bargain in the case has triggered a media storm. It already had all the elements - four murders, an unlikely suspect, death penalty stakes, reporting restrictions and social media proliferation. But an 11th-hour deal between prosecution and defence has divided the families of the victims, one of them describing it as \"anything but justice\". Kaylee Gonclaves, Xana Kernodle, Madison Mogen and Ethan Chapin from the University of Idaho were stabbed to death in Moscow, Idaho on 13 November 2022. Following an extensive police investigation, authorities charged Bryan Kohberger, 30, a former Washington State University PhD student, with four counts of first-degree murder and burglary. The case against him was largely built on DNA from a knife sheath found at the crime scene, mobile phone location data and surveillance footage. \n                  Bryan Kohberger to plead guilty to murdering four University of Idaho students\n                 \n                  Two firefighters killed after asking man to move his car\n                 \n                  Sniper starts fire then kills two firefighters in 'total ambush'\n                  Prosecutors were seeking the death penalty, but less than a month before his trial, Kohberger was reported to have struck a deal to avoid that. The plea deal will include a sentence of four consecutive life sentences for the murder charges, according to a letter sent to the victims' families. The families of two victims - Ethan Chapin and Madison Mogen - welcomed the plea, conceding that life imprisonment was preferable to years of appeals and delays. But Kaylee Goncalves' family accused prosecutors of \"adding insult to injury\" by rushing the deal without input on it from the families of the victims. Her father, Steve Goncalves, said he wanted a jury to decide on Kohberger's fate and called on the judge to reject the last-minute plea deal. \"This is anything by justice. This is the opposite of our will. There was no majority believing that this was acceptable,\" he told News Nation. Read more Sky News:Jury reaches verdict in Sean 'Diddy' Combs trialEmotional Reeves a reminder of tough decisions ahead Media scrutiny of the plea bargain has been relentless in the United States, with many of the commentators describing it as \"betrayal\" or \"political expedience\". The agreement exposes wider fault lines between victims' rights and prosecutorial authority, the media's role in justice and public trust in the entire judicial process."
    },
    {
        "title": "Gaza ceasefire proposal a significant moment - but there are still many unanswered questions",
        "description": "In the long Gaza war, this is a significant moment.",
        "url": "https://news.sky.com/story/gaza-ceasefire-proposal-a-significant-moment-but-there-are-still-many-unanswered-questions-13391292",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald_6879194.jpg?20250407183847",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-07-02 07:09:00",
        "Headline": "We know Israel has agreed to a 60-day ceasefire due to its domestic politics, but it is not clear what proposals Hamas must accept and what is expected of them in return.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  In the long Gaza war, this is a significant moment. For the people of Gaza, for the Israeli hostages and their families - this could be the moment it ends. But we have been here before, so many times. The key question - will Hamas accept what Israel has agreed to: a 60-day ceasefire? At the weekend, a source at the heart of the negotiations told me: \"Both Hamas and Israel are refusing to budge from their position - Hamas wants the ceasefire to last until a permanent agreement is reached. \"Israel is opposed to this. At this point, only President Trump can break this deadlock.\" The source added: \"Unless Trump pushes, we are in a stalemate.\" Israel-Gaza - live updates  The problem is that the announcement made now by Donald Trump - which is his social-media-summarised version of whatever Israel has actually agreed to - may just amount to Israel's already-established position. We don't know the details and conditions attached to Israel's proposals. Would Israeli troops withdraw from Gaza? Totally? Or partially? How many Palestinian prisoners would they agree to release from Israel's jails? And why only 60 days? Why not a total ceasefire? What are they asking of Hamas in return? We just don't know the answers to any of these questions, except one.  We do know why Israel wants a 60-day ceasefire, not a permanent one. It's all about domestic politics. If Israeli Prime Minister Benjamin Netanyahu were to agree now to a permanent ceasefire, the extreme right-wingers in his coalition would collapse his government. Itamar Ben-Gvir and Bezalel Smotrich have both been clear about their desire for the war to continue. They hold the balance of power in Mr Netanyahu's coalition. Read more:British-Israeli soldier killed in Gaza'Almost 60 killed in Israeli strikes' If Mr Netanyahu instead agrees to just 60 days - which domestically he can sell as just a pause - then that may placate the extreme right-wingers for a few weeks until the Israeli parliament, the Knesset, is adjourned for the summer. It is also no coincidence that the US president has called for Mr Netanyahu's corruption trial to be scrapped. Without the prospect of jail, Mr Netanyahu might be more willing to quit the war, safe in the knowledge that focus will not shift immediately to his own political and legal vulnerability."
    },
    {
        "title": "More bad news for Elon Musk as Tesla deliveries miss target again",
        "description": "Tesla's woes have deepened as latest production and deliveries figures showed a greater fall than expected. ",
        "url": "https://news.sky.com/story/more-bad-news-for-elon-musk-as-tesla-deliveries-miss-target-again-13391543",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-cybertruck_6862559.jpg?20250320202636",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-02 15:54:00",
        "Headline": "The world's richest man was forced to exit full-time politics and focus more of his energies on Tesla after the company's performance lagged. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Tesla's woes have deepened as latest production and deliveries figures showed a greater fall than expected.  A total of 384,122 Teslas were delivered from April to June this year, a 13.5% drop on the same period last year and the second quarter of slumping output. Wall Street analysts had expected Tesla to report about 1,000 more deliveries. It's bad news for Tesla chief executive Elon Musk in a week of attacks from President Donald Trump on him personally, as well as his companies. Money blog: Customers to get up to £2,000 compensation from water companies Mr Musk found himself on the wrong side of Mr Trump and the majority of US congresspeople in his opposition to the so-called big beautiful bill approved by the US Senate. His criticism of the inevitable debt rises the bill will result in led Mr Trump threatening to end subsidies for Mr Musk's numerous businesses and to deport him. \n                  Drivers 'confused' by transition to electric vehicles, ministers warned\n                 \n                  'Big opportunity' for Chinese electric carmakers in the UK, newest entrant XPENG tells Sky News\n                 \n                  Electric car demand reaches record high in January but misses target - SMMT data\n                  His role as founder and chief executive of numerous businesses has made him the world's richest man, according to Forbes. As well as Tesla, Mr Musk founded space technology company SpaceX and Starlink. He also acquired the social media company Twitter, which he rebranded X. It was the poor performance of Tesla that pushed him out of full-time politics and back to the Tesla offices. Read more:AstraZeneca exit is a frightening prospect for the City and the governmentSantander bank deal could mean TSB name disappears from UK high street After months of share price tumbles and protests at Tesla showrooms, sales drops and car defacings, Musk left his work with the Trump administration's Department of Government Efficiency (DOGE). Not everyone viewed the figures as negative. Analysts at financial services firm Wedbush said: \"Tesla's future is in many ways the brightest it's ever been in our view given autonomous, FSD [full self-driving], robotics, and many other technology innovations now on the horizon with 90% of the valuation being driven by autonomous and robotics over the coming years but Musk needs to focus on driving Tesla and not putting his political views first.\" After a 5% share price fall earlier this week when Mr Musk strayed back into political matters, Tesla stock rose 4.5% on Wednesday. The latest financial details for Tesla will be published later this month. In the first three months of the year, Tesla's profits fell by 71% to $409m (£306.77m) from $1.39bn (£1.04bn). Revenues were also well below forecasts, dropping 9% to $19.3bn (£14.5bn)."
    },
    {
        "title": "Donald Trump's 'big, beautiful bill' has sparked ugly debate - so why is it so controversial?",
        "description": "It is certainly big - 940 pages long - but on the question of beauty, Congress is divided.",
        "url": "https://news.sky.com/story/donald-trumps-big-beautiful-bill-has-sparked-ugly-debate-so-why-is-it-so-controversial-13391070",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-elon-musk-donald-trump_6935672.jpg?20250606085706",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-07-02 00:26:00",
        "Headline": "Legislatively, the progress of the bill has been complex, but strategically it represents a mammoth effort to consolidate the president's policy agenda and secure his legacy.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  It is certainly big - 940 pages long - but on the question of beauty, Congress is divided. Donald Trump's \"big, beautiful bill\" has sparked ugly debate - both for its ambitious scope and for the political manoeuvring that's gone on around it. Elon Musk branded it \"political suicide\" for Republicans and threatened to fund challenges against those who back it in next year's midterm elections. But the president hit back, suggesting he would consider cutting Musk's lucrative government contracts or even deporting him back to South Africa. The \"big, beautiful bill\", or HR 1 to give the proposed legislation its proper title, is Mr Trump's signature spending and tax policy. It extends tax cuts he secured in 2017 and bankrolls his second-term agenda in the White House. Here is a summary of the key points: • Permanent tax cuts: Extending relief from the 2017 Tax Cuts and Jobs Act • Small business support: Doubling the small business expensing limit to $2.5m (£1.8m) to help businesses expand and hire staff • Child tax credit: Expanding the child tax credit and making it permanent, benefiting 40 million families • Making housing affordable: Expanding the low-income housing tax credit to kickstart construction of affordable homes • Defence and border security: Allocating $170bn (£123bn) for border security alone, including $46bn (£33bn) for completing the border wall • Made-in-America incentives: Providing tax breaks and incentives for domestic manufacturing to promote US industry • Healthcare and social welfare: Implementing restrictions on Medicaid, which provides healthcare for millions of Americans, and reducing funding for certain healthcare and nutrition programmes. 👉 Follow Trump100 on your podcast app 👈 Clash over 'monster' debt bill Musk, Mr Trump's former ally and the man who established the Department of Government Efficiency (DOGE), claimed the bill \"raises the debt ceiling by $5trn, the biggest increase in history.\" \"DOGE is the monster that might have to go back and eat Elon,\" was President Trump's response. The national debt currently stands at $37trn (£27trn) and the Congressional Budget Office (CBO) estimates that the bill could add $2.4trn (£1.7trn) to that over the next decade.  Bill splits Republican ranks Republican Senator Thom Tillis voted against the bill and, following criticism from the president, announced he would not seek re-election in North Carolina. He said he couldn't support it due to his concerns about the impact cuts to Medicaid would have on people in his state. Democrats in the Senate forced a full reading of all 940 pages and then a vote-a-rama, a series of marathon voting sessions. Read more from Sky News:Elon's dad on the Musk-Trump bust-upHow Musk's cost-cutting mission fell flat In the House of Representatives, it passed by a single vote, 215-214. In the Senate, Vice President JD Vance, had to cast the deciding vote to break a tie (50-50). Legislatively, the progress of the bill has been a case study in the complexities of American law-making. Strategically, it represents a mammoth effort to consolidate the president's policy agenda and secure his legacy."
    },
    {
        "title": "What is 'Alligator Alcatraz'?",
        "description": "👉 <a href=\"https://podfollow.com/trump100/view\" target=\"_blank\">Follow Trump100 on your podcast app</a> 👈",
        "url": "https://news.sky.com/story/what-is-alligator-alcatraz-13391251",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-02 03:35:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈 Mark Stone and David Blevins unpick the latest development in Donald Trump's mass deportation plan - a detention centre in the Florida Everglades nicknamed \"Alligator Alcatraz\". They also discuss the president's \"Big Beautiful Bill\", which has narrowly passed in the Senate. The legislation likely to define Trump's second term is now one step closer to becoming law. And there's breaking news to digest on US weapons to Ukraine, as well as a potential ceasefire in Gaza. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Paramount settles Trump lawsuit over CBS report with $16m payout",
        "description": "US media group Paramount has agreed to pay $16m (&#163;11.6m) to settle a lawsuit filed by Donald Trump over what he alleged was a misleading interview with the former vice president Kamala Harris.",
        "url": "https://news.sky.com/story/paramount-settles-trump-lawsuit-over-cbs-report-with-16m-payout-13391409",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-paramount-logo-paramount-global_6955278.jpg?20250702122138",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-02 11:40:00",
        "Headline": "Paramount and CBS had rejected Donald Trump's claims and there was no apology in the settlement - while the case has been criticised as a challenge to free speech.",
        "Content": "US media group Paramount has agreed to pay $16m (£11.6m) to settle a lawsuit filed by Donald Trump over what he alleged was a misleading interview with the former vice president Kamala Harris. The case involving a feature on CBS News, which is owned by Paramount, has been criticised as a challenge to free speech. Paramount has been seeking a resolution with Mr Trump, whose administration must approve the company's proposed merger with Skydance Media - but the settlement did not involve an apology. Mr Trump's lawyer claimed the president had suffered \"mental anguish\" over the editing of the interview, which was broadcast in October on the CBS News show 60 Minutes during the election campaign. The money will go to Mr Trump's future presidential library and not directly to the 79-year-old American leader. Paramount and CBS had rejected Mr Trump's contention that the interview was edited to enhance how Ms Harris sounded and wanted the lawsuit dismissed. Mr Trump, who did not agree to be interviewed by 60 Minutes during the campaign, protested over clips showing Ms Harris giving two different answers to a question from interviewer Bill Whitaker. The separate clips were aired on 60 Minutes and Face The Nation. CBS said both replies came as part of Ms Harris's long answer and the clip was edited to be more succinct. Read more from Sky News:Trump says Israel has agreed to a 60-day Gaza ceasefire 'President's USAID cuts could lead to 14 million deaths' The president's lawyer said it caused confusion and was misleading to voters. The case has been closely watched by advocates for press freedom and journalists at CBS, whose lawyers called the lawsuit \"completely without merit\" and pledged to fight it after it was filed. The Freedom of the Press Foundation, a media advocacy group that says it is a Paramount shareholder, vowed it would file a lawsuit in protest if a settlement was reached. In December, ABC News settled a defamation lawsuit by the president over statements made by presenter George Stephanopoulos, agreeing to pay $15m (£10.9m) towards Mr Trump's presidential library."
    },
    {
        "title": "AstraZeneca exit is a frightening prospect for the City and the government",
        "description": "It's a threat that will send a shiver down the spine of Downing Street and shake the City of London to its core.",
        "url": "https://news.sky.com/story/astrazeneca-exit-is-a-frightening-prospect-for-the-city-and-the-government-13391297",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-astrazeneca-vaccine_5378120.jpg?20210511182306",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-02 07:24:00",
        "Headline": "Sky's James Sillars writes that a government, struggling for authority and prioritising economic growth, can not afford to allow the FTSE 100's biggest company to leave London in favour of New York.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n It's a threat that will send a shiver down the spine of Downing Street and shake the City of London to its core. Even the notion that AstraZeneca (AZ) - the UK's most valuable listed company - is thinking of upping sticks and switching its stock market listing to America is a frightening prospect on many levels. After all, if your biggest firm departs for Wall Street, what message does it send to an already bruised London stock market that has struggled to find its way since the UK's vote to leave the European Union? Money latest: Cash in your pocket set to change The timing of the report in The Times that Pascal Soriot, the pharmaceutical company's long-standing chief executive, is considering his own Brexit for the company, will not be lost on anyone. The Treasury is under severe strain and the Starmer government, apparently focused on compromise given its welfare reform U-turns, bruised. Ministers have been scrambling to get the support of business back, after a budget tax raid that has added to the cost of employing people in the UK, by launching a series of strategies to demonstrate a growth-led focus. \n                  More bad news for Elon Musk as Tesla deliveries miss target again\n                 \n                  How markets reacted to uncertainty over Rachel Reeves's future\n                 \n                  Money blog: Millions affected as airline hit by cyber attack; five ways government could raise taxes\n                 Mr Soriot's reported shift is the culmination of years of frustration over UK tax rates and support for business - though it could also remove a focus on his own remuneration as the highest-paid director of a UK-listed firm. AZ has its own gripes with Labour. In January, the company cancelled a planned £450m investment in a vaccine factory on Merseyside, accusing the government of reneging on the previous Conservative administration's offer of financial aid. At the same time, it has been rebuilding its presence in the United States. That speaks to not only a home market snub but also the election of a US president intent on protecting, as he sees it, America-based companies and jobs. Donald Trump is threatening 25% tariffs on all pharma imports.  AZ has already promised a $3.5bn (£2.6bn) investment in US manufacturing by the end of 2026. It has also rejoined the leading US drug lobby group, bolstering its voice in Washington DC. There are sound reasons for bolstering its US footprint; more than 40% of AZ's revenues are made in the world's largest economy. Greater US production would also shield it from any duties imposed by Mr Trump and any MAGA successor. Since Brexit, complaints among UK stock market constituents have been of low valuations compared to peers (with a weak pound also leaving them vulnerable to takeovers), weaker access to capital and poor appetite for new listings. Wise, the money transfer firm, became the latest UK name to say that it intends to move its primary listing to the US just last month. If followed through, it would tread in the footsteps of Flutter Entertainment and the building equipment suppler CRH - just two big names to have already left. London was snubbed for a listing by its former chip-designing resident ARM back in 2023. An initial public offering by Shein, the controversial fast fashion firm, had offered the prospect of the biggest flotation for the UK in many years but that was blocked by the Chinese authorities. Efforts to bolster the City's appeal, such as through the Financial Conduct Authority's overhaul of listing rules and the creation of pension megafunds to aid access to capital, have also been boosted in recent months by investors in US companies taking a second look at comparatively low valuations in Europe. Market analysts have charted a cash spread away from the US as a hedge against an erratic White House. The Times report suggested that Mr Soriot's plans were likely to face some opposition from members of the board, in addition to the UK government. AstraZeneca has not commented on the story. Crucially, it did not deny it. But a government spokesperson said: \"Through our forthcoming Life Sciences Sector Plan, we are launching a 10-year mission to harness the life sciences sector to drive long-term economic growth and build a stronger, prevention-focused NHS. \"We have already started delivering on key actions, from investing up to £600m in the Health Data Research Service alongside Wellcome, through to committing over £650m in Genomics England and up to £354m in Our Future Health. \"This is clear evidence of our commitment and confidence in life sciences as a driver of both economic growth and better health outcomes.\" Governments don't comment on stories such as these, but you can bet your bottom dollar that the departure of your biggest firm by market value is not the message a government laser-focused on growth can afford to allow."
    },
    {
        "title": "More bad news for Elon Musk as Tesla deliveries miss target again",
        "description": "Tesla's woes have deepened as latest production and deliveries figures showed a greater fall than expected. ",
        "url": "https://news.sky.com/story/more-bad-news-for-elon-musk-as-tesla-deliveries-miss-target-again-13391543",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-cybertruck_6862559.jpg?20250320202636",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-02 15:54:00",
        "Headline": "The world's richest man was forced to exit full-time politics and focus more of his energies on Tesla after the company's performance lagged. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Tesla's woes have deepened as latest production and deliveries figures showed a greater fall than expected.  A total of 384,122 Teslas were delivered from April to June this year, a 13.5% drop on the same period last year and the second quarter of slumping output. Wall Street analysts had expected Tesla to report about 1,000 more deliveries. It's bad news for Tesla chief executive Elon Musk in a week of attacks from President Donald Trump on him personally, as well as his companies. Money blog: Customers to get up to £2,000 compensation from water companies Mr Musk found himself on the wrong side of Mr Trump and the majority of US congresspeople in his opposition to the so-called big beautiful bill approved by the US Senate. His criticism of the inevitable debt rises the bill will result in led Mr Trump threatening to end subsidies for Mr Musk's numerous businesses and to deport him. \n                  Drivers 'confused' by transition to electric vehicles, ministers warned\n                 \n                  'Big opportunity' for Chinese electric carmakers in the UK, newest entrant XPENG tells Sky News\n                 \n                  Electric car demand reaches record high in January but misses target - SMMT data\n                  His role as founder and chief executive of numerous businesses has made him the world's richest man, according to Forbes. As well as Tesla, Mr Musk founded space technology company SpaceX and Starlink. He also acquired the social media company Twitter, which he rebranded X. It was the poor performance of Tesla that pushed him out of full-time politics and back to the Tesla offices. Read more:AstraZeneca exit is a frightening prospect for the City and the governmentSantander bank deal could mean TSB name disappears from UK high street After months of share price tumbles and protests at Tesla showrooms, sales drops and car defacings, Musk left his work with the Trump administration's Department of Government Efficiency (DOGE). Not everyone viewed the figures as negative. Analysts at financial services firm Wedbush said: \"Tesla's future is in many ways the brightest it's ever been in our view given autonomous, FSD [full self-driving], robotics, and many other technology innovations now on the horizon with 90% of the valuation being driven by autonomous and robotics over the coming years but Musk needs to focus on driving Tesla and not putting his political views first.\" After a 5% share price fall earlier this week when Mr Musk strayed back into political matters, Tesla stock rose 4.5% on Wednesday. The latest financial details for Tesla will be published later this month. In the first three months of the year, Tesla's profits fell by 71% to $409m (£306.77m) from $1.39bn (£1.04bn). Revenues were also well below forecasts, dropping 9% to $19.3bn (£14.5bn)."
    },
    {
        "title": "How markets reacted to uncertainty over Rachel Reeves's future",
        "description": "The pound fell and state borrowing costs rose during a period of uncertainty over the chancellor's future on Wednesday.",
        "url": "https://news.sky.com/story/how-markets-reacted-to-uncertainty-over-rachel-reevess-future-13391471",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-racheal-reeves-kemi-badenoch_6955369.jpg?20250702131251",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-02 13:25:00",
        "Headline": "Investors appeared concerned about the ability of the UK government to meet its fiscal rules during questions over Ms Reeves's future. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The pound fell and state borrowing costs rose during a period of uncertainty over the chancellor's future on Wednesday. During Prime Minister's Questions, Sir Keir Starmer declined to guarantee whether a visibly emotional Rachel Reeves would remain chancellor until the next election following the government's welfare bill U-turn. Money blog: Cash in your pocket set to change Following his remarks, the value of the pound dropped and government borrowing costs rose, via the interest rate on both 10 and 30-year bonds. Although market fluctuations are common, there was a reaction following Sir Keir's comments in the Commons - signalling concern among investors of potential changes within the Treasury.  Sterling dropped to a week-long low, hitting $1.35 for the first time since 24 June. The level, however, is still significantly higher than the vast majority of the past year, having come off the near four-year peak reached yesterday. While a drop against the euro, took the pound to €1.15, a rate not seen since mid-April in the aftermath of President Donald Trump's tariff announcements. \n                  Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News\n                 \n                  No 10 backs Chancellor Rachel Reeves and says she 'is going nowhere' after tearful appearance in Commons\n                 \n                  Who will take the fall for welfare chaos?\n                 Read more:No 10 backs Reeves and says she is 'going nowhere'Analysis: Emotional Reeves a painful watch Meanwhile, the interest rate investors charge to lend money to the government, called the gilt yield, rose on both long-term (30-year) and ten-year bonds. The UK's benchmark 10-year gilt yield - so-called for the gilt edges that historically lined the paper they were printed on - rose to 4.67%, a high last recorded on 9 June. And 30-year gilt yields hit 5.45%, a level not seen since 29 May. Both eased back in the hours following - as a spokesperson for the prime minister attempted to quell speculation about the chancellor's future. Sky News understands the prime minister made clear to the chancellor that she has his \"complete support\" and remains integral to his project. Ms Reeves has committed to self-imposed rules to reduce debt and balance the budget. Speculation around her future led investors to question the government's commitment to balancing the books - and how they would do that. The questions over her future came after the government scrapped the core money-saving component of its welfare bill, which had been intended to reduce spending in order to meet fiscal rules."
    },
    {
        "title": "Apollo-backed Athora closes in on £6bn Pension Insurance Corporation deal",
        "description": "A savings and retirement services group backed by Apollo Global Management is closing in on a near-&#163;6bn takeover of Pension Insurance Corporation (PIC), one of the City's biggest specialist insurers.",
        "url": "https://news.sky.com/story/apollo-backed-athora-closes-in-on-1636bn-pension-insurance-corporation-deal-13391631",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-02 19:17:00",
        "Headline": "A takeover of PIC, one of the UK's biggest pension risk transfer specialists, could be announced as early as this week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A savings and retirement services group backed by Apollo Global Management is closing in on a near-£6bn takeover of Pension Insurance Corporation (PIC), one of the City's biggest specialist insurers. Sky News has learnt that Athora, which is minority-owned by Apollo, the US-based alternative investments giant, is days away from striking a deal to take control of PIC. City sources said the deal, worth just under £6bn, could be announced as soon as this week. Money blog: Millions affected as airline hit by cyber attack It would represent a landmark transaction in the pension risk transfer market, where insurers such as PIC, Legal & General and Rothesay take on companies' defined benefit pension schemes and the assets behind them. RSA, the insurer, and British American Tobacco are among the corporate names with which PIC has transacted. It has also signed agreements with Chemring and Qantas. \n                  AstraZeneca exit is a frightening prospect for the City and the government\n                 \n                  More bad news for Elon Musk as Tesla deliveries miss target again\n                 \n                  How markets reacted to uncertainty over Rachel Reeves's future\n                 PIC's shareholders include CVC Capital Partners, BlackRock-owned HPS, a subsidiary of the Abu Dhabi Investment Authority and Reinet, a vehicle created from the restructuring of luxury goods group Richemont. Reinet, which owns 49.5% of PIC, issued a statement late last week confirming it was in talks to sell its stake but without naming the potential acquirer. Apollo previously looked at an offer for PIC in 2023, with rival bidders including Carlyle and KKR also emerging. The market for bulk annuities has exploded in recent years as companies seek to offload a variety of pension-related financial risks. PIC recently announced the retirement of its long-serving chief executive, Tracy Blackwell, and has yet to name her successor. Apollo declined to comment, while PIC has been contacted for comment."
    },
    {
        "title": "'Catastrophic failure' led to Heathrow power outage - with chances missed to prevent it",
        "description": "A power outage that shut Heathrow Airport earlier this year, causing travel chaos for more than 270,000 passengers, was caused by a \"catastrophic failure\" of equipment in a nearby substation, according to a new report.",
        "url": "https://news.sky.com/story/catastrophic-failure-that-led-to-heathrow-power-outage-revealed-as-report-outlines-the-chances-missed-to-prevent-it-13391266",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hayes-electrical-heathrow_6863011.jpg?20250321092157",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-02 06:05:00",
        "Headline": "Two opportunities were missed to take action that could have prevented the failure, including in 2018, according to a new report.",
        "Content": " A power outage that shut Heathrow Airport earlier this year, causing travel chaos for more than 270,000 passengers, was caused by a \"catastrophic failure\" of equipment in a nearby substation, according to a new report. Experts say the fire at the North Hyde Substation, which supplies electricity to Heathrow, started following the failure of a high-voltage electrical insulator known as a bushing, before spreading. The failure was \"most likely\" caused by moisture entering the equipment, according to the report. National Grid, which owns the substation, missed two opportunities to prevent the failure, experts found, the first in 2018 when a higher-than-expected level of moisture was found in oil samples. Such a reading meant \"an imminent fault and that the bushing should be replaced\", according to guidance by the National Grid Electricity Transmission. However, the report by National Energy System Operator (NESO) said the appropriate responses to such a serious issue were \"not actioned\", including in 2022 when basic maintenance was postponed. \"The issue therefore went unaddressed,\" the report added.  The design and configuration of the airport's internal power network meant the loss of just one of its three supply points would \"result in the loss of power to operationally critical systems, leading to a suspension of operations for a significant period\", the report added. Heathrow - which is Europe's biggest airport - closed for around 16 hours on 21 March following the fire, before reopening at about 6pm. Around 1,300 flights were cancelled and more than 270,000 air passenger journeys were disrupted. Tens of millions of pounds were lost, thousands of passengers were stranded, and questions were raised about the resilience of the UK's infrastructure. More than 71,000 domestic and commercial customers lost power as a result of the fire and the resulting power outage, the report said. NESO chief executive, Fintan Slye, said there \"wasn't the control within their [National Grid's] asset management systems that identified that this [elevated moisture levels] got missed. \"They identified a fault, [but] for some reason the transformer didn't immediately get pulled out of service and get repaired. \"There was no control within the system that looked back and said 'oh, hang on a second, you forgot to do this thing over here'.\" Sky's science and technology editor, Tom Clarke, pointed to the age of the substation's equipment, saying \"some of these things are getting really very old now, coming to the end of their natural lives, and this is an illustration of what can happen if they are not really well maintained\". The report also highlights a lack of joined-up thinking, he said, as \"grid operators don't know who's critical national infrastructure on the network, and they don't have priority\".  Responding to the report's findings, a Heathrow spokesperson said: \"A combination of outdated regulation, inadequate safety mechanisms, and National Grid's failure to maintain its infrastructure led to this catastrophic power outage. \"We expect National Grid to be carefully considering what steps they can take to ensure this isn't repeated. \"Our own Review, led by former Cabinet Minister Ruth Kelly, identified key areas for improvement and work is already underway to implement all 28 recommendations.\" Science and technology editor The reliability of our grid is, it turns out, paper thin.\n A fire at the National Grid substation at North Hyde, which supplies Heathrow Airport, was caused by the \"catastrophic failure\" of a bushing in a high-voltage transformer at the site. A bushing is made of paper and foil, soaked in oil.\n The resulting fire, which knocked out the substation and in turn, power to more than 70,000 customers, including the west London airport, led to 1,300 flight cancellations affecting nearly 300,000 travellers.\n Click here to read Tom Clarke's full analysis.\n In May, Ms Kelly's investigation revealed that the airport's chief executive couldn't be contacted as the crisis unfolded because his phone was on silent. Energy Secretary Ed Miliband, who commissioned the NESO report, called it \"deeply concerning\", because \"known risks were not addressed by the National Grid Electricity Transmission\". Mr Miliband said energy regulator Ofgem, which opened an investigation on Wednesday after the report was published, is investigating \"possible licence breaches relating to the development and maintenance of its electricity system at North Hyde. \"There are wider lessons to be learned from this incident. My department, working across government, will urgently consider the findings and recommendations set out by NESO and publish a response to the report in due course.\" National Grid said in a statement it has \"a comprehensive asset inspection and maintenance programme in place\" and said it has \"taken further action since the fire\". This includes \"an end-to-end review\" of its oil sampling process and results, further enhancement of fire risk assessments at all operational sites, and \"re-testing the resilience of substations that serve strategic infrastructure\". Read more on Sky News:Starmer 'faced down his MPs and lost'Partial verdict in Diddy trialConcern for player safety at Euros A spokesperson said: \"We fully support the recommendations in the report and are committed to working with NESO and others to implement them. We will also cooperate closely with Ofgem's investigation. \"There are important lessons to be learnt about cross sector resilience and the need for increased coordination, and we look forward to working with government, regulators and industry partners to take these recommendations forward.\" The Metropolitan Police previously confirmed on 25 March that officers had \"found no evidence to suggest that the incident was suspicious in nature\"."
    },
    {
        "title": "Rachel Reeves will 'of course' be chancellor in six months' time, says senior Starmer ally",
        "description": "Rachel Reeves will \"of course\" be chancellor in six months' time, a senior ally of Sir Keir Starmer has said, despite last night's humiliating showdown over welfare cuts.",
        "url": "https://news.sky.com/story/rachel-reeves-will-of-course-be-chancellor-in-six-months-time-says-senior-starmer-ally-13391272",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-politics_6940579.jpg?20250612204238",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-02 06:16:00",
        "Headline": "Pat McFadden defends the handling of the chaotic welfare vote - but admits offering such huge concessions will have \"financial consequences\".",
        "Content": " Rachel Reeves will \"of course\" be chancellor in six months' time, a senior ally of Sir Keir Starmer has said, despite last night's humiliating showdown over welfare cuts. Pat McFadden, the chancellor of the Duchy of Lancaster, admitted there would be a \"cost\" to the government's decision to effectively neuter its welfare bill, which was intended to save Ms Reeves around £5bn but now leaves her with an estimated £5.5bn black hole. Speaking to Kamali Melbourne on Sky News' Breakfast Mr McFadden acknowledged it had been a \"tough\" few weeks for the government as it faced down its backbenchers over proposals to shake up the welfare system. Politics latest: Tories go on the attack against Rachel Reeves The prime minister's watered-down Universal Credit and Personal Independent Payment Bill, aimed at saving £5.5bn, was backed by a majority of 75 in a tense vote on Tuesday evening. A total of 49 Labour MPs voted against the bill - the largest rebellion in a prime minister's first year in office since 47 MPs voted against Tony Blair's Lone Parent benefit in 1997, according to Professor Phil Cowley from Queen Mary University. Ms Reeves has borne a lot of the criticism over the handling of the vote, with some MPs believing that her strict approach to fiscal rules has meant she has approached the ballooning welfare bill from the standpoint of trying to make savings, rather than getting people into work. \n                  Just 25% of public think Sir Keir Starmer will win next election - with welfare row partly to blame\n                 \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 \n                  Labour welfare cuts 'Dickensian' and 'from another era', says rebel MP ahead of vote\n                 Experts have also warned that the welfare U-turn, on top of reversing the cut to winter fuel, means that tax rises in the autumn are more likely. Asked whether he believed Ms Reeves would still be in her job in the next six months, Mr McFadden replied: \"Of course she will. She's doing an excellent job. We take these decisions as a team. We stand as a team, and we go forward as a team.\" The senior cabinet minister sought to downplay the chaotic scenes that unfolded in the Commons last night, when the government pulled the most controversial elements of the bill, leaving MPs to vote on only one element - cutting universal credit (UC) sickness benefits for new claimants from £97 a week to £50 from 2026/7.  Just 90 minutes before voting started on Tuesday evening, disabilities minister Stephen Timms announced the last of a series of concessions made as dozens of Labour MPs spoke of their fears for disabled and sick people if the bill was made law. In a major U-turn, he said changes in eligibility for the personal independence payment (PIP), the main disability payment to help pay for extra costs incurred, would not take place until a review he is carrying out into the benefit is published in autumn 2026. An amendment brought by Labour MP Rachael Maskell, which aimed to prevent the bill progressing to the next stage, was defeated but 44 Labour MPs voted for it. Conservative shadow chancellor Mel Stride called the vote \"farcical\" and said the government \"ended up in this terrible situation\" because they \"rushed it\". He warned the markets \"will have noticed that when it comes to taking tougher decisions about controlling and spending, this government has been found wanting\". Read more:Beth Rigby: I suspect things may only get worse for the PMHow did your MP vote on Labour's welfare bill?Beth Rigby: The PM's choice - welfare v warfare Mr McFadden argued it was not \"entirely a bad thing that Labour MPs feel passionately about this issue\" despite it causing the most damaging rebellion of the prime minister's leadership so far.  \"There's a long history of Labour MPs feeling passionately about this issue. But where we've got to, in the end, is the second reading of the bill going through and the reforms to PIP, which were the most contentious part of this taken forward in slower time now, through a review led by my colleague Stephen Timms.\" He added: \"There is a financial consequence to the decision - there's no denying that. \"But this is also about changing incentives, getting a better system, getting more support for people, who are looking for work. \"There are important key elements of the welfare reform package that were passed in the vote last night that were still valuable. And we will take that forward.\""
    },
    {
        "title": "Saudi sports investor Surj goes extra mile for $20m triathlon stake",
        "description": "The sports investment arm of Saudi Arabia's sovereign wealth fund is buying a stake in the body which organises professional triathlons around the world.",
        "url": "https://news.sky.com/story/saudi-sports-investor-surj-goes-extra-mile-for-20m-triathlon-stake-13391360",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-triathlon-t100_6955153.jpg?20250702105147",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-02 09:42:00",
        "Headline": "A subsidiary of Saudi Arabia's sovereign wealth fund is to become a shareholder in the Professional Triathletes Organisation as part of a wider fundraising, Sky News learns. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The sports investment arm of Saudi Arabia's sovereign wealth fund is buying a stake in the body which organises professional triathlons around the world. Sky News has learnt that Surj Sports Investment is in advanced talks about a deal to inject roughly $20m into the Professional Triathletes Organisation (PTO). A deal could be unveiled as part of a wider PTO funding round imminently, a source in the Middle East said on Wednesday. Money latest: Greggs shares plunge 14% It will be the latest investment from Surj, which also owns stakes in the Professional Fighters League and the sports streaming platform DAZN. Previously known as SRJ, Surj is a subsidiary of Saudi's Public Investment Fund (PIF), which owns a controlling stake in Newcastle United Football Club. Surj's investment will come in addition to previously announced funding from Cordillera Investment Partners, which took a $10m stake earlier this year. \n                  AstraZeneca exit is a frightening prospect for the City and the government\n                 \n                  More bad news for Elon Musk as Tesla deliveries miss target again\n                 \n                  How markets reacted to uncertainty over Rachel Reeves's future\n                 Other investors in the PTO include the media behemoth Warner Brothers Discovery and Sir Michael Moritz, the technology industry veteran. Sky News reported on the triathlon body's plans to raise capital in the spring of last year. It has been working with Oakvale Capital, a London-based advisory firm, on the fundraising since then. This year's T100 Triathlon World Tour consists of nine races, with the next due to be staged in London next month. The World Championship Final will take place in Qatar in December.  The PTO, which is partly owned by athletes, has embarked on a significant commercial overhaul in a bid to capitalise on growing sponsor and broadcast interest from around the world. In December 2022, it announced a fundraising - said to have brought in more than $30m - led by Divergent Investments, a private equity firm. As part of its efforts to accelerate the commercialisation of the sport, the PTO recruited Chris Kermode, the former Association of Tennis Professionals (ATP) boss, as its chairman. \"This is an exciting opportunity to modernise a sport and give these ultimate endurance athletes the opportunity to showcase their extraordinary talents, while being rewarded appropriately,\" Mr Kermode said at the time of the previous fundraising. Most frequently watched in Britain during the summer Olympic Games, professional triathlons consist of a 2km swim, 80km bike-ride and 18km run. The PTO is run by Sam Renouf, a former British international athlete, who was appointed as chief executive in 2019. Since then, it has secured substantial sponsorship deals with companies including Canyon and Garmin, the luxury watchmaker. The PTO declined to comment on Wednesday, while Surj did not respond to an enquiry from Sky News."
    },
    {
        "title": "Paramount settles Trump lawsuit over CBS report with $16m payout",
        "description": "US media group Paramount has agreed to pay $16m (&#163;11.6m) to settle a lawsuit filed by Donald Trump over what he alleged was a misleading interview with the former vice president Kamala Harris.",
        "url": "https://news.sky.com/story/paramount-settles-trump-lawsuit-over-cbs-report-with-16m-payout-13391409",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-paramount-logo-paramount-global_6955278.jpg?20250702122138",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-02 11:40:00",
        "Headline": "Paramount and CBS had rejected Donald Trump's claims and there was no apology in the settlement - while the case has been criticised as a challenge to free speech.",
        "Content": "US media group Paramount has agreed to pay $16m (£11.6m) to settle a lawsuit filed by Donald Trump over what he alleged was a misleading interview with the former vice president Kamala Harris. The case involving a feature on CBS News, which is owned by Paramount, has been criticised as a challenge to free speech. Paramount has been seeking a resolution with Mr Trump, whose administration must approve the company's proposed merger with Skydance Media - but the settlement did not involve an apology. Mr Trump's lawyer claimed the president had suffered \"mental anguish\" over the editing of the interview, which was broadcast in October on the CBS News show 60 Minutes during the election campaign. The money will go to Mr Trump's future presidential library and not directly to the 79-year-old American leader. Paramount and CBS had rejected Mr Trump's contention that the interview was edited to enhance how Ms Harris sounded and wanted the lawsuit dismissed. Mr Trump, who did not agree to be interviewed by 60 Minutes during the campaign, protested over clips showing Ms Harris giving two different answers to a question from interviewer Bill Whitaker. The separate clips were aired on 60 Minutes and Face The Nation. CBS said both replies came as part of Ms Harris's long answer and the clip was edited to be more succinct. Read more from Sky News:Trump says Israel has agreed to a 60-day Gaza ceasefire 'President's USAID cuts could lead to 14 million deaths' The president's lawyer said it caused confusion and was misleading to voters. The case has been closely watched by advocates for press freedom and journalists at CBS, whose lawyers called the lawsuit \"completely without merit\" and pledged to fight it after it was filed. The Freedom of the Press Foundation, a media advocacy group that says it is a Paramount shareholder, vowed it would file a lawsuit in protest if a settlement was reached. In December, ABC News settled a defamation lawsuit by the president over statements made by presenter George Stephanopoulos, agreeing to pay $15m (£10.9m) towards Mr Trump's presidential library."
    },
    {
        "title": "Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News",
        "description": "Two senior Labour MPs have suggested the prime minister may have to go within months if the government continues to perform poorly.",
        "url": "https://news.sky.com/story/starmer-put-on-notice-and-may-have-to-step-down-as-leader-within-months-13391677",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-tears_6955349.jpg?20250702130000",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-02 22:27:00",
        "Headline": "A member of the government and a prominent MP said Sir Keir Starmer could be ousted unless Labour has a strong showing in May's elections.",
        "Content": "Two senior Labour MPs have suggested the prime minister may have to go within months if the government continues to perform poorly. Sky News' deputy political editor Sam Coates said his sources - a member of the government and a prominent politician - have \"put Sir Keir Starmer on notice\". Both warned that, if Labour performs badly in next May's elections across Wales, Scotland and London, it could mark the end of his time in Downing Street. Coates added: \"The level of unhappiness and despair in parts of the Labour Party is so striking that right now, on the first anniversary, I am hearing from ministers in government that Starmer might have to go in months.\" Reform UK is surging in the polls in Wales, while Labour faces a threat from left-wing parties such as the Greens in London.  It comes as the prime minister made it clear that Rachel Reeves has his \"complete support\" as chancellor and remains integral to his project, Sky News's political editor Beth Rigby understands. She looked visibly upset during Prime Minister's Questions, with a spokesperson claiming she had been affected by a \"personal matter\". A day earlier, Sir Keir's controversial welfare bill was passed despite a sizeable rebellion from Labour MPs, with major U-turns meaning a new £5bn black hole has appeared in the country's finances. One senior figure told Rigby that the pair were as \"as close politically\" as any chancellor and prime minister have ever been. \"She is going absolutely nowhere,\" they added.  Ms Reeves's tears sent markets spiralling, with the value of the pound and long-term government bonds falling sharply. Later in the day Sir Keir, said Ms Reeves will be chancellor for a \"very long time to come\". The prime minister said it was \"absolutely wrong\" to suggest her tearful appearance in the Commons related to the welfare U-turn. \"It's got nothing to do with politics, nothing to do with what's happened this week. It was a personal matter for her,\" he said while speaking to the BBC's podcast Political Thinking with Nick Robinson. \"I'm not going to intrude on her privacy by talking to you about that. It is a personal matter.\" Read more from Sky News:Just 25% of public think Starmer will win next electionAnalysis: Emotional Reeves a reminder of tough decisions ahead Asked if she will remain in post, he said: \"She will be chancellor by the time this is broadcast, she will be chancellor for a very long time to come, because this project that we've been working on to change the Labour party, to win the election, change the country, that is a project which the chancellor and I've been working on together.\" He said Ms Reeves has done a \"fantastic job\" and added: \"She and I work together, we think together. In the past, there have been examples - I won't give any specific - of chancellors and prime ministers who weren't in lockstep. We're in lockstep.\""
    },
    {
        "title": "Starmer to set out 10-year vision for NHS",
        "description": "Sir Keir Starmer will set out his 10-year vision for the NHS in what the government says is \"one of the most seismic shifts\" in the health service's history.",
        "url": "https://news.sky.com/story/starmer-to-set-out-10-year-vision-for-nhs-13391633",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-nhs_6955859.jpg?20250703025645",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-02 19:21:00",
        "Headline": "The prime minister has made reforming the NHS one of his main priorities, with public satisfaction with the health service having been decimated since the pandemic.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Sir Keir Starmer will set out his 10-year vision for the NHS in what the government says is \"one of the most seismic shifts\" in the health service's history. He will pledge three main facets of the plan: moving care into the community, digitising the NHS, and a focus on sickness prevention. The prime minister will announce neighbourhood health services will be rolled out across England to improve access to the NHS and to shift care out of overstrained hospitals. PM 'might have to go in months' - politics latest  Sir Keir has already promised thousands more GPs will be trained, and to end the 8am \"scramble\" for an appointment. He also previously said his government will bring the NHS into the digital age, with \"groundbreaking\" new tools to support GPs rolled out over the next two years - including AI to take notes, draft letters and enter data. And he will promise new contracts that will encourage and allow GP practices to cover a wider geographical area, so small practices will get more support. Unite, one of the UK's largest healthcare unions, welcomed the plan cautiously but said staff need to be the focus to ensure people are better looked after. Read more:Hundreds of NHS quangos to be axedHow pilot scheme from Brazil is helping NHS  'Reform or die' Sir Keir said: \"The NHS should be there for everyone, whenever they need it. \"But we inherited a health system in crisis, addicted to a sticking plaster approach, and unable to face up to the challenges we face now, let alone in the future. \"That ends now. Because it's reform or die.\" He said the government's plan \"will fundamentally rewire and futureproof our NHS, so that it puts care on people's doorsteps, harnesses game-changing tech and prevents illness in the first place\". The PM said it would not be an \"overnight fix\", but claimed Labour are \"already turning the tide on years of decline\", pointing towards more than four million extra appointments, 1,900 more GPs, and waiting lists at a two-year low. \"But there's more to come,\" he promised. \"This government is giving patients easier, quicker and more convenient care, wherever they live.\"  Neighbourhood health services The newly announced neighbourhood health services will provide \"pioneering teams\" in local communities, so patients can more conveniently access a full range of healthcare services close to home. Local areas will be encouraged to trial innovative schemes like community outreach door-to-door to detect early signs of illness and reduce pressure on GPs and A&E. The aim is to eventually have new health centres open 12 hours a day, six days a week to offer GP services as well as diagnostics, post-operative care and rehab. They will also offer services like debt advice, employment support, stop smoking help or weight management. More NHS dentists Dentists will also be part of the plan, with dental care professionals part of the neighbourhood teams. Dental \"therapists\" will carry out check-ups, treatments and referrals, while dental nurses could give education and advice to parents or work with schools and community groups. Newly qualified dentists will be required to practice in the NHS for a minimum period, which they have said will be three years."
    },
    {
        "title": "Just 25% of public think Sir Keir Starmer will win next election - with welfare row partly to blame",
        "description": "Only a quarter of British adults think Sir Keir Starmer will win the next general election, as the party's climbdown over welfare cuts affects its standing with the public.",
        "url": "https://news.sky.com/story/just-25-of-public-think-sir-keir-starmer-will-win-next-election-with-welfare-row-partly-to-blame-13391478",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-labour-wales-keir-starmer_6952401.jpg?20250628111914",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-07-02 13:41:00",
        "Headline": "A poll by Ipsos, shared with Sky News, shows 63% do not feel confident the government is running the country efficiently - a similar verdict given to Boris Johnson and Rishi Sunak.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Only a quarter of British adults think Sir Keir Starmer will win the next general election, as the party's climbdown over welfare cuts affects its standing with the public. A fresh poll by Ipsos, shared with Sky News, also found 63% do not feel confident the government is running the country competently, similar to levels scored by previous Conservative administrations under Boris Johnson and Rishi Sunak in July 2022 and February 2023, respectively. Politics latest: 'A moment of intense peril' for PM The survey of 1,080 adults aged 18-75 across Great Britain was conducted online between 27 and 30 June 2025, when Labour began making the first of its concessions, suggesting the party's turmoil over its own benefits overhaul is partly to blame. The prime minister was forced into an embarrassing climbdown on Tuesday night over his plans to slash welfare spending, after it became apparent he was in danger of losing the vote owing to a rebellion among his own MPs.  The bill that was put to MPs for a vote was so watered down that the most controversial element - to tighten the eligibility criteria for personal independence payments (PIP) - was put on hold, pending a review into the assessment process by minister Stephen Timms that is due to report back in the autumn. The government was forced into a U-turn after Labour MPs signalled publicly and privately that the previous concession made at the weekend to protect existing claimants from the new rules would not be enough. \n                  Rachel Reeves will 'of course' be chancellor in six months' time, says senior Starmer ally\n                 \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 \n                  Labour welfare cuts 'Dickensian' and 'from another era', says rebel MP ahead of vote\n                 While the bill passed its first parliamentary hurdle last night, with a majority of 75, 49 Labour MPs still voted against it - the largest rebellion in a prime minister's first year in office since 47 MPs voted against Tony Blair's Lone Parent benefit in 1997, according to Professor Phil Cowley from Queen Mary University. It left MPs to vote on only one element of the original plan - the cut to Universal Credit (UC) sickness benefits for new claimants from £97 a week to £50 from 2026/7.  An amendment brought by Labour MP Rachael Maskell, which aimed to prevent the bill progressing to the next stage, was defeated but 44 Labour MPs voted for it. The incident has raised questions about Sir Keir's authority just a year after the general election delivered him the first Labour landslide victory in decades. Read more:How did your MP vote on Labour's welfare bill?The PM faced down his party on welfare and lost And on Wednesday, Downing Street insisted Rachel Reeves, the chancellor, was \"not going anywhere\" after her tearful appearance in the House of Commons during prime minister's questions sparked speculation about her political future. The Ipsos poll also found that two-thirds of British adults are not confident Labour has the right plans to change the way the benefits system works in the UK, including nearly half of 2024 Labour voters. Keiran Pedley, director of UK Politics at Ipsos, said: \"Labour rows over welfare reform haven't just harmed the public's view on whether they can make the right changes in that policy area, they are raising wider questions about their ability to govern too. \"The public is starting to doubt Labour's ability to govern competently and seriously at the same levels they did with Boris Johnson and Rishi Sunak's governments. Labour will hope that this government doesn't end up going the same way.\""
    },
    {
        "title": "Emotional Reeves a painful watch - and a reminder of tough decisions ahead ",
        "description": "It is hard to think of a PMQs like it - it was a painful watch.",
        "url": "https://news.sky.com/story/emotional-reeves-a-painful-watch-and-a-reminder-of-tough-decisions-ahead-13391436",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-sad-cry-tears_6955415.jpg?20250702134801",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-07-02 12:11:00",
        "Headline": "Rachel Reeves was visibly upset during PMQs. Her spokesperson said it was due to a \"personal matter\".",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  It is hard to think of a PMQs like it - it was a painful watch. The prime minister battled on, his tone assured, even if his actual words were not always convincing. But it was the chancellor next to him that attracted the most attention. Rachel Reeves looked visibly upset. It is hard to know for sure right now what was going on behind the scenes, the reasons - predictable or otherwise - why she appeared to be emotional, but it was noticeable and it was difficult to watch. Reeves looks visibly upset as Starmer defends welfare U-turn - politics latest Her spokesperson says it was a personal matter that they will not be getting into. \n                  Sir Keir Starmer could be ousted as PM within months, two senior Labour MPs tell Sky News\n                 \n                  Starmer to set out 10-year vision for NHS\n                 \n                  Politics latest: Starmer 'might have to go within months'\n                 Even Kemi Badenoch, not usually the most nimble PMQs performer, singled her out. \"She looks absolutely miserable,\" she said. Anyone wondering if Kemi Badenoch can kick a dog when it's down has their answer today. The Tory leader asked the PM if he could guarantee his chancellor's future: he could not. \"She has delivered, and we are grateful for it,\" Sir Keir said, almost sounding like he was speaking in the past tense. It is important to say: Rachel Reeves's face during one PMQs session is not enough to tell us everything, or even anything, we need to know. But given the government has just faced its most bruising week yet, it was hard not to speculate. The prime minister's spokesperson has said since PMQs that the chancellor has not offered her resignation and is not going anywhere. But Rachel Reeves has surely seen an omen of the impossible decisions ahead. How will she plug the estimated £5.5bn hole left by the welfare climbdown in the nation's finances? Will she need to tweak her iron clad fiscal rules? Will she come back for more tax rises? What message does all of this send to the markets? If a picture tells us a thousand words, Rachel Reeves's face will surely be blazoned on the front pages tomorrow as a warning that no U-turn goes unpunished."
    },
    {
        "title": "MPs vote to proscribe Palestine Action as terrorist organisation",
        "description": "MPs have voted to proscribe Palestine Action as a terrorist organisation after the group targeted an RAF base and an Israeli defence company's UK headquarters.",
        "url": "https://news.sky.com/story/mps-approve-plans-to-proscribe-palestine-action-as-terrorist-organisation-13391291",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-brandon-palestine-action_6954446.jpg?20250701125410",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-02 07:03:00",
        "Headline": "The legislation was passed by the vast majority of MPs. However, several argued that proscribing the group \"sets a dangerous precedent for political dissent\".",
        "Content": "MPs have voted to proscribe Palestine Action as a terrorist organisation after the group targeted an RAF base and an Israeli defence company's UK headquarters. The legislation passed with 385 MPs voting to proscribe the group, while 26 voted against the move. The amendment to the Terrorism Act 2000 to include Palestine Action and two white supremacist groups, Maniacs Murder Cult and Russia Imperial Movement, will go to the House of Lords on Thursday and become law at midnight on 9 July if it passes through successfully. Politics latest: PM tells chancellor she has his complete support It means it will become a criminal offence - punishable by up to 14 years in prison - to be a member of the three groups or to support them, if any legal challenges by the groups prove to be unsuccessful. Security minister Dan Jarvis told MPs protesters expressing support for Palestine \"have always been able to, and can continue to do so\". He said: \"Palestine Action is not a legitimate protest group. \"People engaged in lawful protest don't need weapons. People engaged in lawful protest do not throw smoke bombs and fire pyrotechnics around innocent members of the public. \"And people engaged in lawful protest do not cause millions of pounds of damage to national security infrastructure, including submarines and defence equipment for NATO.\" However, several Labour MPs made impassioned speeches about why they think Palestine Action should not be a terrorist organisation, and raised concerns it was grouped in with the other two. They argued that proscribing the group \"threatens basic freedoms and sets a dangerous precedent for political dissent\". Independent MP Zarah Sultana, a former Labour MP, said: \"To equate a spray can of paint with a suicide bomb isn't just absurd, it is grotesque. \"It is a deliberate distortion of the law to chill dissent, criminalise solidarity and suppress the truth.\" Read more:Two more people arrested over damage to RAF aircraftWhat does being proscribed mean? Palestine Action is seeking a legal challenge against the government's bid to proscribe it, with a hearing expected on Friday to decide whether its proscription can be temporarily blocked, pending further proceedings to decide whether a legal challenge can be brought. Members of Palestine Action are accused of entering RAF Brize Norton in Oxfordshire on 20 June and vandalising two aircraft with red paint. Five people have been arrested over the incident on suspicion of a terror offence. A security review was launched across the \"whole defence estate\" following the breach."
    },
    {
        "title": "Matt Hancock accused of insulting 'memory of every COVID victim' over inquiry comments",
        "description": "Former health secretary Matt Hancock has been accused of insulting the \"memory of each and every person who died\" over his description of the way patients were discharged into care homes during the COVID pandemic.",
        "url": "https://news.sky.com/story/matt-hancock-accused-of-insulting-memory-of-every-covid-victim-over-inquiry-comments-13391484",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-matt-hancock-covid_6955251.jpg?20250702115907",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-02 13:58:00",
        "Headline": "When the pandemic hit in early 2020, hospital patients were rapidly discharged into care homes - but there was no policy requiring them to be tested for COVID before admission.",
        "Content": "Former health secretary Matt Hancock has been accused of insulting the \"memory of each and every person who died\" over his description of the way patients were discharged into care homes during the COVID pandemic. Speaking at the inquiry into the government's handling of the crisis, Mr Hancock said discharging patients from hospitals to care homes in the early stages of the pandemic was \"the least-worst decision\" at the time. \"It was formally a government decision,\" he added. \"It was signed off by the prime minister. It was really driven by Simon Stevens, the chief executive of the NHS, but it was widely discussed. \"Nobody has yet provided me with an alternative that was available at the time that would have saved more lives.\" When the pandemic hit in early 2020, hospital patients were rapidly discharged into care homes in a bid to free up beds and prevent the NHS from becoming overwhelmed. But there was no policy in place requiring patients to be tested for COVID before admission, or for asymptomatic patients to isolate, until mid-April - despite growing awareness of the risks of people without symptoms spreading the virus. The High Court ruled in 2022 that government policies on discharging hospital patients into care homes at the start of the pandemic were \"unlawful\". Nicola Brook, a solicitor for more than 7,000 families from COVID-19 Bereaved Families for Justice UK, said Mr Hancock's claim that the policy had been the least-worst decision available was \"an insult to the memory of each and every person who died\". She added: \"He knew at the time that many care homes did not have the ability to isolate the people who would be discharged from hospital and that COVID was airborne.\" Health correspondent Matt Hancock has given evidence to the COVID inquiry many times before. He has been accused of being combative, bullish and insensitive.  Wednesday's appearance will do nothing to diminish that criticism. This module deals specifically with care homes. The government's decision to allow mostly untested patients into care homes with their population of elderly, vulnerable residents is widely seen as its most controversial move during the health emergency. It resulted in the deaths of thousands of care home residents. At the time, addressing the country during a Downing Street press conference, Mr Hancock said a protective ring had been thrown around care homes. When challenged on that statement today, the former health secretary said it was \"rhetoric\". He had tried, he said. But it was impossible. Mr Hancock told the inquiry it was not his decision but a collective one that he was charged with enforcing. He stressed several times it was the \"least worst option\" because if he had not acted to create capacity in hospitals by transferring patients, the NHS would have been overwhelmed. When challenged with evidence presented to the inquiry that Mr Hancock \"lied about the situation\" and he had left older people to be \"culled\" because they could no longer contribute to society, Mr Hancock simply countered by saying he had had people in touch at the time thanking him for his efforts. And this was said to an inquiry room where people who had lost loved ones in care homes sat barely a few feet away. No contrition. No apology. No empathy. 'We were in bleak circumstances' Mr Hancock, who offered no apology at the inquiry, became health secretary in 2018. He resigned from the Conservative government in 2021 after admitting to breaking social distancing guidance by having an affair with a colleague. He added: \"We were trying to do everything that we possibly could, we were in bleak circumstances.\"  The inquiry has previously heard there were more than 43,000 deaths involving the virus in care homes across the UK between March 2020 and July 2022. A civil servant was quoted earlier this week describing the figure as a \"generational slaughter within care homes\". Read more from Sky News:'Catastrophic failure' led to Heathrow power outageNo 10 backs Reeves and says she is 'going nowhere' 'Would my dad still be alive?' Sharon Cook, whose parents were living in a care home when the pandemic struck, said there was a \"lot of confusion\" about the guidance at the time. She told Sky News her mother tested positive for COVID and died three days later. She was allowed into the care home to tell her father, who had dementia, but after one visit, she was prevented from returning. A week later, her father died and when she went to the care home, she was told they had not attempted to resuscitate him. When she asked why, they showed her a DNAR (Do Not Attempt Resuscitation) form, which, they said, \"had been in consultation with me\". \"If they'd been using the proper form, a more up-to-date form, I would have had to countersign,\" she said. \"So I would have seen that, and then I could have exercised his right to have a second opinion. \"So I'll never know if he would have survived, or not, but there was certainly a lot of confusion around care homes at the time that the guidance was being given. \"And when I went back three months later to discuss what had happened, they actually said, 'oh, our mistake, we should have actually let you in. \"If I'd been let in, would my dad still be with me? I don't know.\""
    },
    {
        "title": "Rachel Reeves will 'of course' be chancellor in six months' time, says senior Starmer ally",
        "description": "Rachel Reeves will \"of course\" be chancellor in six months' time, a senior ally of Sir Keir Starmer has said, despite last night's humiliating showdown over welfare cuts.",
        "url": "https://news.sky.com/story/rachel-reeves-will-of-course-be-chancellor-in-six-months-time-says-senior-starmer-ally-13391272",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-politics_6940579.jpg?20250612204238",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-02 06:16:00",
        "Headline": "Pat McFadden defends the handling of the chaotic welfare vote - but admits offering such huge concessions will have \"financial consequences\".",
        "Content": " Rachel Reeves will \"of course\" be chancellor in six months' time, a senior ally of Sir Keir Starmer has said, despite last night's humiliating showdown over welfare cuts. Pat McFadden, the chancellor of the Duchy of Lancaster, admitted there would be a \"cost\" to the government's decision to effectively neuter its welfare bill, which was intended to save Ms Reeves around £5bn but now leaves her with an estimated £5.5bn black hole. Speaking to Kamali Melbourne on Sky News' Breakfast Mr McFadden acknowledged it had been a \"tough\" few weeks for the government as it faced down its backbenchers over proposals to shake up the welfare system. Politics latest: Tories go on the attack against Rachel Reeves The prime minister's watered-down Universal Credit and Personal Independent Payment Bill, aimed at saving £5.5bn, was backed by a majority of 75 in a tense vote on Tuesday evening. A total of 49 Labour MPs voted against the bill - the largest rebellion in a prime minister's first year in office since 47 MPs voted against Tony Blair's Lone Parent benefit in 1997, according to Professor Phil Cowley from Queen Mary University. Ms Reeves has borne a lot of the criticism over the handling of the vote, with some MPs believing that her strict approach to fiscal rules has meant she has approached the ballooning welfare bill from the standpoint of trying to make savings, rather than getting people into work. \n                  Just 25% of public think Sir Keir Starmer will win next election - with welfare row partly to blame\n                 \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 \n                  Labour welfare cuts 'Dickensian' and 'from another era', says rebel MP ahead of vote\n                 Experts have also warned that the welfare U-turn, on top of reversing the cut to winter fuel, means that tax rises in the autumn are more likely. Asked whether he believed Ms Reeves would still be in her job in the next six months, Mr McFadden replied: \"Of course she will. She's doing an excellent job. We take these decisions as a team. We stand as a team, and we go forward as a team.\" The senior cabinet minister sought to downplay the chaotic scenes that unfolded in the Commons last night, when the government pulled the most controversial elements of the bill, leaving MPs to vote on only one element - cutting universal credit (UC) sickness benefits for new claimants from £97 a week to £50 from 2026/7.  Just 90 minutes before voting started on Tuesday evening, disabilities minister Stephen Timms announced the last of a series of concessions made as dozens of Labour MPs spoke of their fears for disabled and sick people if the bill was made law. In a major U-turn, he said changes in eligibility for the personal independence payment (PIP), the main disability payment to help pay for extra costs incurred, would not take place until a review he is carrying out into the benefit is published in autumn 2026. An amendment brought by Labour MP Rachael Maskell, which aimed to prevent the bill progressing to the next stage, was defeated but 44 Labour MPs voted for it. Conservative shadow chancellor Mel Stride called the vote \"farcical\" and said the government \"ended up in this terrible situation\" because they \"rushed it\". He warned the markets \"will have noticed that when it comes to taking tougher decisions about controlling and spending, this government has been found wanting\". Read more:Beth Rigby: I suspect things may only get worse for the PMHow did your MP vote on Labour's welfare bill?Beth Rigby: The PM's choice - welfare v warfare Mr McFadden argued it was not \"entirely a bad thing that Labour MPs feel passionately about this issue\" despite it causing the most damaging rebellion of the prime minister's leadership so far.  \"There's a long history of Labour MPs feeling passionately about this issue. But where we've got to, in the end, is the second reading of the bill going through and the reforms to PIP, which were the most contentious part of this taken forward in slower time now, through a review led by my colleague Stephen Timms.\" He added: \"There is a financial consequence to the decision - there's no denying that. \"But this is also about changing incentives, getting a better system, getting more support for people, who are looking for work. \"There are important key elements of the welfare reform package that were passed in the vote last night that were still valuable. And we will take that forward.\""
    },
    {
        "title": "More bad news for Elon Musk as Tesla deliveries miss target again",
        "description": "Tesla's woes have deepened as latest production and deliveries figures showed a greater fall than expected. ",
        "url": "https://news.sky.com/story/more-bad-news-for-elon-musk-as-tesla-deliveries-miss-target-again-13391543",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tesla-cybertruck_6862559.jpg?20250320202636",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-02 15:54:00",
        "Headline": "The world's richest man was forced to exit full-time politics and focus more of his energies on Tesla after the company's performance lagged. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Tesla's woes have deepened as latest production and deliveries figures showed a greater fall than expected.  A total of 384,122 Teslas were delivered from April to June this year, a 13.5% drop on the same period last year and the second quarter of slumping output. Wall Street analysts had expected Tesla to report about 1,000 more deliveries. It's bad news for Tesla chief executive Elon Musk in a week of attacks from President Donald Trump on him personally, as well as his companies. Money blog: Customers to get up to £2,000 compensation from water companies Mr Musk found himself on the wrong side of Mr Trump and the majority of US congresspeople in his opposition to the so-called big beautiful bill approved by the US Senate. His criticism of the inevitable debt rises the bill will result in led Mr Trump threatening to end subsidies for Mr Musk's numerous businesses and to deport him. \n                  Drivers 'confused' by transition to electric vehicles, ministers warned\n                 \n                  'Big opportunity' for Chinese electric carmakers in the UK, newest entrant XPENG tells Sky News\n                 \n                  Electric car demand reaches record high in January but misses target - SMMT data\n                  His role as founder and chief executive of numerous businesses has made him the world's richest man, according to Forbes. As well as Tesla, Mr Musk founded space technology company SpaceX and Starlink. He also acquired the social media company Twitter, which he rebranded X. It was the poor performance of Tesla that pushed him out of full-time politics and back to the Tesla offices. Read more:AstraZeneca exit is a frightening prospect for the City and the governmentSantander bank deal could mean TSB name disappears from UK high street After months of share price tumbles and protests at Tesla showrooms, sales drops and car defacings, Musk left his work with the Trump administration's Department of Government Efficiency (DOGE). Not everyone viewed the figures as negative. Analysts at financial services firm Wedbush said: \"Tesla's future is in many ways the brightest it's ever been in our view given autonomous, FSD [full self-driving], robotics, and many other technology innovations now on the horizon with 90% of the valuation being driven by autonomous and robotics over the coming years but Musk needs to focus on driving Tesla and not putting his political views first.\" After a 5% share price fall earlier this week when Mr Musk strayed back into political matters, Tesla stock rose 4.5% on Wednesday. The latest financial details for Tesla will be published later this month. In the first three months of the year, Tesla's profits fell by 71% to $409m (£306.77m) from $1.39bn (£1.04bn). Revenues were also well below forecasts, dropping 9% to $19.3bn (£14.5bn)."
    },
    {
        "title": "Sean 'Diddy' Combs denied bail after being convicted over prostitution-related offences",
        "description": "Sean \"Diddy\" Combs has been found guilty of transportation for prostitution following a landmark trial in New York - but cleared of more serious charges of sex trafficking and racketeering conspiracy.",
        "url": "https://news.sky.com/story/sean-diddy-combs-guilty-of-prostitution-offences-but-cleared-of-sex-trafficking-and-racketeering-13389065",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-2017_6907253.jpg?20250625170536",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-02 14:15:00",
        "Headline": "Jurors in the high-profile trial of hip-hop mogul Sean \"Diddy\" Combs have reached their verdict after seven weeks of evidence.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Sean \"Diddy\" Combs has been found guilty of transportation for prostitution following a landmark trial in New York - but cleared of more serious charges of sex trafficking and racketeering conspiracy. The hip-hop mogul was accused by prosecutors of abusing and coercing three alleged victims, including his former long-term partner, singer and model Cassie Ventura, and other crimes including kidnapping, arson and blackmail. Jurors decided not all the allegations were proven - but Combs still faces several years in prison after being convicted of transporting people across the US, including Cassie and another former girlfriend \"Jane\", and paying male escorts to engage in sexual encounters. However, with the not guilty verdict on three other more serious charges - racketeering conspiracy and two of sex trafficking - the 55-year-old has avoided a maximum possible sentence of life behind bars. Despite a request by his defence team, he was denied bail ahead of sentencing - which has been scheduled for Friday 3 October. Marc Agnifilo, part of Diddy's defence team, described the ruling as \"a victory of all victories\". Outside the courthouse, he said the jury \"got the situation right, or certainly right enough\". Another of his lawyers, Nicole Westmoreland, said: \"He actually battled for his freedom, for his innocence, and he did it. \"And, you know, a lot of times, people are too afraid to do it. Today is a major win to show what the system can do.\" The mixed result from the jury came not long into their third day of deliberations. In the courtroom in Manhattan, there were cheers from Combs's family - and the rapper himself held his hands up in a prayer motion, looking at the jury, and hugged his defence lawyer Teny Geragos. His mood seemed very different to just a day earlier - when he learned the jury had reached a verdict on four of the five charges, but were split on the racketeering charge. After deliberating for longer on Wednesday, they came to a unanimous decision. As the verdict sunk in, Combs appeared overwhelmed, kneeling at his chair and bowing his head in prayer once again. \"I'll be home soon,\" he said as he faced his family members. \"I love you, Mum.\" The application for bail Combs's defence team argued that as he had been cleared of the most serious charges, he should be bailed ahead of sentencing. His lawyer Marc Agnifilo said he had been a model prisoner and added: \"He's not going to flee. He's been given his life back.\" But prosecutor Maurene Comey argued Combs had a history of violence, which Judge Arub Subramanian agreed with. \"At trial, the defence conceded the defendant's violence in his personal relationships,\" he said. After being denied bail, Combs attempted get the judge's attention - but after consulting with Mr Agnifilo, he did not speak. Cassie 'paved the way' Reacting to the verdict, Cassie's lawyer Douglas H Wigdor said that although jurors did not find Combs guilty of sex-trafficking Cassie, she had \"paved the way\" for the other guilty verdicts. \"By coming forward with her experience, Cassie has left an indelible mark on both the entertainment industry and the fight for justice,\" he said. \"We must repeat - with no reservation - that we believe and support our client, who showed exemplary courage throughout this trial.\" Cassie, who testified heavily pregnant just three weeks before giving birth, displayed \"unquestionable strength\", he added, and \"brought attention to the realities of powerful men in our orbit\". Videos of \"freak off\" sex sessions with male escorts were shown to jurors only during the seven-week trial, with the footage kept private from members of the public and media in court. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs Former employees, along with escorts, hotel staff and police officers were among those to give evidence. Cassie and Jane, who used a pseudonym, also testified. They told the court they were coerced into drug-fuelled \"freak offs\" - which were also referred to as \"hotel nights\" or \"wild king nights\" - with male escorts, and abused throughout their relationships. Combs's defence team presented a very different picture to show that sexual acts, including freak offs, were consensual. They conceded the music star could be violent, had a bad temper and used drugs. He also had multiple relationships at the same time. But crucially, they said, while he was \"not proud\" of some of his behaviour, none of it made him guilty of the charges against him. After hearing evidence of flights and travel for escorts and Cassie and Jane, paid for by Combs, as well as hotel bookings across the US and the Caribbean, jurors found him guilty of the transportation to engage in prostitution charges. However, they did not find that the allegations against the rapper amounted to sex trafficking or racketeering.  The Cassie hotel tape Combs, known variously as Puff Daddy, P Diddy, and Diddy over the years, was once one of the most influential figures in hip-hop - famous as a producer, founder of Bad Boy Records and manager of the late Notorious BIG in the 1990s, as well as a rapper in his own right. As an artist, he won three Grammys during his career, and had hits including I'll Be Missing You, Come With Me, and Bad Boy For Life. In September 2023, he received the \"global icon\" award from MTV and was given the key to New York City at a ceremony in Times Square, just a few miles away from the streets in Harlem where he spent his first years. Allegations first came to prominence in November 2023, when Cassie filed a bombshell lawsuit accusing him of coercing her into unwanted sex sessions, as well as blackmail and several incidences of violence. The suit was settled in 24 hours - for $20m, it emerged during the trial - but months later CNN aired hotel security footage showing Combs punching and kicking Cassie and throwing her to the floor in 2016. He apologised after the video aired, saying: \"I was disgusted when I did it.\" Footage from the hotel incident was shown during the trial. Following the verdict, the rapper now awaits sentencing. He also still faces several civil lawsuits, most of which were filed in the wake of his arrest in September 2024."
    },
    {
        "title": "Bob Vylan to no longer headline festival in Manchester after Glastonbury controversy",
        "description": "Punk rap duo Bob Vylan will no longer headline the Radar Festival in Manchester days after leading chants of \"death to the IDF\" at Glastonbury.",
        "url": "https://news.sky.com/story/bob-vylan-to-no-longer-headline-festival-in-manchester-after-glastonbury-controversy-13391486",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952866.jpg?20250628221842",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-02 14:00:00",
        "Headline": "The punk rap due are facing two police investigations: one for chants at Glastonbury and another over comments allegedly made during a concert in London in May. ",
        "Content": "Punk rap duo Bob Vylan will no longer headline the Radar Festival in Manchester days after leading chants of \"death to the IDF\" at Glastonbury. The performance on the West Holts Stage on Saturday was livestreamed on the BBC - leading the corporation to apologise as it described the chants referencing the Israeli military as \"antisemitic\" and \"unacceptable\". Avon and Somerset Police announced on Monday that it had opened a criminal investigation after reviewing footage of performances at Glastonbury by Bob Vylan and Irish hip hop trio Kneecap. The Metropolitan Police has now said it has launched a separate investigation after Bob Vylan allegedly called for \"death to every single IDF soldier out there\" at a gig one month before Glastonbury. \"Officers are investigating comments allegedly made during a concert at Alexandra Palace earlier this year,\" A Met spokesperson said on Wednesday. \"The decision to investigate follows the emergence of footage which appears to have been filmed at the venue on 28 May 2025.\" The pair had supported Iggy Pop at the London venue. In a post on Instagram on Wednesday, the Radar Festival, which takes place at the O2 Victoria Warehouse in Manchester, wrote: \"Bob Vylan will not be appearing at Radar Festival this weekend.\" The festival has not explained why the duo will no longer appear on Saturday night - with its line-up now reading \"headliner TBC\". In response, the group shared the festival's statement on their Instagram story, adding the caption: \"Silence is not an option. We will be fine, the people of Palestine are hurting. Manchester we will be back.\" It comes after the band were barred from the US, where they were due to tour in autumn with performances in Chicago, Brooklyn and Philadelphia. US deputy secretary of state Christopher Landau said the duo's visas were revoked for their \"hateful tirade at Glastonbury\". The band have also been pulled from an upcoming performance at a German music venue. In a statement on Tuesday, the duo said they were being \"targeted for speaking up\" after police opened their investigation. They wrote: \"We are not for the death of Jews, Arabs or any other race or group of people. \"We are for the dismantling of a violent military machine. A machine whose own soldiers were told to use \"unnecessary lethal force\" against innocent civilians waiting for aid. \"A machine that has destroyed much of Gaza.\" The statement added: \"We, like those in the spotlight before us, are not the story. \"We are a distraction from the story. And whatever sanctions we receive will be a distraction.\" Read more:Chief rabbi condemns BBC over Bob Vylan chantsBob Vylan have US visas revokedCulture secretary Lisa Nandy hits out at BBC During the performance on Saturday, Bobby Vylan, one half of the duo, also led his crowd in chants that included \"Free, free Palestine\". Bob Vylan performed on the West Holts Stage slot directly before Kneecap, whose member Liam Og O hAnnaidh, also known as Mo Chara, appeared in court in June charged with a terror offence. He is accused of displaying a flag in support of Hezbollah, a proscribed organisation in the UK, at a gig last year. Kneecap also led the Glastonbury crowd in \"Free Palestine\" chants. The BBC has faced strong criticism for continuing to livestream the Bob Vylan performance on iPlayer with on-screen warnings about discriminatory language. It has since been revealed that BBC director-general Tim Davie was at Glastonbury when the chants were broadcast. A BBC spokesperson said: \"The director-general was informed of the incident after the performance and at that point he was clear it should not feature in any other Glastonbury coverage.\" Culture Secretary Lisa Nandy criticised the BBC over its decision not to pull the Bob Vylan livestream during the chants on Saturday and said there is \"a problem of leadership\" at the corporation. The group was formed in Ipswich in 2017, and are known for addressing political issues in their albums, including racism, masculinity and class. The group are scheduled to perform at the Boardmasters surfing and music festival in Newquay, Cornwall in August."
    },
    {
        "title": "Snake captured on passenger plane - as expert reveals how it got there",
        "description": "A flight in Australia was delayed for two hours after a stowaway snake was found in the plane's cargo hold.",
        "url": "https://news.sky.com/story/snake-on-a-plane-flight-delayed-for-two-hours-as-catcher-comes-to-the-rescue-13391249",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-snake-plane_6954978.jpg?20250702044110",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-07-02 03:16:00",
        "Headline": "The reptile was found as passengers were boarding Virgin Australia Flight VA337 at Melbourne Airport bound for Brisbane.",
        "Content": " A flight in Australia was delayed for two hours after a stowaway snake was found in the plane's cargo hold. The reptile was found as passengers were boarding Virgin Australia Flight VA337 at Melbourne Airport bound for Brisbane. Snake catcher Mark Pelley said he thought it could be venomous when he approached it in the darkened hold. But it turned out to be a harmless 60cm green tree snake. \"It wasn't until after I caught the snake that I realised that it wasn't venomous. Until that point, it looked very dangerous to me,\" Mr Pelley said. He said when he entered the cargo hold, the snake was half hidden behind a panel and he feared it could flee deeper into the plane. \"I had one chance to grab it, and if it escaped past me it would have gone into the panels, and then that would have been extremely hard to catch,\" he told Sky News. \"Snakes are very fast-moving, thin and agile,\" he added. Mr Pelley said he told an aircraft engineer and airline staff they would have to evacuate the aircraft if the snake disappeared inside the plane. \"I said to them if I don't get this in one shot, it's going to sneak through the panels and you're going to have to evacuate the plane because at that stage I did not know what kind of snake it was,\" he explained in a separate interview. \"But thankfully, I got it on the first try and captured it,\" he added. \"If I didn't get it that first time, the engineers and I would be pulling apart a [Boeing] 737 looking for a snake still right now.\" Read more from Sky News:Trump claims Israel has agreed to 60-day ceasefire in Gaza'Diddy' holds head in his hands as jury reaches partial verdict Mr Pelley said because the snake is native to the Brisbane region he suspects it came on board inside a passenger's luggage and escaped. \"It's actually very uncommon for snakes to be on the plane,\" he told Sky News. For quarantine reasons the snake cannot be returned to the wild. The animal, a protected species, has been given to a Melbourne vet to find a home with a licensed snake keeper."
    }
]