[
    {
        "title": "Trump says Israel has agreed on terms for 60-day ceasefire in Gaza, and has warning for Hamas",
        "description": "Donald Trump has said Israel has agreed on terms for a 60-day ceasefire in Gaza, and is urging Hamas to accept the deal before conditions worsen.",
        "url": "https://news.sky.com/story/trump-says-israel-has-agreed-on-terms-for-60-day-ceasefire-in-gaza-and-has-warning-for-hamas-13391229",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-israel_6954967.jpg?20250702031515",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-01 23:41:00",
        "Headline": "The US president has been increasing pressure on the Israeli government and Hamas to work out a ceasefire and hostage agreement to end the war in Gaza.",
        "Content": " Donald Trump has said Israel has agreed on terms for a 60-day ceasefire in Gaza, and is urging Hamas to accept the deal before conditions worsen. The US president announced the development ahead of hosting Israeli Prime Minister Benjamin Netanyahu for talks at the White House next week. He has been increasing pressure on the Israeli government and Hamas to work out a ceasefire and hostage agreement to end the war. \"My Representatives had a long and productive meeting with the Israelis today on Gaza. Israel has agreed to the necessary conditions to finalise the 60 Day CEASEFIRE, during which time we will work with all parties to end the War,\" Mr Trump wrote on social media - adding that Qatari and Egyptian officials would deliver the final proposal. \"I hope, for the good of the Middle East, that Hamas takes this Deal, because it will not get better - IT WILL ONLY GET WORSE.\" US correspondent In the long Gaza war, this is a significant moment. For the people of Gaza, for the hostages and their families - this could be the moment it ends. But we have been here before, so many times.  The key question - will Hamas accept what Israel has agreed to: a 60-day ceasefire? At the weekend, a source at the heart of the negotiations told me: \"Both Hamas and Israel are refusing to budge from their position - Hamas wants the ceasefire to last until a permanent agreement is reached. Israel is opposed to this. At this point only President Trump can break this deadlock.\" The source added: \"Unless Trump pushes, we are in a stalemate.\" The problem is that the announcement made now by Donald Trump - which is his social-media-summarised version of whatever Israel has actually agreed to - may just amount to Israel's already-established position.  We don't know the details and conditions attached to Israel's proposals.  Would Israeli troops withdraw from Gaza? Totally? Or partially? How many Palestinian prisoners would they agree to release from Israel's jails? And why only 60 days? Why not a total ceasefire? What are they asking of Hamas in return? We just don't know the answers to any of these questions, except one.  We do know why Israel wants a 60-day ceasefire, not a permanent one. It's all about domestic politics.  If Israeli Prime Minister Benjamin Netanyahu was to agree now to a permanent ceasefire, the extreme right-wingers in his coalition would collapse his government.  Itamar Ben-Gvir and Bezalel Smotrich have both been clear about their desire for the war to continue. They hold the balance of power in Mr Netanyahu's coalition.   If Mr Netanyahu instead agrees to just 60 days - which domestically he can sell as just a pause - then that may placate the extreme right-wingers for a few weeks until the Israeli parliament, the Knesset, is adjourned for the summer. It is also no coincidence that the US president has called for Mr Netanyahu's corruption trial to be scrapped.  Without the prospect of jail, Mr Netanyahu might be more willing to quit the war safe in the knowledge that focus will not shift immediately to his own political and legal vulnerability."
    },
    {
        "title": "The PM faced down his party on welfare and lost. I suspect things may only get worse",
        "description": "So much for an end to chaos and sticking plaster politics.",
        "url": "https://news.sky.com/story/pms-last-minute-climbdown-on-welfare-left-onlookers-aghast-and-will-embolden-labour-mps-13391160",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-beth-rigby_6915218.jpg?20250513140605",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-07-01 23:58:00",
        "Headline": "The prime minister has suffered damage to his authority and lost goodwill among some Labour MPs over how efforts to reform welfare have unfolded - and it may be Rachel Reeves picking up the pieces.",
        "Content": "\n          Political editor\n              @BethRigby\n  So much for an end to chaos and sticking plaster politics. Yesterday, Sir Keir Starmer abandoned his flagship welfare reforms at the eleventh hour - hectic scenes in the House of Commons that left onlookers aghast. Facing possible defeat on his welfare bill, the PM folded in a last-minute climbdown to save his skin.  The decision was so rushed that some government insiders didn't even know it was coming - as the deputy PM, deployed as a negotiator, scrambled to save the bill or how much it would cost. \"Too early to answer, it's moved at a really fast pace,\" said one. The changes were enough to whittle back the rebellion to 49 MPs as the prime minister prevailed, but this was a pyrrhic victory. Sir Keir lost the argument with his own backbenchers over his flagship welfare reforms, as they roundly rejected his proposed cuts to disability benefits for existing claimants or future ones, without a proper review of the entire personal independence payment (PIP) system first. PM wins key welfare vote - follow latest  That in turn has blown a hole in the public finances, as billions of planned welfare savings are shelved. Chancellor Rachel Reeves now faces the prospect of having to find £5bn. As for the politics, the prime minister has - to use a war analogy - spilled an awful lot of blood for little reward. He has faced down his MPs and he has lost.  They will be emboldened from this and - as some of those close to him admit - will find it even harder to govern. After the vote, in central lobby, MPs were already saying that the government should regard this as a reset moment for relations between No 10 and the party. The prime minister always said during the election that he would put country first and party second - and yet, less than a year into office, he finds himself pinned back by his party and blocked from making what he sees are necessary reforms. I suspect it will only get worse. When I asked two of the rebel MPs how they expected the government to cover off the losses in welfare savings, Rachael Maskell, a leading rebel, suggested the government introduce welfare taxes. Meanwhile, Work and Pensions Select Committee chair Debbie Abrahams told me \"fiscal rules are not natural laws\" - suggesting the chancellor could perhaps borrow more to fund public spending. Read more:How did your MP vote?Welfare cuts branded 'Dickensian'  These of course are both things that Ms Reeves has ruled out. But the lesson MPs will take from this climbdown is that - if they push hard in enough and in big enough numbers - the government will give ground. The fallout for now is that any serious cuts to welfare - something the PM says is absolutely necessary - are stalled for the time being, with the Stephen Timms review into PIP not reporting back until November 2026.  Had the government done this differently and reviewed the system before trying to impose the cuts - a process only done ahead of the Spring Statement in order to help the chancellor fix her fiscal black hole - they may have had more success. Those close to the PM say he wants to deliver on the mandate the country gave him in last year's election, and point out that Sir Keir Starmer is often underestimated - first as party leader and now as prime minister. But on this occasion, he underestimated his own MPs. His job was already difficult enough - and after this it will be even harder still. If he can't govern his party, he can't deliver change he promised."
    },
    {
        "title": "Sean 'Diddy' Combs holds head in his hands as jury reaches a partial verdict",
        "description": "Jurors in the trial of Sean \"Diddy\" Combs have reached a verdict on four of the five counts against him - but the hip-hop mogul will have to wait to learn his fate.",
        "url": "https://news.sky.com/story/sean-diddy-combs-jurors-reach-verdicts-on-four-out-of-five-charges-in-sex-trafficking-and-racketeering-trial-13391219",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sean-combs-diddy-trial_6954953.jpg?20250701232106",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-01 21:32:00",
        "Headline": "Jurors sent a note to say they had reached verdicts on two charges of sex-trafficking and two charges of transportation for prostitution - but had been unable to reach a unanimous decision on the charge of racketeering conspiracy.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Jurors in the trial of Sean \"Diddy\" Combs have reached a verdict on four of the five counts against him - but the hip-hop mogul will have to wait to learn his fate. In tense scenes towards the end of the court day on Tuesday, jurors sent a note to say they had reached verdicts on two charges of sex trafficking and two charges of transportation for prostitution, but had been unable to reach a unanimous decision on the charge of racketeering conspiracy. Combs's lawyers surrounded him at the defence table after the note was sent to the court, and at one point he held his head in his hands. After discussions with prosecution and defence lawyers, Judge Arun Subramanian told jurors to continue deliberating on Wednesday rather than deliver a partial verdict. Diddy trial - live updates The jury has testimony from more than 30 witnesses to consider - including Combs's former long-term partner Casandra \"Cassie\" Ventura and another former girlfriend called \"Jane\", who testified under a pseudonym to protect her identity. Prosecutors allege the 55-year-old rapper used his fame and power to force Cassie and \"Jane\" into drug-fuelled sex sessions with male sex workers, which were referred to as \"freak-offs\", \"wild king nights\", or \"hotel nights\". He was also physically violent and blackmailed them with footage, jurors were told. They also heard from \"Mia\", a former employee who alleged she was sexually assaulted by the rapper on several occasions during her career. She also testified using a pseudonym. Combs has pleaded not guilty to all charges and his defence team has argued that prosecutors are attempting to criminalise what they say was a consensual \"swingers lifestyle\". The rapper chose not to testify and his lawyers did not call any witnesses, building their arguments instead through lengthy cross-examinations of the witnesses called by the prosecution. Count 1: Racketeering conspiracy - up to life in prison Count 2: Sex-trafficking of Cassie Ventura - a minimum of 15 years and maximum of life in prison Count 3: Transporting individuals including but not limited to Cassie Ventura to engage in prostitution - a maximum sentence of 10 years in prison Count 4: Sex-trafficking of Jane* - a minimum of 15 years and maximum of life in prison Count 5: Transporting individuals including but not limited to Jane to engage in prostitution - a maximum of 10 years in prison What is racketeering conspiracy? Racketeering conspiracy, which is count one on the verdict sheet, is the most complicated of the charges against Combs. Jurors need to decide not only whether the rapper created a \"racketeering enterprise\", but also if he was involved in various offences as part of this, including kidnapping, arson and bribery. The charge falls under the US's RICO laws (the Racketeer Influenced and Corrupt Organisations Act), which is best known for being used in relation to organised crime and drug cartel cases. Read more:Prosecution's closing argumentDefence's closing argument After closing arguments last week, jurors began deliberation on Monday and had spent about 13 hours discussing in total by the time they sent their note. Before reaching the verdict on the four counts, they had requested to review crucial testimony from Cassie about her account of an assault in a hotel in Los Angeles in 2016. Captured on CCTV, the footage was played in court several times - showing Combs, wearing only a towel and socks, beating, kicking and dragging Cassie in a hallway. His defence team admitted in their opening statement that this was domestic violence, and said the music star regretted these actions - but that they did not amount to any of the federal charges against him. Read more:The rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony As well as Cassie's evidence on that assault, they asked to see her testimony on an incident at the Cannes Film Festival in 2013 - when she said Combs accused her of taking drugs from him and kicked her off of his yacht. On their way back to the US, she told the court, he threatened to release explicit videos of her having sex with an escort. Jurors also wanted to review testimony given by a male sex worker at the start of the trial. Combs could face 15 years to life in prison if he is convicted of all charges. Jurors will continue deliberating on the racketeering conspiracy charge on Wednesday."
    },
    {
        "title": "Women's Euros: Concerns for player safety as tournament kicks off in Switzerland",
        "description": "The Women's Euros begin in Switzerland today - with extreme heat warnings in place.",
        "url": "https://news.sky.com/story/womens-euros-extreme-heat-warnings-in-place-as-tournament-kicks-off-13391211",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-euro-switzerland_6954934.jpg?20250701223529",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-07-01 23:01:00",
        "Headline": "The global football players' union has raised concerns about whether the stars of the sport are being protected in hot and humid conditions.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The Women's Euros begin in Switzerland today - with extreme heat warnings in place. Security measures have had to be relaxed by UEFA for the opening matches so fans can bring in water bottles. Temperatures could be about 30C (86F) when the Swiss hosts open their campaign against Norway in Basel this evening. Players have already seen the impact of heatwaves this summer at the men's Club World Cup in the US. It is raising new concerns in the global players' union about whether the stars of the sport are being protected in hot and humid conditions. FIFPRO has asked FIFA to allow cooling breaks every 15 minutes rather than just in the 30th minute of each half. There's also a request for half-time to be extended from 15 to 20 minutes to help lower the core temperature of players. \n                  England beat Germany in final to retain U21 European Championship title\n                 \n                  Jess Fishlock: Mural of Wales star unveiled in 'European first'\n                 \n                  Former England boss Gareth Southgate receives knighthood\n                 FIFPRO's medical director, Dr Vincent Gouttebarge, said: \"There are some very challenging weather conditions that we anticipated a couple of weeks ago already, that was already communicated to FIFA. \"And I think the past few weeks were confirmation of all worries that the heat conditions will play a negative role for the performance and the health of the players.\" Football has seemed focused on players and fans baking in the Middle East - but scorching summers in Europe and the US are becoming increasingly problematic for sport. While climate change is a factor, the issue is not new and at the 1994 World Cup, players were steaming as temperatures rose in the US. There is now more awareness of the need for mitigation measures among players and their international union. FIFPRO feels football officials weren't responsive when it asked for kick-off times to be moved from the fierce afternoon heat in the US for the first 32-team Club World Cup. FIFA has to balance the needs of fans and broadcasters with welfare, with no desire to load all the matches in the same evening time slots. Electric storms have also seen six games stopped, including a two-hour pause during a Chelsea game at the weekend. This is the dress rehearsal for the World Cup next summer, which is mostly in the US. The use of more indoor, air conditioned stadiums should help. There is no prospect of moving the World Cup to winter, as Qatar had to do in 2022. And looking further ahead to this time in 2030, there will be World Cup matches in Spain, Portugal and Morocco. The temperatures this week have been hitting 40C (104F) in some host cities. Read more:Ex-England boss receives knighthoodFootball star mural unveiled  FIFA said in a statement to Sky News: \"Heat conditions are a serious topic that affect football globally. \"At the FCWC some significant and progressive measures are being taken to protect the players from the heat. For instance, cooling breaks were implemented in 31 out of 54 matches so far. \"Discussions on how to deal with heat conditions need to take place collectively and FIFA stands ready to facilitate this dialogue, including through the Task Force on Player Welfare, and to receive constructive input from all stakeholders on how to further enhance heat management. \"In all of this, the protection of players must be at the centre.\""
    },
    {
        "title": "Man arrested on suspicion of murder after inmate found dead in prison cell",
        "description": "A man has been arrested on suspicion of murder after an inmate was found dead inside his prison cell.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-murder-after-inmate-found-dead-in-prison-cell-13391222",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hmp-barlinnie-prison_6912384.jpg?20250521134734",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-01 22:07:00",
        "Headline": "Police said they responded to a report of a man in his 40s being found dead at a Shropshire prison at around 7.40am on Tuesday. ",
        "Content": "A man has been arrested on suspicion of murder after an inmate was found dead inside his prison cell. West Mercia Police said it received a report from HMP Stoke Heath in Shropshire that a man in his 40s had been found dead at about 7.40am yesterday. A 26-year-old man was arrested in connection with the incident after officers attended the prison, and he remains in custody. Superintendent Carl Moore said: \"Our thoughts are with the family of the man who has lost his life. \"An investigation has begun to establish the full circumstances of his death.\" HMP Stoke Heath is a men's Category C prison that houses nearly 800 inmates. In its last unannounced inspection in 2023, it was given the highest rating for keeping prisoners safe by HM Inspectorate of Prisons."
    },
    {
        "title": "Why govt's promise of 'biggest boost to affordable housing in a generation' may be overblown",
        "description": "Angela Rayner is set to announce plans to build 180,000 new social homes in the next decade, as the government seeks to \"turn the tide on the housing crisis\".",
        "url": "https://news.sky.com/story/why-govts-promise-of-biggest-boost-to-affordable-housing-in-a-generation-may-be-overblown-13391226",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-angela-rayner-deputy-prime-minister_6954959.jpg?20250702003526",
        "type": "Home",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-07-01 22:30:00",
        "Headline": "It would be six times the number of social homes built in the 10 years up to 2024 - and forms part of a drive to build 300,000 new social and affordable properties by 2035.",
        "Content": "\n          Data journalist\n              @joelysantacruz\n Angela Rayner is set to announce plans to build 180,000 new social homes in the next decade, as the government seeks to \"turn the tide on the housing crisis\". It would be six times greater than the number of social homes built in the 10 years up to 2024 - and forms part of a drive to build 300,000 new social and affordable properties by 2035. The plan is backed by a £39bn investment announced by Chancellor Rachel Reeves in last month's spending review.  The deputy prime minister called on the social housing sector to \"work together to turn the tide of the housing crisis\", and said the investment was \"the biggest boost to social and affordable housing in a generation\". \"We are seizing this golden opportunity with both hands to transform this country by building the social and affordable homes we need, so we create a brighter future where families aren't trapped in temporary accommodation and young people are no longer locked out of a secure home,\" she said. Ms Rayner's target for social and affordable housing is part of a wider long-term plan - also due to be published on Wednesday - setting out how the government will build both more houses and improve housing standards. Here, Sky News looks at what the plan will mean for the country, how it compares to previous programmes, and how it could be affected by the increased cost of construction.  Crunching the numbers The £39bn 10-year Affordable Homes Programme is an ambitious investment in affordable housing, representing a real terms increase from the previous programme of over £1bn annually. However, claims of the \"biggest boost in a generation\" may be slightly overblown. When factoring in inflation, the annual investment of £3.9bn falls short of the equivalent £4.5bn annually from 2008 to 2011 under the previous Labour government. This was however a notably short-term uplift, and the sector will welcome the stability of the new settlement which secures funding for 10 years - compared with five years or fewer under previous programmes. Read more from Sky News:Starmer survives rebellion as welfare cuts watered down'Diddy' holds head in his hands as jury reaches partial verdict The programme sets out to deliver 30,000 affordable homes per year on average, with at least 18,000 of those being for social rent, rather than other tenures such as shared ownership. This would be more than twice the number under the previous programme, which is estimated to have delivered about 8,000 homes annually for social rent by its completion. Similarly, however, it is fewer than were delivered by the previous Labour Affordable Homes Programme, which was over 30,000 a year from 2008 to 2011. A further challenge to the government's goal of a \"generational\" uplift is the increasing cost of building, meaning they may face diminishing returns on their investment. The previous Affordable Homes Programme initially aimed to deliver 180,000 homes, which was revised down significantly to between 110,000 and 130,000 due to increasing costs and delays. This government can expect to face a similar economic landscape, particularly with an ambition to deliver a greater share of socially rented homes - the most expensive type of affordable housing to build."
    },
    {
        "title": "Three members of Lucy Letby hospital's senior leadership team arrested",
        "description": "Three managers at the hospital where Lucy Letby worked have been arrested on suspicion of gross negligence manslaughter.",
        "url": "https://news.sky.com/story/three-members-of-lucy-letby-hospitals-senior-leadership-team-arrested-13390882",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-lucy-letby-court_6726415.jpg?20241024131746",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-01 09:47:00",
        "Headline": "An investigation into gross negligence manslaughter began in March of this year - in addition to one probing potential corporate manslaughter, which started in October 2023.",
        "Content": " Three managers at the hospital where Lucy Letby worked have been arrested on suspicion of gross negligence manslaughter. They were in senior roles at the Countess of Chester Hospital in 2015 and 2016 and have been bailed pending further enquiries, Cheshire Constabulary said. Their names have not been made public. Letby, 35, was found guilty of murdering seven children and attempting to murder seven more between June 2015 and June 2016 while working in the hospital's neonatal unit. Detective Superintendent Paul Hughes explained that gross negligent manslaughter focuses on the \"action or inaction of individuals\". There is also an investigation into corporate manslaughter at the hospital, which began in October 2023. That focuses on \"senior leadership and their decision-making\", Mr Hughes said. The intention there is to determine whether any \"criminality has taken place concerning the response to the increased levels of fatalities\". The scope was widened to include gross negligence manslaughter in March of this year. Mr Hughes said it is \"important to note\" that this latest development \"does not impact on the convictions of Lucy Letby for multiple offences of murder and attempted murder\". He added: \"Both the corporate manslaughter and gross negligence manslaughter elements of the investigation are continuing and there are no set timescales for these. \"Our investigation into the deaths and non-fatal collapses of babies at the neo-natal units of both the Countess of Chester Hospital and the Liverpool Women's Hospital between the period of 2012 to 2016 is also ongoing.\" Read more from Sky News:Stab victim describes horrible reality of knife crimeRoyal train to be scrapped with family to rely on helicopters A public inquiry has also been examining the hospital's response to concerns raised about Letby before her arrest. In May, it was announced the inquiry's final report into how the former nurse was able to commit her crimes will now be published early next year. Earlier this year, lawyers for Lucy Letby called for the suspension of the inquiry, claiming there was \"overwhelming and compelling evidence\" that her convictions were unsafe. In February, an international panel of neonatologists and paediatric specialists told reporters that poor medical care and natural causes were the reasons for the collapses and deaths. Their evidence has been passed to the Criminal Cases Review Commission (CCRC), which investigates potential miscarriages of justice, and Letby's legal team hopes her case will be referred back to the Court of Appeal."
    },
    {
        "title": "Man charged with murdering pregnant mother-of-two in County Down",
        "description": "A man has been charged with murder and child destruction after the death of a pregnant woman in Northern Ireland. ",
        "url": "https://news.sky.com/story/man-charged-with-murdering-pregnant-mother-of-two-in-county-down-13391062",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sarah-montgomery-victim_6953132.jpg?20250629133157",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-01 14:56:00",
        "Headline": "Sarah Montgomery died at a house in Donaghadee, County Down, on Saturday.",
        "Content": "A man has been charged with murder and child destruction after the death of a pregnant woman in Northern Ireland.  Sarah Montgomery - a 27-year-old mother-of-two - died at a house in Donaghadee, County Down, on Saturday. The 28-year-old man is due to appear before Newtownards Magistrates' Court on Wednesday, the Police Service of Northern Ireland (PSNI) said. Floral tributes have been left outside Ms Montgomery's home. A 47-year-old woman arrested as part of the investigation was released unconditionally on Tuesday."
    },
    {
        "title": "UK records hottest day of year so far - as 40C highs close schools in Europe",
        "description": "The UK has recorded its hottest day of the year so far &#8211; while Europe has also faced extreme heat, and wildfires have raged in Turkey.",
        "url": "https://news.sky.com/story/uk-records-hottest-day-of-year-so-far-as-40c-highs-close-schools-in-europe-13391114",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hyde-park-weather_6954437.jpg?20250701124533",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-01 17:13:00",
        "Headline": "While parts of the UK have recorded temperatures of 34C, numerous European countries are battling even hotter conditions and wildfires have continued for a second day in Turkey.",
        "Content": "The UK has recorded its hottest day of the year so far – while Europe has also faced extreme heat, and wildfires have raged in Turkey. A temperature of 34.7C (94.4F) was recorded at St James's Park in central London on Tuesday afternoon, the Met Office said, beating a high of 34.4C (93.9F) in Writtle, Essex, earlier in the day. The UK's previous warmest day of 2025 was Saturday 21 June, when 33.2C (91.8F) was recorded in Charlwood, Surrey. Find out the latest forecast for your area Much of Europe is also facing hotter-than-usual temperatures, with a high of 40C (104F) recorded in Paris. More than 1,300 schools in France were partially or fully closed on Tuesday after the country's national weather agency placed several regions under the highest red alert. The Paris region was particularly hard hit, and the Eiffel Tower's summit was closed to visitors as locals and tourists alike were warned to take care in the heat. \n                  Six killed in China floods as tropical storm threatens further devastation\n                 \n                  UK weather: Yellow warning for thunderstorms as heatwave intensifies\n                 \n                  UK weather: Amber heat health alert issued across England as hottest day of the year recorded\n                 In Italy, 17 major cities - out of a total of 27 - were experiencing a heat wave, according to the country's health ministry. At the Prague Zoo, staff are currently distributing up to 10 metric tons of ice per day to keep animals cool as temperatures in the Czech Republic reach 37C (98.6F). Numerous Spanish cities have also reported sweltering temperatures, with highs over the 40C in Madrid, Sevilla and Barcelona. Speaking in Seville on Monday, António Guterres, the UN secretary general, said: \"Extreme heat is no longer a rare event - it has become the new normal.\" The city is forecast to roast in more the 40C heat for the next three days. Meanwhile, wildfires on Turkey's coastal provinces are raging for a second day running. Read more:What is a 'heat dome'?How does sunscreen protect us?   More than 50,000 people have been evacuated from their homes, including 42,000 from the western province of Izmir, where officials say strong winds have fanned the flames. Turkey's Hatay Province has also seen wildfires. A Met Office spokesperson said Tuesday was likely to mark \"the peak of this current heatwave in terms of absolute temperatures we're expecting\" in the UK. Colder temperatures will come in from the north overnight and into Wednesday morning, Stephen Dixon said."
    },
    {
        "title": "The PM faced down his party on welfare and lost. I suspect things may only get worse",
        "description": "So much for an end to chaos and sticking plaster politics.",
        "url": "https://news.sky.com/story/pms-last-minute-climbdown-on-welfare-left-onlookers-aghast-and-will-embolden-labour-mps-13391160",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-beth-rigby_6915218.jpg?20250513140605",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-07-01 23:58:00",
        "Headline": "The prime minister has suffered damage to his authority and lost goodwill among some Labour MPs over how efforts to reform welfare have unfolded - and it may be Rachel Reeves picking up the pieces.",
        "Content": "\n          Political editor\n              @BethRigby\n  So much for an end to chaos and sticking plaster politics. Yesterday, Sir Keir Starmer abandoned his flagship welfare reforms at the eleventh hour - hectic scenes in the House of Commons that left onlookers aghast. Facing possible defeat on his welfare bill, the PM folded in a last-minute climbdown to save his skin.  The decision was so rushed that some government insiders didn't even know it was coming - as the deputy PM, deployed as a negotiator, scrambled to save the bill or how much it would cost. \"Too early to answer, it's moved at a really fast pace,\" said one. The changes were enough to whittle back the rebellion to 49 MPs as the prime minister prevailed, but this was a pyrrhic victory. Sir Keir lost the argument with his own backbenchers over his flagship welfare reforms, as they roundly rejected his proposed cuts to disability benefits for existing claimants or future ones, without a proper review of the entire personal independence payment (PIP) system first. PM wins key welfare vote - follow latest  That in turn has blown a hole in the public finances, as billions of planned welfare savings are shelved. Chancellor Rachel Reeves now faces the prospect of having to find £5bn. As for the politics, the prime minister has - to use a war analogy - spilled an awful lot of blood for little reward. He has faced down his MPs and he has lost.  They will be emboldened from this and - as some of those close to him admit - will find it even harder to govern. After the vote, in central lobby, MPs were already saying that the government should regard this as a reset moment for relations between No 10 and the party. The prime minister always said during the election that he would put country first and party second - and yet, less than a year into office, he finds himself pinned back by his party and blocked from making what he sees are necessary reforms. I suspect it will only get worse. When I asked two of the rebel MPs how they expected the government to cover off the losses in welfare savings, Rachael Maskell, a leading rebel, suggested the government introduce welfare taxes. Meanwhile, Work and Pensions Select Committee chair Debbie Abrahams told me \"fiscal rules are not natural laws\" - suggesting the chancellor could perhaps borrow more to fund public spending. Read more:How did your MP vote?Welfare cuts branded 'Dickensian'  These of course are both things that Ms Reeves has ruled out. But the lesson MPs will take from this climbdown is that - if they push hard in enough and in big enough numbers - the government will give ground. The fallout for now is that any serious cuts to welfare - something the PM says is absolutely necessary - are stalled for the time being, with the Stephen Timms review into PIP not reporting back until November 2026.  Had the government done this differently and reviewed the system before trying to impose the cuts - a process only done ahead of the Spring Statement in order to help the chancellor fix her fiscal black hole - they may have had more success. Those close to the PM say he wants to deliver on the mandate the country gave him in last year's election, and point out that Sir Keir Starmer is often underestimated - first as party leader and now as prime minister. But on this occasion, he underestimated his own MPs. His job was already difficult enough - and after this it will be even harder still. If he can't govern his party, he can't deliver change he promised."
    },
    {
        "title": "Starmer survives rebellion as watered-down welfare cuts pass key vote",
        "description": "Sir Keir Starmer's controversial welfare bill has passed its first hurdle in the Commons despite a sizeable rebellion from his MPs.",
        "url": "https://news.sky.com/story/starmer-survives-rebellion-as-watered-down-welfare-cuts-pass-key-vote-13390841",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/ab02416b864dc07a0124964560efe7a12fe97f443b75a2de47ba9ee644bb1089_6954798.jpg?20250701193417",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-01 08:51:00",
        "Headline": "The government had to make so many concessions to avoid a rebellion, MPs only ended up voting on one part of the original bill.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer's controversial welfare bill has passed its first hurdle in the Commons despite a sizeable rebellion from his MPs. The prime minister's watered-down Universal Credit and Personal Independent Payment Bill, aimed at saving £5.5bn, was backed by a majority of 75 on Tuesday evening. A total of 49 Labour MPs voted against the bill - the largest rebellion since 47 MPs voted against Tony Blair's Lone Parent benefit in 1997, according to Professor Phil Cowley from Queen Mary University. Politics latest: Chancellor left in 'impossible situation' after PM survives welfare rebellion After multiple concessions made due to threats of a Labour rebellion, many MPs questioned what they were voting for as the bill had been severely stripped down. They ended up voting for only one part of the plan: a cut to Universal Credit (UC) sickness benefits for new claimants from £97 a week to £50 from 2026/7. The Institute for Fiscal Studies (IFS) said the bill voted through \"is not expected to deliver any savings over the next four years\" because the savings from reducing the Universal Credit health element for new claimants will be roughly offset by the cost of increasing the UC standard allowance. \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 \n                  How did your MP vote on Labour's welfare bill?\n                 \n                  Why govt's promise of 'biggest boost to affordable housing in a generation' may be overblown\n                 Just 90 minutes before voting started on Tuesday evening, disabilities minister Stephen Timms announced the last of a series of concessions made as dozens of Labour MPs spoke of their fears for disabled and sick people if the bill was made law. How did your MP vote on Labour's welfare bill? In a major U-turn, he said changes in eligibility for the personal independence payment (PIP), the main disability payment to help pay for extra costs incurred, would not take place until a review he is carrying out into the benefit is published in autumn 2026. An amendment brought by Labour MP Rachael Maskell, which aimed to prevent the bill progressing to the next stage, was defeated but 44 Labour MPs voted for it.  A Number 10 source told Sky News' political editor Beth Rigby: \"Change isn't easy, we've always known that, we're determined to deliver on the mandate the country gave us, to make Britain work for hardworking people. \"We accept the will of the house, and want to take colleagues with us, our destination - a social security system that supports the most vulnerable, and enables people to thrive - remains.\" But the Conservative shadow chancellor Mel Stride called the vote \"farcical\" and said the government \"ended up in this terrible situation\" because they \"rushed it\". He warned the markets \"will have noticed that when it comes to taking tougher decisions about controlling and spending, this government has been found wanting\".  Work and Pensions Secretary Liz Kendall said: \"I wish we'd got to this point in a different way. And there are absolutely lessons to learn. \"But I think it's really important we pass this bill at the second reading, it put some really important reforms to the welfare system - tackling work disincentives, making sure that people with severe conditions would no longer be assessed and alongside our investment in employment support this will help people get back to work, because that's the brighter future for them.\" She made further concessions on Monday in the hope the rebels' fears would be allayed, but many were concerned the PIP eligibility was going to be changed at the same time the review was published, meaning its findings would not be taken into account. Her changes were: • Current PIP claimants, and any up to November 2026, would have the same eligibility criteria as they do now, instead of the stricter measure proposed • A consultation into PIP to be \"co-produced\" with disabled people and published in autumn 2026 • For existing and future Universal Credit (UC) claimants, the combined value of the standard UC allowance and the health top-up will rise \"at least in line with inflation\" every year for the rest of this parliament • The UC health top-up, for people with limited ability to work due to a disability or long-term sickness, will get a £300m boost next year - doubling the current amount - then rising to £800m the year after and £1bn in 2028/29."
    },
    {
        "title": "How did your MP vote on Labour's welfare bill?",
        "description": "Labour's welfare reforms bill has passed, with 335 MPs voting in favour and 260 against.",
        "url": "https://news.sky.com/story/how-did-your-mp-vote-on-labours-welfare-bill-13391059",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-commons-votes-vote-lookup_6954618.jpg?20250701154915",
        "type": "UK",
        "Author": "Daniel Dunford",
        "Date Published": "2025-07-01 19:04:00",
        "Headline": "The government's welfare bill passed with a majority of 75. See how your MP voted with our lookup.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n Labour's welfare reforms bill has passed, with 335 MPs voting in favour and 260 against. It came after the government watered down the bill earlier this evening, making a dramatic last-minute concession to the demands of would-be rebel MPs who were concerned about the damage the policy would do to disabled people. The concessions could end up leaving the government with £5.5bn to make up from either tax rises or cuts elsewhere. See how your MP voted with our lookup: The government has a working majorityi of 166, so it would have taken 84 rebels to defeat the bill. In total, 49 Labour MPs still voted against the bill despite the concessions. No MPs from other parties voted alongside the government, although three MPs elected for Labour who have since had the whip removed did so. Which Labour MPs rebelled? Last week, 127 Labour MPs signed what they called a \"reasoned amendment\", a letter stating their objection to the bill as it was. The government responded with some concessions to try and win back the rebels, which was enough to convince some of them. But they were still ultimately forced to make more changes today. In total, 68 MPs who signed the initial \"reasoned amendment\" eventually voted in favour of the bill. Nine in 10 MPs elected for the first time at the 2024 general election voted with the government. That compares with fewer than three quarters of MPs who were voted in before that. A total of 42 Labour MPs also voted in favour of an amendment that would have stopped the bill from even going to a vote at all. That was voted down by 328 votes to 149. How does the rebellion compare historically? If the wording of the bill had remained unchanged and 127 MPs or more had voted against it on Tuesday, it would have been up there as one of the biggest rebellions in British parliamentary history. As it happened, it was still higher than the largest recorded during Tony Blair’s first year as PM, when 47 of his Labour colleagues (including Diane Abbott, John McDonnell and Jeremy Corbyn, who also voted against the bill on Tuesday) voted no to his plan to cut benefits for single-parent families. Follow more updates live on the Sky News Politics Hub. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Man arrested on suspicion of murder after inmate found dead in prison cell",
        "description": "A man has been arrested on suspicion of murder after an inmate was found dead inside his prison cell.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-murder-after-inmate-found-dead-in-prison-cell-13391222",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hmp-barlinnie-prison_6912384.jpg?20250521134734",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-01 22:07:00",
        "Headline": "Police said they responded to a report of a man in his 40s being found dead at a Shropshire prison at around 7.40am on Tuesday. ",
        "Content": "A man has been arrested on suspicion of murder after an inmate was found dead inside his prison cell. West Mercia Police said it received a report from HMP Stoke Heath in Shropshire that a man in his 40s had been found dead at about 7.40am yesterday. A 26-year-old man was arrested in connection with the incident after officers attended the prison, and he remains in custody. Superintendent Carl Moore said: \"Our thoughts are with the family of the man who has lost his life. \"An investigation has begun to establish the full circumstances of his death.\" HMP Stoke Heath is a men's Category C prison that houses nearly 800 inmates. In its last unannounced inspection in 2023, it was given the highest rating for keeping prisoners safe by HM Inspectorate of Prisons."
    },
    {
        "title": "Why govt's promise of 'biggest boost to affordable housing in a generation' may be overblown",
        "description": "Angela Rayner is set to announce plans to build 180,000 new social homes in the next decade, as the government seeks to \"turn the tide on the housing crisis\".",
        "url": "https://news.sky.com/story/why-govts-promise-of-biggest-boost-to-affordable-housing-in-a-generation-may-be-overblown-13391226",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-angela-rayner-deputy-prime-minister_6954959.jpg?20250702003526",
        "type": "UK",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-07-01 22:30:00",
        "Headline": "It would be six times the number of social homes built in the 10 years up to 2024 - and forms part of a drive to build 300,000 new social and affordable properties by 2035.",
        "Content": "\n          Data journalist\n              @joelysantacruz\n Angela Rayner is set to announce plans to build 180,000 new social homes in the next decade, as the government seeks to \"turn the tide on the housing crisis\". It would be six times greater than the number of social homes built in the 10 years up to 2024 - and forms part of a drive to build 300,000 new social and affordable properties by 2035. The plan is backed by a £39bn investment announced by Chancellor Rachel Reeves in last month's spending review.  The deputy prime minister called on the social housing sector to \"work together to turn the tide of the housing crisis\", and said the investment was \"the biggest boost to social and affordable housing in a generation\". \"We are seizing this golden opportunity with both hands to transform this country by building the social and affordable homes we need, so we create a brighter future where families aren't trapped in temporary accommodation and young people are no longer locked out of a secure home,\" she said. Ms Rayner's target for social and affordable housing is part of a wider long-term plan - also due to be published on Wednesday - setting out how the government will build both more houses and improve housing standards. Here, Sky News looks at what the plan will mean for the country, how it compares to previous programmes, and how it could be affected by the increased cost of construction.  Crunching the numbers The £39bn 10-year Affordable Homes Programme is an ambitious investment in affordable housing, representing a real terms increase from the previous programme of over £1bn annually. However, claims of the \"biggest boost in a generation\" may be slightly overblown. When factoring in inflation, the annual investment of £3.9bn falls short of the equivalent £4.5bn annually from 2008 to 2011 under the previous Labour government. This was however a notably short-term uplift, and the sector will welcome the stability of the new settlement which secures funding for 10 years - compared with five years or fewer under previous programmes. Read more from Sky News:Starmer survives rebellion as welfare cuts watered down'Diddy' holds head in his hands as jury reaches partial verdict The programme sets out to deliver 30,000 affordable homes per year on average, with at least 18,000 of those being for social rent, rather than other tenures such as shared ownership. This would be more than twice the number under the previous programme, which is estimated to have delivered about 8,000 homes annually for social rent by its completion. Similarly, however, it is fewer than were delivered by the previous Labour Affordable Homes Programme, which was over 30,000 a year from 2008 to 2011. A further challenge to the government's goal of a \"generational\" uplift is the increasing cost of building, meaning they may face diminishing returns on their investment. The previous Affordable Homes Programme initially aimed to deliver 180,000 homes, which was revised down significantly to between 110,000 and 130,000 due to increasing costs and delays. This government can expect to face a similar economic landscape, particularly with an ambition to deliver a greater share of socially rented homes - the most expensive type of affordable housing to build."
    },
    {
        "title": "Three members of Lucy Letby hospital's senior leadership team arrested",
        "description": "Three managers at the hospital where Lucy Letby worked have been arrested on suspicion of gross negligence manslaughter.",
        "url": "https://news.sky.com/story/three-members-of-lucy-letby-hospitals-senior-leadership-team-arrested-13390882",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-lucy-letby-court_6726415.jpg?20241024131746",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-01 09:47:00",
        "Headline": "An investigation into gross negligence manslaughter began in March of this year - in addition to one probing potential corporate manslaughter, which started in October 2023.",
        "Content": " Three managers at the hospital where Lucy Letby worked have been arrested on suspicion of gross negligence manslaughter. They were in senior roles at the Countess of Chester Hospital in 2015 and 2016 and have been bailed pending further enquiries, Cheshire Constabulary said. Their names have not been made public. Letby, 35, was found guilty of murdering seven children and attempting to murder seven more between June 2015 and June 2016 while working in the hospital's neonatal unit. Detective Superintendent Paul Hughes explained that gross negligent manslaughter focuses on the \"action or inaction of individuals\". There is also an investigation into corporate manslaughter at the hospital, which began in October 2023. That focuses on \"senior leadership and their decision-making\", Mr Hughes said. The intention there is to determine whether any \"criminality has taken place concerning the response to the increased levels of fatalities\". The scope was widened to include gross negligence manslaughter in March of this year. Mr Hughes said it is \"important to note\" that this latest development \"does not impact on the convictions of Lucy Letby for multiple offences of murder and attempted murder\". He added: \"Both the corporate manslaughter and gross negligence manslaughter elements of the investigation are continuing and there are no set timescales for these. \"Our investigation into the deaths and non-fatal collapses of babies at the neo-natal units of both the Countess of Chester Hospital and the Liverpool Women's Hospital between the period of 2012 to 2016 is also ongoing.\" Read more from Sky News:Stab victim describes horrible reality of knife crimeRoyal train to be scrapped with family to rely on helicopters A public inquiry has also been examining the hospital's response to concerns raised about Letby before her arrest. In May, it was announced the inquiry's final report into how the former nurse was able to commit her crimes will now be published early next year. Earlier this year, lawyers for Lucy Letby called for the suspension of the inquiry, claiming there was \"overwhelming and compelling evidence\" that her convictions were unsafe. In February, an international panel of neonatologists and paediatric specialists told reporters that poor medical care and natural causes were the reasons for the collapses and deaths. Their evidence has been passed to the Criminal Cases Review Commission (CCRC), which investigates potential miscarriages of justice, and Letby's legal team hopes her case will be referred back to the Court of Appeal."
    },
    {
        "title": "Man charged with murdering pregnant mother-of-two in County Down",
        "description": "A man has been charged with murder and child destruction after the death of a pregnant woman in Northern Ireland. ",
        "url": "https://news.sky.com/story/man-charged-with-murdering-pregnant-mother-of-two-in-county-down-13391062",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sarah-montgomery-victim_6953132.jpg?20250629133157",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-01 14:56:00",
        "Headline": "Sarah Montgomery died at a house in Donaghadee, County Down, on Saturday.",
        "Content": "A man has been charged with murder and child destruction after the death of a pregnant woman in Northern Ireland.  Sarah Montgomery - a 27-year-old mother-of-two - died at a house in Donaghadee, County Down, on Saturday. The 28-year-old man is due to appear before Newtownards Magistrates' Court on Wednesday, the Police Service of Northern Ireland (PSNI) said. Floral tributes have been left outside Ms Montgomery's home. A 47-year-old woman arrested as part of the investigation was released unconditionally on Tuesday."
    },
    {
        "title": "Two people arrested after Palestine Action claimed it blocked Israeli defence firm's UK site",
        "description": "Two people have been arrested after Palestine Action claimed to have blockaded the entrance of an Israeli defence company's UK headquarters. ",
        "url": "https://news.sky.com/story/two-people-arrested-after-palestine-action-claimed-it-blocked-israeli-defence-firms-uk-site-13391184",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestine-action-elbit_6954331.jpg?20250701105753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-01 20:09:00",
        "Headline": "The move comes ahead of proposed government legislation that will ban the direct action group under anti-terror law.",
        "Content": " Two people have been arrested after Palestine Action claimed to have blockaded the entrance of an Israeli defence company's UK headquarters.  The move comes ahead of proposed government legislation that will ban the group under anti-terror law. A Palestine Action spokesperson said on Tuesday that activists had blocked the entrance to Elbit Systems in Bristol, and covered it in red paint \"to symbolise Palestinian bloodshed\". Avon and Somerset Police later said a 30-year-old woman and a 36-year-old man, both from London, were arrested on suspicion of criminal damage, unauthorised entry to a prohibited place and locking on to a person, object or land to cause serious disruption. The force said officers were called to the site at around 6.30am. A police spokeswoman said: \"Two people have been arrested following a small protest outside a premises at the Aztec West Business Park, in Almondsbury. \"They remain in police custody and inquiries are ongoing. \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 \n                  Starmer survives rebellion as watered-down welfare cuts pass key vote\n                 \n                  How did your MP vote on Labour's welfare bill?\n                 \"We're committed to facilitating people's right to peaceful protest, but will not tolerate any criminal behaviour.\" The arrests come as a draft order was laid before parliament on Monday to amend the Terrorism Act 2000 to include Palestine Action as a proscribed organisation. If approved, it would become a criminal offence punishable by up to 14 years in prison to be a member of the direct action group or to support it. MPs and peers are set to debate the legislation on Wednesday and Thursday and, if approved, the ban could come into force by Friday.  A Palestine Action spokesperson said: \"While the government is rushing through Parliament absurd legislation to proscribe Palestine Action, the real terrorism is being committed in Gaza. \"Palestine Action affirms that direct action is necessary in the face of Israel's ongoing crimes against humanity of genocide, apartheid, and occupation, and to end British facilitation of those crimes.\" Read more:Who are Palestine Action?Palestine Action to be proscribed - what does that mean?Palestine Action: The 'enemy within' or non-violent protesters? The spokesperson also said the group had occupied the rooftop of UK subcontractor Guardtech Group. Officers are also at the scene at the site in Brandon, Suffolk. A Suffolk Police spokesman said: \"Officers and specialist negotiators are currently at the location and our immediate priority is to bring this to a conclusion and to ensure the safety of everyone at the scene.\" Palestine Action is seeking a legal challenge against the government's bid to proscribe it, with a hearing expected on Friday to decide whether the ban can be temporarily blocked, pending further proceedings to decide whether a legal challenge can be brought. Commenting on the proscription on Monday, Home Secretary Yvette Cooper said: \"The right to protest and the right to free speech are the cornerstone of our democracy and there are countless campaign groups that freely exercise those rights. \"Violence and serious criminal damage has no place in legitimate protests.\""
    },
    {
        "title": "UK records hottest day of year so far - as 40C highs close schools in Europe",
        "description": "The UK has recorded its hottest day of the year so far &#8211; while Europe has also faced extreme heat, and wildfires have raged in Turkey.",
        "url": "https://news.sky.com/story/uk-records-hottest-day-of-year-so-far-as-40c-highs-close-schools-in-europe-13391114",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hyde-park-weather_6954437.jpg?20250701124533",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-01 17:13:00",
        "Headline": "While parts of the UK have recorded temperatures of 34C, numerous European countries are battling even hotter conditions and wildfires have continued for a second day in Turkey.",
        "Content": "The UK has recorded its hottest day of the year so far – while Europe has also faced extreme heat, and wildfires have raged in Turkey. A temperature of 34.7C (94.4F) was recorded at St James's Park in central London on Tuesday afternoon, the Met Office said, beating a high of 34.4C (93.9F) in Writtle, Essex, earlier in the day. The UK's previous warmest day of 2025 was Saturday 21 June, when 33.2C (91.8F) was recorded in Charlwood, Surrey. Find out the latest forecast for your area Much of Europe is also facing hotter-than-usual temperatures, with a high of 40C (104F) recorded in Paris. More than 1,300 schools in France were partially or fully closed on Tuesday after the country's national weather agency placed several regions under the highest red alert. The Paris region was particularly hard hit, and the Eiffel Tower's summit was closed to visitors as locals and tourists alike were warned to take care in the heat. \n                  Six killed in China floods as tropical storm threatens further devastation\n                 \n                  UK weather: Yellow warning for thunderstorms as heatwave intensifies\n                 \n                  UK weather: Amber heat health alert issued across England as hottest day of the year recorded\n                 In Italy, 17 major cities - out of a total of 27 - were experiencing a heat wave, according to the country's health ministry. At the Prague Zoo, staff are currently distributing up to 10 metric tons of ice per day to keep animals cool as temperatures in the Czech Republic reach 37C (98.6F). Numerous Spanish cities have also reported sweltering temperatures, with highs over the 40C in Madrid, Sevilla and Barcelona. Speaking in Seville on Monday, António Guterres, the UN secretary general, said: \"Extreme heat is no longer a rare event - it has become the new normal.\" The city is forecast to roast in more the 40C heat for the next three days. Meanwhile, wildfires on Turkey's coastal provinces are raging for a second day running. Read more:What is a 'heat dome'?How does sunscreen protect us?   More than 50,000 people have been evacuated from their homes, including 42,000 from the western province of Izmir, where officials say strong winds have fanned the flames. Turkey's Hatay Province has also seen wildfires. A Met Office spokesperson said Tuesday was likely to mark \"the peak of this current heatwave in terms of absolute temperatures we're expecting\" in the UK. Colder temperatures will come in from the north overnight and into Wednesday morning, Stephen Dixon said."
    },
    {
        "title": "Girl who died after tree collapsed in Southend park had 'heart full of love', family say",
        "description": "A seven-year-old girl who died after a tree partially collapsed at a park in Essex has been named.",
        "url": "https://news.sky.com/story/girl-who-died-after-tree-collapsed-in-southend-park-had-heart-full-of-love-family-say-13390412",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-leonna-ruka-dagenham_6954663.jpg?20250701164712",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-01 15:44:00",
        "Headline": "Witnesses said 40 to 50 people had tried to lift up the fallen tree, which partially collapsed at a park in Southend on Saturday.",
        "Content": "A seven-year-old girl who died after a tree partially collapsed at a park in Essex has been named. Leonna Ruka, from Dagenham in east London, died in hospital after being caught beneath the tree at Chalkwell Park in Southend shortly before 3pm on Saturday. She was among a number of children who became trapped. Essex Police said a second girl, aged six, remains in hospital in a critical condition. Another three children suffered minor injuries. Witnesses described the scene as \"heartbreaking\" and how 40 to 50 people had tried to lift up the fallen tree. It comes as Leonna's family described her as \"the light in their lives\" in a statement. \"It is with broken hearts and unimaginable pain that we share the devastating loss of our beloved daughter Leonna - our beautiful, bright, and loving little girl, taken from us far too soon,\" they said. \"She was an intelligent and curious soul, full of energy and creativity. \"A little girl who was always exploring, always asking questions, always dreaming. She had a heart full of love and a mind full of endless ideas. \"She was funny, kind, and full of life - a shining star who brought happiness wherever she went and she met. \"From the moment she walked into a room, she would light it up.\" The family also thanked everyone who had supported them since the tragedy, adding: \"We are incredibly grateful for every candle lit, every flower placed, every tear shared in her memory. \"The outpouring of love for our daughter has brought us comfort in ways we never imagined possible.\" Read more UK news:Members of Letby hospital's leadership team arrested10 tips for staying cool in the heatHuman leg found on Scottish beach  Essex Police said it is investigating the \"circumstances around the collapse of the tree\". Assistant Chief Constable Lucy Morris said: \"We are all hoping for a positive outcome in relation to the little girl who remains in hospital. \"Her family continue to receive support and our thoughts are with her.\" She added: \"There is a full and independent police investigation under way. This will take time. \"We will update on the outcome of these enquiries as soon as we possibly can.\""
    },
    {
        "title": "Trump says Israel has agreed on terms for 60-day ceasefire in Gaza, and has warning for Hamas",
        "description": "Donald Trump has said Israel has agreed on terms for a 60-day ceasefire in Gaza, and is urging Hamas to accept the deal before conditions worsen.",
        "url": "https://news.sky.com/story/trump-says-israel-has-agreed-on-terms-for-60-day-ceasefire-in-gaza-and-has-warning-for-hamas-13391229",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-israel_6954967.jpg?20250702031515",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-01 23:41:00",
        "Headline": "The US president has been increasing pressure on the Israeli government and Hamas to work out a ceasefire and hostage agreement to end the war in Gaza.",
        "Content": " Donald Trump has said Israel has agreed on terms for a 60-day ceasefire in Gaza, and is urging Hamas to accept the deal before conditions worsen. The US president announced the development ahead of hosting Israeli Prime Minister Benjamin Netanyahu for talks at the White House next week. He has been increasing pressure on the Israeli government and Hamas to work out a ceasefire and hostage agreement to end the war. \"My Representatives had a long and productive meeting with the Israelis today on Gaza. Israel has agreed to the necessary conditions to finalise the 60 Day CEASEFIRE, during which time we will work with all parties to end the War,\" Mr Trump wrote on social media - adding that Qatari and Egyptian officials would deliver the final proposal. \"I hope, for the good of the Middle East, that Hamas takes this Deal, because it will not get better - IT WILL ONLY GET WORSE.\" US correspondent In the long Gaza war, this is a significant moment. For the people of Gaza, for the hostages and their families - this could be the moment it ends. But we have been here before, so many times.  The key question - will Hamas accept what Israel has agreed to: a 60-day ceasefire? At the weekend, a source at the heart of the negotiations told me: \"Both Hamas and Israel are refusing to budge from their position - Hamas wants the ceasefire to last until a permanent agreement is reached. Israel is opposed to this. At this point only President Trump can break this deadlock.\" The source added: \"Unless Trump pushes, we are in a stalemate.\" The problem is that the announcement made now by Donald Trump - which is his social-media-summarised version of whatever Israel has actually agreed to - may just amount to Israel's already-established position.  We don't know the details and conditions attached to Israel's proposals.  Would Israeli troops withdraw from Gaza? Totally? Or partially? How many Palestinian prisoners would they agree to release from Israel's jails? And why only 60 days? Why not a total ceasefire? What are they asking of Hamas in return? We just don't know the answers to any of these questions, except one.  We do know why Israel wants a 60-day ceasefire, not a permanent one. It's all about domestic politics.  If Israeli Prime Minister Benjamin Netanyahu was to agree now to a permanent ceasefire, the extreme right-wingers in his coalition would collapse his government.  Itamar Ben-Gvir and Bezalel Smotrich have both been clear about their desire for the war to continue. They hold the balance of power in Mr Netanyahu's coalition.   If Mr Netanyahu instead agrees to just 60 days - which domestically he can sell as just a pause - then that may placate the extreme right-wingers for a few weeks until the Israeli parliament, the Knesset, is adjourned for the summer. It is also no coincidence that the US president has called for Mr Netanyahu's corruption trial to be scrapped.  Without the prospect of jail, Mr Netanyahu might be more willing to quit the war safe in the knowledge that focus will not shift immediately to his own political and legal vulnerability."
    },
    {
        "title": "Women's Euros: Concerns for player safety as tournament kicks off in Switzerland",
        "description": "The Women's Euros begin in Switzerland today - with extreme heat warnings in place.",
        "url": "https://news.sky.com/story/womens-euros-extreme-heat-warnings-in-place-as-tournament-kicks-off-13391211",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-euro-switzerland_6954934.jpg?20250701223529",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-07-01 23:01:00",
        "Headline": "The global football players' union has raised concerns about whether the stars of the sport are being protected in hot and humid conditions.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The Women's Euros begin in Switzerland today - with extreme heat warnings in place. Security measures have had to be relaxed by UEFA for the opening matches so fans can bring in water bottles. Temperatures could be about 30C (86F) when the Swiss hosts open their campaign against Norway in Basel this evening. Players have already seen the impact of heatwaves this summer at the men's Club World Cup in the US. It is raising new concerns in the global players' union about whether the stars of the sport are being protected in hot and humid conditions. FIFPRO has asked FIFA to allow cooling breaks every 15 minutes rather than just in the 30th minute of each half. There's also a request for half-time to be extended from 15 to 20 minutes to help lower the core temperature of players. \n                  England beat Germany in final to retain U21 European Championship title\n                 \n                  Jess Fishlock: Mural of Wales star unveiled in 'European first'\n                 \n                  Former England boss Gareth Southgate receives knighthood\n                 FIFPRO's medical director, Dr Vincent Gouttebarge, said: \"There are some very challenging weather conditions that we anticipated a couple of weeks ago already, that was already communicated to FIFA. \"And I think the past few weeks were confirmation of all worries that the heat conditions will play a negative role for the performance and the health of the players.\" Football has seemed focused on players and fans baking in the Middle East - but scorching summers in Europe and the US are becoming increasingly problematic for sport. While climate change is a factor, the issue is not new and at the 1994 World Cup, players were steaming as temperatures rose in the US. There is now more awareness of the need for mitigation measures among players and their international union. FIFPRO feels football officials weren't responsive when it asked for kick-off times to be moved from the fierce afternoon heat in the US for the first 32-team Club World Cup. FIFA has to balance the needs of fans and broadcasters with welfare, with no desire to load all the matches in the same evening time slots. Electric storms have also seen six games stopped, including a two-hour pause during a Chelsea game at the weekend. This is the dress rehearsal for the World Cup next summer, which is mostly in the US. The use of more indoor, air conditioned stadiums should help. There is no prospect of moving the World Cup to winter, as Qatar had to do in 2022. And looking further ahead to this time in 2030, there will be World Cup matches in Spain, Portugal and Morocco. The temperatures this week have been hitting 40C (104F) in some host cities. Read more:Ex-England boss receives knighthoodFootball star mural unveiled  FIFA said in a statement to Sky News: \"Heat conditions are a serious topic that affect football globally. \"At the FCWC some significant and progressive measures are being taken to protect the players from the heat. For instance, cooling breaks were implemented in 31 out of 54 matches so far. \"Discussions on how to deal with heat conditions need to take place collectively and FIFA stands ready to facilitate this dialogue, including through the Task Force on Player Welfare, and to receive constructive input from all stakeholders on how to further enhance heat management. \"In all of this, the protection of players must be at the centre.\""
    },
    {
        "title": "Trump's USAID cuts could lead to 14 million deaths, report warns",
        "description": "Around 14 million people could die across the world over the next five years because of cuts to the US Agency for International Development (USAID), researchers have warned.",
        "url": "https://news.sky.com/story/trumps-usaid-cuts-could-lead-to-14-million-deaths-report-warns-13390818",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-usaid-bangladesh_6954404.jpg?20250701131038",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-01 08:15:00",
        "Headline": "Cuts to the agency's schemes will lead to more fatalities from diseases like AIDS, malaria and tuberculosis, and a higher mortality rate among women and young children.",
        "Content": "Around 14 million people could die across the world over the next five years because of cuts to the US Agency for International Development (USAID), researchers have warned. Children under five are expected to make up around a third (4.5 million) of the mortalities, according to a study published in The Lancet medical journal. Estimates showed that \"unless the abrupt funding cuts announced and implemented in the first half of 2025 are reversed, a staggering number of avoidable deaths could occur by 2030\". \"Beyond causing millions of avoidable deaths - particularly among the most vulnerable - these cuts risk reversing decades of progress in health and socioeconomic development in LMICs [low and middle-income countries],\" the report said.  USAID programmes have prevented the deaths of more than 91 million people, around a third of them among children, the study suggests. The agency's work has been linked to a 65% fall in deaths from HIV/AIDS, or 25.5 million people. Eight million deaths from malaria, more than half the total, around 11 million from diarrheal diseases and nearly five million from tuberculosis (TB), have also been prevented. USAID has been vital in improving global health, \"especially in LMICs, particularly African nations,\" according to the report.  Established in 1961, the agency was tasked with providing humanitarian assistance and helping economic growth in developing countries, especially those deemed strategic to Washington. But the Trump administration has made little secret of its antipathy towards the agency, which became an early victim of cuts carried out by the Department of Government Efficiency (DOGE) - formerly led by Elon Musk - in what the US government said was part of a broader plan to remove wasteful spending. Read more:USAID explainedUSAID 'a bowl of worms' - Musk  In March, US Secretary of State Marco Rubio said more than 80% of USAID schemes had been closed following a six-week review, leaving around 1,000 active. The US is the world's largest humanitarian aid donor, providing around $61bn (£44bn) in foreign assistance last year, according to government data, or at least 38% of the total, and USAID is the world's leading donor for humanitarian and development aid, the report said. Between 2017 and 2020, the agency responded to more than 240 natural disasters and crises worldwide - and in 2016 it sent food assistance to more than 53 million people across 47 countries. The study assessed all-age and all-cause mortality rates in 133 countries and territories, including all those classified as low and middle-income, supported by USAID from 2001 to 2021."
    },
    {
        "title": "Thai PM Paetongtarn Shinawatra suspended amid outrage over leaked phone call",
        "description": "Thailand's prime minister has been suspended after a leaked phone call with a senior Cambodian politician caused outrage.",
        "url": "https://news.sky.com/story/thai-pm-paetongtarn-shinawatra-suspended-amid-outrage-over-leaked-phone-call-13390861",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-paetongtarn-shinawatra_6954313.jpg?20250701103359",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-01 09:26:00",
        "Headline": "The 38-year-old has two weeks to respond to the probe. She has apologised and said her approach was a negotiating tactic.",
        "Content": "Thailand's prime minister has been suspended after a leaked phone call with a senior Cambodian politician caused outrage. An ethics investigation into Paetongtarn Shinawatra is under way and she could end up being dismissed. The country's constitutional court took up a petition from 36 senators, who claimed dishonesty and a breach of ethical standards, and voted 7 to 2 to suspend her. The prime minister's call with Cambodia's former leader, Hun Sen, sparked public protests after she tried to appease him and criticised a Thai army commander - a taboo move in a country where the military is extremely influential. Ms Shinawatra was trying to defuse mounting tensions at the border - which in May resulted in the death of one Cambodian soldier. Thousands of conservative, nationalist protesters held a demo in Bangkok on Saturday to urge her to step down. Her party is clinging on to power after another group withdrew from their alliance a few weeks ago over the phone call. Calls for a no-confidence vote are likely. \n                  Mother of British woman found dead in Bangkok hotel room accuses Thai police of 'cover-up'\n                 \n                  Thai construction tycoon among 17 people charged over fatal Bangkok tower collapse\n                 \n                  Gangs behind billion-pound cyber scam industry expanding as they try to dodge government crackdowns - new UN report\n                 Deputy prime minister Suriya Juangroongruangkit will take over temporarily while the court looks into the case. The 38-year-old prime minister - Thailand's youngest ever leader - has 15 days to respond to the probe. She has apologised and said her approach in the call was a negotiating tactic. Read more from Sky News:Netanyahu to meet Donald Trump next week Cannes bringing in 'drastic regulation' on cruise ships The popularity of her government has slumped recently, with an opinion poll showing an approval rating of 9.2%, down from 30.9% in March. Ms Shinawatra comes from a wealthy dynasty synonymous with Thai politics. Her father Thaksin Shinawatra - a former Manchester City owner - and aunt Yingluck Shinawatra served as prime minister before her - in the early to mid 2000s - and their time in office also ended ignominiously amid corruption charges and military coups."
    },
    {
        "title": "Conor McGregor's legal team withdraws bid to introduce fresh evidence in appeal against civil case decision",
        "description": "The legal team for mixed martial arts fighter Conor McGregor has withdrawn a bid to introduce fresh evidence in his appeal against a decision in a civil case in which a woman accused him of raping her.",
        "url": "https://news.sky.com/story/conor-mcgregors-legal-team-withdraws-bid-to-introduce-fresh-evidence-in-appeal-against-civil-case-decision-13391057",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-conor-mcgregor_6954628.jpg?20250701160428",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-01 14:17:00",
        "Headline": "The Irish mixed martial arts star has launched an appeal after Nikita Hand, 35, sued him over an incident at a south Dublin hotel in December 2018.",
        "Content": "The legal team for mixed martial arts fighter Conor McGregor has withdrawn a bid to introduce fresh evidence in his appeal against a decision in a civil case in which a woman accused him of raping her. Former hairdresser Nikita Hand, 35, sued the Irish sports star over an incident at a south Dublin hotel in December 2018. The 36-year-old was said to have \"brutally raped and battered\" Ms Hand in a penthouse at the Beacon Hotel. During a three-week case at the High Court in Dublin last November, McGregor told the court he had consensual sex with Ms Hand. After six hours and 10 minutes of deliberating, the jury of eight women and four men found McGregor civilly liable for assault. Ms Hand was awarded €248,603.60 (about £206,000) in damages. McGregor was ordered by a judge to pay Ms Hand €100,000 (£85,000) of the damages and €200,000 (£170,000) of an expected €1.3m (£1.1m) in legal costs before the appeal, which the court heard had been done. Ms Hand, also known as Nikita Ni Laimhin, lost her case against another man, James Lawrence, who she accused of assaulting her by allegedly having sex without her consent at the same hotel. McGregor has since sought an appeal, which was initially expected to include new evidence. However, on Tuesday morning, the Court of Appeal in Dublin heard that McGregor would no longer be relying on additional evidence that had not been given to the initial trial for his appeal. That evidence was reported to relate to two neighbours of Ms Hand who had alleged they had seen her be assaulted by a former partner. However, his legal team said that after receiving new applications relating to the evidence to be given by pathologist Professor Jack Crane, they could no longer sustain that ground of appeal. John Gordon SC, for Ms Hand, said it was \"frankly not appropriate\" for the ground to be withdrawn on that basis, adding he had only been told of the development 10 minutes earlier. He objected to the withdrawal of the ground and argued he should still be allowed to cross-examine the neighbours. He said his client had been \"put through the wringer yet again\" and that the court should not permit the appellant to \"waltz in here and then they can walk away from this\". Mr Gordon said there could potentially be matters relating to perjury arising out of the developments. Ms Justice Isobel Kennedy, alongside Mr Justice Brian O'Moore and Mr Justice Patrick MacGrath, said it cannot be the case that further submissions relating to Professor Crane could solely be the reason to withdraw the appeal matter of the neighbours' evidence. Read more:Irish politicians reject McGregor's bid for presidencyTesco ditches booze linked to McGregor after rape caseMcGregor speaks after losing civil case Mark Mulholland KC, for McGregor, said he was applying to withdraw the matter on a \"holistic view\" of the whole case and after taking instructions. Ms Justice Kennedy said it was \"unsatisfactory\" that it was being brought to the court at a late stage, but permitted the withdrawing of the ground. Following the withdrawal of that application, Remy Farrell, SC, also for McGregor, advanced the remaining four grounds of the appeal - largely relating to the right to silence and \"no comment\" answers to questions during garda interviews. He raised the issue of the cross-examination of McGregor during the original trial by Mr Gordon. He said an \"enormous amount of no comment material\" had been entered into the hearings to no actual proper end. Mr Farrell said that Mr Gordon had raised more than 100 \"no comment\" answers given by McGregor while being interviewed by gardai on the basis that it related to a position put forward by the fighter that he had been fully co-operative with gardai. Ireland correspondent This was a good old-fashioned courtroom bombshell. Nikita Hand arrived at the Four Courts with her partner, walking past a rolling maul of TV cameras and photographers and a group of supporters with a large \"We Stand With Nikita Hand\" banner. The media – not expecting Conor McGregor himself to attend – were on high alert for the arrival of the two new witnesses, Samantha O'Reilly and Steven Cummins. \n\n Former neighbours of Ms Hand, they were expected to tell the court that they may have witnessed her being assaulted by her partner after the hotel encounter with McGregor – explaining her subsequent bruising. But they did not arrive. Inside the small, packed court it immediately became apparent why. McGregor's legal team said they were withdrawing the fresh evidence – there were audible gasps and startled looks exchanged among the benches. The testimony of the neighbours had filled reams of Irish newsprint in the weeks ahead of this highly-anticipated appeal – now it was discarded immediately for various legal reasons. Ms Hand's counsel was furious – demanding an apology. He had only found out 10 minutes earlier, he declared – an unacceptable situation. Ms Hand had \"been put through the wringer\" by all of this, he said. The mixed martial arts fighter's appeal is now proceeding, but on reduced grounds. As so often with Conor McGregor, whether in an octagon or a courtroom, the unexpected is never far away. Mr Farrell said this was allowed to proceed by the trial judge, with Mr Justice Alexander Owens telling Mr Gordon multiple times to get to that specific purpose of that line of questioning. However, putting forward the appeal, McGregor's counsel said this did not occur - and was in itself based on an \"entirely incorrect\" paraphrasing of what the appellant had actually said. Mr Farrell said his client had said that he had made a comment about wanting to \"get everything correct\" in seeking out the \"best advice\" from his solicitors - rather than saying he had been fully co-operative with gardai. He said the plaintiff had used this to construct a \"hook\" that McGregor had said he wanted to tell everything to gardai, adding: \"With respect, that's not what it says.\" Mr Farrell said it was not the case that McGregor had said he had told gardai everything. The proceedings, including Mr Lawrence's appeal against a decision not to be awarded costs, continue."
    },
    {
        "title": "UK records hottest day of year so far - as 40C highs close schools in Europe",
        "description": "The UK has recorded its hottest day of the year so far &#8211; while Europe has also faced extreme heat, and wildfires have raged in Turkey.",
        "url": "https://news.sky.com/story/uk-records-hottest-day-of-year-so-far-as-40c-highs-close-schools-in-europe-13391114",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hyde-park-weather_6954437.jpg?20250701124533",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-01 17:13:00",
        "Headline": "While parts of the UK have recorded temperatures of 34C, numerous European countries are battling even hotter conditions and wildfires have continued for a second day in Turkey.",
        "Content": "The UK has recorded its hottest day of the year so far – while Europe has also faced extreme heat, and wildfires have raged in Turkey. A temperature of 34.7C (94.4F) was recorded at St James's Park in central London on Tuesday afternoon, the Met Office said, beating a high of 34.4C (93.9F) in Writtle, Essex, earlier in the day. The UK's previous warmest day of 2025 was Saturday 21 June, when 33.2C (91.8F) was recorded in Charlwood, Surrey. Find out the latest forecast for your area Much of Europe is also facing hotter-than-usual temperatures, with a high of 40C (104F) recorded in Paris. More than 1,300 schools in France were partially or fully closed on Tuesday after the country's national weather agency placed several regions under the highest red alert. The Paris region was particularly hard hit, and the Eiffel Tower's summit was closed to visitors as locals and tourists alike were warned to take care in the heat. \n                  Six killed in China floods as tropical storm threatens further devastation\n                 \n                  UK weather: Yellow warning for thunderstorms as heatwave intensifies\n                 \n                  UK weather: Amber heat health alert issued across England as hottest day of the year recorded\n                 In Italy, 17 major cities - out of a total of 27 - were experiencing a heat wave, according to the country's health ministry. At the Prague Zoo, staff are currently distributing up to 10 metric tons of ice per day to keep animals cool as temperatures in the Czech Republic reach 37C (98.6F). Numerous Spanish cities have also reported sweltering temperatures, with highs over the 40C in Madrid, Sevilla and Barcelona. Speaking in Seville on Monday, António Guterres, the UN secretary general, said: \"Extreme heat is no longer a rare event - it has become the new normal.\" The city is forecast to roast in more the 40C heat for the next three days. Meanwhile, wildfires on Turkey's coastal provinces are raging for a second day running. Read more:What is a 'heat dome'?How does sunscreen protect us?   More than 50,000 people have been evacuated from their homes, including 42,000 from the western province of Izmir, where officials say strong winds have fanned the flames. Turkey's Hatay Province has also seen wildfires. A Met Office spokesperson said Tuesday was likely to mark \"the peak of this current heatwave in terms of absolute temperatures we're expecting\" in the UK. Colder temperatures will come in from the north overnight and into Wednesday morning, Stephen Dixon said."
    },
    {
        "title": "Sean 'Diddy' Combs holds head in his hands as jury reaches a partial verdict",
        "description": "Jurors in the trial of Sean \"Diddy\" Combs have reached a verdict on four of the five counts against him - but the hip-hop mogul will have to wait to learn his fate.",
        "url": "https://news.sky.com/story/sean-diddy-combs-jurors-reach-verdicts-on-four-out-of-five-charges-in-sex-trafficking-and-racketeering-trial-13391219",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sean-combs-diddy-trial_6954953.jpg?20250701232106",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-01 21:32:00",
        "Headline": "Jurors sent a note to say they had reached verdicts on two charges of sex-trafficking and two charges of transportation for prostitution - but had been unable to reach a unanimous decision on the charge of racketeering conspiracy.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Jurors in the trial of Sean \"Diddy\" Combs have reached a verdict on four of the five counts against him - but the hip-hop mogul will have to wait to learn his fate. In tense scenes towards the end of the court day on Tuesday, jurors sent a note to say they had reached verdicts on two charges of sex trafficking and two charges of transportation for prostitution, but had been unable to reach a unanimous decision on the charge of racketeering conspiracy. Combs's lawyers surrounded him at the defence table after the note was sent to the court, and at one point he held his head in his hands. After discussions with prosecution and defence lawyers, Judge Arun Subramanian told jurors to continue deliberating on Wednesday rather than deliver a partial verdict. Diddy trial - live updates The jury has testimony from more than 30 witnesses to consider - including Combs's former long-term partner Casandra \"Cassie\" Ventura and another former girlfriend called \"Jane\", who testified under a pseudonym to protect her identity. Prosecutors allege the 55-year-old rapper used his fame and power to force Cassie and \"Jane\" into drug-fuelled sex sessions with male sex workers, which were referred to as \"freak-offs\", \"wild king nights\", or \"hotel nights\". He was also physically violent and blackmailed them with footage, jurors were told. They also heard from \"Mia\", a former employee who alleged she was sexually assaulted by the rapper on several occasions during her career. She also testified using a pseudonym. Combs has pleaded not guilty to all charges and his defence team has argued that prosecutors are attempting to criminalise what they say was a consensual \"swingers lifestyle\". The rapper chose not to testify and his lawyers did not call any witnesses, building their arguments instead through lengthy cross-examinations of the witnesses called by the prosecution. Count 1: Racketeering conspiracy - up to life in prison Count 2: Sex-trafficking of Cassie Ventura - a minimum of 15 years and maximum of life in prison Count 3: Transporting individuals including but not limited to Cassie Ventura to engage in prostitution - a maximum sentence of 10 years in prison Count 4: Sex-trafficking of Jane* - a minimum of 15 years and maximum of life in prison Count 5: Transporting individuals including but not limited to Jane to engage in prostitution - a maximum of 10 years in prison What is racketeering conspiracy? Racketeering conspiracy, which is count one on the verdict sheet, is the most complicated of the charges against Combs. Jurors need to decide not only whether the rapper created a \"racketeering enterprise\", but also if he was involved in various offences as part of this, including kidnapping, arson and bribery. The charge falls under the US's RICO laws (the Racketeer Influenced and Corrupt Organisations Act), which is best known for being used in relation to organised crime and drug cartel cases. Read more:Prosecution's closing argumentDefence's closing argument After closing arguments last week, jurors began deliberation on Monday and had spent about 13 hours discussing in total by the time they sent their note. Before reaching the verdict on the four counts, they had requested to review crucial testimony from Cassie about her account of an assault in a hotel in Los Angeles in 2016. Captured on CCTV, the footage was played in court several times - showing Combs, wearing only a towel and socks, beating, kicking and dragging Cassie in a hallway. His defence team admitted in their opening statement that this was domestic violence, and said the music star regretted these actions - but that they did not amount to any of the federal charges against him. Read more:The rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony As well as Cassie's evidence on that assault, they asked to see her testimony on an incident at the Cannes Film Festival in 2013 - when she said Combs accused her of taking drugs from him and kicked her off of his yacht. On their way back to the US, she told the court, he threatened to release explicit videos of her having sex with an escort. Jurors also wanted to review testimony given by a male sex worker at the start of the trial. Combs could face 15 years to life in prison if he is convicted of all charges. Jurors will continue deliberating on the racketeering conspiracy charge on Wednesday."
    },
    {
        "title": "Trump says Israel has agreed on terms for 60-day ceasefire in Gaza, and has warning for Hamas",
        "description": "Donald Trump has said Israel has agreed on terms for a 60-day ceasefire in Gaza, and is urging Hamas to accept the deal before conditions worsen.",
        "url": "https://news.sky.com/story/trump-says-israel-has-agreed-on-terms-for-60-day-ceasefire-in-gaza-and-has-warning-for-hamas-13391229",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-israel_6954967.jpg?20250702031515",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-01 23:41:00",
        "Headline": "The US president has been increasing pressure on the Israeli government and Hamas to work out a ceasefire and hostage agreement to end the war in Gaza.",
        "Content": " Donald Trump has said Israel has agreed on terms for a 60-day ceasefire in Gaza, and is urging Hamas to accept the deal before conditions worsen. The US president announced the development ahead of hosting Israeli Prime Minister Benjamin Netanyahu for talks at the White House next week. He has been increasing pressure on the Israeli government and Hamas to work out a ceasefire and hostage agreement to end the war. \"My Representatives had a long and productive meeting with the Israelis today on Gaza. Israel has agreed to the necessary conditions to finalise the 60 Day CEASEFIRE, during which time we will work with all parties to end the War,\" Mr Trump wrote on social media - adding that Qatari and Egyptian officials would deliver the final proposal. \"I hope, for the good of the Middle East, that Hamas takes this Deal, because it will not get better - IT WILL ONLY GET WORSE.\" US correspondent In the long Gaza war, this is a significant moment. For the people of Gaza, for the hostages and their families - this could be the moment it ends. But we have been here before, so many times.  The key question - will Hamas accept what Israel has agreed to: a 60-day ceasefire? At the weekend, a source at the heart of the negotiations told me: \"Both Hamas and Israel are refusing to budge from their position - Hamas wants the ceasefire to last until a permanent agreement is reached. Israel is opposed to this. At this point only President Trump can break this deadlock.\" The source added: \"Unless Trump pushes, we are in a stalemate.\" The problem is that the announcement made now by Donald Trump - which is his social-media-summarised version of whatever Israel has actually agreed to - may just amount to Israel's already-established position.  We don't know the details and conditions attached to Israel's proposals.  Would Israeli troops withdraw from Gaza? Totally? Or partially? How many Palestinian prisoners would they agree to release from Israel's jails? And why only 60 days? Why not a total ceasefire? What are they asking of Hamas in return? We just don't know the answers to any of these questions, except one.  We do know why Israel wants a 60-day ceasefire, not a permanent one. It's all about domestic politics.  If Israeli Prime Minister Benjamin Netanyahu was to agree now to a permanent ceasefire, the extreme right-wingers in his coalition would collapse his government.  Itamar Ben-Gvir and Bezalel Smotrich have both been clear about their desire for the war to continue. They hold the balance of power in Mr Netanyahu's coalition.   If Mr Netanyahu instead agrees to just 60 days - which domestically he can sell as just a pause - then that may placate the extreme right-wingers for a few weeks until the Israeli parliament, the Knesset, is adjourned for the summer. It is also no coincidence that the US president has called for Mr Netanyahu's corruption trial to be scrapped.  Without the prospect of jail, Mr Netanyahu might be more willing to quit the war safe in the knowledge that focus will not shift immediately to his own political and legal vulnerability."
    },
    {
        "title": "Donald Trump celebrates 'big beautiful bill' being passed in Senate after fresh spat with Elon Musk",
        "description": "Donald Trump said it was \"music to my ears\" after his \"big beautiful bill\" was narrowly passed in the US Senate, following a fresh spat with Elon Musk.",
        "url": "https://news.sky.com/story/elon-musk-steps-up-attacks-on-trump-once-again-and-calls-for-new-political-party-13390720",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-donald-trump_6954126.jpg?20250701055647",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-01 02:28:00",
        "Headline": "Following weeks of relative silence after clashing with Donald Trump, the Tesla chief executive warned the president's \"big beautiful bill\" will increase America's national debt.",
        "Content": "Donald Trump said it was \"music to my ears\" after his \"big beautiful bill\" was narrowly passed in the US Senate, following a fresh spat with Elon Musk. The US president, who has been in Florida visiting the new \"Alligator Alcatraz\" migrant detention centre, at one point said he would have to \"take a look\" as to whether he could deport the tech billionaire as their row over the bill resurfaced. Senate Republicans were able to push through Mr Trump's tax breaks and spending cuts bill despite opposition from Democrats and their own ranks. In the end the vote tally was 50-50, with vice president JD Vance casting the tie-breaking vote. Three Republican senators - Thom Tillis, Susan Collins and Rand Paul - joined all Democrats in voting against it. \"The big not so beautiful bill has passed,\" Mr Paul said afterwards. The bill now goes to the House of Representatives, where it will be debated, with a vote on Wednesday. Speaking at a news conference at the migrant detention centre after finding out the result of Tuesday's vote, Mr Trump said: \"Wow, music to my ears.\" Musk and Trump row resurfaces It came after a day where Mr Musk stepped up his attacks on Mr Trump's sweeping tax and spending bill, weeks after a spectacular fallout between the world's richest man and the US president. Following weeks of relative silence after clashing with Mr Trump over the bill, the billionaire vowed to unseat politicians who support it. In a post on X, Musk said those who had campaigned on cutting spending but then backed the bill \"should hang their heads in shame\". He added: \"And they will lose their primary next year if it is the last thing I do on this Earth.\" Musk also threatened to put their faces on a poster which said \"liar\" and \"voted to increase America's debt\" by $5trn (£3.6trn). The posts attracted a swift reply from Mr Trump, who claimed the billionaire \"may get more subsidy than any human being in history\" for his electric car business. \"Without subsidies, Elon would probably have to close up shop and head back home to South Africa,\" he wrote on Truth Social. \"No more Rocket launches, Satellites, or Electric Car Production, and our Country would save a FORTUNE. Perhaps we should have DOGE take a good, hard, look at this? BIG MONEY TO BE SAVED!!!\" Asked later if he would consider deporting Mr Musk, the US president said: \"I don't know, we'll have to take a look.\"  Musk spent at least $250m (£182m) supporting Mr Trump in his presidential campaign and then led the newly formed Department of Government Efficiency (DOGE), which sacked about 120,000 federal employees. He has argued the legislation would greatly increase the US national debt and wipe out the savings he claimed he achieved through DOGE. As the Senate discussed the package, Musk called it \"utterly insane and destructive\". The Tesla and SpaceX CEO said the bill's massive spending indicated \"we live in a one-party country - the PORKY PIG PARTY!!\" \"Time for a new political party that actually cares about the people,\" he wrote. Read more from Sky News:Stab victim describes horrible reality of knife crimeRoyal train to be scrapped with family to rely on helicopters 👉 Follow Trump100 on your podcast app 👈 Musk previously said some of his social media posts during his dramatic fallout with Mr Trump \"went too far\". He had shared a series of posts on X, including one that described Mr Trump's tax and spending bill as a \"disgusting abomination\". He also claimed, in a since-deleted post, that the president appeared in files relating to the disgraced paedophile financier Jeffrey Epstein. But Musk later wrote: \"I regret some of my posts about President @realDonaldTrump last week. They went too far.\" In response, the president told the New York Post: \"I thought it was very nice that he did that.\" Trump's trip to 'Alligator Alcatraz' Meanwhile, the US president was still keen to show his tough stance on immigration on the day his bill was voted on in the Senate. The so-called Alligator Alcatraz detention facility is at an isolated airstrip in the Everglades, around 50 miles west of Miami, capable of holding 5,000 people. White House press secretary Karoline Leavitt has said the centre is \"informally known as Alligator Alcatraz\". She said: \"There's only one road leading in, and the only way out is a one-way flight. \"It is isolated and surrounded by dangerous wildlife and unforgiving terrain. \"A detention centre surrounded by alligators, yes, I do think that's a deterrent for them to try to escape.\" During his second term, Mr Trump has even suggested reopening the actual Alcatraz - the notorious island prison off San Francisco."
    },
    {
        "title": "'Alligator Alcatraz': The airport of the future becomes symbol of Trump's migrant clampdown",
        "description": "\"If people get out, there's not much waiting for them other than alligators and pythons.\"",
        "url": "https://news.sky.com/story/alligator-alcatraz-the-airport-of-the-future-turned-into-symbol-of-trumps-migrant-clampdown-13390950",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-florida_6954860.jpg?20250701211658",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2025-07-01 11:12:00",
        "Headline": "Located on a mostly abandoned airport once built to house supersonic jets, detainees would have to \"know how to run away from an alligator\" to escape, the president joked.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  \"If people get out, there's not much waiting for them other than alligators and pythons.\" That's what Florida's attorney general has said about the new 'Alligator Alcatraz' detention centre in the southern US state. It is a symbol of the White House's determination to deport migrants from America which it says do not have a right to be in the country. Located on a mostly abandoned airport once built to house supersonic jets, detainees would have to \"know how to run away from an alligator\" to escape the facility, President Donald Trump said on Tuesday. But for critics, it's a dehumanising \"theatricalisation of cruelty\" that will cost hundreds of millions of dollars to run each year. What is Alligator Alcatraz? The Dade-Collier airport was once destined to be the world's largest airport and would have been five times the size of New York City's JFK, but it never fulfilled its potential. \n                  Man dies after being struck by lightning on honeymoon in Florida\n                 \n                  Woman killed by alligator in Florida lake\n                 \n                  Boat crashes into ferry in Florida - one dead and multiple injured as 'mass casualty incident' declared \n                 Instead, the 39-square-mile facility located about 50 miles from Miami has been used as a training facility for years - until now. \"This is an old, virtually abandoned airport facility right in the middle of the Everglades,\" Florida's attorney general James Uthmeier said as he introduced it last month. \"I call it: Alligator Alcatraz.\" He touted it as an \"efficient, low-cost opportunity\" to build a \"temporary\" detention centre \"because you don't need to invest that much in the perimeter\". It's believed that the facility could house 5,000 detainees when up and running and, according to CNN, will cost $450m (£328m) annually. Mr Uthmeier added: \"If people get out, there's not much waiting for them other than alligators and pythons. Nowhere to go, nowhere to hide.\" People sent there will be housed in repurposed Federal Emergency Management Agency (FEMA) emergency trailers and \"soft-sided temporary facilities\".  Trump visits new facility \"This is not a nice business,\" Mr Trump said while leaving the White House. Then he joked that \"we're going to teach them how to run away from an alligator if they escape prison\", ahead of visiting the centre. \"Don't run in a straight line. Run like this,\" he said, as he moved his hand in a zigzag motion. \"And you know what? Your chances go up about 1%.\" According to the University of Florida, it's actually best to dash in one direction in the rare situation when an alligator chases you. Mr Trump is using 'Alligator Alcatraz' as a symbol of his border crackdown. He wants to pressure Congress to pass a sweeping spending bill this week, which would ramp up deportations. After being given a tour of the centre, the US president said: \"Pretty soon, this facility will handle the most menacing migrants, some of the most vicious people on the planet. \"I looked outside and that's not a place I want to go hiking anytime soon. \"We're surrounded by miles of treacherous swampland and the only way out is really deportation.\" Immigrants 'do not deserve' to be at facility There has been heavy criticism of the detention centre from Democrats and activists, with protesters often gathering nearby. Former congressman David Jolly, an ex-Republican who is now running for Florida governor as a Democrat, called the facility a \"callous political stunt\". \"The fact that we're going to have 3,000 people detained in tents, in the Everglades, in the middle of the hot Florida summer, during hurricane season, this is a bad idea all around that needs to be opposed and stopped,\" Thomas Kennedy, a policy analyst for the Florida Immigrant Coalition said, according to CNN. \"It's like a theatricalisation of cruelty,\" immigration activist Maria Asuncion Bilbao said. Phyllis Andrews, a retired teacher who travelled to the area to protest against Mr Trump's visit, said: \"I have a lot of immigrants I have been working with. They are fine people. They do not deserve to be incarcerated here. \"It's terrible that there's a bounty on their head.\""
    },
    {
        "title": "What's in Trump's 'Big Beautiful Bill'?",
        "description": "👉 <a href=\"https://podfollow.com/trump100/view\" target=\"_blank\">Follow Trump100 on your podcast app</a> 👈",
        "url": "https://news.sky.com/story/whats-in-trumps-big-beautiful-bill-13390719",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-01 01:12:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈 Martha Kelner and Mark Stone break down what's in Donald Trump's huge tax and spending bill. He's trying to sign it into law by the end of the week. They also discuss the State Department's decision to revoke US visas for British band Bob Vylan after their Glastonbury performance. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel. "
    },
    {
        "title": "Trump's USAID cuts could lead to 14 million deaths, report warns",
        "description": "Around 14 million people could die across the world over the next five years because of cuts to the US Agency for International Development (USAID), researchers have warned.",
        "url": "https://news.sky.com/story/trumps-usaid-cuts-could-lead-to-14-million-deaths-report-warns-13390818",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-usaid-bangladesh_6954404.jpg?20250701131038",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-01 08:15:00",
        "Headline": "Cuts to the agency's schemes will lead to more fatalities from diseases like AIDS, malaria and tuberculosis, and a higher mortality rate among women and young children.",
        "Content": "Around 14 million people could die across the world over the next five years because of cuts to the US Agency for International Development (USAID), researchers have warned. Children under five are expected to make up around a third (4.5 million) of the mortalities, according to a study published in The Lancet medical journal. Estimates showed that \"unless the abrupt funding cuts announced and implemented in the first half of 2025 are reversed, a staggering number of avoidable deaths could occur by 2030\". \"Beyond causing millions of avoidable deaths - particularly among the most vulnerable - these cuts risk reversing decades of progress in health and socioeconomic development in LMICs [low and middle-income countries],\" the report said.  USAID programmes have prevented the deaths of more than 91 million people, around a third of them among children, the study suggests. The agency's work has been linked to a 65% fall in deaths from HIV/AIDS, or 25.5 million people. Eight million deaths from malaria, more than half the total, around 11 million from diarrheal diseases and nearly five million from tuberculosis (TB), have also been prevented. USAID has been vital in improving global health, \"especially in LMICs, particularly African nations,\" according to the report.  Established in 1961, the agency was tasked with providing humanitarian assistance and helping economic growth in developing countries, especially those deemed strategic to Washington. But the Trump administration has made little secret of its antipathy towards the agency, which became an early victim of cuts carried out by the Department of Government Efficiency (DOGE) - formerly led by Elon Musk - in what the US government said was part of a broader plan to remove wasteful spending. Read more:USAID explainedUSAID 'a bowl of worms' - Musk  In March, US Secretary of State Marco Rubio said more than 80% of USAID schemes had been closed following a six-week review, leaving around 1,000 active. The US is the world's largest humanitarian aid donor, providing around $61bn (£44bn) in foreign assistance last year, according to government data, or at least 38% of the total, and USAID is the world's leading donor for humanitarian and development aid, the report said. Between 2017 and 2020, the agency responded to more than 240 natural disasters and crises worldwide - and in 2016 it sent food assistance to more than 53 million people across 47 countries. The study assessed all-age and all-cause mortality rates in 133 countries and territories, including all those classified as low and middle-income, supported by USAID from 2001 to 2021."
    },
    {
        "title": "Bryan Kohberger to plead guilty to murdering four University of Idaho students",
        "description": "The man accused of stabbing four University of Idaho students to death has agreed to plead guilty to the murders, in a move that would spare him from the death penalty.",
        "url": "https://news.sky.com/story/bryan-kohberger-to-plead-guilty-to-murdering-four-university-of-idaho-students-13390713",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-bryan-kohberger-university-of-idaho_6015655.jpg?20230105205452",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-01 00:31:00",
        "Headline": "Autopsies showed the four were all likely asleep when they were attacked, some had defensive wounds and each was stabbed multiple times. Two other women in the house at the time survived.",
        "Content": " The man accused of stabbing four University of Idaho students to death has agreed to plead guilty to the murders, in a move that would spare him from the death penalty. Bryan Kohberger, 30, was arrested at his parents' home in Pennsylvania weeks after the killings in November 2022. He was accused of sneaking into the rented home in Moscow, Idaho, which is not far from the university campus, and attacking Ethan Chapin, Xana Kernodle, Madison Mogen and Kaylee Goncalves. Kohberger previously pleaded not guilty to charges of murder, but is now set to be sentenced to four consecutive life sentences and waive all rights to appeal. The family of Ms Goncalves spoke of their fury at the reported plea deal. In a statement after media reports about the deal, they said: \"It's true! We are beyond furious at the State of Idaho. They have failed us. Please give us some time. This was very unexpected. We appreciate all your love and support.\" In a separate statement, they said: \"After more than two years, this is how it concludes with a secretive deal and a hurried effort to close the case without any input from the victims' families on the plea's details.\" Autopsies showed the four were all likely asleep when they were attacked, some had defensive wounds and each was stabbed multiple times. Two other women in the house at the time survived. Investigators matched Kohberger's DNA to genetic material recovered from a knife sheath found at the crime scene. A letter from prosecutors to the victims' families, obtained by US media, said Kohberger's lawyers had approached them to seek a plea deal. \"This resolution is our sincere attempt to seek justice for your family,\" the letter said. \"This agreement ensures that the defendant will be convicted, will spend the rest of his life in prison, and will not be able to put you and the other families through the uncertainty of decades of post-conviction, appeals.\" In Idaho, judges can reject plea agreements - but such incidents are rare. Defendants do have the right to withdraw their guilty plea if this happens. A change of plea hearing has been set for tomorrow, with the victims' families asking for it to be delayed so they can travel to the courthouse."
    },
    {
        "title": "Santander bank deal could mean TSB name disappears from UK high street",
        "description": "Santander is to buy TSB, becoming the UK's third biggest bank in the process.",
        "url": "https://news.sky.com/story/santander-bank-deal-could-mean-tsb-name-disappears-from-uk-high-street-13391155",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tsb-bank_6954889.jpg?20250701215348",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-01 18:30:00",
        "Headline": "The purchase will create a lender with nearly 28 million customers and the third-largest number of personal account balances in the UK.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Santander is to buy TSB, becoming the UK's third biggest bank in the process. It could mean the TSB brand is no longer visible on the high street, as Santander said it \"intends to integrate TSB in the Santander UK group\". Santander has agreed to pay an initial £2.65bn for TSB, with the final price expected to rise to £2.9bn when yet-to-be-announced financial results are factored in. The price is 1.5 times the value of TSB's assets. The deal is subject to approval by regulators and shareholders of TSB's parent company, Banco Sabadell, but is expected to conclude in the first three months of 2026. Money blog: M&S gives update after hack Once completed, the combined bank will have the third-largest number of personal account balances in the UK, and be fourth in terms of mortgage lending, with a total of nearly 28 million customers, Santander said. \n                  NatWest boss thanks British taxpayer for 2008 bailout after government sells remaining shares\n                 \n                  Treasury holds talks with fintech unicorns about London IPO prospects\n                 \n                  Global bank chiefs hold talks over Trump tariffs crisis\n                 Job losses may also result. Santander's interest in tabling a bid for TSB was first reported by Sky News. TSB has five million customers, offers business and personal accounts, and is the UK's tenth largest lender for mortgages and deposits. After cutting jobs and branches last year, it currently employs roughly 5,000 staff and operates 175 branches, the seventh largest network in the UK. It comes just months after speculation that Santander would leave the UK market, despite denials from the Spanish-owned lender. In recent months, it had rejected takeover attempts from rivals NatWest and Barclays. Barclays had also bid for TSB. Banco Sabadell said it was selling TSB \"to focus our strategy on Spain\", said its chief executive, Cesar Gonzalez-Bueno. \"This is an excellent deal for customers, combining two strong and complementary banks, creating one of the most substantial banks in the UK and materially enhancing the competitiveness of the industry,\" said Mike Regnier, CEO of Santander UK."
    },
    {
        "title": "Energy bills: Network charges set to rise as price cap eases",
        "description": "A major component within household energy bills is set to rise sharply from next year to help pay for efforts to maintain energy security during the transition to green power.",
        "url": "https://news.sky.com/story/energy-bills-network-charges-set-to-rise-as-price-cap-eases-13390509",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wind-farm-wind-power_6840032.jpg?20250226090448",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-01 06:00:00",
        "Headline": "So-called network charges make up 22% of a typical household bill and are set to go up from April next year, placing more upwards pressure on family finances unless wholesale costs were to fall back very sharply.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  A major component within household energy bills is set to rise sharply from next year to help pay for efforts to maintain energy security during the transition to green power. The industry regulator Ofgem's draft determination on how much it will allow network operators to charge energy suppliers from 1 April 2026 to 31 March 2031 would push up network costs within household bills by £24 a year. These charges currently account for 22% of the total bill. Money latest: 'I worry I'll lose my house' The findings, which will be subject to consultation before a final determination by the end of the year, reflect demands on network operators to make power and gas networks fit for the future amid expansion in renewable and nuclear energy to meet net zero ambitions. Ofgem says the plans it has given provisional approval for amount to a £24bn investment programme over the five-year term - a four-fold increase on current levels. A total of 80 major projects includes upgrades to more than 2,700 miles of overhead power lines. \n                  Energy future: Paying up front should lead to tangible savings ahead\n                 \n                  Spanish-owned Scottish Power sparks merger talks with Ovo Energy\n                 \n                  Why are UK industrial electricity prices so high - and what can be done about it?\n                 If rubber stamped as planned, the resulting network cost increases threaten further upwards pressure on bills from next April - a month that has now become synonymous with rising essential bills. The watchdog revealed its plans as the 22 million British households on the energy price cap benefit from the first decline for a year. It is coming down from an annual average £1,849 between April and June to £1,720 from July to September. That's on the back of easing wholesale costs seen during the spring - before the temporary surge in wholesale gas prices caused by the recent instability in the Middle East. A new forecast released by industry specialist Cornwall Insight suggested households were on track to see a further, but slight, decline when the cap is adjusted again in October. At the current level it is 28% lower than at the height of the energy-led cost of living crisis - but 10% higher than the same period last year. The price cap does not limit total bills because householders still pay for the amount of energy they consume. Ofgem is continuing to recommend consumers shop around for fixed rate deals in the market as they can offer savings compared with the price cap and shield homes from any price shocks seen within their fixed terms. Read more from Sky News:Starmer faces rebellion at key welfare cuts voteTrump piles more pressure on central bank chief Jonathan Brearley, the regulator's chief executive, said: \"Britain's reliance on imported gas has left us at the mercy of volatile international gas prices which during the energy crisis would have caused bills to rise as high as £4,000 for an average household without government support. \"Even today the price cap can move up or down by hundreds of pounds with little we can do about it. \"This record investment will deliver a homegrown energy system that is better for Britain and better for customers. It will ensure the system has greater resilience against shocks from volatile gas prices we don't control. \"These 80 projects are a long-term insurance policy against threats to Britain's energy security and the instability of prices. By bringing online dozens of homegrown, renewable generation sites and modernising our energy system to the one we will need in the future we can boost growth and give ourselves more control over prices too. \"Doing nothing is not an option and will cost consumers more - this is critical national infrastructure. The sooner we build the network we need, and invest to strengthen our resilience, the lower the cost for bill payers will be in the future.\""
    },
    {
        "title": "Energy future: Paying up front should lead to tangible savings ahead",
        "description": "Ofgem's approval of a &#163;24bn investment in expanding the energy grid, and the &#163;102 bill increase that will pay it, is an acknowledgement that cleaner, more predictable and hopefully cheaper prices in future will only come at a price today.",
        "url": "https://news.sky.com/story/energy-future-paying-up-front-should-lead-to-tangible-savings-ahead-13390939",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-price-cap-energy-graphic_6167083.png?20230525125146",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-07-01 10:59:00",
        "Headline": "Sky's Paul Kelso says the energy regulator is trying to strike a crucial balance through its provisional plan, one that must work for the UK's shift away from natural gas to bring down both bills as well as emissions.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Ofgem's approval of a £24bn investment in expanding the energy grid, and the £102 bill increase that will pay it, is an acknowledgement that cleaner, more predictable and hopefully cheaper prices in future will only come at a price today. The investments given the green light today, £10bn of which will be spent by the three electricity grid operators in England, are fundamental to the UK's energy transition. They will pay for new high-voltage cables, on pylons, underground and undersea, along with new substations and circuitry required to connect new renewable sources, primarily offshore wind, to the people who need it. Money latest: 'I worry I'll lose my house' It is a massive and ambitious project that will ultimately cost £80bn with the goal of delivering a clean power grid. The aim is to reduce both emissions and the UK's reliance on volatile wholesale gas markets, which both underpin electricity supply today, and set the price in the market, even when renewables provide the majority of supply. That volatility saw domestic bills rise above £4,000 in the wake of Russia's invasion of Ukraine, prompting Liz Truss to authorise a £40bn state subsidy to cap bills at £2,500 for every household in the country. \n                  Energy bills: Network charges set to rise as price cap eases\n                 \n                  Spanish-owned Scottish Power sparks merger talks with Ovo Energy\n                 \n                  Why are UK industrial electricity prices so high - and what can be done about it?\n                  An expansion of renewables and storage capacity alongside new nuclear should at some point in the future tip the balance so gas is no longer king in the UK market. To get there however we are all going to have to pay upfront, in the shape of subsidies and price guarantees to incentivise the building of renewables, and the increase in \"network costs\" announced by Ofgem today. Over time these investments should deliver tangible savings. These will include an end to \"constraint payments\" paid to power stations and wind farms to switch off in times of excess supply because the grid can't handle the load. They cost customers more than £1bn last year and are forecast to more than double before new infrastructure brings them down. Ofgem say that will save around £80 per household, cutting the net cost expansion to just £24 per-household per-year. The private companies delivering the investment meanwhile - National Grid in England and SSE and Scottish Power in Scotland - will receive a return on their investments of 6% on equity, an average of 5.57% on debt, and be permitted to take dividends of 3%. A fair return says Ofgem. Consumers will want service and prices to match if they are to agree."
    },
    {
        "title": "Donald Trump celebrates 'big beautiful bill' being passed in Senate after fresh spat with Elon Musk",
        "description": "Donald Trump said it was \"music to my ears\" after his \"big beautiful bill\" was narrowly passed in the US Senate, following a fresh spat with Elon Musk.",
        "url": "https://news.sky.com/story/elon-musk-steps-up-attacks-on-trump-once-again-and-calls-for-new-political-party-13390720",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-donald-trump_6954126.jpg?20250701055647",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-01 02:28:00",
        "Headline": "Following weeks of relative silence after clashing with Donald Trump, the Tesla chief executive warned the president's \"big beautiful bill\" will increase America's national debt.",
        "Content": "Donald Trump said it was \"music to my ears\" after his \"big beautiful bill\" was narrowly passed in the US Senate, following a fresh spat with Elon Musk. The US president, who has been in Florida visiting the new \"Alligator Alcatraz\" migrant detention centre, at one point said he would have to \"take a look\" as to whether he could deport the tech billionaire as their row over the bill resurfaced. Senate Republicans were able to push through Mr Trump's tax breaks and spending cuts bill despite opposition from Democrats and their own ranks. In the end the vote tally was 50-50, with vice president JD Vance casting the tie-breaking vote. Three Republican senators - Thom Tillis, Susan Collins and Rand Paul - joined all Democrats in voting against it. \"The big not so beautiful bill has passed,\" Mr Paul said afterwards. The bill now goes to the House of Representatives, where it will be debated, with a vote on Wednesday. Speaking at a news conference at the migrant detention centre after finding out the result of Tuesday's vote, Mr Trump said: \"Wow, music to my ears.\" Musk and Trump row resurfaces It came after a day where Mr Musk stepped up his attacks on Mr Trump's sweeping tax and spending bill, weeks after a spectacular fallout between the world's richest man and the US president. Following weeks of relative silence after clashing with Mr Trump over the bill, the billionaire vowed to unseat politicians who support it. In a post on X, Musk said those who had campaigned on cutting spending but then backed the bill \"should hang their heads in shame\". He added: \"And they will lose their primary next year if it is the last thing I do on this Earth.\" Musk also threatened to put their faces on a poster which said \"liar\" and \"voted to increase America's debt\" by $5trn (£3.6trn). The posts attracted a swift reply from Mr Trump, who claimed the billionaire \"may get more subsidy than any human being in history\" for his electric car business. \"Without subsidies, Elon would probably have to close up shop and head back home to South Africa,\" he wrote on Truth Social. \"No more Rocket launches, Satellites, or Electric Car Production, and our Country would save a FORTUNE. Perhaps we should have DOGE take a good, hard, look at this? BIG MONEY TO BE SAVED!!!\" Asked later if he would consider deporting Mr Musk, the US president said: \"I don't know, we'll have to take a look.\"  Musk spent at least $250m (£182m) supporting Mr Trump in his presidential campaign and then led the newly formed Department of Government Efficiency (DOGE), which sacked about 120,000 federal employees. He has argued the legislation would greatly increase the US national debt and wipe out the savings he claimed he achieved through DOGE. As the Senate discussed the package, Musk called it \"utterly insane and destructive\". The Tesla and SpaceX CEO said the bill's massive spending indicated \"we live in a one-party country - the PORKY PIG PARTY!!\" \"Time for a new political party that actually cares about the people,\" he wrote. Read more from Sky News:Stab victim describes horrible reality of knife crimeRoyal train to be scrapped with family to rely on helicopters 👉 Follow Trump100 on your podcast app 👈 Musk previously said some of his social media posts during his dramatic fallout with Mr Trump \"went too far\". He had shared a series of posts on X, including one that described Mr Trump's tax and spending bill as a \"disgusting abomination\". He also claimed, in a since-deleted post, that the president appeared in files relating to the disgraced paedophile financier Jeffrey Epstein. But Musk later wrote: \"I regret some of my posts about President @realDonaldTrump last week. They went too far.\" In response, the president told the New York Post: \"I thought it was very nice that he did that.\" Trump's trip to 'Alligator Alcatraz' Meanwhile, the US president was still keen to show his tough stance on immigration on the day his bill was voted on in the Senate. The so-called Alligator Alcatraz detention facility is at an isolated airstrip in the Everglades, around 50 miles west of Miami, capable of holding 5,000 people. White House press secretary Karoline Leavitt has said the centre is \"informally known as Alligator Alcatraz\". She said: \"There's only one road leading in, and the only way out is a one-way flight. \"It is isolated and surrounded by dangerous wildlife and unforgiving terrain. \"A detention centre surrounded by alligators, yes, I do think that's a deterrent for them to try to escape.\" During his second term, Mr Trump has even suggested reopening the actual Alcatraz - the notorious island prison off San Francisco."
    },
    {
        "title": "Motor Fuel Group-owner among suitors for BP's $8bn Castrol unit",
        "description": "The private equity firm which employs BP's chairman as an advisor is among the bidders exploring a takeover of Castrol, the oil giant's lubricant arm which has been put up for sale for about $8bn (&#163;5.8bn).",
        "url": "https://news.sky.com/story/motor-fuel-group-owner-among-suitors-for-bps-8bn-castrol-unit-13391147",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-castrol-oil_6954806.jpg?20250701193942",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-01 18:31:00",
        "Headline": "Clayton Dubilier & Rice, which employs BP chairman Helge Lund as an advisor, is among the bidders for the troubled oil giant's lubricants division, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm which employs BP's chairman as an advisor is among the bidders exploring a takeover of Castrol, the oil giant's lubricant arm which has been put up for sale for about $8bn (£5.8bn). Sky News has learnt that Clayton Dubilier & Rice (CD&R) has joined the ranks of strategic and financial bidders which are part of an auction launched by BP earlier this year. CD&R's involvement in the process is notable because Helge Lund, who is stepping down as BP chairman in the next 12 months, is an operating advisor to the buyout firm. Money blog: M&S gives update after hack Mr Lund has no involvement in CD&R's work on an offer for Castrol, according to insiders. The buyout firm is one of the world's largest, and owns assets in the UK including Morrisons, the supermarket chain, and Motor Fuel Group. Bloomberg News has reported that Apollo Global Management, Lone Star Funds and India's Reliance Industries are bidders for the lubricants business. \n                  Santander bank deal could mean TSB name disappears from UK high street\n                 \n                  Energy bills: Network charges set to rise as price cap eases\n                 \n                  Energy future: Paying up front should lead to tangible savings ahead\n                 The auction of Castrol is progressing at a turbulent time for BP, which is under siege from Elliott Management, the activist investor, amid demands for the company to slash costs and boost profitability. Last week, London-listed oil rival Shell denied a Wall Street Journal report that it was in early-stage talks to buy BP, saying it had not been actively considering an offer. While erroneous, the story underlined the fact that BP is regarded as a plausible takeover target because of its travails. Sky News revealed recently that former Centrica chief executive Sam Laidlaw and Ken MacKenzie, the former chair of mining giant BHP, were among those approached to replace Mr Lund at BP. Both have now withdrawn from the process. A spokesman for CD&R declined to comment, while BP has been contacted for comment."
    },
    {
        "title": "Heathrow in talks to land successor to chairman Lord Deighton",
        "description": "Heathrow Airport is sounding out candidates to take over from Lord Deighton, its long-serving chairman.",
        "url": "https://news.sky.com/story/heathrow-in-talks-to-land-successor-to-chairman-lord-deighton-13390859",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-plane_6865974.jpg?20250324184037",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-01 09:17:00",
        "Headline": "Britain's biggest airport is working with head-hunters at Russell Reynolds Associates to find a new chairman as the former Treasury minister's term nears its conclusion, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Heathrow Airport is sounding out candidates to take over from Lord Deighton, its long-serving chairman. Sky News has learnt that Britain's biggest aviation hub is working with the headhunter Russell Reynolds Associates to recruit a successor to Lord Deighton, who took up the post in 2016. The search has emerged days after Heathrow warned of a more challenging transatlantic travel market in a sign of the ongoing fallout from President Trump's trade war. Money latest: How do I get the inheritance I deserve? Under Lord Deighton, the former Treasury minister and Goldman Sachs executive, Heathrow has overhauled its ownership structure. More recently, it has been dealing with the fallout from the electrical fire close to the airport which saw Heathrow shut for nearly an entire day in March. The company said it would implement the recommendations of a review conducted by former transport secretary Ruth Kelly. \n                  Santander bank deal could mean TSB name disappears from UK high street\n                 \n                  Energy bills: Network charges set to rise as price cap eases\n                 \n                  Energy future: Paying up front should lead to tangible savings ahead\n                 Succession planning for the airport's chairmanship was disclosed in its annual report but has not been reported. In it, Lord Deighton wrote: \"In light of the recent changes to the HAHL [Heathrow Airport Holdings Limited] board resulting from the completion of the share sale on 12 December 2024, and the relatively new appointments of the chief executive and chief financial officer, the nominations committee, comprising a number of non-executive shareholder directors, has asked me to extend my appointment for a limited period to help ensure a smooth transition whilst new non-executive shareholder directors become familiar with the business and a new chair is appointed. \"I have therefore agreed to extend my role as Chair for a limited period to ensure continuity and stability on the HAHL Board during this period of transition.\" An announcement about the chosen candidate is expected later this year."
    },
    {
        "title": "The PM faced down his party on welfare and lost. I suspect things may only get worse",
        "description": "So much for an end to chaos and sticking plaster politics.",
        "url": "https://news.sky.com/story/pms-last-minute-climbdown-on-welfare-left-onlookers-aghast-and-will-embolden-labour-mps-13391160",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-beth-rigby_6915218.jpg?20250513140605",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-07-01 23:58:00",
        "Headline": "The prime minister has suffered damage to his authority and lost goodwill among some Labour MPs over how efforts to reform welfare have unfolded - and it may be Rachel Reeves picking up the pieces.",
        "Content": "\n          Political editor\n              @BethRigby\n  So much for an end to chaos and sticking plaster politics. Yesterday, Sir Keir Starmer abandoned his flagship welfare reforms at the eleventh hour - hectic scenes in the House of Commons that left onlookers aghast. Facing possible defeat on his welfare bill, the PM folded in a last-minute climbdown to save his skin.  The decision was so rushed that some government insiders didn't even know it was coming - as the deputy PM, deployed as a negotiator, scrambled to save the bill or how much it would cost. \"Too early to answer, it's moved at a really fast pace,\" said one. The changes were enough to whittle back the rebellion to 49 MPs as the prime minister prevailed, but this was a pyrrhic victory. Sir Keir lost the argument with his own backbenchers over his flagship welfare reforms, as they roundly rejected his proposed cuts to disability benefits for existing claimants or future ones, without a proper review of the entire personal independence payment (PIP) system first. PM wins key welfare vote - follow latest  That in turn has blown a hole in the public finances, as billions of planned welfare savings are shelved. Chancellor Rachel Reeves now faces the prospect of having to find £5bn. As for the politics, the prime minister has - to use a war analogy - spilled an awful lot of blood for little reward. He has faced down his MPs and he has lost.  They will be emboldened from this and - as some of those close to him admit - will find it even harder to govern. After the vote, in central lobby, MPs were already saying that the government should regard this as a reset moment for relations between No 10 and the party. The prime minister always said during the election that he would put country first and party second - and yet, less than a year into office, he finds himself pinned back by his party and blocked from making what he sees are necessary reforms. I suspect it will only get worse. When I asked two of the rebel MPs how they expected the government to cover off the losses in welfare savings, Rachael Maskell, a leading rebel, suggested the government introduce welfare taxes. Meanwhile, Work and Pensions Select Committee chair Debbie Abrahams told me \"fiscal rules are not natural laws\" - suggesting the chancellor could perhaps borrow more to fund public spending. Read more:How did your MP vote?Welfare cuts branded 'Dickensian'  These of course are both things that Ms Reeves has ruled out. But the lesson MPs will take from this climbdown is that - if they push hard in enough and in big enough numbers - the government will give ground. The fallout for now is that any serious cuts to welfare - something the PM says is absolutely necessary - are stalled for the time being, with the Stephen Timms review into PIP not reporting back until November 2026.  Had the government done this differently and reviewed the system before trying to impose the cuts - a process only done ahead of the Spring Statement in order to help the chancellor fix her fiscal black hole - they may have had more success. Those close to the PM say he wants to deliver on the mandate the country gave him in last year's election, and point out that Sir Keir Starmer is often underestimated - first as party leader and now as prime minister. But on this occasion, he underestimated his own MPs. His job was already difficult enough - and after this it will be even harder still. If he can't govern his party, he can't deliver change he promised."
    },
    {
        "title": "Starmer survives rebellion as watered-down welfare cuts pass key vote",
        "description": "Sir Keir Starmer's controversial welfare bill has passed its first hurdle in the Commons despite a sizeable rebellion from his MPs.",
        "url": "https://news.sky.com/story/starmer-survives-rebellion-as-watered-down-welfare-cuts-pass-key-vote-13390841",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/ab02416b864dc07a0124964560efe7a12fe97f443b75a2de47ba9ee644bb1089_6954798.jpg?20250701193417",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-01 08:51:00",
        "Headline": "The government had to make so many concessions to avoid a rebellion, MPs only ended up voting on one part of the original bill.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer's controversial welfare bill has passed its first hurdle in the Commons despite a sizeable rebellion from his MPs. The prime minister's watered-down Universal Credit and Personal Independent Payment Bill, aimed at saving £5.5bn, was backed by a majority of 75 on Tuesday evening. A total of 49 Labour MPs voted against the bill - the largest rebellion since 47 MPs voted against Tony Blair's Lone Parent benefit in 1997, according to Professor Phil Cowley from Queen Mary University. Politics latest: Chancellor left in 'impossible situation' after PM survives welfare rebellion After multiple concessions made due to threats of a Labour rebellion, many MPs questioned what they were voting for as the bill had been severely stripped down. They ended up voting for only one part of the plan: a cut to Universal Credit (UC) sickness benefits for new claimants from £97 a week to £50 from 2026/7. The Institute for Fiscal Studies (IFS) said the bill voted through \"is not expected to deliver any savings over the next four years\" because the savings from reducing the Universal Credit health element for new claimants will be roughly offset by the cost of increasing the UC standard allowance. \n                  The PM faced down his party on welfare and lost. I suspect things may only get worse\n                 \n                  How did your MP vote on Labour's welfare bill?\n                 \n                  Why govt's promise of 'biggest boost to affordable housing in a generation' may be overblown\n                 Just 90 minutes before voting started on Tuesday evening, disabilities minister Stephen Timms announced the last of a series of concessions made as dozens of Labour MPs spoke of their fears for disabled and sick people if the bill was made law. How did your MP vote on Labour's welfare bill? In a major U-turn, he said changes in eligibility for the personal independence payment (PIP), the main disability payment to help pay for extra costs incurred, would not take place until a review he is carrying out into the benefit is published in autumn 2026. An amendment brought by Labour MP Rachael Maskell, which aimed to prevent the bill progressing to the next stage, was defeated but 44 Labour MPs voted for it.  A Number 10 source told Sky News' political editor Beth Rigby: \"Change isn't easy, we've always known that, we're determined to deliver on the mandate the country gave us, to make Britain work for hardworking people. \"We accept the will of the house, and want to take colleagues with us, our destination - a social security system that supports the most vulnerable, and enables people to thrive - remains.\" But the Conservative shadow chancellor Mel Stride called the vote \"farcical\" and said the government \"ended up in this terrible situation\" because they \"rushed it\". He warned the markets \"will have noticed that when it comes to taking tougher decisions about controlling and spending, this government has been found wanting\".  Work and Pensions Secretary Liz Kendall said: \"I wish we'd got to this point in a different way. And there are absolutely lessons to learn. \"But I think it's really important we pass this bill at the second reading, it put some really important reforms to the welfare system - tackling work disincentives, making sure that people with severe conditions would no longer be assessed and alongside our investment in employment support this will help people get back to work, because that's the brighter future for them.\" She made further concessions on Monday in the hope the rebels' fears would be allayed, but many were concerned the PIP eligibility was going to be changed at the same time the review was published, meaning its findings would not be taken into account. Her changes were: • Current PIP claimants, and any up to November 2026, would have the same eligibility criteria as they do now, instead of the stricter measure proposed • A consultation into PIP to be \"co-produced\" with disabled people and published in autumn 2026 • For existing and future Universal Credit (UC) claimants, the combined value of the standard UC allowance and the health top-up will rise \"at least in line with inflation\" every year for the rest of this parliament • The UC health top-up, for people with limited ability to work due to a disability or long-term sickness, will get a £300m boost next year - doubling the current amount - then rising to £800m the year after and £1bn in 2028/29."
    },
    {
        "title": "How did your MP vote on Labour's welfare bill?",
        "description": "Labour's welfare reforms bill has passed, with 335 MPs voting in favour and 260 against.",
        "url": "https://news.sky.com/story/how-did-your-mp-vote-on-labours-welfare-bill-13391059",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-commons-votes-vote-lookup_6954618.jpg?20250701154915",
        "type": "Politics",
        "Author": "Daniel Dunford",
        "Date Published": "2025-07-01 19:04:00",
        "Headline": "The government's welfare bill passed with a majority of 75. See how your MP voted with our lookup.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n Labour's welfare reforms bill has passed, with 335 MPs voting in favour and 260 against. It came after the government watered down the bill earlier this evening, making a dramatic last-minute concession to the demands of would-be rebel MPs who were concerned about the damage the policy would do to disabled people. The concessions could end up leaving the government with £5.5bn to make up from either tax rises or cuts elsewhere. See how your MP voted with our lookup: The government has a working majorityi of 166, so it would have taken 84 rebels to defeat the bill. In total, 49 Labour MPs still voted against the bill despite the concessions. No MPs from other parties voted alongside the government, although three MPs elected for Labour who have since had the whip removed did so. Which Labour MPs rebelled? Last week, 127 Labour MPs signed what they called a \"reasoned amendment\", a letter stating their objection to the bill as it was. The government responded with some concessions to try and win back the rebels, which was enough to convince some of them. But they were still ultimately forced to make more changes today. In total, 68 MPs who signed the initial \"reasoned amendment\" eventually voted in favour of the bill. Nine in 10 MPs elected for the first time at the 2024 general election voted with the government. That compares with fewer than three quarters of MPs who were voted in before that. A total of 42 Labour MPs also voted in favour of an amendment that would have stopped the bill from even going to a vote at all. That was voted down by 328 votes to 149. How does the rebellion compare historically? If the wording of the bill had remained unchanged and 127 MPs or more had voted against it on Tuesday, it would have been up there as one of the biggest rebellions in British parliamentary history. As it happened, it was still higher than the largest recorded during Tony Blair’s first year as PM, when 47 of his Labour colleagues (including Diane Abbott, John McDonnell and Jeremy Corbyn, who also voted against the bill on Tuesday) voted no to his plan to cut benefits for single-parent families. Follow more updates live on the Sky News Politics Hub. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Why govt's promise of 'biggest boost to affordable housing in a generation' may be overblown",
        "description": "Angela Rayner is set to announce plans to build 180,000 new social homes in the next decade, as the government seeks to \"turn the tide on the housing crisis\".",
        "url": "https://news.sky.com/story/why-govts-promise-of-biggest-boost-to-affordable-housing-in-a-generation-may-be-overblown-13391226",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-angela-rayner-deputy-prime-minister_6954959.jpg?20250702003526",
        "type": "Politics",
        "Author": "Joely Santa Cruz",
        "Date Published": "2025-07-01 22:30:00",
        "Headline": "It would be six times the number of social homes built in the 10 years up to 2024 - and forms part of a drive to build 300,000 new social and affordable properties by 2035.",
        "Content": "\n          Data journalist\n              @joelysantacruz\n Angela Rayner is set to announce plans to build 180,000 new social homes in the next decade, as the government seeks to \"turn the tide on the housing crisis\". It would be six times greater than the number of social homes built in the 10 years up to 2024 - and forms part of a drive to build 300,000 new social and affordable properties by 2035. The plan is backed by a £39bn investment announced by Chancellor Rachel Reeves in last month's spending review.  The deputy prime minister called on the social housing sector to \"work together to turn the tide of the housing crisis\", and said the investment was \"the biggest boost to social and affordable housing in a generation\". \"We are seizing this golden opportunity with both hands to transform this country by building the social and affordable homes we need, so we create a brighter future where families aren't trapped in temporary accommodation and young people are no longer locked out of a secure home,\" she said. Ms Rayner's target for social and affordable housing is part of a wider long-term plan - also due to be published on Wednesday - setting out how the government will build both more houses and improve housing standards. Here, Sky News looks at what the plan will mean for the country, how it compares to previous programmes, and how it could be affected by the increased cost of construction.  Crunching the numbers The £39bn 10-year Affordable Homes Programme is an ambitious investment in affordable housing, representing a real terms increase from the previous programme of over £1bn annually. However, claims of the \"biggest boost in a generation\" may be slightly overblown. When factoring in inflation, the annual investment of £3.9bn falls short of the equivalent £4.5bn annually from 2008 to 2011 under the previous Labour government. This was however a notably short-term uplift, and the sector will welcome the stability of the new settlement which secures funding for 10 years - compared with five years or fewer under previous programmes. Read more from Sky News:Starmer survives rebellion as welfare cuts watered down'Diddy' holds head in his hands as jury reaches partial verdict The programme sets out to deliver 30,000 affordable homes per year on average, with at least 18,000 of those being for social rent, rather than other tenures such as shared ownership. This would be more than twice the number under the previous programme, which is estimated to have delivered about 8,000 homes annually for social rent by its completion. Similarly, however, it is fewer than were delivered by the previous Labour Affordable Homes Programme, which was over 30,000 a year from 2008 to 2011. A further challenge to the government's goal of a \"generational\" uplift is the increasing cost of building, meaning they may face diminishing returns on their investment. The previous Affordable Homes Programme initially aimed to deliver 180,000 homes, which was revised down significantly to between 110,000 and 130,000 due to increasing costs and delays. This government can expect to face a similar economic landscape, particularly with an ambition to deliver a greater share of socially rented homes - the most expensive type of affordable housing to build."
    },
    {
        "title": "Chief rabbi condemns BBC's 'mishandled response' to anti-IDF chanting at Glastonbury - as Bob Vylan issue new statement",
        "description": "The chief rabbi has described the BBC's response to anti-IDF chanting at Glastonbury as \"belated and mishandled\" - as the punk-rap duo involved, Bob Vylan, said the UK government needed to talk about its \"criminal inaction\".",
        "url": "https://news.sky.com/story/chief-rabbi-condemns-bbcs-mishandled-response-to-anti-idf-chanting-at-glastonbury-13390803",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "Politics",
        "Author": "Andy Hayes, news reporter",
        "Date Published": "2025-07-01 07:55:00",
        "Headline": "Sir Ephraim Mirvis says \"outright incitement to violence and hatred\" appears to be acceptable if it's couched as \"edgy political commentary\".",
        "Content": "By Andy Hayes, news reporter  The chief rabbi has described the BBC's response to anti-IDF chanting at Glastonbury as \"belated and mishandled\" - as the punk-rap duo involved, Bob Vylan, said the UK government needed to talk about its \"criminal inaction\". Sir Ephraim Mirvis said \"vile Jew-hatred\" had been aired at the Somerset music festival and it was a \"time of national shame\". Confidence in the BBC's \"ability to treat antisemitism seriously\" has been brought to a \"new low\", he said in a post on X, adding that \"outright incitement to violence and hatred\" appeared to be acceptable if it was couched as \"edgy political commentary\". Ordinary people had not only failed to see incitement \"for what it is\" but had cheered it, chanted it, and celebrated it, he said. \"Toxic Jew-hatred is a threat to our entire society,\" he added. Bob Vylan, posting a new statement on Instagram on Tuesday, said they were \"not for the death of Jews, Arabs or any other race or group of people\". Rather, they were for the \"dismantling of a violent military machine\" - the Israel Defence Forces. Bob Vylan chanted \"death to the IDF\" at Glastonbury. As many as 95% of the IDF are thought to be Jewish. In their statement, the group said they were a \"distraction from the story\" and that whatever \"sanctions\" they received would also be a distraction. Their US visas have been revoked and United Talent Agency, their US representatives, have dropped them. Referring to the war in Gaza, they claimed the UK government does not want them to ask \"why they remain silent in the face of this atrocity\", \"why they aren't doing more to stop the killing\" and \"feed the starving\". They added: \"The more time they talk about Bob Vylan, the less time they spend answering for their criminal inaction. \"We are being targeted for speaking up. We are not the first, we will not be the last, and if you care for the sanctity of human life and freedom of speech, we urge you to speak up, too.\" It has emerged that Tim Davie, the BBC's director-general, was at Glastonbury when the duo led chants of \"Death to the IDF\" which were broadcast live. The prime minister's spokesman, asked if the PM had confidence in Mr Davie, said Sir Keir Starmer had \"confidence in the BBC\", adding: \"The position of the director-general is a matter for the BBC's board.\" Speaking in the Commons, Culture Secretary Lisa Nandy said \"accountability\" was important and it was something she had \"impressed upon the BBC leadership\". She added: \"When you have one editorial failure, it's something that must be gripped. When you have several, it becomes a problem of leadership.\" The cabinet minister said she'd called Mr Davie after Bob Vylan's set had been broadcast to find out why it had aired, and why the feed had not been cut. \"I expect answers to these questions without delay,\" she said. Meanwhile Dame Caroline Dinenage, chair of the culture, media and sport committee, has written to Mr Davie in relation to the corporation's Glastonbury coverage. The committee has said the letter asks about editorial and decision-making processes and whether consideration was given to broadcasting with a delay. It also asks about staffing levels at the festival and contingency planning. Avon and Somerset Police has begun a criminal investigation and is reviewing footage of both Bob Vylan and Kneecap's performances at Glastonbury. The force said a senior detective had been appointed - and it had been contacted by people from around the world. \"We... recognise the strength of public feeling,\" it said. During Kneecap's set, one member suggested starting a \"riot\" outside his bandmate's forthcoming court appearance, before clarifying that he meant \"support\". Liam Og O hAnnaidh, also known as Mo Chara, is charged with a terror offence. Bob Vylan had been due to tour the US before their visas were revoked. US deputy secretary of state Christopher Landau said action had been taken \"in light of their hateful tirade at Glastonbury, including leading the crowd in death chants\". \"Foreigners who glorify violence and hatred are not welcome visitors to our country,\" he added. 👉 Listen to Sky News Daily on your podcast app 👈 During Bob Vylan's set, the duo performed in front of a screen that showed several messages, including one that claimed Israel's actions in Gaza amounted to \"genocide\". The war in Gaza began after Hamas militants attacked Israel on 7 October 2023 and killed 1,200 people and took about 250 hostage. Israel's offensive in Gaza has led to the deaths of more than 56,500 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants. Read more from Sky News:Starmer faces rebellion at key welfare cuts voteTrump piles more pressure on central bank chief Media watchdog Ofcom has said the BBC \"clearly has questions to answer\" over the live stream from Glastonbury. A BBC spokesperson said: \"The director-general was informed of the incident after the performance and at that point he was clear it should not feature in any other Glastonbury coverage.\" The broadcaster respects freedom of expression but \"stands firmly against incitement to violence\", they said. They added: \"The antisemitic sentiments expressed by Bob Vylan were utterly unacceptable and have no place on our airwaves... \"The team were dealing with a live situation, but with hindsight we should have pulled the stream during the performance. We regret this did not happen.\""
    },
    {
        "title": "Labour welfare cuts 'Dickensian' and 'from another era', says rebel MP ahead of vote",
        "description": "The Labour MP leading the effort to defeat the government's welfare bill has described her party's cuts as \"Dickensian\" and \"from another era\".",
        "url": "https://news.sky.com/story/nearly-40-labour-mps-back-fresh-calls-to-vote-down-starmers-welfare-bill-despite-concessions-13390774",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-leeds-welfare-not-war_6867913.png?20250326191558",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-07-01 06:52:00",
        "Headline": "Thirty-nine Labour MPs have signed a fresh amendment calling for welfare cuts to be stopped when the proposals are put to a vote today.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The Labour MP leading the effort to defeat the government's welfare bill has described her party's cuts as \"Dickensian\" and \"from another era\". Rachael Maskell urged her colleagues to vote against Sir Keir Starmer's bill, saying it was \"far from what this Labour Party is for: a party to protect the poor\". Politics latest: Starmer facing key vote on welfare reforms Ms Maskell is one of 39 Labour MPs who have signed an amendment to the Universal Credit and Personal Independence Payment Bill, which, if passed, would halt its progress through parliament. The leading rebel, whose constituency is York Central, said the bill should be voted down later this evening. She warned that 600 people took their lives under the era of Tory austerity, adding: \"The tragedy of this ideology could be worse.\" Thirty-nine MPs have so far signed Ms Maskell's amendment despite the prime minister offering significant concessions on his original plans to avoid a damaging rebellion. The number is a significant drop from the 127 Labour MPs who last week signed a separate amendment that would have killed the legislation and delivered a severe blow to Sir Keir's authority if it passed. In an attempt to minimise the looming rebellion, the prime minister watered down his original welfare proposals to minimise the impact on existing claimants. On Monday, Work and Pensions Secretary Liz Kendall confirmed that all existing claimants of the personal independence payment (PIP), the main disability benefit, will be protected from changes to eligibility, which had been tightened under the original plan. She also confirmed that all current recipients of the health element of Universal Credit, as well as any new applicants meeting the \"severe conditions criteria\", will now have their incomes protected in real terms. Previously, the government had planned to freeze the UC health top-up at £97 a week during this parliament. Ms Kendall also promised that a consultation into PIP - \"co-produced\" with disabled people - will be published next autumn, which was a key demand of the rebels. Analysis by the government published on Monday revealed the new welfare offer would still push 150,000 more people into poverty by 2030 - down from the 250,000 estimated under the original plan. Ms Kendall said the U-turn on welfare cuts will cost taxpayers about £2.5bn by 2030 - less than half the £4.8bn the government had expected to save with its initial proposals. 👉Listen to Politics at Sam and Anne's on your podcast app👈 The fresh amendment signed by the 39 Labour MPs calls for the bill to be dropped over concerns that there has not been a proper, formal consultation with disabled people - and the additional employment support funding will not be in place until the end of the decade. Some MPs have also expressed concerns that the bill would create a two-tier benefits system that treats existing claimants and new claimants differently. Sarah Owen, the Labour MP for Luton North and the chair of the Women and Equalities Committee, on Monday questioned whether a \"three-tier\" benefits system could be created, when taking into account the fact that a government review is being carried out into the PIP assessment system by minister Stephen Timms. Read more:Culture secretary hits out at BBC over Glastonbury controversyStarmer urged to establish Ukraine-style visa for Gazans  Her concerns were echoed by Labour MP Emma Lewell, who said the government's promised review into PIP -which is not due to report back until November 2026 - was \"starting to look a little bit predetermined\". She also said \"a vote for this bill today is a vote to plunge 150,000 people into poverty and to tighten eligibility criteria for those who need support the most\". Comparing it to the Conservative welfare reforms, she said she and her fellow MPs were being \"asked to vote blind today\", with insufficient time for scrutiny and no formal consultation with disabled people. \"Constituents will never forgive, and it will haunt those MPs who voted for it,\" she added. Speaking during the second reading Commons debate on Tuesday, Ms Kendall defended pressing on with welfare changes pending the outcome of the Timms review into the PIP assessment process. The review, which will look at the PIP assessment process and the criteria for being awarded PIP, will be published at roughly the same time as the changes come into force, from November 2026. Defending the timings, Ms Kendall told MPs the review was a \"major undertaking that will take time to get right, especially if we co-produce it properly\". She said any changes from the review \"will be implemented as soon as is practicably possible\", and that after any changes are made, existing PIP claimants will be able to ask for a reassessment."
    },
    {
        "title": "Starmer on a knife edge",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>&#160;&#160;&#160;&#160;",
        "url": "https://news.sky.com/story/starmer-on-a-knife-edge-13390768",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250623145702",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-01 06:35:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈     Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics.  It's judgement day for the government's welfare bill and it's unclear from all sides whether the legislation will pass, despite billions of pounds worth of concessions from the prime minister to win over his backbench MPs. The bill could lead to Sir Keir Starmer's largest rebellion so far, exactly one year on from the day that he came into power - leaving questions about his credibility and authority to govern. "
    },
    {
        "title": "UK content creators demand formal recognition from the government",
        "description": "The UK's YouTubers, TikTok creators and Instagram influencers have been surveyed on mass for the first time ever, and are demanding formal recognition from the government.",
        "url": "https://news.sky.com/story/uk-content-creators-demand-formal-recognition-from-the-government-13391178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-youtube-creator_6954855.png?20250701210257",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-07-01 19:49:00",
        "Headline": "Fifty-six per cent of the more than 10,000 creators surveyed said they do not think UK creators have a \"voice in shaping government policies\" that affect them. Nearly half think their value is not recognised by the broader creative industry.",
        "Content": "\n          Science and technology reporter\n        The UK's YouTubers, TikTok creators and Instagram influencers have been surveyed on mass for the first time ever, and are demanding formal recognition from the government. The creator economy in the UK is thought to employ around 45,000 people and contribute over £2bn to the country in one year alone, according to the new research by YouTube and Public First. But, despite all that value, its workers say they feel underappreciated by the authorities. \"If you look at the viewership, our channel is not too different from a big media company,\" said Max Klymenko, a content creator with more than 10 million subscribers and half a billion monthly views on average. \"If you look at the relevancy, especially among young audiences, I will say that we are more relevant. That said, we don't really get the same treatment,\" he told Sky News. Fifty-six per cent of the more than 10,000 creators surveyed said they do not think UK creators have a \"voice in shaping government policies\" that affect them. Only 7% think they get enough support to access finance, while just 17% think there is enough training and skills development here in the UK. \n                  4Chan being investigated by UK officials under new online safety rules\n                 \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 \n                  TikTok fined millions for illegally sending users' data to China\n                 Nearly half think their value is not recognised by the broader creative industry. The creative industries minister, Sir Chris Bryant, said the government \"firmly recognises the integral role that creators play\" in the UK's creative industries and the fact that they help \"to drive billions into the economy\" and support more than 45,000 jobs. \"We understand more can be done to help creators reach their full potential, which is why we are backing them through our new Creative Industries Sector Plan,\" he said. \"The UK has got a fantastic history of supporting the creative industries,\" said Ben Woods, a creator economy analyst, Midia Research who was not involved in the report. \"Whether you look at the film side, lots of blockbuster films are being shot here, or television, which is making waves on the global stage. \"But perhaps the government needs to broaden that lens a little bit to look at just what's going on within the creator economy as well, because it is highly valuable, it's where younger audiences are spending a lot of their time and [the UK is] really good at it.\" Read more from Sky News:Trump says 'very wealthy group' has agreed to buy TikTok in USMajor porn sites to introduce 'robust' age verification in UK According to YouTube, formal recognition would mean creators are factored into official economic impact data reporting, are represented on government creative bodies, and receive creator-specific guidance from HMRC on taxes and finances. For some, financial guidance and clarity would be invaluable; the 'creator' job title seems to cause problems when applying for mortgages or bank loans. \"It's really difficult as a freelancer to get things like mortgages and bank accounts and credit and those types of things,\" said podcaster David Brown, who owns a recording studio for creators. \"A lot of people make very good money doing it,\" he told Sky News. \"They're very well supported. They have a lot of cash flow, and they are successful at doing that job. It's just the way society and banking and everything is set up. It makes it really difficult.\" The creative industries minister said he is committed to appointing a creative freelance champion and increasing support from the British Business Bank in order to \"help creators thrive and drive even more growth in the sector\". The government has already pledged to boost the UK's creative industries, launching a plan to make the UK the number one destination for creative investment and promising an extra £14bn to the sector by 2035. These influencers want to make sure they are recognised as part of that."
    },
    {
        "title": "Sean 'Diddy' Combs holds head in his hands as jury reaches a partial verdict",
        "description": "Jurors in the trial of Sean \"Diddy\" Combs have reached a verdict on four of the five counts against him - but the hip-hop mogul will have to wait to learn his fate.",
        "url": "https://news.sky.com/story/sean-diddy-combs-jurors-reach-verdicts-on-four-out-of-five-charges-in-sex-trafficking-and-racketeering-trial-13391219",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sean-combs-diddy-trial_6954953.jpg?20250701232106",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-01 21:32:00",
        "Headline": "Jurors sent a note to say they had reached verdicts on two charges of sex-trafficking and two charges of transportation for prostitution - but had been unable to reach a unanimous decision on the charge of racketeering conspiracy.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Jurors in the trial of Sean \"Diddy\" Combs have reached a verdict on four of the five counts against him - but the hip-hop mogul will have to wait to learn his fate. In tense scenes towards the end of the court day on Tuesday, jurors sent a note to say they had reached verdicts on two charges of sex trafficking and two charges of transportation for prostitution, but had been unable to reach a unanimous decision on the charge of racketeering conspiracy. Combs's lawyers surrounded him at the defence table after the note was sent to the court, and at one point he held his head in his hands. After discussions with prosecution and defence lawyers, Judge Arun Subramanian told jurors to continue deliberating on Wednesday rather than deliver a partial verdict. Diddy trial - live updates The jury has testimony from more than 30 witnesses to consider - including Combs's former long-term partner Casandra \"Cassie\" Ventura and another former girlfriend called \"Jane\", who testified under a pseudonym to protect her identity. Prosecutors allege the 55-year-old rapper used his fame and power to force Cassie and \"Jane\" into drug-fuelled sex sessions with male sex workers, which were referred to as \"freak-offs\", \"wild king nights\", or \"hotel nights\". He was also physically violent and blackmailed them with footage, jurors were told. They also heard from \"Mia\", a former employee who alleged she was sexually assaulted by the rapper on several occasions during her career. She also testified using a pseudonym. Combs has pleaded not guilty to all charges and his defence team has argued that prosecutors are attempting to criminalise what they say was a consensual \"swingers lifestyle\". The rapper chose not to testify and his lawyers did not call any witnesses, building their arguments instead through lengthy cross-examinations of the witnesses called by the prosecution. Count 1: Racketeering conspiracy - up to life in prison Count 2: Sex-trafficking of Cassie Ventura - a minimum of 15 years and maximum of life in prison Count 3: Transporting individuals including but not limited to Cassie Ventura to engage in prostitution - a maximum sentence of 10 years in prison Count 4: Sex-trafficking of Jane* - a minimum of 15 years and maximum of life in prison Count 5: Transporting individuals including but not limited to Jane to engage in prostitution - a maximum of 10 years in prison What is racketeering conspiracy? Racketeering conspiracy, which is count one on the verdict sheet, is the most complicated of the charges against Combs. Jurors need to decide not only whether the rapper created a \"racketeering enterprise\", but also if he was involved in various offences as part of this, including kidnapping, arson and bribery. The charge falls under the US's RICO laws (the Racketeer Influenced and Corrupt Organisations Act), which is best known for being used in relation to organised crime and drug cartel cases. Read more:Prosecution's closing argumentDefence's closing argument After closing arguments last week, jurors began deliberation on Monday and had spent about 13 hours discussing in total by the time they sent their note. Before reaching the verdict on the four counts, they had requested to review crucial testimony from Cassie about her account of an assault in a hotel in Los Angeles in 2016. Captured on CCTV, the footage was played in court several times - showing Combs, wearing only a towel and socks, beating, kicking and dragging Cassie in a hallway. His defence team admitted in their opening statement that this was domestic violence, and said the music star regretted these actions - but that they did not amount to any of the federal charges against him. Read more:The rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony As well as Cassie's evidence on that assault, they asked to see her testimony on an incident at the Cannes Film Festival in 2013 - when she said Combs accused her of taking drugs from him and kicked her off of his yacht. On their way back to the US, she told the court, he threatened to release explicit videos of her having sex with an escort. Jurors also wanted to review testimony given by a male sex worker at the start of the trial. Combs could face 15 years to life in prison if he is convicted of all charges. Jurors will continue deliberating on the racketeering conspiracy charge on Wednesday."
    },
    {
        "title": "UK content creators demand formal recognition from the government",
        "description": "The UK's YouTubers, TikTok creators and Instagram influencers have been surveyed on mass for the first time ever, and are demanding formal recognition from the government.",
        "url": "https://news.sky.com/story/uk-content-creators-demand-formal-recognition-from-the-government-13391178",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-youtube-creator_6954855.png?20250701210257",
        "type": "Entertainment",
        "Author": "Mickey Carroll",
        "Date Published": "2025-07-01 19:49:00",
        "Headline": "Fifty-six per cent of the more than 10,000 creators surveyed said they do not think UK creators have a \"voice in shaping government policies\" that affect them. Nearly half think their value is not recognised by the broader creative industry.",
        "Content": "\n          Science and technology reporter\n        The UK's YouTubers, TikTok creators and Instagram influencers have been surveyed on mass for the first time ever, and are demanding formal recognition from the government. The creator economy in the UK is thought to employ around 45,000 people and contribute over £2bn to the country in one year alone, according to the new research by YouTube and Public First. But, despite all that value, its workers say they feel underappreciated by the authorities. \"If you look at the viewership, our channel is not too different from a big media company,\" said Max Klymenko, a content creator with more than 10 million subscribers and half a billion monthly views on average. \"If you look at the relevancy, especially among young audiences, I will say that we are more relevant. That said, we don't really get the same treatment,\" he told Sky News. Fifty-six per cent of the more than 10,000 creators surveyed said they do not think UK creators have a \"voice in shaping government policies\" that affect them. Only 7% think they get enough support to access finance, while just 17% think there is enough training and skills development here in the UK. \n                  4Chan being investigated by UK officials under new online safety rules\n                 \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 \n                  TikTok fined millions for illegally sending users' data to China\n                 Nearly half think their value is not recognised by the broader creative industry. The creative industries minister, Sir Chris Bryant, said the government \"firmly recognises the integral role that creators play\" in the UK's creative industries and the fact that they help \"to drive billions into the economy\" and support more than 45,000 jobs. \"We understand more can be done to help creators reach their full potential, which is why we are backing them through our new Creative Industries Sector Plan,\" he said. \"The UK has got a fantastic history of supporting the creative industries,\" said Ben Woods, a creator economy analyst, Midia Research who was not involved in the report. \"Whether you look at the film side, lots of blockbuster films are being shot here, or television, which is making waves on the global stage. \"But perhaps the government needs to broaden that lens a little bit to look at just what's going on within the creator economy as well, because it is highly valuable, it's where younger audiences are spending a lot of their time and [the UK is] really good at it.\" Read more from Sky News:Trump says 'very wealthy group' has agreed to buy TikTok in USMajor porn sites to introduce 'robust' age verification in UK According to YouTube, formal recognition would mean creators are factored into official economic impact data reporting, are represented on government creative bodies, and receive creator-specific guidance from HMRC on taxes and finances. For some, financial guidance and clarity would be invaluable; the 'creator' job title seems to cause problems when applying for mortgages or bank loans. \"It's really difficult as a freelancer to get things like mortgages and bank accounts and credit and those types of things,\" said podcaster David Brown, who owns a recording studio for creators. \"A lot of people make very good money doing it,\" he told Sky News. \"They're very well supported. They have a lot of cash flow, and they are successful at doing that job. It's just the way society and banking and everything is set up. It makes it really difficult.\" The creative industries minister said he is committed to appointing a creative freelance champion and increasing support from the British Business Bank in order to \"help creators thrive and drive even more growth in the sector\". The government has already pledged to boost the UK's creative industries, launching a plan to make the UK the number one destination for creative investment and promising an extra £14bn to the sector by 2035. These influencers want to make sure they are recognised as part of that."
    },
    {
        "title": "Chief rabbi condemns BBC's 'mishandled response' to anti-IDF chanting at Glastonbury - as Bob Vylan issue new statement",
        "description": "The chief rabbi has described the BBC's response to anti-IDF chanting at Glastonbury as \"belated and mishandled\" - as the punk-rap duo involved, Bob Vylan, said the UK government needed to talk about its \"criminal inaction\".",
        "url": "https://news.sky.com/story/chief-rabbi-condemns-bbcs-mishandled-response-to-anti-idf-chanting-at-glastonbury-13390803",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "Entertainment",
        "Author": "Andy Hayes, news reporter",
        "Date Published": "2025-07-01 07:55:00",
        "Headline": "Sir Ephraim Mirvis says \"outright incitement to violence and hatred\" appears to be acceptable if it's couched as \"edgy political commentary\".",
        "Content": "By Andy Hayes, news reporter  The chief rabbi has described the BBC's response to anti-IDF chanting at Glastonbury as \"belated and mishandled\" - as the punk-rap duo involved, Bob Vylan, said the UK government needed to talk about its \"criminal inaction\". Sir Ephraim Mirvis said \"vile Jew-hatred\" had been aired at the Somerset music festival and it was a \"time of national shame\". Confidence in the BBC's \"ability to treat antisemitism seriously\" has been brought to a \"new low\", he said in a post on X, adding that \"outright incitement to violence and hatred\" appeared to be acceptable if it was couched as \"edgy political commentary\". Ordinary people had not only failed to see incitement \"for what it is\" but had cheered it, chanted it, and celebrated it, he said. \"Toxic Jew-hatred is a threat to our entire society,\" he added. Bob Vylan, posting a new statement on Instagram on Tuesday, said they were \"not for the death of Jews, Arabs or any other race or group of people\". Rather, they were for the \"dismantling of a violent military machine\" - the Israel Defence Forces. Bob Vylan chanted \"death to the IDF\" at Glastonbury. As many as 95% of the IDF are thought to be Jewish. In their statement, the group said they were a \"distraction from the story\" and that whatever \"sanctions\" they received would also be a distraction. Their US visas have been revoked and United Talent Agency, their US representatives, have dropped them. Referring to the war in Gaza, they claimed the UK government does not want them to ask \"why they remain silent in the face of this atrocity\", \"why they aren't doing more to stop the killing\" and \"feed the starving\". They added: \"The more time they talk about Bob Vylan, the less time they spend answering for their criminal inaction. \"We are being targeted for speaking up. We are not the first, we will not be the last, and if you care for the sanctity of human life and freedom of speech, we urge you to speak up, too.\" It has emerged that Tim Davie, the BBC's director-general, was at Glastonbury when the duo led chants of \"Death to the IDF\" which were broadcast live. The prime minister's spokesman, asked if the PM had confidence in Mr Davie, said Sir Keir Starmer had \"confidence in the BBC\", adding: \"The position of the director-general is a matter for the BBC's board.\" Speaking in the Commons, Culture Secretary Lisa Nandy said \"accountability\" was important and it was something she had \"impressed upon the BBC leadership\". She added: \"When you have one editorial failure, it's something that must be gripped. When you have several, it becomes a problem of leadership.\" The cabinet minister said she'd called Mr Davie after Bob Vylan's set had been broadcast to find out why it had aired, and why the feed had not been cut. \"I expect answers to these questions without delay,\" she said. Meanwhile Dame Caroline Dinenage, chair of the culture, media and sport committee, has written to Mr Davie in relation to the corporation's Glastonbury coverage. The committee has said the letter asks about editorial and decision-making processes and whether consideration was given to broadcasting with a delay. It also asks about staffing levels at the festival and contingency planning. Avon and Somerset Police has begun a criminal investigation and is reviewing footage of both Bob Vylan and Kneecap's performances at Glastonbury. The force said a senior detective had been appointed - and it had been contacted by people from around the world. \"We... recognise the strength of public feeling,\" it said. During Kneecap's set, one member suggested starting a \"riot\" outside his bandmate's forthcoming court appearance, before clarifying that he meant \"support\". Liam Og O hAnnaidh, also known as Mo Chara, is charged with a terror offence. Bob Vylan had been due to tour the US before their visas were revoked. US deputy secretary of state Christopher Landau said action had been taken \"in light of their hateful tirade at Glastonbury, including leading the crowd in death chants\". \"Foreigners who glorify violence and hatred are not welcome visitors to our country,\" he added. 👉 Listen to Sky News Daily on your podcast app 👈 During Bob Vylan's set, the duo performed in front of a screen that showed several messages, including one that claimed Israel's actions in Gaza amounted to \"genocide\". The war in Gaza began after Hamas militants attacked Israel on 7 October 2023 and killed 1,200 people and took about 250 hostage. Israel's offensive in Gaza has led to the deaths of more than 56,500 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants. Read more from Sky News:Starmer faces rebellion at key welfare cuts voteTrump piles more pressure on central bank chief Media watchdog Ofcom has said the BBC \"clearly has questions to answer\" over the live stream from Glastonbury. A BBC spokesperson said: \"The director-general was informed of the incident after the performance and at that point he was clear it should not feature in any other Glastonbury coverage.\" The broadcaster respects freedom of expression but \"stands firmly against incitement to violence\", they said. They added: \"The antisemitic sentiments expressed by Bob Vylan were utterly unacceptable and have no place on our airwaves... \"The team were dealing with a live situation, but with hindsight we should have pulled the stream during the performance. We regret this did not happen.\""
    }
]