[
    {
        "title": "'Like a horror movie': Around 40 dead and 115 injured in Swiss ski resort bar fire",
        "description": "About 40 people were killed and 115 injured in a blaze in at a New Year's Eve Party at an upmarket Swiss ski resort, with the disaster likened to scenes from a horror film.",
        "url": "https://news.sky.com/story/like-a-horror-movie-around-40-dead-and-115-injured-in-swiss-ski-resort-bar-fire-13489518",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-crans-montana-fire_7124160.jpg?20260101222648",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-01 20:40:00",
        "Headline": "Witnesses reported seeing people smashing windows to try to escape, and others emerging with their clothes or hair having been burned off. Most of those killed or wounded are thought to be young people.",
        "Content": "About 40 people were killed and 115 injured in a blaze in at a New Year's Eve Party at an upmarket Swiss ski resort, with the disaster likened to scenes from a horror film. This article contains details some readers may find distressing. Most of the victims of the fire in Crans-Montana are thought to be young people, but identification of the bodies is expected to take several days at least. The fire broke out at roughly 1.30am local time in the Constellation Bar as people celebrated the turn of the year. Read more:What we know about deadly Swiss firePeople 'walking on top of others' trying to escape Emergency services were on the scene minutes later, but it was already too late to save dozens of people, thought to have been trapped in the basement. Authorities warned that naming the victims or establishing a definitive death toll would take time due to the severity of the burns. Experts have been using dental and DNA records to try to identify the dead. Switzerland's President Guy Parmelin described the deadly incident as \"one of the worst tragedies our country has ever known\", and King Charles called it a \"horrific disaster\". The country will hold five days of mourning. The cause of the blaze remains unclear, but witnesses reported seeing sparklers or candles in bottles in the basement bar. But Beatrice Pilloud, Valais Canton attorney general, said it was too early to determine the cause of the fire. Experts have not yet been able to go inside the charred wreckage of the bar. 'Horror movie' scenes of people with hair burned off Witnesses described scenes of panic and confusion as youngsters scrambled to escape the blaze. Samuel Rapp, who had been at a restaurant nearby, said he saw \"a lot of people at the entry trying to escape. And it was full and people [were] walking on everybody trying to escape.\" He saw many \"screaming, trying to escape\" and others \"on the floor\". Mr Rapp told Sky News he saw \"a lot of people\" whose hair had been burned off, and others \"without clothes\". Video from inside the bar shows a fire breaking out and rapidly engulfing the ceiling, spreading panic through the partygoers, who rushed towards the stairs to escape. Later footage from outside showed lines of ambulances queuing and helicopters arriving to airlift victims to nearby hospitals. Leon Christe, who works in the resort, told Sky News he was one of the first to the scene and tried to help by administering first aid. He said: \"It was very chaotic and very sad. Everywhere, there were young people who needed help, some had their clothes burned off. \"It was very traumatising.\" Another witness speaking to BFMTV described people smashing windows to escape the blaze, some severely injured, and panicked parents rushing to the scene to find out what had happened to their children. The young man said he saw about 20 people scrambling to get out of the smoke and flames, and likened what he saw from across the street to scenes from a horror movie. Vigil for victims, with many details unknown On New Year's Day, people gathered to lay flowers and light candles at a memorial near the site. Little information has yet emerged about the victims, and hospitals and emergency services are reeling from the accident. Some are being treated in the local hospital, while others were taken further afield, including to the University Hospital of Lausanne, which treats severe burns, and to France. France said at least three nationals had been injured and eight were still missing. Italian officials said 13 citizens had been injured, and another six are still unaccounted for, although details are still unfolding."
    },
    {
        "title": "UK weather: Snow warnings upgraded to amber for some areas as country sees wintry start to the year",
        "description": "Forecasters have upgraded snow weather warnings from yellow to amber in some parts of the UK.",
        "url": "https://news.sky.com/story/uk-weather-snow-warnings-upgraded-to-amber-for-some-areas-as-country-sees-wintry-start-to-the-year-13489261",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-snow-scotland_7123614.jpg?20260101130114",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-01 12:13:00",
        "Headline": "Amber warnings for heavy snow showers in parts of Scotland have been issued by the Met Office. They are in place from midday on Friday to midday on Saturday.",
        "Content": "Forecasters have upgraded snow weather warnings from yellow to amber in some parts of the UK. Yellow alerts are in place in other areas, as people face a wintry start to 2026. Amber warnings for heavy snow showers in parts of Scotland have been issued by the Met Office. They are in place from midday on Friday to midday on Saturday. Snow could bring disruption to parts of northern Scotland. The areas covered in the amber warnings include Angus, Perth and Kinross, Aberdeen, Aberdeenshire, Moray, and the Highlands. Around 10-20cm of snow is likely at low levels, with 30-40cm possible on high ground, while winds could lead to temporary blizzard conditions, according to the Met Office. It added that some delays and cancellations to rail and air travel are likely, as are power cuts and disruption on the roads, while some rural communities may be cut off. Meanwhile, there is a yellow warning for snow and ice on Friday across large parts of England and Wales, including Chester and Greater Manchester down to London and Kent. The warning lasts from midnight to noon. Snow up to 5cm could cover some areas, especially on higher ground in parts of North Wales and northwest England. Separate yellow warnings are in place for Northern Ireland between midnight and 10am on Friday. Weather warnings were already in force on New Year's Day in Scotland, with a yellow warning of snow and ice covering the northern part of the nation. The Met Office said 10cm of snow could have accumulated by Friday morning, while up to 20cm could build up above 200 metres. The warning is in force until midnight on Friday and at the weekend it extends further south, covering the area down to Perth and southerly parts of Argyll and Bute until midnight on Sunday. Read more:What we know about Swiss ski resort fireMaresca leaves position as Chelsea head coach Meanwhile, the UK Health Security Agency (UKHSA) has issued health warnings for the start of the year. It previously issued amber cold health alerts in the North East and North West of England. However, yellow alerts have been upgraded to amber across the East Midlands, West Midlands, South East, South West, East of England, Yorkshire and the Humber, and London. These warnings are in place until 10am on 6 January. The UKHSA said it means the weather is \"likely\" to cause significant impacts across health and social care services, including a \"rise in deaths\" among those with health conditions or aged 65 or over."
    },
    {
        "title": "How Britain's children are being exposed and becoming addicted to porn",
        "description": "Children aged five and under are being exposed to pornography online, leading to addiction, Sky News has learned.",
        "url": "https://news.sky.com/story/how-britains-children-are-being-exposed-and-becoming-addicted-to-porn-13489554",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pornography-flossie_7124192.png?20260102001716",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2026-01-01 23:05:00",
        "Headline": "Research carried out and shared by the charity Dignify shows that the age of children seeing sexual content on the internet is getting younger.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Children aged five and under are being exposed to pornography online, leading to addiction, Sky News has learned. Warning: This article contains details you might find distressing Research carried out and shared by the charity Dignify shows that the age of children seeing sexual content on the internet is getting younger. The organisation, which works to protect children and young people from the harmful effects of pornography, said children \"can't unsee what they've seen\". The average age of children seeing pornography is 12, according to Dignify. Nicola Lee, from the charity, told Sky News that when delving \"deeper\" into their data, they have discovered that some children who first viewed pornography aged five and under are also \"reporting addiction to pornography\". \"So it wasn't just a case of they saw it at that age,\" Nicola added, \"it actually has developed with them into their older years, and they're now telling us that they have an addiction.\" One young woman, Shaniah Williams, told Sky News she first saw pornography at just seven years old, after being \"exposed to harmful sexual behaviour\" when she was six, which prompted \"a curiosity\" to search online for answers. She described content being available to her on \"certain platforms\", and by the age of eight, she was watching extreme pornography. By 12 years old, she said she was addicted: \"I didn't understand why I was so low. Consuming more of this material kind of kept me sane… but the thoughts wouldn't stop every minute of every day. I just wanted it to stop.\" 'I didn't know humans looked like that' Despite having restrictions on devices, Shaniah said the material she saw as a child left her terrified and confused, and she subsequently suffered from depression and suicidal thoughts. \"I could look at the kids in the playground and tell you which one had been exposed to it, just due to their language,\" she explained. \"I used to wish I could be like the girls who hadn't. I was in the dark, in a prison of my own making.\" Shaniah is appealing to parents to start conversations with their children. \"It was scary. I didn't know human beings looked like that,\" she said. \"I'm a child, I've not seen that. I thought someone was killing the other person. I thought it was torture.\" \"It took my childhood,\" she added, \"it's gone. I'm not getting it back. But it doesn't mean other children can't have that. So I beg of you, parents - please. For their sake.\" Children find pornography 'unintentionally' According to Dignify's research, most children find pornography online \"unintentionally\", for example sent in a group chat, found through a link from another platform, or shared by a stranger. \"We do have children and young people who are seeing pornography,\" Nicola said. She added: \"A third of those who have seen pornography have seen it in primary school. It's scary, it's really scary as a parent to think, wow, my child might have seen pornography. \"But they may not have. So that curiosity, we don't want to spark it.\" Dignify are also encouraging parents to think about \"age and developmentally appropriate\" conversations around the issue - and have developed a \"roadmap\" guide to follow. In the early years, they advise talking about screen use and safety, and where screen use is happening to experience it as a \"shared moment\", such as playing games together. As well as parental controls and privacy settings on devices, Nicola also recommends being in the same room if a child is going to be by themselves on a screen to \"understand what they're looking at\". 'Exposed within months at secondary school' The problem, however, is also seemingly widespread in schools. Flossie, 17, told Sky News she was overwhelmed by the volume and extremity of content circulating among pupils in her secondary school. \"Within the first three months, I was exposed to literally everything on social media - hardcore pornography, violent videos,\" she said. One clip that went viral in her school showed a woman being beheaded. Another involved bestiality. She said she had no choice in seeing it. \"I got off the bus one day, and it was shoved in my face. I was 12. I had to go home from school because it was so disturbing.\" Flossie is now part of a legal challenge calling for smartphones to be banned in UK schools, arguing that children cannot be protected while devices remain in classrooms, playgrounds, or even on the school bus. \"It's the kids doing this to each other. And the only way it's going to stop is if they take the phones away. It takes one child in a whole school,\" she said. 'Year 7 pupils will see things they can never unsee' Will Orr‑Ewing, who is also involved in the challenge, said more than 250 headteachers support a potential judicial review of government guidance. \"If the secretary of state wanted to, it doesn't require any primary legislation. She can update the guidance, and it could be solved tomorrow,\" he said. He warned that every new school year brings another wave of children at risk: \"Every September is a new Year 7 and a large percentage of those children are going to see things they can never unsee.\" Mr Orr-Ewing explained that while most parents support restrictions, a \"vocal minority\" believe smartphones keep children safe - something he called \"a myth\". \"The evidence is that the vast majority of harms come through the smartphone. Parents think they're keeping their kids safe, but they are sadly making them more in danger by giving them a smartphone,\" he said. Read more from Sky News:UK snow warnings upgradedChildren to be vaccinated at home A Department for Education spokesperson said: \"We support headteachers to take the necessary steps to prevent disruption, backed by our clear guidance. Research from the Children's Commissioner shows 99.8% of primary schools and 90% of secondary schools already have policies in place restricting the use of mobile phones. \"Through the Online Safety Act, we have taken some of the boldest steps anywhere in the world to ensure children have age-appropriate experiences online, protecting them from harmful content. \"We are striking the right balance: protecting children while ensuring they can safely benefit from the digital world, without risking isolation or cutting off access to vital services, especially to the most vulnerable.\" If you have been affected by any of the issues raised in this story, help and support is available.  You can call Samaritans free on 116 123 anytime day or night. You can also email jo@samaritans.org or visit www.samaritans.org to find support online."
    },
    {
        "title": "Migrant crossing figures for 2025 'politically toxic' for PM",
        "description": "The government's woken up to quite the new year hangover with the publication of 2025's small boat data - which reveals the number of migrants crossing the Channel increased by more than 4,500 people compared to 2024.",
        "url": "https://news.sky.com/story/migrant-crossing-figures-for-2025-politically-toxic-for-pm-13489515",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-shabana-mahmood-keir-starmer_7059376.jpg?20260101210446",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2026-01-01 20:24:00",
        "Headline": "After 18 months in power, Sir Keir Starmer's entering another year without really making progress on an issue which is hugely important to many voters.",
        "Content": "\n          Political correspondent\n              @amandaakass\n The government's woken up to quite the new year hangover with the publication of 2025's small boat data - which reveals the number of migrants crossing the Channel increased by more than 4,500 people compared to 2024. For a prime minister who made \"smashing the gangs\" such a central pledge during the general election campaign, the numbers are politically toxic. Although, frankly, given the trajectory of the statistics in the first part of the year, the situation could have been even worse - with the figures tracking largely above the record number of migrant arrivals in 2022 until bad weather hit in the late autumn. But after 18 months in power, Sir Keir Starmer's entering another year without making any real progress on an issue which is hugely important to many voters. This seeming impotence - from successive governments - to stop the small boats and close asylum hotels has certainly fuelled the rapid rise in support for Reform UK. Not surprisingly, Nigel Farage has leapt on today's data to claim \"smash the gangs is a complete disaster. One in, one out is a farce and the numbers have been huge.\" In a recent hardening of mainstream policy positioning, both Reform UK and the Conservatives now argue that anyone who arrived in the country illegally should be barred from claiming asylum - and that the UK needs to leave the European Convention on Human Rights in order to deliver that, and increase the number of deportations. \"Small boat crossings are the inevitable product of a system that guarantees entry and obstructs removal,\" said shadow home secretary Chris Philp. \"As long as the ECHR sits at the centre of our asylum system, illegal immigration is effectively hardwired in.\" Tough talk, but will action follow? As we saw with the PM's New Year's message on the economy, his approach has been to argue he understands people's anger - but to insist that new policies only just coming to fruition will soon start to make a big difference. The Home Office said in a statement: \"The number of small boat crossings are shameful, and the British people deserve better. This government is taking action.\" It's certainly true that many of the catalogue of measures announced by ministers have only just come into force - or are yet to do so. The borders bill, finally passed in December, gives the police new counter-terror-style powers to try to tackle the gangs. Home Secretary Shabana Mahmood's Danish-inspired asylum reforms, announced in November, aim to make the asylum system less generous - and therefore less of an incentive to migrants. Read more: UK looking at Denmark model to cut illegal migrationAngola and Namibia agree to take back illegal migrants She wants to deter people from coming to the UK with plans to make refugee status temporary, not permanent, to restrict asylum seekers' benefits, and to require 20 years' residency before granting permanent settlement. The plans also seek to make deportations easier. Rather than leaving the ECHR, the government is working with other European countries to try to reform it from within. The one in one out deal with France began over the summer, and sees the UK sending back small boat migrants back across the Channel in exchange for people already in the French system. Thus far it's been small scale - with fewer than 200 people deported, and several attempting to get back to the UK even after being returned. And while ministers regularly celebrate the fruits of closer working with their European partners - a long-awaited French promise to allow the police to intervene to stop the boats in the water looks to be on ice once again, with unions reportedly resisting the order over health and safety concerns. Voters are ready to punish Starmer After so many false promises and failed schemes - the most notorious of which, the Rwanda plan, cost £700 million and deported just four volunteers - it's not surprising the British electorate are sceptical about government policies in this area. Sir Keir and Shabana Mahmood are hoping their multi-faceted, internationally collaborative approach will finally start to pay dividends in the new year. Frustrated voters expect resolutions - and they're prepared to punish politicians who don't deliver on their promises."
    },
    {
        "title": "Chickenpox vaccine being rolled out on NHS for first time",
        "description": "A chickenpox vaccine is being rolled out on the NHS for the first time.",
        "url": "https://news.sky.com/story/chickenpox-vaccine-being-rolled-out-on-nhs-for-first-time-13489556",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-chickenpox-vaccine_7124184.jpg?20260101234757",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-01 23:22:00",
        "Headline": "The NHS says the jab will keep more kids in school, and their parents won't have to take time off work to look after them.",
        "Content": "A chickenpox vaccine is being rolled out on the NHS for the first time. It will be offered to youngsters alongside the MMR jab, which protects against measles, mumps, and rubella. It's a combo that's long been available to children in other countries, including the US, Canada, and Australia, and the move has been welcomed by health experts. The UK rollout was recommended by the Joint Committee on Vaccination and Immunisation (JCVI) in 2023, and in England alone hundreds of thousands of kids will be eligible from today. Health Secretary Wes Streeting said it will \"make a real difference for children and families\". He said: \"While chickenpox can be irritable and difficult for children, it can also be extremely serious and occasionally even fatal. \"The great thing about this new vaccine is that it combines the vaccine for chickenpox with MMR, which means that families can access this jab for their children, aged between 12 and 18 months.\" Who is eligible for the vaccine? Children born on or after 1 January 2025 will be offered two doses of MMRV at 12 months and 18 months. Those born between 1 July 2024 and 31 December 2024 will be offered one dose at 18 months and another at three years, four months. Children born between 1 September 2022 and 30 June 2024 will be offered one dose at three years, four months. A single-dose catch-up scheme is also planned for children born between 1 January 2020 and 31 August 2022. NHS England said GPs will be contacting families as part of the routine childhood vaccination programme. Read more from Sky News:UK snow warnings upgradedSwiss bar fire 'like a horror movie' Dr Gayatri Amirthalingam, deputy director of immunisation at the UK Health Security Agency, said the jab \"has been shown to be highly effective\" in other countries, \"with a good safety profile\". Dr Claire Fuller, national medical director for NHS England, added: \"This is a hugely positive moment for children and their families, providing protection against chickenpox for the first time and adding to the arsenal of routine vaccinations we give to children to safeguard them against serious illnesses.\" The vaccine will \"keep more children safe and in school\", she added."
    },
    {
        "title": "Zohran Mamdani: New York's new mayor 'won't hesitate' to use his power",
        "description": "New York's new mayor Zohran Mamdani has vowed to run the city \"expansively and audaciously\" after his historic inauguration.",
        "url": "https://news.sky.com/story/democratic-socialist-zohran-mamdani-sworn-in-as-new-york-city-mayor-ahead-of-public-ceremony-13489259",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-zohran-mamdani-new-york_7124202.jpg?20260102021529",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-01 12:12:00",
        "Headline": "As if watching his beloved Arsenal end 2025 top of the Premier League wasn't enjoyable enough, Zohran Mamdani has kicked off his 2026 by being inaugurated as New York City's mayor.",
        "Content": "New York's new mayor Zohran Mamdani has vowed to run the city \"expansively and audaciously\" after his historic inauguration. The Democratic Socialist became the Big Apple's first Muslim mayor after a midnight oath-taking at the Old City Hall subway stop, which is only accessible a few times a year via guided tours. He is also the first person of South Asian descent and the first African-born person to become the city's mayor, having been born in Uganda. In a later grander inauguration ceremony at City Hall, he declared: \"Beginning today, we will govern expansively and audaciously. We may not always succeed, but never will we be accused of lacking the courage to try.\" He said his administration will not \"hesitate to use its power to improve New Yorkers' lives\", hinting at an era of \"big government\" for the city. \"I was elected as a democratic socialist and I will govern as a democratic socialist,\" he added. He was sworn in at the second event by Senator Bernie Sanders - a hero of Mr Mamdani's who has run to be the Democrats' nominee for president. \n                  State of emergency declared in New York as US storm disrupts thousands of flights \n                 \n                  Luigi Mangione shown videos of UnitedHealthcare CEO killing as defence seeks to bar evidence\n                 \n                  Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art\n                 Mr Mamdani, a 34-year-old former state assemblyman, swept into office late last year on a platform of tackling the spiralling cost of living, chiefly by implementing rent freezes and making buses free. He inspired ‌a record-breaking turnout of more than two million voters, taking 50% of the vote, nearly 10 points ahead of former Democratic New York governor Andrew Cuomo, who was running as an independent. As America's most populous city, New York has roughly eight million residents. Thousands of people turned out to watch the inauguration ceremony at City Hall, braving the cold to do so. Mr Mamdani moved quickly to revoke multiple executive orders issued by the previous administration. He undid all those issued since 26 September 2024 - the date federal authorities announced then mayor Eric Adams was being indicted on corruption charges, which were later dismissed following an intervention by Donald Trump. Read more:Mamdani meets Trump in the Oval OfficeFrom rapper to mayor: Who is Zohran Mamdani? Mr Mamdani will move from his one-bedroom Astoria to Gracie Mansion, the official residence of New York City mayors on the upscale Upper East Side. He is not the city's first mayor to be associated with democratic socialism, though David Dinkins did not make much of his association with the Democratic Socialists of ‍America (DSA) during his 1990-1993 term."
    },
    {
        "title": "Budget 2025: Workers being 'hammered' while pensioners benefit, says analysis",
        "description": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said.",
        "url": "https://news.sky.com/story/budget-2025-how-youre-being-quietly-hammered-with-stealth-taxes-13489549",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rachel-reeves-chancellor_7124167.jpg?20260101225017",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-01 22:29:00",
        "Headline": "Rachel Reeves had criticised freezing tax thresholds in the past, as had been done by previous governments, but went ahead and did it herself in November. It's claimed it will leave many workers worse off than they would otherwise be in a few years.",
        "Content": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said. While the chancellor did not increase income tax, national insurance contributions for employees or VAT, avoiding a manifesto breach, her November statement did see her extend a freeze on the first two until 2031. It means people face being dragged into paying higher rates as their wages rise over time. The Treasury has defended the policy as \"fair and necessary\". It's expected to raise £23bn in 2030-31 to help the government \"deliver on the country's priorities\" like cutting NHS waiting lists and debt. Sir Keir Starmer has promised people will \"feel positive change\" in their pockets this year. According to the Centre for Policy Studies (CPS), someone earning £50,000 today will be £505 worse off in real terms come 2031 despite their salary being forecast to increase by more than £6,000. On the flip side, pensioners and those on welfare are set to be better off. Thanks to the triple lock guaranteeing increases in line with inflation, earnings or 2.5%, whichever is higher, a pensioner could expect to be at least £306 better off in real terms in 2030-31. If people relying on the state pension are exempted from paying income tax even once the payment crosses the personal allowance threshold, they could be £537 better off. And increases to the standard rate of universal credit will mean someone on unemployment benefits will be £290 better off. Read more from Sky News:Michael Gove reveals a big regretBoat crossings 'politically toxic' for PM 'Raising taxes through the back door' The CPS - a centre-right think tank, which used Office for Budget Responsibility inflation and wage growth forecasts for its calculations - said the chancellor was \"raising taxes for millions of workers through the back door\". Daniel Herring, CPS head of economic and fiscal policy, said: \"Labour's tax policy is quietly hammering workers while protecting pensioners and benefit recipients. \"Freezing the personal allowance for income tax will hit everyone, but it's those who are dragged into higher tax bands who will really suffer, to the point where a worker on £50,000 today is set to actually be poorer in five years' time, despite getting pay rises.\" 'Hardworking people paying the price' Ms Reeves had criticised freezing tax thresholds in the past, as had been done by previous Tory governments. But at the budget, she said she was \"asking everyone to make a contribution\" to fund public services. A Treasury spokesman said: \"In the budget we increased the national living wage and national minimum wage and took £150 off people's energy bills, extended the freeze on prescription fees, fuel duty and froze rail fares for the first time in 30 years.\" Conservative shadow chancellor Sir Mel Stride accused Ms Reeves of lacking the \"backbone to control spending\". \"Hardworking people are paying the price,\" he added."
    },
    {
        "title": "Private hospitals giant Spire sets deadline for suitors",
        "description": "Britain's biggest private hospital operator has handed prospective suitors a deadline to pursue a takeover of the company amid shareholder pressure on it to explore a sale.",
        "url": "https://news.sky.com/story/private-hospitals-giant-spire-sets-deadline-for-suitors-13489311",
        "image_url": "https://e3.365dm.com/20/01/1920x1080/skynews-spire-parkway-hospital_4901374.jpg?20250917174615",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-01 17:40:00",
        "Headline": "The UK's biggest provider of hip and knee surgery has told would-be owners to express an interest in buying the company by 20 January, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest private hospital operator has handed prospective suitors a deadline to pursue a takeover of the company amid shareholder pressure on it to explore a sale. Sky News has learnt that advisers to Spire Healthcare have told parties including private equity firms to register their interest by 20 January. The date is not a deadline for formal offers, but nevertheless underscores the desire of Spire's board - led by the City grandee Sir Ian Cheshire - to explore options for maximising shareholder value during the early part of this year. Spire runs 38 hospitals and more than 50 clinics, medical centres and consulting rooms across the UK. It is the largest provider of hip and knee operations in the country. The company also runs a network of private GP practices, as well as providing occupational health services to hundreds of corporate clients. Run by Justin Ash, chief executive, the company confirmed a Sky News report in September that it was examining options including a sale. \n                  Budget 2025: Workers being 'hammered' while pensioners benefit, says analysis\n                 \n                  Revolution Bars owner plots swift sale as cash crisis deepens\n                 \n                  FTSE 100 has best year since 2009 - outperforming US and European rivals\n                 That followed discussions with major investors, including the activist trust Achilles, over the company's disappointing share price performance. Spire's stock has plunged by more than a quarter over the last year, leaving it with a market capitalisation of only £672m. The company's real estate assets alone have been valued at more than £1.4bn. Last month, Spire told the stock market that it was \"actively evaluating actions that could drive long-term sustainable shareholder value\". \"As part of this review, it has commenced discussions with a number of parties in relation to a range of potential options, which may include (but is not limited to) a potential sale of the company, value generation from the hospital property estate and increased strategic focus on private payors. \"The process remains ongoing and at this early stage there can be no certainty either that any offer will be made for the company nor as to the terms of any offer, if made.\" Spire is being advised by bankers at Rothschild. The healthcare group's shareholders rejected a £2.50-a-share offer from Australia's Ramsay Healthcare in 2021, saying it undervalued the business. Its stock closed on new year's eve at just 167p. Spire declined to comment on the deadline for third parties to express an interest in a deal."
    },
    {
        "title": "Several people killed in Iran as cost-of-living protests turn deadly",
        "description": "The largest protests in Iran in three years reached a deadly climax overnight into Thursday, with several people killed, Iranian media and a rights group have reported.",
        "url": "https://news.sky.com/story/several-people-killed-in-iran-as-cost-of-living-protests-turn-deadly-13489294",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran_7123711.jpg?20260101151757",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-01 14:02:00",
        "Headline": "Protests that began on Sunday among Tehran shopkeepers have spread to further groups and parts of the country, reaching a bloody climax overnight on Wednesday.",
        "Content": "The largest protests in Iran in three years reached a deadly climax overnight into Thursday, with several people killed, Iranian media and a rights group have reported. The bloody violence marks a significant escalation of the protests over Iran's ailing economy, after authorities on Tuesday unusually offered to set up a \"dialogue mechanism\". A \"source with knowledge\" cited by the semi-official Fars news agency said clashes in the western city of Lordegan between police and what it said were armed protesters had killed multiple people. According to the rights group Hengaw, security forces opened fire on the protesters in Lordegan, killing and wounding several in the crowd. Meanwhile, authorities confirmed one death in the western city of Kuhdasht, and Hengaw said another had been shot dead in the central province of Isfahan. The unrest over soaring inflation and a record slump in the currency began on Sunday among shopkeepers and traders in the capital Tehran. But they have since spread to different groups and parts of the country, with university students in Tehran joining in, and demonstrators attempting to break into a government building on Wednesday. \n                  Iranian protesters attempt to break in to government building\n                 \n                  Iranian university students join protests over soaring cost of living\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 Some protesters were detained yesterday in the western provinces of Kermanshah, Khuzestan and Hamedan, according to Hengaw. The Revolutionary Guards - a military force that reports directly to Supreme Leader Ali Khamenei - said a member of its Basij volunteer paramilitary unit had been killed in Kuhdasht, and 13 others wounded. This week's demonstrations are the first since the country was pounded by airstrikes in the summer, which prompted a momentary wave of patriotism and solidarity. But this week frustrations boiled over, as the economy suffers from Western sanctions, 40% inflation and the fallout from Israeli and US attacks on the country's nuclear infrastructure and military leadership. It is a dangerous and testing moment for Iran's authorities, with limited options at their disposal to alleviate the problems. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 They are often heavy-handed in their response to protests. But this week they appeared to offer an unusually conciliatory gesture to open a dialogue with protesters, alongside their security response, which could yet escalate. On Thursday government spokesperson Fatemeh Mohajerani ‍reiterated that officials would speak directly to representatives of trades unions and vendors, though details remain unclear. The activist news site HRANA reported a heavy presence of security forces across cities on Wednesday, with arrests, shootings and clashes in some areas. State media said students had been detained and then released during the demonstrations."
    },
    {
        "title": "UK weather: Snow warnings upgraded to amber for some areas as country sees wintry start to the year",
        "description": "Forecasters have upgraded snow weather warnings from yellow to amber in some parts of the UK.",
        "url": "https://news.sky.com/story/uk-weather-snow-warnings-upgraded-to-amber-for-some-areas-as-country-sees-wintry-start-to-the-year-13489261",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-snow-scotland_7123614.jpg?20260101130114",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-01 12:13:00",
        "Headline": "Amber warnings for heavy snow showers in parts of Scotland have been issued by the Met Office. They are in place from midday on Friday to midday on Saturday.",
        "Content": "Forecasters have upgraded snow weather warnings from yellow to amber in some parts of the UK. Yellow alerts are in place in other areas, as people face a wintry start to 2026. Amber warnings for heavy snow showers in parts of Scotland have been issued by the Met Office. They are in place from midday on Friday to midday on Saturday. Snow could bring disruption to parts of northern Scotland. The areas covered in the amber warnings include Angus, Perth and Kinross, Aberdeen, Aberdeenshire, Moray, and the Highlands. Around 10-20cm of snow is likely at low levels, with 30-40cm possible on high ground, while winds could lead to temporary blizzard conditions, according to the Met Office. It added that some delays and cancellations to rail and air travel are likely, as are power cuts and disruption on the roads, while some rural communities may be cut off. Meanwhile, there is a yellow warning for snow and ice on Friday across large parts of England and Wales, including Chester and Greater Manchester down to London and Kent. The warning lasts from midnight to noon. Snow up to 5cm could cover some areas, especially on higher ground in parts of North Wales and northwest England. Separate yellow warnings are in place for Northern Ireland between midnight and 10am on Friday. Weather warnings were already in force on New Year's Day in Scotland, with a yellow warning of snow and ice covering the northern part of the nation. The Met Office said 10cm of snow could have accumulated by Friday morning, while up to 20cm could build up above 200 metres. The warning is in force until midnight on Friday and at the weekend it extends further south, covering the area down to Perth and southerly parts of Argyll and Bute until midnight on Sunday. Read more:What we know about Swiss ski resort fireMaresca leaves position as Chelsea head coach Meanwhile, the UK Health Security Agency (UKHSA) has issued health warnings for the start of the year. It previously issued amber cold health alerts in the North East and North West of England. However, yellow alerts have been upgraded to amber across the East Midlands, West Midlands, South East, South West, East of England, Yorkshire and the Humber, and London. These warnings are in place until 10am on 6 January. The UKHSA said it means the weather is \"likely\" to cause significant impacts across health and social care services, including a \"rise in deaths\" among those with health conditions or aged 65 or over."
    },
    {
        "title": "Chickenpox vaccine being rolled out on NHS for first time",
        "description": "A chickenpox vaccine is being rolled out on the NHS for the first time.",
        "url": "https://news.sky.com/story/chickenpox-vaccine-being-rolled-out-on-nhs-for-first-time-13489556",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-chickenpox-vaccine_7124184.jpg?20260101234757",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-01 23:22:00",
        "Headline": "The NHS says the jab will keep more kids in school, and their parents won't have to take time off work to look after them.",
        "Content": "A chickenpox vaccine is being rolled out on the NHS for the first time. It will be offered to youngsters alongside the MMR jab, which protects against measles, mumps, and rubella. It's a combo that's long been available to children in other countries, including the US, Canada, and Australia, and the move has been welcomed by health experts. The UK rollout was recommended by the Joint Committee on Vaccination and Immunisation (JCVI) in 2023, and in England alone hundreds of thousands of kids will be eligible from today. Health Secretary Wes Streeting said it will \"make a real difference for children and families\". He said: \"While chickenpox can be irritable and difficult for children, it can also be extremely serious and occasionally even fatal. \"The great thing about this new vaccine is that it combines the vaccine for chickenpox with MMR, which means that families can access this jab for their children, aged between 12 and 18 months.\" Who is eligible for the vaccine? Children born on or after 1 January 2025 will be offered two doses of MMRV at 12 months and 18 months. Those born between 1 July 2024 and 31 December 2024 will be offered one dose at 18 months and another at three years, four months. Children born between 1 September 2022 and 30 June 2024 will be offered one dose at three years, four months. A single-dose catch-up scheme is also planned for children born between 1 January 2020 and 31 August 2022. NHS England said GPs will be contacting families as part of the routine childhood vaccination programme. Read more from Sky News:UK snow warnings upgradedSwiss bar fire 'like a horror movie' Dr Gayatri Amirthalingam, deputy director of immunisation at the UK Health Security Agency, said the jab \"has been shown to be highly effective\" in other countries, \"with a good safety profile\". Dr Claire Fuller, national medical director for NHS England, added: \"This is a hugely positive moment for children and their families, providing protection against chickenpox for the first time and adding to the arsenal of routine vaccinations we give to children to safeguard them against serious illnesses.\" The vaccine will \"keep more children safe and in school\", she added."
    },
    {
        "title": "Budget 2025: Workers being 'hammered' while pensioners benefit, says analysis",
        "description": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said.",
        "url": "https://news.sky.com/story/budget-2025-how-youre-being-quietly-hammered-with-stealth-taxes-13489549",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rachel-reeves-chancellor_7124167.jpg?20260101225017",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-01 22:29:00",
        "Headline": "Rachel Reeves had criticised freezing tax thresholds in the past, as had been done by previous governments, but went ahead and did it herself in November. It's claimed it will leave many workers worse off than they would otherwise be in a few years.",
        "Content": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said. While the chancellor did not increase income tax, national insurance contributions for employees or VAT, avoiding a manifesto breach, her November statement did see her extend a freeze on the first two until 2031. It means people face being dragged into paying higher rates as their wages rise over time. The Treasury has defended the policy as \"fair and necessary\". It's expected to raise £23bn in 2030-31 to help the government \"deliver on the country's priorities\" like cutting NHS waiting lists and debt. Sir Keir Starmer has promised people will \"feel positive change\" in their pockets this year. According to the Centre for Policy Studies (CPS), someone earning £50,000 today will be £505 worse off in real terms come 2031 despite their salary being forecast to increase by more than £6,000. On the flip side, pensioners and those on welfare are set to be better off. Thanks to the triple lock guaranteeing increases in line with inflation, earnings or 2.5%, whichever is higher, a pensioner could expect to be at least £306 better off in real terms in 2030-31. If people relying on the state pension are exempted from paying income tax even once the payment crosses the personal allowance threshold, they could be £537 better off. And increases to the standard rate of universal credit will mean someone on unemployment benefits will be £290 better off. Read more from Sky News:Michael Gove reveals a big regretBoat crossings 'politically toxic' for PM 'Raising taxes through the back door' The CPS - a centre-right think tank, which used Office for Budget Responsibility inflation and wage growth forecasts for its calculations - said the chancellor was \"raising taxes for millions of workers through the back door\". Daniel Herring, CPS head of economic and fiscal policy, said: \"Labour's tax policy is quietly hammering workers while protecting pensioners and benefit recipients. \"Freezing the personal allowance for income tax will hit everyone, but it's those who are dragged into higher tax bands who will really suffer, to the point where a worker on £50,000 today is set to actually be poorer in five years' time, despite getting pay rises.\" 'Hardworking people paying the price' Ms Reeves had criticised freezing tax thresholds in the past, as had been done by previous Tory governments. But at the budget, she said she was \"asking everyone to make a contribution\" to fund public services. A Treasury spokesman said: \"In the budget we increased the national living wage and national minimum wage and took £150 off people's energy bills, extended the freeze on prescription fees, fuel duty and froze rail fares for the first time in 30 years.\" Conservative shadow chancellor Sir Mel Stride accused Ms Reeves of lacking the \"backbone to control spending\". \"Hardworking people are paying the price,\" he added."
    },
    {
        "title": "How Britain's children are being exposed and becoming addicted to porn",
        "description": "Children aged five and under are being exposed to pornography online, leading to addiction, Sky News has learned.",
        "url": "https://news.sky.com/story/how-britains-children-are-being-exposed-and-becoming-addicted-to-porn-13489554",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pornography-flossie_7124192.png?20260102001716",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2026-01-01 23:05:00",
        "Headline": "Research carried out and shared by the charity Dignify shows that the age of children seeing sexual content on the internet is getting younger.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Children aged five and under are being exposed to pornography online, leading to addiction, Sky News has learned. Warning: This article contains details you might find distressing Research carried out and shared by the charity Dignify shows that the age of children seeing sexual content on the internet is getting younger. The organisation, which works to protect children and young people from the harmful effects of pornography, said children \"can't unsee what they've seen\". The average age of children seeing pornography is 12, according to Dignify. Nicola Lee, from the charity, told Sky News that when delving \"deeper\" into their data, they have discovered that some children who first viewed pornography aged five and under are also \"reporting addiction to pornography\". \"So it wasn't just a case of they saw it at that age,\" Nicola added, \"it actually has developed with them into their older years, and they're now telling us that they have an addiction.\" One young woman, Shaniah Williams, told Sky News she first saw pornography at just seven years old, after being \"exposed to harmful sexual behaviour\" when she was six, which prompted \"a curiosity\" to search online for answers. She described content being available to her on \"certain platforms\", and by the age of eight, she was watching extreme pornography. By 12 years old, she said she was addicted: \"I didn't understand why I was so low. Consuming more of this material kind of kept me sane… but the thoughts wouldn't stop every minute of every day. I just wanted it to stop.\" 'I didn't know humans looked like that' Despite having restrictions on devices, Shaniah said the material she saw as a child left her terrified and confused, and she subsequently suffered from depression and suicidal thoughts. \"I could look at the kids in the playground and tell you which one had been exposed to it, just due to their language,\" she explained. \"I used to wish I could be like the girls who hadn't. I was in the dark, in a prison of my own making.\" Shaniah is appealing to parents to start conversations with their children. \"It was scary. I didn't know human beings looked like that,\" she said. \"I'm a child, I've not seen that. I thought someone was killing the other person. I thought it was torture.\" \"It took my childhood,\" she added, \"it's gone. I'm not getting it back. But it doesn't mean other children can't have that. So I beg of you, parents - please. For their sake.\" Children find pornography 'unintentionally' According to Dignify's research, most children find pornography online \"unintentionally\", for example sent in a group chat, found through a link from another platform, or shared by a stranger. \"We do have children and young people who are seeing pornography,\" Nicola said. She added: \"A third of those who have seen pornography have seen it in primary school. It's scary, it's really scary as a parent to think, wow, my child might have seen pornography. \"But they may not have. So that curiosity, we don't want to spark it.\" Dignify are also encouraging parents to think about \"age and developmentally appropriate\" conversations around the issue - and have developed a \"roadmap\" guide to follow. In the early years, they advise talking about screen use and safety, and where screen use is happening to experience it as a \"shared moment\", such as playing games together. As well as parental controls and privacy settings on devices, Nicola also recommends being in the same room if a child is going to be by themselves on a screen to \"understand what they're looking at\". 'Exposed within months at secondary school' The problem, however, is also seemingly widespread in schools. Flossie, 17, told Sky News she was overwhelmed by the volume and extremity of content circulating among pupils in her secondary school. \"Within the first three months, I was exposed to literally everything on social media - hardcore pornography, violent videos,\" she said. One clip that went viral in her school showed a woman being beheaded. Another involved bestiality. She said she had no choice in seeing it. \"I got off the bus one day, and it was shoved in my face. I was 12. I had to go home from school because it was so disturbing.\" Flossie is now part of a legal challenge calling for smartphones to be banned in UK schools, arguing that children cannot be protected while devices remain in classrooms, playgrounds, or even on the school bus. \"It's the kids doing this to each other. And the only way it's going to stop is if they take the phones away. It takes one child in a whole school,\" she said. 'Year 7 pupils will see things they can never unsee' Will Orr‑Ewing, who is also involved in the challenge, said more than 250 headteachers support a potential judicial review of government guidance. \"If the secretary of state wanted to, it doesn't require any primary legislation. She can update the guidance, and it could be solved tomorrow,\" he said. He warned that every new school year brings another wave of children at risk: \"Every September is a new Year 7 and a large percentage of those children are going to see things they can never unsee.\" Mr Orr-Ewing explained that while most parents support restrictions, a \"vocal minority\" believe smartphones keep children safe - something he called \"a myth\". \"The evidence is that the vast majority of harms come through the smartphone. Parents think they're keeping their kids safe, but they are sadly making them more in danger by giving them a smartphone,\" he said. Read more from Sky News:UK snow warnings upgradedChildren to be vaccinated at home A Department for Education spokesperson said: \"We support headteachers to take the necessary steps to prevent disruption, backed by our clear guidance. Research from the Children's Commissioner shows 99.8% of primary schools and 90% of secondary schools already have policies in place restricting the use of mobile phones. \"Through the Online Safety Act, we have taken some of the boldest steps anywhere in the world to ensure children have age-appropriate experiences online, protecting them from harmful content. \"We are striking the right balance: protecting children while ensuring they can safely benefit from the digital world, without risking isolation or cutting off access to vital services, especially to the most vulnerable.\" If you have been affected by any of the issues raised in this story, help and support is available.  You can call Samaritans free on 116 123 anytime day or night. You can also email jo@samaritans.org or visit www.samaritans.org to find support online."
    },
    {
        "title": "Migrant crossing figures for 2025 'politically toxic' for PM",
        "description": "The government's woken up to quite the new year hangover with the publication of 2025's small boat data - which reveals the number of migrants crossing the Channel increased by more than 4,500 people compared to 2024.",
        "url": "https://news.sky.com/story/migrant-crossing-figures-for-2025-politically-toxic-for-pm-13489515",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-shabana-mahmood-keir-starmer_7059376.jpg?20260101210446",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2026-01-01 20:24:00",
        "Headline": "After 18 months in power, Sir Keir Starmer's entering another year without really making progress on an issue which is hugely important to many voters.",
        "Content": "\n          Political correspondent\n              @amandaakass\n The government's woken up to quite the new year hangover with the publication of 2025's small boat data - which reveals the number of migrants crossing the Channel increased by more than 4,500 people compared to 2024. For a prime minister who made \"smashing the gangs\" such a central pledge during the general election campaign, the numbers are politically toxic. Although, frankly, given the trajectory of the statistics in the first part of the year, the situation could have been even worse - with the figures tracking largely above the record number of migrant arrivals in 2022 until bad weather hit in the late autumn. But after 18 months in power, Sir Keir Starmer's entering another year without making any real progress on an issue which is hugely important to many voters. This seeming impotence - from successive governments - to stop the small boats and close asylum hotels has certainly fuelled the rapid rise in support for Reform UK. Not surprisingly, Nigel Farage has leapt on today's data to claim \"smash the gangs is a complete disaster. One in, one out is a farce and the numbers have been huge.\" In a recent hardening of mainstream policy positioning, both Reform UK and the Conservatives now argue that anyone who arrived in the country illegally should be barred from claiming asylum - and that the UK needs to leave the European Convention on Human Rights in order to deliver that, and increase the number of deportations. \"Small boat crossings are the inevitable product of a system that guarantees entry and obstructs removal,\" said shadow home secretary Chris Philp. \"As long as the ECHR sits at the centre of our asylum system, illegal immigration is effectively hardwired in.\" Tough talk, but will action follow? As we saw with the PM's New Year's message on the economy, his approach has been to argue he understands people's anger - but to insist that new policies only just coming to fruition will soon start to make a big difference. The Home Office said in a statement: \"The number of small boat crossings are shameful, and the British people deserve better. This government is taking action.\" It's certainly true that many of the catalogue of measures announced by ministers have only just come into force - or are yet to do so. The borders bill, finally passed in December, gives the police new counter-terror-style powers to try to tackle the gangs. Home Secretary Shabana Mahmood's Danish-inspired asylum reforms, announced in November, aim to make the asylum system less generous - and therefore less of an incentive to migrants. Read more: UK looking at Denmark model to cut illegal migrationAngola and Namibia agree to take back illegal migrants She wants to deter people from coming to the UK with plans to make refugee status temporary, not permanent, to restrict asylum seekers' benefits, and to require 20 years' residency before granting permanent settlement. The plans also seek to make deportations easier. Rather than leaving the ECHR, the government is working with other European countries to try to reform it from within. The one in one out deal with France began over the summer, and sees the UK sending back small boat migrants back across the Channel in exchange for people already in the French system. Thus far it's been small scale - with fewer than 200 people deported, and several attempting to get back to the UK even after being returned. And while ministers regularly celebrate the fruits of closer working with their European partners - a long-awaited French promise to allow the police to intervene to stop the boats in the water looks to be on ice once again, with unions reportedly resisting the order over health and safety concerns. Voters are ready to punish Starmer After so many false promises and failed schemes - the most notorious of which, the Rwanda plan, cost £700 million and deported just four volunteers - it's not surprising the British electorate are sceptical about government policies in this area. Sir Keir and Shabana Mahmood are hoping their multi-faceted, internationally collaborative approach will finally start to pay dividends in the new year. Frustrated voters expect resolutions - and they're prepared to punish politicians who don't deliver on their promises."
    },
    {
        "title": "Police officer pays tribute to his wife and two children who died in house fire",
        "description": "A police officer who lost his wife and two children in a house fire on Boxing Day has paid tribute to his family as \"three of the greatest humans to ever grace our presence\".",
        "url": "https://news.sky.com/story/police-officer-pays-tribute-to-his-wife-and-two-children-who-died-in-house-fire-13489232",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-shearman-fionnghuala_7122323.png?20251230172951",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-01 10:29:00",
        "Headline": "Tom Shearman vowed to continue his wife's legacy of craft, his son's compassion and his daughter's enjoyment of books and writing.",
        "Content": "A police officer who lost his wife and two children in a house fire on Boxing Day has paid tribute to his family as \"three of the greatest humans to ever grace our presence\". In a statement shared by Gloucestershire Constabulary, Tom Shearman said: \"I have stared at my keypad for what seems like an eternity waiting for the words to appear. \"I have no way to thank any of you for the unbelievable out of this world generosity that you have shown to me in the darkest of hours. \"My life, the lives of my loved ones, my friends and the whole community changed on Boxing Day. Most importantly, and tragically, three of the greatest humans to ever grace our presence were taken from not just me, but all of us. \"I cannot begin to describe the anguish and trauma of the events of Boxing Day 2025. My family had its very core, its very essence, ripped from it in the most violent way.\" The bodies of Fionnghuala Shearman, known as Nu, and their children, Eve and Ohner, were found in the property in Stroud. Their pet dog, Hutch, also died in the fire. Mr Shearman was taken to hospital for treatment, but has since been discharged. He attempted to rescue his family but was beaten back by the severity of the blaze. \n                  More than £250k raised for police officer who lost family in Stroud Boxing Day fire\n                 \n                  Bodies recovered in Boxing Day fire as online fundraising appeal is launched for father\n                 \n                  Ex-England footballer Stuart Pearce's son Harley dies in tractor crash\n                 Emergency services were called to the family's mid-terrace Cotswold stone cottage on Brimscombe Hill at about 3am on Boxing Day. Mr and Mrs Shearman, who ran a bespoke handbag manufacturer, had been awoken by the fire and tried to reach their children in the rear bedroom. Police believe the fire started on the ground floor and investigations are ongoing to establish the cause, but it is not being treated as suspicious, rather as a \"tragic accident\". The fire destroyed the roof, the ceilings and stairs, as well as causing other significant internal damage. Deputy chief fire officer Nathaniel Hooton said firefighters worked extremely hard to get in to the house as the fire raged. An online fundraising appeal launched for Mr Shearman has so far raised more than £300,000. Mr Shearman's statement continued: \"My family and friends have rallied around and provided me with more than the bare essentials. I have a roof (and many offers) over my head, clothes on my back, food - most importantly company and compassion. I will heal. \"I have already started the ball rolling on a plan that came to me just as I was falling past the precipice of the abyss. I will make sure my unbelievably talented, empathetic, compassionate and beautiful wife's legacy of craft, design and making lives on,\" he said. \"As will I ensure that my bright spark Eve's legacy of enjoyment from books and writing be carried on. Along with my incredible son's sheer compassion and desire to help people.\" \"Please all take every opportunity to hug your loved ones, tell them you love them. Because, as Paulo Coelho said, one day you will wake up and there won't be any more time to do the things you want. Do it now.\""
    },
    {
        "title": "Man charged on suspicion of twice trespassing on grounds of Kensington Palace",
        "description": "A man has been charged with twice gaining access to the grounds of Kensington Palace.",
        "url": "https://news.sky.com/story/man-charged-on-suspicion-of-twice-trespassing-on-grounds-of-kensington-palace-13489468",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kensington-palace-london_7123989.jpg?20260101190243",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-01 18:33:00",
        "Headline": "The west London palace is sometimes home to the Prince and Princess of Wales, William and Kate, and their children.",
        "Content": "A man has been charged with twice gaining access to the grounds of Kensington Palace. The Metropolitan Police said Derek Egan, 39, had been charged with allegedly trespassing on a protected site on 21 and 23 December. Egan, of Hillingdon in western Greater London, has also been charged with breaching bail conditions. \"Egan was arrested on suspicion of trespassing on a protected site in Palace Green, Kensington,\" a police spokesperson said. The west London palace, in Kensington Gardens on the edge of Hyde Park, is sometimes home to the Prince and Princess of Wales and their children. William and Kate's new family home is Forest Lodge in Windsor Great Park, where an exclusion zone recently came into force. It is a criminal offence to trespass on a protected site designated under the Serious Organised Crime and Police Act (Socpa) 2005. The Wales's also enjoy a 10-bedroom mansion, Anmer Hall, on the Sandringham estate in Norfolk."
    },
    {
        "title": "Maccabi Tel Aviv fans ban: West Midlands Police 'knew of antisemitism warning from Jewish groups'",
        "description": "West Midlands Police told a safety planning meeting that Jewish groups warned excluding Maccabi Tel Aviv fans from an Aston Villa match \"could be perceived as antisemitic\" - weeks before telling MPs the Jewish community backed the ban, according to documents obtained by Sky News.",
        "url": "https://news.sky.com/story/maccabi-tel-aviv-fans-ban-west-midlands-police-knew-of-antisemitism-warning-from-jewish-groups-13489330",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-maccabi-tel-aviv-fans_7030911.jpg?20251016175350",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2026-01-01 15:38:00",
        "Headline": "Emails and meetings related to the contentious ban decision were sent to us by Birmingham City Council after a freedom of information request, containing redactions on security grounds.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n West Midlands Police told a safety planning meeting that Jewish groups warned excluding Maccabi Tel Aviv fans from an Aston Villa match \"could be perceived as antisemitic\" - weeks before telling MPs the Jewish community backed the ban, according to documents obtained by Sky News. The revelation comes after the force had to apologise for misleading the Home Affairs Select Committee ahead of its leadership being recalled to be questioned again by MPs on Tuesday. Emails and meetings related to the contentious ban decision were sent to Sky News by Birmingham City Council after a Freedom of Information request, containing redactions on security grounds. But they include minutes of the council's Safety Advisory Group (SAG) on 16 October - the day the ban on Israeli fans was ratified over the danger posed by them. There is a section on \"community sentiment and impact\" attributed to West Midlands Police, which had five representatives on the online Teams meeting. The minutes say: \"Jewish community groups have expressed concern that banning away fans could be perceived as antisemitic, rather than a public safety decision. \"This perception could undermine trust and increase reputational risk for authorities and the club.\" \n                  Family of Katie Fox, who was fatally stabbed in neck in Birmingham, pay tribute to her\n                 \n                  CCTV image released after sleeping woman sexually assaulted on train\n                 \n                  Woman, 34, has died after being stabbed in the neck in Birmingham\n                 The minutes reveal concerns from the chair of the SAG, who has not been named, about the potential for \"reputational damage\" from the decision that was ultimately opposed by Prime Minister Sir Keir Starmer, who raised the prospect of antisemitism. There is no suggestion in the minutes that Jewish groups supported the ban, but Assistant Chief Constable Mike O'Hara said that was the case when questioned by the Home Affairs Select Committee on 1 December. It led to an apology for the \"confusion\" to the MPs by Chief Constable Craig Guildford, who wrote: \"There was never any intention to mislead whatsoever.\" Ahead of the 16 October SAG meeting, WMP wrote to Birmingham City Council. We have a reply from a redacted official from their Birmingham Operations Centre. It said: \"There is concern over a perception that our safety considerations may be wrongly considered as an anti-Jewish sentiment - I know this isn't the case, but if you could help me outline this issue and risk from your perspective that would be of great support and help dispel that feeling.\" WMP only revealed their main reason for the ban in an interview with Sky News hours before the match on 6 November, citing Maccabi fans' hooliganism and concerns about racist violence in 2024 when they played in Amsterdam against Ajax. The convictions in Amsterdam were for attacks on Maccabi fans by locals but Israelis were also involved in unrest including anti-Arab chants. In the SAG meetings, West Midlands Police talk about the \"potential for disorder\" involving Maccabi fans while adding: \"Maccabi Tel Aviv's presence could attract protest and disorder, even outside the football context.\" There are references to the community around Villa Park, which has a large Muslim population. The game came amid calls for it to be cancelled completely, with campaigners wanting Israeli teams banned from European football over the war in Gaza. The minutes cite two councillors, Waseem Zaffar and Mumtaz Hussain as believing the \"community want it stopped, my concern is the safety of all; from staff, players and those attending.\" Public statements from the police, council and club did not directly discuss the potential for people being targeted for being Jewish and/or Israeli - an issue in Amsterdam a year earlier. But the minutes summarise WMP saying privately in the SAG meeting: \"Hate crime remains a concern, particularly isolated incidents of antisemitic abuse.\" Councillor Zafar asked: \"Any intel to say pro-Israel demonstrations may take place?\" Police replied: \"Not that we are aware of.\" Maccabi faced the ban despite having no recent UEFA sanctions for fan misconduct. But since the Villa match, UEFA has punished Maccabi for anti-Palestinian racist chanting at their match in Germany against Stuttgart, where their fans were allowed to attend last month. As well as a €20,000 (£17,500) fine, they were handed a suspended ban on being allowed fans at an away match in Europe. Sky News has approached West Midlands Police but they declined to comment any further."
    },
    {
        "title": "'Like a horror movie': Around 40 dead and 115 injured in Swiss ski resort bar fire",
        "description": "About 40 people were killed and 115 injured in a blaze in at a New Year's Eve Party at an upmarket Swiss ski resort, with the disaster likened to scenes from a horror film.",
        "url": "https://news.sky.com/story/like-a-horror-movie-around-40-dead-and-115-injured-in-swiss-ski-resort-bar-fire-13489518",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-crans-montana-fire_7124160.jpg?20260101222648",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-01 20:40:00",
        "Headline": "Witnesses reported seeing people smashing windows to try to escape, and others emerging with their clothes or hair having been burned off. Most of those killed or wounded are thought to be young people.",
        "Content": "About 40 people were killed and 115 injured in a blaze in at a New Year's Eve Party at an upmarket Swiss ski resort, with the disaster likened to scenes from a horror film. This article contains details some readers may find distressing. Most of the victims of the fire in Crans-Montana are thought to be young people, but identification of the bodies is expected to take several days at least. The fire broke out at roughly 1.30am local time in the Constellation Bar as people celebrated the turn of the year. Read more:What we know about deadly Swiss firePeople 'walking on top of others' trying to escape Emergency services were on the scene minutes later, but it was already too late to save dozens of people, thought to have been trapped in the basement. Authorities warned that naming the victims or establishing a definitive death toll would take time due to the severity of the burns. Experts have been using dental and DNA records to try to identify the dead. Switzerland's President Guy Parmelin described the deadly incident as \"one of the worst tragedies our country has ever known\", and King Charles called it a \"horrific disaster\". The country will hold five days of mourning. The cause of the blaze remains unclear, but witnesses reported seeing sparklers or candles in bottles in the basement bar. But Beatrice Pilloud, Valais Canton attorney general, said it was too early to determine the cause of the fire. Experts have not yet been able to go inside the charred wreckage of the bar. 'Horror movie' scenes of people with hair burned off Witnesses described scenes of panic and confusion as youngsters scrambled to escape the blaze. Samuel Rapp, who had been at a restaurant nearby, said he saw \"a lot of people at the entry trying to escape. And it was full and people [were] walking on everybody trying to escape.\" He saw many \"screaming, trying to escape\" and others \"on the floor\". Mr Rapp told Sky News he saw \"a lot of people\" whose hair had been burned off, and others \"without clothes\". Video from inside the bar shows a fire breaking out and rapidly engulfing the ceiling, spreading panic through the partygoers, who rushed towards the stairs to escape. Later footage from outside showed lines of ambulances queuing and helicopters arriving to airlift victims to nearby hospitals. Leon Christe, who works in the resort, told Sky News he was one of the first to the scene and tried to help by administering first aid. He said: \"It was very chaotic and very sad. Everywhere, there were young people who needed help, some had their clothes burned off. \"It was very traumatising.\" Another witness speaking to BFMTV described people smashing windows to escape the blaze, some severely injured, and panicked parents rushing to the scene to find out what had happened to their children. The young man said he saw about 20 people scrambling to get out of the smoke and flames, and likened what he saw from across the street to scenes from a horror movie. Vigil for victims, with many details unknown On New Year's Day, people gathered to lay flowers and light candles at a memorial near the site. Little information has yet emerged about the victims, and hospitals and emergency services are reeling from the accident. Some are being treated in the local hospital, while others were taken further afield, including to the University Hospital of Lausanne, which treats severe burns, and to France. France said at least three nationals had been injured and eight were still missing. Italian officials said 13 citizens had been injured, and another six are still unaccounted for, although details are still unfolding."
    },
    {
        "title": "What we know about deadly New Year's fire at Swiss ski resort",
        "description": "A fierce blaze that broke out in a Swiss ski resort during New Year's Eve celebrations has killed about 40 people and injured 115, police said on Thursday afternoon.",
        "url": "https://news.sky.com/story/what-we-know-about-deadly-new-years-fire-at-swiss-ski-resort-13489204",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-switzerland_7123427.jpg?20260101133647",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-01 08:51:00",
        "Headline": "A fire in the early hours of New Year's Day has killed at least 40 people and injured 115, many of them seriously, according to local police. The blaze broke out at Le Constellation, a bar in the Swiss ski resort of Crans-Montana. Here's everything we know so far.",
        "Content": "A fierce blaze that broke out in a Swiss ski resort during New Year's Eve celebrations has killed about 40 people and injured 115, police said on Thursday afternoon. The disaster occurred during the early hours of Thursday at Le Constellation, a bar in the Alpine ski resort of Crans-Montana. Swiss President Guy Parmelin has described the fire as \"one of the worst tragedies our country has ever experienced.\" Here is what we know so far. Follow latest: 'Around 40 people' killed in Swiss ski resort fire How many people have died or been injured? Swiss police broke the news on Thursday afternoon that about 40 people had been killed in the blaze. But they have not yet confirmed the exact number, with services still reeling from the accident and the identification of badly-burned victims ongoing. In a news conference, police said about a further 115 had been wounded, the majority seriously. Many of the victims were young people. The evening \"should have been a moment of celebration and coming together, but it turned into a nightmare,\" said Mathias Renard, head of the regional government. The intensive care unit of the local hospital is full, Mr Renard said earlier. Patients were being transferred to other facilities around the country. In total 13 helicopters, 42 ambulances, 150 paramedics and 70 firefighters were mobilised to the blaze. Leon Christe, who works in Crans-Montana, told Sky News he was one of the first to the scene and tried to help as many people as possible by administering first aid. He said: \"It was very chaotic and very sad. Everywhere, there were young people who needed help, some had their clothes burned off. \"It was very traumatising.\" Where did the incident happen? The bar is in Crans-Montana, in the Valais region at the heart of the Swiss Alps, which is popular with tourists from Britain and across Europe. It is 40km (25m) north of the Matterhorn, one of the most famous Alpine peaks, and approximately two hours from the Swiss capital of Bern. Swiss President Guy Parmelin said the tragic incident \"took place in a place that is dedicated to life and joy... what an incredible and dreadful contrast.\" What happened? The incident occurred at roughly 1.30am local time (12.30am UK time) while guests were celebrating the start of 2026. Seconds after noticing the smoke, a witness contacted police, and the first officers had arrived by 1.32am, Valais Canton police commander Frederic Gisler said during the Thursday afternoon news conference. The cause is not officially known, but two theories have emerged, and officials have ruled out any sort of attack. There are no suspects and no one has been arrested, as of Thursday afternoon. Italy's ambassador to Switzerland, Gian Lorenzo Cornado, at the scene, told Italy's Sky TG24 that the blaze may have been started by someone letting off a firecracker inside the bar. However, two French women who claim to have escaped from the venue after the fire broke out told BFMTV that the blaze originated from one of the \"birthday candles\" placed on champagne bottles. \"One of them was brought too close to the ceiling, which caught fire. In a few dozen seconds, the whole ceiling was on fire. Everything was made of wood,\" one of the women said. During the news briefing, officials were asked whether bottles containing sparklers were used in the bar. Valais Canton attorney general Beatrice Pilloud replied that only a few hours had passed, and she was not in a position to confirm. What are the nationalities of the victims? Authorities have warned it may take \"several days\" to identify the dead. Victims are expected to be of various nationalities, Valais Canton police commander Frederic Gisler said. \"Because it is an international resort, we think that there are international victims,\" he added. On Thursday morning the Italian foreign ministry said many victims had not yet been identified due to the severe burns on their bodies. Among the injured were two French and a dozen Italian citizens. About another 16 Italians have been reported missing, with around a dozen more being treated in hospital, Italian foreign minister Antonio Tajani said earlier. The UK embassy in Switzerland said late morning it had \"not been approached for assistance\" but would \"continue to monitor the situation\"."
    },
    {
        "title": "Witness saw people 'walking on top of others' as they tried to escape fire in packed Switzerland bar",
        "description": "A man who witnessed a bar fire in Switzerland has told Sky News he saw patrons walking over people as they tried to escape the packed venue.",
        "url": "https://news.sky.com/story/witness-saw-people-walking-on-top-of-others-as-they-tried-to-escape-packed-bar-during-fire-13489268",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-switzerland-eyewitness_7123619.png?20260101130755",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-01 12:49:00",
        "Headline": "A witness describes seeing people screaming as they tried to escape a fire at a New Year's celebration in a Swiss ski resort, which police said killed approximately 40 people and injured a further 115.",
        "Content": "A man who witnessed a bar fire in Switzerland has told Sky News he saw patrons walking over people as they tried to escape the packed venue. This article contains details some readers may find distressing Samuel Rapp, who was at a restaurant near Le Constellation bar in the Swiss ski resort of Crans-Montana when the fire broke out, described the scene as \"horrible\". About 40 people were killed in the fire, police have confirmed, and 115 others injured - the majority seriously, suffering severe burns. Mr Rapp said he was told of an \"explosion\" at the venue during the early hours of New Year's Day and went to investigate. He told Sky News: \"There were a lot of people at the entry trying to escape. And it was full and people [were] walking on everybody trying to escape. \"A lot of people were screaming trying to escape and I saw a lot of people on the floor.\" Follow latest: Several dozen feared dead in fire Mr Rapp said he witnessed someone place a jacket over a victim's face and saw \"a lot of people\" whose hair had been burned off. He said: \"Some people were without clothes.\" Asked what kind of people were at Le Constellation, he said: \"Everyone in the world comes here.\" He said a lot of people come from England, from the Netherlands, and from around Switzerland. Mr Rapp added: \"The people were between 16 and 18. It's horrible.\" Sky News' Home Editor Jason Farrell is at the scene and said those he has spoken to have been left traumatised by the tragedy. \"It's just an absolute shock,\" he said, as people were gathering by the cordon closing off the area around the bar. \"There's still some waking up to this, this is a real shock to the people of Crans-Montana.\" Leon Christe, who works in Crans-Montana, told Sky News he was one of the first to the scene and tried to help as many people as possible by administering first aid. He said: \"It was very chaotic and very sad. \"Everywhere, there were young people who needed help, some had their clothes burned off. \"It was very traumatising.\" Axel Clavier, a 16-year-old from Paris who survived the blaze, described \"total chaos\" inside the bar. Speaking to The Associated Press, he said one of his friends had died and \"two or three were missing\". The teenager didn't witness the fire start, but did see waitresses arrive with champagne bottles with sparklers. Axel said he was suffocating and initially hid behind a table, then ran upstairs and tried to use a table to break a plexiglass window. It fell out of its casing, allowing him to escape. He lost his jacket, shoes, phone and bank card while fleeing, but said: \"I am still alive and it's just stuff.\" \"I'm still in shock,\" he added. Authorities are yet to confirm the exact number of fatalities, although the Italian foreign ministry said Swiss authorities had reported at least 40 deaths to it. The fire broke out at around 1.30am local time (12.30am UK time) on Thursday as people were celebrating the start of 2026. A man speaking to BFMTV described people smashing windows to escape the blaze, some gravely injured. Panicked parents also raced to the scene to see whether their children were trapped inside. The man described seeing about 20 people scrambling to get out of the smoke and flames and compared what he saw to a horror movie as he watched from across the street."
    },
    {
        "title": "Several people killed in Iran as cost-of-living protests turn deadly",
        "description": "The largest protests in Iran in three years reached a deadly climax overnight into Thursday, with several people killed, Iranian media and a rights group have reported.",
        "url": "https://news.sky.com/story/several-people-killed-in-iran-as-cost-of-living-protests-turn-deadly-13489294",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran_7123711.jpg?20260101151757",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-01 14:02:00",
        "Headline": "Protests that began on Sunday among Tehran shopkeepers have spread to further groups and parts of the country, reaching a bloody climax overnight on Wednesday.",
        "Content": "The largest protests in Iran in three years reached a deadly climax overnight into Thursday, with several people killed, Iranian media and a rights group have reported. The bloody violence marks a significant escalation of the protests over Iran's ailing economy, after authorities on Tuesday unusually offered to set up a \"dialogue mechanism\". A \"source with knowledge\" cited by the semi-official Fars news agency said clashes in the western city of Lordegan between police and what it said were armed protesters had killed multiple people. According to the rights group Hengaw, security forces opened fire on the protesters in Lordegan, killing and wounding several in the crowd. Meanwhile, authorities confirmed one death in the western city of Kuhdasht, and Hengaw said another had been shot dead in the central province of Isfahan. The unrest over soaring inflation and a record slump in the currency began on Sunday among shopkeepers and traders in the capital Tehran. But they have since spread to different groups and parts of the country, with university students in Tehran joining in, and demonstrators attempting to break into a government building on Wednesday. \n                  Iranian protesters attempt to break in to government building\n                 \n                  Iranian university students join protests over soaring cost of living\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 Some protesters were detained yesterday in the western provinces of Kermanshah, Khuzestan and Hamedan, according to Hengaw. The Revolutionary Guards - a military force that reports directly to Supreme Leader Ali Khamenei - said a member of its Basij volunteer paramilitary unit had been killed in Kuhdasht, and 13 others wounded. This week's demonstrations are the first since the country was pounded by airstrikes in the summer, which prompted a momentary wave of patriotism and solidarity. But this week frustrations boiled over, as the economy suffers from Western sanctions, 40% inflation and the fallout from Israeli and US attacks on the country's nuclear infrastructure and military leadership. It is a dangerous and testing moment for Iran's authorities, with limited options at their disposal to alleviate the problems. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 They are often heavy-handed in their response to protests. But this week they appeared to offer an unusually conciliatory gesture to open a dialogue with protesters, alongside their security response, which could yet escalate. On Thursday government spokesperson Fatemeh Mohajerani ‍reiterated that officials would speak directly to representatives of trades unions and vendors, though details remain unclear. The activist news site HRANA reported a heavy presence of security forces across cities on Wednesday, with arrests, shootings and clashes in some areas. State media said students had been detained and then released during the demonstrations."
    },
    {
        "title": "Zohran Mamdani: New York's new mayor 'won't hesitate' to use his power",
        "description": "New York's new mayor Zohran Mamdani has vowed to run the city \"expansively and audaciously\" after his historic inauguration.",
        "url": "https://news.sky.com/story/democratic-socialist-zohran-mamdani-sworn-in-as-new-york-city-mayor-ahead-of-public-ceremony-13489259",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-zohran-mamdani-new-york_7124202.jpg?20260102021529",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-01 12:12:00",
        "Headline": "As if watching his beloved Arsenal end 2025 top of the Premier League wasn't enjoyable enough, Zohran Mamdani has kicked off his 2026 by being inaugurated as New York City's mayor.",
        "Content": "New York's new mayor Zohran Mamdani has vowed to run the city \"expansively and audaciously\" after his historic inauguration. The Democratic Socialist became the Big Apple's first Muslim mayor after a midnight oath-taking at the Old City Hall subway stop, which is only accessible a few times a year via guided tours. He is also the first person of South Asian descent and the first African-born person to become the city's mayor, having been born in Uganda. In a later grander inauguration ceremony at City Hall, he declared: \"Beginning today, we will govern expansively and audaciously. We may not always succeed, but never will we be accused of lacking the courage to try.\" He said his administration will not \"hesitate to use its power to improve New Yorkers' lives\", hinting at an era of \"big government\" for the city. \"I was elected as a democratic socialist and I will govern as a democratic socialist,\" he added. He was sworn in at the second event by Senator Bernie Sanders - a hero of Mr Mamdani's who has run to be the Democrats' nominee for president. \n                  State of emergency declared in New York as US storm disrupts thousands of flights \n                 \n                  Luigi Mangione shown videos of UnitedHealthcare CEO killing as defence seeks to bar evidence\n                 \n                  Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art\n                 Mr Mamdani, a 34-year-old former state assemblyman, swept into office late last year on a platform of tackling the spiralling cost of living, chiefly by implementing rent freezes and making buses free. He inspired ‌a record-breaking turnout of more than two million voters, taking 50% of the vote, nearly 10 points ahead of former Democratic New York governor Andrew Cuomo, who was running as an independent. As America's most populous city, New York has roughly eight million residents. Thousands of people turned out to watch the inauguration ceremony at City Hall, braving the cold to do so. Mr Mamdani moved quickly to revoke multiple executive orders issued by the previous administration. He undid all those issued since 26 September 2024 - the date federal authorities announced then mayor Eric Adams was being indicted on corruption charges, which were later dismissed following an intervention by Donald Trump. Read more:Mamdani meets Trump in the Oval OfficeFrom rapper to mayor: Who is Zohran Mamdani? Mr Mamdani will move from his one-bedroom Astoria to Gracie Mansion, the official residence of New York City mayors on the upscale Upper East Side. He is not the city's first mayor to be associated with democratic socialism, though David Dinkins did not make much of his association with the Democratic Socialists of ‍America (DSA) during his 1990-1993 term."
    },
    {
        "title": "New Year's Eve across the world - in pictures",
        "description": "All the world's countries have now welcomed in 2026.",
        "url": "https://news.sky.com/story/new-years-eve-across-the-world-in-pictures-13489183",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-new-york-new-years-eve_7123345.jpg?20260101055748",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-01 07:33:00",
        "Headline": "People around the world celebrated with fireworks, bell ringing and fancy dress. ",
        "Content": "All the world's countries have now welcomed in 2026. Here's what it looked like across the globe. Oceania  First to ring in the New Year were Pacific islands, including Samoa and Kiribati, followed by New Zealand, Australia and parts of Asia. Victims of the Bondi Beach terror attack were remembered with a minute's silence during the New Year's event in Sydney. Asia Despite many Asian nations celebrating the Lunar New Year, which takes place in February, the Gregorian New Year of 2026 was warmly heralded across the world's largest continent. Japan Beijing South Korea Bangkok India Qatar United Arab Emirates (UAE) Philippines Africa Across Africa, fireworks lit up the night sky and illuminated monuments, buildings and ancient sites. Egypt Senegal Nigeria Kenya Rwanda Ivory Coast Europe National landmarks were lit up on the continent as some sites were cordoned off. Berlin Munich Stuttgart Barcelona Paris Athens Switzerland Lithuania London Edinburgh North America The Big Apple was showered in confetti and Donald Trump Jr got birthday well-wishes. New York Florida Las Vegas South America Shopping and cheering made their way to South America. Brazil Venezuela Peru Mexico"
    },
    {
        "title": "Zohran Mamdani: New York's new mayor 'won't hesitate' to use his power",
        "description": "New York's new mayor Zohran Mamdani has vowed to run the city \"expansively and audaciously\" after his historic inauguration.",
        "url": "https://news.sky.com/story/democratic-socialist-zohran-mamdani-sworn-in-as-new-york-city-mayor-ahead-of-public-ceremony-13489259",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-zohran-mamdani-new-york_7124202.jpg?20260102021529",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-01 12:12:00",
        "Headline": "As if watching his beloved Arsenal end 2025 top of the Premier League wasn't enjoyable enough, Zohran Mamdani has kicked off his 2026 by being inaugurated as New York City's mayor.",
        "Content": "New York's new mayor Zohran Mamdani has vowed to run the city \"expansively and audaciously\" after his historic inauguration. The Democratic Socialist became the Big Apple's first Muslim mayor after a midnight oath-taking at the Old City Hall subway stop, which is only accessible a few times a year via guided tours. He is also the first person of South Asian descent and the first African-born person to become the city's mayor, having been born in Uganda. In a later grander inauguration ceremony at City Hall, he declared: \"Beginning today, we will govern expansively and audaciously. We may not always succeed, but never will we be accused of lacking the courage to try.\" He said his administration will not \"hesitate to use its power to improve New Yorkers' lives\", hinting at an era of \"big government\" for the city. \"I was elected as a democratic socialist and I will govern as a democratic socialist,\" he added. He was sworn in at the second event by Senator Bernie Sanders - a hero of Mr Mamdani's who has run to be the Democrats' nominee for president. \n                  State of emergency declared in New York as US storm disrupts thousands of flights \n                 \n                  Luigi Mangione shown videos of UnitedHealthcare CEO killing as defence seeks to bar evidence\n                 \n                  Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art\n                 Mr Mamdani, a 34-year-old former state assemblyman, swept into office late last year on a platform of tackling the spiralling cost of living, chiefly by implementing rent freezes and making buses free. He inspired ‌a record-breaking turnout of more than two million voters, taking 50% of the vote, nearly 10 points ahead of former Democratic New York governor Andrew Cuomo, who was running as an independent. As America's most populous city, New York has roughly eight million residents. Thousands of people turned out to watch the inauguration ceremony at City Hall, braving the cold to do so. Mr Mamdani moved quickly to revoke multiple executive orders issued by the previous administration. He undid all those issued since 26 September 2024 - the date federal authorities announced then mayor Eric Adams was being indicted on corruption charges, which were later dismissed following an intervention by Donald Trump. Read more:Mamdani meets Trump in the Oval OfficeFrom rapper to mayor: Who is Zohran Mamdani? Mr Mamdani will move from his one-bedroom Astoria to Gracie Mansion, the official residence of New York City mayors on the upscale Upper East Side. He is not the city's first mayor to be associated with democratic socialism, though David Dinkins did not make much of his association with the Democratic Socialists of ‍America (DSA) during his 1990-1993 term."
    },
    {
        "title": "Budget 2025: Workers being 'hammered' while pensioners benefit, says analysis",
        "description": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said.",
        "url": "https://news.sky.com/story/budget-2025-how-youre-being-quietly-hammered-with-stealth-taxes-13489549",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rachel-reeves-chancellor_7124167.jpg?20260101225017",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-01 22:29:00",
        "Headline": "Rachel Reeves had criticised freezing tax thresholds in the past, as had been done by previous governments, but went ahead and did it herself in November. It's claimed it will leave many workers worse off than they would otherwise be in a few years.",
        "Content": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said. While the chancellor did not increase income tax, national insurance contributions for employees or VAT, avoiding a manifesto breach, her November statement did see her extend a freeze on the first two until 2031. It means people face being dragged into paying higher rates as their wages rise over time. The Treasury has defended the policy as \"fair and necessary\". It's expected to raise £23bn in 2030-31 to help the government \"deliver on the country's priorities\" like cutting NHS waiting lists and debt. Sir Keir Starmer has promised people will \"feel positive change\" in their pockets this year. According to the Centre for Policy Studies (CPS), someone earning £50,000 today will be £505 worse off in real terms come 2031 despite their salary being forecast to increase by more than £6,000. On the flip side, pensioners and those on welfare are set to be better off. Thanks to the triple lock guaranteeing increases in line with inflation, earnings or 2.5%, whichever is higher, a pensioner could expect to be at least £306 better off in real terms in 2030-31. If people relying on the state pension are exempted from paying income tax even once the payment crosses the personal allowance threshold, they could be £537 better off. And increases to the standard rate of universal credit will mean someone on unemployment benefits will be £290 better off. Read more from Sky News:Michael Gove reveals a big regretBoat crossings 'politically toxic' for PM 'Raising taxes through the back door' The CPS - a centre-right think tank, which used Office for Budget Responsibility inflation and wage growth forecasts for its calculations - said the chancellor was \"raising taxes for millions of workers through the back door\". Daniel Herring, CPS head of economic and fiscal policy, said: \"Labour's tax policy is quietly hammering workers while protecting pensioners and benefit recipients. \"Freezing the personal allowance for income tax will hit everyone, but it's those who are dragged into higher tax bands who will really suffer, to the point where a worker on £50,000 today is set to actually be poorer in five years' time, despite getting pay rises.\" 'Hardworking people paying the price' Ms Reeves had criticised freezing tax thresholds in the past, as had been done by previous Tory governments. But at the budget, she said she was \"asking everyone to make a contribution\" to fund public services. A Treasury spokesman said: \"In the budget we increased the national living wage and national minimum wage and took £150 off people's energy bills, extended the freeze on prescription fees, fuel duty and froze rail fares for the first time in 30 years.\" Conservative shadow chancellor Sir Mel Stride accused Ms Reeves of lacking the \"backbone to control spending\". \"Hardworking people are paying the price,\" he added."
    },
    {
        "title": "Private hospitals giant Spire sets deadline for suitors",
        "description": "Britain's biggest private hospital operator has handed prospective suitors a deadline to pursue a takeover of the company amid shareholder pressure on it to explore a sale.",
        "url": "https://news.sky.com/story/private-hospitals-giant-spire-sets-deadline-for-suitors-13489311",
        "image_url": "https://e3.365dm.com/20/01/1920x1080/skynews-spire-parkway-hospital_4901374.jpg?20250917174615",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-01 17:40:00",
        "Headline": "The UK's biggest provider of hip and knee surgery has told would-be owners to express an interest in buying the company by 20 January, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest private hospital operator has handed prospective suitors a deadline to pursue a takeover of the company amid shareholder pressure on it to explore a sale. Sky News has learnt that advisers to Spire Healthcare have told parties including private equity firms to register their interest by 20 January. The date is not a deadline for formal offers, but nevertheless underscores the desire of Spire's board - led by the City grandee Sir Ian Cheshire - to explore options for maximising shareholder value during the early part of this year. Spire runs 38 hospitals and more than 50 clinics, medical centres and consulting rooms across the UK. It is the largest provider of hip and knee operations in the country. The company also runs a network of private GP practices, as well as providing occupational health services to hundreds of corporate clients. Run by Justin Ash, chief executive, the company confirmed a Sky News report in September that it was examining options including a sale. \n                  Budget 2025: Workers being 'hammered' while pensioners benefit, says analysis\n                 \n                  Revolution Bars owner plots swift sale as cash crisis deepens\n                 \n                  FTSE 100 has best year since 2009 - outperforming US and European rivals\n                 That followed discussions with major investors, including the activist trust Achilles, over the company's disappointing share price performance. Spire's stock has plunged by more than a quarter over the last year, leaving it with a market capitalisation of only £672m. The company's real estate assets alone have been valued at more than £1.4bn. Last month, Spire told the stock market that it was \"actively evaluating actions that could drive long-term sustainable shareholder value\". \"As part of this review, it has commenced discussions with a number of parties in relation to a range of potential options, which may include (but is not limited to) a potential sale of the company, value generation from the hospital property estate and increased strategic focus on private payors. \"The process remains ongoing and at this early stage there can be no certainty either that any offer will be made for the company nor as to the terms of any offer, if made.\" Spire is being advised by bankers at Rothschild. The healthcare group's shareholders rejected a £2.50-a-share offer from Australia's Ramsay Healthcare in 2021, saying it undervalued the business. Its stock closed on new year's eve at just 167p. Spire declined to comment on the deadline for third parties to express an interest in a deal."
    },
    {
        "title": "Migrant small boat Channel crossings in 2025 are second highest ever",
        "description": "A total of 41,472 migrants arrived in the UK in 2025 after crossing the Channel on a small boat - the second-highest annual figure on record.",
        "url": "https://news.sky.com/story/migrant-small-boat-channel-crossings-in-2025-are-second-highest-ever-13489257",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-small-boats-channel_7082809.jpg?20251115172058",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-01 11:55:00",
        "Headline": "Despite entering office with a vow to \"smash the gangs\" and curb small boat crossings, nearly 65,000 people have arrived since Labour was elected in July 2024.",
        "Content": "A total of 41,472 migrants arrived in the UK in 2025 after crossing the Channel on a small boat - the second-highest annual figure on record. No migrants made the journey on New Year's Eve, the Home Office confirmed on Thursday, with the last recorded crossing made on 22 December. It means the overall number of arrivals last year ended up 9% below the all-time high of 45,774 in 2022. The total for 2025 was 13% higher than in 2024, when 36,816 migrants made the journey, and 41% higher than 2023's total of 29,437. The first half of 2025 saw 19,982 people arrive, a record number in that period. However, that pace slowed during the last two months of the year and there were long periods when no migrants arrived, including a 28-day run from 15 November to 12 December. There was an average of 62 people per small boat that arrived in 2025, which is up from 53 in 2024 and 49 in 2023. \n                  Hundreds of foreign prison staff 'offered emergency extension to visa' to stop the prison system collapsing\n                 \n                  Labour MPs urge Home Office to ensure settled status changes do not pull support for Hong Kongers\n                 \n                  171 arrests in gig economy crackdown - with 60 delivery drivers to be deported\n                 Charities estimate that at least 36 people died trying to make the journey last year, including an eight-year-old girl and her mother, who were crushed on a boat in May, the Mirror reports. The number of arrivals in 2025 has heaped pressure on Sir Keir Starmer's government, having entered office in July 2024 with a repeated vow to \"smash the gangs\" and reduce the number of crossings. Almost 65,000 migrants have arrived since then. The UK's Border Security Commander, Martin Hewitt, tasked with curbing Channel crossings, told MPs in October that the number of arrivals in 2025 was \"frustrating\" but that work to stop the smuggling route was \"always going to take time\". The government has also introduced and announced changes to legislation in a bid to stop Channel crossings, including: But the government faces a fight once again with its own MPs to get those measures through, with some Labour parliamentarians branding the measures \"shameful\" and echoing the rhetoric of Nigel Farage's Reform UK. Tap here to read more about the government's planned asylum reforms. Meanwhile, Tory leader Kemi Badenoch said the measures did not go far enough, adding that leaving the European Convention on Human Rights (ECHR) was necessary to address the problem. Both the Conservatives and Reform UK have pressed for quitting the human rights treaty as a way to tackle illegal immigration, but the Labour government has insisted it will not leave the ECHR and instead seeks to adjust how immigration cases are interpreted in UK law. Deputy Prime Minister David Lammy met ministers from ECHR member states last month, who agreed to consider reforming the treaty to address illegal migration. International cooperation has also formed part of the government's strategy, such as through the \"one in, one out\" returns deal with France that came into force in August. On 16 December, border security minister Alex Norris told peers that 193 migrants had been sent back to France and 195 had arrived in the UK under the returns deal so far. But the scheme has drawn criticism as being \"no deterrent at all\" by shadow home secretary Chris Philp, amid cases of two migrants returning to the UK after being removed to France under the deal, who were then deported again. Reacting to the total number of Channel crossings for 2025, Reform UK leader Nigel Farage wrote on X: \"Smash the gangs is a complete disaster. One in, one out is a farce and the numbers have been huge. Many of the young men that arrived last year will do us great harm.\" Enver Solomon, chief executive of the Refugee Council, said: \"Most men, women and children taking these journeys have fled oppressive regimes like the Taliban in Afghanistan and brutal civil wars in countries like Sudan. \"No-one risks their life on a flimsy boat in the Channel except out of desperation to be safe in a country where they have family or community connections. \"It's right the government wants to stop Channel crossings but plans that will punish people found to be refugees are unfair and not an effective deterrent.\" He added that there needs to be a \"multi-pronged approach\", including targeting gangs and international cooperation to ensure refugees can access safe and legal routes - something Ms Mahmood has included in plans to overhaul the asylum system. A Home Office spokesperson said: \"The number of small boat crossings are shameful and the British people deserve better. \"This government is taking action. We have removed almost 50,000 people who were here illegally, and our historic deal with the French means those who arrive on small boats are now being sent back. \"The Home Secretary has announced the most sweeping reforms to tackle illegal migration in decades, removing the incentives that bring illegal migrants to the UK and scaling up the return of those with no right to be here.\""
    },
    {
        "title": "Migrant crossing figures for 2025 'politically toxic' for PM",
        "description": "The government's woken up to quite the new year hangover with the publication of 2025's small boat data - which reveals the number of migrants crossing the Channel increased by more than 4,500 people compared to 2024.",
        "url": "https://news.sky.com/story/migrant-crossing-figures-for-2025-politically-toxic-for-pm-13489515",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-shabana-mahmood-keir-starmer_7059376.jpg?20260101210446",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2026-01-01 20:24:00",
        "Headline": "After 18 months in power, Sir Keir Starmer's entering another year without really making progress on an issue which is hugely important to many voters.",
        "Content": "\n          Political correspondent\n              @amandaakass\n The government's woken up to quite the new year hangover with the publication of 2025's small boat data - which reveals the number of migrants crossing the Channel increased by more than 4,500 people compared to 2024. For a prime minister who made \"smashing the gangs\" such a central pledge during the general election campaign, the numbers are politically toxic. Although, frankly, given the trajectory of the statistics in the first part of the year, the situation could have been even worse - with the figures tracking largely above the record number of migrant arrivals in 2022 until bad weather hit in the late autumn. But after 18 months in power, Sir Keir Starmer's entering another year without making any real progress on an issue which is hugely important to many voters. This seeming impotence - from successive governments - to stop the small boats and close asylum hotels has certainly fuelled the rapid rise in support for Reform UK. Not surprisingly, Nigel Farage has leapt on today's data to claim \"smash the gangs is a complete disaster. One in, one out is a farce and the numbers have been huge.\" In a recent hardening of mainstream policy positioning, both Reform UK and the Conservatives now argue that anyone who arrived in the country illegally should be barred from claiming asylum - and that the UK needs to leave the European Convention on Human Rights in order to deliver that, and increase the number of deportations. \"Small boat crossings are the inevitable product of a system that guarantees entry and obstructs removal,\" said shadow home secretary Chris Philp. \"As long as the ECHR sits at the centre of our asylum system, illegal immigration is effectively hardwired in.\" Tough talk, but will action follow? As we saw with the PM's New Year's message on the economy, his approach has been to argue he understands people's anger - but to insist that new policies only just coming to fruition will soon start to make a big difference. The Home Office said in a statement: \"The number of small boat crossings are shameful, and the British people deserve better. This government is taking action.\" It's certainly true that many of the catalogue of measures announced by ministers have only just come into force - or are yet to do so. The borders bill, finally passed in December, gives the police new counter-terror-style powers to try to tackle the gangs. Home Secretary Shabana Mahmood's Danish-inspired asylum reforms, announced in November, aim to make the asylum system less generous - and therefore less of an incentive to migrants. Read more: UK looking at Denmark model to cut illegal migrationAngola and Namibia agree to take back illegal migrants She wants to deter people from coming to the UK with plans to make refugee status temporary, not permanent, to restrict asylum seekers' benefits, and to require 20 years' residency before granting permanent settlement. The plans also seek to make deportations easier. Rather than leaving the ECHR, the government is working with other European countries to try to reform it from within. The one in one out deal with France began over the summer, and sees the UK sending back small boat migrants back across the Channel in exchange for people already in the French system. Thus far it's been small scale - with fewer than 200 people deported, and several attempting to get back to the UK even after being returned. And while ministers regularly celebrate the fruits of closer working with their European partners - a long-awaited French promise to allow the police to intervene to stop the boats in the water looks to be on ice once again, with unions reportedly resisting the order over health and safety concerns. Voters are ready to punish Starmer After so many false promises and failed schemes - the most notorious of which, the Rwanda plan, cost £700 million and deported just four volunteers - it's not surprising the British electorate are sceptical about government policies in this area. Sir Keir and Shabana Mahmood are hoping their multi-faceted, internationally collaborative approach will finally start to pay dividends in the new year. Frustrated voters expect resolutions - and they're prepared to punish politicians who don't deliver on their promises."
    },
    {
        "title": "Budget 2025: Workers being 'hammered' while pensioners benefit, says analysis",
        "description": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said.",
        "url": "https://news.sky.com/story/budget-2025-how-youre-being-quietly-hammered-with-stealth-taxes-13489549",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rachel-reeves-chancellor_7124167.jpg?20260101225017",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-01 22:29:00",
        "Headline": "Rachel Reeves had criticised freezing tax thresholds in the past, as had been done by previous governments, but went ahead and did it herself in November. It's claimed it will leave many workers worse off than they would otherwise be in a few years.",
        "Content": "Rachel Reeves is \"quietly hammering\" workers with stealth taxes as a result of her budget last year, a think tank has said. While the chancellor did not increase income tax, national insurance contributions for employees or VAT, avoiding a manifesto breach, her November statement did see her extend a freeze on the first two until 2031. It means people face being dragged into paying higher rates as their wages rise over time. The Treasury has defended the policy as \"fair and necessary\". It's expected to raise £23bn in 2030-31 to help the government \"deliver on the country's priorities\" like cutting NHS waiting lists and debt. Sir Keir Starmer has promised people will \"feel positive change\" in their pockets this year. According to the Centre for Policy Studies (CPS), someone earning £50,000 today will be £505 worse off in real terms come 2031 despite their salary being forecast to increase by more than £6,000. On the flip side, pensioners and those on welfare are set to be better off. Thanks to the triple lock guaranteeing increases in line with inflation, earnings or 2.5%, whichever is higher, a pensioner could expect to be at least £306 better off in real terms in 2030-31. If people relying on the state pension are exempted from paying income tax even once the payment crosses the personal allowance threshold, they could be £537 better off. And increases to the standard rate of universal credit will mean someone on unemployment benefits will be £290 better off. Read more from Sky News:Michael Gove reveals a big regretBoat crossings 'politically toxic' for PM 'Raising taxes through the back door' The CPS - a centre-right think tank, which used Office for Budget Responsibility inflation and wage growth forecasts for its calculations - said the chancellor was \"raising taxes for millions of workers through the back door\". Daniel Herring, CPS head of economic and fiscal policy, said: \"Labour's tax policy is quietly hammering workers while protecting pensioners and benefit recipients. \"Freezing the personal allowance for income tax will hit everyone, but it's those who are dragged into higher tax bands who will really suffer, to the point where a worker on £50,000 today is set to actually be poorer in five years' time, despite getting pay rises.\" 'Hardworking people paying the price' Ms Reeves had criticised freezing tax thresholds in the past, as had been done by previous Tory governments. But at the budget, she said she was \"asking everyone to make a contribution\" to fund public services. A Treasury spokesman said: \"In the budget we increased the national living wage and national minimum wage and took £150 off people's energy bills, extended the freeze on prescription fees, fuel duty and froze rail fares for the first time in 30 years.\" Conservative shadow chancellor Sir Mel Stride accused Ms Reeves of lacking the \"backbone to control spending\". \"Hardworking people are paying the price,\" he added."
    },
    {
        "title": "Nigel Farage vows to go 'double or quits' with £5m local elections spending blitz",
        "description": "Nigel Farage has vowed to go \"double or quits\" on May's local elections with a spending blitz of &#163;5m.",
        "url": "https://news.sky.com/story/nigel-farage-vows-to-go-double-or-quits-with-1635m-local-elections-spending-blitz-13489434",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigel-farage-reform_7123855.jpg?20260101174910",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-01 17:44:00",
        "Headline": "The Reform UK leader has described the May local elections as \"the single most important event between now and the general election\"",
        "Content": "Nigel Farage has vowed to go \"double or quits\" on May's local elections with a spending blitz of £5m. The Reform UK leader has described the upcoming vote as \"the single most important event between now and the general election\", expected in 2029, and acknowledged that \"people would ask questions\" about his leadership if the party's poll lead did not translate into election wins. He also addressed claims from his contemporaries at school that he used antisemitic language, which he has previously denied, saying the reporting might be \"solidifying\" the party's support. Voters will go to the polls on Thursday 7 May for elections for 5,036 council seats across 136 local authorities in England, while voters in Scotland and Wales will elect a new Scottish Parliament and Senedd. Reform's initial internal target for the local elections in England was to win 1,000 seats - but that goal could be stymied after the government announced that it will examine requests from 63 local authorities to delay votes in their areas due to the local government reorganisation plan. Nonetheless, Mr Farage told The Times newspaper that his party will be throwing everything at winning, saying: \"It's double or quits. As far as I'm concerned we are just going to go for it. \"If we come out of it without a single penny in the bank account and everyone is exhausted … It is the single most important event between now and the general election. \n                  Too late to investigate Farage election expenses, Essex Police say\n                 \n                  Attempting to rejoin EU customs union 'complete fuel for Reform', Starmer warned\n                 \n                  Nigel Farage's former school responds to claims he made racist comments as a student\n                 \"On it depends the future of our prime minister, the future of the leader of the opposition and indeed my own relative strength or otherwise as leader of Reform. If we bombed people would ask questions. My entire focus and energy is on the planning and preparation for it.\" Reform UK intends to spend £5m over the next four months on direct mail and social media ahead of the elections - a spending blitz made possible by former Conservative donor Christopher Harborne handing the party £9m, which is one of the largest in political history. Mr Farage said: \"You will see a big emphasis on social media. If you look at where most of our support has come from since the election, the biggest single increase in our vote is from people who did not vote in the general election of 2024. \"Our key audience is people who did not vote, to motivate them to get registered and offer them a fundamental change.\" The broad slogan of the campaign will be \"Britain is broken, Britain needs Reform\", and the key themes will be law and order, the cost of living and migration. The law and order message will be particularly focused on outer London, where it is \"the dominant issue\", Mr Farage said. The Reform UK leader also briefly addressed accusations (that he denies) that he used racist and antisemitic language while at school, saying the reports will not have an impact because the reports in the \"mainstream media\" are seen as an attack on him. \"It's having zero effect,\" he said. \"It's maybe solidifying our core support.\" Party leaders under pressure The focus of all parties has turned very much towards the elections in May, with the outcome potentially pivotal to the future of Sir Keir Starmer's premiership, and Kemi Badenoch's leadership of the Conservative Party. Sir Keir in particular is under pressure, given Labour's dire position in the polls, and there are suggestions that he could face a challenge from the likes of Health Secretary Wes Streeting, former deputy prime minister Angela Rayner, or Greater Manchester mayor Andy Burnham - although he would need to win a seat in parliament first. The prime minister is expected to be public-facing next week to explain what the government is doing to ease the cost of living and improve public services, having vowed in his New Year's message that the change he promised in July 2024 will finally be delivered. Ms Badenoch, meanwhile, needs to prove to her party that she is starting to turn around their fortunes following the devastating general election defeat. In a nod towards May's critical test, she said in her own New Year's message: \"Things can change, but you also need to vote for the change you want to see in 2026.\" If not, she could face yet more humiliating defections to Reform UK, and potentially a leadership challenge from her former rival and shadow justice secretary, Robert Jenrick. The Liberal Democrats' leader, Sir Ed Davey, also needs to show that he has built on 2024's historic general election success for the party, and can take on Reform UK at the local level."
    },
    {
        "title": "Children from struggling families to be vaccinated at home - as immunisation rates drop",
        "description": "Children from struggling families will be able to be vaccinated at home across parts of England in a new government pilot scheme.",
        "url": "https://news.sky.com/story/children-from-struggling-families-to-be-vaccinated-at-home-as-immunisation-rates-drop-13489313",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-vaccine-child_7123695.jpg?20260101150153",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-01 14:46:00",
        "Headline": "Not a single childhood vaccine in England in 2024 met the 95% target needed to ensure diseases cannot spread among youngsters.",
        "Content": "Children from struggling families will be able to be vaccinated at home across parts of England in a new government pilot scheme. Health visitors - specialist public health nurses who support families with children under five - will administer the jabs during routine health visits, which removes the \"obstacles\" that some families face in accessing healthcare. A Government statement said the new pilot would target families who have \"fallen through the cracks - including those not signed up with a GP, struggling with travel costs, childcare juggling, language barriers or other tough circumstances that stop them getting to the doctor\". The scheme is not designed to replace GP vaccinations and families should continue to get their child vaccinated at their local surgery, the statement added. The £2m scheme aims to improve immunisation rates, with figures released last year showing not a single childhood vaccine in England in 2024 met the 95% target needed to ensure diseases cannot spread among youngsters. The 12 pilot schemes will roll out from mid-January across London, the midlands, north-east England and Yorkshire, the north west and south west. The government is also announcing that from 2 January, all children will be vaccinated against chickenpox for the first time. \n                  Hospitals are using AI to slash A&E wait times\n                 \n                  The children and families spending a 'different' Christmas in hospital \n                 \n                  What are nicotine pouches and are they safer than smoking?\n                 They will receive the new MMRV vaccine, protecting against measles, mumps, rubella and chickenpox, which replaces the current MMR vaccine. Health Secretary Wes Streeting said: \"Every parent deserves the chance to protect their child from preventable diseases, but some families have a lot going on and that can mean they miss out. \"Health visitors are already trusted faces in communities across the country. By allowing them to offer vaccinations, we're using the relationships and expertise that already exist to reach families who need support most. \"Fixing the NHS means tackling health inequalities head-on. By meeting families where they are, we're not just boosting vaccination rates - we're building a health service that works for everyone.\" The year-long trial will be evaluated ahead of a potential nationwide rollout from 2027. Health visitors will get extra training on how to handle conversations with parents who may be reluctant to have their child vaccinated. Struggling families will be identified by the NHS using GP records, health visitor notes and local databases. The pilot comes after figures released in August 2025 showed there continues to be sharp differences in uptake across regions of the country, with health officials warning last year that almost one in five children would be starting primary school without full protection against a number of serious diseases. The World Health Organisation (WHO) recommends at least 95% of children should receive vaccine doses for each illness to achieve herd immunity - and none of the main childhood vaccines in England reached this target in 2024/25. Some 91.9% of five-year-olds had received one dose of the MMR (measles, mumps & rubella) vaccine, unchanged from 2023/24 and the lowest level since 2010/11, according to the UK Health Security Agency. And just 83.7% of five-year-olds had received both MMR doses, down year-on-year from 83.9% and the lowest level since 2009/10. Uptake of the first MMR dose at 24 months stood at 88.9% in 2024/25 - unchanged on the previous year, but again the lowest figure since 2009/10. Coverage for the Hib/MenC vaccine, which protects against haemophilus influenzae type B and meningitis C, stood at 88.9% for children in England aged five, down from 89.4% in 2023/24 and the lowest level since 2011/12. Uptake of the four-in-one pre-school booster vaccine - which protects against polio, whooping cough, tetanus and diphtheria - stood at just 81.4% among five-year-olds in England in 2024/25."
    },
    {
        "title": "Chickenpox vaccine being rolled out on NHS for first time",
        "description": "A chickenpox vaccine is being rolled out on the NHS for the first time.",
        "url": "https://news.sky.com/story/chickenpox-vaccine-being-rolled-out-on-nhs-for-first-time-13489556",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-chickenpox-vaccine_7124184.jpg?20260101234757",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-01 23:22:00",
        "Headline": "The NHS says the jab will keep more kids in school, and their parents won't have to take time off work to look after them.",
        "Content": "A chickenpox vaccine is being rolled out on the NHS for the first time. It will be offered to youngsters alongside the MMR jab, which protects against measles, mumps, and rubella. It's a combo that's long been available to children in other countries, including the US, Canada, and Australia, and the move has been welcomed by health experts. The UK rollout was recommended by the Joint Committee on Vaccination and Immunisation (JCVI) in 2023, and in England alone hundreds of thousands of kids will be eligible from today. Health Secretary Wes Streeting said it will \"make a real difference for children and families\". He said: \"While chickenpox can be irritable and difficult for children, it can also be extremely serious and occasionally even fatal. \"The great thing about this new vaccine is that it combines the vaccine for chickenpox with MMR, which means that families can access this jab for their children, aged between 12 and 18 months.\" Who is eligible for the vaccine? Children born on or after 1 January 2025 will be offered two doses of MMRV at 12 months and 18 months. Those born between 1 July 2024 and 31 December 2024 will be offered one dose at 18 months and another at three years, four months. Children born between 1 September 2022 and 30 June 2024 will be offered one dose at three years, four months. A single-dose catch-up scheme is also planned for children born between 1 January 2020 and 31 August 2022. NHS England said GPs will be contacting families as part of the routine childhood vaccination programme. Read more from Sky News:UK snow warnings upgradedSwiss bar fire 'like a horror movie' Dr Gayatri Amirthalingam, deputy director of immunisation at the UK Health Security Agency, said the jab \"has been shown to be highly effective\" in other countries, \"with a good safety profile\". Dr Claire Fuller, national medical director for NHS England, added: \"This is a hugely positive moment for children and their families, providing protection against chickenpox for the first time and adding to the arsenal of routine vaccinations we give to children to safeguard them against serious illnesses.\" The vaccine will \"keep more children safe and in school\", she added."
    },
    {
        "title": "Trailer released for King Charles documentary on harmony with nature",
        "description": "A trailer has been released for a landmark documentary on King Charles' lifelong effort to bring nature and humanity into harmony.",
        "url": "https://news.sky.com/story/trailer-released-for-king-charles-documentary-on-harmony-with-nature-13489188",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-king-charles-king_7123567.jpg?20260101120502",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-01 08:02:00",
        "Headline": "The 90-minute documentary will be narrated by Oscar-winner Kate Winslet, with the King aiming to encourage viewers to embrace his environmental philosophy.",
        "Content": "A trailer has been released for a landmark documentary on King Charles' lifelong effort to bring nature and humanity into harmony. Finding Harmony: A King's Vision will be released on 6 February on Prime Video. The 90-minute documentary will be narrated by Oscar-winner Kate Winslet, with the monarch aiming to encourage a new audience to embrace his environmental philosophy. In the trailer, the King says: \"We are nature ourselves. We are a part of it, not apart from it.\" Filmed across four continents and spanning 75 years of archive footage, the film is being billed as a \"sumptuous cinematic experience\" that will leave viewers \"feeling uplifted and motivated to bring nature back into everything we do\". The documentary will chart the story of how the King, as Prince of Wales, pursued early environmentalism and spoke up for the science behind biodiversity loss, deforestation and climate change long before these issues became mainstream. The film will also showcase the life-changing work of his charity, The King's Foundation. \n                  Why there's no escape from Delhi's biggest killer\n                 \n                  2025 on track to be UK's warmest year on record, says Met Office\n                 \n                  Major city may have to evacuate as water supplies run low\n                 In the trailer, he says: \"We must put nature back at the heart of the equation.\" The King goes on to urge the world to \"follow harmony\" to ensure the planet can support so many. With a quick gaze to the sky, he adds: \"It's unlikely there's anywhere else.\" Read more from Sky News:Why UK is in 'extraordinary times' over its climateMillions 'slowly poisoned' with pleas for change being ignored A new photograph of the King captured during filming at Dumfries House in Scotland - the foundation's headquarters - was issued to mark the trailer and release date. The documentary, directed by Nicolas Brown, has been produced by Passion Planet in collaboration with The King's Foundation for Amazon MGM Studios."
    },
    {
        "title": "How Britain's children are being exposed and becoming addicted to porn",
        "description": "Children aged five and under are being exposed to pornography online, leading to addiction, Sky News has learned.",
        "url": "https://news.sky.com/story/how-britains-children-are-being-exposed-and-becoming-addicted-to-porn-13489554",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pornography-flossie_7124192.png?20260102001716",
        "type": "Technology",
        "Author": "Adele Robinson",
        "Date Published": "2026-01-01 23:05:00",
        "Headline": "Research carried out and shared by the charity Dignify shows that the age of children seeing sexual content on the internet is getting younger.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Children aged five and under are being exposed to pornography online, leading to addiction, Sky News has learned. Warning: This article contains details you might find distressing Research carried out and shared by the charity Dignify shows that the age of children seeing sexual content on the internet is getting younger. The organisation, which works to protect children and young people from the harmful effects of pornography, said children \"can't unsee what they've seen\". The average age of children seeing pornography is 12, according to Dignify. Nicola Lee, from the charity, told Sky News that when delving \"deeper\" into their data, they have discovered that some children who first viewed pornography aged five and under are also \"reporting addiction to pornography\". \"So it wasn't just a case of they saw it at that age,\" Nicola added, \"it actually has developed with them into their older years, and they're now telling us that they have an addiction.\" One young woman, Shaniah Williams, told Sky News she first saw pornography at just seven years old, after being \"exposed to harmful sexual behaviour\" when she was six, which prompted \"a curiosity\" to search online for answers. She described content being available to her on \"certain platforms\", and by the age of eight, she was watching extreme pornography. By 12 years old, she said she was addicted: \"I didn't understand why I was so low. Consuming more of this material kind of kept me sane… but the thoughts wouldn't stop every minute of every day. I just wanted it to stop.\" 'I didn't know humans looked like that' Despite having restrictions on devices, Shaniah said the material she saw as a child left her terrified and confused, and she subsequently suffered from depression and suicidal thoughts. \"I could look at the kids in the playground and tell you which one had been exposed to it, just due to their language,\" she explained. \"I used to wish I could be like the girls who hadn't. I was in the dark, in a prison of my own making.\" Shaniah is appealing to parents to start conversations with their children. \"It was scary. I didn't know human beings looked like that,\" she said. \"I'm a child, I've not seen that. I thought someone was killing the other person. I thought it was torture.\" \"It took my childhood,\" she added, \"it's gone. I'm not getting it back. But it doesn't mean other children can't have that. So I beg of you, parents - please. For their sake.\" Children find pornography 'unintentionally' According to Dignify's research, most children find pornography online \"unintentionally\", for example sent in a group chat, found through a link from another platform, or shared by a stranger. \"We do have children and young people who are seeing pornography,\" Nicola said. She added: \"A third of those who have seen pornography have seen it in primary school. It's scary, it's really scary as a parent to think, wow, my child might have seen pornography. \"But they may not have. So that curiosity, we don't want to spark it.\" Dignify are also encouraging parents to think about \"age and developmentally appropriate\" conversations around the issue - and have developed a \"roadmap\" guide to follow. In the early years, they advise talking about screen use and safety, and where screen use is happening to experience it as a \"shared moment\", such as playing games together. As well as parental controls and privacy settings on devices, Nicola also recommends being in the same room if a child is going to be by themselves on a screen to \"understand what they're looking at\". 'Exposed within months at secondary school' The problem, however, is also seemingly widespread in schools. Flossie, 17, told Sky News she was overwhelmed by the volume and extremity of content circulating among pupils in her secondary school. \"Within the first three months, I was exposed to literally everything on social media - hardcore pornography, violent videos,\" she said. One clip that went viral in her school showed a woman being beheaded. Another involved bestiality. She said she had no choice in seeing it. \"I got off the bus one day, and it was shoved in my face. I was 12. I had to go home from school because it was so disturbing.\" Flossie is now part of a legal challenge calling for smartphones to be banned in UK schools, arguing that children cannot be protected while devices remain in classrooms, playgrounds, or even on the school bus. \"It's the kids doing this to each other. And the only way it's going to stop is if they take the phones away. It takes one child in a whole school,\" she said. 'Year 7 pupils will see things they can never unsee' Will Orr‑Ewing, who is also involved in the challenge, said more than 250 headteachers support a potential judicial review of government guidance. \"If the secretary of state wanted to, it doesn't require any primary legislation. She can update the guidance, and it could be solved tomorrow,\" he said. He warned that every new school year brings another wave of children at risk: \"Every September is a new Year 7 and a large percentage of those children are going to see things they can never unsee.\" Mr Orr-Ewing explained that while most parents support restrictions, a \"vocal minority\" believe smartphones keep children safe - something he called \"a myth\". \"The evidence is that the vast majority of harms come through the smartphone. Parents think they're keeping their kids safe, but they are sadly making them more in danger by giving them a smartphone,\" he said. Read more from Sky News:UK snow warnings upgradedChildren to be vaccinated at home A Department for Education spokesperson said: \"We support headteachers to take the necessary steps to prevent disruption, backed by our clear guidance. Research from the Children's Commissioner shows 99.8% of primary schools and 90% of secondary schools already have policies in place restricting the use of mobile phones. \"Through the Online Safety Act, we have taken some of the boldest steps anywhere in the world to ensure children have age-appropriate experiences online, protecting them from harmful content. \"We are striking the right balance: protecting children while ensuring they can safely benefit from the digital world, without risking isolation or cutting off access to vital services, especially to the most vulnerable.\" If you have been affected by any of the issues raised in this story, help and support is available.  You can call Samaritans free on 116 123 anytime day or night. You can also email jo@samaritans.org or visit www.samaritans.org to find support online."
    },
    {
        "title": "Trailer released for King Charles documentary on harmony with nature",
        "description": "A trailer has been released for a landmark documentary on King Charles' lifelong effort to bring nature and humanity into harmony.",
        "url": "https://news.sky.com/story/trailer-released-for-king-charles-documentary-on-harmony-with-nature-13489188",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-king-charles-king_7123567.jpg?20260101120502",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-01 08:02:00",
        "Headline": "The 90-minute documentary will be narrated by Oscar-winner Kate Winslet, with the King aiming to encourage viewers to embrace his environmental philosophy.",
        "Content": "A trailer has been released for a landmark documentary on King Charles' lifelong effort to bring nature and humanity into harmony. Finding Harmony: A King's Vision will be released on 6 February on Prime Video. The 90-minute documentary will be narrated by Oscar-winner Kate Winslet, with the monarch aiming to encourage a new audience to embrace his environmental philosophy. In the trailer, the King says: \"We are nature ourselves. We are a part of it, not apart from it.\" Filmed across four continents and spanning 75 years of archive footage, the film is being billed as a \"sumptuous cinematic experience\" that will leave viewers \"feeling uplifted and motivated to bring nature back into everything we do\". The documentary will chart the story of how the King, as Prince of Wales, pursued early environmentalism and spoke up for the science behind biodiversity loss, deforestation and climate change long before these issues became mainstream. The film will also showcase the life-changing work of his charity, The King's Foundation. \n                  Why there's no escape from Delhi's biggest killer\n                 \n                  2025 on track to be UK's warmest year on record, says Met Office\n                 \n                  Major city may have to evacuate as water supplies run low\n                 In the trailer, he says: \"We must put nature back at the heart of the equation.\" The King goes on to urge the world to \"follow harmony\" to ensure the planet can support so many. With a quick gaze to the sky, he adds: \"It's unlikely there's anywhere else.\" Read more from Sky News:Why UK is in 'extraordinary times' over its climateMillions 'slowly poisoned' with pleas for change being ignored A new photograph of the King captured during filming at Dumfries House in Scotland - the foundation's headquarters - was issued to mark the trailer and release date. The documentary, directed by Nicolas Brown, has been produced by Passion Planet in collaboration with The King's Foundation for Amazon MGM Studios."
    }
]