[
    {
        "title": "Huge surge in online hate crimes targeting footballers revealed",
        "description": "Suspected online hate crimes referred to police have quadrupled already this season in English football, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-surge-in-online-hate-crimes-targeting-footballers-revealed-13446741",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ryan-bertrand-southampton-fc_7045504.jpg?20251008021020",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-10-07 23:13:15",
        "Headline": "Sky News speaks exclusively to the police chief tasked with tackling hate crimes in football and hears from player Kira Rai who - along with the likes of England star Jess Carter - has opened up about the scale of abuse she has faced.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Suspected online hate crimes referred to police have quadrupled already this season in English football, Sky News can reveal. And we have learned that the football policing unit has urged the government to form a new unit to address racism in the sport. We have also uncovered new details about the police investigation into the hate received by England star Jess Carter, who revealed to me after the Euros final win that the abuse nearly forced her to stop playing at the tournament.  But the scale of racism facing footballers is highlighted by the abuse received by Kira Rai - a British Sikh Punjabi - after signing for Peterborough United last month. They play in the fourth tier, far from the spotlight of the Women's Super League, but that does not limit the venom targeted at Rai on social media. She told Sky News: \"There were some racial slurs about my heritage, where I come from, that I don't belong in this country, that I should go back to X country and just sorts of things along those lines. \"I think that's probably quite difficult to read about yourself at the end of the day. \"It should be a moment for me to celebrate, I've just joined a new club.\" What an impact she has made at her new club, scoring an incredible five-minute hat-trick in the FA Cup on Sunday on her home debut. But the joy is tinged with sadness when we meet the next day. 'A reflection of society' \"I've been in football since I was six, so for people to question whether I belong in football purely based on the colour of my skin, I think is something that's really difficult to get your head round,\" she said. \"It's probably a reflection of what's going on in society right now and how prevalent racism has become, and I think football is quite clearly a reflection on society. \"In society, over the last weeks, months, I think there's almost an underlying tension that's perhaps not been there in recent years.\" 'Depressing' rise in abuse The is felt by the police unit that has overseen football issues for the last two decades, with racism in stadiums and online rising. Social media is a growing concern, with 170 referrals already this season of online racism compared to 54 in the first three months of the 2022-23 season and 41 in 2023-24. \"We're seeing more reports, which is depressing,\" Chief Constable Mark Roberts said in an exclusive interview. \"I think we're also seeing that the number of those reports that actually meet the criminal threshold has increased.\" It's up to 154 already this season. 'We have gone backwards' \"There's an awful lot in the political sphere that people are saying that probably a few years ago just wouldn't have been thought of, so I think it taps into that broader societal piece which makes it challenging,\" the National Police Chiefs Council's football lead added. \"Sadly that seems to have gone backwards a bit. The lower league grounds now, we are seeing incidents creep back into the games which obviously we've got to be really keen to clamp down on and make sure that people face consequences. \"Now whether that's been driven by people being able to say things or feel that they can say things online and that's now leaking into the actual stadiums, there is a definite trend to see more of it.\" One of the unit's most high-profile investigations has been into the racism that led Carter to speaking out during England's run to Euro 2025 and stepping away for a time from social media. While two arrests have been announced, Sky News can reveal a third person has been arrested. A fourth suspect has also been identified, and six people overseas are under suspicion. Carter previously told Sky News: \"I wasn't sure I was going to be able to come back on the pitch and be me.\" No one has been charged.  'Slippage' with Musk's X Three cases are pending with Elon Musk's X. And whether it's X or Meta-owned Instagram, there is no agreement on the \"grossly offensive legal threshold\" with policies more tolerable than British law. Mr Roberts said: \"There has been some slippage recently with X that we're working with them to try to get back to those standards. And I think one of the factual issues we sometimes struggle with is our perception of what is clearly a criminal offence. \"They can sometimes suggest that it doesn't meet the threshold for their community guidelines, which I find difficult to reconcile really because surely if it meets the criminal prosecution threshold, surely it should breach [their guidelines], and we sometimes have a wrangle about securing information from them.\" A challenge is dealing with international police forces with two-thirds of referrals of racism generated overseas - beyond the jurisdiction of the football policing unit. While not naming particular countries, Mr Roberts said abuse posted from Eastern Europe and Asia is the main problem. \"The level of interest from some countries varies,\" he said. \"Some just aren't interested. We won't get a response. Others will try and take positive action.\" The approach of English football can seem somewhat disjointed if different campaigns and anti-racism investigations run by different parts of the game. Read more from Sky News:Antoine Semenyo backs jailing abusersFA could boycott social media over racismTennis star denies being racist For Mr Roberts, that could ideally be enhanced. \"I would like a joint function to tackle online hate with ourselves, the football bodies, Kick It Out and others, ideally supported by government, so that we can do it in a really coherent, joined-up way,\" he said in our interview at Cheshire Police HQ. \"I think that would make a massive difference, whether it's education, whether in-stadium hate, whether it's online hate. \"The way we're going to tackle this most effectively is by doing it in a joined-up way where we're mutually supportive. So I think that's something we'd be keen to pursue.\" So would those who have been the target of abuse just for doing what they love - playing football. 'No one wants to talk about this' Kira Rai, a role model for British South Asians in football, said: \"Perhaps there needs to be an overhaul, everyone needs to come together and actually deal with these uncomfortable conversations because they're not necessarily fun conversations that we have. \"No one really wants to talk about this, and I can understand why. For real change, for genuine change to actually occur, you have to have these difficult conversations. \"You have to listen to player stories, to fan stories, to anyone's stories in football, in society, to actually get to the bottom of it.\" And as some players showed last weekend in the Women's Super League, change doesn't come by taking a knee, but taking a stand."
    },
    {
        "title": "'Who's going to protect us?': Ex-wife of man injured in Manchester synagogue attack says he no longer wants to live in UK",
        "description": "The man injured by a police bullet in the Manchester synagogue attack feels so unsafe he no longer wants to live in this country, his ex-wife has told Sky News.&#160;",
        "url": "https://news.sky.com/story/whos-going-to-protect-us-ex-wife-of-man-injured-in-manchester-synagogue-attack-says-he-no-longer-wants-to-live-in-uk-13446570",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-naomi-finlay-yoni-finlay_7045188.jpg?20251007165447",
        "type": "Home",
        "Author": "Katie Barnfield",
        "Date Published": "2025-10-07 15:40:27",
        "Headline": "Yoni Finlay has been in hospital since the attack on the synagogue in Heaton Park last week, after being injured by a police bullet. His ex-wife Naomi Finley says \"he definitely does not feel safe in this country - and he's questioning his future here\".",
        "Content": "\n          North of England correspondent\n        The man injured by a police bullet in the Manchester synagogue attack feels so unsafe he no longer wants to live in this country, his ex-wife has told Sky News.Â  Along with their children, Naomi Finlay has been visiting Yoni Finlay in hospital since the attack last week. She said he was \"shocked\" to hear about the level of antisemitism she and their children had been facing before the synagogue was targeted. \"When I went to see him in the hospital, I spoke to him about some of the antisemitism we'd faced personally,\" Mrs Finlay said. \"Some of the things I hadn't discussed with him before, and he didn't know. And he was really, really upset for me and the children that this is what we've been through. \"He expressed that he definitely does not feel safe in this country - and he's questioning his future here.\" Ms Finlay told Sky News that she and her children have faced threats and abuse, some reported to the police. \"We've been shouted at, the kids have been shouted at,\" she said. \"My son, his biggest fear is being recognised as Jewish. The second he leaves the synagogue, the kippah comes off his head. \"On October the 7th, two years ago, someone tried to knock my brother over while he was walking back from the synagogue.\" 'It's something you've been waiting for' Ms Finlay added that although the attack on the Heaton Park synagogue was a shock, as her family had been living on \"constant alert\", it did not come as a surprise. \"The second I heard something, I knew absolutely - I knew what it was,\" she added. \"There's no doubt in your mind. Because it's something, yes, you've been waiting for - but anticipating with dread.\" It took hours before Ms Finlay was able to find out from a family member who was also at the synagogue that Yoni had been injured but was still alive. \"We live close to the synagogue - we saw and heard everything,\" she said. \"The beginning of the day - where we are just on the streets asking anyone, 'Have you seen him? Have you seen him?' - that was definitely the hardest part. \"It was so difficult for the kids, because that's their dad.\" Read more about the synagogue attack:Friends of attacker reveal how he became radicalisedMan who helped barricade says attacker was 'monster'Shapps: My father-in-law was at synagogue attack Yoni was among those barricading the doors to stop the attacker, Jihad al Shamie, from getting inside the synagogue. Al Shamie was shot and killed by police, but one of their bullets came through the synagogue door - striking Yoni and killing Adrian Daulby, one of the two men who lost their lives. Yoni was in surgery for seven hours on the day of the attack. Ms Finlay added he \"remembers everything\", including the moment the bullet struck. Although she said he is still in a lot of pain, he is now stable and recovering. \"The kids have been taking him some treats,\" she said, \"saving him half of their chocolate bars and taking them into him. \"Things from school, letters from friends they've been taking in to show him. They are just really wanting him back.\" 'Who's going to protect us?' Two years to the day since the 7 October terror attack in Israel, Ms Finlay finds it \"really hurtful\" that pro-Palestine marches are taking place across the country, less than a week on from the attack in which Yoni was injured. \"It was just that little bit further away - and now it's not further away,\" she said. \"Even today there's protests going on - on one of the saddest days for Jewish people worldwide. \"I feel like we can't even get a break on that one day to actually grieve and process our feelings.\" Although she said the police have been \"amazing\" since the attack, she worries about what will happen to her and her family when the attention dies down. \"We worry that in a few weeks, when all this simmers down, are we still going to feel reassured? Are we still going to be protected? \"You know, who's going to look after our kids when they're in school? Who's going to look after us when we go pray in the synagogue? Who's going to protect us?\""
    },
    {
        "title": "Starmer refuses to rule out tax rises as he flies business leaders to India",
        "description": "Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-tax-rises-as-he-flies-business-leaders-to-india-13446700",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-heathrow_7045132.jpg?20251007154127",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-10-07 20:04:02",
        "Headline": "Sir Keir has already turned down the wish of some of the CEOs on the trip to increase the number of visas.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai. The prime minister flew on a plane with dozens of Britain's most prominent business people, including bosses from BA, Barclays, Standard Chartered, BT and Rolls-Royce, for the two-day trip designed to boost ties between the two countries. Follow updates in the Politics Hub Starmer will meet Prime Minister Narendra Modi on Thursday, five months after the UK signed the first trade deal with India since Brexit. The agreement has yet to be implemented, with controversial plans to waive national insurance for workers employed by big Indian businesses sent to the UK still the subject of a forthcoming consultation. Speaking to journalists on the plane on the way out, the prime minister said he was determined to boost ties between the two countries. The trip has been arranged to coincide with the Conservative Party conference, with the first day of meetings coinciding with Kemi Badenoch's speech to activists in Manchester. However, the business delegation is likely to use the trip to lobby the prime minister not to put more taxes on them in the November budget. Sir Keir has already turned down the wish of some CEOs on the trip to increase the number of visas. \"The visa situation hasn't changed with the free trade agreement, and therefore we didn't open up more visas,\" he said. He told business that it wasn't right to focus on visas, telling them: \"The issue is not about visas. It's about business-to-business engagement and investment and jobs and prosperity coming into the United Kingdom.\" The prime minister sidestepped questions about Mr Modi's support of Russian leader Vladimir Putin, whom he wished happy birthday on social media. US President Donald Trump has increased tariffs against India, alleging that Indian purchases of Russian oil are supporting the war in Ukraine. Asked about Mr Modi wishing Mr Putin happy birthday, and whether he had leverage to talk to Mr Modi about his relationship with Russia, Sir Keir sidestepped the question. \"Just for the record, I haven't... sent birthday congratulations to Putin, nor am I going to do so,\" he said. \"I don't suppose that comes as a surprise. In relation to energy, and clamping down on Russian energy, our focus as the UK, and we've been leading on this, is on the shadow fleet, because we think that's the most effective way. We've been one of the lead countries in relation to the shadow fleet, working with other countries.\" PM: We aren't forcing wealthy people out Sir Keir refused to give business leaders any comfort about the budget and tax hikes, despite saying in his conference speech he recognised the last budget had an impact. \"What I acknowledged in my conference, and I've acknowledged a number of times now, is we asked a lot of business in the last budget. It's important that I acknowledge that, and I also said that that had helped us with growth and stabilising the economy,\" he added. \"I'm not going to make any comment about the forthcoming budget, as you would expect; no prime minister or chancellor ever does.\" Asked if too many wealthy people were leaving London, he said: \"No. We keep a careful eye on the figures, as you would expect. \"The measures that we took at the last budget are bringing a considerable amount of revenue into the government which is being used to fix things like the NHS. We keep a careful eye on the figures.\""
    },
    {
        "title": "Trump optimistic about Gaza peace deal - as Israelis mark October 7 anniversary",
        "description": "Donald Trump has expressed optimism about ceasefire talks between Israel and Hamas, as&#160;Israelis mourned those killed two years after the&#160;October 7 attacks.",
        "url": "https://news.sky.com/story/trump-optimistic-about-gaza-peace-deal-as-israelis-mark-october-7-anniversary-13446713",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us_7045496.jpg?20251008005414",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-07 20:25:36",
        "Headline": "On the second anniversary of Hamas's attack on Israel that triggered the Gaza war, the US president expressed optimism about progress towards a ceasefire deal.",
        "Content": " Donald Trump has expressed optimism about ceasefire talks between Israel and Hamas, asÂ Israelis mourned those killed two years after theÂ October 7 attacks. The US president described the negotiations as \"very serious\", adding: \"I think there's a possibility we could have peace in the Middle East\". Latest updates from the war in Gaza One of the key mediators, Qatar's prime minister, along with senior American diplomats Steve Witkoff and Jared Kushner, will now head to Egypt to join the third day of indirect negotiations between the Palestinian militant group and Israel. Memorial events took place around the world on Tuesday, including in Israel, as grieving families gathered and relatives hoped a ceasefire deal could see the remaining hostages freed. It has been two years since thousands of Hamas-led militants poured into southern Israel after a surprise barrage of rockets. They stormed army bases, farming communities and the outdoor Nova music festival, killing some 1,200 people, mostly civilians, including women, children and older adults. The attack plunged the region into a devastating war, including a brutal retaliatory offensive by Israel on Gaza that has left tens of thousands of people dead, turned entire towns and cities to rubble, triggered a widespread famine and displaced around 90% of the population. Hamas abducted 251 others, most of whom have since been released in ceasefires or other deals, with 48 hostages remaining inside Gaza, around 20 of them believed by Israel to be alive.  Israel mourns October 7 victims In Tel Aviv, dozens gathered at a memorial site that was set up in a city square. Others visited the scene of the Nova music festival in the border community of Reim, where nearly 400 Israelis were killed and where portraits of the kidnapped and dead have been erected. Thousands of people visited throughout the day to share memories of relatives and friends who were killed. Pro-Palestinian rallies, opposing Israel's actions in Gaza, were also held in several European cities including Paris, Geneva, Athens, Istanbul, Stockholm, and London. Sir Keir Starmer labelled the UK protests as \"un-British\" and said they showed a lack of respect.  Hamas wants 'guarantees' On the second day of talks, top Hamas leader Khalil Al-Hayya told Egyptian state-affiliated Al Qahera News TV the group had come \"to engage in serious and responsible negotiations\". He said Hamas was ready to reach a deal, yet it needed a \"guarantee\" to end the war and ensure \"it is not repeated\". US officials have suggested the talks should initially focus on the first phase: halting the fighting and working out logistics for the release of hostages and Palestinian prisoners. Read more from Sky News:Two lives torn apart by the Hamas attackTrump's Gaza peace plan explainedIsraelis and Palestinians grieve two years on A spokesperson for Prime Minister Sheikh Mohammed bin Abdulrahman al-Thani of Qatar said he would attend the talks in Sharm el-Sheikh \"with the aim of pushing forward the Gaza ceasefire plan and hostage release agreement\". ðŸ‘‰Listen to The World with Richard Engel and Yalda Hakim on your podcast appðŸ‘ˆ The failure by Hamas to return hostages has left Israel deeply divided, with weekly mass protests against Israeli Prime Minister Benjamin Netanyahu. It has also left Israel more isolated internationally than it has been in decades.  The war has already killed over 67,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not say how many were civilians or combatants. Experts and major rights groups have accused Israel of genocide - something Israel vehemently denies. The International Criminal Court is seeking the arrest of Mr Netanyahu and his former defence minister for allegedly using starvation as a method of war."
    },
    {
        "title": "Spying trial collapsed after government refused to brand China a threat, says top prosecutor",
        "description": "A Chinese spying trial collapsed last month after the UK government would not label Beijing a national security threat, a top prosecutor has said.",
        "url": "https://news.sky.com/story/spying-trial-collapsed-after-government-refused-to-brand-china-a-threat-says-top-prosecutor-13446716",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christopher-cash-christopher-berry_7045458.png?20251007215609",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-07 20:27:07",
        "Headline": "Stephen Parkinson has sought to blame the government for not labelling China a risk to national security - but Sir Keir Starmer says this had to happen under the Tories.",
        "Content": "A Chinese spying trial collapsed last month after the UK government would not label Beijing a national security threat, a top prosecutor has said. Christopher Berry, 33, and former parliamentary researcher Christopher Cash, 30, were accused of espionage for China. But the Crown Prosecution Service (CPS) announced on 15 September that the charges would be dropped, sparking criticism from Downing Street and MPs. Berry, of Witney, Oxfordshire, and Cash, from Whitechapel, east London, had denied accusations of providing information prejudicial to the interests of the state in breach of the Official Secrets Act between December 2021 and February 2023. Politics latest: Badenoch insists 'Jenrick is not the Tory leader' Stephen Parkinson, the director of public prosecutions (DPP), told MPs in a letter on Tuesday that the CPS had tried \"over many months\" to get the evidence it needed to carry out the prosecution, but it had not been forthcoming from the Labour government. However, Sir Keir Starmer insisted the decision to brand China a threat would have to have been taken under the last Conservative administration. \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Â£5bn fraud mastermind's 'butler' pleads guilty to money laundering after UK's biggest ever Bitcoin seizure\n                 \n                  Former assistant to AfD politician found guilty of Chinese spy charges\n                 The prime minister said: \"You can't prosecute someone two years later in relation to a designation that wasn't in place at the time.\" It is understood that the decision to end the case came after a meeting of senior officials which, according to The Sunday Times, included Jonathan Powell, the national security adviser, and Sir Oliver Robins, the Foreign Office's top diplomat. To prove the case under the Official Secrets Act of 1911, prosecutors would have to show the defendants were acting for an \"enemy\". Both the current Labour government and the previous Conservative governments have not labelled China a risk to national security. In his letter to the chairs of the Commons home and justice select committees, Mr Parkinson said: \"It was considered that further evidence should be obtained. \"Efforts to obtain that evidence were made over many months, but notwithstanding the fact that further witness statements were provided, none of these stated that at the time of the offence China represented a threat to national security, and by late August 2025 it was realised that this evidence would not be forthcoming. \"When this became apparent, the case could not proceed.\" He also pointed out that in a separate case about Russian spying last year, a judge ruled that an \"enemy\" under the 1911 Act must be a country that represents a threat to national security of the UK \"at the time of the offence\". How has the government responded? Sir Keir has addressed the contents of the letter, which he said he had \"read at speed\", while on board a flight to Mumbai, as part of the UK's largest ever trade mission to India. The PM said: \"What matters is what the designation [of China] was in 2023, because that's when the offence was committed and that's when the relevant period was. \"Statements were drawn up at the time according to the then government policy, and they haven't been changed in relation to it, that was the position then. \"I might just add, nor could the position change, because it was the designation at the time that matters.\" Sir Keir, a former director of public prosecutions, added that he wasn't \"saying that defensively\", but because \"as a prosecutor, I know that... it is what the situation at the time that matters\". He also declined to criticise the CPS or the DPP, as he said \"it's wise not to\". Since the alleged spying offences took place, the new National Security Act has superseded elements of the 1911 Act. But Conservatives, including shadow home secretary Chris Philp, insist that Sir Keir has \"very serious questions to personally answer\"."
    },
    {
        "title": "Tetchy Badenoch criticised me for asking hard questions - but leadership challenge talk won't go away",
        "description": "In the 11 months since Kemi Badenoch has become party leader, the Conservative Party has dropped from 26% to 17% in the polls.",
        "url": "https://news.sky.com/story/badenoch-positively-looking-for-a-fight-as-tories-seek-relevance-13446659",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-beth-rigby-kemi-badenoch_7045370.jpg?20251007195318",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-07 18:30:03",
        "Headline": "The Tory leader may not like being asked about Reform, might - in her words - not be interested in Reform, but her former voters, and the country, are.",
        "Content": "\n          Political editor\n              @BethRigby\n  In the 11 months since Kemi Badenoch has become party leader, the Conservative Party has dropped from 26% to 17% in the polls. It has lost nearly 700 council seats, 16 councils, while 18 senior Tories have defected, including one of the party's great thinkers, Danny Kruger. Politics Live: Tory councillors defect to Reform Her personal poll rating, minus 47, is worse than the lowest ebb of Iain Duncan Smith's fated leadership and worse than when Boris Johnson resigned. To rub salt into the wounds, a Sky News/YouGov poll this week found that the majority of Tory members think Robert Jenrick should be the leader, while half don't think she should lead them into the next general election. Being leader of the Opposition is often described as the hardest job in politics, but for Badenoch, with Reform stealing the march as the party of the right, it looks pretty much impossible. For someone who needs to try to win people over, Badenoch has a curious style. She likes to be known as a leader who isn't afraid of a fight and, at times, she approached our interview at the Conservative Party conference as if she was positively looking for one. \n                  Lord Heseltine attacks Badenoch's new policies - and calls Farage a 'phoney'\n                 \n                  Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'\n                 \n                  Robert Jenrick says Kemi Badenoch is 'right person' to lead party - despite poll\n                 A few times in our interview when I asked her a question she didn't like, or didn't want to answer (it is my job to ask all politicians hard questions), she seemed tetchy. And when I deigned to ask her whether she admired Nigel Farage, she criticised me for asking the question. She asked why I was not asking her if she admires Sir Keir Starmer or Sir Ed Davey. Her approach surprised me, as I had asked the prime minister exactly the same question a week before. He'd answered it directly, without arguing over why I had asked it: \"I think he is a formidable politician,\" said Sir Keir. Badenoch told me she didn't understand the question, and then told me she wasn't interested in talking about him. It made for an awkward, ill-tempered exchange. The facts remain that Farage is topping the polls, helped by Labour's collapsing support and the Conservatives' deep unpopularity. And in the run-up to our interview, Reform drip-fed the news that 20 Tory councillors were defecting to Farage's party. There is open talk in Badenoch's party about whether the Tories will need to try to come to some sort of agreement with Reform at the next election to try to see off Labour and 'progressive parties'. Farage says absolutely not, as does Badenoch - but many in her party do not think she has that luxury. Andrew Rosindell, MP for Romford, told GB News he'll lose his seat unless the two sides \"work together\" and said the right must unite to defeat the left. Arch-rival Robert Jenrick pointedly refuses to rule it out, saying only it's \"not the priority\". Meanwhile, party members support an electoral pact by two to one, according to our Sky News poll. On the matter of whether these MPs, and party members, have a point, Badenoch bristled: \"It is important that people know what we stand for. Robert Jenrick is not the leader of the Conservative Party, neither is Andrew Rossindell. I am the leader of the party and we are not having a coalition or a pact with Reform.\" Read More:Jaunty Jenrick: a leader's speech in all but nameKemi Badenoch praises Thatcher but faces fight with grandees When I ask colleagues if they think Badenoch is too aloof, too argumentative, too abrasive to lead this rebuild, the popular refrain for her supporters is that she is \"a work in progress\" and that it would be madness to change the leader again. The question is, will she be given the time to develop? The plot to oust her is active and much of the chatter around this conference is whether she might be challenged before or after the May local elections. There are some colleagues who believe it is better to give her more time to turn things around and, if May is truly dreadful and the party goes further backwards, remove her then. Ahead of conference, when asked by Tim Shipman of the Spectator whether she would resign if the Conservatives go backwards in May, she said rather cryptically \"ask me after the locals\". When I asked Badenoch why she said that she replied, \"let's see what the election result is about\". When I explained that it sounded rather like she might throw in the towel after next May and so was seeking clarification, she told me that I was asking irrelevant questions. \"Your viewers want to know how their lives are going to be better. Not be inside the Westminster bubble politics of who's up, who's down... It's part of the reason why the country is in this mess. Perhaps if people had scrutinised Labour's policies instead of looking at just poll ratings, they would be running the country better.\" But Tories are looking at poll ratings and there is a view from some in the party that if the Tories wait until another drubbing in the May local, Scottish and Welsh elections, there might not be much of a party apparatus left to rebuild from. In short, there is not a settled view on when a challenge might come, but with the party in the position it is in, talk of a challenge will not go away. Badenoch wants to make the case that her \"authentic conservatism\" is worth sticking with and that the policies the Conservatives are announcing will give them a pathway back. On borders, the Tories are trying to neutralise Reform with a very similar offer. On the economy and welfare cuts, they hope they can beat Labour and Reform. But really, the question about this party and this leader is about relevance. The prime minister didn't even bother to name check Badenoch in his conference speech, while Davey trained his guns on Farage rather than his traditional Tory rival. Badenoch may not like being asked about Reform, might - in her words - not be interested in Reform, but her former voters, and the country, are. The enormous challenge for her in the coming months is to see if she can get them to look at her."
    },
    {
        "title": "Scientists develop first-ever blood test to diagnose chronic fatigue syndrome",
        "description": "A new blood test can diagnose chronic fatigue syndrome, also known as CFS or ME, with an accuracy of 96%, according to scientists who developed it.",
        "url": "https://news.sky.com/story/scientists-develop-first-ever-blood-test-to-diagnose-chronic-fatigue-syndrome-13446510",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-fatigue-tired-woman_7045495.jpg?20251008004738",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-07 12:34:17",
        "Headline": "CFS is a disabling illness characterised by extreme fatigue that is not relieved by rest.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A new blood test can diagnose chronic fatigue syndrome, also known as CFS or ME, with an accuracy of 96%, according to scientists who developed it. The researchers, from the University of East Anglia, hope the breakthrough could pave the way for a similar test to diagnose long COVID. But other scientists warn the test needs to be independently validated in further clinical studies before being offered privately to patients who may be desperate to understand their debilitating symptoms. CFS is a disabling illness characterised by extreme fatigue that is not relieved by rest. Around 400,000 people in the UK have the condition, but its cause and treatment has been controversial. Professor Dmitry Pshezhetskiy, lead researcher, said: \"We know that some patients report being ignored or even told that their illness is 'all in their head'. \"With no definitive tests, many patients have gone undiagnosed or misdiagnosed for years. \"Our discovery offers the potential for a simple, accurate blood test to help confirm a diagnosis, which could lead to earlier support and more effective management.\" The researchers used technology developed by biotech company Oxford BioDynamics to analyse how DNA is folded in blood samples taken from 47 patients with severe symptoms and 61 people who were healthy. Each of our cells contain about two metres of DNA, which is tightly packed and folded millions of times. The folds aren't random - they help turn genes on or off. The folding and 3D structure of the genetic material isn't determined by the DNA code which we are born with and is largely fixed. Instead, life events can influence the folding, and which genes are active, a mechanism called \"epigenetics\". The researchers found people with CFS had a unique pattern in epigenetic markers, or chemical tags, on their DNA. Read more tech news:Almost 15 million teens using vapesAre Bitcoin's record highs sustainable?Robin Williams's daughter hits out at AI videos of him A test based on the pattern was able to identify 92% of people with CFS and 98% of those who were healthy. The overall accuracy was 96%. \"This is a significant step forward,\" said Prof Pshezhetskiy. \"For the first time, we have a simple blood test that can reliably identify ME/CFS - potentially transforming how we diagnose and manage this complex disease. \"Post-COVID syndrome, commonly referred to as long COVID, is one example of ME/CFS, where a similar cluster of symptoms is triggered by the COVID-19 virus, rather than by other known causes such as glandular fever. \"We therefore hope that our research will also help pave the way for a similar test to accurately diagnose long COVID.\" The study has been published in the Journal of Translational Medicine. Test 'likely' to be pricey Prof Chris Ponting, from the University of Edinburgh, who wasn't involved in the research, said the claims were premature because there were significant differences in sex, age and other factors between the people with CFS and the healthy controls. \"This test needs to be fully validated in better designed and independent studies before it is considered for clinical application,\" he said. \"Even if validated, the test will be expensive, likely around Â£1,000.\""
    },
    {
        "title": "Robert Jenrick urged to apologise for 'disgraceful' integration comments ",
        "description": "Robert Jenrick should apologise for his \"disgraceful comments\" bemoaning the lack of visible white faces in a part of Birmingham, the Mayor of the West Midlands has said.",
        "url": "https://news.sky.com/story/robert-jenrick-urged-to-apologise-for-disgraceful-integration-comments-13446669",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-robert-jenrick-conservative_7044862.jpg?20251007120038",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-07 19:00:21",
        "Headline": "Labour's Mayor of the West Midlands Richard Parker says Mr Jenrick's comments about Handsworth in Birmingham are not accurate and risk stoking division.",
        "Content": " Robert Jenrick should apologise for his \"disgraceful comments\" bemoaning the lack of visible white faces in a part of Birmingham, the Mayor of the West Midlands has said. Richard Parker told Sky News' The UK Tonight with Sarah-Jane Mee he was \"shocked and truly appalled\" by what the shadow justice secretary said about integration in Handsworth. In a recording from March obtained by The Guardian, Mr Jenrick said that the inner-city area \"was one of the worst integrated places I've ever been to\" and that \"in the hour and a half I was filming news there I didn't see another white face\". Mr Parker, a Labour mayor, told Sky News: \"I thought they were disgraceful comments. \"They're really damaging comments about, you know, one of the great communities in Birmingham, in Handsworth, a community that is vibrant, is very welcoming, very hospitable, and full of generosity.\" Mr Jenrick doubled down on his comments on Tuesday, saying he would not \"shy away\" from issues of integration.  'I'm shocked and truly appalled' But Mr Parker said it was not an accurate reflection of Handsworth as he called on the senior Tory MP and Conservative leader Kemi Badenoch to apologise. He said: \"I'm shocked and truly appalled. He doesn't know Handsworth. If he wanted to know Handsworth, he could have reached out to me, and I could have shown him around and introduced him to the people there, the great people that run businesses I know there, and some of the great community groups I know there.\" He added: \"He used the colour of people's skins to make really divisive and negative comments about Handsworth, and it's wrong, and it's also wrong that a politician, a senior politician of a mainstream party, makes comments like this and then reiterates them, with no apology. \"I believe Robert Jenrick, and the leader of the Conservative Party, owe the people of Birmingham and the people in the communities of Handsworth an apology.\" Read more:Jaunty Jenrick: A leader's speech in all but nameBadenoch praises Thatcher but faces fight with grandees Mr Jenrick was in Handsworth to film a video about litter and fly tipping for GB News. His words were recorded during a dinner at the Aldridge-Brownhills Conservative Association dinner on 14 March, The Guardian said. According to the paper, he called the litter \"appalling\" and said Handsworth was \"as as close as I've come to a slum in this country\". He added: \"The other thing I noticed there was that it was one of the worst integrated places I've ever been to. In fact, in the hour and a half I was filming news there, I didn't see another white face. \"That's not the kind of country I want to live in. I want to live in a country where people are properly integrated. It's not about the colour of your skin or your faith, of course it isn't. But I want people to be living alongside each other, not parallel lives. That's not the right way we want to live as a country.\" The comments have also been criticised by the Bishop of Birmingham, the Right Reverend Michael Volland. In a letter to Mr Jenrick published on Tuesday and co-signed by a number of community leaders, he said the comments \"can feed into a harmful narrative that provides fuel for a fire of toxic nationalism\". Jenrick: It was an observation Former Tory mayor Andy Street has also said Mr Jenrick was \"wrong\" about Handsworth, while the Labour Party said his comments \"cross a red line\". However, Mr Jenrick stood by what he said on Tuesday, telling the Telegraph's Daily T podcast \"I didn't see a mix of people on the streets. It was an observation\". Asked if he had any regrets about his comments, he earlier told BBC Radio 5 Live: \"No, not at all and I won't shy away from these issues.\" Ms Badenoch also defended her shadow minister, telling BBC Breakfast he had made a \"factual statement\". She said: \"If he said he didn't see another white face, he might have been making an observation. There's nothing wrong with making observations. \"But what he and I both agree with is that there are not enough people integrating. There are many people who are creating separate communities.\""
    },
    {
        "title": "Huge surge in online hate crimes targeting footballers revealed",
        "description": "Suspected online hate crimes referred to police have quadrupled already this season in English football, Sky News can reveal.",
        "url": "https://news.sky.com/story/huge-surge-in-online-hate-crimes-targeting-footballers-revealed-13446741",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ryan-bertrand-southampton-fc_7045504.jpg?20251008021020",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-10-07 23:13:15",
        "Headline": "Sky News speaks exclusively to the police chief tasked with tackling hate crimes in football and hears from player Kira Rai who - along with the likes of England star Jess Carter - has opened up about the scale of abuse she has faced.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Suspected online hate crimes referred to police have quadrupled already this season in English football, Sky News can reveal. And we have learned that the football policing unit has urged the government to form a new unit to address racism in the sport. We have also uncovered new details about the police investigation into the hate received by England star Jess Carter, who revealed to me after the Euros final win that the abuse nearly forced her to stop playing at the tournament.  But the scale of racism facing footballers is highlighted by the abuse received by Kira Rai - a British Sikh Punjabi - after signing for Peterborough United last month. They play in the fourth tier, far from the spotlight of the Women's Super League, but that does not limit the venom targeted at Rai on social media. She told Sky News: \"There were some racial slurs about my heritage, where I come from, that I don't belong in this country, that I should go back to X country and just sorts of things along those lines. \"I think that's probably quite difficult to read about yourself at the end of the day. \"It should be a moment for me to celebrate, I've just joined a new club.\" What an impact she has made at her new club, scoring an incredible five-minute hat-trick in the FA Cup on Sunday on her home debut. But the joy is tinged with sadness when we meet the next day. 'A reflection of society' \"I've been in football since I was six, so for people to question whether I belong in football purely based on the colour of my skin, I think is something that's really difficult to get your head round,\" she said. \"It's probably a reflection of what's going on in society right now and how prevalent racism has become, and I think football is quite clearly a reflection on society. \"In society, over the last weeks, months, I think there's almost an underlying tension that's perhaps not been there in recent years.\" 'Depressing' rise in abuse The is felt by the police unit that has overseen football issues for the last two decades, with racism in stadiums and online rising. Social media is a growing concern, with 170 referrals already this season of online racism compared to 54 in the first three months of the 2022-23 season and 41 in 2023-24. \"We're seeing more reports, which is depressing,\" Chief Constable Mark Roberts said in an exclusive interview. \"I think we're also seeing that the number of those reports that actually meet the criminal threshold has increased.\" It's up to 154 already this season. 'We have gone backwards' \"There's an awful lot in the political sphere that people are saying that probably a few years ago just wouldn't have been thought of, so I think it taps into that broader societal piece which makes it challenging,\" the National Police Chiefs Council's football lead added. \"Sadly that seems to have gone backwards a bit. The lower league grounds now, we are seeing incidents creep back into the games which obviously we've got to be really keen to clamp down on and make sure that people face consequences. \"Now whether that's been driven by people being able to say things or feel that they can say things online and that's now leaking into the actual stadiums, there is a definite trend to see more of it.\" One of the unit's most high-profile investigations has been into the racism that led Carter to speaking out during England's run to Euro 2025 and stepping away for a time from social media. While two arrests have been announced, Sky News can reveal a third person has been arrested. A fourth suspect has also been identified, and six people overseas are under suspicion. Carter previously told Sky News: \"I wasn't sure I was going to be able to come back on the pitch and be me.\" No one has been charged.  'Slippage' with Musk's X Three cases are pending with Elon Musk's X. And whether it's X or Meta-owned Instagram, there is no agreement on the \"grossly offensive legal threshold\" with policies more tolerable than British law. Mr Roberts said: \"There has been some slippage recently with X that we're working with them to try to get back to those standards. And I think one of the factual issues we sometimes struggle with is our perception of what is clearly a criminal offence. \"They can sometimes suggest that it doesn't meet the threshold for their community guidelines, which I find difficult to reconcile really because surely if it meets the criminal prosecution threshold, surely it should breach [their guidelines], and we sometimes have a wrangle about securing information from them.\" A challenge is dealing with international police forces with two-thirds of referrals of racism generated overseas - beyond the jurisdiction of the football policing unit. While not naming particular countries, Mr Roberts said abuse posted from Eastern Europe and Asia is the main problem. \"The level of interest from some countries varies,\" he said. \"Some just aren't interested. We won't get a response. Others will try and take positive action.\" The approach of English football can seem somewhat disjointed if different campaigns and anti-racism investigations run by different parts of the game. Read more from Sky News:Antoine Semenyo backs jailing abusersFA could boycott social media over racismTennis star denies being racist For Mr Roberts, that could ideally be enhanced. \"I would like a joint function to tackle online hate with ourselves, the football bodies, Kick It Out and others, ideally supported by government, so that we can do it in a really coherent, joined-up way,\" he said in our interview at Cheshire Police HQ. \"I think that would make a massive difference, whether it's education, whether in-stadium hate, whether it's online hate. \"The way we're going to tackle this most effectively is by doing it in a joined-up way where we're mutually supportive. So I think that's something we'd be keen to pursue.\" So would those who have been the target of abuse just for doing what they love - playing football. 'No one wants to talk about this' Kira Rai, a role model for British South Asians in football, said: \"Perhaps there needs to be an overhaul, everyone needs to come together and actually deal with these uncomfortable conversations because they're not necessarily fun conversations that we have. \"No one really wants to talk about this, and I can understand why. For real change, for genuine change to actually occur, you have to have these difficult conversations. \"You have to listen to player stories, to fan stories, to anyone's stories in football, in society, to actually get to the bottom of it.\" And as some players showed last weekend in the Women's Super League, change doesn't come by taking a knee, but taking a stand."
    },
    {
        "title": "Millions of people could each get hundreds of pounds in compensation over car loan mis-selling",
        "description": "Up to 14.2 million people could each receive an average of &#163;700 in compensation due to car loan mis-selling, the financial services regulator has said. ",
        "url": "https://news.sky.com/story/14-million-people-could-get-compensation-of-hundreds-of-pounds-over-car-loan-mis-selling-13446504",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sales-car_6978045.jpg?20250730142252",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-07 12:25:34",
        "Headline": "Consumers lost out on potentially better deals and paid more when lenders did not disclose the commission paid to brokers, the Financial Conduct Authority said.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Up to 14.2 million people could each receive an average of Â£700 in compensation due to car loan mis-selling, the financial services regulator has said.  Nearly half (44%) of all car loan agreements made between April 2007 and November 2024 could be eligible for payouts, the Financial Conduct Authority (FCA) said. Those eligible for the compensation will have had a loan where the broker received commission from a lender. Lenders broke the law by not sharing this fact with consumers, the FCA said, and customers lost out on better deals and sometimes paid more. A scheme is seen by the FCA as the best outcome for consumers and lenders, as it avoids the courts and the Financial Ombudsman Service, therefore minimising delay, uncertainty and administration costs. The scheme will be funded by the dozens of lenders involved in the loans, and cost about Â£8.2bn, on the lower end of expectations, which had been expected to reach as much as Â£18bn. The figure was reached by estimating that 85% of eligible applicants will take part in the scheme. \n                  It's now almost impossible to work your way to riches, says report into growing wealth gap\n                 \n                  Starmer refuses to rule out tax rises as he flies business leaders to India\n                 \n                  Money blog: Massive car finance compensation scheme announced with Â£700 average - here's what to do now\n                 What if you think you're eligible? Anyone who believes they have been impacted should contact their lender and has a year to do so. Compensation will begin to be paid in 2026, with an exact timeline yet to be worked out. The FCA said it would move \"as quickly as we can\".  People who have already complained do not need to take action. Complaints about approximately four million loan agreements have already been received. There's no need to contact a solicitor or claims management firm, the FCA said, as it aimed for the scheme to be as easy as possible. A lender won't have to pay, however, if it can prove the customer could not have got cover anywhere else. The number of people who will get a payout is not known. While there are 14.2 million agreements identified by the FCA, the same person may have taken out more than one loan over the 17-year period. More expensive car loans? Despite the fact many lenders have to contribute to redress, the FCA said the market will continue to function and pointed out the sector has grown in recent years and months. In delivering compensation quickly, the FCA said it \"can ensure that some of the trust and confidence in the market can be repaired\". It could not, however, rule out that the scheme could mean fewer offers and more expensive car loans, but failure to introduce a scheme would have been worse. Read more:UK steel set for further hit as EU to double tariffsIs another spectacular Bitcoin comedown inevitable? The FCA said: \"We cannot rule out some modest impacts on product availability and prices, we estimate the cost of dealing with complaints would be several billion pounds higher in the absence of a redress scheme. \"In that scenario, impacts on access to motor finance and prices for consumers could be significantly higher with uncertainty continuing for many more years.\""
    },
    {
        "title": "Teen and man arrested over reports of cyber attack on children's nurseries",
        "description": "A teenager and a man have been arrested in connection with reports of a cyber attack on a chain of London-based nurseries.",
        "url": "https://news.sky.com/story/teen-and-man-arrested-over-reports-of-cyberattack-on-childrens-nurseries-13446690",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kido-nursery-cyber-attack_7031809.jpg?20251007210930",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-07 19:42:01",
        "Headline": "Cyber hackers were alleged to have used pictures, along with the names of around 8,000 children from the Kido nursery chain, to demand ransom money",
        "Content": "A teenager and a man have been arrested in connection with reports of a cyber attack on a chain of London-based nurseries. The two males, aged 17 and 22, were taken into custody on suspicion of computer misuse as well as blackmail. Cyber hackers were alleged to have used pictures and the names of around 8,000 children from the Kido nursery chain to demand ransom money. The arrests were carried out following a Metropolitan Police operation at a number of properties in Bishop's Stortford in Hertfordshire on Tuesday. The pair remain in custody for questioning, the force said. Information released two weeks ago involved the personal contact details of children who attend the nurseries, as well as their parents and carers.  Will Lyne, the Met Police's head of economic and cyber crime, said specialist investigators have been working \"at pace\" since the attacks took place. \n                  Customer details stolen in Renault UK cyber attack\n                 \n                  Jaguar Land Rover gets Â£1.5bn government-backed loan guarantee to help suppliers after crippling cyber attack\n                 \n                  Harrods customers' details stolen in IT systems breach\n                 \"We understand reports of this nature can cause considerable concern,\" he added, \"especially to those parents and carers who may be worried about the impact of such an incident on them and their families. \"We want to reassure the community and anyone affected that this matter continues to be taken extremely seriously. \"These arrests are a significant step forward in our investigation, but our work continues, alongside our partners, to ensure those responsible are brought to justice.\" Read more from Sky News:Stephen Lawrence's killer begs for family's forgiveness'It is trauma': Two lives torn apart by October 7Denmark proposes social media ban for under-15s A hacking group called Radiant, which claimed it was behind the cyber attack, previously told Sky News they would release the profiles of more children and Kido staff. However, according to The Guardian, the group later appeared to delete the data from a website set up to extort victims after a backlash for targeting children."
    },
    {
        "title": "Starmer refuses to rule out tax rises as he flies business leaders to India",
        "description": "Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-tax-rises-as-he-flies-business-leaders-to-india-13446700",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-heathrow_7045132.jpg?20251007154127",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-07 20:04:02",
        "Headline": "Sir Keir has already turned down the wish of some of the CEOs on the trip to increase the number of visas.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai. The prime minister flew on a plane with dozens of Britain's most prominent business people, including bosses from BA, Barclays, Standard Chartered, BT and Rolls-Royce, for the two-day trip designed to boost ties between the two countries. Follow updates in the Politics Hub Starmer will meet Prime Minister Narendra Modi on Thursday, five months after the UK signed the first trade deal with India since Brexit. The agreement has yet to be implemented, with controversial plans to waive national insurance for workers employed by big Indian businesses sent to the UK still the subject of a forthcoming consultation. Speaking to journalists on the plane on the way out, the prime minister said he was determined to boost ties between the two countries. The trip has been arranged to coincide with the Conservative Party conference, with the first day of meetings coinciding with Kemi Badenoch's speech to activists in Manchester. However, the business delegation is likely to use the trip to lobby the prime minister not to put more taxes on them in the November budget. Sir Keir has already turned down the wish of some CEOs on the trip to increase the number of visas. \"The visa situation hasn't changed with the free trade agreement, and therefore we didn't open up more visas,\" he said. He told business that it wasn't right to focus on visas, telling them: \"The issue is not about visas. It's about business-to-business engagement and investment and jobs and prosperity coming into the United Kingdom.\" The prime minister sidestepped questions about Mr Modi's support of Russian leader Vladimir Putin, whom he wished happy birthday on social media. US President Donald Trump has increased tariffs against India, alleging that Indian purchases of Russian oil are supporting the war in Ukraine. Asked about Mr Modi wishing Mr Putin happy birthday, and whether he had leverage to talk to Mr Modi about his relationship with Russia, Sir Keir sidestepped the question. \"Just for the record, I haven't... sent birthday congratulations to Putin, nor am I going to do so,\" he said. \"I don't suppose that comes as a surprise. In relation to energy, and clamping down on Russian energy, our focus as the UK, and we've been leading on this, is on the shadow fleet, because we think that's the most effective way. We've been one of the lead countries in relation to the shadow fleet, working with other countries.\" PM: We aren't forcing wealthy people out Sir Keir refused to give business leaders any comfort about the budget and tax hikes, despite saying in his conference speech he recognised the last budget had an impact. \"What I acknowledged in my conference, and I've acknowledged a number of times now, is we asked a lot of business in the last budget. It's important that I acknowledge that, and I also said that that had helped us with growth and stabilising the economy,\" he added. \"I'm not going to make any comment about the forthcoming budget, as you would expect; no prime minister or chancellor ever does.\" Asked if too many wealthy people were leaving London, he said: \"No. We keep a careful eye on the figures, as you would expect. \"The measures that we took at the last budget are bringing a considerable amount of revenue into the government which is being used to fix things like the NHS. We keep a careful eye on the figures.\""
    },
    {
        "title": "Tetchy Badenoch criticised me for asking hard questions - but leadership challenge talk won't go away",
        "description": "In the 11 months since Kemi Badenoch has become party leader, the Conservative Party has dropped from 26% to 17% in the polls.",
        "url": "https://news.sky.com/story/badenoch-positively-looking-for-a-fight-as-tories-seek-relevance-13446659",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-beth-rigby-kemi-badenoch_7045370.jpg?20251007195318",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-07 18:30:03",
        "Headline": "The Tory leader may not like being asked about Reform, might - in her words - not be interested in Reform, but her former voters, and the country, are.",
        "Content": "\n          Political editor\n              @BethRigby\n  In the 11 months since Kemi Badenoch has become party leader, the Conservative Party has dropped from 26% to 17% in the polls. It has lost nearly 700 council seats, 16 councils, while 18 senior Tories have defected, including one of the party's great thinkers, Danny Kruger. Politics Live: Tory councillors defect to Reform Her personal poll rating, minus 47, is worse than the lowest ebb of Iain Duncan Smith's fated leadership and worse than when Boris Johnson resigned. To rub salt into the wounds, a Sky News/YouGov poll this week found that the majority of Tory members think Robert Jenrick should be the leader, while half don't think she should lead them into the next general election. Being leader of the Opposition is often described as the hardest job in politics, but for Badenoch, with Reform stealing the march as the party of the right, it looks pretty much impossible. For someone who needs to try to win people over, Badenoch has a curious style. She likes to be known as a leader who isn't afraid of a fight and, at times, she approached our interview at the Conservative Party conference as if she was positively looking for one. \n                  Lord Heseltine attacks Badenoch's new policies - and calls Farage a 'phoney'\n                 \n                  Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'\n                 \n                  Robert Jenrick says Kemi Badenoch is 'right person' to lead party - despite poll\n                 A few times in our interview when I asked her a question she didn't like, or didn't want to answer (it is my job to ask all politicians hard questions), she seemed tetchy. And when I deigned to ask her whether she admired Nigel Farage, she criticised me for asking the question. She asked why I was not asking her if she admires Sir Keir Starmer or Sir Ed Davey. Her approach surprised me, as I had asked the prime minister exactly the same question a week before. He'd answered it directly, without arguing over why I had asked it: \"I think he is a formidable politician,\" said Sir Keir. Badenoch told me she didn't understand the question, and then told me she wasn't interested in talking about him. It made for an awkward, ill-tempered exchange. The facts remain that Farage is topping the polls, helped by Labour's collapsing support and the Conservatives' deep unpopularity. And in the run-up to our interview, Reform drip-fed the news that 20 Tory councillors were defecting to Farage's party. There is open talk in Badenoch's party about whether the Tories will need to try to come to some sort of agreement with Reform at the next election to try to see off Labour and 'progressive parties'. Farage says absolutely not, as does Badenoch - but many in her party do not think she has that luxury. Andrew Rosindell, MP for Romford, told GB News he'll lose his seat unless the two sides \"work together\" and said the right must unite to defeat the left. Arch-rival Robert Jenrick pointedly refuses to rule it out, saying only it's \"not the priority\". Meanwhile, party members support an electoral pact by two to one, according to our Sky News poll. On the matter of whether these MPs, and party members, have a point, Badenoch bristled: \"It is important that people know what we stand for. Robert Jenrick is not the leader of the Conservative Party, neither is Andrew Rossindell. I am the leader of the party and we are not having a coalition or a pact with Reform.\" Read More:Jaunty Jenrick: a leader's speech in all but nameKemi Badenoch praises Thatcher but faces fight with grandees When I ask colleagues if they think Badenoch is too aloof, too argumentative, too abrasive to lead this rebuild, the popular refrain for her supporters is that she is \"a work in progress\" and that it would be madness to change the leader again. The question is, will she be given the time to develop? The plot to oust her is active and much of the chatter around this conference is whether she might be challenged before or after the May local elections. There are some colleagues who believe it is better to give her more time to turn things around and, if May is truly dreadful and the party goes further backwards, remove her then. Ahead of conference, when asked by Tim Shipman of the Spectator whether she would resign if the Conservatives go backwards in May, she said rather cryptically \"ask me after the locals\". When I asked Badenoch why she said that she replied, \"let's see what the election result is about\". When I explained that it sounded rather like she might throw in the towel after next May and so was seeking clarification, she told me that I was asking irrelevant questions. \"Your viewers want to know how their lives are going to be better. Not be inside the Westminster bubble politics of who's up, who's down... It's part of the reason why the country is in this mess. Perhaps if people had scrutinised Labour's policies instead of looking at just poll ratings, they would be running the country better.\" But Tories are looking at poll ratings and there is a view from some in the party that if the Tories wait until another drubbing in the May local, Scottish and Welsh elections, there might not be much of a party apparatus left to rebuild from. In short, there is not a settled view on when a challenge might come, but with the party in the position it is in, talk of a challenge will not go away. Badenoch wants to make the case that her \"authentic conservatism\" is worth sticking with and that the policies the Conservatives are announcing will give them a pathway back. On borders, the Tories are trying to neutralise Reform with a very similar offer. On the economy and welfare cuts, they hope they can beat Labour and Reform. But really, the question about this party and this leader is about relevance. The prime minister didn't even bother to name check Badenoch in his conference speech, while Davey trained his guns on Farage rather than his traditional Tory rival. Badenoch may not like being asked about Reform, might - in her words - not be interested in Reform, but her former voters, and the country, are. The enormous challenge for her in the coming months is to see if she can get them to look at her."
    },
    {
        "title": "'Who's going to protect us?': Ex-wife of man injured in Manchester synagogue attack says he no longer wants to live in UK",
        "description": "The man injured by a police bullet in the Manchester synagogue attack feels so unsafe he no longer wants to live in this country, his ex-wife has told Sky News.&#160;",
        "url": "https://news.sky.com/story/whos-going-to-protect-us-ex-wife-of-man-injured-in-manchester-synagogue-attack-says-he-no-longer-wants-to-live-in-uk-13446570",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-naomi-finlay-yoni-finlay_7045188.jpg?20251007165447",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-10-07 15:40:27",
        "Headline": "Yoni Finlay has been in hospital since the attack on the synagogue in Heaton Park last week, after being injured by a police bullet. His ex-wife Naomi Finley says \"he definitely does not feel safe in this country - and he's questioning his future here\".",
        "Content": "\n          North of England correspondent\n        The man injured by a police bullet in the Manchester synagogue attack feels so unsafe he no longer wants to live in this country, his ex-wife has told Sky News.Â  Along with their children, Naomi Finlay has been visiting Yoni Finlay in hospital since the attack last week. She said he was \"shocked\" to hear about the level of antisemitism she and their children had been facing before the synagogue was targeted. \"When I went to see him in the hospital, I spoke to him about some of the antisemitism we'd faced personally,\" Mrs Finlay said. \"Some of the things I hadn't discussed with him before, and he didn't know. And he was really, really upset for me and the children that this is what we've been through. \"He expressed that he definitely does not feel safe in this country - and he's questioning his future here.\" Ms Finlay told Sky News that she and her children have faced threats and abuse, some reported to the police. \"We've been shouted at, the kids have been shouted at,\" she said. \"My son, his biggest fear is being recognised as Jewish. The second he leaves the synagogue, the kippah comes off his head. \"On October the 7th, two years ago, someone tried to knock my brother over while he was walking back from the synagogue.\" 'It's something you've been waiting for' Ms Finlay added that although the attack on the Heaton Park synagogue was a shock, as her family had been living on \"constant alert\", it did not come as a surprise. \"The second I heard something, I knew absolutely - I knew what it was,\" she added. \"There's no doubt in your mind. Because it's something, yes, you've been waiting for - but anticipating with dread.\" It took hours before Ms Finlay was able to find out from a family member who was also at the synagogue that Yoni had been injured but was still alive. \"We live close to the synagogue - we saw and heard everything,\" she said. \"The beginning of the day - where we are just on the streets asking anyone, 'Have you seen him? Have you seen him?' - that was definitely the hardest part. \"It was so difficult for the kids, because that's their dad.\" Read more about the synagogue attack:Friends of attacker reveal how he became radicalisedMan who helped barricade says attacker was 'monster'Shapps: My father-in-law was at synagogue attack Yoni was among those barricading the doors to stop the attacker, Jihad al Shamie, from getting inside the synagogue. Al Shamie was shot and killed by police, but one of their bullets came through the synagogue door - striking Yoni and killing Adrian Daulby, one of the two men who lost their lives. Yoni was in surgery for seven hours on the day of the attack. Ms Finlay added he \"remembers everything\", including the moment the bullet struck. Although she said he is still in a lot of pain, he is now stable and recovering. \"The kids have been taking him some treats,\" she said, \"saving him half of their chocolate bars and taking them into him. \"Things from school, letters from friends they've been taking in to show him. They are just really wanting him back.\" 'Who's going to protect us?' Two years to the day since the 7 October terror attack in Israel, Ms Finlay finds it \"really hurtful\" that pro-Palestine marches are taking place across the country, less than a week on from the attack in which Yoni was injured. \"It was just that little bit further away - and now it's not further away,\" she said. \"Even today there's protests going on - on one of the saddest days for Jewish people worldwide. \"I feel like we can't even get a break on that one day to actually grieve and process our feelings.\" Although she said the police have been \"amazing\" since the attack, she worries about what will happen to her and her family when the attention dies down. \"We worry that in a few weeks, when all this simmers down, are we still going to feel reassured? Are we still going to be protected? \"You know, who's going to look after our kids when they're in school? Who's going to look after us when we go pray in the synagogue? Who's going to protect us?\""
    },
    {
        "title": "Scientists develop first-ever blood test to diagnose chronic fatigue syndrome",
        "description": "A new blood test can diagnose chronic fatigue syndrome, also known as CFS or ME, with an accuracy of 96%, according to scientists who developed it.",
        "url": "https://news.sky.com/story/scientists-develop-first-ever-blood-test-to-diagnose-chronic-fatigue-syndrome-13446510",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-fatigue-tired-woman_7045495.jpg?20251008004738",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-07 12:34:17",
        "Headline": "CFS is a disabling illness characterised by extreme fatigue that is not relieved by rest.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A new blood test can diagnose chronic fatigue syndrome, also known as CFS or ME, with an accuracy of 96%, according to scientists who developed it. The researchers, from the University of East Anglia, hope the breakthrough could pave the way for a similar test to diagnose long COVID. But other scientists warn the test needs to be independently validated in further clinical studies before being offered privately to patients who may be desperate to understand their debilitating symptoms. CFS is a disabling illness characterised by extreme fatigue that is not relieved by rest. Around 400,000 people in the UK have the condition, but its cause and treatment has been controversial. Professor Dmitry Pshezhetskiy, lead researcher, said: \"We know that some patients report being ignored or even told that their illness is 'all in their head'. \"With no definitive tests, many patients have gone undiagnosed or misdiagnosed for years. \"Our discovery offers the potential for a simple, accurate blood test to help confirm a diagnosis, which could lead to earlier support and more effective management.\" The researchers used technology developed by biotech company Oxford BioDynamics to analyse how DNA is folded in blood samples taken from 47 patients with severe symptoms and 61 people who were healthy. Each of our cells contain about two metres of DNA, which is tightly packed and folded millions of times. The folds aren't random - they help turn genes on or off. The folding and 3D structure of the genetic material isn't determined by the DNA code which we are born with and is largely fixed. Instead, life events can influence the folding, and which genes are active, a mechanism called \"epigenetics\". The researchers found people with CFS had a unique pattern in epigenetic markers, or chemical tags, on their DNA. Read more tech news:Almost 15 million teens using vapesAre Bitcoin's record highs sustainable?Robin Williams's daughter hits out at AI videos of him A test based on the pattern was able to identify 92% of people with CFS and 98% of those who were healthy. The overall accuracy was 96%. \"This is a significant step forward,\" said Prof Pshezhetskiy. \"For the first time, we have a simple blood test that can reliably identify ME/CFS - potentially transforming how we diagnose and manage this complex disease. \"Post-COVID syndrome, commonly referred to as long COVID, is one example of ME/CFS, where a similar cluster of symptoms is triggered by the COVID-19 virus, rather than by other known causes such as glandular fever. \"We therefore hope that our research will also help pave the way for a similar test to accurately diagnose long COVID.\" The study has been published in the Journal of Translational Medicine. Test 'likely' to be pricey Prof Chris Ponting, from the University of Edinburgh, who wasn't involved in the research, said the claims were premature because there were significant differences in sex, age and other factors between the people with CFS and the healthy controls. \"This test needs to be fully validated in better designed and independent studies before it is considered for clinical application,\" he said. \"Even if validated, the test will be expensive, likely around Â£1,000.\""
    },
    {
        "title": "Robert Jenrick urged to apologise for 'disgraceful' integration comments ",
        "description": "Robert Jenrick should apologise for his \"disgraceful comments\" bemoaning the lack of visible white faces in a part of Birmingham, the Mayor of the West Midlands has said.",
        "url": "https://news.sky.com/story/robert-jenrick-urged-to-apologise-for-disgraceful-integration-comments-13446669",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-robert-jenrick-conservative_7044862.jpg?20251007120038",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-07 19:00:21",
        "Headline": "Labour's Mayor of the West Midlands Richard Parker says Mr Jenrick's comments about Handsworth in Birmingham are not accurate and risk stoking division.",
        "Content": " Robert Jenrick should apologise for his \"disgraceful comments\" bemoaning the lack of visible white faces in a part of Birmingham, the Mayor of the West Midlands has said. Richard Parker told Sky News' The UK Tonight with Sarah-Jane Mee he was \"shocked and truly appalled\" by what the shadow justice secretary said about integration in Handsworth. In a recording from March obtained by The Guardian, Mr Jenrick said that the inner-city area \"was one of the worst integrated places I've ever been to\" and that \"in the hour and a half I was filming news there I didn't see another white face\". Mr Parker, a Labour mayor, told Sky News: \"I thought they were disgraceful comments. \"They're really damaging comments about, you know, one of the great communities in Birmingham, in Handsworth, a community that is vibrant, is very welcoming, very hospitable, and full of generosity.\" Mr Jenrick doubled down on his comments on Tuesday, saying he would not \"shy away\" from issues of integration.  'I'm shocked and truly appalled' But Mr Parker said it was not an accurate reflection of Handsworth as he called on the senior Tory MP and Conservative leader Kemi Badenoch to apologise. He said: \"I'm shocked and truly appalled. He doesn't know Handsworth. If he wanted to know Handsworth, he could have reached out to me, and I could have shown him around and introduced him to the people there, the great people that run businesses I know there, and some of the great community groups I know there.\" He added: \"He used the colour of people's skins to make really divisive and negative comments about Handsworth, and it's wrong, and it's also wrong that a politician, a senior politician of a mainstream party, makes comments like this and then reiterates them, with no apology. \"I believe Robert Jenrick, and the leader of the Conservative Party, owe the people of Birmingham and the people in the communities of Handsworth an apology.\" Read more:Jaunty Jenrick: A leader's speech in all but nameBadenoch praises Thatcher but faces fight with grandees Mr Jenrick was in Handsworth to film a video about litter and fly tipping for GB News. His words were recorded during a dinner at the Aldridge-Brownhills Conservative Association dinner on 14 March, The Guardian said. According to the paper, he called the litter \"appalling\" and said Handsworth was \"as as close as I've come to a slum in this country\". He added: \"The other thing I noticed there was that it was one of the worst integrated places I've ever been to. In fact, in the hour and a half I was filming news there, I didn't see another white face. \"That's not the kind of country I want to live in. I want to live in a country where people are properly integrated. It's not about the colour of your skin or your faith, of course it isn't. But I want people to be living alongside each other, not parallel lives. That's not the right way we want to live as a country.\" The comments have also been criticised by the Bishop of Birmingham, the Right Reverend Michael Volland. In a letter to Mr Jenrick published on Tuesday and co-signed by a number of community leaders, he said the comments \"can feed into a harmful narrative that provides fuel for a fire of toxic nationalism\". Jenrick: It was an observation Former Tory mayor Andy Street has also said Mr Jenrick was \"wrong\" about Handsworth, while the Labour Party said his comments \"cross a red line\". However, Mr Jenrick stood by what he said on Tuesday, telling the Telegraph's Daily T podcast \"I didn't see a mix of people on the streets. It was an observation\". Asked if he had any regrets about his comments, he earlier told BBC Radio 5 Live: \"No, not at all and I won't shy away from these issues.\" Ms Badenoch also defended her shadow minister, telling BBC Breakfast he had made a \"factual statement\". She said: \"If he said he didn't see another white face, he might have been making an observation. There's nothing wrong with making observations. \"But what he and I both agree with is that there are not enough people integrating. There are many people who are creating separate communities.\""
    },
    {
        "title": "Trump optimistic about Gaza peace deal - as Israelis mark October 7 anniversary",
        "description": "Donald Trump has expressed optimism about ceasefire talks between Israel and Hamas, as&#160;Israelis mourned those killed two years after the&#160;October 7 attacks.",
        "url": "https://news.sky.com/story/trump-optimistic-about-gaza-peace-deal-as-israelis-mark-october-7-anniversary-13446713",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-us_7045496.jpg?20251008005414",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-07 20:25:36",
        "Headline": "On the second anniversary of Hamas's attack on Israel that triggered the Gaza war, the US president expressed optimism about progress towards a ceasefire deal.",
        "Content": " Donald Trump has expressed optimism about ceasefire talks between Israel and Hamas, asÂ Israelis mourned those killed two years after theÂ October 7 attacks. The US president described the negotiations as \"very serious\", adding: \"I think there's a possibility we could have peace in the Middle East\". Latest updates from the war in Gaza One of the key mediators, Qatar's prime minister, along with senior American diplomats Steve Witkoff and Jared Kushner, will now head to Egypt to join the third day of indirect negotiations between the Palestinian militant group and Israel. Memorial events took place around the world on Tuesday, including in Israel, as grieving families gathered and relatives hoped a ceasefire deal could see the remaining hostages freed. It has been two years since thousands of Hamas-led militants poured into southern Israel after a surprise barrage of rockets. They stormed army bases, farming communities and the outdoor Nova music festival, killing some 1,200 people, mostly civilians, including women, children and older adults. The attack plunged the region into a devastating war, including a brutal retaliatory offensive by Israel on Gaza that has left tens of thousands of people dead, turned entire towns and cities to rubble, triggered a widespread famine and displaced around 90% of the population. Hamas abducted 251 others, most of whom have since been released in ceasefires or other deals, with 48 hostages remaining inside Gaza, around 20 of them believed by Israel to be alive.  Israel mourns October 7 victims In Tel Aviv, dozens gathered at a memorial site that was set up in a city square. Others visited the scene of the Nova music festival in the border community of Reim, where nearly 400 Israelis were killed and where portraits of the kidnapped and dead have been erected. Thousands of people visited throughout the day to share memories of relatives and friends who were killed. Pro-Palestinian rallies, opposing Israel's actions in Gaza, were also held in several European cities including Paris, Geneva, Athens, Istanbul, Stockholm, and London. Sir Keir Starmer labelled the UK protests as \"un-British\" and said they showed a lack of respect.  Hamas wants 'guarantees' On the second day of talks, top Hamas leader Khalil Al-Hayya told Egyptian state-affiliated Al Qahera News TV the group had come \"to engage in serious and responsible negotiations\". He said Hamas was ready to reach a deal, yet it needed a \"guarantee\" to end the war and ensure \"it is not repeated\". US officials have suggested the talks should initially focus on the first phase: halting the fighting and working out logistics for the release of hostages and Palestinian prisoners. Read more from Sky News:Two lives torn apart by the Hamas attackTrump's Gaza peace plan explainedIsraelis and Palestinians grieve two years on A spokesperson for Prime Minister Sheikh Mohammed bin Abdulrahman al-Thani of Qatar said he would attend the talks in Sharm el-Sheikh \"with the aim of pushing forward the Gaza ceasefire plan and hostage release agreement\". ðŸ‘‰Listen to The World with Richard Engel and Yalda Hakim on your podcast appðŸ‘ˆ The failure by Hamas to return hostages has left Israel deeply divided, with weekly mass protests against Israeli Prime Minister Benjamin Netanyahu. It has also left Israel more isolated internationally than it has been in decades.  The war has already killed over 67,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not say how many were civilians or combatants. Experts and major rights groups have accused Israel of genocide - something Israel vehemently denies. The International Criminal Court is seeking the arrest of Mr Netanyahu and his former defence minister for allegedly using starvation as a method of war."
    },
    {
        "title": "October 7 anniversary: 'Instead of getting married, they got buried together'",
        "description": "There are families wearing T-shirts picturing their loved ones and friends holding plant pots and flowers.",
        "url": "https://news.sky.com/story/october-7-anniversary-instead-of-getting-married-they-got-buried-together-13446462",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-israel-hamas-october-7_7044893.jpg?20251007122202",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-10-07 11:10:05",
        "Headline": "A ceremony has been taking place marking the two-year anniversary of the October 7 attack.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  There are families wearing T-shirts picturing their loved ones and friends holding plant pots and flowers. There is music but it's a muted tone, where memories are being shared by families of those who were killed in the October 7 massacre. October 7 anniversary latest: Families demand answers I find Michal Bitton standing by two photographs of Maya Bitton and Eliran Mizrahi. She wants to tell me the love story between her daughter and her daughter's boyfriend. Michal recalls Eliran sat her and her husband down to say: \"I want to marry your daughter and I want your permission.\" Maya called her mum on the morning of October 7 from the Nova music festival to tell her \"many terrorists\" were around. Eliran texted Michal, saying: \"Don't worry, we will be strong.\" Both of them were later found wrapped in each other's arms. Michal told me: \"Instead of getting married, they got buried together.\"  Read more:Two lives torn apart by October 7 attackNetanyahu learning limits of what military power can achieve Later, an elderly father slowly walks up to me. His son, Sergeant Major Alon Barad, was also killed on duty as a police officer. He showed me videos of his son in action on that morning. Alon was finishing a night shift at the Nova music festival when he realised the severity of the situation. Along with other police officers, they closed off an entrance to the site to ensure festivalgoers could escape safely. Alon and seven other police officers successfully evacuated more than 1,500 people."
    },
    {
        "title": "German mayor Iris Stalzer 'fighting for her life' after being stabbed in Herdecke",
        "description": "The incoming mayor of a German town is said to be fighting for her life after being stabbed multiple times.",
        "url": "https://news.sky.com/story/german-mayor-iris-stalzer-fighting-for-her-life-after-being-stabbed-in-herdecke-13446560",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-iris-stalzer-germany_7045177.jpg?20251007162836",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-07 15:06:01",
        "Headline": "Chancellor Friedrich Merz says they are fears for the 57-year-old's life after the stabbing, which comes just over a week after she was elected.",
        "Content": "The incoming mayor of a German town is said to be fighting for her life after being stabbed multiple times. Iris Stalzer is due to take office next month in Herdecke, in the Ruhr region, after being elected on 28 September. Details of Tuesday's incident are still emerging but it appears to have been a ferocious daytime attack. Her 15-year-old adopted son told police his mother had been attacked on the street by several men, according to Bild. Westfalenpost said the politician had been stabbed 13 times but managed to drag herself back to her flat - where her 17-year-old daughter was also reportedly home. Broadcaster WDR said the attacker was still on the run, while other reports said her son was led away in handcuffs. \"We have received news of a terrible deed in Herdecke,\" Chancellor Friedrich Merz wrote on social media. \n                  Germany should 'get power to shoot down drones', official says - as Vladimir Putin denies involvement in airspace violations\n                 \n                  Oktoberfest opening delayed in Munich after bomb threat\n                 \n                  Former assistant to AfD politician found guilty of Chinese spy charges\n                 \"It must be swiftly investigated. We fear for the life of the mayor-designate and hope for her full recovery.\" There was a large police presence in the town of about 23,000 after the incident, with a helicopter landing nearby to take the 57-year-old to hospital. A security source later told Reuters she was in a critical condition. Ms Stalzer - an employment lawyer - is part of the centre-left Social Democrats and beat a centre-right Christian Democrat candidate to secure her new job. It's not the first time politicians have been viciously attacked in Germany. In 2019, conservative local government president Walter Luebcke was shot dead by a far-right activist as he smoked on his terrace at home. Four years before, Henriette Reker was stabbed the day before she was elected as Cologne's mayor. The attacker was also a far-right extremist, but Ms Reker recovered and is due to leave office this year. A recent study said 60% of politicians in Germany had experienced violence at least once, with one in five saying it's made them more hesitant to appear in public."
    },
    {
        "title": "Nobel Prize winner learnt of award off-grid - and thought his startled wife had seen a bear",
        "description": "After hearing his wife scream while hiking, American scientist Fred Ramsdell thought she spotted a grizzly bear. ",
        "url": "https://news.sky.com/story/nobel-prize-winner-learnt-of-award-off-grid-and-thought-his-startled-wife-had-seen-a-bear-13446543",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sonoma-biotherapeutics_7045166.jpg?20251007161859",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-07 14:27:56",
        "Headline": "Scientist Fred Ramsdell, along with Mary Brunkow and Shimon Sakaguchi, won the Nobel Prize in Physiology or Medicine for his work onÂ how the immune system spares healthy cells.",
        "Content": "After hearing his wife scream while hiking, American scientist Fred Ramsdell thought she spotted a grizzly bear.  But, having just switched on her phone, she had discovered he had won the Nobel Prize in Physiology or Medicine, one of the most coveted prizes in science. Mr Ramsdell won the medicine award on Monday, along with American scientist Mary Brunkow and Shimon Sakaguchi from Japan, for their work on how the immune system spares healthy cells. However, the Nobel Assembly were unable to reach Mr Ramsdell and his wife as they were off-grid in the backcountry of Wyoming. Thomas Perlmann, secretary-general of the Nobel Assembly at the awarding body Karolinska Institute, said it took until Tuesday morning to reach them. He shared that the couple were walking back to their hotel when they stopped to fix something on their car, and she switched on her cell phone and saw the messages. \"They were still in the wild and there are plenty of grizzly bears there, so he was quite worried when she let out a yell,\" Mr Perlmann told Reuters. \n                  British scientist among Nobel prize winners for quantum research\n                 \n                  Nobel Prize committee unable to reach winner as he's 'hiking off-grid'\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 \"Fortunately, it was the Nobel Prize. He was very happy and elated and had not expected the prize at all.\" Mr Ramsdell, Ms Brunknow, and Mr Sakaguchi's discoveries relate to peripheral immune tolerance and could create openings for new autoimmune disease and cancer treatments. Read more from Sky News:'It is trauma': Two lives torn apart by October 7Stranded Mount Everest hikers being evacuated Marie Wahren-Herlenius, a rheumatology professor at Sweden's Karolinska Institute, explained their work as \"how we keep our immune system under control so we can fight all imaginable microbes and still avoid autoimmune disease\". The institute said all three laureates brought to the fore so-called regulatory T cells, a class of white blood cells that act as the immune system's security guards that keep immune cells from attacking the body. It's not the first time that Nobel Prize announcements haven't gone smoothly: Bob Dylan became the first musician ever to be awarded the prize in literature, and ended up ignoring it for weeks. When he did break his silence, he said he was \"speechless\". And in 2011, Canadian immunologist Ralph M Steinman was awarded one half of the Nobel Prize in Physiology or Medicine - three days after he died of pancreatic cancer."
    },
    {
        "title": "Stranded Mount Everest hikers being evacuated",
        "description": "More than 200 people left stranded by a blizzard near the eastern face of Mount Everest are being evacuated, Reuters news agency reports.",
        "url": "https://news.sky.com/story/stranded-mount-everest-hikers-being-evacuated-13446285",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-everest-tibet_7044551.jpg?20251007041551",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-07 03:02:22",
        "Headline": "This time of year is a popular one for hiking around Everest, given the weather should stay relatively clear. But unusually heavy snowfall and rain made for treacherous conditions that left hundreds of hikers needing assistance.",
        "Content": " More than 200 people left stranded by a blizzard near the eastern face of Mount Everest are being evacuated, Reuters news agency reports. It comes after some 350 trekkers were guided to safety during an initial rescue operation, which was launched after unusually heavy snowfall and rain struck the Himalayas on Friday and Saturday. A source with knowledge of the situation told Reuters the evacuation should be completed on Tuesday, though the Tibetan regional government did not have an immediate comment. Those rescued so far have been escorted to the small town of Qudang, which is about 30 miles from base camp on Everest's Tibetan side. October is a popular time for hikers attempting to climb Everest - the highest mountain on Earth. Skies are usually clear following the end of the Indian monsoon season, making the weekend's rainfall unusual. Chen Geshuang, who was part of an 18-strong team that safely got to Qudang, said: \"It was so wet and cold in the mountains, and hypothermia was a real risk. \"The weather this year is not normal. The guide said he had never encountered such weather in October. And it happened all too suddenly.\" Read more from Sky News:Two lives torn apart by October 7Is a Bitcoin comedown inevitable? Eric Wen, another trekker who survived the ordeal, said: \"It was raining and snowing every day, and we did not see Everest at all.\" Recent days have been particularly busy around the Karma valley leading to Everest's eastern face, Kangshung, spurred by a national holiday in China. The valley is a relatively pristine part of the region, boasting lush vegetation and untouched alpine forests."
    },
    {
        "title": "Denmark proposes social media ban for under-15s - as PM hits out at 'monster'",
        "description": "The Danish government is proposing a ban on several social media apps for under-15s, according to the country's prime minister.",
        "url": "https://news.sky.com/story/denmark-proposes-social-media-ban-for-under-15s-as-pm-hits-out-at-monster-13446546",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mette-frederiksen-denmark_7045129.jpg?20251007153929",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-07 14:34:01",
        "Headline": "Earlier this year, the Danish government announced it would ban mobile phones in schools and after-school clubs.",
        "Content": "\n          Science and technology reporter\n       The Danish government is proposing a ban on several social media apps for under-15s, according to the country's prime minister. \"We have unleashed a monster,\" Mette Frederiksen told Denmark's parliament on Tuesday. \"Mobile phones and social media are stealing our children's childhood.\" Research published by Denmark's wellbeing commission earlier this year found 94% of the country's young people had a social media profile before they turned 13 - despite that being the minimum age for many social media platforms. It also found nine to 14-year-olds were spending an average of three hours a day on TikTok and YouTube. Ms Frederiksen did not give details on how a ban would be enforced - an issue Australia is grappling with - but there is some public support for her proposal. In 2024, 50,000 people in Denmark signed a petition calling for a ban on TikTok, Snapchat and Instagram. \n                  Online safety laws to be toughened to make blocking of self-harm content a legal requirement\n                 \n                  Fake celebrity chatbots among those sending harmful content to children 'every five minutes'\n                 \n                  Hate speech, harassment and free speech: What you can't say online\n                 Parents should be able to give permission for their children to have accounts from the age of 13, according to Ms Frederiksen. Earlier this year, the Danish government also announced it would ban mobile phones in schools and after-school clubs, meaning that almost all children aged between seven and 16-17 will be required by law not to bring their phones into school.  Read more technology news:Bitcoin's price at record highs. Is it sustainable?Actor's daughter begs people to stop sending AI videos of himAlmost 15 million teens use vapes globally - report Denmark's restrictions follow similar moves around the world. In the UK, internet and social media companies now face fines of up to 10% of revenue if they allow young users to see harmful content, under sweeping legislation where age restrictions were placed on adult content.  The UK government has also refused to rule out an all-out ban on under-16s on social media. In Australia, under-16s will be banned from December, with the logistics of the ban currently being worked out. A recent study showed that a similar system to the UK's age verification could enforce the ban in the country. In France, a parliamentary commission recommended last month that children under 15 should be banned from social media in the country and there should be an overnight \"digital curfew\" for 15-18 year olds."
    },
    {
        "title": "Three people critical after helicopter crash in California",
        "description": "Three people have been critically injured after a helicopter crash in Sacramento, according to the Californian city's fire&#160;department.",
        "url": "https://news.sky.com/story/three-people-critical-after-helicopter-crash-in-california-13446288",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sacramento-helicopter_7044561.jpg?20251007053318",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-07 03:41:00",
        "Headline": "A pilot, nurse and paramedic were on board the aircraft when it came down on to a road.",
        "Content": " Three people have been critically injured after a helicopter crash in Sacramento, according to the Californian city's fireÂ department. Images from the scene show a medical helicopter lying upside down on the eastbound lanes of Highway 50. The helicopter had taken a patient to hospital and was returning to the place from which it had been dispatched when it experienced an \"in-air emergency\" just after 7pm local time (3am UK time), according to Captain Justin Sylvia, from the Sacramento Fire Department. He said there were a pilot, nurse and paramedic on board at the time of the crash, who were taken to hospital in a \"critical condition\". Mr Sylvia said the crew consisted of two women and one man. One of the women was trapped underneath the helicopter, with civilians on the highway helping the fire department to lift part of the helicopter out of the way to free the victim and get her into an ambulance. \"It took every ounce of approximately 15 people to move that aircraft up just enough to get her out,\" Mr Sylvia said at a news conference. He added: \"There's a pretty large debris field around that at this point. The lucky portion for us, I'd say, is the fact that the helicopter did not catch on fire.\" No vehicles were involved in the crash and no one on the highway was injured, Mr Sylvia said, adding that this was \"mind-blowing\" given that the helicopter crashed in the centre of the road. \"People reported that they basically saw the helicopter kind of going down quickly, so all the traffic slowed down,\" he explained. Sacramento City councilwoman Lisa Kaplan was with local law enforcement responding to the crash. She described plumes of white smoke coming out of the crashed helicopter. \"It's really sombering and sobering. I am up flying with sheriff pilots that do this day in and day out. And it really makes you grateful for every day and grateful for our officers and our medical pilots,\" she said. The road is expected to be closed for an extended time, according to Officer Michael Harper, a spokesman for the California Highway Patrol. \"The cause of the crash is still under investigation,\" his colleague, Officer Mike Carillo, added. Read more from Sky News:US Supreme Court rejects Maxwell's appeal requestIs another spectacular Bitcoin comedown inevitable? The helicopter appears to belong to REACH Air Medical Services, which confirmed to ABC7 that three of its crew were hurt in the crash. The Federal Aviation Administration did not immediately respond to a Reuters request for comment."
    },
    {
        "title": "Starmer refuses to rule out tax rises as he flies business leaders to India",
        "description": "Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-tax-rises-as-he-flies-business-leaders-to-india-13446700",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-heathrow_7045132.jpg?20251007154127",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-10-07 20:04:02",
        "Headline": "Sir Keir has already turned down the wish of some of the CEOs on the trip to increase the number of visas.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai. The prime minister flew on a plane with dozens of Britain's most prominent business people, including bosses from BA, Barclays, Standard Chartered, BT and Rolls-Royce, for the two-day trip designed to boost ties between the two countries. Follow updates in the Politics Hub Starmer will meet Prime Minister Narendra Modi on Thursday, five months after the UK signed the first trade deal with India since Brexit. The agreement has yet to be implemented, with controversial plans to waive national insurance for workers employed by big Indian businesses sent to the UK still the subject of a forthcoming consultation. Speaking to journalists on the plane on the way out, the prime minister said he was determined to boost ties between the two countries. The trip has been arranged to coincide with the Conservative Party conference, with the first day of meetings coinciding with Kemi Badenoch's speech to activists in Manchester. However, the business delegation is likely to use the trip to lobby the prime minister not to put more taxes on them in the November budget. Sir Keir has already turned down the wish of some CEOs on the trip to increase the number of visas. \"The visa situation hasn't changed with the free trade agreement, and therefore we didn't open up more visas,\" he said. He told business that it wasn't right to focus on visas, telling them: \"The issue is not about visas. It's about business-to-business engagement and investment and jobs and prosperity coming into the United Kingdom.\" The prime minister sidestepped questions about Mr Modi's support of Russian leader Vladimir Putin, whom he wished happy birthday on social media. US President Donald Trump has increased tariffs against India, alleging that Indian purchases of Russian oil are supporting the war in Ukraine. Asked about Mr Modi wishing Mr Putin happy birthday, and whether he had leverage to talk to Mr Modi about his relationship with Russia, Sir Keir sidestepped the question. \"Just for the record, I haven't... sent birthday congratulations to Putin, nor am I going to do so,\" he said. \"I don't suppose that comes as a surprise. In relation to energy, and clamping down on Russian energy, our focus as the UK, and we've been leading on this, is on the shadow fleet, because we think that's the most effective way. We've been one of the lead countries in relation to the shadow fleet, working with other countries.\" PM: We aren't forcing wealthy people out Sir Keir refused to give business leaders any comfort about the budget and tax hikes, despite saying in his conference speech he recognised the last budget had an impact. \"What I acknowledged in my conference, and I've acknowledged a number of times now, is we asked a lot of business in the last budget. It's important that I acknowledge that, and I also said that that had helped us with growth and stabilising the economy,\" he added. \"I'm not going to make any comment about the forthcoming budget, as you would expect; no prime minister or chancellor ever does.\" Asked if too many wealthy people were leaving London, he said: \"No. We keep a careful eye on the figures, as you would expect. \"The measures that we took at the last budget are bringing a considerable amount of revenue into the government which is being used to fix things like the NHS. We keep a careful eye on the figures.\""
    },
    {
        "title": "Millions of people could each get hundreds of pounds in compensation over car loan mis-selling",
        "description": "Up to 14.2 million people could each receive an average of &#163;700 in compensation due to car loan mis-selling, the financial services regulator has said. ",
        "url": "https://news.sky.com/story/14-million-people-could-get-compensation-of-hundreds-of-pounds-over-car-loan-mis-selling-13446504",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sales-car_6978045.jpg?20250730142252",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-07 12:25:34",
        "Headline": "Consumers lost out on potentially better deals and paid more when lenders did not disclose the commission paid to brokers, the Financial Conduct Authority said.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Up to 14.2 million people could each receive an average of Â£700 in compensation due to car loan mis-selling, the financial services regulator has said.  Nearly half (44%) of all car loan agreements made between April 2007 and November 2024 could be eligible for payouts, the Financial Conduct Authority (FCA) said. Those eligible for the compensation will have had a loan where the broker received commission from a lender. Lenders broke the law by not sharing this fact with consumers, the FCA said, and customers lost out on better deals and sometimes paid more. A scheme is seen by the FCA as the best outcome for consumers and lenders, as it avoids the courts and the Financial Ombudsman Service, therefore minimising delay, uncertainty and administration costs. The scheme will be funded by the dozens of lenders involved in the loans, and cost about Â£8.2bn, on the lower end of expectations, which had been expected to reach as much as Â£18bn. The figure was reached by estimating that 85% of eligible applicants will take part in the scheme. \n                  It's now almost impossible to work your way to riches, says report into growing wealth gap\n                 \n                  Starmer refuses to rule out tax rises as he flies business leaders to India\n                 \n                  Money blog: Massive car finance compensation scheme announced with Â£700 average - here's what to do now\n                 What if you think you're eligible? Anyone who believes they have been impacted should contact their lender and has a year to do so. Compensation will begin to be paid in 2026, with an exact timeline yet to be worked out. The FCA said it would move \"as quickly as we can\".  People who have already complained do not need to take action. Complaints about approximately four million loan agreements have already been received. There's no need to contact a solicitor or claims management firm, the FCA said, as it aimed for the scheme to be as easy as possible. A lender won't have to pay, however, if it can prove the customer could not have got cover anywhere else. The number of people who will get a payout is not known. While there are 14.2 million agreements identified by the FCA, the same person may have taken out more than one loan over the 17-year period. More expensive car loans? Despite the fact many lenders have to contribute to redress, the FCA said the market will continue to function and pointed out the sector has grown in recent years and months. In delivering compensation quickly, the FCA said it \"can ensure that some of the trust and confidence in the market can be repaired\". It could not, however, rule out that the scheme could mean fewer offers and more expensive car loans, but failure to introduce a scheme would have been worse. Read more:UK steel set for further hit as EU to double tariffsIs another spectacular Bitcoin comedown inevitable? The FCA said: \"We cannot rule out some modest impacts on product availability and prices, we estimate the cost of dealing with complaints would be several billion pounds higher in the absence of a redress scheme. \"In that scenario, impacts on access to motor finance and prices for consumers could be significantly higher with uncertainty continuing for many more years.\""
    },
    {
        "title": "UK steel set for further hit as EU to double tariffs",
        "description": "UK steel manufacturers are to be hit by another round of tariffs, even higher and more impactful than those levied by the US, representing \"an existential threat\" to the industry.",
        "url": "https://news.sky.com/story/uk-steel-set-for-further-hit-as-eu-to-double-tariffs-13446530",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-raw-materials-minerals_6862209.jpg?20250320135228",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-07 13:39:04",
        "Headline": "Losing access to the EU market, the largest destination for UK steel exports, would have a \"catastrophic\" impact on jobs, a key union said. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n UK steel manufacturers are to be hit by another round of tariffs, even higher and more impactful than those levied by the US, representing \"an existential threat\" to the industry. The European Union (EU) is hiking the tax on steel it imports, with the tariff to be 50%, double the 25% currently levied by the Trump administration in the US and the EU's current rate. Money blog: Massive Â£400 bank switch offer - but there's a salary catch This decision is an \"existential threat\", according to the assistant general secretary of the Community union, Alasdair McDiarmid. \"Europe is by far the largest destination for UK steel exports, and losing access to this market would have a catastrophic impact on British jobs,\" he said. UK Steel, the steel industry body, described it as \"perhaps the biggest crisis the UK steel industry has ever faced\" and called on the government to \"secure UK country quotas\".  Establishing a UK country quota could mean some steel is traded with lower or no tariffs at all. \n                  'Disappointing' no steel tariff deal done before Trump in town, industry says\n                 \n                  US financial firms pledge Â£1.25bn to UK ahead of Trump's visit\n                 \n                  US court rules Trump's tariffs are illegal - but leaves them in place for now\n                 If this is not arranged, the industry would \"potentially face disaster\", said Gareth Stace, the director general at UK Steel. Political response When asked about the topic, Prime Minister Keir Starmer said, \"Our position in relation to our steel industry is one of strong support.\" He added: \"In relation to the question of tariffs or other measures, as you'd expect, we are in discussions with the EU about this, as we're in discussions with the US about it. So I'll be able to tell you more in due course.\" Why is the EU doing it? The EU is erecting the trade barrier to avoid an influx of steel imports flooding its market in the wake of the US's tariffs hike and to avoid making the EU less competitive for domestic producers. EU commissioner for prosperity and industrial strategy, Stephane Sejourne, said the EU was also reducing the amount of steel being imported from abroad to \"save our European steel plants and jobs\". Similar measures have been called for by UK Steel. \"The UK government must now recognise the urgent need to put in place its own measures to defend against a flood of imports,\" Mr Stace said. \"The probability of the EU's measures redirecting millions of tonnes of steel towards the UK could be terminal for many of our remaining steel companies.\" Detail of when the policy will take effect has yet to be announced. Responding to the news, industry minister Chris McDonald said, \"We will always defend our critical steel industry, which is why we are pushing the European Commission for urgent clarification of the impact of this move on the UK.\" \"It's vital we protect trade flows between the UK and EU and we will work with our closest allies to address global challenges rather than adding to our industries' woes.\""
    },
    {
        "title": "Jaguar Land Rover reveals supplier aid and partial production restart after cyber attack",
        "description": "Jaguar Land Rover (JLR) has announced efforts to help its supply chain and a partial restart of operations following August's crippling cyber attack.",
        "url": "https://news.sky.com/story/jaguar-land-rover-reveals-supplier-aid-and-partial-production-restart-after-cyber-attack-13446348",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-10-07 07:19:51",
        "Headline": "Companies dealing with JLR directly are offered early payments by the carmaker, which hopes the aid will trickle down the supply chain.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Jaguar Land Rover (JLR) has announced efforts to help its supply chain and a partial restart of operations following August's crippling cyber attack. The company said \"qualifying\" supplier companies would be eligible for early payments due to the disruption caused by the temporary shutdown of its factories over a month ago. At the same time, it said the phased restart of its manufacturing sites would begin at its Electric Propulsion Manufacturing Centre and its Battery Assembly Centre in the West Midlands from Wednesday. Money latest: Biggest pension regrets of retirees revealed \"JLR colleagues will also begin to return on Wednesday to the company's stamping operations in Castle Bromwich, Halewood and Solihull, UK, and other key areas of its Solihull vehicle production plant, such as its body shop, paint shop and its Logistics Operations Centre, which feeds parts to JLR's global manufacturing sites,\" a statement said. The prospect of production staff getting back to work will come as a huge relief to workers and suppliers alike. The shutdown is currently into its sixth week, costing JLR at least Â£5m a day. Companies which supply JLR both directly and indirectly have suffered, though the carmaker is understood to have met its financial commitments to all partners it deals with. \n                  It's now almost impossible to work your way to riches, says report into growing wealth gap\n                 \n                  Starmer refuses to rule out tax rises as he flies business leaders to India\n                 \n                  Millions of people could each get hundreds of pounds in compensation over car loan mis-selling\n                 Firms further down the chain complained last week that they were yet to receive any support, despite the offer of a Â£1.5bn loan guarantee by the government.  JLR is believed to have not signed up to it on the grounds it has had sufficient funds to pay its way to date. The new early payments scheme is only open to its main, so-called tier one, suppliers. It is hoped that money will trickle down from them to their own customers who have, in many cases, laid off staff. The carmaker said of the help now on offer to suppliers: \"Qualifying JLR suppliers will be paid much faster than under their standard payment terms, aiding their cashflow in the near term. \"Following an initial phase with qualifying JLR suppliers critical to the restart of production, the scheme will be expanded, including to some nonâ€‘production suppliers.  \"Working with a banking partner, this shortâ€‘term financing scheme means qualifying JLR suppliers will receive a majority prepayment shortly after the point of order and a final trueâ€‘up payment on receipt of invoice. \"JLR's typical supplier payment terms are 60 days post invoice, so this scheme accelerates payments by as much as 120 days. JLR will reimburse the financing costs for those JLR suppliers who use the scheme during the restart phase, as the company returns to full production.\" JLR said that the non-production suppliers who could be offered help later included caterers and consultants. JLR chief executive, Adrian Mardell, said: \"This week marks an important moment for JLR and all our stakeholders as we now restart our manufacturing operations following the cyber incident. \"From tomorrow, we will welcome back our colleagues at our engine production plant in Wolverhampton, shortly followed by our colleagues making our world-class cars at Nitra and Solihull. \"Our suppliers are central to our success, and today we are launching a new financing arrangement that will enable us to pay our suppliers early, using the strength of our balance sheet to support their cashflows. \"I would like to thank everyone connected to JLR for their commitment, hard work and endeavour in recent weeks to bring us to this moment. We know there is much more to do but our recovery is firmly underway.\" The extent of the hit to sales was partly revealed in figures released by the company later in the day. They showed a 24% decline in wholesale volumes during the three months to 30 September compared to the previous three months, and a 17% year on year decline in retail sales volumes. Also knocking sales this year has been challenges from US tariffs and the planned wind down of legacy Jaguar models ahead of the launch of new vehicles under the marque's rebrand. Business and Trade Secretary Peter Kyle said of the company's status update: \"This is very welcome news for workers and suppliers, but I know many are still under pressure, particularly further down the supply chain. \"My focus will remain on helping JLR resolve this cyber incident, making further progress towards restarting production, and supporting the long-term health of our automotive supply chain.\" "
    },
    {
        "title": "Ineos blames Chinese 'dumping' for cuts to Hull workforce",
        "description": "Ineos, the chemicals group founded by Manchester United co-owner Sir Jim Ratcliffe, has hit out at the government after cutting a fifth of the workforce at a factory in Hull.",
        "url": "https://news.sky.com/story/ineos-blames-chinese-dumping-for-cuts-to-hull-workforce-13446327",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jim-ratcliffe-manchester-united_6852916.jpg?20250311100537",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-07 06:32:37",
        "Headline": "Europe is accused of \"sleepwalking into deindustrialisation\" by its largest chemicals producer which is demanding tariffs to prevent factory closures.",
        "Content": "Ineos, the chemicals group founded by Manchester United co-owner Sir Jim Ratcliffe, has hit out at the government after cutting a fifth of the workforce at a factory in Hull. The company said 60 skilled jobs were going at the Acetyls factory \"as a direct result of sky-high energy costs and anti-competitive trade practices, as importers 'dump' product into the UK and European markets\". It called on the UK government and European Commission to impose trade tariffs on China, complaining that a lack of action to date had resulted in \"dirt cheap\" carbon-heavy imports flooding the market, making its products uncompetitive. Money latest: Biggest pension regrets of retirees revealed Ineos said the US had protected its manufacturing base through effective tariffs and warned that further jobs would be lost across Europe unless the authorities followed suit. The company, founded by Sir Jim in 1998, is Europe's largest producer of essential chemicals for a range of products including aspirin and paracetamol, adhesives and industrial coatings. It recently invested Â£30m to switch its Hull plant energy source from natural gas to hydrogen. Ineos claimed Chinese competitors were emitting up to eight times more carbon dioxide than its UK operations. \n                  Manchester United announce record revenues - but still make a loss\n                 \n                  Manchester United announce more redundancies - with free staff lunches scrapped\n                 \n                  Sir Jim Ratcliffe's difficult first year at Manchester United - but should the Glazers take more blame?\n                 \"This is a textbook case of the UK and Europe sleepwalking into deindustrialisation,\" the firm's statement said. \"Ineos has invested heavily at Hull to cut COâ‚‚, yet we're being undercut by China and the US while left wide open by a complete absence of tariff protection. \"If governments don't act now on energy, carbon and trade, we will keep losing factories, skills and jobs. And once these plants shut, they never come back.\" A Government spokesperson responded: \"We know this is a tough time for our chemicals industry, who are paying the fossil fuel penalty, with wholesale gas costs remaining 75% above their levels before Russia invaded Ukraine. \"Our modern Industrial Strategy is slashing electricity costs by up to 25% for sectors including chemicals, and the UK's independent Trade Remedies Authority has the power to investigate the impact of cheap imports if requested by industry. \"We recognise this will be difficult for affected workers and their families, and we continue to engage with Ineos and the wider sector to explore potential solutions that will ensure a viable chemicals industry in the UK.\""
    },
    {
        "title": "Barclays-backed payments spinout lures Lalor as new chief",
        "description": "A Barclays-backed payment acceptance company which processes billions of pounds each year for small businesses has recruited an industry veteran to become its chief executive.",
        "url": "https://news.sky.com/story/barclays-backed-payments-spinout-lures-lalor-as-new-chief-13446425",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-barclays-bank_6747670.jpg?20241113180508",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-07 10:14:21",
        "Headline": "Jason Lalor, a former Barclaycard executive, has been recruited to head the payment acceptance joint venture between the UK bank and Canadian asset manager Brookfield, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A Barclays-backed payment acceptance company which processes billions of pounds each year for small businesses has recruited an industry veteran to become its chief executive. Sky News has learnt that Jason Lalor, a former boss of Square's European operations, will head the joint venture between the UK bank and Brookfield Asset Management. Formerly known as its merchant acquiring unit, the division was wholly owned by Barclays until earlier this year, when it struck a deal to partner with Brookfield's financial infrastructure specialists. Money latest: Metro Bank hit by payments glitch Under the arrangement, Barclays will invest Â£400m into it over three years, while Brookfield has the option to convert its initial 10% stake into a controlling 80% interest within seven years of the deal. The agreement between Barclays and Brookfield took nearly a year to consummate, with the search for a chief executive having taken several months to conclude. Mr Lalor's most recent role was as chief executive of Conferma Pay, a Mastercard-backed virtual payments technology provider. \n                  It's now almost impossible to work your way to riches, says report into growing wealth gap\n                 \n                  Starmer refuses to rule out tax rises as he flies business leaders to India\n                 \n                  Millions of people could each get hundreds of pounds in compensation over car loan mis-selling\n                 He has also worked at Barclaycard, Mastercard, American Express and Dell. The Barclays unit will continue to use the Barclaycard Payments brand, according to a statement earlier this year, and will be the sole payment acceptance services provider to Barclays' clients for a minimum of a decade. Announcing the deal in April, Matt Hammerstein, Barclays' UK chief executive, said: \"We have a leading position in the UK, but we know that our payments clients are increasingly looking for integrated connectivity, an end-to-end service and tailored technological solutions from their payments providers.\" Brookfield declined to comment on Tuesday."
    },
    {
        "title": "Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'",
        "description": "Kemi Badenoch will promise to introduce a \"golden rule\" to get the deficit down and \"get our economy back on track\" if the Tories win the next election.",
        "url": "https://news.sky.com/story/kemi-badenoch-reveals-her-golden-rule-to-get-economy-back-on-track-13446524",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-conservatives_7044769.jpg?20251007105348",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-07 13:24:39",
        "Headline": "The Tory leader will be giving her keynote speech at her party's conference, which has seen a lower turnout than previous years.",
        "Content": "Kemi Badenoch will promise to introduce a \"golden rule\" to get the deficit down and \"get our economy back on track\" if the Tories win the next election. During her keynote speech at the end of the Conservative Party's conference on Wednesday, the Tory leader will say her party is the only party \"who can be trusted to meet the test of our generation\". Follow live updates from Tory conference \"We are the only party with a plan to get our economy back on trust,\" she is expected to say. Ms Badenoch will tell Tory members she would introduce a \"golden economic rule\" to ensure for every pound saved, half or more will go to reduce the deficit and half will go towards tax cuts or spending to boost the economy. She will accuse Chancellor Rachel Reeves of doubling the deficit \"with her borrowing and tax doom loop\" over the next decade. \"It's not sustainable, and it's not fair,\" she will say. \"It is stealing from our children and grandchildren, and Conservatives will put a stop to it.\"  Where will the cuts fall? Ms Badenoch will say the Tories have already identified Â£47bn in savings, including Â£23bn from welfare, Â£8bn from the civil service and Â£7bn from the overseas aid budget. She will also announce plans to reform the higher education sector, double apprenticeship funding, and back high-value courses for young people. She will pledge to end \"debt trap\" degrees, which she will say offer poor value to students and taxpayers, and instead fund \"worthwhile courses\". This will lead to savings, she will say, to pay for the doubling of apprenticeship funding, in addition to the employers' apprenticeship levy funds currently paid by UK employers with a payroll of more than Â£3m. \"This can't be right - young people in Britain deserve a better deal, which is why the Conservatives are throwing out the status quo,\" she is expected to say. Read more:Twenty Tory councillors defect to ReformBeth Rigby on tough questions facing Badenoch  The plan would see more apprenticeships for people aged 18-21, while any remaining funding would be used to support \"high-quality\" courses at research-intensive British universities. The Conservative Party's conference has been marred by a lacklustre attendance, the defection of 20 Tory councillors to Reform, and a Sky News/YouGov poll which found half of the party's members think Ms Badenoch should not lead the party into the next election."
    },
    {
        "title": "Tetchy Badenoch criticised me for asking hard questions - but leadership challenge talk won't go away",
        "description": "In the 11 months since Kemi Badenoch has become party leader, the Conservative Party has dropped from 26% to 17% in the polls.",
        "url": "https://news.sky.com/story/badenoch-positively-looking-for-a-fight-as-tories-seek-relevance-13446659",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-beth-rigby-kemi-badenoch_7045370.jpg?20251007195318",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-10-07 18:30:03",
        "Headline": "The Tory leader may not like being asked about Reform, might - in her words - not be interested in Reform, but her former voters, and the country, are.",
        "Content": "\n          Political editor\n              @BethRigby\n  In the 11 months since Kemi Badenoch has become party leader, the Conservative Party has dropped from 26% to 17% in the polls. It has lost nearly 700 council seats, 16 councils, while 18 senior Tories have defected, including one of the party's great thinkers, Danny Kruger. Politics Live: Tory councillors defect to Reform Her personal poll rating, minus 47, is worse than the lowest ebb of Iain Duncan Smith's fated leadership and worse than when Boris Johnson resigned. To rub salt into the wounds, a Sky News/YouGov poll this week found that the majority of Tory members think Robert Jenrick should be the leader, while half don't think she should lead them into the next general election. Being leader of the Opposition is often described as the hardest job in politics, but for Badenoch, with Reform stealing the march as the party of the right, it looks pretty much impossible. For someone who needs to try to win people over, Badenoch has a curious style. She likes to be known as a leader who isn't afraid of a fight and, at times, she approached our interview at the Conservative Party conference as if she was positively looking for one. \n                  Lord Heseltine attacks Badenoch's new policies - and calls Farage a 'phoney'\n                 \n                  Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'\n                 \n                  Robert Jenrick says Kemi Badenoch is 'right person' to lead party - despite poll\n                 A few times in our interview when I asked her a question she didn't like, or didn't want to answer (it is my job to ask all politicians hard questions), she seemed tetchy. And when I deigned to ask her whether she admired Nigel Farage, she criticised me for asking the question. She asked why I was not asking her if she admires Sir Keir Starmer or Sir Ed Davey. Her approach surprised me, as I had asked the prime minister exactly the same question a week before. He'd answered it directly, without arguing over why I had asked it: \"I think he is a formidable politician,\" said Sir Keir. Badenoch told me she didn't understand the question, and then told me she wasn't interested in talking about him. It made for an awkward, ill-tempered exchange. The facts remain that Farage is topping the polls, helped by Labour's collapsing support and the Conservatives' deep unpopularity. And in the run-up to our interview, Reform drip-fed the news that 20 Tory councillors were defecting to Farage's party. There is open talk in Badenoch's party about whether the Tories will need to try to come to some sort of agreement with Reform at the next election to try to see off Labour and 'progressive parties'. Farage says absolutely not, as does Badenoch - but many in her party do not think she has that luxury. Andrew Rosindell, MP for Romford, told GB News he'll lose his seat unless the two sides \"work together\" and said the right must unite to defeat the left. Arch-rival Robert Jenrick pointedly refuses to rule it out, saying only it's \"not the priority\". Meanwhile, party members support an electoral pact by two to one, according to our Sky News poll. On the matter of whether these MPs, and party members, have a point, Badenoch bristled: \"It is important that people know what we stand for. Robert Jenrick is not the leader of the Conservative Party, neither is Andrew Rossindell. I am the leader of the party and we are not having a coalition or a pact with Reform.\" Read More:Jaunty Jenrick: a leader's speech in all but nameKemi Badenoch praises Thatcher but faces fight with grandees When I ask colleagues if they think Badenoch is too aloof, too argumentative, too abrasive to lead this rebuild, the popular refrain for her supporters is that she is \"a work in progress\" and that it would be madness to change the leader again. The question is, will she be given the time to develop? The plot to oust her is active and much of the chatter around this conference is whether she might be challenged before or after the May local elections. There are some colleagues who believe it is better to give her more time to turn things around and, if May is truly dreadful and the party goes further backwards, remove her then. Ahead of conference, when asked by Tim Shipman of the Spectator whether she would resign if the Conservatives go backwards in May, she said rather cryptically \"ask me after the locals\". When I asked Badenoch why she said that she replied, \"let's see what the election result is about\". When I explained that it sounded rather like she might throw in the towel after next May and so was seeking clarification, she told me that I was asking irrelevant questions. \"Your viewers want to know how their lives are going to be better. Not be inside the Westminster bubble politics of who's up, who's down... It's part of the reason why the country is in this mess. Perhaps if people had scrutinised Labour's policies instead of looking at just poll ratings, they would be running the country better.\" But Tories are looking at poll ratings and there is a view from some in the party that if the Tories wait until another drubbing in the May local, Scottish and Welsh elections, there might not be much of a party apparatus left to rebuild from. In short, there is not a settled view on when a challenge might come, but with the party in the position it is in, talk of a challenge will not go away. Badenoch wants to make the case that her \"authentic conservatism\" is worth sticking with and that the policies the Conservatives are announcing will give them a pathway back. On borders, the Tories are trying to neutralise Reform with a very similar offer. On the economy and welfare cuts, they hope they can beat Labour and Reform. But really, the question about this party and this leader is about relevance. The prime minister didn't even bother to name check Badenoch in his conference speech, while Davey trained his guns on Farage rather than his traditional Tory rival. Badenoch may not like being asked about Reform, might - in her words - not be interested in Reform, but her former voters, and the country, are. The enormous challenge for her in the coming months is to see if she can get them to look at her."
    },
    {
        "title": " Kemi Badenoch repeatedly refuses to say whether she admires Nigel Farage",
        "description": "Kemi Badenoch has repeatedly refused to say whether she admires Reform UK leader Nigel Farage.",
        "url": "https://news.sky.com/story/kemi-badenoch-repeatedly-refuses-to-say-whether-she-admires-nigel-farage-13446390",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-kemi-badenoch-tory-conference_7044942.jpg?20251007125222",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-07 08:59:30",
        "Headline": "The Tory leader says she believes her party's fortunes \"always would get worse before they got better\" as she rejects suggestions of a Reform pact.",
        "Content": " Kemi Badenoch has repeatedly refused to say whether she admires Reform UK leader Nigel Farage. Speaking to Sky News' political editor Beth Rigby, the Tory leader said she did not \"understand the question\" when asked if she held her rival in high regard. Politics latest: Education secretary won't say if Jewish students are safe on campus Asked what she thought of Mr Farage, whose party is currently leading in the polls, Ms Badenoch replied: \"I think it's very interesting that a lot of the media in Westminster is very interested about asking about Nigel Farage. \"I'm not interested in Nigel Farage, I'm interested in the Conservative Party.\" Ms Badenoch was speaking against the backdrop of the Conservative Party conference in Manchester, where the party has announced a string of policies, including a promise to leave the European Convention on Human Rights (ECHR) and \"ICE-style\" deportations if she wins the next election. The announcements have been interpreted as an attempt to respond to the threat posed by Reform, who have already announced plans to leave the ECHR and carry out mass deportations.  \n                  Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'\n                 \n                  Tetchy Badenoch criticised me for asking hard questions - but leadership challenge talk won't go away\n                 \n                  Starmer refuses to rule out tax rises as he flies business leaders to India\n                 Last month, they also vowed to scrap indefinite leave to remain, which gives people the right to settle, work and study in the UK and claim benefits, and to make obtaining British citizenship the only route to permanent residence in Britain. However, the Conservatives have sought to use their conference to distinguish themselves from Reform, branding their spending plans \"socialist\". It comes despite a poll of Tory members by YouGov showing that 64% support an electoral pact with Reform, while almost half of Tory members - 46% - would support a full-blown merger. Speaking to Sky News, Ms Badenoch admitted there was \"a lot we could do better\" given the Conservatives had dropped in the polls from 26% to 17% and her personal poll ratings stood at -47.  But she said: \"I don't let these things distract me. The fact of the matter is that last year we lost in a historic defeat. We never had so few MPs, and it's going to take time to come back from that. \"I am absolutely determined to get our party out of this, but I always said that things would get worse before they got better because we'd be out of government.\" Read more:Tories announce plans to abolish Sentencing CouncilFindings of new poll in line with views of gloomy Tory MPs The conference has been dominated by questions of collaboration with Reform, after 20 Tory councillors announced they were defecting to Reform - on top of the eight who have moved to Nigel Farage's party since March. On Monday, Tory MP Andrew Rosindell said he believed the Conservatives and Reform needed to work together. \"I've made it clear all the way through, and nothing has changed, that I am for the Conservatives and Reform working together,\" he told GB News. \"We need right-of-centre unity to defeat the left. \"If that means the Conservatives and Reform working together, we should do it. I don't see Reform as our enemies. It's a split on the right, and we need to come together.\" Put to her that the Tories may need to work with Reform, Ms Badenoch ruled out a pact and told Beth Rigby: \"I'm not interested in doing pacts. I was not elected to have a pact with Reform. \"I was elected to change the Conservative Party, make it clear what we stand for and that's what I've done at this conference. \"Robert Jenrick is not the leader of the Conservative Party, neither is Andrew Rosindell. I am.\""
    },
    {
        "title": "Starmer refuses to rule out tax rises as he flies business leaders to India",
        "description": "Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-tax-rises-as-he-flies-business-leaders-to-india-13446700",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-heathrow_7045132.jpg?20251007154127",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-07 20:04:02",
        "Headline": "Sir Keir has already turned down the wish of some of the CEOs on the trip to increase the number of visas.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Sir Keir Starmer has begun the first full-blown trade mission to India since Theresa May was prime minister, bringing 125 UK CEOs, entrepreneurs, and university leaders to Mumbai. The prime minister flew on a plane with dozens of Britain's most prominent business people, including bosses from BA, Barclays, Standard Chartered, BT and Rolls-Royce, for the two-day trip designed to boost ties between the two countries. Follow updates in the Politics Hub Starmer will meet Prime Minister Narendra Modi on Thursday, five months after the UK signed the first trade deal with India since Brexit. The agreement has yet to be implemented, with controversial plans to waive national insurance for workers employed by big Indian businesses sent to the UK still the subject of a forthcoming consultation. Speaking to journalists on the plane on the way out, the prime minister said he was determined to boost ties between the two countries. The trip has been arranged to coincide with the Conservative Party conference, with the first day of meetings coinciding with Kemi Badenoch's speech to activists in Manchester. However, the business delegation is likely to use the trip to lobby the prime minister not to put more taxes on them in the November budget. Sir Keir has already turned down the wish of some CEOs on the trip to increase the number of visas. \"The visa situation hasn't changed with the free trade agreement, and therefore we didn't open up more visas,\" he said. He told business that it wasn't right to focus on visas, telling them: \"The issue is not about visas. It's about business-to-business engagement and investment and jobs and prosperity coming into the United Kingdom.\" The prime minister sidestepped questions about Mr Modi's support of Russian leader Vladimir Putin, whom he wished happy birthday on social media. US President Donald Trump has increased tariffs against India, alleging that Indian purchases of Russian oil are supporting the war in Ukraine. Asked about Mr Modi wishing Mr Putin happy birthday, and whether he had leverage to talk to Mr Modi about his relationship with Russia, Sir Keir sidestepped the question. \"Just for the record, I haven't... sent birthday congratulations to Putin, nor am I going to do so,\" he said. \"I don't suppose that comes as a surprise. In relation to energy, and clamping down on Russian energy, our focus as the UK, and we've been leading on this, is on the shadow fleet, because we think that's the most effective way. We've been one of the lead countries in relation to the shadow fleet, working with other countries.\" PM: We aren't forcing wealthy people out Sir Keir refused to give business leaders any comfort about the budget and tax hikes, despite saying in his conference speech he recognised the last budget had an impact. \"What I acknowledged in my conference, and I've acknowledged a number of times now, is we asked a lot of business in the last budget. It's important that I acknowledge that, and I also said that that had helped us with growth and stabilising the economy,\" he added. \"I'm not going to make any comment about the forthcoming budget, as you would expect; no prime minister or chancellor ever does.\" Asked if too many wealthy people were leaving London, he said: \"No. We keep a careful eye on the figures, as you would expect. \"The measures that we took at the last budget are bringing a considerable amount of revenue into the government which is being used to fix things like the NHS. We keep a careful eye on the figures.\""
    },
    {
        "title": "Spying trial collapsed after government refused to brand China a threat, says top prosecutor",
        "description": "A Chinese spying trial collapsed last month after the UK government would not label Beijing a national security threat, a top prosecutor has said.",
        "url": "https://news.sky.com/story/spying-trial-collapsed-after-government-refused-to-brand-china-a-threat-says-top-prosecutor-13446716",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christopher-cash-christopher-berry_7045458.png?20251007215609",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-07 20:27:07",
        "Headline": "Stephen Parkinson has sought to blame the government for not labelling China a risk to national security - but Sir Keir Starmer says this had to happen under the Tories.",
        "Content": "A Chinese spying trial collapsed last month after the UK government would not label Beijing a national security threat, a top prosecutor has said. Christopher Berry, 33, and former parliamentary researcher Christopher Cash, 30, were accused of espionage for China. But the Crown Prosecution Service (CPS) announced on 15 September that the charges would be dropped, sparking criticism from Downing Street and MPs. Berry, of Witney, Oxfordshire, and Cash, from Whitechapel, east London, had denied accusations of providing information prejudicial to the interests of the state in breach of the Official Secrets Act between December 2021 and February 2023. Politics latest: Badenoch insists 'Jenrick is not the Tory leader' Stephen Parkinson, the director of public prosecutions (DPP), told MPs in a letter on Tuesday that the CPS had tried \"over many months\" to get the evidence it needed to carry out the prosecution, but it had not been forthcoming from the Labour government. However, Sir Keir Starmer insisted the decision to brand China a threat would have to have been taken under the last Conservative administration. \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Â£5bn fraud mastermind's 'butler' pleads guilty to money laundering after UK's biggest ever Bitcoin seizure\n                 \n                  Former assistant to AfD politician found guilty of Chinese spy charges\n                 The prime minister said: \"You can't prosecute someone two years later in relation to a designation that wasn't in place at the time.\" It is understood that the decision to end the case came after a meeting of senior officials which, according to The Sunday Times, included Jonathan Powell, the national security adviser, and Sir Oliver Robins, the Foreign Office's top diplomat. To prove the case under the Official Secrets Act of 1911, prosecutors would have to show the defendants were acting for an \"enemy\". Both the current Labour government and the previous Conservative governments have not labelled China a risk to national security. In his letter to the chairs of the Commons home and justice select committees, Mr Parkinson said: \"It was considered that further evidence should be obtained. \"Efforts to obtain that evidence were made over many months, but notwithstanding the fact that further witness statements were provided, none of these stated that at the time of the offence China represented a threat to national security, and by late August 2025 it was realised that this evidence would not be forthcoming. \"When this became apparent, the case could not proceed.\" He also pointed out that in a separate case about Russian spying last year, a judge ruled that an \"enemy\" under the 1911 Act must be a country that represents a threat to national security of the UK \"at the time of the offence\". How has the government responded? Sir Keir has addressed the contents of the letter, which he said he had \"read at speed\", while on board a flight to Mumbai, as part of the UK's largest ever trade mission to India. The PM said: \"What matters is what the designation [of China] was in 2023, because that's when the offence was committed and that's when the relevant period was. \"Statements were drawn up at the time according to the then government policy, and they haven't been changed in relation to it, that was the position then. \"I might just add, nor could the position change, because it was the designation at the time that matters.\" Sir Keir, a former director of public prosecutions, added that he wasn't \"saying that defensively\", but because \"as a prosecutor, I know that... it is what the situation at the time that matters\". He also declined to criticise the CPS or the DPP, as he said \"it's wise not to\". Since the alleged spying offences took place, the new National Security Act has superseded elements of the 1911 Act. But Conservatives, including shadow home secretary Chris Philp, insist that Sir Keir has \"very serious questions to personally answer\"."
    },
    {
        "title": "Lord Heseltine attacks Badenoch's new policies - and calls Farage a 'phoney'",
        "description": "Michael Heseltine rolled back the years with a blistering onslaught at the Tory conference on Kemi Badenoch's new policies on human rights, asylum seekers and climate change.",
        "url": "https://news.sky.com/story/lord-heseltine-attacks-badenochs-new-policies-and-calls-farage-a-phoney-13446673",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-michael-heseltine-kemi-badenoch_7045385.png?20251007202345",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-10-07 19:09:44",
        "Headline": "The Tory grandee has launched a three-pronged attack on the current Conservative Party leader's policies.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Michael Heseltine rolled back the years with a blistering onslaught at the Tory conference on Kemi Badenoch's new policies on human rights, asylum seekers and climate change. The 92-year-old former deputy prime minister also bitterly attacked Nigel Farage, appearing to compare Reform UK and other right-wing parties in Europe to the fascists of the 1930s. The Conservative peer, nicknamed 'Tarzan' when he was the darling of the Tory faithful during the premierships of Margaret Thatcher and John Major, told Sky News he was attending the Conservative Party conference for the first time since 1997. Politics latest: Badenoch insists 'Jenrick is not the Tory leader' He spoke at a European Movement fringe meeting alongside former Liberal Democrat MP Sir Nick Harvey, and demonstrated that his pro-European views remain as strong as ever. Lord Heseltine began his speech by denouncing right-wing parties \"on the march\" in Europe, including Reform, as among the \"right-wing equivalents of the fascists in the '30s\". And he added later: \"We will never, never, have any part in the populist extremism of Nigel Farage. We have to deal with President Trump for the next three years, we don't want his mouthpiece anywhere near Number 10.\" \n                  Pro-Palestine protests on anniversary of October 7 'risk being seen as support for Hamas', says Universities UK boss\n                 \n                  Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'\n                 \n                  Robert Jenrick says Kemi Badenoch is 'right person' to lead party - despite poll\n                 The veteran peer also strongly attacked Ms Badenoch's new policy, announced on Sunday, of withdrawing the UK from the European Convention of Human Rights (ECHR) and the European Court.  \"If any changes are required, the worst thing is to walk out and turn our back on one of the most civilised of European creations,\" he said. \"The right way is to follow David Cameron's example and seek change by agreement, as he did in 2012 with the Brighton Declaration. \"It is more than possible that the widespread concerns about asylum seekers across Europe would make a review welcome to many signatories.\" Secondly, Lord Heseltine criticised Ms Badenoch's new policy, also announced at the weekend, of deporting 150,000 migrants a year and accused senior Tories of demonising asylum seekers. \"The overwhelming majority of asylum seekers want to share in our standards, and to escape from persecution or civil war,\" he said. \"To describe them as thieves or rapists is not just dishonest, but encourages the worst sort of prejudice in our communities.\"  And thirdly, he attacked the current Tory leadership's policy of scrapping climate change targets and carbon taxes, claiming it was Margaret Thatcher who first warned about global warming. \"The threat from global warming must not be ignored in the hope that it may not happen or because there is a backlash against the cost,\" he said. \"We should be proud of our role in the battle to halt climate change. It was Margaret Thatcher who gave one of the starkest and earliest warnings of the dangers. \"Today the evidence in storms, coastal erosion, flooding, fire and the spread of desert is all too clear. \"It would be an act of unforgivable irresponsibility to undo all that Conservatives have done to play a leading role in this world-threatening crisis.\" Read more:Badenoch refuses to say if she admires FarageTory leadership challenge talk won't go away  Quoting polling evidence showing low numbers of Conservative voters among young people, he said: \"A stark warning comes when you look at the age group of the present Conservative supporters and see how weighted it is towards older voters. \"I want to see the election of another Tory government. \"I believe there are five broad issues that they must address: the defence of the realm; the restoration of strength and confidence in our economy; the rule of law; the threat to our environment from pollution, global warming and climate change; and the restoration of British influence in the world. \"This is an agenda that should appeal to the younger electorate that will be in place by the next election.\" In a Sky News interview after his fringe meeting, Lord Heseltine said he wasn't surprised by our YouGov poll showing 50% of Tory members want Ms Badenoch replaced, and a majority of them want a pact with Reform UK.  \"She's taken on a very difficult situation and in very difficult world circumstances,\" he said. \"The problems she has inherited are not her responsibility, and it's bound to take time.\" And on the prospect of Mr Farage becoming prime minister, Lord Heseltine told Sky News: \"I can't think of anything that would be more damaging for British prestige throughout the world. \"He's a populist. He doesn't really have policies. He's an actor. When he started on the journey, we never saw him without a pint of beer in his hand because he wanted to equate to the working-class people in struggle. \"Then there was a confusion over farming, and he turned up wearing clothes like a farmer. He's just a phoney.\""
    },
    {
        "title": "Robert Jenrick urged to apologise for 'disgraceful' integration comments ",
        "description": "Robert Jenrick should apologise for his \"disgraceful comments\" bemoaning the lack of visible white faces in a part of Birmingham, the Mayor of the West Midlands has said.",
        "url": "https://news.sky.com/story/robert-jenrick-urged-to-apologise-for-disgraceful-integration-comments-13446669",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-robert-jenrick-conservative_7044862.jpg?20251007120038",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-07 19:00:21",
        "Headline": "Labour's Mayor of the West Midlands Richard Parker says Mr Jenrick's comments about Handsworth in Birmingham are not accurate and risk stoking division.",
        "Content": " Robert Jenrick should apologise for his \"disgraceful comments\" bemoaning the lack of visible white faces in a part of Birmingham, the Mayor of the West Midlands has said. Richard Parker told Sky News' The UK Tonight with Sarah-Jane Mee he was \"shocked and truly appalled\" by what the shadow justice secretary said about integration in Handsworth. In a recording from March obtained by The Guardian, Mr Jenrick said that the inner-city area \"was one of the worst integrated places I've ever been to\" and that \"in the hour and a half I was filming news there I didn't see another white face\". Mr Parker, a Labour mayor, told Sky News: \"I thought they were disgraceful comments. \"They're really damaging comments about, you know, one of the great communities in Birmingham, in Handsworth, a community that is vibrant, is very welcoming, very hospitable, and full of generosity.\" Mr Jenrick doubled down on his comments on Tuesday, saying he would not \"shy away\" from issues of integration.  'I'm shocked and truly appalled' But Mr Parker said it was not an accurate reflection of Handsworth as he called on the senior Tory MP and Conservative leader Kemi Badenoch to apologise. He said: \"I'm shocked and truly appalled. He doesn't know Handsworth. If he wanted to know Handsworth, he could have reached out to me, and I could have shown him around and introduced him to the people there, the great people that run businesses I know there, and some of the great community groups I know there.\" He added: \"He used the colour of people's skins to make really divisive and negative comments about Handsworth, and it's wrong, and it's also wrong that a politician, a senior politician of a mainstream party, makes comments like this and then reiterates them, with no apology. \"I believe Robert Jenrick, and the leader of the Conservative Party, owe the people of Birmingham and the people in the communities of Handsworth an apology.\" Read more:Jaunty Jenrick: A leader's speech in all but nameBadenoch praises Thatcher but faces fight with grandees Mr Jenrick was in Handsworth to film a video about litter and fly tipping for GB News. His words were recorded during a dinner at the Aldridge-Brownhills Conservative Association dinner on 14 March, The Guardian said. According to the paper, he called the litter \"appalling\" and said Handsworth was \"as as close as I've come to a slum in this country\". He added: \"The other thing I noticed there was that it was one of the worst integrated places I've ever been to. In fact, in the hour and a half I was filming news there, I didn't see another white face. \"That's not the kind of country I want to live in. I want to live in a country where people are properly integrated. It's not about the colour of your skin or your faith, of course it isn't. But I want people to be living alongside each other, not parallel lives. That's not the right way we want to live as a country.\" The comments have also been criticised by the Bishop of Birmingham, the Right Reverend Michael Volland. In a letter to Mr Jenrick published on Tuesday and co-signed by a number of community leaders, he said the comments \"can feed into a harmful narrative that provides fuel for a fire of toxic nationalism\". Jenrick: It was an observation Former Tory mayor Andy Street has also said Mr Jenrick was \"wrong\" about Handsworth, while the Labour Party said his comments \"cross a red line\". However, Mr Jenrick stood by what he said on Tuesday, telling the Telegraph's Daily T podcast \"I didn't see a mix of people on the streets. It was an observation\". Asked if he had any regrets about his comments, he earlier told BBC Radio 5 Live: \"No, not at all and I won't shy away from these issues.\" Ms Badenoch also defended her shadow minister, telling BBC Breakfast he had made a \"factual statement\". She said: \"If he said he didn't see another white face, he might have been making an observation. There's nothing wrong with making observations. \"But what he and I both agree with is that there are not enough people integrating. There are many people who are creating separate communities.\""
    },
    {
        "title": "UK steel set for further hit as EU to double tariffs",
        "description": "UK steel manufacturers are to be hit by another round of tariffs, even higher and more impactful than those levied by the US, representing \"an existential threat\" to the industry.",
        "url": "https://news.sky.com/story/uk-steel-set-for-further-hit-as-eu-to-double-tariffs-13446530",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-raw-materials-minerals_6862209.jpg?20250320135228",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-07 13:39:04",
        "Headline": "Losing access to the EU market, the largest destination for UK steel exports, would have a \"catastrophic\" impact on jobs, a key union said. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n UK steel manufacturers are to be hit by another round of tariffs, even higher and more impactful than those levied by the US, representing \"an existential threat\" to the industry. The European Union (EU) is hiking the tax on steel it imports, with the tariff to be 50%, double the 25% currently levied by the Trump administration in the US and the EU's current rate. Money blog: Massive Â£400 bank switch offer - but there's a salary catch This decision is an \"existential threat\", according to the assistant general secretary of the Community union, Alasdair McDiarmid. \"Europe is by far the largest destination for UK steel exports, and losing access to this market would have a catastrophic impact on British jobs,\" he said. UK Steel, the steel industry body, described it as \"perhaps the biggest crisis the UK steel industry has ever faced\" and called on the government to \"secure UK country quotas\".  Establishing a UK country quota could mean some steel is traded with lower or no tariffs at all. \n                  'Disappointing' no steel tariff deal done before Trump in town, industry says\n                 \n                  US financial firms pledge Â£1.25bn to UK ahead of Trump's visit\n                 \n                  US court rules Trump's tariffs are illegal - but leaves them in place for now\n                 If this is not arranged, the industry would \"potentially face disaster\", said Gareth Stace, the director general at UK Steel. Political response When asked about the topic, Prime Minister Keir Starmer said, \"Our position in relation to our steel industry is one of strong support.\" He added: \"In relation to the question of tariffs or other measures, as you'd expect, we are in discussions with the EU about this, as we're in discussions with the US about it. So I'll be able to tell you more in due course.\" Why is the EU doing it? The EU is erecting the trade barrier to avoid an influx of steel imports flooding its market in the wake of the US's tariffs hike and to avoid making the EU less competitive for domestic producers. EU commissioner for prosperity and industrial strategy, Stephane Sejourne, said the EU was also reducing the amount of steel being imported from abroad to \"save our European steel plants and jobs\". Similar measures have been called for by UK Steel. \"The UK government must now recognise the urgent need to put in place its own measures to defend against a flood of imports,\" Mr Stace said. \"The probability of the EU's measures redirecting millions of tonnes of steel towards the UK could be terminal for many of our remaining steel companies.\" Detail of when the policy will take effect has yet to be announced. Responding to the news, industry minister Chris McDonald said, \"We will always defend our critical steel industry, which is why we are pushing the European Commission for urgent clarification of the impact of this move on the UK.\" \"It's vital we protect trade flows between the UK and EU and we will work with our closest allies to address global challenges rather than adding to our industries' woes.\""
    },
    {
        "title": "Pro-Palestine protests on anniversary of October 7 'risk being seen as support for Hamas', says Universities UK boss",
        "description": "Pro-Palestine protests taking place on university campuses are \"at risk of being interpreted as support for the actions that Hamas committed on October 7th\", the chief executive of Universities UK has told Sky News.",
        "url": "https://news.sky.com/story/pro-palestine-protests-on-anniversary-of-october-7-risk-being-seen-as-support-for-hamas-says-universities-uk-boss-13446650",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-palestine-october-7_7045349.jpg?20251007192605",
        "type": "Politics",
        "Author": "Ben Bloch, political reporter, at Conservative Party conference",
        "Date Published": "2025-10-07 18:14:08",
        "Headline": "Students defied the prime minister's calls not to protest on the anniversary of the terror attack on Israel.",
        "Content": "By Ben Bloch, political reporter, at Conservative Party conference  Pro-Palestine protests taking place on university campuses are \"at risk of being interpreted as support for the actions that Hamas committed on October 7th\", the chief executive of Universities UK has told Sky News. Vivienne Stern, who leads the body representing 141 British universities, said that while protests against the war in Gaza have been a \"frequent feature of campus life\" in the last two years, \"protesting on this particular day means something different\", and could breach the law. The prime minister and education secretary both appealed to the public not to protest today, which is the second anniversary of the Hamas terror attacks on Israel that saw over 1,200 people killed and 251 taken hostage. Tap here for the latest from Conservative Party conference  Sir Keir Starmer wrote in The Times that the planned demonstrations showed a lack of respect for others, saying previous rallies had been used by some as a \"despicable excuse to attack British Jews\". But students defied his calls, and protests in support of the Palestinian cause and against Israel have been taking place on campuses across the country. At a fringe event at the Conservative Party conference in Manchester, shadow education secretary Laura Trott said: \"I think the idea that anybody can celebrate what happened on October 7 is utterly abhorrent, it's disgusting, it has no place in our universities. \n                  Lord Heseltine attacks Badenoch's new policies - and calls Farage a 'phoney'\n                 \n                  Kemi Badenoch reveals her 'golden rule' to 'get economy back on track'\n                 \n                  Robert Jenrick says Kemi Badenoch is 'right person' to lead party - despite poll\n                 \"I am absolutely clear that if there are protests or celebrations of this sort, I think it breaks existing laws. We don't need new laws, we need existing laws to be put in place. The police and universities need to be really hard on this.\" The chief executive of Universities UK, Vivienne Stern, later suggested that she agreed with Ms Trott, and speaking to Sky News after the event, she said: \"Pro-Palestinian protests have been a very frequent feature of campus life in the last two years. But protesting on this particular day means something different. \"And what we've asked people to do who may feel very strongly that they want to express support for Palestinians, to express their distress about what's happened in Gaza, should nonetheless understand that doing so today, on the anniversary of a huge atrocity will be interpreted as, or at least is at risk of being interpreted as, support for the actions that Hamas committed on October 7th. And that is quite different.\" Ms Stern emphasised that \"if somebody expresses support for Hamas, they're committing an offence under the Terrorism Act\". She went on to explain that universities have stepped up security ahead of these protests today, issued body-worn cameras so guards can \"record what is said and by whom\", and warnings have been issued by vice-chancellors. Asked if, given the potential for breaches of the law, universities have an obligation to stop the protests, Ms Stern said: \"Universities are bound by law to protect and indeed promote free speech, which generally means that they're under obligations to facilitate protest. \"The Office of Students in England has issued guidance which does make clear that they think even within that, there can be restrictions on the expressions of lawful views, so protests which don't step over that legal line, where the time, place or manner that that protest infringes somebody else's rights.\" She added that it \"may be a subjective judgement\", and is something that is likely going to be decided through case law.  Sky News contacted the Department for Education for a response to the comments by Ms Stern. In a statement issued yesterday, Education Secretary Bridget Phillipson said: \"The horrific tragedy in Manchester makes clear now more than ever that there is absolutely no place for antisemitic abuse or harassment, hate speech or violence in our society. \"I am a passionate believer that everyone is entitled to their political opinions, but any campaigning action must be conducted lawfully. \"I would urge those planning to protest to show decency and humanity when deciding whether to do so, given the immense pain many people in the Jewish community will be feeling on October 7th. \"I remain steadfast in my support for university vice-chancellors in tackling the scourge of antisemitic abuse and harassment on campuses, and I have written to them in support of their efforts.\" The Home Office has also been contacted for comment."
    },
    {
        "title": "Denmark proposes social media ban for under-15s - as PM hits out at 'monster'",
        "description": "The Danish government is proposing a ban on several social media apps for under-15s, according to the country's prime minister.",
        "url": "https://news.sky.com/story/denmark-proposes-social-media-ban-for-under-15s-as-pm-hits-out-at-monster-13446546",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-mette-frederiksen-denmark_7045129.jpg?20251007153929",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-07 14:34:01",
        "Headline": "Earlier this year, the Danish government announced it would ban mobile phones in schools and after-school clubs.",
        "Content": "\n          Science and technology reporter\n       The Danish government is proposing a ban on several social media apps for under-15s, according to the country's prime minister. \"We have unleashed a monster,\" Mette Frederiksen told Denmark's parliament on Tuesday. \"Mobile phones and social media are stealing our children's childhood.\" Research published by Denmark's wellbeing commission earlier this year found 94% of the country's young people had a social media profile before they turned 13 - despite that being the minimum age for many social media platforms. It also found nine to 14-year-olds were spending an average of three hours a day on TikTok and YouTube. Ms Frederiksen did not give details on how a ban would be enforced - an issue Australia is grappling with - but there is some public support for her proposal. In 2024, 50,000 people in Denmark signed a petition calling for a ban on TikTok, Snapchat and Instagram. \n                  Online safety laws to be toughened to make blocking of self-harm content a legal requirement\n                 \n                  Fake celebrity chatbots among those sending harmful content to children 'every five minutes'\n                 \n                  Hate speech, harassment and free speech: What you can't say online\n                 Parents should be able to give permission for their children to have accounts from the age of 13, according to Ms Frederiksen. Earlier this year, the Danish government also announced it would ban mobile phones in schools and after-school clubs, meaning that almost all children aged between seven and 16-17 will be required by law not to bring their phones into school.  Read more technology news:Bitcoin's price at record highs. Is it sustainable?Actor's daughter begs people to stop sending AI videos of himAlmost 15 million teens use vapes globally - report Denmark's restrictions follow similar moves around the world. In the UK, internet and social media companies now face fines of up to 10% of revenue if they allow young users to see harmful content, under sweeping legislation where age restrictions were placed on adult content.  The UK government has also refused to rule out an all-out ban on under-16s on social media. In Australia, under-16s will be banned from December, with the logistics of the ban currently being worked out. A recent study showed that a similar system to the UK's age verification could enforce the ban in the country. In France, a parliamentary commission recommended last month that children under 15 should be banned from social media in the country and there should be an overnight \"digital curfew\" for 15-18 year olds."
    },
    {
        "title": "Scientists develop first-ever blood test to diagnose chronic fatigue syndrome",
        "description": "A new blood test can diagnose chronic fatigue syndrome, also known as CFS or ME, with an accuracy of 96%, according to scientists who developed it.",
        "url": "https://news.sky.com/story/scientists-develop-first-ever-blood-test-to-diagnose-chronic-fatigue-syndrome-13446510",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-fatigue-tired-woman_7045495.jpg?20251008004738",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-07 12:34:17",
        "Headline": "CFS is a disabling illness characterised by extreme fatigue that is not relieved by rest.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n A new blood test can diagnose chronic fatigue syndrome, also known as CFS or ME, with an accuracy of 96%, according to scientists who developed it. The researchers, from the University of East Anglia, hope the breakthrough could pave the way for a similar test to diagnose long COVID. But other scientists warn the test needs to be independently validated in further clinical studies before being offered privately to patients who may be desperate to understand their debilitating symptoms. CFS is a disabling illness characterised by extreme fatigue that is not relieved by rest. Around 400,000 people in the UK have the condition, but its cause and treatment has been controversial. Professor Dmitry Pshezhetskiy, lead researcher, said: \"We know that some patients report being ignored or even told that their illness is 'all in their head'. \"With no definitive tests, many patients have gone undiagnosed or misdiagnosed for years. \"Our discovery offers the potential for a simple, accurate blood test to help confirm a diagnosis, which could lead to earlier support and more effective management.\" The researchers used technology developed by biotech company Oxford BioDynamics to analyse how DNA is folded in blood samples taken from 47 patients with severe symptoms and 61 people who were healthy. Each of our cells contain about two metres of DNA, which is tightly packed and folded millions of times. The folds aren't random - they help turn genes on or off. The folding and 3D structure of the genetic material isn't determined by the DNA code which we are born with and is largely fixed. Instead, life events can influence the folding, and which genes are active, a mechanism called \"epigenetics\". The researchers found people with CFS had a unique pattern in epigenetic markers, or chemical tags, on their DNA. Read more tech news:Almost 15 million teens using vapesAre Bitcoin's record highs sustainable?Robin Williams's daughter hits out at AI videos of him A test based on the pattern was able to identify 92% of people with CFS and 98% of those who were healthy. The overall accuracy was 96%. \"This is a significant step forward,\" said Prof Pshezhetskiy. \"For the first time, we have a simple blood test that can reliably identify ME/CFS - potentially transforming how we diagnose and manage this complex disease. \"Post-COVID syndrome, commonly referred to as long COVID, is one example of ME/CFS, where a similar cluster of symptoms is triggered by the COVID-19 virus, rather than by other known causes such as glandular fever. \"We therefore hope that our research will also help pave the way for a similar test to accurately diagnose long COVID.\" The study has been published in the Journal of Translational Medicine. Test 'likely' to be pricey Prof Chris Ponting, from the University of Edinburgh, who wasn't involved in the research, said the claims were premature because there were significant differences in sex, age and other factors between the people with CFS and the healthy controls. \"This test needs to be fully validated in better designed and independent studies before it is considered for clinical application,\" he said. \"Even if validated, the test will be expensive, likely around Â£1,000.\""
    },
    {
        "title": "Robin Williams's daughter begs people to stop sending her AI videos of her father",
        "description": "The daughter of late actor Robin Williams has begged people to stop sending her AI-generated \"slop\" of her father.",
        "url": "https://news.sky.com/story/robin-williamss-daughter-begs-people-to-stop-sending-her-ai-videos-of-her-father-13446454",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-zelda-robin-williams_7044855.jpg?20251007115920",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-07 10:55:30",
        "Headline": "Zelda Williams described the videos as \"disgusting, over-processed hotdogs\" made from the lives of human beings.Â ",
        "Content": "\n          Science and technology reporter\n       The daughter of late actor Robin Williams has begged people to stop sending her AI-generated \"slop\" of her father. \"Please, just stop sending me AI videos of Dad,\" actor and director Zelda Williams wrote on Instagram on Monday. \"To watch the legacies of real people be condensed down to 'this vaguely looks and sounds like them so that's enough', just so other people can churn out horrible TikTok slop puppeteering them is maddening.\" She described the videos as \"disgusting, over-processed hotdogs\" made from the lives of human beings. \"You're [...] shoving them down someone else's throat hoping they'll give you a little thumbs up and like it. Gross,\" she wrote. It's not the first time Williams has written about the impact of people sending her content about her father on social media.  In 2020, on the anniversary of her father's death, Williams posted on Instagram saying: \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \"While I am constantly touched by all of your boundless continued love for him, some days it can feel a bit like being seen as a roadside memorial - a place, not a person - where people drive past and leave their sentiments to then go about their days comforted their love for him was witnessed.\" \"But sometimes, that leaves me emotionally buried under a pile of others' memories instead of my own.\" Read more from technology:Bitcoin's price is at record highs. Is it sustainable?'Best month ever' for UK battery electric vehicle salesAlmost 15 million teens around world using vapes, report says The death of Robin Williams in 2014, an actor and comedian known for his quick wit and wisdom, triggered a global outpouring of grief and tributes to the star still frequently surface on social media to this day.  In 2023, Zelda appealed for the end of AI-generated content, saying in a widely-reported post on Instagram: \"I've witnessed for YEARS how many people want to train these models to create/recreate actors who cannot consent, like Dad. This isn't theoretical, it is very very real.\"â â \"I've already heard AI used to get his 'voice' to say whatever people want and while I find it personally disturbing, the ramifications go far beyond my own feelings.\""
    },
    {
        "title": "British scientist among Nobel prize winners for quantum research",
        "description": "A British scientist was among three awarded the Nobel Prize in Physics on Tuesday.&#160;",
        "url": "https://news.sky.com/story/british-scientist-among-nobel-prize-winners-for-quantum-research-13446492",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-john-clarke-nobel_7045151.jpg?20251007155405",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-07 11:54:25",
        "Headline": "According to the Nobel committee, the laureates' work from the 1980s is still helping to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors\".",
        "Content": "\n          Science and technology reporter\n       A British scientist was among three awarded the Nobel Prize in Physics on Tuesday.Â  John Clarke, Michel H Devoret and John M Martinis won the coveted prize for research on quantum tunnelling that is advancing digital technology. The three physicists share the 11m Swedish kronor (about Â£871,400) prize announced by the Royal Swedish Academy of Sciences in Stockholm. \"To put it mildly, it was the surprise of my life,\" Professor Clarke told reporters after being told he had won. He paid tribute to the other two laureates, saying \"their contributions are just overwhelming\". Professor Clarke added: \"Our discovery in some ways is the basis of quantum computing. Exactly at this moment where this fits in is not entirely clear to me.\" However, he said: \"One of the underlying reasons that cellphones work is because of all this work.\" \n                  Nobel Prize winner learnt of award off-grid - and thought his startled wife had seen a bear\n                 \n                  Nobel Prize committee unable to reach winner as he's 'hiking off-grid'\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 Dr Mark Mitchison, a quantum expert from King's College London's physics department, said many modern developments in quantum computing build on their discoveries. According to the Nobel committee, the laureates' work in the 1980s is still helping to develop \"the next generation of quantum technology, including quantum cryptography, quantum computers, and quantum sensors\". \"It is wonderful to be able to celebrate the way that century-old quantum mechanics continually offers new surprises. It is also enormously useful, as quantum mechanics is the foundation of all digital technology,\" said Olle Eriksson, chair of the Nobel Committee for Physics. Read more from technology:Is another spectacular Bitcoin comedown inevitable?'Best month ever' for UK battery electric vehicle salesAlmost 15 million teens around world using vapes, report says The 100-year-old field of quantum mechanics deals with the seemingly impossible subatomic world where switches can be on and off at the same time and parts of atoms tunnel through what seems like impenetrable barriers. The prize-winning trio's work helped take that into the larger world, where it has the potential to supercharge computing and communications. \"This year's Nobel Prize honoured the creation of an electrical circuit that behaves quantum mechanically when cooled to just above absolute zero,\" said Dr Eleanor Crane, quantum computing expert at King's College London. \"This discovery opened the door to studying quantum mechanics on a macroscopic scale. \"It also laid the groundwork for technologies such as superconducting quantum bits-used by companies like Google, IBM, Alice and Bob, IQM, and Oxford Quantum Circuits to make quantum computers. \"However, this Nobel Prize is not a statement about which quantum computing platform is the most promising - that is still an open question, with very impressive demonstrations being made in other platforms like neutral atoms and trapped ions.\" This is the 119th time the prize has been awarded, with artificial intelligence pioneers John Hopfield and Geoffrey Hinton winning last year for helping to create the building blocks of machine learning. On Monday, Mary E Brunkow, Fred Ramsdell and Shimon Sakaguchi won the Nobel Prize in medicine on Monday for their discoveries about the immune system."
    },
    {
        "title": "Nobel Prize winner learnt of award off-grid - and thought his startled wife had seen a bear",
        "description": "After hearing his wife scream while hiking, American scientist Fred Ramsdell thought she spotted a grizzly bear. ",
        "url": "https://news.sky.com/story/nobel-prize-winner-learnt-of-award-off-grid-and-thought-his-startled-wife-had-seen-a-bear-13446543",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sonoma-biotherapeutics_7045166.jpg?20251007161859",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-07 14:27:56",
        "Headline": "Scientist Fred Ramsdell, along with Mary Brunkow and Shimon Sakaguchi, won the Nobel Prize in Physiology or Medicine for his work onÂ how the immune system spares healthy cells.",
        "Content": "After hearing his wife scream while hiking, American scientist Fred Ramsdell thought she spotted a grizzly bear.  But, having just switched on her phone, she had discovered he had won the Nobel Prize in Physiology or Medicine, one of the most coveted prizes in science. Mr Ramsdell won the medicine award on Monday, along with American scientist Mary Brunkow and Shimon Sakaguchi from Japan, for their work on how the immune system spares healthy cells. However, the Nobel Assembly were unable to reach Mr Ramsdell and his wife as they were off-grid in the backcountry of Wyoming. Thomas Perlmann, secretary-general of the Nobel Assembly at the awarding body Karolinska Institute, said it took until Tuesday morning to reach them. He shared that the couple were walking back to their hotel when they stopped to fix something on their car, and she switched on her cell phone and saw the messages. \"They were still in the wild and there are plenty of grizzly bears there, so he was quite worried when she let out a yell,\" Mr Perlmann told Reuters. \n                  British scientist among Nobel prize winners for quantum research\n                 \n                  Nobel Prize committee unable to reach winner as he's 'hiking off-grid'\n                 \n                  Thailand and Cambodia agree to peace talks after Trump intervention - but shelling continues\n                 \"Fortunately, it was the Nobel Prize. He was very happy and elated and had not expected the prize at all.\" Mr Ramsdell, Ms Brunknow, and Mr Sakaguchi's discoveries relate to peripheral immune tolerance and could create openings for new autoimmune disease and cancer treatments. Read more from Sky News:'It is trauma': Two lives torn apart by October 7Stranded Mount Everest hikers being evacuated Marie Wahren-Herlenius, a rheumatology professor at Sweden's Karolinska Institute, explained their work as \"how we keep our immune system under control so we can fight all imaginable microbes and still avoid autoimmune disease\". The institute said all three laureates brought to the fore so-called regulatory T cells, a class of white blood cells that act as the immune system's security guards that keep immune cells from attacking the body. It's not the first time that Nobel Prize announcements haven't gone smoothly: Bob Dylan became the first musician ever to be awarded the prize in literature, and ended up ignoring it for weeks. When he did break his silence, he said he was \"speechless\". And in 2011, Canadian immunologist Ralph M Steinman was awarded one half of the Nobel Prize in Physiology or Medicine - three days after he died of pancreatic cancer."
    },
    {
        "title": "Why hot weather has triggered 'mast year' with big crop of acorns, conkers and berries",
        "description": "The UK's hottest summer on record has triggered a \"mast year\", when trees and shrubs produce an unusually large number of fruits and nuts like acorns, conkers and berries.",
        "url": "https://news.sky.com/story/why-hot-weather-has-triggered-mast-year-with-big-crop-of-acorns-conkers-and-berries-13446282",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-woodland-acorns_7044550.jpg?20251007032655",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-07 00:02:47",
        "Headline": "It is predicted that the UK will see a long, colourful autumn display in the coming weeks, after trees and shrubs reacted to volatile weather patterns this year by delivering a bumper crop.",
        "Content": "The UK's hottest summer on record has triggered a \"mast year\", when trees and shrubs produce an unusually large number of fruits and nuts like acorns, conkers and berries. But concerns about the hot and dry conditions creating a so-called \"false autumn\" have been allayed in some areas, according to the National Trust, after experiencing late rainfall. The conservation charity has set out its prediction for a long, colourful autumn display in the coming weeks, while also warning of the ongoing challenge of climate change. It says volatile weather patterns pose an increasing challenge for experts as they struggle to predict autumn conditions.  What is a 'mast year'? Berries, acorns, and fungi are already abundant and are a welcome boost for wildlife. But this year the weather has encouraged certain plants to produce a bumper crop of fruits, nuts and berries (whose collective term is \"mast\"). The National Trust says the UK is experiencing a \"mast year\", which typically happens around once every four years. This phenomenon involves trees and shrubs creating \"more food than animals can possibly eat\", according to the Woodland Trust, which adds that this guarantees some of the crop will be left over to survive and germinate. Emily Chandler, head gardener at the National Trust's Dunham Massey in Cheshire, said the volume of acorns is \"the largest we have ever seen\". Meanwhile, Claire McNally, head gardener at the Rowallane Garden in Northern Ireland, also said they are looking forward to their best berry season for at least five years. 'False autumn' averted The National Trust said weather conditions have put the brakes on the start of a \"false autumn\" in some areas, when prolonged hot, dry conditions can cause plants to prematurely shed leaves and ripen fruits too early. But showers in September have now put the season back on track, the charity said. Steve Feazey, Sheffield Park's head gardener in East Sussex, said: \"Our trees have had a good drink, and we are now hopeful that our autumn display will be as fiery and spectacular as ever.\" Although Martyn Burkinshaw, gardens and outdoors manager at Petworth House in West Sussex, said some veteran trees had died \"and others have already dropped their leaves for winter\". But he predicted that \"the way the colours are presenting now I'd estimate the best time for autumn colour will be mid-late October.\" Read more from Sky News:Summer 2025 was warmest on recordExtreme weather 'becoming the norm'Tree of the Year 2025 was wildcard entry Big fruit harvest In September, the National Trust reported a bumper crop of orchard fruit and pumpkins. Rebecca Bevan, plant health and sustainability consultant, said that climate change had brought \"some very challenging growing conditions over recent years\" but \"certainly fruit harvests are a success story for 2025\". \"This year's apple and other tree fruit harvests - including much of the abundance in hedgerows - is likely due to the wet conditions last year... followed by a dry and sunny spring. \"Lots of sun over the summer was then ideal for ripening the fruit,\" she added. But the dry weather has also had an impact on farmers, with the National Farmers Union (NFU) reporting in August that water shortages have impacted the growing season. \"Some farms are reporting a significant drop in yields, which is financially devastating for the farm business and could have impacts for the UK's overall harvest,\" NFU vice-president Rachel Hallos said."
    },
    {
        "title": "Robin Williams's daughter begs people to stop sending her AI videos of her father",
        "description": "The daughter of late actor Robin Williams has begged people to stop sending her AI-generated \"slop\" of her father.",
        "url": "https://news.sky.com/story/robin-williamss-daughter-begs-people-to-stop-sending-her-ai-videos-of-her-father-13446454",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-zelda-robin-williams_7044855.jpg?20251007115920",
        "type": "Entertainment",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-07 10:55:30",
        "Headline": "Zelda Williams described the videos as \"disgusting, over-processed hotdogs\" made from the lives of human beings.Â ",
        "Content": "\n          Science and technology reporter\n       The daughter of late actor Robin Williams has begged people to stop sending her AI-generated \"slop\" of her father. \"Please, just stop sending me AI videos of Dad,\" actor and director Zelda Williams wrote on Instagram on Monday. \"To watch the legacies of real people be condensed down to 'this vaguely looks and sounds like them so that's enough', just so other people can churn out horrible TikTok slop puppeteering them is maddening.\" She described the videos as \"disgusting, over-processed hotdogs\" made from the lives of human beings. \"You're [...] shoving them down someone else's throat hoping they'll give you a little thumbs up and like it. Gross,\" she wrote. It's not the first time Williams has written about the impact of people sending her content about her father on social media.  In 2020, on the anniversary of her father's death, Williams posted on Instagram saying: \n                  Trump to sign US-UK tech partnership in drive for AI\n                 \n                  OpenAI reveals how most people are using ChatGPT\n                 \n                  Starmer's 'AI superpower' dream at risk without urgent changes, industry warns\n                 \"While I am constantly touched by all of your boundless continued love for him, some days it can feel a bit like being seen as a roadside memorial - a place, not a person - where people drive past and leave their sentiments to then go about their days comforted their love for him was witnessed.\" \"But sometimes, that leaves me emotionally buried under a pile of others' memories instead of my own.\" Read more from technology:Bitcoin's price is at record highs. Is it sustainable?'Best month ever' for UK battery electric vehicle salesAlmost 15 million teens around world using vapes, report says The death of Robin Williams in 2014, an actor and comedian known for his quick wit and wisdom, triggered a global outpouring of grief and tributes to the star still frequently surface on social media to this day.  In 2023, Zelda appealed for the end of AI-generated content, saying in a widely-reported post on Instagram: \"I've witnessed for YEARS how many people want to train these models to create/recreate actors who cannot consent, like Dad. This isn't theoretical, it is very very real.\"â â \"I've already heard AI used to get his 'voice' to say whatever people want and while I find it personally disturbing, the ramifications go far beyond my own feelings.\""
    },
    {
        "title": "Man, 61, found guilty of stalking Myleene Klass after posting air gun and handcuffs",
        "description": "A 61-year-old man has been found guilty of stalking Myleene Klass by sending her an air gun, handcuffs, a police uniform and \"disturbing\" unwanted letters.",
        "url": "https://news.sky.com/story/man-61-found-guilty-of-stalking-myleene-klass-after-posting-air-gun-and-handcuffs-13446469",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-myleene-klass-peter-windsor_7037966.jpg?20251001095418",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-07 11:28:45",
        "Headline": "Peter Windsor, 61, was found guilty of stalking bothÂ Ms Klass and her Classic FM colleague Katie Breathwick, at Birmingham Crown Court on Tuesday.",
        "Content": "A 61-year-old man has been found guilty of stalking Myleene Klass by sending her an air gun, handcuffs, a police uniform and \"disturbing\" unwanted letters. Peter Windsor, 61, was found guilty of stalking both Ms Klass and her Classic FM colleague Katie Breathwick, at Birmingham Crown Court on Tuesday. Windsor, who suffers from schizophrenia and claimed to be not guilty by reason of insanity, sent the items to the station's central London studios between 2020 and 2024. Former Hear'Say star Ms Klass said last week how she felt \"sheer terror\" after being sent an air pistol, a silver ring and a police uniform. Mrs Breathwick also told the court of her horror at receiving a letter with details of a DIY will-writing kit, binoculars and perfume, as well as other \"raving\" and \"unhinged\" mail from Windsor, who she said left her in fear for her safety. It emerged during that trial that Windsor also sent a letter to former first minister Nicola Sturgeon he said was \"signed in blood\" and which \"pledged his soul to Satan\". He was arrested in January 2023 over the letter, which was posted to Ms Sturgeon in 2020, but a decision was taken not to prosecute him, his trial at Birmingham Crown Court was told. The court heard how Windsor, of Stechford in Birmingham, has used multiple names, including Peter Szymanski, and changed his surname to Windsor by deed poll. Answering questions from defence barrister Philip Brunt, Windsor said he had sent the items to the radio presenters and Ms Sturgeon as a \"pretend weird\" acting performance. Some of the items posted to Mrs Breathwick, including a stamp collection, had been an attempt to put her mind at rest that he was not a \"weirdo criminal\" drug addict, Windsor said. Saying he had a \"pretend obsession\" with Mrs Breathwick and Ms Klass and wanted to get in the newspapers, he added: \"I thought I would be arrested and let go the same day.\" Asked what his motivation had been for sending the items, Windsor replied: \"Just to try and draw attention to the plight of people who have been on benefit, like I have, for 30 years. \"They are always criminal suspects and police always come around to them for doing the slightest thing. I thought I will be a bit controversial. And maybe more people will know me and say 'there he is' in the pub.\" Windsor, who has been on remand throughout his trial, will be sentenced at Warwick Crown Court next month, with Judge Tom Rochford telling him that the options include prison or two types of hospital order. Read more from Sky News:Intruders cut fence to steal fuel from British Army garrisonBird of prey suffered 'harrowing death' after being poisoned The judge said the offences had \"clearly been a traumatic experience\" for both Ms Klass and Mrs Breathwick. In his closing speech to the jury on Monday, defence barrister Philip Brunt said Windsor had been diagnosed with paranoid schizophrenia for the past 30 years and had included his name and address in the correspondence. Mr Brunt added that Windsor had not followed anyone and was not told by anyone to stop sending letters."
    }
]