[
    {
        "title": "CCTV shows men in combat clothing shooting hospital volunteer at point-blank range in Syria",
        "description": "Sky News has obtained shocking CCTV from inside the main hospital in the city of Sweida in southern Syria - where our team found more than 90 corpses laid out in the grounds following a week of intense fighting.",
        "url": "https://news.sky.com/story/cctv-shows-men-in-combat-clothing-shooting-hospital-volunteer-at-point-blank-range-in-syria-13410285",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sweida-syria_6988422.jpg?20250811191444",
        "type": "Home",
        "Author": "Alex Crawford",
        "Date Published": "2025-08-11 16:44:00",
        "Headline": "The footage captured in the mainly Druze city of Sweida also shows a crowd of other terrified health workers being held at gunpoint with their hands in the air.",
        "Content": "\n          Special correspondent\n              @AlexCrawfordSky\n  Sky News has obtained shocking CCTV from inside the main hospital in the city of Sweida in southern Syria - where our team found more than 90 corpses laid out in the grounds following a week of intense fighting. Warning this article shows images of a shooting The CCTV images show men in army fatigues shooting dead a volunteer dressed in medical scrubs at point-blank range while a crowd of other terrified health workers are held at gunpoint with their hands in the air. The mainly Druze city of Sweida was the scene of nearly a week of violent clashes, looting and executions last month which plunged the new authorities into their worst crisis since the toppling of the country's former dictator Bashar al Assad. The new Syrian government troops were accused of partaking in the atrocities they were sent in to quell between the Druze minority and the Arab Bedouin minority groups. The government troops were forced to withdraw when Israeli jets entered the fray, saying they were protecting the Druze minority and bombed army targets in Sweida and the capital Damascus. Days of bloodletting ensued, with multiple Arab tribes, Druze militia and armed gangs engaging in pitched battles and looting before a ceasefire was agreed. \n                  Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit\n                 \n                  Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold\n                 \n                  Funeral held for five Al Jazeera journalists killed in Israeli strike in Gaza\n                 The government troops then set up checkpoints and barricades encircling Sweida to prevent the Arab tribes re-entering. The extrajudicial killing captured on CCTV inside the Sweida hospital is corroborated by eyewitnesses we spoke to who were among the group, as well as other medics in the hospital and a number of survivors and patients. The CCTV is date- and time-stamped as mid-afternoon on 16 July and the different camera angles show the men (who tell the hospital workers they are government troops) marauding through the hospital; and in at least one case, smashing the CCTV cameras with the butt of a rifle. One of the nurses present, who requested anonymity, told us: \"They told us if we talked about the shooting or showed any film, we'd be killed too. I thought I was going to die.\" Dr Obeida Abu Fakher, a doctor who was in the operating section at the time, told us: \"They told us they were the new Syrian army and interior police. We cannot have peace with these people. They are terrorists.\" Read more:Inside Sweida: The Syrian city ravaged by sectarian violenceWho are the Druze and who are they fighting in Syria?Why Israel is getting involved in Syria's internal fighting Multiple patients and survivors told us when we visited the hospital last month that government troops had participated in the horror which swept through Sweida for days but this is the first visual evidence that some took part in atrocities inside the main hospital. In other images, one of the men can be seen smashing the CCTV camera with the butt of his rifle - and another is wearing a black sweater which appears to be the uniform associated with the country's interior security. One survivor calling himself Mustafa Sehnawi, an American citizen from New Jersey, told us: \"It's the government who sent those troops, it's the government of Syria who killed those people... we need help.\" The government responded with a statement from the interior ministry saying they would be investigating the incident which they \"denounced and condemned\" in the strongest terms. The statement went on to promise all those involved would be \"held accountable\" and punished. The new Syrian president Ahmed al Sharaa is due to attend the United Nations General Assembly next month in New York - the first time a Syrian leader has attended since 1967 - and what happened in Sweida is certain to be among the urgent topics of discussion."
    },
    {
        "title": "Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold",
        "description": "And then there were two.",
        "url": "https://news.sky.com/story/trump-gaffe-reveals-how-central-putin-is-to-his-narrative-with-zelenskyy-left-out-in-the-cold-13410377",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-08-11 22:29:00",
        "Headline": "The US president has ruled out any trilateral meeting including Volodymyr Zelenskyy - for now this is a Trump-Putin power play.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  And then there were two. It will be a Trump-Putin bilateral summit in Alaska. Ukraine latest: Trump details talks with Putin The US president has ruled out a trilateral meeting including Volodymyr Zelenskyy and is framing the talks as low stakes. He described it as a \"feel out\" meeting \"to see what the parameters\" are, and stressed \"it's not up to me to make a deal.\" A strategic preemption perhaps, setting expectations low, and preparing the public for failure. But he remains wedded to the notion that \"land swapping\" will shape any deal to end the war in Ukraine. \"Good stuff\" and \"bad stuff\" for both sides, he said, positioning himself as the pragmatic mediator between the two. He expressed irritation with Mr Zelenskyy's assertion that he doesn't have the constitutional power to concede land, though did say he hopes to get \"prime territory\" back for Ukraine. The dealmaker-in-chief Mr Trump promised to brief the Ukrainian president and European leaders immediately after his meeting with Mr Putin. And he voiced confidence in his ability to quickly assess the potential for a deal, boasting his business acumen. \"At the end of the meeting, probably the first two minutes, I'll know exactly whether or not a deal can be made,\" he said. Asked how he would know, he replied: \"That's what I do, make deals.\" Members of his cabinet nodded in approval. Read more:Why Trump will have a lot of ice to break  A law-and-order crackdown in the US capital seems timed to bolster his diplomatic stance. He branded crime in Washington \"a national emergency\", took federal control of police and deployed the National Guard. It may seem strange that Mr Trump is talking about \"taking back\" Washington, ahead of a rare summit with Mr Putin. But he's positioning himself as bold and uncompromising before he faces a man deemed bold and uncompromising. A telling gaffe And he conflated the two, saying: \"This is a tragic emergency, and I'm going to see Putin, I'm going to Russia on Friday.\" He isn't going to Russia. He's going to Alaska. But that gaffe revealed how central Mr Putin is to his narrative, even domestically. Mr Putin wants to lock in the gains Russia has made since invading Ukraine, while Mr Trump presses for a ceasefire. But it's hard to envisage any ice-breaking peace deal emerging from Friday's summit in Alaska. How could there be when Mr Zelenskyy is out in the cold? For now, this is a Trump-Putin power play."
    },
    {
        "title": "UK weather: Water shortfall declared 'nationally significant' - as amber heat health alert set to strike",
        "description": "The water shortfall situation in England has been described as a \"nationally significant incident\", with five areas officially in drought ahead of an amber heat health alert coming into force for large parts of the country.",
        "url": "https://news.sky.com/story/uk-weather-water-shortfall-declared-nationally-significant-as-amber-heat-health-alert-set-to-strike-13410279",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-heatwave-drought-weather_6988543.jpg?20250812011413",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-11 16:38:00",
        "Headline": "Hot and dry conditions have returned this month, with the fourth heatwave of the year putting more pressure on already struggling public water supplies and navigational waterways.",
        "Content": "The water shortfall situation in England has been described as a \"nationally significant incident\", with five areas officially in drought ahead of an amber heat health alert coming into force for large parts of the country. Six further areas are experiencing prolonged dry weather following the driest six months to July since 1976. Many river flows and water reservoir levels in England continue to recede compared to June despite some storms and showers in July, which helped mask that it was still the fifth-warmest July on record. Drier conditions have returned in August and now parts of the country are bracing for the fourth heatwave 2025, with today's amber alert covering the East Midlands, West Midlands, East of England, London, and the South East. Temperatures are forecast to rise above 30C (86F) in some areas, possibly even soaring past 35C (95F) in the south, threatening this year's heat record of 35.8C (95.4F) in Faversham, Kent, on 1 July. A milder yellow heat health alert is in place for the South West, North East, North West, Yorkshire and The Humber. The alerts by the UK Health Security Agency (UKHSA) are due to be in place from 9am today until 6pm tomorrow, and put more pressure on struggling public water supplies and navigational waterways. Check the weather forecast where you are 'We are calling on everyone to play their part' The National Drought Group (NDG), which includes the Met Office, government, regulators, water companies, the National Farmers' Union, Canal & River Trust, anglers, and conservation experts, met at the start of the week to highlight the water-saving measures each sector is taking. The group praised the public for reducing their daily usage, after Yorkshire Water reported a 10% reduction in domestic demand following the introduction of their hosepipe ban, which saved up to 80 million litres per day. \"The situation is nationally significant, and we are calling on everyone to play their part and help reduce the pressure on our water environment,\" said Helen Wakeham, NDG chair and director of water at the Environment Agency. \"Water companies must continue to quickly fix leaks and lead the way in saving water. \"We know the challenges farmers are facing and will continue to work with them, other land users, and businesses to ensure everyone acts sustainably.\" - Drought has been declared in: Yorkshire, Cumbria and Lancashire, Greater Manchester Merseyside and Cheshire, East Midlands, West Midlands.    - Areas in prolonged dry weather (the phase before drought) are: Northeast, Lincolnshire and Northamptonshire, East Anglia, Thames, Wessex, Solent and South Downs.   - Yorkshire Water has a hosepipe ban in place for all its customers, while Thames, South East, and Southern Water have postcode-specific bans.   - Reservoirs fell by 2% last week and are now 67.7% full on average across England. The average for the first week of August is 80.5%. - The lowest reservoirs are Blithfield (49.1%), Derwent Valley (47.2%), Chew Valley Lake (48.3%), Blagdon (46.3%). - Rainfall in July was 89% of the long-term average for the month across England. This is the sixth consecutive month of below-average rainfall.     - Across the country, 51% of river flows were normal, with the rest below normal, notably low or exceptionally low.    - Two rivers – Wye and Ely Ouse – were the lowest on record for July. - There are currently navigation closures or restrictions across sections of the Leeds and Liverpool, Macclesfield, Trent and Mersey, Peak Forest, Rochdale, Oxford and Grand Union Canal.   The rainfall at the end of July was welcomed by growers, even though the dry weather is set to have an impact on the harvest, with the National Farmers Union (NFU) noting how water shortages have impacted the growing season. \"Some farms are reporting a significant drop in yields, which is financially devastating for the farm business and could have impacts for the UK's overall harvest,\" NFU vice-president Rachel Hallos said. Ms Hallos urged that investment in water infrastructure and a more effective planning system was urgently needed \"to avoid the swing between extreme drought and flooding and to secure water supplies for food production\". Read more:What is a heat-health alert?How heatwaves affect your healthWhere are hosepipe bans in place?  The dry weather also impacts the health of the waterways, as low water levels reduce oxygen levels in the water, which can lead to fish deaths, more algae growth, and could prevent wildlife from moving up or downstream. Water minister Emma Hardy said the government is \"urgently stepping up its response\" to respond to dry weather, including investment in new reservoirs, but called on firms to do their bit. \"Water companies must now take action to follow their drought plans,\" she said. \"I will hold them to account if they delay.\" \"We face a growing water shortage in the next decade,\" the minister warned, which she said is why building new reservoirs - something the government has criticised the previous administration for not doing - is so important. The hot and dry conditions have also led to warnings of wildfires, following blazes near Wimborne in Dorset and at Edinburgh's Arthur's Seat over the weekend."
    },
    {
        "title": "House of Lords under fire for dropping rule that once caught out cricket legend and historian",
        "description": "Campaigners have criticised a change to the rules around declarations of interest in the House of Lords as a \"retrograde step\" which will lead to a \"significant loss of transparency\".&#160;",
        "url": "https://news.sky.com/story/house-of-lords-under-fire-for-dropping-rule-that-once-caught-out-cricket-legend-and-historian-13410265",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lord-botham-lord-skidelsky_6988546.jpg?20250812023619",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-11 16:11:00",
        "Headline": "Peers no longer have to declare non-financial interests - a requirement that has previously caught out members of the House of Lords including ex-England cricketer Lord Botham and economic historian Lord Skidelsky.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Campaigners have criticised a change to the rules around declarations of interest in the House of Lords as a \"retrograde step\" which will lead to a \"significant loss of transparency\".  Since 2000, peers have had to register a list of \"non-financial interests\" - which includes declaring unpaid but often important roles like being a director, trustee, or chair of a company, think tank or charity. But that requirement was dropped in April despite staff concerns. Tom Brake, director of Unlock Democracy, and a former Liberal Democrat MP, wants to see the decision reversed. \"It's a retrograde step,\" he said. \"I think we've got a significant loss of transparency and accountability and that is bad news for the public. \"More than 25 years ago, the Committee on Standards in Public Life identified that there was a need for peers to register non-financial interests because that could influence their decisions. I'm confused as to what's happened in the last 25 years that now means this requirement can be scrapped. \"This process seems to be all about making matters simpler for peers, rather than what the code of conduct is supposed to do, which is to boost the public's confidence.\" Westminster Accounts: Search for your MP Rules were too 'burdensome', say peers The change was part of an overhaul of the code of conduct which aimed to \"shorten and clarify\" the rules for peers. The House of Lords Conduct Committee argued that updating non-financial interests was \"disproportionately burdensome\" with \"minor and inadvertent errors\" causing \"large numbers of complaints\". As a result, the register of Lords interests shrunk in size from 432 pages to 275. MPs have a different code of conduct, which requires them to declare any formal unpaid positions or other non-financial interests which may be an influence. A source told Sky News there is real concern among some Lords' staff about the implications of the change. Non-financial interest declarations have previously highlighted cases where a peer's involvement in a think tank or lobbying group overlapped with a paid role.  Cricket legend among peers to breach code There are also examples where a peer's non-financial interest declaration has prompted an investigation - revealing a financial interest which should have been declared instead. In 2023, Lord Skidelsky was found to have breached the code after registering his role as chair of a charity's trustees as a non-financial interest. The Commissioner for Standards investigated after questions were raised about the charity, the Centre for Global Studies. He concluded that the charity - which was funded by two Russian businessmen - only existed to support Lord Skidelsky's work, and had paid his staff's salaries for over 12 years. In 2021, Lord Botham - the England cricket legend - was found to have breached the code after registering a non-financial interest as an unpaid company director. The company's accounts subsequently revealed he and his wife had benefitted from a director's loan of nearly £200,000. It was considered a minor breach and he apologised. 'Follow the money' Lord Eric Pickles, the former chair of the anti-corruption watchdog, the Advisory Committee on Business Appointments, believes focusing on financial interests makes the register more transparent. \"My view is always to follow the money. Everything else on a register is camouflage,\" he said. \"Restricting the register to financial reward will give peers little wriggle room. I know this is counterintuitive, but the less there is on the register, the more scrutiny there will be on the crucial things.\" 'I was shocked' The SNP want the House of Lords to be scrapped, and has no peers of its own. Deputy Westminster leader Pete Wishart MP is deeply concerned by the changes. \"I was actually quite horrified and quite shocked,\" he said. \"This is an institution that's got no democratic accountability, it's a job for life. If anything, members of the House of Lords should be regulated and judged by a higher standard than us in the House of Commons - and what's happened is exactly the opposite.\" Public confidence in the Lords is already at a low ebb after the PPE controversy surrounding Baroness Michelle Mone, who took a leave of absence in 2022. The government has pledged to reform the House of Lords and is currently trying to push through a bill abolishing the 92 remaining hereditary peers, which will return to the House of Commons in September. But just before recess the bill was amended in the Lords so that they can remain as members until retirement or death. It's a change which is unlikely to be supported by MPs. Read more from Sky News:Warning over water shortfallTrump gaffe speaks volumes A spokesperson for the House of Lords said: \"Maintaining public confidence in the House of Lords is a key objective of the code of conduct. To ensure that, the code includes rigorous rules requiring the registration and declaration of all relevant financial interests held by members of the House of Lords. \"Public confidence relies, above all, on transparency over the financial interests that may influence members' conduct. This change helps ensure the rules regarding registration of interests are understandable, enforceable and focused on the key areas of public concern. \"Members may still declare non-financial interests in debate, where they consider them directly relevant, to inform the House and wider public. \"The Conduct Committee is appointed to review the code of conduct, and it will continue to keep all issues under review. During its review of the code of conduct, the committee considered written evidence from both Unlock Democracy and Transparency International UK, among others.\""
    },
    {
        "title": "'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant",
        "description": "Jellyfish have shut down four reactors at France's largest nuclear power plant.",
        "url": "https://news.sky.com/story/massive-and-unpredictable-swarm-of-jellyfish-shuts-down-nuclear-plant-13410357",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jellyfish-stock_6988511.jpg?20250811214036",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-11 20:27:00",
        "Headline": "The Gravelines site in France, which can power around 5 million homes, has temporarily stopped production while teams try to clear the blockage.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Jellyfish have shut down four reactors at France's largest nuclear power plant. The swarm entered the filter drums of the pumping stations at the Gravelines site in northern France on Sunday night. Operator EDF confirmed to Sky News that the \"massive and unpredictable presence of jellyfish\" caused units 2, 3 and 4 to automatically shut down between 11pm and midnight on 10 August. Unit 6 then shut down just after 6am on Monday 11 August. The plant, situated on the coast between Calais and Dunkirk, has six units which can produce a total of 5.4 gigawatts of power. In a statement, EDF said the pumping stations affected are in the non-nuclear part of the plant, adding the shutdowns \"had no impact on the safety of the facility, the safety of personnel or the environment\". The site, which can power around 5 million homes, has temporarily stopped production while teams try to clear the blockage. \n                  At least two dead as wildfires sweep across Greece, Turkey and France\n                 \n                  One dead as 'hellish' wildfire burns across area the size of Paris in southern France\n                 \n                  Cabinet minister admits UK-France migrant returns could be 'frustrated' by legal challenges\n                 Two unaffected units had already been taken offline for maintenance. Read more from Sky News:Amber heat health alert issued for parts of EnglandFirefighters dampen down blaze at Edinburgh landmark A spokesperson said France is still exporting more than four gigawatts of electricity to the UK. A boom in jellyfish numbers has been reported in the sea around Calais, likely due to rising water temperatures and increases in the plankton they eat. \"Jellyfish breed faster when water is warmer, and because areas like the North Sea are becoming warmer, the reproductive window is getting wider and wider,\" said Derek Wright, marine biology consultant at the National Oceanic and Atmospheric Administration Fisheries. \"Jellyfish can also hitch rides on tanker ships, entering the ships' ballast tanks in one port and often getting pumped out into waters halfway across the globe,\" he said. The Gravelines site draws water for its cooling systems from a canal connected to the North Sea, which is home to several species of jellyfish. The invertebrates have also been responsible for problems at several other coastal power stations, including the Torness nuclear plant in Scotland, where they have clogged the water intake pipes multiple times. In 1999, jellyfish were blamed for causing a massive blackout in the Philippines."
    },
    {
        "title": "'Appalling' surge in crimes at pharmacies - with one owner having to chase offenders away",
        "description": "Around nine in 10 pharmacies experienced shoplifting and an increase in aggressive behaviour in the last year, a survey has found.",
        "url": "https://news.sky.com/story/appalling-surge-in-crimes-at-pharmacies-with-one-owner-having-to-chase-offenders-away-13410070",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pharmacy-shoplifting_6988536.jpg?20250811234357",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-11 10:18:00",
        "Headline": "The National Pharmacy Association described a reported rise in shoplifting at pharmacies and staff facing aggressive behaviour as \"unacceptable\" and \"appalling\".",
        "Content": "Around nine in 10 pharmacies experienced shoplifting and an increase in aggressive behaviour in the last year, a survey has found. Of 476 pharmacies in England polled by the National Pharmacy Association (NPA), 88% said they have experienced a rise in shoplifting incidents. About 87% reported a surge in aggressive or intimidating behaviour towards pharmacy staff, while 22% said there had been physical assaults on team members. Almost three-quarters of those who reported these incidents to police felt the response was insufficient. Sanjeev Panesar, a pharmacy owner in Birmingham, said there has been a \"noticeable rise\" in shoplifting across his sites in the past 12 to 18 months, which includes some people filling up bags with stock before walking out. Mr Panesar said his staff \"can endure verbal abuse or physical intimidation\". \"Facing such hostility is not only disheartening but has a lasting effect on job satisfaction, morale, and feelings of safety at work,\" he said. He previously brought in security guards and even chased offenders off himself several times. Read more from Sky News:Amber heat health alert for EnglandFull-time workers relying on food handouts 'We need to do more' The NPA, which represents more than 6,000 community pharmacies, said the findings of the survey were \"unacceptable\" and \"appalling\". \"Although pharmacies are taking their own steps to protect their staff and premises, the police should do much more to tackle crimes like shoplifting, which is becoming increasingly commonplace,\" NPA chief executive Henry Gregg said. Mr Gregg also warned that the theft of strong painkillers or benzodiazepinesi \"could have serious consequences for someone's health\". Mr Gregg added: \"We need to do more to tackle shoplifting as well as offering pharmacies similar support to other NHS colleagues in primary care to protect their staff and their premises.\""
    },
    {
        "title": "Some call the Sussexes' Netflix deal a demotion - but the company still sees them as a power couple",
        "description": "While we're all desperate to know what this new deal is really worth in dollars and pounds, one thing I can tell you for certain is that Prince Harry and Meghan want us to know they're delighted that Netflix again wanted to get a deal done.",
        "url": "https://news.sky.com/story/some-call-the-sussexes-netflix-deal-a-demotion-but-the-company-still-sees-them-as-a-power-couple-13410313",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-prince-harry-meghan_6963912.jpg?20250713124746",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-11 18:07:00",
        "Headline": "Harry and Meghan are delighted with their new production deal - but some say it shows the couple aren't worth what they were back in 2020.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n While we're all desperate to know what this new deal is really worth in dollars and pounds, one thing I can tell you for certain is that Prince Harry and Meghan want us to know they're delighted that Netflix again wanted to get a deal done. \"Absolutely over the moon\" is how it was described to me. But they'll also be aware of the attention it'll attract as we all try to pick apart what it means. Firstly because of that ongoing fascination in how they're making money since stepping away from royal life and losing financial support from the King, but also because of the recent reports that Netflix were intending to cut ties. Yes this is a different type of deal from their original one in 2020. Some have argued that a \"first look deal\" looks like a demotion from what they previously signed up to. With no real clarity on how much their original deal was worth, and no numbers being publicly thrown around this time, that is hard to judge. But talking to those who know something about these kinds of deals you do get a sense it could potentially be more lucrative than it looks on face value. \n                  Meghan shares video of trip to Disneyland with Prince Harry and children Archie and Lilibet\n                 \n                  Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday\n                 \n                  Meghan speaks about difficulties balancing business and motherhood\n                 With first look deals, yes there is often financial commitments from the likes of Netflix to get that first exclusive look at projects and first refusal.  But there could be other significant monetary incentives for the Sussexes to sign. For example, when the Obamas signed a first look deal with Netflix, the streaming service agreed to pay the operational costs for their production company \"Higher Ground\". Could it be that Netflix are also now covering the costs of Archewell Productions? It's stating the obvious to say that Harry and Meghan continue to divide opinions, some wanting to watch their programmes from a place of respect and fondness, others as a reason to grumble about them. But signing on this latest dotted line shows Netflix still sees them as a power couple, who attract significant attention and are worthy of investment, whatever that really adds up to."
    },
    {
        "title": "Donald Trump will deploy National Guard troops to Washington DC to 're-establish law and order'",
        "description": "Donald Trump has announced he is going to deploy National Guard troops to Washington DC to make the US capital's streets safer.",
        "url": "https://news.sky.com/story/donald-trump-will-deploy-national-guard-troops-to-washington-dc-to-re-establish-law-and-order-13410192",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-national-guard-captiol_6988276.jpg?20250811162728",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-11 14:02:00",
        "Headline": "The US president announced he was deploying the National Guard to Washington DC, saying the capital \"should be one of the safest, cleanest and most beautiful cities anywhere in the world and we're going to make it that\".",
        "Content": " Donald Trump has announced he is going to deploy National Guard troops to Washington DC to make the US capital's streets safer. At a White House news conference on Monday, the president said the city's police would come under federal control as he said the murder rate in DC was \"higher than\" in some of the \"worst places on earth\". He said he was sending in 800 National Guard troops to \"re-establish law, order, and public safety\". Mr Trump said he was announcing a \"historic action to rescue our nation's capital from crime, bloodshed, bedlam and squalor and worse. \"This is liberation day in DC and we are going to take our capital back.\" The president continued: \"So today we are declaring a public safety emergency in the district of Columbia.\" He added it was not just about safety but also the \"beautification\" of the city. \n                  Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold\n                 \n                  Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit\n                 \n                  It's been four years since a US president met Putin - and Trump will have a lot of ice to break\n                 \"Washington DC should be one of the safest, cleanest and most beautiful cities anywhere in the world and we're going to make it that.\" Last week, the Republican president directed federal law enforcement agencies to increase their presence in Washington for seven days, with the option \"to extend as needed\". On Friday night, federal agencies including the Secret Service, the FBI and the US Marshals Service assigned more than 120 officers and agents to assist in Washington. National Guard troops usually belong to individual states and personnel in many cases are trained to help with emergencies that those states have to deal with, such as natural disasters. Read more from Sky News: Israel silences more crucial reporting voices from inside GazaMo Salah calls out UEFA over tribute to 'Palestinian Pele' Since they are the reserve force of the US military, National Guard troops are usually part-time, meaning that they have other jobs as well. DC Mayor Muriel Bowser said on Monday that the city had reached a 30-year low in violent crime. Ms Bowser said that crime was down not just from a post-pandemic peak in 2023, but from 2019 levels prior to the pandemic. She also said Mr Trump's announced takeover of DC police force was \"unsettling\". Minority leader of the US House of Representatives, Hakeem Jeffries, responded to Mr Trump's announcement on Monday with a post on X which read: \"Violent crime in Washington, DC is at a thirty-year low. \"Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. \"Get lost.\" Mr Trump also vowed to remove homeless encampments, but fell short of providing details on how or where homeless people would be moved. In a social media post on Sunday, Mr Trump said: \"The Homeless have to move out, IMMEDIATELY. \"We will give you places to stay, but FAR from the Capital. The Criminals, you don't have to move out. We're going to put you in jail where you belong.\""
    },
    {
        "title": "UK weather: Water shortfall declared 'nationally significant' - as amber heat health alert set to strike",
        "description": "The water shortfall situation in England has been described as a \"nationally significant incident\", with five areas officially in drought ahead of an amber heat health alert coming into force for large parts of the country.",
        "url": "https://news.sky.com/story/uk-weather-water-shortfall-declared-nationally-significant-as-amber-heat-health-alert-set-to-strike-13410279",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-heatwave-drought-weather_6988543.jpg?20250812011413",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-11 16:38:00",
        "Headline": "Hot and dry conditions have returned this month, with the fourth heatwave of the year putting more pressure on already struggling public water supplies and navigational waterways.",
        "Content": "The water shortfall situation in England has been described as a \"nationally significant incident\", with five areas officially in drought ahead of an amber heat health alert coming into force for large parts of the country. Six further areas are experiencing prolonged dry weather following the driest six months to July since 1976. Many river flows and water reservoir levels in England continue to recede compared to June despite some storms and showers in July, which helped mask that it was still the fifth-warmest July on record. Drier conditions have returned in August and now parts of the country are bracing for the fourth heatwave 2025, with today's amber alert covering the East Midlands, West Midlands, East of England, London, and the South East. Temperatures are forecast to rise above 30C (86F) in some areas, possibly even soaring past 35C (95F) in the south, threatening this year's heat record of 35.8C (95.4F) in Faversham, Kent, on 1 July. A milder yellow heat health alert is in place for the South West, North East, North West, Yorkshire and The Humber. The alerts by the UK Health Security Agency (UKHSA) are due to be in place from 9am today until 6pm tomorrow, and put more pressure on struggling public water supplies and navigational waterways. Check the weather forecast where you are 'We are calling on everyone to play their part' The National Drought Group (NDG), which includes the Met Office, government, regulators, water companies, the National Farmers' Union, Canal & River Trust, anglers, and conservation experts, met at the start of the week to highlight the water-saving measures each sector is taking. The group praised the public for reducing their daily usage, after Yorkshire Water reported a 10% reduction in domestic demand following the introduction of their hosepipe ban, which saved up to 80 million litres per day. \"The situation is nationally significant, and we are calling on everyone to play their part and help reduce the pressure on our water environment,\" said Helen Wakeham, NDG chair and director of water at the Environment Agency. \"Water companies must continue to quickly fix leaks and lead the way in saving water. \"We know the challenges farmers are facing and will continue to work with them, other land users, and businesses to ensure everyone acts sustainably.\" - Drought has been declared in: Yorkshire, Cumbria and Lancashire, Greater Manchester Merseyside and Cheshire, East Midlands, West Midlands.    - Areas in prolonged dry weather (the phase before drought) are: Northeast, Lincolnshire and Northamptonshire, East Anglia, Thames, Wessex, Solent and South Downs.   - Yorkshire Water has a hosepipe ban in place for all its customers, while Thames, South East, and Southern Water have postcode-specific bans.   - Reservoirs fell by 2% last week and are now 67.7% full on average across England. The average for the first week of August is 80.5%. - The lowest reservoirs are Blithfield (49.1%), Derwent Valley (47.2%), Chew Valley Lake (48.3%), Blagdon (46.3%). - Rainfall in July was 89% of the long-term average for the month across England. This is the sixth consecutive month of below-average rainfall.     - Across the country, 51% of river flows were normal, with the rest below normal, notably low or exceptionally low.    - Two rivers – Wye and Ely Ouse – were the lowest on record for July. - There are currently navigation closures or restrictions across sections of the Leeds and Liverpool, Macclesfield, Trent and Mersey, Peak Forest, Rochdale, Oxford and Grand Union Canal.   The rainfall at the end of July was welcomed by growers, even though the dry weather is set to have an impact on the harvest, with the National Farmers Union (NFU) noting how water shortages have impacted the growing season. \"Some farms are reporting a significant drop in yields, which is financially devastating for the farm business and could have impacts for the UK's overall harvest,\" NFU vice-president Rachel Hallos said. Ms Hallos urged that investment in water infrastructure and a more effective planning system was urgently needed \"to avoid the swing between extreme drought and flooding and to secure water supplies for food production\". Read more:What is a heat-health alert?How heatwaves affect your healthWhere are hosepipe bans in place?  The dry weather also impacts the health of the waterways, as low water levels reduce oxygen levels in the water, which can lead to fish deaths, more algae growth, and could prevent wildlife from moving up or downstream. Water minister Emma Hardy said the government is \"urgently stepping up its response\" to respond to dry weather, including investment in new reservoirs, but called on firms to do their bit. \"Water companies must now take action to follow their drought plans,\" she said. \"I will hold them to account if they delay.\" \"We face a growing water shortage in the next decade,\" the minister warned, which she said is why building new reservoirs - something the government has criticised the previous administration for not doing - is so important. The hot and dry conditions have also led to warnings of wildfires, following blazes near Wimborne in Dorset and at Edinburgh's Arthur's Seat over the weekend."
    },
    {
        "title": "House of Lords under fire for dropping rule that once caught out cricket legend and historian",
        "description": "Campaigners have criticised a change to the rules around declarations of interest in the House of Lords as a \"retrograde step\" which will lead to a \"significant loss of transparency\".&#160;",
        "url": "https://news.sky.com/story/house-of-lords-under-fire-for-dropping-rule-that-once-caught-out-cricket-legend-and-historian-13410265",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lord-botham-lord-skidelsky_6988546.jpg?20250812023619",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-11 16:11:00",
        "Headline": "Peers no longer have to declare non-financial interests - a requirement that has previously caught out members of the House of Lords including ex-England cricketer Lord Botham and economic historian Lord Skidelsky.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Campaigners have criticised a change to the rules around declarations of interest in the House of Lords as a \"retrograde step\" which will lead to a \"significant loss of transparency\".  Since 2000, peers have had to register a list of \"non-financial interests\" - which includes declaring unpaid but often important roles like being a director, trustee, or chair of a company, think tank or charity. But that requirement was dropped in April despite staff concerns. Tom Brake, director of Unlock Democracy, and a former Liberal Democrat MP, wants to see the decision reversed. \"It's a retrograde step,\" he said. \"I think we've got a significant loss of transparency and accountability and that is bad news for the public. \"More than 25 years ago, the Committee on Standards in Public Life identified that there was a need for peers to register non-financial interests because that could influence their decisions. I'm confused as to what's happened in the last 25 years that now means this requirement can be scrapped. \"This process seems to be all about making matters simpler for peers, rather than what the code of conduct is supposed to do, which is to boost the public's confidence.\" Westminster Accounts: Search for your MP Rules were too 'burdensome', say peers The change was part of an overhaul of the code of conduct which aimed to \"shorten and clarify\" the rules for peers. The House of Lords Conduct Committee argued that updating non-financial interests was \"disproportionately burdensome\" with \"minor and inadvertent errors\" causing \"large numbers of complaints\". As a result, the register of Lords interests shrunk in size from 432 pages to 275. MPs have a different code of conduct, which requires them to declare any formal unpaid positions or other non-financial interests which may be an influence. A source told Sky News there is real concern among some Lords' staff about the implications of the change. Non-financial interest declarations have previously highlighted cases where a peer's involvement in a think tank or lobbying group overlapped with a paid role.  Cricket legend among peers to breach code There are also examples where a peer's non-financial interest declaration has prompted an investigation - revealing a financial interest which should have been declared instead. In 2023, Lord Skidelsky was found to have breached the code after registering his role as chair of a charity's trustees as a non-financial interest. The Commissioner for Standards investigated after questions were raised about the charity, the Centre for Global Studies. He concluded that the charity - which was funded by two Russian businessmen - only existed to support Lord Skidelsky's work, and had paid his staff's salaries for over 12 years. In 2021, Lord Botham - the England cricket legend - was found to have breached the code after registering a non-financial interest as an unpaid company director. The company's accounts subsequently revealed he and his wife had benefitted from a director's loan of nearly £200,000. It was considered a minor breach and he apologised. 'Follow the money' Lord Eric Pickles, the former chair of the anti-corruption watchdog, the Advisory Committee on Business Appointments, believes focusing on financial interests makes the register more transparent. \"My view is always to follow the money. Everything else on a register is camouflage,\" he said. \"Restricting the register to financial reward will give peers little wriggle room. I know this is counterintuitive, but the less there is on the register, the more scrutiny there will be on the crucial things.\" 'I was shocked' The SNP want the House of Lords to be scrapped, and has no peers of its own. Deputy Westminster leader Pete Wishart MP is deeply concerned by the changes. \"I was actually quite horrified and quite shocked,\" he said. \"This is an institution that's got no democratic accountability, it's a job for life. If anything, members of the House of Lords should be regulated and judged by a higher standard than us in the House of Commons - and what's happened is exactly the opposite.\" Public confidence in the Lords is already at a low ebb after the PPE controversy surrounding Baroness Michelle Mone, who took a leave of absence in 2022. The government has pledged to reform the House of Lords and is currently trying to push through a bill abolishing the 92 remaining hereditary peers, which will return to the House of Commons in September. But just before recess the bill was amended in the Lords so that they can remain as members until retirement or death. It's a change which is unlikely to be supported by MPs. Read more from Sky News:Warning over water shortfallTrump gaffe speaks volumes A spokesperson for the House of Lords said: \"Maintaining public confidence in the House of Lords is a key objective of the code of conduct. To ensure that, the code includes rigorous rules requiring the registration and declaration of all relevant financial interests held by members of the House of Lords. \"Public confidence relies, above all, on transparency over the financial interests that may influence members' conduct. This change helps ensure the rules regarding registration of interests are understandable, enforceable and focused on the key areas of public concern. \"Members may still declare non-financial interests in debate, where they consider them directly relevant, to inform the House and wider public. \"The Conduct Committee is appointed to review the code of conduct, and it will continue to keep all issues under review. During its review of the code of conduct, the committee considered written evidence from both Unlock Democracy and Transparency International UK, among others.\""
    },
    {
        "title": "'Appalling' surge in crimes at pharmacies - with one owner having to chase offenders away",
        "description": "Around nine in 10 pharmacies experienced shoplifting and an increase in aggressive behaviour in the last year, a survey has found.",
        "url": "https://news.sky.com/story/appalling-surge-in-crimes-at-pharmacies-with-one-owner-having-to-chase-offenders-away-13410070",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pharmacy-shoplifting_6988536.jpg?20250811234357",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-11 10:18:00",
        "Headline": "The National Pharmacy Association described a reported rise in shoplifting at pharmacies and staff facing aggressive behaviour as \"unacceptable\" and \"appalling\".",
        "Content": "Around nine in 10 pharmacies experienced shoplifting and an increase in aggressive behaviour in the last year, a survey has found. Of 476 pharmacies in England polled by the National Pharmacy Association (NPA), 88% said they have experienced a rise in shoplifting incidents. About 87% reported a surge in aggressive or intimidating behaviour towards pharmacy staff, while 22% said there had been physical assaults on team members. Almost three-quarters of those who reported these incidents to police felt the response was insufficient. Sanjeev Panesar, a pharmacy owner in Birmingham, said there has been a \"noticeable rise\" in shoplifting across his sites in the past 12 to 18 months, which includes some people filling up bags with stock before walking out. Mr Panesar said his staff \"can endure verbal abuse or physical intimidation\". \"Facing such hostility is not only disheartening but has a lasting effect on job satisfaction, morale, and feelings of safety at work,\" he said. He previously brought in security guards and even chased offenders off himself several times. Read more from Sky News:Amber heat health alert for EnglandFull-time workers relying on food handouts 'We need to do more' The NPA, which represents more than 6,000 community pharmacies, said the findings of the survey were \"unacceptable\" and \"appalling\". \"Although pharmacies are taking their own steps to protect their staff and premises, the police should do much more to tackle crimes like shoplifting, which is becoming increasingly commonplace,\" NPA chief executive Henry Gregg said. Mr Gregg also warned that the theft of strong painkillers or benzodiazepinesi \"could have serious consequences for someone's health\". Mr Gregg added: \"We need to do more to tackle shoplifting as well as offering pharmacies similar support to other NHS colleagues in primary care to protect their staff and their premises.\""
    },
    {
        "title": "Girl, 16, and two teenage boys arrested on suspicion of murder after death of man on Isle of Sheppey",
        "description": "Three teenagers have been arrested following the death of a man in Kent.",
        "url": "https://news.sky.com/story/girl-16-and-two-teenage-boys-arrested-following-death-of-man-on-isle-of-sheppey-13410074",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sheppey-leysdown-on-sea_6988059.jpg?20250811125635",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-11 10:35:00",
        "Headline": "Kent Police said officers were called to reports of an altercation involving a small group of people in Leysdown-on-Sea on the Isle of Sheppey.",
        "Content": " Three teenagers have been arrested following the death of a man in Kent. Officers attended an incident in the seaside resort of Leysdown-on-Sea, on the Isle of Sheppey, shortly after 7pm on Sunday. Kent Police said officers were called to the Warden Bay Road area, where it was reported that an altercation broke out involving a small group of people and \"a man was assaulted, sustaining serious injuries\". A man in his 40s was confirmed dead at the scene. His next of kin has been informed, the force added. A short while later, a 16-year-old girl and two boys, aged 14 and 15, were arrested on suspicion of murder. They remain in custody pending further enquiries. Read more from Sky News:Amber heat health alert issued for parts of EnglandFirefighters dampen down blaze at Edinburgh landmark  Detectives are appealing for witnesses or anyone with information to come forward."
    },
    {
        "title": "Hitler-inspired boy planned terror attack at mosque, and pretended to convert to Islam to gain access",
        "description": "The leader of a mosque where a Hitler-inspired teenager was plotting a massacre has told Sky News of the moment the boy pretended to convert to Islam to gain access, weeks before a terror attack which police prevented.",
        "url": "https://news.sky.com/story/greenock-mosque-where-teenager-planned-massacre-says-it-acted-as-security-wake-up-call-13409526",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gillies-greenock-inverclyde_6987087.jpg?20250810080136",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-08-11 00:36:00",
        "Headline": "The teenager, who cannot be named for legal reasons, previously pleaded guilty under the terrorism act at the High Court in Glasgow.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  The leader of a mosque where a Hitler-inspired teenager was plotting a massacre has told Sky News of the moment the boy pretended to convert to Islam to gain access, weeks before a terror attack which police prevented. The boy, who was 16 years old at the time, idolised the Norwegian mass murderer Anders Breivik and was caught by detectives as he made his way to burn down the Inverclyde Muslim Centre in Greenock in January. He was hoping the mosque, which has a capacity of 275 worshippers, would be full. It is understood the teen had boasted online about his plans to livestream the attack after becoming radicalised on social media aged 13. The youth, who was dressed in black and carrying an air rifle, had successfully hoodwinked the imam that he was serious about switching religion. The young neo-Nazi, who cannot be legally identified because of his age, was left alone to film and draw sketches of the areas where his victims, including children, would be trapped as the planned firebomb attack unfolded. 'He told me a very shocking statement' For the first time, the mosque has given exclusive access to Sky News cameras as it reflects on the experience of people there and discusses the trust that has been broken. The centre's imam, Muhammad Bilal, recalled the moment he first encountered the teenager and allowed him to join in prayers in December 2024. Mr Bilal said: \"When he came here, he was a very good boy and only wanted to become Muslim. \"When he came, I gave him the Koran to get more knowledge. \"He told me a very shocking statement. He told me that he wanted a balanced life. 'What do you mean', I asked? He said: 'I want closer to my creator if I become Muslim.'\" The boy, who has an autism diagnosis, believed that white people were in a \"war\" against other races and had \"developed sympathies\" with the Nazi Party. Read more from Sky News:Huge fire breaks out on Arthur's SeatUK bracing for yet another heatwave 'It gives us a lesson for the future'  Hamid Akhtar from the Inverclyde Muslim Centre said the incident had acted as a wake-up call. He told Sky News: \"The frightening bit was that somebody was so nice and so conning. Making us a fool that he wanted to convert, and we were helping him in every way and trusting him. \"It gives us a lesson in future about who comes in and what their intentions are. We have more security cameras now.\" The boy created his own \"manifesto\" on his mobile phone in which he said he would \"die for my land.\" His initial idea, which he called \"hilarious\", was to carry out a terrorist attack at his school in Inverclyde. He recorded himself walking through the education facility saying he planned to \"liquidate\" one of the offices. The boy later boasted on Telegram about how he would ditch that idea and instead focus on the Greenock Mosque after managing to \"infiltrate\" the community. As the massacre plot edged closer, the boy prepared a \"final\" manifesto stating he would attack \"tomorrow\" when \"the mosque will be at its fullest\". On the morning in question, the boy left his home with a rucksack and messaged friends, saying: \"Today, I choose what my life was and will be.\" The boy appeared at the Islamic Centre but was unable to enter as the door was locked. Swastikas and explosive ingredients recovered  What he did not know was that police had received intelligence and were waiting to arrest him. Inside his bag, detectives discovered a German-manufactured air pistol - capable of firing BBs - as well as ball bearings, gas cartridges, and four cans of aerosol spray. Notepads containing swastikas were also recovered before officers later found a copy of Hitler's book Mein Kampf, knives, and ingredients for explosive substances at his house. The Inverclyde Islamic Centre told Sky News its community remains tighter than ever. Adeel Naeen said: \"The event is an isolated event, but I look at the community today and you see the number of people that come through the doors, so we are glad that the police were able to stop anything from happening. \"The community is still strong in terms of it's not putting people off from gathering here.\" The teenager previously pleaded guilty under the Terrorism Act at the High Court in Glasgow. He will be sentenced at a later date."
    },
    {
        "title": "Two girls arrested after historic hotel destroyed in suspected arson attack",
        "description": "Two teenage girls have been arrested in connection with a fire that severely damaged a historic Grade-II listed former hotel.",
        "url": "https://news.sky.com/story/two-girls-arrested-after-historic-hotel-destroyed-in-suspected-arson-attack-13410247",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-droitwich-spa-raven-hotel_6988044.jpg?20250811123055",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-11 15:17:00",
        "Headline": "The teenagers, aged 13 and 14, have been released on bail as part of a police inquiry into a \"devastating\" fire that destroyed the Raven Hotel in Droitwich Spa",
        "Content": "Two teenage girls have been arrested in connection with a fire that severely damaged a historic Grade-II listed former hotel. West Mercia Police said the teenagers, aged 13 and 14, had both been released on bail as part of its inquiry into damage caused to the Raven Hotel in Droitwich Spa, Worcestershire. Hereford and Worcester Fire and Rescue Service said it responded swiftly to the fire at 4.45pm on Sunday, with the first fire engine arriving on scene within two minutes of the initial emergency call. The brigade said eight fire engines and multiple specialist vehicles were deployed to tackle the blaze. No casualties were reported but the fire service said the blaze \"totally destroyed\" the building. On Monday, the West Mercia force said in a statement: \"Police attended a large fire at the Raven Hotel on St Andrews Street in Droitwich. \"It was believed the fire had been started deliberately but thankfully nobody has been injured. \"Two girls, 13 and 14, were arrested on suspicion of arson and have since been released on bail.\" \n                  UK weather: Water shortfall declared 'nationally significant' - as amber heat health alert set to strike\n                 \n                  PM on brink of unwanted small boats milestone - and far faster than his Tory predecessors\n                 \n                  House of Lords under fire for dropping rule that once caught out cricket legend and historian\n                 Officers remain at the scene and are asking that the public stay away from the area at this time. Wychavon District Council erected scaffolding around the privately-owned building following an incident in September 2024, when guttering and debris fell on to the road. This event also led the council to carry out an urgent inspection, which revealed that the state of the unused structure - some parts of which date back to the 16th century - presented a danger to the public. Fire service group commander Simon Cusack said: \"This was a challenging incident, and I want to commend the professionalism and dedication of our firefighters and partner agencies. \"The rapid response and teamwork ensured that the fire was quickly contained and extinguished without injury. We appreciate the public's support and will continue to work with the local authority and business owner to secure the site.\" Read more:Amber heat health alert issued for large parts of EnglandBritish researcher remains found in glacier 60 years after he died The district council said it shared the community's frustration over the \"devastating\" fire and was working closely with the fire service to assess the building and provide guidance on the next steps. The council said in a statement: \"We understand completely the strength of feeling and affection for this historic building and the significance it has for the town. \"Over the last six months we had been working hard to ensure that urgent works were carried out to protect the building in line with the court order we secured late last year. These works were due to finish this week and we will still invoice the owner for payment.\" The council said it will release another statement once there is an update on the condition and safety of the structure."
    },
    {
        "title": "'Devastated' boyfriend covered ex-partner's body with blanket and left her undiscovered on sofa for years",
        "description": "A \"devastated\" boyfriend who found his ex-partner dead on his sofa covered up her body with a blanket and left her undiscovered for years, a court heard.",
        "url": "https://news.sky.com/story/devastated-boyfriend-covered-ex-partners-body-with-blanket-and-left-her-undiscovered-on-sofa-for-years-13410253",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jamie-stevens-anouska-sites_6988221.jpg?20250811155914",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-11 15:32:00",
        "Headline": "Jamie Stevens, who carried on living in the flat in Torquay, Devon, as the body of Anouska Sites remained in the lounge, has admitted she \"deserved better\", his lawyer said.",
        "Content": "A \"devastated\" boyfriend who found his ex-partner dead on his sofa covered up her body with a blanket and left her undiscovered for years, a court heard. Jamie Stevens, who carried on living in the flat in Torquay, Devon, as the body of Anouska Sites remained in the lounge, has admitted she \"deserved better\", his lawyer said. The 51-year-old was jailed for 14 months at Exeter Crown Court after pleading guilty to charges of preventing a lawful burial and perverting the course of justice. The second charge related to Stevens lying to police in a witness statement about his knowledge of the whereabouts of Ms Sites. Ms Sites' death is not being treated as suspicious and a file will be submitted to the coroner in due course, Devon and Cornwall Police have said. The last known sighting of Ms Sites, who who would now be 36, was in May 2022 and her remains were not discovered until May 2025, Exeter Crown Court heard. Hollie Gilbery, prosecuting, told the court Ms Sites was reported missing to the police in April 2023. \n                  UK weather: Water shortfall declared 'nationally significant' - as amber heat health alert set to strike\n                 \n                  PM on brink of unwanted small boats milestone - and far faster than his Tory predecessors\n                 \n                  House of Lords under fire for dropping rule that once caught out cricket legend and historian\n                 \"Inquiries confirmed she had last been seen by police in May the previous year,\" she said. \"Unfortunately, due to her vulnerabilities, including mental health problems and addictions, she had been in fairly regular contact with the police.\" Ms Gilbery said contact was made with Stevens as a former partner of Ms Sites in April this year, making inquiries about her whereabouts. \"He told the police he had no contact with Ms Sites since February or March 2022,\" she said. Police spoke with Stevens again on 27 May and he told them he was no longer living at the flat in Upton Road. Officers later went round and gained entry. \"The officers who attended described the flat as being like that of a hoarder with rubbish, faeces and bottled urine scattered throughout the property,\" Ms Gilbery said. \"Police started to search the flat, and upon lifting a blanket in the living area they discovered a skeletal arm and hand. \"Officers did notice there were various fragranced items scattered around the lounge, inferring they must have been to mask any smells.\" Stevens, of Reddenhill Road, Torquay, who was in a relationship with Ms Sites between 2011 and 2014, was arrested and told police it was her body. \"He explained she had come to his flat around January 2023 asking if she could stay the night,\" the prosecutor said. \"He went to his own bed and left her sleeping in the living room. \"The next day he had gone out, returning at about 11.30pm, assuming that Ms Sites would have left, but instead he found her on the sofa. \"He explained he threw a blanket over her body and continued to live in his bedroom and never really returned to the lounge.\" Read more from Sky News:Huge fire breaks out on Arthur's SeatUK bracing for yet another heatwave Paul Dentith, defending, described Stevens's actions in not reporting the death of Ms Sites as a \"passive failure\". \"Until he signs the statement saying he hasn't seen Ms Sites for a number of years,\" he said. \"That is the perverting the course of justice, which moves it to more than just passive non-reporting. \"Perhaps obvious, but when one fails to report something so serious in the first day or so, it becomes rather self-perpetuating. \"The fear of reporting it... even a week or so later.\" Mr Dentith said Stevens had told him: \"Ms Sites was a lovely person, my partner, my friend, and I was devastated when she died, and I miss her terribly. She deserved better.\" Jailing Stevens for 14 months, Judge Anna Richardson said: \"This is an absolutely tragic case. \"You were in a relationship with Anouska Sites. Ms Sites had a number of difficulties, including substance misuse. \"It seems at some time between mid-2022 and April 2023 Miss Sites went missing. She was not reported missing until April this year. \"There is no reason on the basis of the post-mortem to doubt your account of having found Miss Sites dead in your address. \"It seems you completely wrongly panicked and simply covered her body. You left her there for years.\""
    },
    {
        "title": "What does the data tell us about road traffic accidents in the UK?",
        "description": "Under \"tougher\" plans to tackle road deaths and injuries in England and Wales, the government has announced measures to make over-70s take compulsory eye tests every three years or lose their driving licence.",
        "url": "https://news.sky.com/story/what-does-the-data-tell-us-about-road-traffic-accidents-13410166",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-car-crash-data-data-and-forensics_6988378.png?20250811175308",
        "type": "UK",
        "Author": "Daniel Dunford",
        "Date Published": "2025-08-11 13:25:00",
        "Headline": "Where in the country are you most likely to die in a road accident? How does driving safety in the UK compare to other countries? And what proportion of road deaths come from over-70s? The Sky News Data and Forensics team breaks down what the data tells us.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n Under \"tougher\" plans to tackle road deaths and injuries in England and Wales, the government has announced measures to make over-70s take compulsory eye tests every three years or lose their driving licence. But are they really needed? Motorists over the age of 70 already self-report their medical fitness to drive every three years, and British roads are safer now than they've ever been. In 2023, the latest year for which the Department for Transport has published data, the casualty rate on British roads fell to 398 per billion vehicle miles. It's the first time that figure has been under 400, and has halved since just 2006. In 1960, the casualty rate was 10 times higher than it is now. The total number of people killed on the UK's roads also reached a record low in 2023, other than the COVID-affected years of 2020 and 2021. There were 1,624 people killed in total, just under half of which were in cars. This figure has plateaued somewhat since 2010, however, after rapid improvements between 2006 and 2010. There was a similar plateau between 1994 and 2006 before the last significant piece of road safety legislation was introduced. The 2006 Road Safety Act introduced higher fines and more points for the most severe speeding offences, as well as vastly expanding the use of speed awareness courses. It was also the first year that people could get points on their licence for using their phone. In the four years that followed, there was a 40% decrease in deaths among road users. In the 13 years since then, it's fallen just 12%. There had been a slight rise in deaths among older drivers for a few years between 2014 and 2019, but that has started to fall again now. There are now fewer deaths among over-70s compared with either the under-30s, people aged 30-49, or those between 50 and 69. In 2019, there were a similar number of deaths among people of each of these age cohorts. Academic studies have previously found that older people are also more likely to develop symptoms of depression, be admitted to care facilities, and even have a higher mortality rate, once they stop driving. The academics found that those links remained even after adjusting for other factors like baseline health and cognitive ability. Caroline Abrahams, charity director at Age UK, said: \"It is certainly good for our eye health as we age to have a regular eye test - every two years the NHS advises - but this doesn't automatically mean that a compulsory eye test at age 70 is appropriate. People can develop eye problems at any age so why confine such an approach only to those aged 70 and not to younger drivers too?\"From the data we have seen, there is no reason to suppose that eye problems lie behind a significant proportion of accidents. While there may be a case for introducing a regular mandatory eye test for drivers of all ages, it is not clear that this would have a big impact on the numbers of serious accidents involving older drivers.\" Are younger drivers a danger to themselves? Edmund King, president of the Automobile Association, said that the government's strategy is \"much overdue\", while pointing to the figures showing that the number of road deaths have plateaued since 2010. He said that making vision checks compulsory for older drivers was a \"practical step that can make a real difference\", but added that failing to introduce a six-month limit on new drivers transporting passengers of a similar age is \"a major oversight\". A limit like this has been active in parts of Australia since 2007. Research by road safety charity Brake says that, in the UK, around one in five drivers crash within a year of passing their test. The Department for Transport data also shows that younger people are also significantly more likely to die as passengers compared to people in other age groups. There has also been a suggestion that younger drivers are more likely to die as a result of not wearing seatbelts. More than a third of 17-29-year-olds who die on the roads didn't have their seatbelts on. But the same is true of 30-59 year olds. There is a significant difference between men and women however - 31% of men who died did so without wearing a seatbelt, compared with just 11% of women. That also means that 89% of women who died on the roads did so despite wearing a seatbelt, perhaps adding to evidence that suggests that seatbelts offer better protection to adult men. Drink-driving Since 2014, Scotland has had a lower drink-drive limit than the rest of the UK. The government's new proposals would reduce the drink-drive limit in England and Wales to the same level as in Scotland - 50mg of alcohol per 100ml of blood, instead of the current level of 80mg of alcohol. For an average-sized man, that means they would be over the limit after one pint of beer, instead of after two. In diverging from the other nations in the UK, the new standards in Scotland aligned with most of Europe. It seems to have had some impact. The number of collisions involving drink drivers has fallen by more than 40% in Scotland since it was introduced, compared with 20% in England over the same time period, and 38% in Wales. The improvement is less pronounced when it comes to the most serious drink-driving road accidents, though. They are down just 7% since 2014. Where are the safest, and most dangerous, places to drive? The Isle of Wight has the highest current fatality rate, after accounting for how much driving people do. There were 18 deaths per billion vehicle miles on the island in 2023. Next was Blackpool, with 16. The central London boroughs of Westminster, Kensington and Chelsea, and Lambeth were the only other local authorities with a rate higher than 10. At the other end of the scale, Stockport (Greater Manchester), Thurrock (Essex) and Nottingham each had fewer than one death per billion vehicle miles. When it comes to accidents that included not just deaths but also serious injuries, London has the worst record. Drivers in Westminster were most likely to end up in a serious collision, but the nine most dangerous local authorities in Great Britain were all London boroughs. Bradford completed the bottom 10. Bath and North East Somerset was the safest area, although three Welsh areas - Bridgend, Neath Port Talbot and Cardiff - joined South Gloucestershire in the top five. Scottish drivers were among the most likely to avoid being in crashes altogether. Eight of the 10 local authorities with the lowest overall collision rate were north of the border, although Rutland in the East Midlands had the lowest overall rate. The top 20 areas with the most collisions per mile driven were all in London. How does driving in the UK compare with other countries? The UK is one of the safest places to drive in Europe. Only Norway and Sweden had a lower rate of road deaths per head of population in 2023 than the UK's 25 deaths per million people. The figures in places like Italy, Greece and Portugal were more than twice as high. There aren't any directly comparable figures for 2023 for the US, but in 2022 their death rate from driving was five times as high as the UK, and 50% higher than the worst performing European country - Bulgaria. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "CCTV shows men in combat clothing shooting hospital volunteer at point-blank range in Syria",
        "description": "Sky News has obtained shocking CCTV from inside the main hospital in the city of Sweida in southern Syria - where our team found more than 90 corpses laid out in the grounds following a week of intense fighting.",
        "url": "https://news.sky.com/story/cctv-shows-men-in-combat-clothing-shooting-hospital-volunteer-at-point-blank-range-in-syria-13410285",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sweida-syria_6988422.jpg?20250811191444",
        "type": "World",
        "Author": "Alex Crawford",
        "Date Published": "2025-08-11 16:44:00",
        "Headline": "The footage captured in the mainly Druze city of Sweida also shows a crowd of other terrified health workers being held at gunpoint with their hands in the air.",
        "Content": "\n          Special correspondent\n              @AlexCrawfordSky\n  Sky News has obtained shocking CCTV from inside the main hospital in the city of Sweida in southern Syria - where our team found more than 90 corpses laid out in the grounds following a week of intense fighting. Warning this article shows images of a shooting The CCTV images show men in army fatigues shooting dead a volunteer dressed in medical scrubs at point-blank range while a crowd of other terrified health workers are held at gunpoint with their hands in the air. The mainly Druze city of Sweida was the scene of nearly a week of violent clashes, looting and executions last month which plunged the new authorities into their worst crisis since the toppling of the country's former dictator Bashar al Assad. The new Syrian government troops were accused of partaking in the atrocities they were sent in to quell between the Druze minority and the Arab Bedouin minority groups. The government troops were forced to withdraw when Israeli jets entered the fray, saying they were protecting the Druze minority and bombed army targets in Sweida and the capital Damascus. Days of bloodletting ensued, with multiple Arab tribes, Druze militia and armed gangs engaging in pitched battles and looting before a ceasefire was agreed. \n                  Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit\n                 \n                  Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold\n                 \n                  Funeral held for five Al Jazeera journalists killed in Israeli strike in Gaza\n                 The government troops then set up checkpoints and barricades encircling Sweida to prevent the Arab tribes re-entering. The extrajudicial killing captured on CCTV inside the Sweida hospital is corroborated by eyewitnesses we spoke to who were among the group, as well as other medics in the hospital and a number of survivors and patients. The CCTV is date- and time-stamped as mid-afternoon on 16 July and the different camera angles show the men (who tell the hospital workers they are government troops) marauding through the hospital; and in at least one case, smashing the CCTV cameras with the butt of a rifle. One of the nurses present, who requested anonymity, told us: \"They told us if we talked about the shooting or showed any film, we'd be killed too. I thought I was going to die.\" Dr Obeida Abu Fakher, a doctor who was in the operating section at the time, told us: \"They told us they were the new Syrian army and interior police. We cannot have peace with these people. They are terrorists.\" Read more:Inside Sweida: The Syrian city ravaged by sectarian violenceWho are the Druze and who are they fighting in Syria?Why Israel is getting involved in Syria's internal fighting Multiple patients and survivors told us when we visited the hospital last month that government troops had participated in the horror which swept through Sweida for days but this is the first visual evidence that some took part in atrocities inside the main hospital. In other images, one of the men can be seen smashing the CCTV camera with the butt of his rifle - and another is wearing a black sweater which appears to be the uniform associated with the country's interior security. One survivor calling himself Mustafa Sehnawi, an American citizen from New Jersey, told us: \"It's the government who sent those troops, it's the government of Syria who killed those people... we need help.\" The government responded with a statement from the interior ministry saying they would be investigating the incident which they \"denounced and condemned\" in the strongest terms. The statement went on to promise all those involved would be \"held accountable\" and punished. The new Syrian president Ahmed al Sharaa is due to attend the United Nations General Assembly next month in New York - the first time a Syrian leader has attended since 1967 - and what happened in Sweida is certain to be among the urgent topics of discussion."
    },
    {
        "title": "Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit",
        "description": "Donald Trump has said he would try to return territory to Ukraine as he prepares to meet Vladimir Putin and lay the groundwork for a deal to bring an end to the war.",
        "url": "https://news.sky.com/story/trump-says-he-hopes-to-get-prime-territory-back-for-ukraine-as-he-prepares-for-putin-summit-13410320",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-press_6988350.jpg?20250811173050",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-11 18:32:00",
        "Headline": "Asked if Volodymyr Zelenskyy was invited to the meeting with Vladimir Putin in Alaska, Donald Trump said the Ukrainian leader \"wasn't a part of it\".",
        "Content": " Donald Trump has said he would try to return territory to Ukraine as he prepares to meet Vladimir Putin and lay the groundwork for a deal to bring an end to the war. \"Russia has occupied a big portion of Ukraine. They've occupied some very prime territory. We're going to try and get some of that territory back for Ukraine,\" the US president said at a White House news conference ahead of Friday's summit in Alaska. Mr Trump also said: \"There'll be some land swapping going on. I know that through Russia and through conversations with everybody, to the good of Ukraine.\" He said he's going to see what Mr Putin \"has in mind\" to end the three-and-a-half-year full-scale invasion. And he said if it's a \"fair deal,\" he will share it with European and NATO leaders, as well as Volodymyr Zelenskyy, who have been liaising closely with Washington ahead of the meeting. Asked if Mr Zelenskyy was invited to the summit with Mr Putin in Alaska, Mr Trump said the Ukrainian leader \"wasn't a part of it\". \"I would say he could go, but he's gone to a lot of meetings. You know, he's been there for three and a half years - nothing happened,\" Mr Trump added. \n                  Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold\n                 \n                  Donald Trump will deploy National Guard troops to Washington DC to 're-establish law and order'\n                 \n                  It's been four years since a US president met Putin - and Trump will have a lot of ice to break\n                 The US president said Mr Putin wants to get the war \"over with\" and \"get involved\" in possible talks but acknowledged Moscow's attacks haven't stopped. \"I've said that a few times and I've been disappointed because I'd have a great call with him and then missiles would be lobbed into Kyiv or some other place,\" he said. Mr Trump said he will tell Mr Putin \"you've got to end this war, you've got to end it,\" but that \"it's not up to me\" to make a deal between Russia and Ukraine. Zelenskyy says Russia 'wants to buy time' Ukrainian President Volodymyr Zelenskyy has said Russia \"wants to buy time, not end the war\". \"It is obvious that the Russians simply want to buy time, not end the war,\" he wrote in a post on X, after a phone call with Canada's Prime Minister Mark Carney. \"The situation on the battlefield and Russia's wicked strikes on civilian infrastructure and ordinary people prove this clearly.\" Mr Zelenskyy said the two \"agreed that no decisions concerning Ukraine's future and the security of our people can be made without Ukraine's participation\", just as \"there can be no decisions without clear security guarantees\". Sanctions against Russia must remain in force and be \"constantly strengthened,\" he added. European leaders meet ahead of call with Trump Meanwhile, European officials have been holding meetings ahead of a phone call with Mr Trump on Wednesday. The European Union's foreign policy chief, Kaja Kallas, has been speaking to foreign ministers virtually, saying on X that work \"on more sanctions against Russia, more military support for Ukraine and more support for Ukraine's budgetary needs and accession process to join the EU\" is under way.  Over the weekend, European leaders released a joint statement, welcoming Mr Trump's \"work to stop the killing in Ukraine\". \"We are convinced that only an approach that combines active diplomacy, support to Ukraine and pressure on the Russian Federation to end their illegal war can succeed,\" read the statement. It was signed by UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz, Polish Prime Minister Donald Tusk, Finland's President Alexander Stubb, and European Commission President Ursula von der Leyen. \"We underline our unwavering commitment to Ukraine's sovereignty, independence and territorial integrity,\" they said. Read more from Sky News:Trump will deploy National Guard to WashingtonCCTV shows hospital volunteer being shot dead at point-blank range Attacks continue Despite Donald Trump's efforts to convince Vladimir Putin to commit to a ceasefire and negotiations, Russian attacks on Ukraine have only intensified in the past few months. Ukraine's president has said that, in the past week, Russia launched more than 1,000 air bombs, nearly 1,400 drones and multiple missile strikes on Ukraine. On 9 July, Russia carried out its largest aerial attack on Ukraine since the start of the war, launching more than 740 drones and missiles, breaking its records from previous weeks. Furthermore, Mr Zelenskyy has said Russia is preparing for new offensives."
    },
    {
        "title": "Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold",
        "description": "And then there were two.",
        "url": "https://news.sky.com/story/trump-gaffe-reveals-how-central-putin-is-to-his-narrative-with-zelenskyy-left-out-in-the-cold-13410377",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-08-11 22:29:00",
        "Headline": "The US president has ruled out any trilateral meeting including Volodymyr Zelenskyy - for now this is a Trump-Putin power play.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  And then there were two. It will be a Trump-Putin bilateral summit in Alaska. Ukraine latest: Trump details talks with Putin The US president has ruled out a trilateral meeting including Volodymyr Zelenskyy and is framing the talks as low stakes. He described it as a \"feel out\" meeting \"to see what the parameters\" are, and stressed \"it's not up to me to make a deal.\" A strategic preemption perhaps, setting expectations low, and preparing the public for failure. But he remains wedded to the notion that \"land swapping\" will shape any deal to end the war in Ukraine. \"Good stuff\" and \"bad stuff\" for both sides, he said, positioning himself as the pragmatic mediator between the two. He expressed irritation with Mr Zelenskyy's assertion that he doesn't have the constitutional power to concede land, though did say he hopes to get \"prime territory\" back for Ukraine. The dealmaker-in-chief Mr Trump promised to brief the Ukrainian president and European leaders immediately after his meeting with Mr Putin. And he voiced confidence in his ability to quickly assess the potential for a deal, boasting his business acumen. \"At the end of the meeting, probably the first two minutes, I'll know exactly whether or not a deal can be made,\" he said. Asked how he would know, he replied: \"That's what I do, make deals.\" Members of his cabinet nodded in approval. Read more:Why Trump will have a lot of ice to break  A law-and-order crackdown in the US capital seems timed to bolster his diplomatic stance. He branded crime in Washington \"a national emergency\", took federal control of police and deployed the National Guard. It may seem strange that Mr Trump is talking about \"taking back\" Washington, ahead of a rare summit with Mr Putin. But he's positioning himself as bold and uncompromising before he faces a man deemed bold and uncompromising. A telling gaffe And he conflated the two, saying: \"This is a tragic emergency, and I'm going to see Putin, I'm going to Russia on Friday.\" He isn't going to Russia. He's going to Alaska. But that gaffe revealed how central Mr Putin is to his narrative, even domestically. Mr Putin wants to lock in the gains Russia has made since invading Ukraine, while Mr Trump presses for a ceasefire. But it's hard to envisage any ice-breaking peace deal emerging from Friday's summit in Alaska. How could there be when Mr Zelenskyy is out in the cold? For now, this is a Trump-Putin power play."
    },
    {
        "title": "Funeral held for five Al Jazeera journalists killed in Israeli strike in Gaza",
        "description": "A funeral was held for five Al Jazeera journalists who were targeted by an Israeli airstrike in Gaza on Sunday night, as the UN said the killings were a \"grave breach of international law\".",
        "url": "https://news.sky.com/story/funeral-held-for-five-al-jazeera-journalists-killed-in-israeli-strike-in-gaza-13410294",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-al-jazeera-gaza-anas-al-sharif_6987970.jpg?20250811140828",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-11 17:01:00",
        "Headline": "Correspondents Anas Al-Sharif and Mohammed Qreiqeh, camera operators Ibrahim Zaher and Moamen Aliwa, and their assistant Mohammed Noufal, died after a strike on a tent near Al Shifa Hospital in Gaza.",
        "Content": " A funeral was held for five Al Jazeera journalists who were targeted by an Israeli airstrike in Gaza on Sunday night, as the UN said the killings were a \"grave breach of international law\". Correspondents Anas Al-Sharif and Mohammed Qreiqeh, camera operators Ibrahim Zaher and Moamen Aliwa, and their assistant Mohammed Noufal, died after a strike on a tent near Al Shifa Hospital in Gaza. The Israeli military defended the attack, claiming the most prominent of the group, Sharif, was the head of a Hamas terrorist cell and only \"posed as a journalist\" - claims consistently denied by Sharif himself, Al Jazeera and the Committee to Protect Journalists (CPJ). An IDF spokesperson added that he was paid by both Hamas and Al Jazeera and that it had only released a \"small, declassified portion\" of its intelligence. A sixth journalist - a freelancer called Mohammad al Khaldi - was also killed in the strike, medics at the Al Shifa Hospital told Reuters. Al Jazeera called the killing of its journalists a \"targeted assassination\" and described its employees as some of the \"last remaining voices within Gaza\". Read more:Israel silences more crucial reporting voices from inside GazaAl Jazeera condemns 'assassination' of its journalists in Gaza \n                  Israel silences more crucial reporting voices from inside Gaza\n                 \n                  Who were the five Al Jazeera journalists killed by Israel in Gaza?\n                 \n                  Israel's PM tries to get on front foot in propaganda war he knows he is losing\n                 \"Al Jazeera Media Network condemns in the strongest terms the targeted assassination of its correspondents... by the Israeli occupation forces in yet another blatant and premeditated attack on press freedom,\" the broadcaster said. \"This attack comes amid the catastrophic consequences of the ongoing Israeli assault on Gaza, which has seen the relentless slaughter of civilians, forced starvation, and the obliteration of entire communities. \"The order to assassinate Anas Al-Sharif, one of Gaza's bravest journalists, and his colleagues, is a desperate attempt to silence the voices exposing the impending seizure and occupation of Gaza.\" The United Nations (UN) secretary-general condemned the killing of the five journalists and called for it to be investigated. A spokesperson said in a media briefing: \"These latest killings highlight the extreme risks that journalists continue to face when covering this ongoing conflict. \"The secretary-general calls for an independent, impartial investigation into these latest killings.\" He added that \"at least\" 242 journalists have been killed in Gaza since the war began. The UN's human rights office condemned the killings earlier on Monday, labelling the strike by Israel a \"grave breach of international humanitarian law\". The war began on 7 October in 2023, when Hamas-led militants stormed into southern Israel and killed 1,200 people, taking 251 hostages, according to Israeli numbers. Of the 50 hostages still in Gaza, Israeli authorities say 20 are still alive. Israel's offensive has killed more than 61,000 Palestinians, according to health officials in Hamas-run Gaza. It comes as prominent journalists across media organisations continue to join calls for access to Gaza, which Israel has forbidden throughout the war. On Sunday, Palestinian envoy to the UN Riyad Mansour said Israel's Prime Minister Benjamin Netanyahu should let the UN Security Council into Gaza. \"Take journalists with you so that you can verify exactly what is happening in Gaza,\" he said."
    },
    {
        "title": "Israel silences more crucial reporting voices from inside Gaza",
        "description": "The targeted killing of Al Jazeera journalist Anas Al-Sharif and four other colleagues by the Israel Defence Forces (IDF) late on Sunday silences more crucial reporting voices from inside Gaza.",
        "url": "https://news.sky.com/story/israel-silences-more-crucial-reporting-voices-from-inside-gaza-13410009",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anas-al-sharif-journalist_6987895.jpg?20250811092217",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-11 07:48:00",
        "Headline": "Anas Al-Sharif's death - and that of his four colleagues - is a chilling message to the journalistic community both on the ground and elsewhere, ahead of Israel's impending push into Gaza City.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  The targeted killing of Al Jazeera journalist Anas Al-Sharif and four other colleagues by the Israel Defence Forces (IDF) late on Sunday silences more crucial reporting voices from inside Gaza. The IDF wasted no time in releasing a statement claiming it had \"eliminated\" Al-Sharif, calling him a \"terrorist\" who \"posed\" as a journalist for Al Jazeera. Gaza latest: Follow live updates The Committee to Protect Journalists warned in July that Al-Sharif was the victim of an Israeli smear campaign and that they feared for his safety. The IDF had previously released documents which they say proved his involvement with Hamas. No word from them on his colleagues - Mohammed Qreiqeh, Ibrahim Zaher, Mohammed Noufal and Moamen Aliwa - who they also killed. We are chasing. Al-Sharif's death - and that of his four colleagues - is a chilling message to the journalistic community both on the ground and elsewhere ahead of Israel's impending push into Gaza City. There will now be fewer journalists left to cover that story, and - if it is even possible - they will be that bit more fearful. This is how journalists are silenced. Israel knows this full well. It has also not allowed international journalists independent access to enter Gaza to report on the war. Al-Sharif's death has sent shockwaves across the region, where he was a household name. He was prolific on social media and had a huge following. Read more from Sky News:Journalists demand access to GazaSky News on Israel's 'war on truth'Reporters issue demand to Israel I was watching horrifying footage of the immediate aftermath of the strike in the taxi on my way into the bureau, and the driver told me how he and his family had all cried for Anas when the news came in. His little daughter cried because of Al-Sharif's little daughter, Sham, who she knew from social media. \"They call everyone Hamas,\" my taxi driver said. \"Men, women, children\". Last month, Al-Sharif wrote this post: \"I haven't stopped covering [the crisis] for a moment in 21 months, and today I say it outright... and with indescribable pain. \"I am drowning in hunger, trembling in exhaustion and resisting the fainting that follows me every moment… Gaza is dying. And we die with it.\" This is what journalists in Gaza are facing, every single day."
    },
    {
        "title": "Who were the five Al Jazeera journalists killed by Israel in Gaza?",
        "description": "Five Al Jazeera employees, described as among the \"last remaining voices within Gaza\", were killed in an Israeli air strike on Sunday evening.",
        "url": "https://news.sky.com/story/who-were-the-five-al-jazeera-journalists-killed-by-israel-in-gaza-13409997",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sharif-qreiqe-gaza_6987708.jpg?20250810221810",
        "type": "World",
        "Author": "Lauren Russell",
        "Date Published": "2025-08-11 07:00:00",
        "Headline": "Correspondent Anas Al-Sharif was part of a news team working for Al Jazeera who all died in a strike on a tent near al Shifa Hospital in Gaza on Sunday. Here is all you need to know.",
        "Content": "\n          News reporter\n              @laurenvrussell\n  Five Al Jazeera employees, described as among the \"last remaining voices within Gaza\", were killed in an Israeli air strike on Sunday evening. Correspondents Anas Al-Sharif and Mohammed Qreiqeh, camera operators Ibrahim Zaher and Moamen Aliwa, and their assistant Mohammed Noufal, died after a strike on a tent near al Shifa Hospital in Gaza. The Israeli military defended the targeted attack, asserting that the most prominent of the group, Sharif, was the head of a Hamas terrorist cell and only \"posed as a journalist\" - claims consistently denied by Sharif himself, Al Jazeera and the Committee to Protect Journalists (CPJ). Gaza latest: Follow live updates Al Jazeera called the killing a \"targeted assassination\" and described its employees as some of the \"last remaining voices within Gaza\". Here is everything you need to know about the news team and the fallout from the attack.  Who was Anas Al-Sharif? The 28-year-old had become one of the most recognisable faces in Gaza due to his extensive reporting since the beginning of the Israel-Hamas war in October 2023. Born in Gaza's Jabalia refugee camp, Sharif went on to study at al Aqsa University and graduated from the faculty of media, according to Al Jazeera. Before joining the Qatari-funded network, he is believed to have volunteered at the Al Shamal Media Network. After the war broke out, Sharif reported on daily life in Gaza amid airstrikes, hunger and the rubble of destroyed neighbourhoods. He remained largely in the north of Gaza, detailing the effects of Israel's bombardment. Analysis: Israel silences more crucial reporting voices from inside Gaza In a broadcast in July, Sharif was filmed crying on air as a woman behind him collapsed from hunger. He said at the time: \"I am talking about [the] slow death of those people.\" His work gained him a huge presence on social media, with 1.6 million followers on Instagram and 562,000 on X. It also made him a recognisable figure to the many who watch Al Jazeera Arabic - which falls under the wider Al Jazeera media network. Israel shut down the Al Jazeera television network in the country in May last year and claimed the news organisation had links to Hamas. Sharif was also part of a Reuters news agency team that won a Pulitzer Prize in 2024 in the category of breaking news photography for their coverage of the Gaza conflict. He is survived by his wife and two children, Salah and Sham. Who were the other journalists? Fellow Al Jazeera correspondent Mohammed Qreiqeh, 33, was a native of Gaza City. He earned a degree in journalism and media from the Islamic University of Gaza and became known for his eloquent way of speaking, according to Al Jazeera. Earlier in the war, he and Sharif were separated from their families, the Associated Press reported. When they managed to reunite during a brief ceasefire earlier this year, their children appeared unable to recognise them, according to video footage they posted at the time. Camera operator Ibrahim Zaher, 25, was from the Jabalia refugee camp in northern Gaza, Al Jazeera reported, as was assistant Mohammed Noufal, 29. The broadcaster does not say where cameraman Moamen Aliwa was born or his age. Two other people, including freelance journalist Mohammad al Khaldi, were also killed in Sunday's strike, officials at al Shifa Hospital told the Reuters news agency. Al Jazeera reporter Hani Mahmoud, who is in Gaza, said everyone in the group worked \"round the clock covering all of the horrific acts going on\". He said it is \"very difficult to imagine how the coverage will continue without them\". As of 5 August, at least 186 journalists and media workers have been killed in Gaza, according to the CPJ. The death of Sharif and his colleagues marks the first time during the war that Israel's military has immediately claimed responsibility after a member of the press was killed in a strike. In their statement confirming their role they repeated the claim that Sharif was a member of Hamas. It comes at a time when the foreign press is increasingly relying on Palestinian journalists, local reporters and humanitarian workers to provide details of what is going on inside the territory. Israel has mostly barred international media from entering Gaza since 2023. Hamas, the militant group that runs Gaza, said the deadly strike may signal the start of an Israeli offensive. Condemning the deaths of the journalists, the UN's Human Rights Office accused Israel of a \"grave breach of international humanitarian law\". In a post on X it called on the country to \"respect and protect all civilians, including journalists\". The office also claimed the number of Palestinian journalists that have been killed in Gaza is at least 242, higher than the CPJ's estimates. 'Target of a smear campaign' Sharif's death comes weeks after the Committee to Protect Journalists (CPJ), an independent non-profit, expressed \"grave\" concerns about his safety, and said that he was \"being targeted by an Israeli military smear campaign\". Last month, he also said he was living with the \"feeling that I could be bombed and martyred at any moment\" because his coverage of Israel's operations \"harms them and damages their image in the world\".  In a post, labelled as Sharif's \"last will and testament\", the journalist wrote: \"If these words of mine reach you, know that Israel has succeeded in killing me and silencing my voice.\" The post, which was published after his death, adds: \"I never hesitated to convey the truth as it is, without distortion or misrepresentation, hoping that God would witness those who remained silent.\" Read more:Israel's PM knows he's losing propaganda warIsraeli soldier died by suicide days before return to dutyJournalists demand foreign media access into Gaza What has Israel said? The IDF said on Sunday that it has intelligence and documents that prove Sharif was a \"Hamas operative\". The claims made no mention of the other journalists killed in Sunday's strike. In a statement it said: \"Hamas terrorist Anas Al-Sharif, who posed as an Al Jazeera journalist, was the head of a Hamas terrorist cell and advanced rocket attacks on Israeli civilians and IDF troops. \"Intelligence and documents from Gaza, including rosters, terrorist training lists and salary records, prove he was a Hamas operative integrated into Al Jazeera. \"A press badge isn't a shield for terrorism.\"  The claims are not new and were first published by the IDF in October 2024, when Sharif was named alongside five other Al Jazeera journalists. The IDF said at the time it had found documents and computer files proving all the journalists had long-standing links to Hamas or Islamic Jihad. Last year, Al Jazeera called the claims \"baseless fabrication\" and continued to reject the assertion after Sharif's death on Sunday. Jodie Ginsberg, the chief executive of the CPJ, told Sky News Breakfast on Monday that Israel has never provided credible evidence to support their claims. What has Al Jazeera said? Condemning the killing of five of its employees, Al Jazeera said Israel's actions are a \"desperate attempt to silence the voices exposing the impending seizure and occupation of Gaza\". It called on the international community and all relevant organisations to \"take decisive measures to halt this ongoing genocide and end the deliberate targeting of journalists\".  Salah Negm, the director of news at Al Jazeera English, told Sky News Breakfast that the IDF statement was a \"confession of guilt\" and that it is targeting journalists for confirming what is happening in Gaza. \"We have always followed the highest security standards possible. But if a state and a complete army goes behind journalists because they are doing their jobs, there is not much that we can do,\" he said. \"Of course we are afraid, but we know the price that's being paid in order to put a free word and independent coverage to the rest of the world.\""
    },
    {
        "title": "Colombian presidential hopeful Miguel Uribe Turbay dies after campaign rally shooting",
        "description": "A Colombian senator who had been hoping to become the country's next president has died in hospital two months after being shot at a campaign rally.",
        "url": "https://news.sky.com/story/colombian-presidential-hopeful-miguel-uribe-turbay-dies-after-campaign-rally-shooting-13410129",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-miguel-uribe-turbay_6988089.jpg?20250811133336",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-11 12:24:00",
        "Headline": "Miguel Uribe Turbay was shot during a political event at a park in the Colombian capital Bogota at the beginning of June and underwent multiple surgeries before his death.",
        "Content": "A Colombian senator who had been hoping to become the country's next president has died in hospital two months after being shot at a campaign rally. Miguel Uribe Turbay, a member of the opposition right-wing Democratic Centre Party, was shot in the head and leg on 7 June. The 39-year-old's death was confirmed by his wife. Santa Fe Foundation hospital, in the capital Bogota, said the senator died early on Monday, after it previously revealed his condition had worsened over the weekend. The shooting happened during a political event at a park in the Fontibon neighbourhood of the capital. A teenage suspect was arrested at the scene and authorities have since detained several other people. Mr Uribe Turbay underwent multiple surgeries before his death. In a social media post, his wife Maria Claudia Tarazona wrote: \"I ask God to show me the way to learn to live without you. \"Rest in peace, love of my life, I will take care of our children.\" The incident has renewed concerns about the safety of politicians in the country. The last time Colombians saw this kind of political violence against presidential candidates was when drug lord Pablo Escobar declared war on the state in the 1990s. Mr Uribe Turbay's mother, journalist Diana Turbay, was a victim in this period and died in 1991 during a botched rescue mission after she was kidnapped by the drug cartel. Read more from Sky News:Amber heat health alert issued for parts of EnglandFirefighters dampen down blaze at Edinburgh landmark Despite his mother's death when he was a boy, Mr Uribe Turbay later became a prominent public figure and enjoyed a rapid rise in politics. He was known for his criticism of leftist President Gustavo Petro's administration. His maternal grandfather, Julio Cesar Turbay, was Colombia's president from 1978 to 1982 - while his paternal grandfather, Rodrigo Uribe Echavarria, headed the Liberal Party and supported Virgilio Barco's successful 1986 presidential campaign."
    },
    {
        "title": "'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant",
        "description": "Jellyfish have shut down four reactors at France's largest nuclear power plant.",
        "url": "https://news.sky.com/story/massive-and-unpredictable-swarm-of-jellyfish-shuts-down-nuclear-plant-13410357",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jellyfish-stock_6988511.jpg?20250811214036",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-11 20:27:00",
        "Headline": "The Gravelines site in France, which can power around 5 million homes, has temporarily stopped production while teams try to clear the blockage.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Jellyfish have shut down four reactors at France's largest nuclear power plant. The swarm entered the filter drums of the pumping stations at the Gravelines site in northern France on Sunday night. Operator EDF confirmed to Sky News that the \"massive and unpredictable presence of jellyfish\" caused units 2, 3 and 4 to automatically shut down between 11pm and midnight on 10 August. Unit 6 then shut down just after 6am on Monday 11 August. The plant, situated on the coast between Calais and Dunkirk, has six units which can produce a total of 5.4 gigawatts of power. In a statement, EDF said the pumping stations affected are in the non-nuclear part of the plant, adding the shutdowns \"had no impact on the safety of the facility, the safety of personnel or the environment\". The site, which can power around 5 million homes, has temporarily stopped production while teams try to clear the blockage. \n                  At least two dead as wildfires sweep across Greece, Turkey and France\n                 \n                  One dead as 'hellish' wildfire burns across area the size of Paris in southern France\n                 \n                  Cabinet minister admits UK-France migrant returns could be 'frustrated' by legal challenges\n                 Two unaffected units had already been taken offline for maintenance. Read more from Sky News:Amber heat health alert issued for parts of EnglandFirefighters dampen down blaze at Edinburgh landmark A spokesperson said France is still exporting more than four gigawatts of electricity to the UK. A boom in jellyfish numbers has been reported in the sea around Calais, likely due to rising water temperatures and increases in the plankton they eat. \"Jellyfish breed faster when water is warmer, and because areas like the North Sea are becoming warmer, the reproductive window is getting wider and wider,\" said Derek Wright, marine biology consultant at the National Oceanic and Atmospheric Administration Fisheries. \"Jellyfish can also hitch rides on tanker ships, entering the ships' ballast tanks in one port and often getting pumped out into waters halfway across the globe,\" he said. The Gravelines site draws water for its cooling systems from a canal connected to the North Sea, which is home to several species of jellyfish. The invertebrates have also been responsible for problems at several other coastal power stations, including the Torness nuclear plant in Scotland, where they have clogged the water intake pipes multiple times. In 1999, jellyfish were blamed for causing a massive blackout in the Philippines."
    },
    {
        "title": "One dead and dozens injured after 6.1-magnitude earthquake hits northwest Turkey",
        "description": "A 6.1-magnitude earthquake has struck northwest Turkey, killing at least one person and causing more than a dozen buildings to collapse.",
        "url": "https://news.sky.com/story/one-dead-and-dozens-injured-after-61-magnitude-earthquake-hits-northwest-turkey-13409975",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-turkey-earthquake_6987835.jpg?20250811151628",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-11 05:59:00",
        "Headline": "The quake was strong enough to be felt in Istanbul, around 125 miles (200km) from the epicentre in Balikesir province.",
        "Content": "A 6.1-magnitude earthquake has struck northwest Turkey, killing at least one person and causing more than a dozen buildings to collapse. At least 29 people were injured when the quake hit Balikesir province at around 7.53pm (5.53pm UK time) on Sunday. It was powerful enough to be felt in several provinces and Turkey's biggest city, Istanbul, around 125 miles (200km) to the north. Television footage showed rescue teams working through the night and asking for silence so they could listen for signs of life beneath the rubble. Interior minister Ali Yerlikaya said an 81-year-old man died after being rescued from rubble by emergency teams in the town of Sindirgi, the epicentre. Mr Yerlikaya said a total of 16 buildings collapsed in the region - most of them derelict and unused. Two mosque minarets also fell, he said. AFAD, Turkey's disaster management authority, said the quake struck at a depth of 6.8 miles (11km). The German Research Centre for Geosciences (GFZ) registered the earthquake's magnitude at 6.19 and a depth of 6.2 miles (10km). The earthquake was followed by several aftershocks, including one measuring 4.6. Turkey sits on top of major fault lines and earthquakes are frequent. In April, more than 150 people were injured after a powerful 6.2-magnitude earthquake shook Istanbul. A 7.8-magnitude quake hit Turkey and Syria in 2023, killing tens of thousands of people.  Read more from Sky News:Hitler-inspired boy planned mosque attackBritish backpacker admits to fatal crashGaza: Israeli soldier died by suicide Turkey's President Recep Tayyip Erdogan issued a statement wishing all affected citizens a speedy recovery. \"May God protect our country from any kind of disaster,\" he wrote on social media platform X."
    },
    {
        "title": "Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit",
        "description": "Donald Trump has said he would try to return territory to Ukraine as he prepares to meet Vladimir Putin and lay the groundwork for a deal to bring an end to the war.",
        "url": "https://news.sky.com/story/trump-says-he-hopes-to-get-prime-territory-back-for-ukraine-as-he-prepares-for-putin-summit-13410320",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-press_6988350.jpg?20250811173050",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-11 18:32:00",
        "Headline": "Asked if Volodymyr Zelenskyy was invited to the meeting with Vladimir Putin in Alaska, Donald Trump said the Ukrainian leader \"wasn't a part of it\".",
        "Content": " Donald Trump has said he would try to return territory to Ukraine as he prepares to meet Vladimir Putin and lay the groundwork for a deal to bring an end to the war. \"Russia has occupied a big portion of Ukraine. They've occupied some very prime territory. We're going to try and get some of that territory back for Ukraine,\" the US president said at a White House news conference ahead of Friday's summit in Alaska. Mr Trump also said: \"There'll be some land swapping going on. I know that through Russia and through conversations with everybody, to the good of Ukraine.\" He said he's going to see what Mr Putin \"has in mind\" to end the three-and-a-half-year full-scale invasion. And he said if it's a \"fair deal,\" he will share it with European and NATO leaders, as well as Volodymyr Zelenskyy, who have been liaising closely with Washington ahead of the meeting. Asked if Mr Zelenskyy was invited to the summit with Mr Putin in Alaska, Mr Trump said the Ukrainian leader \"wasn't a part of it\". \"I would say he could go, but he's gone to a lot of meetings. You know, he's been there for three and a half years - nothing happened,\" Mr Trump added. \n                  Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold\n                 \n                  Donald Trump will deploy National Guard troops to Washington DC to 're-establish law and order'\n                 \n                  It's been four years since a US president met Putin - and Trump will have a lot of ice to break\n                 The US president said Mr Putin wants to get the war \"over with\" and \"get involved\" in possible talks but acknowledged Moscow's attacks haven't stopped. \"I've said that a few times and I've been disappointed because I'd have a great call with him and then missiles would be lobbed into Kyiv or some other place,\" he said. Mr Trump said he will tell Mr Putin \"you've got to end this war, you've got to end it,\" but that \"it's not up to me\" to make a deal between Russia and Ukraine. Zelenskyy says Russia 'wants to buy time' Ukrainian President Volodymyr Zelenskyy has said Russia \"wants to buy time, not end the war\". \"It is obvious that the Russians simply want to buy time, not end the war,\" he wrote in a post on X, after a phone call with Canada's Prime Minister Mark Carney. \"The situation on the battlefield and Russia's wicked strikes on civilian infrastructure and ordinary people prove this clearly.\" Mr Zelenskyy said the two \"agreed that no decisions concerning Ukraine's future and the security of our people can be made without Ukraine's participation\", just as \"there can be no decisions without clear security guarantees\". Sanctions against Russia must remain in force and be \"constantly strengthened,\" he added. European leaders meet ahead of call with Trump Meanwhile, European officials have been holding meetings ahead of a phone call with Mr Trump on Wednesday. The European Union's foreign policy chief, Kaja Kallas, has been speaking to foreign ministers virtually, saying on X that work \"on more sanctions against Russia, more military support for Ukraine and more support for Ukraine's budgetary needs and accession process to join the EU\" is under way.  Over the weekend, European leaders released a joint statement, welcoming Mr Trump's \"work to stop the killing in Ukraine\". \"We are convinced that only an approach that combines active diplomacy, support to Ukraine and pressure on the Russian Federation to end their illegal war can succeed,\" read the statement. It was signed by UK Prime Minister Sir Keir Starmer, French President Emmanuel Macron, Italian Prime Minister Giorgia Meloni, German Chancellor Friedrich Merz, Polish Prime Minister Donald Tusk, Finland's President Alexander Stubb, and European Commission President Ursula von der Leyen. \"We underline our unwavering commitment to Ukraine's sovereignty, independence and territorial integrity,\" they said. Read more from Sky News:Trump will deploy National Guard to WashingtonCCTV shows hospital volunteer being shot dead at point-blank range Attacks continue Despite Donald Trump's efforts to convince Vladimir Putin to commit to a ceasefire and negotiations, Russian attacks on Ukraine have only intensified in the past few months. Ukraine's president has said that, in the past week, Russia launched more than 1,000 air bombs, nearly 1,400 drones and multiple missile strikes on Ukraine. On 9 July, Russia carried out its largest aerial attack on Ukraine since the start of the war, launching more than 740 drones and missiles, breaking its records from previous weeks. Furthermore, Mr Zelenskyy has said Russia is preparing for new offensives."
    },
    {
        "title": "Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold",
        "description": "And then there were two.",
        "url": "https://news.sky.com/story/trump-gaffe-reveals-how-central-putin-is-to-his-narrative-with-zelenskyy-left-out-in-the-cold-13410377",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-zelenskyy-putin_6886829.jpg?20250414211955",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-08-11 22:29:00",
        "Headline": "The US president has ruled out any trilateral meeting including Volodymyr Zelenskyy - for now this is a Trump-Putin power play.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  And then there were two. It will be a Trump-Putin bilateral summit in Alaska. Ukraine latest: Trump details talks with Putin The US president has ruled out a trilateral meeting including Volodymyr Zelenskyy and is framing the talks as low stakes. He described it as a \"feel out\" meeting \"to see what the parameters\" are, and stressed \"it's not up to me to make a deal.\" A strategic preemption perhaps, setting expectations low, and preparing the public for failure. But he remains wedded to the notion that \"land swapping\" will shape any deal to end the war in Ukraine. \"Good stuff\" and \"bad stuff\" for both sides, he said, positioning himself as the pragmatic mediator between the two. He expressed irritation with Mr Zelenskyy's assertion that he doesn't have the constitutional power to concede land, though did say he hopes to get \"prime territory\" back for Ukraine. The dealmaker-in-chief Mr Trump promised to brief the Ukrainian president and European leaders immediately after his meeting with Mr Putin. And he voiced confidence in his ability to quickly assess the potential for a deal, boasting his business acumen. \"At the end of the meeting, probably the first two minutes, I'll know exactly whether or not a deal can be made,\" he said. Asked how he would know, he replied: \"That's what I do, make deals.\" Members of his cabinet nodded in approval. Read more:Why Trump will have a lot of ice to break  A law-and-order crackdown in the US capital seems timed to bolster his diplomatic stance. He branded crime in Washington \"a national emergency\", took federal control of police and deployed the National Guard. It may seem strange that Mr Trump is talking about \"taking back\" Washington, ahead of a rare summit with Mr Putin. But he's positioning himself as bold and uncompromising before he faces a man deemed bold and uncompromising. A telling gaffe And he conflated the two, saying: \"This is a tragic emergency, and I'm going to see Putin, I'm going to Russia on Friday.\" He isn't going to Russia. He's going to Alaska. But that gaffe revealed how central Mr Putin is to his narrative, even domestically. Mr Putin wants to lock in the gains Russia has made since invading Ukraine, while Mr Trump presses for a ceasefire. But it's hard to envisage any ice-breaking peace deal emerging from Friday's summit in Alaska. How could there be when Mr Zelenskyy is out in the cold? For now, this is a Trump-Putin power play."
    },
    {
        "title": "Donald Trump will deploy National Guard troops to Washington DC to 're-establish law and order'",
        "description": "Donald Trump has announced he is going to deploy National Guard troops to Washington DC to make the US capital's streets safer.",
        "url": "https://news.sky.com/story/donald-trump-will-deploy-national-guard-troops-to-washington-dc-to-re-establish-law-and-order-13410192",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-national-guard-captiol_6988276.jpg?20250811162728",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-11 14:02:00",
        "Headline": "The US president announced he was deploying the National Guard to Washington DC, saying the capital \"should be one of the safest, cleanest and most beautiful cities anywhere in the world and we're going to make it that\".",
        "Content": " Donald Trump has announced he is going to deploy National Guard troops to Washington DC to make the US capital's streets safer. At a White House news conference on Monday, the president said the city's police would come under federal control as he said the murder rate in DC was \"higher than\" in some of the \"worst places on earth\". He said he was sending in 800 National Guard troops to \"re-establish law, order, and public safety\". Mr Trump said he was announcing a \"historic action to rescue our nation's capital from crime, bloodshed, bedlam and squalor and worse. \"This is liberation day in DC and we are going to take our capital back.\" The president continued: \"So today we are declaring a public safety emergency in the district of Columbia.\" He added it was not just about safety but also the \"beautification\" of the city. \n                  Trump gaffe reveals how central Putin is to his narrative - with Zelenskyy left out in the cold\n                 \n                  Trump says he hopes to get 'prime territory' back for Ukraine as he prepares for Putin summit\n                 \n                  It's been four years since a US president met Putin - and Trump will have a lot of ice to break\n                 \"Washington DC should be one of the safest, cleanest and most beautiful cities anywhere in the world and we're going to make it that.\" Last week, the Republican president directed federal law enforcement agencies to increase their presence in Washington for seven days, with the option \"to extend as needed\". On Friday night, federal agencies including the Secret Service, the FBI and the US Marshals Service assigned more than 120 officers and agents to assist in Washington. National Guard troops usually belong to individual states and personnel in many cases are trained to help with emergencies that those states have to deal with, such as natural disasters. Read more from Sky News: Israel silences more crucial reporting voices from inside GazaMo Salah calls out UEFA over tribute to 'Palestinian Pele' Since they are the reserve force of the US military, National Guard troops are usually part-time, meaning that they have other jobs as well. DC Mayor Muriel Bowser said on Monday that the city had reached a 30-year low in violent crime. Ms Bowser said that crime was down not just from a post-pandemic peak in 2023, but from 2019 levels prior to the pandemic. She also said Mr Trump's announced takeover of DC police force was \"unsettling\". Minority leader of the US House of Representatives, Hakeem Jeffries, responded to Mr Trump's announcement on Monday with a post on X which read: \"Violent crime in Washington, DC is at a thirty-year low. \"Donald Trump has no basis to take over the local police department. And zero credibility on the issue of law and order. \"Get lost.\" Mr Trump also vowed to remove homeless encampments, but fell short of providing details on how or where homeless people would be moved. In a social media post on Sunday, Mr Trump said: \"The Homeless have to move out, IMMEDIATELY. \"We will give you places to stay, but FAR from the Capital. The Criminals, you don't have to move out. We're going to put you in jail where you belong.\""
    },
    {
        "title": "US coke plant explosion leaves one dead and several others missing, police say",
        "description": "A person was killed and multiple others were injured after an explosion at a coke plant near Pittsburgh, Pennsylvania, police said.",
        "url": "https://news.sky.com/story/us-coke-plant-explosion-leaves-one-dead-and-several-others-missing-police-say-13410329",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pennsylvania-clairton_6988466.jpg?20250811200615",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-11 18:49:00",
        "Headline": "Two people remain missing after the explosion at about 11am local time at the Clairton Coke Works plant, which is owned by US Steel, a subsidiary of Nippon Steel. ",
        "Content": "A person was killed and multiple others were injured after an explosion at a coke plant near Pittsburgh, Pennsylvania, police said. Two people remain missing after the explosion at about 11am local time at the Clairton Coke Works plant, which is owned by US Steel, a subsidiary of Nippon Steel. Coke is produced by heating coal at high temperatures and the process creates a lethal mix of methane, carbon dioxide and carbon monoxide. It is used in blast furnaces as part of the process of making steel. An official told CNN that some people were trapped under the rubble and emergency services were trying to rescue them. It is still uncertain what caused the explosion. Speaking from the site of the blast, the mayor of Clairton, Rich Lattanzi, said: \"I don't know if people are trapped. \"There are ambulances and police and news media everywhere. It's a horrible day for Clairton. We're praying for everyone involved. We're just praying this isn't as bad as it looks.\" \n                  Two killed and nine injured in Philadelphia shooting\n                 \n                  Pennsylvania governor Josh Shapiro forced to flee with family as home 'set ablaze'\n                 \n                  Plane with 'open door' crashes into retirement home car park\n                 Pennsylvania Governor Josh Shapiro posted on X that his administration was in touch with local officials in Clairton as they responded to the explosion. Read more from Sky News: Zelenskyy faces nightmare deal at Trump-Putin summitColombian presidential hopeful dies after shooting \"The scene is still active, and folks nearby should follow the direction of local authorities,\" he wrote, asking readers to join him in prayer for the Clairton community. The Clairton Coke Works, located on the Monongahela River south of Pittsburgh, is the largest coke manufacturing facility in the United States."
    },
    {
        "title": "Harry and Meghan extend Netflix partnership - but it's no longer exclusive",
        "description": "Harry and Meghan have signed a new \"multi-year, first-look deal\" with Netflix, following the deal they struck with the streaming giant five years ago.",
        "url": "https://news.sky.com/story/harry-and-meghan-extend-netflix-partnership-but-its-no-longer-exclusive-13410287",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-prince-harry-colombia_6657969.jpg?20240816114704",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-08-11 16:48:00",
        "Headline": "Meghan said the new deal would expand to include her As ever lifestyle brand, adding that she and Harry felt \"inspired\" to make \"thoughtful content\" which they hoped would \"resonate globally\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Harry and Meghan have signed a new \"multi-year, first-look deal\" with Netflix, following the deal they struck with the streaming giant five years ago. The agreement quashes rumours that the Sussexes' relationship with the company might not be renewed, but it would appear to be a less prestigious arrangement. As a \"first-look deal\" rather than an overall deal, the entertainment giant will be able to say yes or no to their content before anyone else, but they will not be under an obligation to stream it. Several US outlets have suggested it is a downgrade from the Sussexes' previous contract, which saw the streaming giant pay for exclusive rights for the content and was thought to be worth more than $100m (£74m). British PR expert Mark Borkowski described the deal as a \"downgrade\" and suggested Netflix was \"pivoting away\" from Harry and Meghan. Read more: Some call the deal a demotion - but the company still sees them as a power couple Harry and Meghan set up their media company, Archewell Productions, after quitting as senior working royals in 2020. \n                  Meghan shares video of trip to Disneyland with Prince Harry and children Archie and Lilibet\n                 \n                  Meghan speaks about difficulties balancing business and motherhood\n                 \n                  Meghan not using HRH title for commercial purposes, her representatives say\n                 Their partnership with Netflix had promised documentaries, docuseries, feature films, scripted shows and children's television, but has so far only delivered documentaries and docuseries. Royal correspondent Some have argued that a \"first-look deal\" looks like a demotion from what they previously signed up to. With no real clarity on how much their original deal was worth, and no numbers being publicly thrown around this time, that is hard to judge. But talking to those who know something about these kinds of deals, you do get a sense it could potentially be more lucrative than it looks on face value. Read the full analysis here These include Harry & Meghan, a six-part series about their departure from the royal household, which is Netflix's fifth most popular series of all time, and most recently, the lifestyle show With Love, Meghan, which is the streamer's most-watched culinary show since its release earlier this year. Speaking about the new deal, Meghan said: \"We're proud to extend our partnership with Netflix and expand our work together to include the As ever brand.\" As ever is Meghan's lifestyle brand, launched in 2024, and rebranded this year, selling products including jams, shortbread and wine. Meghan went on: \"My husband and I feel inspired by our partners who work closely with us and our Archewell Productions team to create thoughtful content across genres that resonates globally and celebrates our shared vision.\" Netflix's chief content officer Bela Bajaria called the Sussexes \"influential voices\" and said their stories \"resonate with audiences everywhere\". New output includes the second season of With Love Meghan later this month, and a Christmas special in December. Archewell Productions is also working on a documentary about orphaned children in Uganda's Masaka region, an area heavily hit by the HIV/AIDS crisis, titled Masaka Kids, A Rhythm Within, and is developing a feature adaptation of the bestselling romantic novel by Carley Fortune, Meet Me At The Lake. It comes as Harry has cut ties with his Sentebale charity but has said he still intends to do what he can to help young people in Lesotho, Botswana and Southern Africa."
    },
    {
        "title": "Some call the Sussexes' Netflix deal a demotion - but the company still sees them as a power couple",
        "description": "While we're all desperate to know what this new deal is really worth in dollars and pounds, one thing I can tell you for certain is that Prince Harry and Meghan want us to know they're delighted that Netflix again wanted to get a deal done.",
        "url": "https://news.sky.com/story/some-call-the-sussexes-netflix-deal-a-demotion-but-the-company-still-sees-them-as-a-power-couple-13410313",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-prince-harry-meghan_6963912.jpg?20250713124746",
        "type": "US",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-11 18:07:00",
        "Headline": "Harry and Meghan are delighted with their new production deal - but some say it shows the couple aren't worth what they were back in 2020.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n While we're all desperate to know what this new deal is really worth in dollars and pounds, one thing I can tell you for certain is that Prince Harry and Meghan want us to know they're delighted that Netflix again wanted to get a deal done. \"Absolutely over the moon\" is how it was described to me. But they'll also be aware of the attention it'll attract as we all try to pick apart what it means. Firstly because of that ongoing fascination in how they're making money since stepping away from royal life and losing financial support from the King, but also because of the recent reports that Netflix were intending to cut ties. Yes this is a different type of deal from their original one in 2020. Some have argued that a \"first look deal\" looks like a demotion from what they previously signed up to. With no real clarity on how much their original deal was worth, and no numbers being publicly thrown around this time, that is hard to judge. But talking to those who know something about these kinds of deals you do get a sense it could potentially be more lucrative than it looks on face value. \n                  Meghan shares video of trip to Disneyland with Prince Harry and children Archie and Lilibet\n                 \n                  Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday\n                 \n                  Meghan speaks about difficulties balancing business and motherhood\n                 With first look deals, yes there is often financial commitments from the likes of Netflix to get that first exclusive look at projects and first refusal.  But there could be other significant monetary incentives for the Sussexes to sign. For example, when the Obamas signed a first look deal with Netflix, the streaming service agreed to pay the operational costs for their production company \"Higher Ground\". Could it be that Netflix are also now covering the costs of Archewell Productions? It's stating the obvious to say that Harry and Meghan continue to divide opinions, some wanting to watch their programmes from a place of respect and fondness, others as a reason to grumble about them. But signing on this latest dotted line shows Netflix still sees them as a power couple, who attract significant attention and are worthy of investment, whatever that really adds up to."
    },
    {
        "title": "Nvidia and AMD to pay Trump administration 15% of chip revenue for export licences to China",
        "description": "Two major US microchip makers have agreed to pay the Trump administration a portion of sales in return for export licences to send chips to  China, according to reports.",
        "url": "https://news.sky.com/story/nvidia-and-amd-to-pay-trump-administration-15-of-chip-revenue-for-export-licences-to-china-13409998",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-jensen-huang_6585235.jpg?20240619101627",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-11 06:57:00",
        "Headline": "Paying the government to allow export licences for previously banned export semiconductors is said to be unprecedented.",
        "Content": "Two major US microchip makers have agreed to pay the Trump administration a portion of sales in return for export licences to send chips to  China, according to reports. The world's most valuable company, Nvidia, and Advanced Micro Devices (AMD) will give 15% of Chinese sales of two AI-powering microchips to the US government. Such an agreement is said to be unprecedented, according to reporting in the Financial Times. Money blog: Sainsbury's defends 25% meal deal hike The companies are reported by the paper to have been issued licences to export the semiconductors to the world's second largest economy after a change of course by the Trump government in June. Semiconductors are found in nearly all electronic technology and are vital to powering the modern world. Previously export of ones, such as the H20 and MI308 produced by Nvidia and AMD respectively, had been banned under US national security grounds.  But successful lobbying by Nvidia's chief executive Jensen Huang meant Trump allowed for resumed sales in China. \n                  China orders 'all-out' rescue operation as 10 killed and dozens missing after floods\n                 \n                  Thousands fall ill with mosquito-borne chikungunya virus in China\n                 \n                  What would Trump do if China invaded Taiwan?\n                 Having China reliant on US technology, rather than needing to develop its own, was seen to be better for America by the administration. Nvidia's H20 chip was designed with the Biden administration's export crackdown on advanced artificial intelligence (AI) powering chips in mind. In April, President Trump's government said it would ban export of the H20. The companies have been contacted for comment. Nvidia told other news outlets, \"We follow rules the US government sets for our participation in worldwide markets.\" \"While we haven't shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide. America cannot repeat 5G and lose telecommunication leadership.\""
    },
    {
        "title": "Fresh hope for pancreatic cancer patients as new vaccine shows promise in early trial",
        "description": "A new pancreatic cancer vaccine has appeared to slow disease progression and increase survival for patients in an early trial.",
        "url": "https://news.sky.com/story/fresh-hope-for-pancreatic-cancer-patients-as-new-vaccine-shows-promise-in-early-trial-13410167",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cancer-vaccine_6988165.jpg?20250811152830",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-11 13:29:00",
        "Headline": "The new vaccine, which has shown promise in an early trial involving 20 pancreatic cancer patients and five with bowel cancer, has been developed to help the body's immune system find and attack cancer cells.",
        "Content": "A new pancreatic cancer vaccine has appeared to slow disease progression and increase survival for patients in an early trial. Pancreatic cancer has some of the poorest survival rates due to it often only being detected in an advanced stage. Many see their cancers not responding to treatment or continuing to spread despite undergoing treatments such as chemotherapy and radiotherapy. The new vaccine, which has shown promise in an early trial involving 20 pancreatic cancer patients and five with bowel cancer, has been developed to help the body's immune system find and attack cancer cells. Both pancreatic and bowel cancers carry a mutation in a gene called KRAS, which plays a key role in tumour growth. The jab was developed to recognise and attack KRAS-mutant cancer cells, as well as improve vaccine delivery to the lymph nodes, which filter out foreign substances like cancer cells and infections, in the body. In the phase 1 trial for the jab, 68% of the 25 patients had developed a strong immune response to the mutant KRAS tumour proteins after about 20 months. However, some patients responded more favourably than others, with experts saying more research was needed to establish the cause for the differing reactions. Those with the strongest immune response both lived longer and remained cancer-free for longer than those with a weaker response. Pancreatic cancer patients who received the vaccine survived about two years and five months after getting the ELI-002 2P jab, according to the study published in the journal Nature Medicine. At present, just three in 10 people diagnosed with the condition survive for a year, so the early trial results give fresh hope to patients. Read more from Sky News:Amber heat health alert for parts of England30 evacuated after burst water main floods streets The vaccine does not need to be personalised and can therefore be manufactured in bulk to be administered more rapidly. Researchers have already started testing the efficacy of the jab among a larger group of pancreatic and bowel cancer patients. Study lead Dr Zev Wainberg from the University of California, in the US city of Los Angeles, called the findings \"remarkable\" and said the second phase of the trial was already under way."
    },
    {
        "title": "UK's biggest independent toy shop chain given to employees",
        "description": "The UK's biggest independent toy retailer is being taken from private ownership and will be owned by its employees, who will share in the company's profits. ",
        "url": "https://news.sky.com/story/uks-biggest-independent-toy-shop-chain-given-to-employees-13410078",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-the-entertainer-toy_6988148.jpg?20250811150154",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-11 10:33:00",
        "Headline": "The move to employee ownership is said to be part of a \"growing trend\" and the  \"future of the high street\". ",
        "Content": "The UK's biggest independent toy retailer is being taken from private ownership and will be owned by its employees, who will share in the company's profits.  The founder of The Entertainer chain, Gary Grant, is putting the future of the business in the control of its 1,900 employees. The company operates more than 160 shops as well as concessions in Tesco, Matalan and M&S. Money blog: Trump might have just cut the cost of your commute As a result of the ownership changes, employees will be rewarded through tax-free bonuses based on the profits generated in the future. To help employees shape policies and share ideas, a colleague advisory board will be created Direction of the company will be overseen by a three-person trust, one of whom will be a representative of the staff board. That trust will own 100% of the company. Current shareholders, the Grant family, will be compensated for the sale of their stake from future profits of the business. It's being done to ensure the business, which also owns the Early Learning Centre and Addo Play, remains independent and to preserve the family legacy and feel of the business. 'A growing trend' It's part of what's being described by the chief executive of the Employee Ownership Association, James de la Vingne, as a \"growing trend\" for retailers. \"We're seeing a growing trend for retailers making the move to employee ownership alongside calls to help save the high street,\" he said. Other businesses operating such a model include the John Lewis Partnership, home entertainment retailer Richer Sounds, and outdoor adventure company Go Ape. \"I have no doubt that other familiar brands will follow The Entertainer's example of what's possible. The future of the high street is employee ownership,\" Mr de la Vingne added. What is The Entertainer? The company was founded in 1981 in Buckinghamshire by Gary and Catherine Grant. It's also a designer, sourcer, developer and wholesaler of toys across multiple international markets."
    },
    {
        "title": "Nvidia and AMD to pay Trump administration 15% of chip revenue for export licences to China",
        "description": "Two major US microchip makers have agreed to pay the Trump administration a portion of sales in return for export licences to send chips to  China, according to reports.",
        "url": "https://news.sky.com/story/nvidia-and-amd-to-pay-trump-administration-15-of-chip-revenue-for-export-licences-to-china-13409998",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-jensen-huang_6585235.jpg?20240619101627",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-11 06:57:00",
        "Headline": "Paying the government to allow export licences for previously banned export semiconductors is said to be unprecedented.",
        "Content": "Two major US microchip makers have agreed to pay the Trump administration a portion of sales in return for export licences to send chips to  China, according to reports. The world's most valuable company, Nvidia, and Advanced Micro Devices (AMD) will give 15% of Chinese sales of two AI-powering microchips to the US government. Such an agreement is said to be unprecedented, according to reporting in the Financial Times. Money blog: Sainsbury's defends 25% meal deal hike The companies are reported by the paper to have been issued licences to export the semiconductors to the world's second largest economy after a change of course by the Trump government in June. Semiconductors are found in nearly all electronic technology and are vital to powering the modern world. Previously export of ones, such as the H20 and MI308 produced by Nvidia and AMD respectively, had been banned under US national security grounds.  But successful lobbying by Nvidia's chief executive Jensen Huang meant Trump allowed for resumed sales in China. \n                  China orders 'all-out' rescue operation as 10 killed and dozens missing after floods\n                 \n                  Thousands fall ill with mosquito-borne chikungunya virus in China\n                 \n                  What would Trump do if China invaded Taiwan?\n                 Having China reliant on US technology, rather than needing to develop its own, was seen to be better for America by the administration. Nvidia's H20 chip was designed with the Biden administration's export crackdown on advanced artificial intelligence (AI) powering chips in mind. In April, President Trump's government said it would ban export of the H20. The companies have been contacted for comment. Nvidia told other news outlets, \"We follow rules the US government sets for our participation in worldwide markets.\" \"While we haven't shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide. America cannot repeat 5G and lose telecommunication leadership.\""
    },
    {
        "title": "Silentnight-owner to end controversial tenure with sale of bed manufacturer",
        "description": "The owner of Silentnight, one of Britain's biggest bed manufacturers, is preparing to end a controversial 14-year tenure which included settlements with regulators worth tens of millions of pounds.",
        "url": "https://news.sky.com/story/160silentnight-owner-to-end-controversial-tenure-with-sale-of-bed-manufacturer-13410055",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-silentnight-mattress_6987954.jpg?20250811105559",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-11 09:50:00",
        "Headline": "HIG Europe is working with bankers on the sale of Silentnight, 14 years after a contentious deal triggered nearly £40m in penalties for the private equity firm and KPMG, Sky News learns. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Silentnight, one of Britain's biggest bed manufacturers, is preparing to end a controversial 14-year tenure which included settlements with regulators worth tens of millions of pounds. Sky News has learnt that HIG Europe, which bought Silentnight through an insolvency process in 2011, has appointed bankers at Rothschild to sell the company. City sources estimated on Monday that the company could be worth in the region of £100m. Money blog: Sainsbury's defends 25% meal deal hike A deal is unlikely to be concluded with a buyer until next year. When the sale does take place, it will end HIG's association with a company which found itself at the centre of one of the most contentious private equity deals in the UK for decades. HIG Europe, which specialises in buying mid-sized companies, acquired Silentnight after identifying an opportunity to generate a handsome return if it could strike a deal without the bed-maker's pension liabilities. The private equity group bought a chunk of Silentnight's debts, put in place new restrictions on its borrowing facilities and then forced it into a restructuring process. As a consequence of the ensuing cash crunch, KPMG, the accountancy firm, put Silentnight into administration and immediately sold its assets to HIG Europe without its pension scheme. The deal triggered an investigation by The Pensions Regulator, which used its anti-avoidance powers to pursue the buyout firm for substantial compensation. The watchdog issued two warning notices, in 2014 and 2016, with HIG Europe seeking a judicial review of the latter. Its request was rejected, and in 2021 it agreed a £25m settlement with the pensions watchdog. Although those funds were injected into Silentnight's pension scheme, the injection was not sufficient to prevent its responsibility for paying pensioners being transferred into the Pension Protection Fund, the industry-funded lifeboat. \"Our case was that HIG used the control that was available under the lending facilities to bring about the unnecessary insolvency of otherwise viable companies that were supporting a [defined benefit] pension scheme,\" TPR said at the time of the settlement. \"We would not expect lenders to bring about unnecessary insolvencies, and so we would not ordinarily anticipate targeting them with our powers. \"However, we will be alert to any instance where we believe an unnecessary insolvency is brought about to sever a scheme from its employer and will pursue those cases to appropriate outcomes in accordance with our statutory objectives.\" Read more from Sky News:Full-time workers relying on food handoutsDWP handling of Post Office staff prosecutions to be examined HIG Europe was not the only party which was hit in the pocket over its conduct in relation to Silentnight. In 2021, KPMG was fined nearly £13m by the Financial Reporting Council - at the time a near-record sum - for its role in facilitating the bed manufacturer's pre-pack sale to HIG Europe. An FRC tribunal also fined the KPMG partner who led the deal, David Costley-Wood, and banned him from holding membership of the accountants' professional body for 13 years. KPMG's restructuring arm in the UK was sold - also in 2021 - to HIG Europe, and rebranded as Interpath Advisory. The private equity firm is now in the process of initiating a sale process for the business which could value it at about £800m. A spokesperson for HIG Europe declined to comment on the appointment of bankers."
    },
    {
        "title": "House of Lords under fire for dropping rule that once caught out cricket legend and historian",
        "description": "Campaigners have criticised a change to the rules around declarations of interest in the House of Lords as a \"retrograde step\" which will lead to a \"significant loss of transparency\".&#160;",
        "url": "https://news.sky.com/story/house-of-lords-under-fire-for-dropping-rule-that-once-caught-out-cricket-legend-and-historian-13410265",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lord-botham-lord-skidelsky_6988546.jpg?20250812023619",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-11 16:11:00",
        "Headline": "Peers no longer have to declare non-financial interests - a requirement that has previously caught out members of the House of Lords including ex-England cricketer Lord Botham and economic historian Lord Skidelsky.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Campaigners have criticised a change to the rules around declarations of interest in the House of Lords as a \"retrograde step\" which will lead to a \"significant loss of transparency\".  Since 2000, peers have had to register a list of \"non-financial interests\" - which includes declaring unpaid but often important roles like being a director, trustee, or chair of a company, think tank or charity. But that requirement was dropped in April despite staff concerns. Tom Brake, director of Unlock Democracy, and a former Liberal Democrat MP, wants to see the decision reversed. \"It's a retrograde step,\" he said. \"I think we've got a significant loss of transparency and accountability and that is bad news for the public. \"More than 25 years ago, the Committee on Standards in Public Life identified that there was a need for peers to register non-financial interests because that could influence their decisions. I'm confused as to what's happened in the last 25 years that now means this requirement can be scrapped. \"This process seems to be all about making matters simpler for peers, rather than what the code of conduct is supposed to do, which is to boost the public's confidence.\" Westminster Accounts: Search for your MP Rules were too 'burdensome', say peers The change was part of an overhaul of the code of conduct which aimed to \"shorten and clarify\" the rules for peers. The House of Lords Conduct Committee argued that updating non-financial interests was \"disproportionately burdensome\" with \"minor and inadvertent errors\" causing \"large numbers of complaints\". As a result, the register of Lords interests shrunk in size from 432 pages to 275. MPs have a different code of conduct, which requires them to declare any formal unpaid positions or other non-financial interests which may be an influence. A source told Sky News there is real concern among some Lords' staff about the implications of the change. Non-financial interest declarations have previously highlighted cases where a peer's involvement in a think tank or lobbying group overlapped with a paid role.  Cricket legend among peers to breach code There are also examples where a peer's non-financial interest declaration has prompted an investigation - revealing a financial interest which should have been declared instead. In 2023, Lord Skidelsky was found to have breached the code after registering his role as chair of a charity's trustees as a non-financial interest. The Commissioner for Standards investigated after questions were raised about the charity, the Centre for Global Studies. He concluded that the charity - which was funded by two Russian businessmen - only existed to support Lord Skidelsky's work, and had paid his staff's salaries for over 12 years. In 2021, Lord Botham - the England cricket legend - was found to have breached the code after registering a non-financial interest as an unpaid company director. The company's accounts subsequently revealed he and his wife had benefitted from a director's loan of nearly £200,000. It was considered a minor breach and he apologised. 'Follow the money' Lord Eric Pickles, the former chair of the anti-corruption watchdog, the Advisory Committee on Business Appointments, believes focusing on financial interests makes the register more transparent. \"My view is always to follow the money. Everything else on a register is camouflage,\" he said. \"Restricting the register to financial reward will give peers little wriggle room. I know this is counterintuitive, but the less there is on the register, the more scrutiny there will be on the crucial things.\" 'I was shocked' The SNP want the House of Lords to be scrapped, and has no peers of its own. Deputy Westminster leader Pete Wishart MP is deeply concerned by the changes. \"I was actually quite horrified and quite shocked,\" he said. \"This is an institution that's got no democratic accountability, it's a job for life. If anything, members of the House of Lords should be regulated and judged by a higher standard than us in the House of Commons - and what's happened is exactly the opposite.\" Public confidence in the Lords is already at a low ebb after the PPE controversy surrounding Baroness Michelle Mone, who took a leave of absence in 2022. The government has pledged to reform the House of Lords and is currently trying to push through a bill abolishing the 92 remaining hereditary peers, which will return to the House of Commons in September. But just before recess the bill was amended in the Lords so that they can remain as members until retirement or death. It's a change which is unlikely to be supported by MPs. Read more from Sky News:Warning over water shortfallTrump gaffe speaks volumes A spokesperson for the House of Lords said: \"Maintaining public confidence in the House of Lords is a key objective of the code of conduct. To ensure that, the code includes rigorous rules requiring the registration and declaration of all relevant financial interests held by members of the House of Lords. \"Public confidence relies, above all, on transparency over the financial interests that may influence members' conduct. This change helps ensure the rules regarding registration of interests are understandable, enforceable and focused on the key areas of public concern. \"Members may still declare non-financial interests in debate, where they consider them directly relevant, to inform the House and wider public. \"The Conduct Committee is appointed to review the code of conduct, and it will continue to keep all issues under review. During its review of the code of conduct, the committee considered written evidence from both Unlock Democracy and Transparency International UK, among others.\""
    },
    {
        "title": "Yvette Cooper defends arrest of more than 500 people at Palestine Action protests",
        "description": "Yvette Cooper has defended the arrest of more than 500 people for holding signs supporting Palestine Action.",
        "url": "https://news.sky.com/story/yvette-cooper-defends-arrest-of-more-than-500-people-after-palestine-action-protests-13410093",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-palestine-action-protest_6987410.jpg?20250810155955",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-11 11:11:00",
        "Headline": "The group was proscribed as a terror organisation in July, but hundreds of people, many of pension age, took to the streets this weekend to defend them.",
        "Content": " Yvette Cooper has defended the arrest of more than 500 people for holding signs supporting Palestine Action. The home secretary said protesters over the weekend may have been objecting to Palestine Action being proscribed as a terror group because they \"don't know the full nature of this organisation\". Ms Cooper said that could be due to reporting restrictions on court hearings \"while serious prosecutions are underway\". Politics latest: Reform mayor says she does not feel safe A total of 532 people were arrested on suspicion of supporting a proscribed organisation contrary to Section 13 of the Terrorism Act 2000. Around half of them (259) were aged 60 and above - including almost 100 people who were in their 70s. The Met Police said it was the largest number of arrests it had made related to a single operation in at least the past decade. Ms Cooper added: \"Proscription is not about protest around Palestine or Gaza, where we had tens of thousands of people protesting lawfully just this weekend about some of the horrendous events that we've seen in the Middle East.\" She said members of Palestine Action have carried out violent attacks, causing injuries and involving weapons and smoke bombs, \"causing panic among innocent people\" and major criminal damage against national security infrastructure. The home secretary added there had been \"clear security assessments and advice\" before Palestine Action was proscribed as a terror organisation in July. Palestine Action co-founder Huda Ammori said: \"Yvette Cooper and No 10's claim that Palestine Action is a violent organisation is false and defamatory. \"Spraying red paint on war planes is not terrorism. Disrupting Israel's largest weapons manufacturer Elbit Systems by trespassing on their sites in Britain is not terrorism.\" Former government lawyer Tim Crosland, now spokesman for Defend Our Juries, which organised the weekend's protest, told Sky News: \"Yvette Cooper is so politically invested she's going to continue to defend the arrests of people simply protesting. \"There will be more people at the next action, the police will be so aggrieved that they're having to arrest people holding placards protesting against the atrocities in Gaza while they're having budget cuts.\" Read more:Al Jazeera condemns 'assassinations' of its journalists in GazaDesperation grows in Gaza as protests swell in Israel  Sir Keir Starmer's spokesman said Palestine Action was proscribed based on \"strong security advice\" following assessments from a \"wide range\" of experts across government, the police and security services. \"Those assessments were very clear, this is not a non-violent organisation,\" he said. He added Palestine Action had committed \"three separate acts of terrorism\" but could not go into more detail as further evidence had been provided in a closed court setting due to \"ongoing national security reasons\". Human rights group Amnesty International said it was \"deeply concerned\" about the arrests this weekend. Its UK chief executive, Sacha Deshmukh, said: \"The protesters in Parliament Square were not inciting violence and it is entirely disproportionate to the point of absurdity to be treating them as terrorists. \"Instead of criminalising peaceful demonstrators, the government should be focusing on taking immediate and unequivocal action to put a stop to Israel's genocide and ending any risk of UK complicity in it.\""
    },
    {
        "title": "'Deport now, appeal later' scheme for foreign criminals expanded to 23 countries ",
        "description": "A hostile environment era deportation policy for criminals is being expanded by the Labour government as it continues its migration crackdown.",
        "url": "https://news.sky.com/story/deport-now-appeal-later-scheme-for-foreign-criminals-expanded-to-23-countries-13409652",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-home-office-immigration_6987281.jpg?20250810142029",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-08-11 02:50:00",
        "Headline": "The \"deport now, appeal later\" policy was first introduced when Baroness Theresa May was home secretary in 2014 as part of the Conservative government's hostile environment policy to try and reduce migration.",
        "Content": "\n          Political reporter\n              @TimJ_B\n A hostile environment era deportation policy for criminals is being expanded by the Labour government as it continues its migration crackdown. The government wants to go further in extraditing foreign offenders before they have a chance to appeal by including more countries in the existing scheme. Offenders that have a human right appeal rejected will get offshored, and further appeals will then get heard from abroad. It follows the government announcing on Saturday that it wants to deport criminals as soon as they are sentenced. Read more:Govt vows to deport foreign criminals immediatelyFirst migrants detained under returns deal with France But the victims' minister refused to confirm whether those deported under the new measures will end up serving any time behind bars. Alex Davies-Jones told Sky News on Monday that \"it depends on a case by case basis\". \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Chinese spy alleged to be Prince Andrew's 'close confidant' met with British prime ministers, pictures show\n                 \n                  Former prime minister Theresa May given peerage\n                 Challenged on whether they would be sent to prison once they have been deported, she added: \"They will be returned to the country of origin and it will be up to that country, what they do with them, whether they put them in prison in that country, or whether they choose for them to do as they wish. \"But what is important is that they are not staying here in our country. They are being deported immediately with no right to ever return.\"  Ms Davies-Jones also insisted that human rights legislation won't prevent foreign national offenders from being deported, as the Conservatives have warned. The victims' minister told Sky News that the government's plans are \"watertight\" and said there is no way for prisoners to appeal and stay \"if they're from one of these countries that we've listed, the new 23, that we've expanded it to\". Home Secretary Yvette Cooper also said on Monday: \"We're determined to go further.  \"And we're also making it easier to start the deportation process from the moment of sentencing as well. \"Because frankly, when people come to the UK, they should abide by the rules, and the rules need to be respected and enforced.\" The Conservatives have cast doubt on whether the scheme will actually come into effect. Kemi Badenoch said she will \"believe it when I see it\". The Tory leader explained: \"When we were deporting criminals, Keir Starmer was writing letters trying to stop our deportations.\" She added that it is \"the sort of stuff that they should have been doing on day one\". Ms Badenoch continued: \"The fact that they tried to stop deportations before means that I don't really believe it. The government has released 26,000 prisoners since it came to power, released them early, there are now more criminals on our streets. That's what I'm really worried about.\" What is the scheme, and how is it being expanded? The \"deport now, appeal later\" policy was first introduced when Baroness Theresa May was home secretary in 2014 as part of the Conservative government's hostile environment policy to try and reduce migration. It saw hundreds of people returned to a handful of countries like Kenya and Jamaica under Section 94B of the Nationality, Immigration and Asylum Act 2002, added in via amendment. In 2017, a Supreme Court effectively stopped the policy from being used after it was challenged on the grounds that appealing from abroad was not compliant with human rights. However, in 2023, then home secretary Suella Braverman announced she was restarting the policy after providing more facilities abroad for people to lodge their appeals. Now, the current government says it is expanding the partnership from eight countries to 23. Previously, offenders were being returned to Finland, Nigeria, Estonia, Albania, Belize, Mauritius, Tanzania and Kosovo for remote hearings. Angola, Australia, Botswana, Brunei, Bulgaria, Canada, Guyana, India, Indonesia, Kenya, Latvia, Lebanon, Malaysia, Uganda and Zambia are the countries being added - with the government wanting to include more. The Home Office claims this is the \"the government's latest tool in its comprehensive approach to scaling up our ability to remove foreign criminals\", touting 5,200 removals of foreign offenders since July 2024 - an increase of 14% compared with the year before. Home Secretary Yvette Cooper said: \"Those who commit crimes in our country cannot be allowed to manipulate the system, which is why we are restoring control and sending a clear message that our laws must be respected and will be enforced.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Foreign Secretary David Lammy said: \"We are leading diplomatic efforts to increase the number of countries where foreign criminals can be swiftly returned, and if they want to appeal, they can do so safely from their home country. \"Under this scheme, we're investing in international partnerships that uphold our security and make our streets safer.\" Both ministers opposed the hostile environment policy when in opposition. In 2015, Sir Keir Starmer had questioned whether such a policy was workable - saying in-person appeals were the norm for 200 years and had been a \"highly effective way of resolving differences\". He also raised concerns about the impact on children if parents were deported and then returned after a successful appeal. In today's announcement, the prime minister's administration said it wanted to prevent people from \"gaming the system\" and clamp down on people staying in the UK for \"months or years\" while appeals are heard."
    },
    {
        "title": "Minister defends proposals to ban over 70s from driving if they fail new compulsory eye tests",
        "description": "Wes Streeting has defended plans to make over 70s take compulsory eye tests every three years - which could see them banned from driving if they fail, it is understood.",
        "url": "https://news.sky.com/story/over-70s-face-driving-ban-if-they-fail-new-compulsorily-eye-tests-13409983",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-eye-test-optician_6987866.jpg?20250811084307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-11 06:13:00",
        "Headline": "Ministers have pledged to \"restore order to the road\" by introducing a series of tougher rules for drivers, including tougher penalties for those without insurance.",
        "Content": " Wes Streeting has defended plans to make over 70s take compulsory eye tests every three years - which could see them banned from driving if they fail, it is understood. Ministers are considering \"tougher\" measures to tackle road deaths and injuries in England and Wales, which they believe have \"remained stubbornly high under successive Conservative governments\". Under the new proposals, first reported by The Times, the drink-drive limit would be lowered to match the current rules in Scotland. Currently, the drink-drive limit is 35 micrograms of alcohol per 100 millilitres of breath in England and Wales, or 80 milligrams of alcohol per 100 millilitres of blood.  But this is expected to be lowered to 22 micrograms of alcohol per 100 millilitres of breath or 50 milligrams of alcohol per 100 millilitres of blood, to match the stricter levels already enforced in Scotland. Those caught not wearing a seatbelt could also receive penalty points for the first time, while drivers found on the road without insurance could also face more severe consequences. As well as this, plans are currently being drawn up to make those aged 70 or over take a compulsory eye test every three years when they renew their driving licence. Those who fail this would lose their right to drive under the proposals. It's understood that tests for other conditions, such as dementia, are also being considered. Speaking on Monday, Mr Streeting said the transport secretary is consulting and \"considering a whole range of proposals\", which will be unveiled in the \"not too distant future\". It is understood that Heidi Alexander will unveil the measures in a new road safety strategy in the autumn. The health secretary also defended the plans around elderly drivers. He told broadcasters: \"It cannot be right that we've ended up in a situation where the NHS is hit with a £2bn a year bill because we are not taking road safety seriously enough - particularly as we get older and the quality of our eye health deteriorates, that we're not keeping a regular check.\" Read more from Sky News:The full-time workers who are turning to food banks'Deport now, appeal later' scheme for foreign criminals expanded The Conservatives have also backed the proposals. Kemi Badenoch told reporters: \"I think we need to make sure that people driving on our roads and using our streets are safe. \"If people are failing their eye test, then I think it's important that we make sure that only those people who can actually see can drive, that's quite critical.\" A Labour source said: \"At the end of the last Labour government, the number of people killed and seriously injured on our roads was at a record low, but numbers have remained stubbornly high under successive Conservative governments. \"In no other circumstance would we accept 1,600 people dying, with thousands more seriously injured, costing the NHS more than £2bn per year.\" Age UK has welcomed the government encouraging people to have a regular test, but has warned this \"doesn't automatically mean that a compulsory eye test at age 70 is appropriate\". Caroline Abrahams, the charity's director, pointed out that \"people can develop eye problems at any age\" and questioned why younger drivers should not also be subject to regular tests. She said: \"A regular eye test for drivers of all ages may be a better idea, one less open to the accusation of ageism - but we would need to see all the evidence to form a final view.\" The measures come after 1,633 people died in road traffic accidents in 2024, with nearly 28,000 victims seriously injured."
    },
    {
        "title": "'I don't feel safe' - says ex-Tory MP who blames previous governments, including the ones she served in",
        "description": "A former Tory MP has warned that she does not \"feel safe\" in the UK any more, and blamed previous governments for this - including ones she served in.",
        "url": "https://news.sky.com/story/i-dont-feel-safe-says-ex-tory-mp-who-blames-previous-governments-including-the-ones-she-served-in-13410100",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-andrea-jenkyns-reform-uk_6988075.jpg?20250811131740",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-11 11:31:00",
        "Headline": "Andrea Jenkyns has warned that policing in Britain has become \"soft touch\" and said she is determined to \"fight\" for her son's future.",
        "Content": "A former Tory MP has warned that she does not \"feel safe\" in the UK any more, and blamed previous governments for this - including ones she served in. Dame Andrea Jenkyns has claimed the country is becoming \"soft touch Britain\", with crime going unpunished. The Mayor of Greater Lincolnshire was speaking at a press conference event called Women for Reform in London on Monday morning, which focussed on violence against women and girls. Dame Andrea began by listing a litany of incidents she alleged to have happened to her, including receiving death threats, one of her activists being chased by somebody with a sledgehammer, and a man flashing herself and her eight-year-old son. She said that she \"couldn't get justice\" and that \"these daily occurrences\" are happening in \"every village, every town, every inch of our country\". The Reform UK politician continued: \"I don't feel safe. And as a mother, I no longer feel that our children live in a safe, beautiful haven, a Britain that I grew up in.\" Dame Andrea also warned that children are being exposed to \"left-wing indoctrination\", such as the idea that there are more than two genders - and laid the blame on previous Conservative governments. \n                  Ex-Reform MP Rupert Lowe alerts coastguard to 'migrants' - who were a charity rowing team\n                 \n                  Why next year's Scottish elections could get messy\n                 \n                  Fact-checking Farage: Are foreigners more likely than Britons to commit sexual offences?\n                 She said: \"Under the Conservatives, we lived under an NHS that allowed children to be on puberty blockers and allowed them to change genders. And the NHS swapped - erased - the word mother and replaced it with birthing parents, and replaced breastfeeding with chest feeding. \"Ladies and gentlemen, I'm proud to be a mother, and I'm proud to have breasts.\" Dame Andrea served as a minister in several of these governments, working as an assistant government whip, then as a junior education minister under then-PM Boris Johnson. She also worked as an education minister when Liz Truss became prime minister, before being sacked by Truss' successor, Rishi Sunak, and losing her seat in the general election last year. The Reform mayor told those at the press conference that she stood before them \"not as a politician, but as a mother of a wonderful eight-year-old\". \"I'm fighting for his future,\" she said. 'Increasing threats to women and girls are a national emergency' Sarah Pochin, Reform UK's only female MP, also spoke at the conference and warned that the \"heightened and increasing threat to the safety and security of women and girls\" is a \"national emergency\". Ms Pochin accused the government of \"enabling\" this through illegal immigration and criticised the use of hotels to house asylum seekers. She said that \"few areas of the UK have remained untouched by this wave of state supported illegal migration\". The government has pledged to end the use of hotels to house asylum seekers by 2029. But Pochin added: \"We're talking about the daily influx of people who do not share our values, who do not share our culture, but who are being welcomed into this country, all at vast expense to us, the taxpayer.\" She went on to allege that the majority of those arriving in the UK illegally are \"young military aged males\", from \"predominantly Muslim countries like Afghanistan\", who hold a \"medieval view of women's rights\" and become \"sexually frustrated\". Ms Pochin called this a \"betrayal of our women and girls\", and accused the government of being \"in denial\". Labour: 'Reform are incapable of putting forward any kind of credible policies' Responding to the conference, a Labour spokesperson said: \"If Farage's party wanted to be taken seriously when it comes to tackling the scourge of violence against women and girls, they wouldn't have tried to block Labour's new laws to crack down on perpetrators of such vile criminality and get justice for victims.\" Read more from Sky News:The full-time workers who are turning to food banks'Deport now, appeal later' scheme for foreign criminals expanded The spokesperson pointed out that Reform MPs voted against \"crucial new measures to make women and girls safer on our streets\", and highlighted the party's opposition to the Online Safety Act, which they said will protect women and girls online. The spokesperson continued: \"Yet again, Reform is incapable of putting forward any kind of credible policies to the challenges this country faces. \"Only this Labour government has a serious plan to halve violence against women and girls and make our streets safer.\""
    },
    {
        "title": "Kemi Badenoch suggests asylum seekers should be housed in 'camps'",
        "description": "Kemi Badenoch has appeared to suggest that asylum seekers should be housed in camps which could be policed, instead of in hotels.",
        "url": "https://news.sky.com/story/kemi-badenoch-suggests-asylum-seekers-should-be-housed-in-camps-13410173",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kemi-badenoch-epping_6988124.jpg?20250811142317",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-11 13:31:00",
        "Headline": "The Conservative Party leader appeared to suggest it would be less \"hassle\" if migrants were housed away from British communities.",
        "Content": "Kemi Badenoch has appeared to suggest that asylum seekers should be housed in camps which could be policed, instead of in hotels. The leader of the Conservatives has been speaking to communities about immigration in Epping, Essex, following multiple protests at a hotel in the town alleged to be housing asylum seekers. During her visit, Ms Badenoch sat down with local residents at the Black Lion Pub to discuss their concerns - and appeared to propose housing migrants in \"camps\". The leader of the opposition said: \"Is it possible for us to set up camps and police that, rather than bringing all of this hassle into communities? \"As a party, we need to also hear from the community about what you think the solutions are. We don't have all the answers; it's important that we make sure that the community is part of the problem solved.\" The MP for North West Essex said that politicians must \"turn things around very quickly\". She explained: \"We cannot use rules from 1995, or 2005, or even 2015 for 2025. Our world is changing very quickly, and we need to adapt to it.\" \n                  Why next year's Scottish elections could get messy\n                 \n                  Delay biometric visa checks for 80 Gaza students, dozens of MPs urge UK government\n                 \n                  Kemi Badenoch says she no longer identifies as Nigerian\n                  Epping has seen numerous protests against mass immigration held outside the town's The Bell Hotel, some of which have turned violent. Local politicians have called on the government to shut the hotel. Reform UK leader Nigel Farage also accused Essex Police of \"bussing in\" counter-protesters, claims which the force called \"categorically wrong\". Addressing the protests, Ms Badenoch said there is a \"big difference\" between local communities protesting \"about something that's happening in their midst\" and what she termed \"professional protesters - who turn up at lots of different events\".  The Tory leader said these are \"not equivalent\" and seemed to imply local people should have a priority over those travelling to protest. She said: \"This is your home, this is your community, and that in my view is quite important. People should have some kind of precedence in their own communities versus other people randomly passing through, otherwise we start to change the nature of what protest is.\" Ms Badenoch also alleged that \"people now use protest as a cover for troublemaking\"."
    },
    {
        "title": "Ricky Jones: Labour councillor told crowd far-right protesters 'need to have throats slit', court hears",
        "description": "A Labour councillor said far-right protesters should have their throats slit and drew his finger across his throat at an anti-racism protest following the Southport murders, a court has heard.",
        "url": "https://news.sky.com/story/ricky-jones-labour-councillor-told-crowd-far-right-protesters-need-to-have-throats-slit-court-hears-13410172",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-ricky-jones-labour_6650937.jpg?20240808134212",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-11 13:19:00",
        "Headline": "The suspended councillor called demonstrators \"disgusting Nazi fascists\" at last August's protest in east London as he spoke to a \"tinderbox\" crowd.",
        "Content": "A Labour councillor said far-right protesters should have their throats slit and drew his finger across his throat at an anti-racism protest following the Southport murders, a court has heard. Ricky Jones, 58, who is on trial for encouraging violent disorder, called demonstrators \"disgusting Nazi fascists\" at the protest in east London, last August. Jones, a borough councillor in Dartford, Kent, from 2019, had been warned by his party to stay away from the event in Walthamstow, and was suspended the day after the alleged incident. A video of Jones speaking to the \"tinderbox\" crowd, dressed in a black polo top and surrounded by cheering supporters, went viral on social media after the protest. The councillor said: \"They are disgusting Nazi fascists. We need to cut all their throats and get rid of them all.\" The demonstration had been organised in response to plans for a far-right march outside nearby Waltham Forest Immigration Bureau, jurors at Snaresbrook Crown Court were told. It followed the nationwide violent disorder that occurred last summer after the Southport murders when Axel Rudakubana killed three girls and attempted to murder eight others at a summer holiday Taylor Swift-themed event. \n                  Girl, 16, and two teenage boys arrested on suspicion of murder after death of man on Isle of Sheppey\n                 \n                  Boy, 4, dies after being hit by bus as he walked out of hospital in Margate, Kent\n                 \n                  HMS Northumberland: Experts face 'race against time' to study shipwreck\n                 Prosecutor Ben Holt said Jones used \"inflammatory, rabble-rousing language in the throng of a crowd that we will hear described as a tinderbox\". Read more on Sky News:'Little angels' remembered, a year onMissed chances to stop RudakubanaSouthport stabbings survivor describes ordeal Opening the case on Monday, Mr Holt said: \"Last summer, three young girls were killed at a dance party in Southport. \"There was some hysteria... Some of that grief manifested itself in anger, and regrettably, violence.\" The incidents brought out counter-protests, one of which Jones decided to go to, the prosecutor said. \"He attended in the face of considered advice not to do so. At Walthamstow that day, rumours had spread that there was going to be a protest outside an immigration centre. \"During that event, he made a speech, amplified through a public address system, to the crowd. \"He called the other side disgusting Nazi fascists. He said that their throats needed to be slit. He drew his finger along his throat as he said that. \"This, in a setting where, we suggest, violence could readily have been anticipated. \"We ask rhetorically, what did Mr Jones think was going to happen?\" Days before the protest, the Labour Party wrote urging him to follow police advice \"not to take part in, attend or encourage others to attend, any sort of demonstration or counter demonstration\". Jones, of Dartford, who denies one count of encouraging violent disorder, told police he was \"sorry\" he made the comments \"in the heat of the moment\", and had not intended for them to be \"taken literally\", Mr Holt said."
    },
    {
        "title": "'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant",
        "description": "Jellyfish have shut down four reactors at France's largest nuclear power plant.",
        "url": "https://news.sky.com/story/massive-and-unpredictable-swarm-of-jellyfish-shuts-down-nuclear-plant-13410357",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jellyfish-stock_6988511.jpg?20250811214036",
        "type": "Technology",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-11 20:27:00",
        "Headline": "The Gravelines site in France, which can power around 5 million homes, has temporarily stopped production while teams try to clear the blockage.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Jellyfish have shut down four reactors at France's largest nuclear power plant. The swarm entered the filter drums of the pumping stations at the Gravelines site in northern France on Sunday night. Operator EDF confirmed to Sky News that the \"massive and unpredictable presence of jellyfish\" caused units 2, 3 and 4 to automatically shut down between 11pm and midnight on 10 August. Unit 6 then shut down just after 6am on Monday 11 August. The plant, situated on the coast between Calais and Dunkirk, has six units which can produce a total of 5.4 gigawatts of power. In a statement, EDF said the pumping stations affected are in the non-nuclear part of the plant, adding the shutdowns \"had no impact on the safety of the facility, the safety of personnel or the environment\". The site, which can power around 5 million homes, has temporarily stopped production while teams try to clear the blockage. \n                  At least two dead as wildfires sweep across Greece, Turkey and France\n                 \n                  One dead as 'hellish' wildfire burns across area the size of Paris in southern France\n                 \n                  Cabinet minister admits UK-France migrant returns could be 'frustrated' by legal challenges\n                 Two unaffected units had already been taken offline for maintenance. Read more from Sky News:Amber heat health alert issued for parts of EnglandFirefighters dampen down blaze at Edinburgh landmark A spokesperson said France is still exporting more than four gigawatts of electricity to the UK. A boom in jellyfish numbers has been reported in the sea around Calais, likely due to rising water temperatures and increases in the plankton they eat. \"Jellyfish breed faster when water is warmer, and because areas like the North Sea are becoming warmer, the reproductive window is getting wider and wider,\" said Derek Wright, marine biology consultant at the National Oceanic and Atmospheric Administration Fisheries. \"Jellyfish can also hitch rides on tanker ships, entering the ships' ballast tanks in one port and often getting pumped out into waters halfway across the globe,\" he said. The Gravelines site draws water for its cooling systems from a canal connected to the North Sea, which is home to several species of jellyfish. The invertebrates have also been responsible for problems at several other coastal power stations, including the Torness nuclear plant in Scotland, where they have clogged the water intake pipes multiple times. In 1999, jellyfish were blamed for causing a massive blackout in the Philippines."
    },
    {
        "title": "Fresh hope for pancreatic cancer patients as new vaccine shows promise in early trial",
        "description": "A new pancreatic cancer vaccine has appeared to slow disease progression and increase survival for patients in an early trial.",
        "url": "https://news.sky.com/story/fresh-hope-for-pancreatic-cancer-patients-as-new-vaccine-shows-promise-in-early-trial-13410167",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-cancer-vaccine_6988165.jpg?20250811152830",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-11 13:29:00",
        "Headline": "The new vaccine, which has shown promise in an early trial involving 20 pancreatic cancer patients and five with bowel cancer, has been developed to help the body's immune system find and attack cancer cells.",
        "Content": "A new pancreatic cancer vaccine has appeared to slow disease progression and increase survival for patients in an early trial. Pancreatic cancer has some of the poorest survival rates due to it often only being detected in an advanced stage. Many see their cancers not responding to treatment or continuing to spread despite undergoing treatments such as chemotherapy and radiotherapy. The new vaccine, which has shown promise in an early trial involving 20 pancreatic cancer patients and five with bowel cancer, has been developed to help the body's immune system find and attack cancer cells. Both pancreatic and bowel cancers carry a mutation in a gene called KRAS, which plays a key role in tumour growth. The jab was developed to recognise and attack KRAS-mutant cancer cells, as well as improve vaccine delivery to the lymph nodes, which filter out foreign substances like cancer cells and infections, in the body. In the phase 1 trial for the jab, 68% of the 25 patients had developed a strong immune response to the mutant KRAS tumour proteins after about 20 months. However, some patients responded more favourably than others, with experts saying more research was needed to establish the cause for the differing reactions. Those with the strongest immune response both lived longer and remained cancer-free for longer than those with a weaker response. Pancreatic cancer patients who received the vaccine survived about two years and five months after getting the ELI-002 2P jab, according to the study published in the journal Nature Medicine. At present, just three in 10 people diagnosed with the condition survive for a year, so the early trial results give fresh hope to patients. Read more from Sky News:Amber heat health alert for parts of England30 evacuated after burst water main floods streets The vaccine does not need to be personalised and can therefore be manufactured in bulk to be administered more rapidly. Researchers have already started testing the efficacy of the jab among a larger group of pancreatic and bowel cancer patients. Study lead Dr Zev Wainberg from the University of California, in the US city of Los Angeles, called the findings \"remarkable\" and said the second phase of the trial was already under way."
    },
    {
        "title": "'Shocked and amazed': remains of British researcher found in a glacier, 60 years after he died",
        "description": "The remains of a British researcher have been recovered from a glacier in Antarctica, more than 60 years after a scientific expedition went badly wrong.",
        "url": "https://news.sky.com/story/shocked-and-amazed-remains-of-british-researcher-found-in-a-glacier-60-years-after-he-died-13410051",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dennis-bell-missing_6987958.jpg?20250811120419",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-08-11 09:33:00",
        "Headline": "Dennis \"Tink\" Bell was almost rescued after he fell down a crack in a glacier in 1959, before falling a second, deadly, time. His brother said the findings had helped the family \"come to terms with the tragic loss\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The remains of a British researcher have been recovered from a glacier in Antarctica, more than 60 years after a scientific expedition went badly wrong. In 1959, Dennis \"Tink\" Bell was working for the Falkland Islands Dependencies Survey (FIDS), now known as the British Antarctic Survey (BAS), when he died in a deep crack in a glacier on King George Island, off the Antarctic Peninsula. His body was never recovered. But in January this year, a Polish team spotted scattered human remains among rocks that had been exposed by a moving glacier. The parts were later confirmed via DNA testing to be those of the 25-year-old meteorologist. His brother, David Bell, said: \"When my sister Valerie and I were notified that our brother Dennis had been found after 66 years, we were shocked and amazed.\" The remains were transported on the BAS Royal Research Ship Sir David Attenborough to the Falkland Islands, and then taken to London. \n                  Antarctica's oldest ice arrives in UK for analysis on climate shifts\n                 \n                  What we learnt flying over the world's largest iceberg A23a - and why it's not long for this world\n                 \n                  Bigger than London and five times the weight of Mt Everest: The impact of the world's biggest iceberg \n                 David Bell said bringing his sibling home had \"helped us come to terms with the tragic loss of our brilliant brother\". Rod Rhys Jones, chair of the British Antarctic Monument Trust (BAMT), called it \"amazing that the Polish team recognised the remains\", which had been shifted around steep terrain by the movement of the glacier. How the accident unfolded On 26 July 1959 - deep winter in the Southern Hemisphere - Dennis Bell set out with surveyor Jeff Stokes and dog sleds to carry out survey and geological work. Bell helped to survey King George Island, which had been largely unexplored, to produce some of the first maps of the territory. He and Stokes planned to climb a glacier leading to an ice plateau, along with two more researchers, Ken Gibson and Colin Barton, who followed them about half an hour later. Ascending the glacier, Bell and Stokes crossed an area riddled with crevasses - deep fissures in icy glaciers - and then believed they were in a safer area. But the dogs started to tire from ploughing through the deep, soft snow. Bell went ahead to gee them up, \"tragically, without his skis\", BAS and BAMT said. Suddenly, he disappeared down a deep crevasse that had been hidden by snowfall resting over the top, leaving behind a gaping hole in the white landscape. Sir Vivian Fuchs, a previous director of BAS, describes what happened next in his book, Of Ice and Men. \"Peering into the depths, Stokes called repeatedly and was greatly relieved to be answered. Lowering a rope almost a hundred feet, he told Bell to tie himself on. \"As he could not haul up the weight, he hitched his end of the rope to the team. The dogs took the strain and began to pull. Now it was easy and everything was going well. \"But Bell had tied the rope through his belt instead of round his body, perhaps because of the angle at which he lay in the crevasse. As he reached the top his body jammed against the lip, the belt broke, and down he went again. \"This time there was no reply to Stoke's calls. It was a particularly tragic fatality which one really felt should never have happened, and thus doubly grievous.\" Eventually, Stokes met up with Gibson and Barton further down the glacier. But the weather deteriorated, and it took them hours to find the markers Stokes had set up in the snow, by which point they were sure Bell had died. The Polish discovery More than 60 years later, Polish researchers from the Henryk Arctowski Polish Antarctic Station discovered by chance some bones and artefacts in the rocky moraine edge of the Ecology Glacier on 19 January this year. A team returned to the site as soon as they could in February - lest it be covered by snow or rock again - to survey it in more detail. They recovered more bone fragments and personal items, including broken radio equipment, a torch, ski poles, an inscribed Erguel wristwatch, a Swedish Mora knife, ski poles and an ebonite pipe stem. \"Every effort was made to ensure that Dennis could return home,\" three of the Polish scientists said in a statement. BAS's director of operations Oliver Darke said the discovery brings \"important closure for the Bell family, who never knew what had happened to their brother after his fall into the crevasse\". \"Antarctica is an inhospitable and dangerous place to operate in,\" he told Sky News, adding BAS prioritises safety above all else, via extensive training and procedures and experienced polar field guides."
    },
    {
        "title": "Perseid meteor shower: When and how to see up to 100 fireballs shoot across the sky per hour",
        "description": "The best day to see the \"most popular meteor shower of the year\" is just round the corner.",
        "url": "https://news.sky.com/story/perseid-meteor-shower-when-and-how-to-see-up-to-100-fireballs-shoot-across-the-sky-per-hour-13403085",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-persied-meteor-space_6983415.jpg?20250805141918",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-11 03:24:00",
        "Headline": "Described as the \"most popular meteor shower of the year\", stargazers will hopefully be able to see the annual Perseids dart across the sky as the phenomenon reaches its peak.",
        "Content": "The best day to see the \"most popular meteor shower of the year\" is just round the corner. The Perseids shower can bring up to 100 meteors per hour at its peak - including bright streaks and fireballs - creating a spectacular site for stargazers. Here is everything you need to know, from increasing your chances of seeing meteors to why it happens in the first place. Why does the Perseids meteor shower happen? The phenomenon has been recurring for centuries and is the result of Earth passing through a cloud of dust left behind the Comet Swift-Tuttle. The meteors, which are typically no bigger than a grain of sand, burn up as they hit the Earth's atmosphere at 36 miles per second, producing bright trails of light. Perseids - named after Perseus, the constellation that the meteors are believed to originate from - are also known for their fireballs. This is characterised by larger explosions of light and colour which stay in the sky for longer than the average meteor streak. It has been described by NASA as the \"most popular meteor shower of the year\". When is the best day to see it? The meteor shower has been active from 17 July and will go on until 24 August, according to the Royal Observatory. However, the number of meteors is expected to increase every night until it reaches its peak on 12 August. On this day, observers in the UK should be able to see some meteors as soon as the Sun sets, but the Royal Observatory says the best time to look up is between midnight on 11 August and 5.30am. A bonus for people trying to catch the meteor shower, Jupiter and Venus will also appear at their closest on the 11 and 12 August. NASA says on the morning of the 12th, the two planets will be roughly a degree apart and will shine brightest before sunrise. Why the moon matters  The peak of this year's Perseids shower may be hindered by the moon being at 84% brightness. NASA says the glare of the moon is expected to wash out the brightest meteors, but all is not lost. Keen stargazers may still be able to see the action by standing behind a tall building or tree to block out some of the moonlight. Tips for stargazers Unsurprisingly, experts say observers should still try to avoid well-lit and built-up areas and try to find unobstructed views to make the most of the spectacle. Meteorite expert Dr Ashley King, from London's Natural History Museum, said standing on a hill in the middle of the countryside or going to the coast are typically ideal meteor viewing locations. He adds that the skies may look blank for the first 10 minutes while your eyes adjust to the dark, so warned stargazers to be patient. Using a red light torch can also help, as it will not strain your eyes while they get used to the dark. He said: \"Once you get used to the low light levels, you'll begin to notice more and more. So don't give up too quickly.\""
    },
    {
        "title": "Nvidia and AMD to pay Trump administration 15% of chip revenue for export licences to China",
        "description": "Two major US microchip makers have agreed to pay the Trump administration a portion of sales in return for export licences to send chips to  China, according to reports.",
        "url": "https://news.sky.com/story/nvidia-and-amd-to-pay-trump-administration-15-of-chip-revenue-for-export-licences-to-china-13409998",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-jensen-huang_6585235.jpg?20240619101627",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-11 06:57:00",
        "Headline": "Paying the government to allow export licences for previously banned export semiconductors is said to be unprecedented.",
        "Content": "Two major US microchip makers have agreed to pay the Trump administration a portion of sales in return for export licences to send chips to  China, according to reports. The world's most valuable company, Nvidia, and Advanced Micro Devices (AMD) will give 15% of Chinese sales of two AI-powering microchips to the US government. Such an agreement is said to be unprecedented, according to reporting in the Financial Times. Money blog: Sainsbury's defends 25% meal deal hike The companies are reported by the paper to have been issued licences to export the semiconductors to the world's second largest economy after a change of course by the Trump government in June. Semiconductors are found in nearly all electronic technology and are vital to powering the modern world. Previously export of ones, such as the H20 and MI308 produced by Nvidia and AMD respectively, had been banned under US national security grounds.  But successful lobbying by Nvidia's chief executive Jensen Huang meant Trump allowed for resumed sales in China. \n                  China orders 'all-out' rescue operation as 10 killed and dozens missing after floods\n                 \n                  Thousands fall ill with mosquito-borne chikungunya virus in China\n                 \n                  What would Trump do if China invaded Taiwan?\n                 Having China reliant on US technology, rather than needing to develop its own, was seen to be better for America by the administration. Nvidia's H20 chip was designed with the Biden administration's export crackdown on advanced artificial intelligence (AI) powering chips in mind. In April, President Trump's government said it would ban export of the H20. The companies have been contacted for comment. Nvidia told other news outlets, \"We follow rules the US government sets for our participation in worldwide markets.\" \"While we haven't shipped H20 to China for months, we hope export control rules will let America compete in China and worldwide. America cannot repeat 5G and lose telecommunication leadership.\""
    },
    {
        "title": "Harry and Meghan extend Netflix partnership - but it's no longer exclusive",
        "description": "Harry and Meghan have signed a new \"multi-year, first-look deal\" with Netflix, following the deal they struck with the streaming giant five years ago.",
        "url": "https://news.sky.com/story/harry-and-meghan-extend-netflix-partnership-but-its-no-longer-exclusive-13410287",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-prince-harry-colombia_6657969.jpg?20240816114704",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-08-11 16:48:00",
        "Headline": "Meghan said the new deal would expand to include her As ever lifestyle brand, adding that she and Harry felt \"inspired\" to make \"thoughtful content\" which they hoped would \"resonate globally\".",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Harry and Meghan have signed a new \"multi-year, first-look deal\" with Netflix, following the deal they struck with the streaming giant five years ago. The agreement quashes rumours that the Sussexes' relationship with the company might not be renewed, but it would appear to be a less prestigious arrangement. As a \"first-look deal\" rather than an overall deal, the entertainment giant will be able to say yes or no to their content before anyone else, but they will not be under an obligation to stream it. Several US outlets have suggested it is a downgrade from the Sussexes' previous contract, which saw the streaming giant pay for exclusive rights for the content and was thought to be worth more than $100m (£74m). British PR expert Mark Borkowski described the deal as a \"downgrade\" and suggested Netflix was \"pivoting away\" from Harry and Meghan. Read more: Some call the deal a demotion - but the company still sees them as a power couple Harry and Meghan set up their media company, Archewell Productions, after quitting as senior working royals in 2020. \n                  Meghan shares video of trip to Disneyland with Prince Harry and children Archie and Lilibet\n                 \n                  Meghan speaks about difficulties balancing business and motherhood\n                 \n                  Meghan not using HRH title for commercial purposes, her representatives say\n                 Their partnership with Netflix had promised documentaries, docuseries, feature films, scripted shows and children's television, but has so far only delivered documentaries and docuseries. Royal correspondent Some have argued that a \"first-look deal\" looks like a demotion from what they previously signed up to. With no real clarity on how much their original deal was worth, and no numbers being publicly thrown around this time, that is hard to judge. But talking to those who know something about these kinds of deals, you do get a sense it could potentially be more lucrative than it looks on face value. Read the full analysis here These include Harry & Meghan, a six-part series about their departure from the royal household, which is Netflix's fifth most popular series of all time, and most recently, the lifestyle show With Love, Meghan, which is the streamer's most-watched culinary show since its release earlier this year. Speaking about the new deal, Meghan said: \"We're proud to extend our partnership with Netflix and expand our work together to include the As ever brand.\" As ever is Meghan's lifestyle brand, launched in 2024, and rebranded this year, selling products including jams, shortbread and wine. Meghan went on: \"My husband and I feel inspired by our partners who work closely with us and our Archewell Productions team to create thoughtful content across genres that resonates globally and celebrates our shared vision.\" Netflix's chief content officer Bela Bajaria called the Sussexes \"influential voices\" and said their stories \"resonate with audiences everywhere\". New output includes the second season of With Love Meghan later this month, and a Christmas special in December. Archewell Productions is also working on a documentary about orphaned children in Uganda's Masaka region, an area heavily hit by the HIV/AIDS crisis, titled Masaka Kids, A Rhythm Within, and is developing a feature adaptation of the bestselling romantic novel by Carley Fortune, Meet Me At The Lake. It comes as Harry has cut ties with his Sentebale charity but has said he still intends to do what he can to help young people in Lesotho, Botswana and Southern Africa."
    },
    {
        "title": "Some call the Sussexes' Netflix deal a demotion - but the company still sees them as a power couple",
        "description": "While we're all desperate to know what this new deal is really worth in dollars and pounds, one thing I can tell you for certain is that Prince Harry and Meghan want us to know they're delighted that Netflix again wanted to get a deal done.",
        "url": "https://news.sky.com/story/some-call-the-sussexes-netflix-deal-a-demotion-but-the-company-still-sees-them-as-a-power-couple-13410313",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-prince-harry-meghan_6963912.jpg?20250713124746",
        "type": "Entertainment",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-11 18:07:00",
        "Headline": "Harry and Meghan are delighted with their new production deal - but some say it shows the couple aren't worth what they were back in 2020.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n While we're all desperate to know what this new deal is really worth in dollars and pounds, one thing I can tell you for certain is that Prince Harry and Meghan want us to know they're delighted that Netflix again wanted to get a deal done. \"Absolutely over the moon\" is how it was described to me. But they'll also be aware of the attention it'll attract as we all try to pick apart what it means. Firstly because of that ongoing fascination in how they're making money since stepping away from royal life and losing financial support from the King, but also because of the recent reports that Netflix were intending to cut ties. Yes this is a different type of deal from their original one in 2020. Some have argued that a \"first look deal\" looks like a demotion from what they previously signed up to. With no real clarity on how much their original deal was worth, and no numbers being publicly thrown around this time, that is hard to judge. But talking to those who know something about these kinds of deals you do get a sense it could potentially be more lucrative than it looks on face value. \n                  Meghan shares video of trip to Disneyland with Prince Harry and children Archie and Lilibet\n                 \n                  Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday\n                 \n                  Meghan speaks about difficulties balancing business and motherhood\n                 With first look deals, yes there is often financial commitments from the likes of Netflix to get that first exclusive look at projects and first refusal.  But there could be other significant monetary incentives for the Sussexes to sign. For example, when the Obamas signed a first look deal with Netflix, the streaming service agreed to pay the operational costs for their production company \"Higher Ground\". Could it be that Netflix are also now covering the costs of Archewell Productions? It's stating the obvious to say that Harry and Meghan continue to divide opinions, some wanting to watch their programmes from a place of respect and fondness, others as a reason to grumble about them. But signing on this latest dotted line shows Netflix still sees them as a power couple, who attract significant attention and are worthy of investment, whatever that really adds up to."
    }
]