[
    {
        "title": "Rachel Reeves 'a gnat's whisker' from having to raise taxes, says IFS",
        "description": "Rachel Reeves is a \"gnat's whisker\" away from having to raise taxes in the autumn budget, a leading economist has warned - despite the chancellor insisting her plans are \"fully funded\".",
        "url": "https://news.sky.com/story/rachel-reeves-a-gnats-whisker-from-having-to-raise-taxes-says-ifs-13382868",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-politics_6940579.jpg?20250612204238",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-12 19:14:00",
        "Headline": "The chancellor pledged tens of billions of pounds to the NHS, transport projects, the defence budget and more in her spending review - but attention has already started turning towards her next fiscal event as the economy continues to struggle.",
        "Content": " Rachel Reeves is a \"gnat's whisker\" away from having to raise taxes in the autumn budget, a leading economist has warned - despite the chancellor insisting her plans are \"fully funded\". Paul Johnson, director of the Institute for Fiscal Studies (IFS), said \"any move in the wrong direction\" for the economy before the next fiscal event would \"almost certainly spark more tax rises\". 'Sting in the tail' in chancellor's plans - politics latest Speaking the morning after she delivered her spending review, which sets government budgets until 2029, Ms Reeves told Wilfred Frost hiking taxes wasn't inevitable. \"Everything I set out yesterday was fully costed and fully funded,\" she told Sky News Breakfast. Her plans - which include £29bn for day-to-day NHS spending, £39bn for affordable and social housing, and boosts for defence and transport - are based on what she set out in October's budget. That budget, her first as chancellor, included controversial tax hikes on employers and increased borrowing to help public services.  Chancellor won't rule out tax rises The Labour government has long vowed not to raise taxes on \"working people\" - specifically income tax, national insurance for employees, and VAT. Ms Reeves refused to completely rule out tax rises in her next budget, saying the world is \"very uncertain\". The Conservatives have claimed she will almost certainly have to put taxes up, with shadow chancellor Mel Stride accusing her of mismanaging the economy. Taxes on businesses had \"destroyed growth\" and increased spending had been \"inflationary\", he told Sky News. New official figures showed the economy contracted in April by 0.3% - more than expected. It coincided with Donald Trump imposing tariffs across the world. Ms Reeves admitted the figures were \"disappointing\" but pointed to more positive figures from previous months. Read more:Chancellor running out of levers to pullGrowth stats make for unpleasant readingYour spending review questions answered  'Sting in the tail' She is hoping Labour's plans will provide more jobs and boost growth, with major infrastructure projects \"spread\" across the country - from the Sizewell C nuclear plant in Suffolk, to a rail line connecting Liverpool and Manchester. But the IFS said further contractions in the economy, and poor forecasts from the Office for Budget Responsibility, would likely require the chancellor to increase the national tax take once again. It said her spending review already accounted for a 5% rise in council tax to help local authorities, labelling it a \"sting in the tail\" after she told Sky's Beth Rigby that it wouldn't have to go up."
    },
    {
        "title": "Two women dead after 'incident' in Eryri (Snowdonia) National Park",
        "description": "Two women have died after an incident in Wales's largest national park, police have confirmed.",
        "url": "https://news.sky.com/story/two-women-dead-after-incident-in-eryri-snowdonia-national-park-13382787",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wales-eryri_6940384.jpg?20250612171540",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-12 16:15:00",
        "Headline": "North Wales Police said its \"thoughts and sympathies\" are with the women's families and appealed for information from anyone who may have been walking in the area.",
        "Content": "Two women have died after an incident in Wales's largest national park, police have confirmed. North Wales Police said the women died in Nant Gwynant, in Eryri National Park, also known as Snowdonia, on Wednesday night. Officers were called to the scene at 9.31pm after they received a report a female had been pulled from the water. Another female was reported to be in the water at the pools on the Watkin Path, police said. She was pulled from the water, but despite the best efforts of everyone involved, they were both pronounced dead at the scene. As well as North Wales Police, the Llanberis Mountain Rescue Team, air ambulance and Coastguard helicopter also attended. Detective Chief Inspector Andy Gibson of North Wales Police said the force's \"thoughts and sympathies\" were with the families of both women. \n                  Road finally opens after 23 years of roadworks\n                 \n                  More deaths possible at beach where teen drowned, coroner says\n                 \n                  Wales's first minister hails spending review as 'big win' - but opposition call it an 'insult'\n                 An investigation into their deaths has begun and officers are appealing for anyone who may have been walking in the Watkin Path area between 6pm and 9pm on Wednesday night to get in touch. \"They are urged to contact us,\" he added. The coroner has been informed. The Watkin Path is one of the six main routes to the summit of Snowdon, also known as Yr Wyddfa."
    },
    {
        "title": "Iran not complying with nuclear obligations for first time in almost 20 years, says UN watchdog",
        "description": "The UN nuclear watchdog's board of governors has found that Iran is not complying with its nuclear obligations for the first time in 20 years.",
        "url": "https://news.sky.com/story/iran-not-complying-with-nuclear-obligations-for-first-time-in-almost-20-years-says-un-watchdog-13382401",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-iran-natanz_6689980.jpg?20240919094639",
        "type": "Home",
        "Author": "Michael Drummond",
        "Date Published": "2025-06-12 05:05:00",
        "Headline": "Iran, which says it has \"always adhered\" to its safeguard obligations, vowed to open a new uranium enrichment facility \"in a secure location\" in response.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The UN nuclear watchdog's board of governors has found that Iran is not complying with its nuclear obligations for the first time in 20 years. It comes as sources have told US media that Israel is considering taking military action against Iran in the coming days - without American support. Iran said it has \"always adhered\" to the safeguard obligations laid down by the International Atomic Energy Agency (IAEA). Tehran said it \"has no choice but to respond to this political resolution\", and said it would launch a new enrichment site \"in a secure location\". \"Other measures are also being planned and will be announced subsequently,\" Iran said. The reports come as US President Donald Trump is said to be in advanced discussions with Iran about a diplomatic deal to curtail the Middle Eastern country's nuclear programme. However Mr Trump told the New York Post's \"Pod Force One\" podcast that he was \"getting more and more less confident about\" an agreement. \n                  Israel attacks Iran and declares emergency over expected 'missile and drone' retaliation\n                 \n                  Three alleged Iranian spies appear at Old Bailey\n                 \n                  Iran has stockpiled near nuclear weapons-grade uranium, UN watchdog finds \n                 Iran will not abandon what it views as its right to enrich uranium, contrary to US demands, a senior Iranian official said on Thursday. Last week, Iran's Supreme Leader Ayatollah Ali Khamenei said that abandoning such enrichment was \"100%\" against the country's interests. Israel and the US have long feared that Iran's nuclear programme aimed to develop a nuclear weapon, something Tehran has repeatedly denied. The 2015 Iran deal signed by President Barack Obama sought to place limits on Iran's uranium enrichment in exchange for the lifting of sanctions. However, President Trump ultimately pulled America out of the agreement. There has been a recent effort to strike a new deal as fears of Iran's nuclear programme persist in the volatile region. Israel is said to have become more serious about a unilateral strike on Iran, particularly with reports that a deal between the US and Iran could include provisions about uranium enrichment. Israel views those provisions as unacceptable. Such a strike would be a dramatic break with the Trump administration's foreign policy. With tensions in the region simmering as the nuclear discussions unfold and with the potential for unrest, the US State Department ordered the evacuation of all non-essential personnel from its embassy in the Iraqi capital, Baghdad. America has also authorised - rather than ordered - the departure of non-essential personnel and family members from Bahrain and Kuwait What is going on? Dr Burcu Ozcelik, a Middle East expert at the RUSI thinktank, said it is important to bear in mind that there is \"a high level of psychological operation manoeuvring at play\". \"This is a tactic by all involved parties as each tests the others' threshold even as talks continue in parallel,\" she added in comments shared with Sky News. She said one possible scenario is that the US announcement of partial evacuation of embassy staff is a way to signal readiness for military escalation, something she described as a \"high-risk gamble\". \"The US may be prepping to deter Iranian retaliation in case of an Israeli strike - but it is unclear if it's real strategy or leverage-building posturing to pressure Tehran into a 'quick deal'.\" Another possibility, Dr Ozcelik says, is that a first round of strikes against Iran may not directly involve nuclear sites, but other critical national infrastructure to increase pressure and reduce Iranian commitment to its negotiating position, particularly on the point about zero enrichment. Middle East correspondent Israel has made no secret of its assessment that Iran is politically and militarily weak, and there has rarely been a better moment to strike its nuclear facilities. So far, pressure from the US has stopped them acting.  But nuclear talks between Iran and the US are faltering, President Trump is no longer confident a deal can be reached, and Israel has said it is ready to strike if the talks collapse. That moment could be nearing.  A further round of negotiations is set to take place in Oman this weekend. If Iran remains insistent that it must retain enriched uranium, then US patience might run out. Although the threat of Israeli strikes should be taken seriously, the decision to partially evacuate the US embassy in Baghdad and permit the voluntary departure of other US government dependents in the region, could be a negotiating tactic. A way of upping the stakes. Sources I've spoken to around the region are calm, for now.  But for Israel, the window to act could be closing. Its strikes on Iran in October 2024 reportedly eliminated much of the country's air defences. The more time that passes the more opportunity Iran has to rebuild, and that will be in the mind of Benjamin Netanyahu and Israeli commanders as their weigh their options.  "
    },
    {
        "title": "Charges over Ballymena riots as centre housing foreign families attacked",
        "description": "Three teenagers have been charged with rioting in Ballymena - as a community centre housing migrant families affected by the violence was attacked.",
        "url": "https://news.sky.com/story/charges-over-ballymena-riots-as-centre-housing-foreign-families-attacked-13382510",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-larne-leisure-centre_6939722.jpg?20250612031447",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-12 09:06:00",
        "Headline": "Three teenagers aged 18, 17 and 15 are charged with rioting, as the attack on Larne Leisure Centre, 25 minutes away, follows a third night of violence in Ballymena.",
        "Content": " Three teenagers have been charged with rioting in Ballymena - as a community centre housing migrant families affected by the violence was attacked. An 18-year-old man, and two boys aged 15 and 17, are expected to appear before Ballymena Magistrates' Court today. The 15-year-old has also been charged with criminal damage. Two other teenage boys who were arrested during the disorder have been released on bail, the Police Service of Northern Ireland (PSNI) said. Masked youths attacked Larne Leisure Centre and set it on fire on Wednesday evening after it emerged some of the foreign families fleeing the rioting were being temporarily held there. There have been calls for Northern Ireland's communities minister to resign after he was accused of inflaming tensions in a social media post. Prior to the attack, he wrote he had been made aware individuals had been \"temporarily moved\" to the building \"following the disturbances in Ballymena\", which is around 25 minutes away. Police said ethnic minorities had been targeted in the violence, which they have described as \"racist thuggery\". Eyewitness: It is hard to see where the violence will end  Mr Lyons said in his post: \"As a local MLA for the area, neither I nor my DUP council colleagues were made aware or consulted on this decision until late this afternoon.\" He added: \"It has now been confirmed to us by the PSNI and council that all these individuals are in the care of the Housing Executive and have been moved out of Larne. \"Protesting is of course a legitimate right, but violence is not and I would encourage everyone to remain peaceful.\"  Some politicians have said Mr Lyons should be considering his position, while Northern Ireland Secretary Hilary Benn said it was not helpful to publicise where people had been moved. Asked if he should still be in his job, he told the BBC Good Morning Ulster programme: \"Absolutely.\" He insisted the information was already in the \"public domain\". Read more: Families flee Ballymena riots Mid and East Antrim Borough Council said the leisure centre had been designated as an emergency rest centre, but the families had been safely relocated elsewhere. The fire in Larne coincided with a third night of violence in Ballymena."
    },
    {
        "title": "China strikes cautious tone after Trump claims trade deal is 'done'",
        "description": "China will \"always honour its commitments\" when it comes to negotiating trade disagreements with the US, according to a spokesperson for the Chinese government.",
        "url": "https://news.sky.com/story/china-strikes-cautious-tone-after-trump-claims-trade-deal-is-done-13382694",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-xi-jinping_6816079.jpg?20250201083304",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-06-12 13:31:00",
        "Headline": "It follows high-stakes talks between delegations from the two countries in London aimed at stabilising the relationship amid an escalating trade and supply chain war.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n China will \"always honour its commitments\" when it comes to negotiating trade disagreements with the US, according to a spokesperson for the Chinese government. But when pushed by Sky News, he refrained from confirming what those commitments are. The reluctance is at odds with President Trump, who declared on his Truth Social account on Wednesday that \"our deal with China is done\", while also claiming that China has agreed to supply rare earth metals to the US \"upfront\", and to a 55% tariff rate on its goods. The comments follow high-stakes talks between delegations from the two countries in London aimed at stabilising the relationship amid an escalating trade and supply chain war. China's refusal to confirm these details has raised speculation that, contrary to what the US side is claiming, there may still be significant disagreements and some details yet to be worked out. The continued silence comes after two days of negotiations between delegations from the US and China in the UK. While both sides confirmed that they had agreed a \"framework\" to implement the \"consensus\" reached at previous talks in Geneva last month, as well as during a phone call between President Xi and President Trump on 5 June, the delegations were supposed to be taking the agreement to their respective leaders for sign-off. \n                  US-China trade talks: The fact neither side is saying much on the outcome says a lot\n                 \n                  Is Trump ready to wage war at home?\n                 \n                  Trade war: US-China talks in London aim for widespread truce\n                 When asked by Sky News if any of the details in Trump's Truth Social post reflected what China understood to be in the deal, Lin Jian, China's foreign ministry spokesperson, said \"the two sides achieved new progress in addressing the concerns on economic and trade issues\". \"We always honour our commitments. Since we've reached common understandings, the two sides need to follow them.\" 👉 Follow Trump100 on your podcast app 👈 When pushed by Sky News on whether China agrees with Trump's Truth Social assessment that the US-China relationship is \"excellent\", Lin declined to agree, saying simply: \"Our position on relations with the United States has been consistent and clear.\" Such lukewarm language is not uncommon in China but there will likely be significant displeasure at the way Trump is unilaterally publishing details that may not yet have been officially signed off. It is in stark contrast to China's communication landscape which is highly scripted and controlled, and if it was designed to force China into an agreement it could well backfire. Indeed, if everything in Trump's Truth Social post is true it would represent quite a coup for the US, and that feels a little unlikely given the valuable bargaining chips China has, particularly over rare earth metals.  This will likely have been a crunch point in negotiations. China has the vast majority of the world's rare earth metals which are vital in the production of everything from cars to weaponry, and recent export controls imposed in response to Trump's tariffs have brought some production lines to the brink of standstill. In response, the Trump administration imposed extra export controls on high-tech chips, chip development technology and parts needed to make jet engines, as well as moving to revoke student visas for Chinese nationals. Read more from Sky News:What we know so far about India plane crashWas crash a catastrophic one-off? President Trump indicated in his Truth Social post that the measures to revoke visas will be rowed back. When pushed by Sky News, Lin refrained from commenting on whether Trump's communications on this matter have undermined the relationship more broadly, but the stakes remain enormously high, with the unfolding supply chain war set to do significant damage to the economies of both nations."
    },
    {
        "title": "UK economy contracts - with record fall in exports to the US after Trump tariff hikes",
        "description": "The UK economy shrank more than expected in April as the worst of President Trump's tariffs hit.",
        "url": "https://news.sky.com/story/uk-economy-contracted-sharply-in-april-after-trumps-tariffs-13382404",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-uk-economy-gdp_6302114.jpg?20230929121902",
        "type": "Home",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-12 05:14:00",
        "Headline": "While a fall in GDP was anticipated, the drop is steeper than expected.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK economy shrank more than expected in April as the worst of President Trump's tariffs hit. The standard measure of economic output (GDP) contracted a sharp 0.3% in April, data from the Office for National Statistics (ONS) showed. During the month, Mr Trump's so-called \"Liberation Day\" applied steep tariffs to countries around the world and sparked a trade war with China, the world's second-largest economy. The outcome is worse than expected by economists. A contraction of just 0.1% had been forecast by economists polled by the Reuters news agency. It's also down from the growth of 0.2% recorded in March. Blow for Reeves It's also bad news for Chancellor Rachel Reeves, who has made the push for economic growth her number one priority. Speaking to Sky News following the news, she described the figures as \"disappointing\".  Additional costs on businesses were also levied during the month, as higher minimum wages and employer national insurance contributions took effect, which businesses told the ONS played a part in their performance. Why? The biggest part of the economy, the services sector, contracted by 0.4%, and manufacturing dropped 0.9%. There was the largest ever monthly fall in goods exported to the United States, the ONS said. Decreases were seen across most types of goods due to tariffs, it added. Higher stamp duty depressed house buying and meant legal and real estate firms fared badly in the month. After a strong showing in the first three months, car manufacturing performed poorly."
    },
    {
        "title": "Trump's administration reviews AUKUS submarine deal with Britain and Australia ",
        "description": "The US has launched a formal review of the multi-billion pound AUKUS submarine deal with the UK and Australia. ",
        "url": "https://news.sky.com/story/trumps-administration-reviews-aukus-submarine-deal-with-britain-and-australia-13382472",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-aukus-submarine_6088425.jpg?20230314110945",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-12 08:02:00",
        "Headline": "Washington says the review is to ensure the defence pact, agreed by Joe Biden, aligns with Donald Trump's \"America First\" agenda.",
        "Content": "The US has launched a formal review of the multi-billion pound AUKUS submarine deal with the UK and Australia.  The defence pact, which is developing a new fleet of nuclear-powered hunter-killer submarines for the UK and Australia, was agreed under Joe Biden's administration in 2021. The alliance, which also covers collaboration on other advanced technologies, is seen as an attempt to counter the influence of China. But Elbridge Colby, the Pentagon's top policy advisor, is among vocal sceptics in Donald Trump's administration. \"We are reviewing AUKUS as part of ensuring that this initiative of the previous administration is aligned with the President's America First agenda,\" a US official said. \"Any changes to the administration's approach for AUKUS will be communicated through official channels, when appropriate.\" AUKUS envisages Australia acquiring up to five US Virginia-class nuclear-powered submarines from 2032 before the UK and Australia design and build a new class of submarine with US assistance. \n                  AUKUS: UK strikes deal with US and Australia to monitor deep space with high-powered radar\n                 \n                  UK hands £4bn contract to BAE Systems for 'powerful attack' submarines as part of AUKUS pact\n                 \n                  What is the AUKUS submarines pact between the UK, US and Australia - and why does China think it's 'highly irresponsible'?\n                 Australia's defence minister Richard Marles said on Thursday he was confident the pact would still go ahead and his government would work closely with the US while Mr Trump's administration conducts a review. \"This is a multi-decade plan. There will be governments that come and go and I think whenever we see a new government, a review of this kind is going to be something which will be undertaken,\" he told the Australian Broadcasting Corporation. It comes ahead of Mr Trump's first expected meeting with Australian prime minister Anthony Albanese on the sidelines of the G7 meeting in Canada. Security allies will discuss a request from Washington for Australia to increase defence spending from 2% to 3.5% of gross domestic product (GDP). Read more from Sky News:Why Trump's 'birthday' parade is controversialIsrael considering military action against Iran AUKUS is at the centre of the UK's planned expansion of its submarine fleet, with up to 12 attack submarines expected to be built for the Royal Navy. The deal is said to be worth more than £175bn. When it was signed, all three countries - the US, UK and Australia - had different leaders. In May, the US president's new ambassador, Warren Stephens, used his first public speech to back the partnership, highlighting how \"vital the US-UK relationship is to our countries and to the world\". A UK government spokesperson said: \"AUKUS is a landmark security and defence partnership with two of our closest allies. \"It is one of the most strategically important partnerships in decades, supporting peace and security in the Indo-Pacific and Euro-Atlantic, while also delivering jobs and economic growth in communities across all three nations.\""
    },
    {
        "title": "Sheku Bayoh Inquiry chairman accused of bias over 'secret' meetings with family",
        "description": "The Sheku Bayoh Inquiry chairman wrote to grieving relatives to say he was \"humbled and honoured\" to hear their experiences - sparking calls for him to step down over concerns of bias following five meetings described as \"secret\", the inquiry has heard.",
        "url": "https://news.sky.com/story/sheku-bayoh-inquiry-chairman-accused-of-bias-over-secret-meetings-with-family-13382701",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-sheku-bayoh-police_5766692.jpg?20250612145603",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-12 13:52:00",
        "Headline": "A two-day procedural hearing was ordered by chairman Lord Bracadale to consider an application for his own recusal, after he revealed he has met with Mr Bayoh's family on five occasions since the inquiry began.",
        "Content": "The Sheku Bayoh Inquiry chairman wrote to grieving relatives to say he was \"humbled and honoured\" to hear their experiences - sparking calls for him to step down over concerns of bias following five meetings described as \"secret\", the inquiry has heard. Father-of-two Sheku Bayoh, 31, died after he was restrained by around six police officers in Kirkcaldy, Fife, in 2015. The Crown Office decided not to take legal action against the officers involved following an investigation, but the circumstances are being examined at the inquiry. A two-day procedural hearing, beginning on Thursday, was ordered by chairman Lord Bracadale to consider an application for his own recusal, after he revealed he has met with Mr Bayoh's family on five occasions since the inquiry began. The application was made by the Scottish Police Federation, PC Craig Walker and former officer Nicole Short, represented by Roddy Dunlop KC, dean of the Faculty of Advocates. Recusal is the legal process by which a judge or other adjudicator steps aside from participating in a case due to potential bias, conflict of interest, or lack of impartiality. Mr Dunlop said Lord Bracadale had written he was \"humbled and honoured\" to hear the family's experiences, and that the chairman had identified two instances of \"inappropriate\" comments, including by the family's solicitor, Aamer Anwar. \n                  Gonorrhoea vaccine programme to launch after rise in diagnoses\n                 \n                  Peter Krykant: 'Beautiful, kind and courageous' drug policy campaigner found dead\n                 \n                  Chancellor Rachel Reeves pledges 'largest settlement since devolution' for Scotland\n                 The inquiry heard a relative made a comment that the arrest \"should never have happened\", according to Mr Dunlop, while in another meeting it was alleged the family \"are the victims\", which was rejected by Mr Dunlop who said there was a serious factual dispute at the centre of the inquiry. The meetings occurred on 4 November 2021; 13 April 2022; 21 November 2022; 18 January 2024; and 5 December 2024. Mr Dunlop said: \"There is an acute dispute into who is the villain in this piece.\" He said the family had portrayed Mr Bayoh as \"Scotland's George Floyd\", but added: \"This is a man who was intoxicated and armed with a knife. \"If I had approached Your Lordship and said, Nicole Short wants to tell you in private how devastating was the illegal assault perpetrated upon her by Mr Bayoh, which ended her career with the police, Your Lordship would have instantly dismissed me, and quite rightly, he would have been entitled to raise a complaint as to my conduct.\" Read more from Sky News:What we know so far about India to London plane crashKing and Queen 'shocked and saddened' by school shooting Dan Byrne KC, representing three officers involved in the inquiry, said they had told him: \"The chair has no idea who we are, we are just white officers.\" He told the inquiry \"repeated private, secret meetings with one party, behind the back of the others\", did not comply with a statutory requirement to act fairly. Mr Byrne said: \"The treatment they say is a parallel to George Floyd, by convicted murderer Derek Chauvin. That's clear from the campaign. \"The purpose of influence is the prosecution of the officers. The advocacy is explicit and implicit. The officers do not have a campaign group, they do not have access to the media or senior judges. \"In my submission the meetings were private, they were not transparent, there was no disclosure. The officers simply would not have had these chances. \"In the central dispute, the family have now had considerable advantage. The chair knows them personally; but no-one knows the officers, their families, their values, they have a great deal to lose.\" The Crown Office and Solicitor General Ruth Charteris KC do not support the calls for recusal. Mark Moir KC, representing the Coalition for Racial Equality and Rights, said it is \"a relatively common feature of a public inquiry\" for the chair to meet families involved, as he rejected calls for Lord Bracadale to step down. Acting for the family, Claire Mitchell KC said chairs of other inquiries, including the Victoria Climbie Inquiry, the Grenfell Tower Inquiry, the Stephen Lawrence Inquiry, and both COVID-19 inquiries, had met with families involved. She said: \"Chairs meet with family members on a regular basis and that is something which has been endorsed.\" Lord Bracadale said he will \"take time\" to consider the submissions and will \"return in due course\"."
    },
    {
        "title": "British crash survivor told family 'I don't know how I'm alive' seconds after plane came down",
        "description": "The British man who survived the Air India plane crash told his family \"I don't know how I'm alive\" in a phone call seconds after the plane came down, his brother has told Sky News.",
        "url": "https://news.sky.com/story/british-national-survives-plane-crash-indian-media-reports-13382718",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vishwash-kumar-ramesh_6940288.jpg?20250612154444",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 17:30:00",
        "Headline": "Vishwash Kumar Ramesh is believed to be the sole survivor of the Air India Flight 171 crash. His brother Nayan Kumar Ramesh told Sky News he video called their father moments after the crash to say: \"I don't know how I'm alive.\"",
        "Content": " The British man who survived the Air India plane crash told his family \"I don't know how I'm alive\" in a phone call seconds after the plane came down, his brother has told Sky News. Vishwash Kumar Ramesh is the only passenger reported to have survived after Air India Flight 171 crashed into a building shortly after take-off in Ahmedabad, Gujarat on Thursday afternoon. India plane crash - latest updates Relatives confirmed they had spoken to him since the crash - but they have not been able to contact his brother who was also believed to be on board. Speaking from Leicester, Mr Ramesh's brother Nayan told Sky News' Shamaan Freeman-Powell that their father was on the phone to Vishwash while the plane was still on the runway. \"My dad called him,\" the 27 year old said. \"And Vishwash said 'oh we're going to take off soon.\" Two minutes later, their father received a video call from Mr Ramesh to say the plane had crashed and he had survived. \"He video called my dad as he crashed and said 'Oh the plane's crashed. I don't know where my brother is. I don't see any other passengers. I don't know how I'm alive - how I exited the plane',\" Nayan said. Vidhi Chaudhary, a senior police officer in Ahmedabad, said Mr Ramesh was in seat 11A, next to an emergency exit, and \"managed to escape by jumping out the emergency door\". Mr Ramesh earlier told the Hindustan Times that he heard a \"loud noise\" around 30 seconds after take-off - and before the plane went down. \"It all happened so quickly,\" he told the newspaper, adding he had received \"impact injuries\" to his chest, eyes and feet. \"When I got up, there were bodies all around me. I was scared. I stood up and ran. There were pieces of the plane all around me. \"Someone grabbed hold of me and put me in an ambulance and brought me to the hospital.\" Sky News India correspondent Neville Lazarus spoke to Mr Ramesh in hospital and he said he was \"okay\". India reporter and producer Vishwash Kumar Ramesh was conscious, half sitting on his bed in blue hospital scrubs when I walked into the ward. He had bruises on his hands and face and was speaking to an attendant and some plain clothes police men. I introduced myself and asked how he was. He acknowledged with a nod and said he was ok. By then the police and the hospital administrators stopped me going any further and ushered me out of the ward. Dr Shariq told me he was the first to attend to Mr Ramesh when the ambulance brought him to the trauma centre. \"He was alright, had few cuts on his hands and face. There was nothing majorly wrong at all. He limped a bit. But he was mentally shaken up.\" Conscious and alert is how he described his condition.  A thorough check-up was done and he was shifted to the special ward. A miracle survivor is what everyone is calling him here. And that he is. Surviving a crash of that magnitude is nothing short of a miracle. Outside his ward and across is the mortuary where dozens of relatives and friends have gathered to identify their loved ones. Wails and cries break out every time an ambulance arrives. The process of identifying bodies is taking place with DNA matching from relatives. One hospital staff member told me \"some are charred beyond recognition and it's really bad.\"  'Miracle' he escaped Nayan Kumar Ramesh said he was supposed to be collecting his brother from Gatwick Airport on Thursday and the whole family planned to come together for a gathering this weekend. \"I've got no words to describe it,\" he said. \"It's a miracle that he survived - but what about the other miracle for my other brother.\" Asked how he and his relatives were feeling, he replied: \"Devastated. I'm scared to fly now - to even sit on a plane.\" Read moreWhat we know about the crash so farPlane wreckage rips apart medical hostel Footage shared widely on social media showed Mr Ramesh limping away from the crash site and being led towards emergency services. He told Indian media he has lived in London for 20 years. According to the Hindustan Times report, Mr Ramesh is 40 - but official flight documents list his age as 38. He told the newspaper his brother was sitting in a different row on the plane. \"We visited Diu. He was travelling with me and I can't find him anymore. Please help me find him.\" Three Britons dead Three Britons have been confirmed to have died in the crash - all members of the same family. Akeel Nanabawa, his wife Hannaa, and their four-year-old daughter Sara were among those who perished on the plane, Gloucester Muslim Community said on Facebook. The aircraft departed Ahmedabad for London Gatwick at 1.38pm local time on Thursday, carrying 242 passengers and crew members. They included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national, the airline said. According to tracking website Flightradar, a signal was last received from the plane less than a minute after it took off. It then crashed into a medical school's residential quarters in Meghaninagar, Ahmedabad, the largest city in Gujarat state. In a statement, London Gatwick said the flight was due to land at 6.25pm UK time on Thursday and a reception centre for relatives of those on board is being set up where information and support will be provided. The UK Foreign Office said it is \"working with local authorities in India to urgently establish the facts and provide support to those involved\". British nationals who require consular assistance are advised to call 020 7008 5000, while Air India has set up hotlines to provide information on +91 806 2779 200 for foreign nationals or 1800 5691 444 if calling from India.  Initially, an Ahmedabad city police commissioner claimed there appeared to be no survivors. The local police chief later said that at least 204 bodies had been recovered from the crash site, according to Reuters. Thursday's is the first crash of a Boeing 787 Dreamliner in its history, according to the Aviation Safety Network database. The model, a widebody, twin-engine plane, has made five million journeys in the 14 years since its first passenger flight. Meanwhile, India's prime minister Narendra Modi offered his condolences in a post on X. \"The tragedy in Ahmedabad has stunned and saddened us,\" he wrote. \"It is heartbreaking beyond words. In this sad hour, my thoughts are with everyone affected by it.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Air India crash survivor told me he's okay - his escape is nothing short of a miracle",
        "description": "Vishwash Kumar Ramesh was conscious, half sitting on his bed in blue hospital scrubs when I walked into the ward.",
        "url": "https://news.sky.com/story/the-air-india-crash-survivor-told-me-hes-okay-his-escape-is-nothing-short-of-a-miracle-13382822",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-plane-crash_6940392.jpg?20250612171830",
        "type": "UK",
        "Author": "Neville Lazarus",
        "Date Published": "2025-06-12 17:41:00",
        "Headline": "British man Vishwash Kumar Ramesh is believed to be the only survivor after an Air India flight carrying 242 people crashed soon after taking off from Ahmedabad airport. ",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  Vishwash Kumar Ramesh was conscious, half sitting on his bed in blue hospital scrubs when I walked into the ward. The Briton had bruises on his hands and face, and was speaking to an attendant and some plain-clothed policemen. I introduced myself to the man believed to be the only survivor of Thursday's Air India crash and asked how he was. He acknowledged me with a nod and said he was okay. India plane crash - latest updates  By then, the police and the hospital administrators stopped me from going any further and ushered me out of the ward. Dr Shariq told me he was the first to attend to Ramesh when the ambulance brought him to the trauma centre. \"He was alright, had few cuts on his hands and face,\" the medic said. \"There was nothing majorly wrong at all. He limped a bit. But he was mentally shaken up.\" He described Ramesh's condition as conscious and alert. A thorough check-up was done and he was moved to the special ward. A miracle survivor is what everyone is calling him here. And that he is. Surviving a crash of that magnitude is nothing short of a miracle.  A short distance from his ward is the mortuary, where dozens of relatives and friends have gathered to identify their loved ones. Wails and cries break out every time an ambulance arrives. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:What we know so farCCTV shows take-off and crash Authorities are using DNA from living relatives to identify bodies. One hospital staff member told me: \"Some are charred beyond recognition and it's really bad.\""
    },
    {
        "title": "What we know so far after Air India flight to London Gatwick crashes",
        "description": "An Air India flight which was en route to London Gatwick has crashed in India.",
        "url": "https://news.sky.com/story/what-we-know-so-far-after-air-india-flight-to-london-gatwick-crashes-13382509",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-ahmedabad-air-india_6940126.jpg?20250612125351",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 09:05:00",
        "Headline": "At least 242 people were on board the flight bound for London when it crashed in India's Ahmedabad.",
        "Content": " An Air India flight which was en route to London Gatwick has crashed in India. At least 242 people were on board the flight when it crashed shortly after take-off in the northwestern Indian city of Ahmedabad. Local police initially said there appeared to be no survivors. The Reuters news agency reports that at least 204 bodies have been recovered from the crash site. India plane crash latest: Follow live updates But Sky News has confirmed that Vishwash Kumar Ramesh, a British national, survived the plane crash in Ahmedabad. Here is all we know so far. Where did the plane crash? Air India Flight 171 took off from Ahmedabad Airport at 1.38pm local time on Thursday. According to flight-tracking website Flightradar, the aircraft reached a height of 625ft before crashing. The last signal from the plane was received less than a minute after take-off. The aircraft crashed into a residential area of the city called Meghaninagar, Faiz Ahmed Kidwai, the director general of the directorate of civil aviation, told the Associated Press. It came down just outside the airport, hitting the residential quarters of BJ Medical College where students were staying.  City police chief G.S. Malik said 204 bodies have been recovered from the crash site, according to the Reuters news agency. They said the figure could include passengers and those who died on the ground from impact.  At least 30 bodies were recovered from a building at the site of the crash, Reuters reported, citing rescue workers at the site. More people were trapped inside the building, the workers said. The tail of the plane has been pictured protruding from the structure, while the wings were ripped completely from the main body of the aircraft. Images from the scene showed people being carried in stretchers and taken away in ambulances. Who was on board? Air India said the 242 passengers and crew included 53 British nationals, 169 Indian nationals, seven Portuguese nationals, and one Canadian. Three Britons are confirmed to have died - all members of the same family. In a Facebook statement, Gloucester Muslim Community said Akeel Nanabawa, his wife Hannaa and their four-year-old daughter Sara died in the crash. British national Vishwash Kumar Ramesh is believed to be the only survivor. His brother, Nayan, told Sky News their father was on the phone to him while the plane was still on the runway - before he video called again two minutes later to say the plane had crashed and: \"I don't know how I'm alive.\" Their other brother was also reported to have been on the plane - but the family has not heard from him since. Speaking to the Hindustan Times newspaper earlier on Thursday, Mr Ramesh said he heard a \"loud noise\" around 30 seconds after take-off before the plane went down. \"It all happened so quickly,\" he said, adding he had received \"impact injuries\" on his chest, eyes and feet. Mr Ramesh told the newspaper he had lived in London for 20 years and that his brother was seated in a different row on the plane. Air India said it had \"set up a dedicated passenger hotline number 1800 5691 444 to provide more information\". A separate passenger hotline for foreign nationals has also been set up by the airline on +91 8062779200. The flight had been due to land at London Gatwick at 6.25pm UK time.  What caused the crash? It is unknown at this stage what caused the crash. The aircraft was a Boeing 787-8 Dreamliner. The American aircraft manufacturer which makes the plane, said it is in contact with Air India and \"stands ready to support them\". Aviation expert Julian Bray told Sky News that he understands the pilot of Flight 171 managed to make a mayday call before the crash. This would mean the crew was aware of a problem before the incident happened. A mayday call is an internationally recognised distress signal used in radio communication. It indicates an imminent danger and the need for immediate assistance. Sky News' science correspondent Thomas Moore said investigators will now be studying the video and the two black boxes recording cockpit conversations and technical data to try to understand why the crash occurred. \"It's possible there was an engine failure of some kind, perhaps caused by a catastrophic mechanical fault. But the plane is designed to be able to fly with one engine, even at take-off, so something else would have to go wrong too,\" he said \"Both engines could have failed if they sucked in a flock of birds as the plane took off. It's happened in other air crashes.\"  How has the UK responded? Sir Keir Starmer said the scenes emerging from the site of the crash in Ahmedabad are \"devastating\". The prime minister said he was being kept updated as the situation develops. Buckingham Palace said King Charles is also being briefed on the crash. In a statement, the King said: \"My wife and I have been desperately shocked by the terrible events in Ahmedabad this morning. \"Our special prayers and deepest possible sympathy are with the families and friends of all those affected by this appallingly tragic incident across so many nations, as they await news of their loved ones.\" The UK's Foreign Office said it is currently \"working with local authorities in India to urgently establish the facts and provide support to those involved\". Britons who have concerns should call 0207 008 5000, it said. Sky News understands that Foreign Secretary David Lammy has also chaired a COBRA meeting in response to the crash. The UK Air Accidents Investigation Branch has also deployed four investigators to help the Aircraft Accident Investigation Bureau in India with its investigation into the crash. What has India said? Indian Prime Minister Narendra Modi said the plane crash was \"heartbreaking beyond words\". \"The tragedy in Ahmedabad has stunned and saddened us,\" he said. \"In this sad hour, my thoughts are with everyone affected by it.\" The country's civil aviation minister said he is \"shocked and devastated\". While the boss of Air India, Natarajan Chandrasekaran, said: \"Our thoughts and deepest condolences are with the families and loved ones of all those affected by this devastating event.\" Tata Group, the parent company of Air India, said it would provide 10 million rupees (around £86,000) to the families of those who were killed in the crash. Business and economics reporter Air India, the country's flagship carrier, is a private company, majority owned by the Indian conglomerate Tata Group and minority owned by Singapore Airlines. Since October, Air India Group has been 25.1% owned by Singapore Airlines, with the remaining owned privately by Tata. At that time, four Tata-owned airlines merged with another airline, Vistara. The airline operates more than 5,600 weekly flights and connects more than 90 domestic and international destinations with a fleet of 208 aircraft. It flies more than 120,000 passengers every day and offers connectivity to over 800 destinations through more than 75 partners. It was founded in 1932 and was owned by the Indian government from 1953 to 2022.\n Because Air India is private, it doesn't publish the kinds of financial and operational information that public airlines, like Ryanair or Air France-KLM, do.\n It also means we can't easily track its share price value, which is not publicly traded or visible. Similarly, the part of Tata that owns Air India isn't publicly listed, so we don't have a stock price representation of how investors are digesting this information. Previous plane crashes in India Air India, which started operations in 1932, and its subsidiary Air India Express have suffered several fatal crashes. According to Aviation Safety Network (ASN) the most recent fatal crash was in August 2020, when Boeing 737-800 (Air India Express) overshot the runway in Karipur, India, rolled down an embankment and broke up, killing 21 people. Non-fatal incidents have happened as recently as this year. In January, an Airbus A320-251N suffered an engine shutdown after departing Bangalore and landed safely at the same location, according to The Times of India. Boeing shares fell nearly 8% in premarket US trading on Thursday, after the crash in Ahmedabad."
    },
    {
        "title": "New CCTV footage shows Air India plane's take-off and crash",
        "description": "New CCTV footage has emerged showing an Air India flight bound for London Gatwick crashing and bursting into flames just moments after take-off. \n",
        "url": "https://news.sky.com/story/moments-before-air-india-plane-crash-13382583",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-crash-india_6940366.jpg?20250612165510",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 10:18:00",
        "Headline": "Taken from a building near the runway, harrowing footage shows the aircraft crashing in a residential area just seconds after taking off. ",
        "Content": " New CCTV footage has emerged showing an Air India flight bound for London Gatwick crashing and bursting into flames just moments after take-off. \n More than 200 people - including 53 British nationals - were on board Flight AI171 to London Gatwick. It was earlier reported that all on board had died, but Sky News has since confirmed that a British man survived. The video shows the aircraft taking off from Ahmedabad Airport in the northwestern Indian state of Gujarat. But just seconds after the plane is airborne, it can be see struggling to gain altitude and instead begins descending towards buildings, with its wheels still out and its nose raised. A huge explosion can be seen followed by thick black plumes of smoke rising into the skies. India plane crash latest: Follow live updates Footage that emerged earlier today, taken from what appears to be a property, showed the aircraft descending over a residential area. It crashed in an area called Meghaninagar at 1.38pm local time on Thursday, according to Faiz Ahmed Kidwai, the director general of the Directorate of Civil Aviation.  Flight tracking website Flightradar said a signal was last received from the aircraft less than a minute after take-off. Read more:What we know so farIs there a wider problem with Dreamliner? It is the first ever crash of a Boeing 787-8 Dreamliner, according to the Aviation Safety Network database.  Air India said 242 people were on the flight. Passengers included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national. India's CNN News18 TV channel reported there were 12 crew on board. In a statement, London Gatwick said the flight was due to land at 6.25pm local time on Thursday. India's civil aviation minister Ram Mohan Naidu Kinjarapu said: \"Rescue teams have been mobilised, and all efforts are being made to ensure medical aid and relief support are being rushed to the site.\""
    },
    {
        "title": "Air India confirms 241 dead after plane crash - with one Briton surviving",
        "description": "Air India has confirmed that 241 people on board a flight to London Gatwick have died after the aircraft crashed shortly after take-off &#8211; with just one person surviving. ",
        "url": "https://news.sky.com/story/india-to-london-plane-crashes-with-at-least-242-people-on-board-13382483",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-plane-crash_6940707.jpg?20250613012720",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 08:34:00",
        "Headline": "The flight from Ahmedabad to Gatwick, which was carrying 53 Britons, crashed shortly after take-off.",
        "Content": " Air India has confirmed that 241 people on board a flight to London Gatwick have died after the aircraft crashed shortly after take-off – with just one person surviving.  The Boeing 787-8 Dreamliner, which was carrying 53 Britons, crashed into a doctors' hostel in a residential area moments after taking off from Ahmedabad airport, in western India. India plane crash latest: Follow live updates Air India has said 229 passengers and 12 crew died. Authorities have not confirmed how many people on the ground were killed or injured. The airline said it \"offers its deepest condolences to the families of the deceased\". \"Our efforts now are focused entirely on the needs of all those affected, their families and loved ones,\" the statement continued. The sole survivor is British man Vishwash Kumar Ramesh, who was travelling on the flight with his brother. He told the Hindustan Times newspaper he heard a \"loud noise\" around 30 seconds after take-off before the Boeing 787-8 Dreamliner went down. \"It all happened so quickly,\" he said, adding that he suffered \"impact injuries\" to his chest, eyes and feet. \"When I got up, there were bodies all around me. I was scared. I stood up and ran.\"  The passengers included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national. In a statement posted on Facebook, Gloucester Muslim Community said Akeel Nanabawa, his wife Hannaa and their four-year-old daughter Sara had died in the crash. They said: \"No words can truly ease the pain of such a profound loss, but we pray that the family may find solace in the tremendous outpouring of compassion and solidarity from communities across the world.\" Also on the flight were married couple Fiongal and Jamie Greenlaw-Meek from west London. They had posted a video from the airport on their Instagram feed shortly before boarding. Videos show the aircraft, which departed from Ahmedabad to London Gatwick at 1.38pm local time, struggling to gain altitude in the seconds after taking off. It then begins to descend and a fireball can be seen as the plane crashes, with massive plumes of thick black smoke rising into the sky. Other images show the aircraft's tail after it crashed into the roof of the BJ Medical College Hostel in the Meghaninagar area.  Tata Sons, which owns the airline, said it will give around £86,000 to the families of each person who died, cover the medical expenses of those injured, and provide support to rebuild the medical hostel. Ahmedabad airport said the plane crashed \"shortly after take-off, outside the airport\". Flights were suspended until shortly after 4pm local time. In a statement, London Gatwick said the flight was due to land at 6.25pm UK time on Thursday and a reception centre for relatives of those on board was set up where information and support will be provided. Flight tracking website Flightradar said a signal was last received from the aircraft less than a minute after take-off. It is the first ever crash of a Boeing 787 Dreamliner, according to the Aviation Safety Network database. The model, a widebody, twin-engine plane, has made five million journeys in the 14 years since its first passenger flight.  Read more: What we know so farInvestigators will want to know if crash part of wider problemCCTV shows take-off and fireball explosionAviation experts review crash videoSir Keir Starmer said the scenes emerging were \"devastating\". He added: \"Our hearts and our thoughts are absolutely with the friends and families of all of those affected.\" The prime minister said the British government is in \"constant contact\" with the Indian authorities and has dispatched an investigation team of its own. The King said he and the Queen were \"desperately shocked by the terrible events\" in a post on X. \"Our special prayers and deepest possible sympathy are with the families and friends of all those affected by this appallingly tragic incident across so many nations, as they await news of their loved ones,\" he said.  The foreign office said the UK is \"working with local authorities in India to urgently establish the facts and provide support to those involved\". British nationals who require consular assistance are advised to call 020 7008 5000, while Air India has set up hotlines to provide information on 1800 5691 444 for those calling within India and +91 806 2779 200 for foreign nationals. India's prime minister Narendra Modi said in a post on X: \"The tragedy in Ahmedabad has stunned and saddened us. \"It is heartbreaking beyond words. In this sad hour, my thoughts are with everyone affected by it.\" It's the worst aviation tragedy the country has seen in decades, writes Sky News India correspondent Neville Lazarus.  The images of the aircraft plunging to the ground into a fireball and the horizon filled with black smoke will haunt the nation for a very long time. Some 242 passengers, including children and 12 crew members, were on the ill-fated flight. The aircraft, which lost altitude soon after take-off, crashed into residential quarters of BJ Medical College doctors in Ahmedabad's Meghaninagar area.  Images of parts of the plane can be seen hanging precariously on the building of the hostel, having caused severe damage. A large number of residents are feared dead in the speciality doctors' buildings, which have 94 flats and about 200 people living in them. The nation is in shock as bodies, some beyond recognition, are being brought into hospitals across the city. There are many injured and some in critical condition. India's civil aviation minister Ram Mohan Naidu Kinjarapu said he was \"shocked and devastated\" to learn about the crash. \"We are on highest alert,\" he said. \"I am personally monitoring the situation and have directed all aviation and emergency response agencies to take swift and coordinated action. \"Rescue teams have been mobilised, and all efforts are being made to ensure medical aid and relief support are being rushed to the site.\" Aviation expert Julian Bray told Sky News he understands the pilot managed to make a mayday call, meaning the crew was aware of a problem before the crash. Air India was acquired by Tata Group from the Indian government in January 2022 after racking up billions of pounds of losses. The group now operates more than 8,300 weekly flights on 312 routes, connecting more than 100 domestic and international destinations with a fleet of 300 aircraft. The airline's chairman Natarajan Chandrasekaran described the incident as a \"tragic accident\" and a \"devastating event\" and said emergency response teams were at the site. \"At this moment, our primary focus is on supporting all the affected people and their families,\" he said. \"We are doing everything in our power to assist the emergency response teams at the site and to provide all necessary support and care to those impacted.\" A Boeing spokesperson said: \"We are in contact with Air India regarding Flight 171 and stand ready to support them. Our thoughts are with the passengers, crew, first responders and all affected.\""
    },
    {
        "title": "Two women dead after 'incident' in Eryri (Snowdonia) National Park",
        "description": "Two women have died after an incident in Wales's largest national park, police have confirmed.",
        "url": "https://news.sky.com/story/two-women-dead-after-incident-in-eryri-snowdonia-national-park-13382787",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wales-eryri_6940384.jpg?20250612171540",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 16:15:00",
        "Headline": "North Wales Police said its \"thoughts and sympathies\" are with the women's families and appealed for information from anyone who may have been walking in the area.",
        "Content": "Two women have died after an incident in Wales's largest national park, police have confirmed. North Wales Police said the women died in Nant Gwynant, in Eryri National Park, also known as Snowdonia, on Wednesday night. Officers were called to the scene at 9.31pm after they received a report a female had been pulled from the water. Another female was reported to be in the water at the pools on the Watkin Path, police said. She was pulled from the water, but despite the best efforts of everyone involved, they were both pronounced dead at the scene. As well as North Wales Police, the Llanberis Mountain Rescue Team, air ambulance and Coastguard helicopter also attended. Detective Chief Inspector Andy Gibson of North Wales Police said the force's \"thoughts and sympathies\" were with the families of both women. \n                  Road finally opens after 23 years of roadworks\n                 \n                  More deaths possible at beach where teen drowned, coroner says\n                 \n                  Wales's first minister hails spending review as 'big win' - but opposition call it an 'insult'\n                 An investigation into their deaths has begun and officers are appealing for anyone who may have been walking in the Watkin Path area between 6pm and 9pm on Wednesday night to get in touch. \"They are urged to contact us,\" he added. The coroner has been informed. The Watkin Path is one of the six main routes to the summit of Snowdon, also known as Yr Wyddfa."
    },
    {
        "title": "Thousands of Poundland jobs at risk as shops to close after company sold",
        "description": "Thousands of jobs are at risk after discount high street chain Poundland was sold - with dozens of shops expected to shut. ",
        "url": "https://news.sky.com/story/thousands-of-poundland-jobs-at-risk-as-shops-to-close-after-company-sold-13382479",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-poundland-pound_6802760.jpg?20250118095137",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 08:19:00",
        "Headline": "The company has been sold for a headline figure of €1 - but has to repay tens of millions of pounds to the seller Pepco Group. ",
        "Content": "Thousands of jobs are at risk after discount high street chain Poundland was sold - with dozens of shops expected to shut.  Poundland has been sold for a headline figure of €1 to investment firm and former Laura Ashley owners Gordon Brothers, confirming Sky News reporting. Its previous owners, the Poland-based Pepco Group, however, are to be repaid tens of millions of pounds as part of the sale. Poundland employs roughly 16,000 people across an estate of over 800 shops in the UK and Ireland. Read more:UK economy contracts - with record fall in exports to the US after Trump tariff hikesSpending review's key points at a glance Around 100 stores are expected to close, and rent reviews are also expected to be negotiated with Poundland landlords. The chain, known for selling products for £1, was put on the market earlier this year after a downturn in trading. Employers' tax hikes announced by Chancellor Rachel Reeves in the November budget increased the financial pressure on high street retailers. \n                  Burberry to cut 1,700 jobs after multi-million pound loss\n                 \n                  Luxury store Harrods is latest retail victim of cyber attackers\n                 \n                  Hundreds of jobs at risk as The Original Factory Shop launches survival plan\n                 As part of the deal, a restructuring plan requiring High Court approval will take place. Details of that restructuring will be communicated in \"due course\", owners Pepco said. It will retain a minority stake in Poundland. Pepco said the deal would help it shift away from food and drinks, improve its revenue growth and boost its profitability Stephan Borchert, Pepco Group's chief executive, said: \"This transaction will strongly support our accelerated value creation programme by simplifying the group and focusing on our successful Pepco business. \"Poundland remains a key player in UK discount retail, with millions of customers annually and a well-loved brand and proposition.\""
    },
    {
        "title": "Trump tariffs a big factor - but latest UK economic performance makes for unpleasant reading",
        "description": "Economists suspected that the comfortable growth enjoyed at the beginning of the year might prove to be short-lived, and they appear to be right.",
        "url": "https://news.sky.com/story/trump-tariffs-a-big-factor-but-latest-uk-economy-performance-makes-for-unpleasant-reading-13382463",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-downing-street_6939449.jpg?20250611152956",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-06-12 07:32:00",
        "Headline": "Now temporary growth has faded away, the better gauge of the economy makes for unpleasant reading. The UK is being hobbled by low growth and high taxes, with the two reinforcing each other.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Economists suspected that the comfortable growth enjoyed at the beginning of the year might prove to be short-lived, and they appear to be right. After expanding by 0.7% in the first quarter of the year, output struggled at the start of the second quarter, shrinking by 0.3% in April. The damp performance is likely to continue, with economists expecting a 0.1% decline over the second quarter. The dashboard is flashing warning signs. The economic data for the start of the year was flattered by people bringing forward house purchases to beat the stamp duty holiday deadline as well as businesses racing to get orders out of the door to beat possible US tariffs. Now that those temporary factors have faded away, we can better gauge the state of the economy. It makes for unpleasant reading. A hobbled economy \n                  Rachel Reeves 'a gnat's whisker' from having to raise taxes, says IFS\n                 \n                  Economy shock overshadows Reeves' big day\n                 \n                  Spending review: Treasury minister Emma Reynolds tells Sky News she is 'not ruling out' tax rises in the autumn\n                 We are still being hobbled by low growth and high taxes, and the two are reinforcing each other. In a more detailed breakdown, the ONS revealed that the services sector shrank by 0.4%. Although economists were expecting consumer spending to hold up, businesses are gripped by a crisis of confidence, with higher national insurance contributions forcing them to put up prices. This led to a drop in sales. At the same time, the legal sector also came crashing down to earth following a drop in house purchases.  Consumers have less space than usual to absorb price rises, with utility bills on the up and general inflation proving persistent. Taxes are already at a generational high, and they could go higher if the economy disappoints. The Chancellor Rachel Reeves's headroom against her fiscal rule is tight, with debt interest payments on the country's debt eating into her room for manoeuvre. A Reeves or a Trump problem? The chancellor today pointed to factors outside of her control, hinting towards President Trump's tariff policy. Most of Britain's problems are domestic ones - high government borrowing costs, rising cost of living pressures and higher taxation, but geopolitical forces have also conspired against us. The production sector, which captures manufacturing, fell by 0.6%. This was driven by a 9.5% drop in the manufacturing of cars, with industry groups warning of a slump in export orders after Trump's imposition of industry-wide tariffs at the end of March. British officials are hopeful that the US will start lifting car tariffs this week after a deal was struck back in May, but it still hangs in the balance. Even then, a new quota limits the scope for companies to grow in the US market. That's bad news for the likes of JLR, the maker of Jaguars and Land Rovers. All this matters for a chancellor with a historically small fiscal headroom. Even small changes in the growth outlook could derail her plans, forcing further tax rises to pay for her spending plans. She is betting big on investment in infrastructure- trains, nuclear power, social housing - but it could take many years for that to pay dividends, if it pays dividends at all. In the meantime, the debt continues to grow as she borrows to fund those projects, putting further pressure on her budget to cover the interest payments alone. It's a painful feedback loop for the economy."
    },
    {
        "title": "Gonorrhoea vaccine programme to launch after rise in diagnoses",
        "description": "A new vaccine programme will be launched in Scotland to help curb cases of gonorrhoea following a rise in diagnoses post-pandemic.",
        "url": "https://news.sky.com/story/gonorrhoea-vaccine-programme-to-launch-after-rise-in-diagnoses-13382740",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vaccine-needle-jab_6940340.jpg?20250612162305",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-12 15:03:00",
        "Headline": "The sexually transmitted infection (STI) is Scotland's second most common bacterial STI, with the latest figures showing 5,999 cases in 2023 - a 59% increase since before the pandemic.",
        "Content": "A new vaccine programme will be launched in Scotland to help curb cases of gonorrhoea following a rise in diagnoses post-pandemic. The sexually transmitted infection (STI) is the nation's second most common bacterial STI, with the latest figures showing 5,999 cases in 2023 - a 59% increase since before COVID hit. It is hoped the £280,000 programme - which will begin in August and is being funded by the Scottish government - will address increasing health inequalities and growing resistance to antibiotics treatment. Those eligible include gay and bisexual men at highest risk of infection, those involved in selling or exchanging sex regardless of gender, and those who sexual health clinic professionals assess as being at a similar risk level. Gonorrhoea can cause significant pain and discomfort, and in rare cases life-threatening sepsis. Public Health Minister Jenni Minto said: \"This action is urgent and timely since the number of diagnoses has been high and the disease is becoming increasingly difficult to treat with antibiotics. \"The science tells us that this vaccine will potentially protect thousands of people and prevent the spread of infection. \n                  One million blood donors needed to meet demand and avoid 'red alert' shortage, NHS warns\n                 \n                  The NHS winter crisis is a recurring seasonal theme – tackling it will bring challenges\n                 \n                  Labour vows to tackle 'corridor care' and long waits with almost £450m NHS investment in England\n                 \"Anything which stops people from contracting gonorrhoea in the first place can have huge benefits, including ensuring our health system remains resilient by reducing the amount of treatment needed.\" Read more from Sky News:One million blood donors needed to avoid 'red alert' shortageWeight loss jab warning from health watchdog over unborn babies The medication will be delivered by the Scottish Vaccination and Immunisation Programme led by Public Health Scotland (PHS). The funding is expected to cover first and second doses of the 4CMenB vaccine. The Scottish government said the vaccine was 30-40% effective and will be offered in clinics alongside those for HPV, hepatitis and the routine mpox vaccination programme. Dr Sam Ghebrehewet, head of the vaccination and immunisation division at PHS, said: \"With gonorrhoea diagnoses having increased in recent years, the offer of the 4CMenB vaccine to those at highest risk of exposure is a welcome new intervention. \"This vaccination programme is expected to help control and prevent the spread of gonorrhoea. \"Public Health Scotland is working with the Scottish government and colleagues across NHS boards to finalise plans for the rollout of this targeted vaccination offering to those at increased risk of gonorrhoea from August 2025.\""
    },
    {
        "title": "Road finally opens after 23 years of roadworks",
        "description": "A South Wales road has officially been opened, 23 years after roadworks first began.",
        "url": "https://news.sky.com/story/road-opens-after-23-years-of-roadworks-13382631",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wales-a465_6792727.jpg?20250106113748",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-12 11:11:00",
        "Headline": "Wales's transport secretary Ken Skates admitted the project had \"not been without its challenges\" and thanked local residents for their patience.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n A South Wales road has officially been opened, 23 years after roadworks first began. The A465 Heads of the Valleys Road has been described by the Welsh government as one of the UK's \"most technically challenging\" road projects, in an upgrade programme costing £2bn. The final phase of the dual carriageway to be completed was sections 5 and 6, from Dowlais to Hirwaun. The Welsh government says the final phase of the project has created 2,200 new jobs across the country. Transport secretary Ken Skates said that delivering \"better transport\" was a \"priority\". He said the project was \"complex\" and admitted that it had \"not been without its challenges\". Skates also acknowledged a project on this scale was \"inevitably going to have an impact on local residents\" and thanked them for their patience. \n                  Two women dead after 'incident' in Eryri (Snowdonia) National Park\n                 \n                  More deaths possible at beach where teen drowned, coroner says\n                 \n                  Wales's first minister hails spending review as 'big win' - but opposition call it an 'insult'\n                 When it was confirmed in January that the Heads of the Valleys Road would be completed this year, Damien Pearce, owner of Valley Carpets in Pant Industrial Estate, told Sky News road closures had \"impacted [the business] massively\". But he said the shop was now \"more visible\" and that the completed road would \"definitely\" benefit the local area. Read more from Sky News:What we know so far about passenger plane crashMoments before Air India plane crash Sam Rowlands, the Welsh government's shadow transport secretary, said there would be \"a huge measure of relief\" for \"long-suffering residents and businesses\". \"The project has taken far too long, cost far too much, and it's clear that important lessons need to be learned,\" he added. But finance secretary and former first minister Mark Drakeford said investing in the project had \"created real benefits for local people\", including £400m for the local supply chain."
    },
    {
        "title": "Air India confirms 241 dead after plane crash - with one Briton surviving",
        "description": "Air India has confirmed that 241 people on board a flight to London Gatwick have died after the aircraft crashed shortly after take-off &#8211; with just one person surviving. ",
        "url": "https://news.sky.com/story/india-to-london-plane-crashes-with-at-least-242-people-on-board-13382483",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-plane-crash_6940707.jpg?20250613012720",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 08:34:00",
        "Headline": "The flight from Ahmedabad to Gatwick, which was carrying 53 Britons, crashed shortly after take-off.",
        "Content": " Air India has confirmed that 241 people on board a flight to London Gatwick have died after the aircraft crashed shortly after take-off – with just one person surviving.  The Boeing 787-8 Dreamliner, which was carrying 53 Britons, crashed into a doctors' hostel in a residential area moments after taking off from Ahmedabad airport, in western India. India plane crash latest: Follow live updates Air India has said 229 passengers and 12 crew died. Authorities have not confirmed how many people on the ground were killed or injured. The airline said it \"offers its deepest condolences to the families of the deceased\". \"Our efforts now are focused entirely on the needs of all those affected, their families and loved ones,\" the statement continued. The sole survivor is British man Vishwash Kumar Ramesh, who was travelling on the flight with his brother. He told the Hindustan Times newspaper he heard a \"loud noise\" around 30 seconds after take-off before the Boeing 787-8 Dreamliner went down. \"It all happened so quickly,\" he said, adding that he suffered \"impact injuries\" to his chest, eyes and feet. \"When I got up, there were bodies all around me. I was scared. I stood up and ran.\"  The passengers included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national. In a statement posted on Facebook, Gloucester Muslim Community said Akeel Nanabawa, his wife Hannaa and their four-year-old daughter Sara had died in the crash. They said: \"No words can truly ease the pain of such a profound loss, but we pray that the family may find solace in the tremendous outpouring of compassion and solidarity from communities across the world.\" Also on the flight were married couple Fiongal and Jamie Greenlaw-Meek from west London. They had posted a video from the airport on their Instagram feed shortly before boarding. Videos show the aircraft, which departed from Ahmedabad to London Gatwick at 1.38pm local time, struggling to gain altitude in the seconds after taking off. It then begins to descend and a fireball can be seen as the plane crashes, with massive plumes of thick black smoke rising into the sky. Other images show the aircraft's tail after it crashed into the roof of the BJ Medical College Hostel in the Meghaninagar area.  Tata Sons, which owns the airline, said it will give around £86,000 to the families of each person who died, cover the medical expenses of those injured, and provide support to rebuild the medical hostel. Ahmedabad airport said the plane crashed \"shortly after take-off, outside the airport\". Flights were suspended until shortly after 4pm local time. In a statement, London Gatwick said the flight was due to land at 6.25pm UK time on Thursday and a reception centre for relatives of those on board was set up where information and support will be provided. Flight tracking website Flightradar said a signal was last received from the aircraft less than a minute after take-off. It is the first ever crash of a Boeing 787 Dreamliner, according to the Aviation Safety Network database. The model, a widebody, twin-engine plane, has made five million journeys in the 14 years since its first passenger flight.  Read more: What we know so farInvestigators will want to know if crash part of wider problemCCTV shows take-off and fireball explosionAviation experts review crash videoSir Keir Starmer said the scenes emerging were \"devastating\". He added: \"Our hearts and our thoughts are absolutely with the friends and families of all of those affected.\" The prime minister said the British government is in \"constant contact\" with the Indian authorities and has dispatched an investigation team of its own. The King said he and the Queen were \"desperately shocked by the terrible events\" in a post on X. \"Our special prayers and deepest possible sympathy are with the families and friends of all those affected by this appallingly tragic incident across so many nations, as they await news of their loved ones,\" he said.  The foreign office said the UK is \"working with local authorities in India to urgently establish the facts and provide support to those involved\". British nationals who require consular assistance are advised to call 020 7008 5000, while Air India has set up hotlines to provide information on 1800 5691 444 for those calling within India and +91 806 2779 200 for foreign nationals. India's prime minister Narendra Modi said in a post on X: \"The tragedy in Ahmedabad has stunned and saddened us. \"It is heartbreaking beyond words. In this sad hour, my thoughts are with everyone affected by it.\" It's the worst aviation tragedy the country has seen in decades, writes Sky News India correspondent Neville Lazarus.  The images of the aircraft plunging to the ground into a fireball and the horizon filled with black smoke will haunt the nation for a very long time. Some 242 passengers, including children and 12 crew members, were on the ill-fated flight. The aircraft, which lost altitude soon after take-off, crashed into residential quarters of BJ Medical College doctors in Ahmedabad's Meghaninagar area.  Images of parts of the plane can be seen hanging precariously on the building of the hostel, having caused severe damage. A large number of residents are feared dead in the speciality doctors' buildings, which have 94 flats and about 200 people living in them. The nation is in shock as bodies, some beyond recognition, are being brought into hospitals across the city. There are many injured and some in critical condition. India's civil aviation minister Ram Mohan Naidu Kinjarapu said he was \"shocked and devastated\" to learn about the crash. \"We are on highest alert,\" he said. \"I am personally monitoring the situation and have directed all aviation and emergency response agencies to take swift and coordinated action. \"Rescue teams have been mobilised, and all efforts are being made to ensure medical aid and relief support are being rushed to the site.\" Aviation expert Julian Bray told Sky News he understands the pilot managed to make a mayday call, meaning the crew was aware of a problem before the crash. Air India was acquired by Tata Group from the Indian government in January 2022 after racking up billions of pounds of losses. The group now operates more than 8,300 weekly flights on 312 routes, connecting more than 100 domestic and international destinations with a fleet of 300 aircraft. The airline's chairman Natarajan Chandrasekaran described the incident as a \"tragic accident\" and a \"devastating event\" and said emergency response teams were at the site. \"At this moment, our primary focus is on supporting all the affected people and their families,\" he said. \"We are doing everything in our power to assist the emergency response teams at the site and to provide all necessary support and care to those impacted.\" A Boeing spokesperson said: \"We are in contact with Air India regarding Flight 171 and stand ready to support them. Our thoughts are with the passengers, crew, first responders and all affected.\""
    },
    {
        "title": "What we know so far after Air India flight to London Gatwick crashes",
        "description": "An Air India flight which was en route to London Gatwick has crashed in India.",
        "url": "https://news.sky.com/story/what-we-know-so-far-after-air-india-flight-to-london-gatwick-crashes-13382509",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-ahmedabad-air-india_6940126.jpg?20250612125351",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 09:05:00",
        "Headline": "At least 242 people were on board the flight bound for London when it crashed in India's Ahmedabad.",
        "Content": " An Air India flight which was en route to London Gatwick has crashed in India. At least 242 people were on board the flight when it crashed shortly after take-off in the northwestern Indian city of Ahmedabad. Local police initially said there appeared to be no survivors. The Reuters news agency reports that at least 204 bodies have been recovered from the crash site. India plane crash latest: Follow live updates But Sky News has confirmed that Vishwash Kumar Ramesh, a British national, survived the plane crash in Ahmedabad. Here is all we know so far. Where did the plane crash? Air India Flight 171 took off from Ahmedabad Airport at 1.38pm local time on Thursday. According to flight-tracking website Flightradar, the aircraft reached a height of 625ft before crashing. The last signal from the plane was received less than a minute after take-off. The aircraft crashed into a residential area of the city called Meghaninagar, Faiz Ahmed Kidwai, the director general of the directorate of civil aviation, told the Associated Press. It came down just outside the airport, hitting the residential quarters of BJ Medical College where students were staying.  City police chief G.S. Malik said 204 bodies have been recovered from the crash site, according to the Reuters news agency. They said the figure could include passengers and those who died on the ground from impact.  At least 30 bodies were recovered from a building at the site of the crash, Reuters reported, citing rescue workers at the site. More people were trapped inside the building, the workers said. The tail of the plane has been pictured protruding from the structure, while the wings were ripped completely from the main body of the aircraft. Images from the scene showed people being carried in stretchers and taken away in ambulances. Who was on board? Air India said the 242 passengers and crew included 53 British nationals, 169 Indian nationals, seven Portuguese nationals, and one Canadian. Three Britons are confirmed to have died - all members of the same family. In a Facebook statement, Gloucester Muslim Community said Akeel Nanabawa, his wife Hannaa and their four-year-old daughter Sara died in the crash. British national Vishwash Kumar Ramesh is believed to be the only survivor. His brother, Nayan, told Sky News their father was on the phone to him while the plane was still on the runway - before he video called again two minutes later to say the plane had crashed and: \"I don't know how I'm alive.\" Their other brother was also reported to have been on the plane - but the family has not heard from him since. Speaking to the Hindustan Times newspaper earlier on Thursday, Mr Ramesh said he heard a \"loud noise\" around 30 seconds after take-off before the plane went down. \"It all happened so quickly,\" he said, adding he had received \"impact injuries\" on his chest, eyes and feet. Mr Ramesh told the newspaper he had lived in London for 20 years and that his brother was seated in a different row on the plane. Air India said it had \"set up a dedicated passenger hotline number 1800 5691 444 to provide more information\". A separate passenger hotline for foreign nationals has also been set up by the airline on +91 8062779200. The flight had been due to land at London Gatwick at 6.25pm UK time.  What caused the crash? It is unknown at this stage what caused the crash. The aircraft was a Boeing 787-8 Dreamliner. The American aircraft manufacturer which makes the plane, said it is in contact with Air India and \"stands ready to support them\". Aviation expert Julian Bray told Sky News that he understands the pilot of Flight 171 managed to make a mayday call before the crash. This would mean the crew was aware of a problem before the incident happened. A mayday call is an internationally recognised distress signal used in radio communication. It indicates an imminent danger and the need for immediate assistance. Sky News' science correspondent Thomas Moore said investigators will now be studying the video and the two black boxes recording cockpit conversations and technical data to try to understand why the crash occurred. \"It's possible there was an engine failure of some kind, perhaps caused by a catastrophic mechanical fault. But the plane is designed to be able to fly with one engine, even at take-off, so something else would have to go wrong too,\" he said \"Both engines could have failed if they sucked in a flock of birds as the plane took off. It's happened in other air crashes.\"  How has the UK responded? Sir Keir Starmer said the scenes emerging from the site of the crash in Ahmedabad are \"devastating\". The prime minister said he was being kept updated as the situation develops. Buckingham Palace said King Charles is also being briefed on the crash. In a statement, the King said: \"My wife and I have been desperately shocked by the terrible events in Ahmedabad this morning. \"Our special prayers and deepest possible sympathy are with the families and friends of all those affected by this appallingly tragic incident across so many nations, as they await news of their loved ones.\" The UK's Foreign Office said it is currently \"working with local authorities in India to urgently establish the facts and provide support to those involved\". Britons who have concerns should call 0207 008 5000, it said. Sky News understands that Foreign Secretary David Lammy has also chaired a COBRA meeting in response to the crash. The UK Air Accidents Investigation Branch has also deployed four investigators to help the Aircraft Accident Investigation Bureau in India with its investigation into the crash. What has India said? Indian Prime Minister Narendra Modi said the plane crash was \"heartbreaking beyond words\". \"The tragedy in Ahmedabad has stunned and saddened us,\" he said. \"In this sad hour, my thoughts are with everyone affected by it.\" The country's civil aviation minister said he is \"shocked and devastated\". While the boss of Air India, Natarajan Chandrasekaran, said: \"Our thoughts and deepest condolences are with the families and loved ones of all those affected by this devastating event.\" Tata Group, the parent company of Air India, said it would provide 10 million rupees (around £86,000) to the families of those who were killed in the crash. Business and economics reporter Air India, the country's flagship carrier, is a private company, majority owned by the Indian conglomerate Tata Group and minority owned by Singapore Airlines. Since October, Air India Group has been 25.1% owned by Singapore Airlines, with the remaining owned privately by Tata. At that time, four Tata-owned airlines merged with another airline, Vistara. The airline operates more than 5,600 weekly flights and connects more than 90 domestic and international destinations with a fleet of 208 aircraft. It flies more than 120,000 passengers every day and offers connectivity to over 800 destinations through more than 75 partners. It was founded in 1932 and was owned by the Indian government from 1953 to 2022.\n Because Air India is private, it doesn't publish the kinds of financial and operational information that public airlines, like Ryanair or Air France-KLM, do.\n It also means we can't easily track its share price value, which is not publicly traded or visible. Similarly, the part of Tata that owns Air India isn't publicly listed, so we don't have a stock price representation of how investors are digesting this information. Previous plane crashes in India Air India, which started operations in 1932, and its subsidiary Air India Express have suffered several fatal crashes. According to Aviation Safety Network (ASN) the most recent fatal crash was in August 2020, when Boeing 737-800 (Air India Express) overshot the runway in Karipur, India, rolled down an embankment and broke up, killing 21 people. Non-fatal incidents have happened as recently as this year. In January, an Airbus A320-251N suffered an engine shutdown after departing Bangalore and landed safely at the same location, according to The Times of India. Boeing shares fell nearly 8% in premarket US trading on Thursday, after the crash in Ahmedabad."
    },
    {
        "title": "British crash survivor told family 'I don't know how I'm alive' seconds after plane came down",
        "description": "The British man who survived the Air India plane crash told his family \"I don't know how I'm alive\" in a phone call seconds after the plane came down, his brother has told Sky News.",
        "url": "https://news.sky.com/story/british-national-survives-plane-crash-indian-media-reports-13382718",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vishwash-kumar-ramesh_6940288.jpg?20250612154444",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 17:30:00",
        "Headline": "Vishwash Kumar Ramesh is believed to be the sole survivor of the Air India Flight 171 crash. His brother Nayan Kumar Ramesh told Sky News he video called their father moments after the crash to say: \"I don't know how I'm alive.\"",
        "Content": " The British man who survived the Air India plane crash told his family \"I don't know how I'm alive\" in a phone call seconds after the plane came down, his brother has told Sky News. Vishwash Kumar Ramesh is the only passenger reported to have survived after Air India Flight 171 crashed into a building shortly after take-off in Ahmedabad, Gujarat on Thursday afternoon. India plane crash - latest updates Relatives confirmed they had spoken to him since the crash - but they have not been able to contact his brother who was also believed to be on board. Speaking from Leicester, Mr Ramesh's brother Nayan told Sky News' Shamaan Freeman-Powell that their father was on the phone to Vishwash while the plane was still on the runway. \"My dad called him,\" the 27 year old said. \"And Vishwash said 'oh we're going to take off soon.\" Two minutes later, their father received a video call from Mr Ramesh to say the plane had crashed and he had survived. \"He video called my dad as he crashed and said 'Oh the plane's crashed. I don't know where my brother is. I don't see any other passengers. I don't know how I'm alive - how I exited the plane',\" Nayan said. Vidhi Chaudhary, a senior police officer in Ahmedabad, said Mr Ramesh was in seat 11A, next to an emergency exit, and \"managed to escape by jumping out the emergency door\". Mr Ramesh earlier told the Hindustan Times that he heard a \"loud noise\" around 30 seconds after take-off - and before the plane went down. \"It all happened so quickly,\" he told the newspaper, adding he had received \"impact injuries\" to his chest, eyes and feet. \"When I got up, there were bodies all around me. I was scared. I stood up and ran. There were pieces of the plane all around me. \"Someone grabbed hold of me and put me in an ambulance and brought me to the hospital.\" Sky News India correspondent Neville Lazarus spoke to Mr Ramesh in hospital and he said he was \"okay\". India reporter and producer Vishwash Kumar Ramesh was conscious, half sitting on his bed in blue hospital scrubs when I walked into the ward. He had bruises on his hands and face and was speaking to an attendant and some plain clothes police men. I introduced myself and asked how he was. He acknowledged with a nod and said he was ok. By then the police and the hospital administrators stopped me going any further and ushered me out of the ward. Dr Shariq told me he was the first to attend to Mr Ramesh when the ambulance brought him to the trauma centre. \"He was alright, had few cuts on his hands and face. There was nothing majorly wrong at all. He limped a bit. But he was mentally shaken up.\" Conscious and alert is how he described his condition.  A thorough check-up was done and he was shifted to the special ward. A miracle survivor is what everyone is calling him here. And that he is. Surviving a crash of that magnitude is nothing short of a miracle. Outside his ward and across is the mortuary where dozens of relatives and friends have gathered to identify their loved ones. Wails and cries break out every time an ambulance arrives. The process of identifying bodies is taking place with DNA matching from relatives. One hospital staff member told me \"some are charred beyond recognition and it's really bad.\"  'Miracle' he escaped Nayan Kumar Ramesh said he was supposed to be collecting his brother from Gatwick Airport on Thursday and the whole family planned to come together for a gathering this weekend. \"I've got no words to describe it,\" he said. \"It's a miracle that he survived - but what about the other miracle for my other brother.\" Asked how he and his relatives were feeling, he replied: \"Devastated. I'm scared to fly now - to even sit on a plane.\" Read moreWhat we know about the crash so farPlane wreckage rips apart medical hostel Footage shared widely on social media showed Mr Ramesh limping away from the crash site and being led towards emergency services. He told Indian media he has lived in London for 20 years. According to the Hindustan Times report, Mr Ramesh is 40 - but official flight documents list his age as 38. He told the newspaper his brother was sitting in a different row on the plane. \"We visited Diu. He was travelling with me and I can't find him anymore. Please help me find him.\" Three Britons dead Three Britons have been confirmed to have died in the crash - all members of the same family. Akeel Nanabawa, his wife Hannaa, and their four-year-old daughter Sara were among those who perished on the plane, Gloucester Muslim Community said on Facebook. The aircraft departed Ahmedabad for London Gatwick at 1.38pm local time on Thursday, carrying 242 passengers and crew members. They included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national, the airline said. According to tracking website Flightradar, a signal was last received from the plane less than a minute after it took off. It then crashed into a medical school's residential quarters in Meghaninagar, Ahmedabad, the largest city in Gujarat state. In a statement, London Gatwick said the flight was due to land at 6.25pm UK time on Thursday and a reception centre for relatives of those on board is being set up where information and support will be provided. The UK Foreign Office said it is \"working with local authorities in India to urgently establish the facts and provide support to those involved\". British nationals who require consular assistance are advised to call 020 7008 5000, while Air India has set up hotlines to provide information on +91 806 2779 200 for foreign nationals or 1800 5691 444 if calling from India.  Initially, an Ahmedabad city police commissioner claimed there appeared to be no survivors. The local police chief later said that at least 204 bodies had been recovered from the crash site, according to Reuters. Thursday's is the first crash of a Boeing 787 Dreamliner in its history, according to the Aviation Safety Network database. The model, a widebody, twin-engine plane, has made five million journeys in the 14 years since its first passenger flight. Meanwhile, India's prime minister Narendra Modi offered his condolences in a post on X. \"The tragedy in Ahmedabad has stunned and saddened us,\" he wrote. \"It is heartbreaking beyond words. In this sad hour, my thoughts are with everyone affected by it.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Air India crash survivor told me he's okay - his escape is nothing short of a miracle",
        "description": "Vishwash Kumar Ramesh was conscious, half sitting on his bed in blue hospital scrubs when I walked into the ward.",
        "url": "https://news.sky.com/story/the-air-india-crash-survivor-told-me-hes-okay-his-escape-is-nothing-short-of-a-miracle-13382822",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-plane-crash_6940392.jpg?20250612171830",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-06-12 17:41:00",
        "Headline": "British man Vishwash Kumar Ramesh is believed to be the only survivor after an Air India flight carrying 242 people crashed soon after taking off from Ahmedabad airport. ",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  Vishwash Kumar Ramesh was conscious, half sitting on his bed in blue hospital scrubs when I walked into the ward. The Briton had bruises on his hands and face, and was speaking to an attendant and some plain-clothed policemen. I introduced myself to the man believed to be the only survivor of Thursday's Air India crash and asked how he was. He acknowledged me with a nod and said he was okay. India plane crash - latest updates  By then, the police and the hospital administrators stopped me from going any further and ushered me out of the ward. Dr Shariq told me he was the first to attend to Ramesh when the ambulance brought him to the trauma centre. \"He was alright, had few cuts on his hands and face,\" the medic said. \"There was nothing majorly wrong at all. He limped a bit. But he was mentally shaken up.\" He described Ramesh's condition as conscious and alert. A thorough check-up was done and he was moved to the special ward. A miracle survivor is what everyone is calling him here. And that he is. Surviving a crash of that magnitude is nothing short of a miracle.  A short distance from his ward is the mortuary, where dozens of relatives and friends have gathered to identify their loved ones. Wails and cries break out every time an ambulance arrives. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:What we know so farCCTV shows take-off and crash Authorities are using DNA from living relatives to identify bodies. One hospital staff member told me: \"Some are charred beyond recognition and it's really bad.\""
    },
    {
        "title": "Air India crash: Plane wreckage ripped apart medical hostel as students lunched",
        "description": "Images and video have captured the aftermath of the Air India plane crash in a residential area near Ahmedabad Airport in the northwestern Indian state of Gujarat.",
        "url": "https://news.sky.com/story/air-india-crash-plane-wreckage-ripped-apart-medical-hostel-as-students-lunched-13382667",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dreamliner-a-air-india_6940176.jpg?20250612145223",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 12:21:00",
        "Headline": "Footage and images capture the aftermath of the Air India plane crash in a residential area near Ahmedabad Airport, showing parts of the aircraft strewn across a medical college and its dining room where students were taking a lunch break.",
        "Content": " Images and video have captured the aftermath of the Air India plane crash in a residential area near Ahmedabad Airport in the northwestern Indian state of Gujarat. Footage shows what appears to be part of the aircraft's tail wedged into the roof of a building in Meghaninagar. Crowds can be seen surrounding the multi-storey building - a medical facility - and looking up at the wreckage. The Boeing 787-8 Dreamliner crashed into BJ Medical College Hostel shortly after take-off at 1.38pm. India plane crash latest: Follow live updates Images also show parts of the plane in the building, including a food hall, where medical students were having lunch. One photograph from inside the complex shows rows of dining tables with thalis (steel plates) containing meals, and food and drink spilled all over the floor. Beyond the tables is wreckage of the aircraft on the floor, surrounded by a crowd. At the end of the room there is a gaping hole where part of the rear of the plane has crashed through. Read more:What we know so farMoments before Air India plane crash Footage from inside shows where the landing gear of the aircraft has become wedged, and what appears to be a balcony that looks down on the floor below to masses of debris. As well as the 'Royal Mess' food hall, the plane also struck the Atulyam Hostel which houses DM (Doctorate of Medicine) students and MCh (Master of Chirurgiae) students - those pursuing a degree in surgery. Video taken outside shows a smouldering piece of wreckage with locals and firefighters at the scene with debris and rubble strewn across the area.  Aviation expert Julian Bray told Sky News he understands the pilot managed to make a mayday call, meaning the crew was aware of a problem before the crash. Read more: Analysis: Crash a catastrophic one-off or part of wider Dreamliner problem?  Air India said 242 people were on the flight. Passengers included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national. India's CNN News18 TV channel said there 12 crew on the plane. India's prime minister Narendra Modi said in a post on X: \"The tragedy in Ahmedabad has stunned and saddened us. \"It is heartbreaking beyond words. In this sad hour, my thoughts are with everyone affected by it.\" Indian broadcaster NDTV reported he was headed to the scene."
    },
    {
        "title": "What happened to Air India Flight 171? - Aviation experts review crash video",
        "description": "An aviation analyst has reviewed footage of the Air India Boeing 787-8 before its fatal crash and assessed that the configuration of the passenger plane \"doesn't look right\".",
        "url": "https://news.sky.com/story/what-happened-to-air-india-flight-171-aviation-experts-review-crash-video-13382605",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-boeing-787_6940335.jpg?20250612162116",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 10:33:00",
        "Headline": "A first look at footage before the fatal crash has potentially revealed why the \"aircraft would not have been able to maintain flight\" and \"could explain why the plane came down\".",
        "Content": " An aviation analyst has reviewed footage of the Air India Boeing 787-8 before its fatal crash and assessed that the configuration of the passenger plane \"doesn't look right\". The Dreamliner, with 242 people on board, including 53 Britons, came down shortly after taking off from Ahmedabad airport in western India bound for Gatwick, in the world's worst aviation disaster in a decade. At least one person - a UK national - survived the disaster and the passenger said he heard a loud noise soon after the plane left the ground. Former British Airways pilot Alastair Rosenschein is among several experts who have told Sky News about their first look at video of Flight 171 which showed some potential anomalies. \"It's clearly got its [landing] gear down and that is not correct... it should have been up. And from the video... it's not immensely clear... but it does look like the aircraft didn't have its take-off flap setting.\"  Latest updates: Air India flight to Gatwick crashes Mr Rosenschein explained that the wing flaps need to be set correctly as they extend the shape of each wing and create vital extra lift at lower speeds to enable the plane to take-off and climb effectively. He added that, while he was speculating, it \"could explain why the aircraft came down\" as the \"aircraft would not have been able to maintain flight\". \"The video is not that clear, but it [the flaps setting] doesn't look right to me,\" he said. \"The altitude of the aircraft isn't right either and the aircraft seems to be descending rather than climbing. \"It does look like it's an aerodynamic issue because of not having the right flaps setting on take-off.\" Air India crash: What we know so far Laura Savino, a former United Airlines captain, has highlighted how the plane appears to make the unusual move of using up the whole runway. \"And it's a pretty long runway,\" she told Sky News. \"You could kind of see the dust blowing up off at the end. \"It was a shallow climb… They should be going to about 15 degrees, nose up and it looks like they're struggling to do that. Then the aircraft settled and started to come back down.\" Ian Petchenik, Flightradar24's director of communications, told the Sky News Daily podcast that he also struggled to understand how \"shortly after take-off, the aircraft lost height\". Focus on flaps and landing gear Mr Petchenik speculated that the aircraft suffered \"possibly a flap issue\" although footage of the plane just before the crash is poor quality. He added the landing gear also \"stayed down a bit longer than is usual\" although there could be other reasons for that. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Rosenschein also spoke about the status of the landing gear, which are usually retracted into the body of the aircraft shortly after becoming airborne. \"I cannot understand why the gear would have been down... [and] left down. That would suggest, perhaps, a hydraulic problem because it's hydraulics that raise the gear... but this is speculation. \"The accident investigators will be looking at all the videos that are available, but they'll get the vast majority of their information directly from the two black boxes\". Read more:Plane ripped apart medical hostelCrash is setback in Boeing's bid to restore reputationWas crash a catastrophic one-off?  Black boxes will be vital India's Aircraft Accident Investigation Bureau will be keen to access the data on the black boxes, or flight data recorders, which store essential information about the configuration of the aircraft, including the flaps and landing gear. Paul Edwards, an aviation security analyst and fellow at the Royal Aeronautical Society, also says it remains a mystery why the landing gear was still down. \"On take-off, a pilot would bring up the wheels as quickly as possible... the aircraft is more efficient in accelerating and in the climb,\" he told Sky News. \"It could have been he [the pilot] just didn't have time, or it could be that perhaps he thought he could control it, go round again and land or even land straight ahead.\" \"Really, we can't second-guess it,\" he added. \"So that remains, if you like, a mystery.\" He described the Boeing 787 Dreamliner as having an \"impeccable\" safety record. Dr Jason Knight, senior lecturer in fluid mechanics at the University of Portsmouth, has raised the possibility that a bird strike could be linked to the crash. Was a bird strike to blame? \"It is very unlikely that the plane was overweight or carrying too much fuel. The aircraft is designed to be able to fly on one engine, so the most likely cause of the crash is a double engine failure,\" he said. \"Because the altitude was so low, the pilot would have had very little time to do an emergency landing. The most likely cause of a double engine failure is a bird strike.\" Professor Graham Braithwaite, director of Aerospace and Aviation at Cranfield University, explained that passenger planes have an excellent safety record. \"Although take-off is a critical stage of flight, aircraft accidents are incredibly rare, especially involving modern aircraft types such as the Boeing 787. \"Take-off is a critical stage because the aircraft is still accelerating and any problem-solving requires a rapid response.\" 'Very surprising accident' Professor John McDermid, Lloyd's Register chair of safety at the University of York, agreed that \"take-off and landing are the most dangerous phases of flight\". But he described it as a \"very surprising accident\" given the levels of redundancy in aircraft systems and that they can climb with only one engine if needed. \"It's surprising that the accident occurred before the aircraft had even got to 200 metres altitude. \"Pilots can abort take-off until quite late in the take-off roll, so it seems like the problem occurred very suddenly in the final part of the take-off roll [before the aircraft becomes airbourne], or shortly after take-off, and was sufficiently serious to be unmanageable.\" The weather will also form part of the investigation, although Paul Williams, professor of atmospheric science at the University of Reading, said conditions at the airport \"appear to have been very good\". \"It was a dry and sunny day in Ahmedabad, with temperatures near 40C (104F). There was good visibility and light winds from the west. \"There is no indication at this stage that turbulence or other weather conditions were a factor in the crash.\""
    },
    {
        "title": "New CCTV footage shows Air India plane's take-off and crash",
        "description": "New CCTV footage has emerged showing an Air India flight bound for London Gatwick crashing and bursting into flames just moments after take-off. \n",
        "url": "https://news.sky.com/story/moments-before-air-india-plane-crash-13382583",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-crash-india_6940366.jpg?20250612165510",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 10:18:00",
        "Headline": "Taken from a building near the runway, harrowing footage shows the aircraft crashing in a residential area just seconds after taking off. ",
        "Content": " New CCTV footage has emerged showing an Air India flight bound for London Gatwick crashing and bursting into flames just moments after take-off. \n More than 200 people - including 53 British nationals - were on board Flight AI171 to London Gatwick. It was earlier reported that all on board had died, but Sky News has since confirmed that a British man survived. The video shows the aircraft taking off from Ahmedabad Airport in the northwestern Indian state of Gujarat. But just seconds after the plane is airborne, it can be see struggling to gain altitude and instead begins descending towards buildings, with its wheels still out and its nose raised. A huge explosion can be seen followed by thick black plumes of smoke rising into the skies. India plane crash latest: Follow live updates Footage that emerged earlier today, taken from what appears to be a property, showed the aircraft descending over a residential area. It crashed in an area called Meghaninagar at 1.38pm local time on Thursday, according to Faiz Ahmed Kidwai, the director general of the Directorate of Civil Aviation.  Flight tracking website Flightradar said a signal was last received from the aircraft less than a minute after take-off. Read more:What we know so farIs there a wider problem with Dreamliner? It is the first ever crash of a Boeing 787-8 Dreamliner, according to the Aviation Safety Network database.  Air India said 242 people were on the flight. Passengers included 169 Indian nationals, 53 British nationals, seven Portuguese nationals and one Canadian national. India's CNN News18 TV channel reported there were 12 crew on board. In a statement, London Gatwick said the flight was due to land at 6.25pm local time on Thursday. India's civil aviation minister Ram Mohan Naidu Kinjarapu said: \"Rescue teams have been mobilised, and all efforts are being made to ensure medical aid and relief support are being rushed to the site.\""
    },
    {
        "title": "What is Air India's safety record?",
        "description": "An Air India plane carrying 242 people has crashed in Ahmedabad, in one of the country's worst aviation disasters in decades.",
        "url": "https://news.sky.com/story/what-is-air-indias-safety-record-13382721",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-takagi-air-india-plane_6940016.jpg?20250612112034",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-12 14:42:00",
        "Headline": "Air India, which started operations in 1932, and its subsidiary Air India Express have suffered several fatal and non-fatal crashes over the years.",
        "Content": " An Air India plane carrying 242 people has crashed in Ahmedabad, in one of the country's worst aviation disasters in decades. Video footage shows the Boeing 787 Dreamliner plane - which had been bound for London Gatwick - coming down just outside Ahmedabad airport, where it hit a doctors' hostel in a residential area. India plane crash latest: Follow live updates Air India, which started operations in 1932, and its subsidiary Air India Express have suffered several fatal and non-fatal crashes over the years. According to Aviation Safety Network (ASN) the most recent fatal crashes were: • May 2010: Boeing 737-800 (Air India Express) overshot the runway at Mangalore, India, and crashed into a gorge, killing 158 people. • August 2020: Boeing 737-800 (Air India Express) after landing in Karipur, India, the aircraft left the runway, rolled down an embankment and broke up, killing 21 people. The airline, the country's flagship carrier, is a private company, majority owned by the Indian conglomerate Tata Group and minority owned by Singapore Airlines. The airline operates more than 5,600 weekly flights and connects more than 90 domestic and international destinations, with a fleet of 208 aircraft. It flies more than 120,000 passengers every day and offers connectivity to over 800 destinations through more than 75 partners. It was founded in 1932 and was owned by the Indian government from 1953 to 2022. Here are some recent non-fatal incidents, according to ASN, which references various sources: • September 2024: Boeing 737-8HG (Air India Express) suffered engine problems after taking off from Delhi, which was confirmed by the airline, and the aircraft returned to the airport. • October 2024: Boeing 737-8HG (Air India Express) declared an emergency immediately after take-off due to a hydraulic issue in Tamil Nadu, eventually landing safely, which a local minister said had affected the landing gear. • December 2024: Airbus A320-251N started the take-off roll (the start of building up speed to take off) on a taxiway instead of the runway at Goa, according to the aviation safety regulator, but stopped when alerted by a tower controller. Read more:What we know so farIs there a wider problem with Dreamliner? • December 2024: Boeing 737-86N (Air India Express) returned to land at Kochi after tyre debris was found on the runway, according to Onmanorama, a local news outlet in Kerala. • January 2025: Airbus A320-251N suffered an engine shutdown after departing Bangalore and landed safely at the same location, according to the Times of India."
    },
    {
        "title": "India-UK plane crash: Investigators will want to know if incident was catastrophic one-off or part of wider problem with Dreamliner",
        "description": "Air investigators will have an open mind on what could have caused the crash.",
        "url": "https://news.sky.com/story/india-uk-plane-crash-investigators-will-want-to-know-if-incident-was-catastrophic-one-off-or-part-of-wider-problem-with-dreamliner-13382641",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-dreamliner_6940116.jpg?20250612124328",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-06-12 11:38:00",
        "Headline": "The Boeing 787 Dreamliner has a stellar safety record. This is the first fatal crash. So what could have gone wrong?",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Air investigators will have an open mind on what could have caused the crash. The Boeing 787 Dreamliner has a stellar safety record. This is the first fatal crash. 53 Britons on board India-UK flight; follow latest And both pilots were experienced, with more than 9,000 flying hours between them. So what could have gone wrong? Read moreWhat we know so far about plane crashMoments before plane came down Contact was lost with Flight AI171 just seconds after it took off, when it was at an altitude of just 190m (623ft). The two engines should have been working at maximum thrust to gain the speed needed to lift 242 people and a plane-load of fuel off the ground. But video shows the aircraft failed to climb. Its nose should have been pointed upwards, and the plane accelerating. But it was flying level and then it descends, lifting its nose almost as if it was coming in to land. Investigators will be studying the video and the two black boxes recording cockpit conversations and technical data to try to understand why. It's possible there was an engine failure of some kind, perhaps caused by a catastrophic mechanical fault. But the plane is designed to be able to fly with one engine, even at take-off, so something else would have to go wrong too. Both engines could have failed if they sucked in a flock of birds as the plane took off. It's happened in other air crashes.  Investigators will also be checking that the pilots - and the plane's computers - were also receiving the correct data from all the sensors on board, and that there was no problem with the avionics, or electrical systems, on board. Experienced pilots who have studied the video of the plane struggling to gain altitude have told Sky News that the flaps on the wings appear not to be set in the normal take-off position. The flaps at the back of the wing need to be extended at the relatively low speeds of take-off and landing to increase the 'lift', the difference in air pressure that keeps an aircraft airborne. It's another factor air crash investigators will look at. But they will be working swiftly to pinpoint the cause. The Dreamliner is used worldwide by dozens of airlines, and they will want to know whether there is a wider problem or that this was just a catastrophic one-off."
    },
    {
        "title": "Trump's administration reviews AUKUS submarine deal with Britain and Australia ",
        "description": "The US has launched a formal review of the multi-billion pound AUKUS submarine deal with the UK and Australia. ",
        "url": "https://news.sky.com/story/trumps-administration-reviews-aukus-submarine-deal-with-britain-and-australia-13382472",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-aukus-submarine_6088425.jpg?20230314110945",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-12 08:02:00",
        "Headline": "Washington says the review is to ensure the defence pact, agreed by Joe Biden, aligns with Donald Trump's \"America First\" agenda.",
        "Content": "The US has launched a formal review of the multi-billion pound AUKUS submarine deal with the UK and Australia.  The defence pact, which is developing a new fleet of nuclear-powered hunter-killer submarines for the UK and Australia, was agreed under Joe Biden's administration in 2021. The alliance, which also covers collaboration on other advanced technologies, is seen as an attempt to counter the influence of China. But Elbridge Colby, the Pentagon's top policy advisor, is among vocal sceptics in Donald Trump's administration. \"We are reviewing AUKUS as part of ensuring that this initiative of the previous administration is aligned with the President's America First agenda,\" a US official said. \"Any changes to the administration's approach for AUKUS will be communicated through official channels, when appropriate.\" AUKUS envisages Australia acquiring up to five US Virginia-class nuclear-powered submarines from 2032 before the UK and Australia design and build a new class of submarine with US assistance. \n                  AUKUS: UK strikes deal with US and Australia to monitor deep space with high-powered radar\n                 \n                  UK hands £4bn contract to BAE Systems for 'powerful attack' submarines as part of AUKUS pact\n                 \n                  What is the AUKUS submarines pact between the UK, US and Australia - and why does China think it's 'highly irresponsible'?\n                 Australia's defence minister Richard Marles said on Thursday he was confident the pact would still go ahead and his government would work closely with the US while Mr Trump's administration conducts a review. \"This is a multi-decade plan. There will be governments that come and go and I think whenever we see a new government, a review of this kind is going to be something which will be undertaken,\" he told the Australian Broadcasting Corporation. It comes ahead of Mr Trump's first expected meeting with Australian prime minister Anthony Albanese on the sidelines of the G7 meeting in Canada. Security allies will discuss a request from Washington for Australia to increase defence spending from 2% to 3.5% of gross domestic product (GDP). Read more from Sky News:Why Trump's 'birthday' parade is controversialIsrael considering military action against Iran AUKUS is at the centre of the UK's planned expansion of its submarine fleet, with up to 12 attack submarines expected to be built for the Royal Navy. The deal is said to be worth more than £175bn. When it was signed, all three countries - the US, UK and Australia - had different leaders. In May, the US president's new ambassador, Warren Stephens, used his first public speech to back the partnership, highlighting how \"vital the US-UK relationship is to our countries and to the world\". A UK government spokesperson said: \"AUKUS is a landmark security and defence partnership with two of our closest allies. \"It is one of the most strategically important partnerships in decades, supporting peace and security in the Indo-Pacific and Euro-Atlantic, while also delivering jobs and economic growth in communities across all three nations.\""
    },
    {
        "title": "China strikes cautious tone after Trump claims trade deal is 'done'",
        "description": "China will \"always honour its commitments\" when it comes to negotiating trade disagreements with the US, according to a spokesperson for the Chinese government.",
        "url": "https://news.sky.com/story/china-strikes-cautious-tone-after-trump-claims-trade-deal-is-done-13382694",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-xi-jinping_6816079.jpg?20250201083304",
        "type": "US",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-06-12 13:31:00",
        "Headline": "It follows high-stakes talks between delegations from the two countries in London aimed at stabilising the relationship amid an escalating trade and supply chain war.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n China will \"always honour its commitments\" when it comes to negotiating trade disagreements with the US, according to a spokesperson for the Chinese government. But when pushed by Sky News, he refrained from confirming what those commitments are. The reluctance is at odds with President Trump, who declared on his Truth Social account on Wednesday that \"our deal with China is done\", while also claiming that China has agreed to supply rare earth metals to the US \"upfront\", and to a 55% tariff rate on its goods. The comments follow high-stakes talks between delegations from the two countries in London aimed at stabilising the relationship amid an escalating trade and supply chain war. China's refusal to confirm these details has raised speculation that, contrary to what the US side is claiming, there may still be significant disagreements and some details yet to be worked out. The continued silence comes after two days of negotiations between delegations from the US and China in the UK. While both sides confirmed that they had agreed a \"framework\" to implement the \"consensus\" reached at previous talks in Geneva last month, as well as during a phone call between President Xi and President Trump on 5 June, the delegations were supposed to be taking the agreement to their respective leaders for sign-off. \n                  US-China trade talks: The fact neither side is saying much on the outcome says a lot\n                 \n                  Is Trump ready to wage war at home?\n                 \n                  Trade war: US-China talks in London aim for widespread truce\n                 When asked by Sky News if any of the details in Trump's Truth Social post reflected what China understood to be in the deal, Lin Jian, China's foreign ministry spokesperson, said \"the two sides achieved new progress in addressing the concerns on economic and trade issues\". \"We always honour our commitments. Since we've reached common understandings, the two sides need to follow them.\" 👉 Follow Trump100 on your podcast app 👈 When pushed by Sky News on whether China agrees with Trump's Truth Social assessment that the US-China relationship is \"excellent\", Lin declined to agree, saying simply: \"Our position on relations with the United States has been consistent and clear.\" Such lukewarm language is not uncommon in China but there will likely be significant displeasure at the way Trump is unilaterally publishing details that may not yet have been officially signed off. It is in stark contrast to China's communication landscape which is highly scripted and controlled, and if it was designed to force China into an agreement it could well backfire. Indeed, if everything in Trump's Truth Social post is true it would represent quite a coup for the US, and that feels a little unlikely given the valuable bargaining chips China has, particularly over rare earth metals.  This will likely have been a crunch point in negotiations. China has the vast majority of the world's rare earth metals which are vital in the production of everything from cars to weaponry, and recent export controls imposed in response to Trump's tariffs have brought some production lines to the brink of standstill. In response, the Trump administration imposed extra export controls on high-tech chips, chip development technology and parts needed to make jet engines, as well as moving to revoke student visas for Chinese nationals. Read more from Sky News:What we know so far about India plane crashWas crash a catastrophic one-off? President Trump indicated in his Truth Social post that the measures to revoke visas will be rowed back. When pushed by Sky News, Lin refrained from commenting on whether Trump's communications on this matter have undermined the relationship more broadly, but the stakes remain enormously high, with the unfolding supply chain war set to do significant damage to the economies of both nations."
    },
    {
        "title": "India crash is fresh setback in Boeing's bid to restore reputation",
        "description": "As hundreds lie dead following the latest tragedy to beset a Boeing passenger plane, it is too early to determine blame.",
        "url": "https://news.sky.com/story/india-crash-is-fresh-setback-in-boeings-bid-to-restore-its-reputation-13382670",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-boeing-787-8_6939901.jpg?20250612100837",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-12 12:28:00",
        "Headline": "Sky's James Sillars writes that, no matter what the cause of Flight AI171's demise, the fact that a Boeing plane was involved underscores the big problem facing the scandal-hit manufacturer.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n As hundreds lie dead following the latest tragedy to beset a Boeing passenger plane, it is too early to determine blame. Pilot error, engine failure and bird strikes are among the theories all being banded about. Only the recovery of Flight AI171's black box flight recorders are likely to provide the concrete answers. What is inescapable though is that this is an air disaster the plane's maker, Boeing, could well do without. Plane crash latest: 53 Britons on board It sounds petty, in the midst of such a catastrophe, to be talking about the impact on a company, but this has been a civil aviation giant left deeply scarred, in the public eye, through its attitude to safety in recent years. While the 787 Dreamliner's record had been impressive up until today, the same can not be said for the company's 737 MAX planes. The entire fleet was grounded globally for almost two years following the demise of Ethiopian Airlines Flight 302 outside Addis Ababa in March 2019. \n                  FTSE 100 hits record high on back of US-Iran tensions\n                 \n                  UK economy contracts - with record fall in exports to the US after Trump tariff hikes\n                 \n                  Thousands of Poundland jobs at risk as shops to close after company sold\n                 All 157 people aboard were killed. Six months earlier, a Lion Air 737 MAX, carrying 189 passengers and crew, crashed in Indonesia. At fault was flight control software that has since been rectified. That recent past continues to haunt Boeing. It took those crashes to uncover a culture of cover-up. It amounted to not only a corporate failure but one of regulation and justice too, according to critics, as relatives were denied their days in court due to plea bargains.  Just last month, the US Justice Department and Boeing agreed a non-prosecution agreement over those two fatal crashes in return for $1.1bn in fines and an admission that it obstructed the investigation. It raises several questions over the US legal system and its ability to police corporate activity and incentivise playing by the rules. Science and Technology reporter The crash of an Air India plane, carrying 242 people bound for Gatwick Airport from Ahmedabad, is the first fatal incident for Boeing's 787 Dreamliner.\n\n Experienced pilots who have studied video of the moments before the crash have told Sky News the flaps on the wings appear not to be set in the normal take-off position, however the cause of incident is unknown.\n In a statement, Boeing said: \"We are in contact with Air India regarding Flight 171 and stand ready to support them.\n \"Our thoughts are with the passengers, crew, first responders and all affected.\"\n\n Multiple concerns about Boeing's Dreamliners, the most modern passenger aircraft in service, have previously been raised by whistleblowers.\n\n In April 2024, a Boeing quality engineer, Sam Salehpour, told members of a Senate subcommittee that Boeing was taking shortcuts to bolster production levels that could lead to jetliners breaking apart.\n\n The engineer said he studied Boeing's own data and concluded \"that the company is taking manufacturing shortcuts on the 787 programme that could significantly reduce the airplane's safety and the life cycle\".\n\n \"They are putting out defective airplanes,\" he said.\n\n Boeing denied Mr Salehpour's claims about the Dreamliner's structural integrity.\n In the same week, a separate Senate commerce committee heard from members of an expert panel that found serious flaws in Boeing's safety culture.\n\n One of the panel members, MIT aeronautics lecturer Javier de Luis, said workers feel pressure to push planes through the factory as fast as they can.\n\n When talking to Boeing workers, he said he heard \"there was a very real fear of payback and retribution if you held your ground\".\n\n Speaking to a Senate subcommittee in June 2024, Boeing chief executive Dave Calhoun said: \"Our culture is far from perfect, but we are taking action and making progress. We understand the gravity.\"\n\n \"We are taking comprehensive action today to strengthen safety and quality.\"\n In May 2024, federal investigators opened a fresh investigation into the Boeing 787 Dreamliner - after the firm said several employees had committed \"misconduct\" by falsely claiming tests had been completed.\n\n The Federal Aviation Authority said Boeing was \"reinspecting all 787 airplanes still within the production system and must also create a plan to address the in-service fleet\" while the investigation is taking place. Would a British manufacturer have been offered such a deal by US prosecutors? As for regulation, we're told oversight has been stepped up and the number of planes that Boeing makes is still subject to controls in a bid to boost quality. The company has long denied putting profit before safety, but that is what almost every whistleblower to have come forward to date has alleged. The production limits were implemented after a mid-air door plug blowout aboard an Alaska Airlines Boeing 737 MAX 9 flight in January last year. They are hampering Boeing's efforts to restore profitability. Read more: Air India plane ripped apart medical hostelWhat we know so far about AI171 crash A 5% fall in its share price at the market open on Wall Street goes to the heart of Boeing's problem. That is every time a Boeing plane is involved in an accident or failure, investors' first instincts are to run for the hills. Boeing says it is seeking more information on the nature of the Air India crash. But whether Boeing's plane is at fault for the loss of Flight 171 or not - and we have seen nothing so far to indicate that was the case - it's clear the company has a long way to go to restore trust. In a statement, Boeing president and chief executive Kelly Ortberg, said: \"Our deepest condolences go out to the loved ones of the passengers and crew on board Air India Flight 171, as well as everyone affected in Ahmedabad. \"I have spoken with Air India chairman N. Chandrasekaran to offer our full support, and a Boeing team stands ready to support the investigation led by India's Aircraft Accident Investigation Bureau (AAIB).\" Boeing will defer to India's AAIB to provide information about Air India Flight 171, in adherence with the United Nations International Civil Aviation Organization protocol, the company added."
    },
    {
        "title": "UK economy contracts - with record fall in exports to the US after Trump tariff hikes",
        "description": "The UK economy shrank more than expected in April as the worst of President Trump's tariffs hit.",
        "url": "https://news.sky.com/story/uk-economy-contracted-sharply-in-april-after-trumps-tariffs-13382404",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-uk-economy-gdp_6302114.jpg?20230929121902",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-12 05:14:00",
        "Headline": "While a fall in GDP was anticipated, the drop is steeper than expected.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK economy shrank more than expected in April as the worst of President Trump's tariffs hit. The standard measure of economic output (GDP) contracted a sharp 0.3% in April, data from the Office for National Statistics (ONS) showed. During the month, Mr Trump's so-called \"Liberation Day\" applied steep tariffs to countries around the world and sparked a trade war with China, the world's second-largest economy. The outcome is worse than expected by economists. A contraction of just 0.1% had been forecast by economists polled by the Reuters news agency. It's also down from the growth of 0.2% recorded in March. Blow for Reeves It's also bad news for Chancellor Rachel Reeves, who has made the push for economic growth her number one priority. Speaking to Sky News following the news, she described the figures as \"disappointing\".  Additional costs on businesses were also levied during the month, as higher minimum wages and employer national insurance contributions took effect, which businesses told the ONS played a part in their performance. Why? The biggest part of the economy, the services sector, contracted by 0.4%, and manufacturing dropped 0.9%. There was the largest ever monthly fall in goods exported to the United States, the ONS said. Decreases were seen across most types of goods due to tariffs, it added. Higher stamp duty depressed house buying and meant legal and real estate firms fared badly in the month. After a strong showing in the first three months, car manufacturing performed poorly."
    },
    {
        "title": "Thousands of Poundland jobs at risk as shops to close after company sold",
        "description": "Thousands of jobs are at risk after discount high street chain Poundland was sold - with dozens of shops expected to shut. ",
        "url": "https://news.sky.com/story/thousands-of-poundland-jobs-at-risk-as-shops-to-close-after-company-sold-13382479",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-poundland-pound_6802760.jpg?20250118095137",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-12 08:19:00",
        "Headline": "The company has been sold for a headline figure of €1 - but has to repay tens of millions of pounds to the seller Pepco Group. ",
        "Content": "Thousands of jobs are at risk after discount high street chain Poundland was sold - with dozens of shops expected to shut.  Poundland has been sold for a headline figure of €1 to investment firm and former Laura Ashley owners Gordon Brothers, confirming Sky News reporting. Its previous owners, the Poland-based Pepco Group, however, are to be repaid tens of millions of pounds as part of the sale. Poundland employs roughly 16,000 people across an estate of over 800 shops in the UK and Ireland. Read more:UK economy contracts - with record fall in exports to the US after Trump tariff hikesSpending review's key points at a glance Around 100 stores are expected to close, and rent reviews are also expected to be negotiated with Poundland landlords. The chain, known for selling products for £1, was put on the market earlier this year after a downturn in trading. Employers' tax hikes announced by Chancellor Rachel Reeves in the November budget increased the financial pressure on high street retailers. \n                  Burberry to cut 1,700 jobs after multi-million pound loss\n                 \n                  Luxury store Harrods is latest retail victim of cyber attackers\n                 \n                  Hundreds of jobs at risk as The Original Factory Shop launches survival plan\n                 As part of the deal, a restructuring plan requiring High Court approval will take place. Details of that restructuring will be communicated in \"due course\", owners Pepco said. It will retain a minority stake in Poundland. Pepco said the deal would help it shift away from food and drinks, improve its revenue growth and boost its profitability Stephan Borchert, Pepco Group's chief executive, said: \"This transaction will strongly support our accelerated value creation programme by simplifying the group and focusing on our successful Pepco business. \"Poundland remains a key player in UK discount retail, with millions of customers annually and a well-loved brand and proposition.\""
    },
    {
        "title": "Rachel Reeves 'a gnat's whisker' from having to raise taxes, says IFS",
        "description": "Rachel Reeves is a \"gnat's whisker\" away from having to raise taxes in the autumn budget, a leading economist has warned - despite the chancellor insisting her plans are \"fully funded\".",
        "url": "https://news.sky.com/story/rachel-reeves-a-gnats-whisker-from-having-to-raise-taxes-says-ifs-13382868",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-politics_6940579.jpg?20250612204238",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-12 19:14:00",
        "Headline": "The chancellor pledged tens of billions of pounds to the NHS, transport projects, the defence budget and more in her spending review - but attention has already started turning towards her next fiscal event as the economy continues to struggle.",
        "Content": " Rachel Reeves is a \"gnat's whisker\" away from having to raise taxes in the autumn budget, a leading economist has warned - despite the chancellor insisting her plans are \"fully funded\". Paul Johnson, director of the Institute for Fiscal Studies (IFS), said \"any move in the wrong direction\" for the economy before the next fiscal event would \"almost certainly spark more tax rises\". 'Sting in the tail' in chancellor's plans - politics latest Speaking the morning after she delivered her spending review, which sets government budgets until 2029, Ms Reeves told Wilfred Frost hiking taxes wasn't inevitable. \"Everything I set out yesterday was fully costed and fully funded,\" she told Sky News Breakfast. Her plans - which include £29bn for day-to-day NHS spending, £39bn for affordable and social housing, and boosts for defence and transport - are based on what she set out in October's budget. That budget, her first as chancellor, included controversial tax hikes on employers and increased borrowing to help public services.  Chancellor won't rule out tax rises The Labour government has long vowed not to raise taxes on \"working people\" - specifically income tax, national insurance for employees, and VAT. Ms Reeves refused to completely rule out tax rises in her next budget, saying the world is \"very uncertain\". The Conservatives have claimed she will almost certainly have to put taxes up, with shadow chancellor Mel Stride accusing her of mismanaging the economy. Taxes on businesses had \"destroyed growth\" and increased spending had been \"inflationary\", he told Sky News. New official figures showed the economy contracted in April by 0.3% - more than expected. It coincided with Donald Trump imposing tariffs across the world. Ms Reeves admitted the figures were \"disappointing\" but pointed to more positive figures from previous months. Read more:Chancellor running out of levers to pullGrowth stats make for unpleasant readingYour spending review questions answered  'Sting in the tail' She is hoping Labour's plans will provide more jobs and boost growth, with major infrastructure projects \"spread\" across the country - from the Sizewell C nuclear plant in Suffolk, to a rail line connecting Liverpool and Manchester. But the IFS said further contractions in the economy, and poor forecasts from the Office for Budget Responsibility, would likely require the chancellor to increase the national tax take once again. It said her spending review already accounted for a 5% rise in council tax to help local authorities, labelling it a \"sting in the tail\" after she told Sky's Beth Rigby that it wouldn't have to go up."
    },
    {
        "title": "Billionaire Blavatnik courted to take Daily Telegraph stake",
        "description": "The billionaire who has bankrolled DAZN, the sports-streaming service, is being courted to take a stake in The Daily Telegraph alongside the newspaper's new American majority-owners.",
        "url": "https://news.sky.com/story/billionaire-blavatnik-courted-to-take-daily-telegraph-stake-13382627",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-telegraph-newspaper_6323054.jpg?20231016113029",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-12 11:20:00",
        "Headline": "The Ukrainian-born owner of London's Theatre Royal Haymarket is being sounded out about a minority stake in the broadsheet by RedBird Capital Partners, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The billionaire who has bankrolled DAZN, the sports-streaming service, is being courted to take a stake in The Daily Telegraph alongside the newspaper's new American majority-owners. Sky News has learnt that Sir Len Blavatnik, whose holding company Access Entertainment owns assets in Britain, including the Theatre Royal Haymarket, has been approached by RedBird Capital Partners about becoming a minority investor in the Telegraph titles. Two sources close to the situation said on Thursday that Sir Len was being sounded out about a deal, although they cautioned that no agreement had been struck and it remained unclear whether one would be. Sir Len, who was knighted by the late Queen Elizabeth II for services to philanthropy in 2017, is a prolific investor in the arts, media and entertainment industries. Access Entertainment is run by Danny Cohen, the former BBC director of television. Announcing its agreement to acquire Telegraph Media Group last month for an enterprise valuation of £500m, RedBird Capital said it was \"in discussions with select UK-based minority investors with print media expertise and strong commitment to upholding the editorial values of the Telegraph\". This was principally a reference to Lord Rothermere, the Daily Mail proprietor, who remains in talks to pay more than £30m for a stake in the Mail's rival right-leaning newspaper group. \n                  Daily Mail chief to pay £35m for Telegraph stake\n                 \n                  Telegraph sale agreed 'in principle' after two-year ownership impasse\n                 \n                  Foreign states face 15% newspaper ownership limit amid Telegraph row\n                 Goldman Sachs is advising DMGT on the investment, with a deal the subject of ongoing discussions, according to insiders. Read more:UK economy contracts - with record fall in exports to the US after Trump tariff hikesSpending review's key points at a glance The Abu Dhabi state-backed vehicle IMI is still expected to acquire the maximum 15% stake in the Telegraph permitted under proposed new media ownership rules. The government's decision to set the ownership threshold at 15% follows an intensive lobbying campaign by newspaper industry executives concerned that a permanent outright ban could cut off a vital source of funding to an already-embattled industry. However, the deal faces continued opposition from parliamentarians, with The Guardian reporting on Thursday that a cross-party group had written to Lisa Nandy, the culture secretary, warning of \"potential Chinese state influence\" because of links between RedBird Capital chair John Thornton and China's sovereign wealth fund. This suggestion has been dismissed by RedBird Capital insiders. Ukraine-born Sir Len's portfolio of investments includes DAZN, which is now also backed by a Saudi sports group, mobile games studio Tripledot and Scenario Two, a theatre production company. Dovid Efune, the owner of The New York Sun, is meanwhile continuing to assemble a rival bid for the Telegraph, having secured backing from Jeremy Hosking, the prominent City investor. His prospects, however, look to have diminished after the former chancellor, Nadhim Zahawi, was reported to have withdrawn from his so-called 'British bid'. The Telegraph titles' parent company was forced into insolvency proceedings two years ago by Lloyds Banking Group, which ran out of patience with the Barclay family, their long-standing owner. RedBird IMI, a joint venture between the two firms, paid £600m several months later to acquire a call option that was intended to convert into ownership of the Telegraph newspapers and The Spectator magazine. That objective was thwarted by a change in media ownership laws, which banned any form of foreign state ownership. Some parliamentarians are continuing to argue that a 15% threshold would be too high, and that the proposed rules are ambiguous because they potentially allow for more than one state investor to aggregate their holdings in British newspapers. The Spectator was sold last year for £100m to Sir Paul Marshall, the hedge fund billionaire, who has installed Lord Gove, the former cabinet minister, as its editor. RedBird Capital declined to comment, while a call to Access Industries' London office went unanswered on Thursday lunchtime."
    },
    {
        "title": "China strikes cautious tone after Trump claims trade deal is 'done'",
        "description": "China will \"always honour its commitments\" when it comes to negotiating trade disagreements with the US, according to a spokesperson for the Chinese government.",
        "url": "https://news.sky.com/story/china-strikes-cautious-tone-after-trump-claims-trade-deal-is-done-13382694",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-xi-jinping_6816079.jpg?20250201083304",
        "type": "Business",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-06-12 13:31:00",
        "Headline": "It follows high-stakes talks between delegations from the two countries in London aimed at stabilising the relationship amid an escalating trade and supply chain war.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n China will \"always honour its commitments\" when it comes to negotiating trade disagreements with the US, according to a spokesperson for the Chinese government. But when pushed by Sky News, he refrained from confirming what those commitments are. The reluctance is at odds with President Trump, who declared on his Truth Social account on Wednesday that \"our deal with China is done\", while also claiming that China has agreed to supply rare earth metals to the US \"upfront\", and to a 55% tariff rate on its goods. The comments follow high-stakes talks between delegations from the two countries in London aimed at stabilising the relationship amid an escalating trade and supply chain war. China's refusal to confirm these details has raised speculation that, contrary to what the US side is claiming, there may still be significant disagreements and some details yet to be worked out. The continued silence comes after two days of negotiations between delegations from the US and China in the UK. While both sides confirmed that they had agreed a \"framework\" to implement the \"consensus\" reached at previous talks in Geneva last month, as well as during a phone call between President Xi and President Trump on 5 June, the delegations were supposed to be taking the agreement to their respective leaders for sign-off. \n                  US-China trade talks: The fact neither side is saying much on the outcome says a lot\n                 \n                  Is Trump ready to wage war at home?\n                 \n                  Trade war: US-China talks in London aim for widespread truce\n                 When asked by Sky News if any of the details in Trump's Truth Social post reflected what China understood to be in the deal, Lin Jian, China's foreign ministry spokesperson, said \"the two sides achieved new progress in addressing the concerns on economic and trade issues\". \"We always honour our commitments. Since we've reached common understandings, the two sides need to follow them.\" 👉 Follow Trump100 on your podcast app 👈 When pushed by Sky News on whether China agrees with Trump's Truth Social assessment that the US-China relationship is \"excellent\", Lin declined to agree, saying simply: \"Our position on relations with the United States has been consistent and clear.\" Such lukewarm language is not uncommon in China but there will likely be significant displeasure at the way Trump is unilaterally publishing details that may not yet have been officially signed off. It is in stark contrast to China's communication landscape which is highly scripted and controlled, and if it was designed to force China into an agreement it could well backfire. Indeed, if everything in Trump's Truth Social post is true it would represent quite a coup for the US, and that feels a little unlikely given the valuable bargaining chips China has, particularly over rare earth metals.  This will likely have been a crunch point in negotiations. China has the vast majority of the world's rare earth metals which are vital in the production of everything from cars to weaponry, and recent export controls imposed in response to Trump's tariffs have brought some production lines to the brink of standstill. In response, the Trump administration imposed extra export controls on high-tech chips, chip development technology and parts needed to make jet engines, as well as moving to revoke student visas for Chinese nationals. Read more from Sky News:What we know so far about India plane crashWas crash a catastrophic one-off? President Trump indicated in his Truth Social post that the measures to revoke visas will be rowed back. When pushed by Sky News, Lin refrained from commenting on whether Trump's communications on this matter have undermined the relationship more broadly, but the stakes remain enormously high, with the unfolding supply chain war set to do significant damage to the economies of both nations."
    },
    {
        "title": "Activist fund Palliser builds stake in travel retailer WH Smith",
        "description": "A prominent activist investment firm has begun building a stake in WH Smith, the travel retailer, weeks after it sold off its historic high street arm.",
        "url": "https://news.sky.com/story/activist-fund-palliser-builds-stake-in-travel-retailer-wh-smith-13382637",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wh-smith-shop_6810589.jpg?20250125181237",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-12 11:31:00",
        "Headline": "Palliser Capital, which has targeted companies including Capricorn Energy and Rio Tinto, has built a near-5% stake in WH Smith weeks after it sold its historic high street arm, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A prominent activist investment firm has begun building a stake in WH Smith, the travel retailer, weeks after it sold off its historic high street arm. Sky News has learnt that Palliser Capital has acquired close to 5% of the London-listed company in recent weeks - worth about £65m at the current share price. Sources said the stake was expected to be disclosed publicly at an industry conference on Thursday afternoon. Money latest: What shrinking economy means for chancellor Palliser, which recently led an effort to force Rio Tinto, the global mining group, to abandon its London listing in favour of Australia, is said to hold WH Smith's management team - led by chief executive Carl Cowling - in high regard. The investment fund believes, however, that returns to WH Smith shareholders could be bolstered through a series of self-help measures. These included reviewing the travel retailer's leverage targets and capital allocation policy to ensure better use of its balance sheet, according to one source. \n                  India crash is fresh setback in Boeing's bid to restore reputation\n                 \n                  FTSE 100 hits record high on back of US-Iran tensions\n                 \n                  UK economy contracts - with record fall in exports to the US after Trump tariff hikes\n                 Improving investor communication and disclosure, and overhauling its executive incentive structure to align it more closely with the interests of shareholders are also on Palliser's wishlist, the source added. Shares in WH Smith are still trading at levels comparable to their lows during the COVID-19 pandemic, when the global travel industry faced near-total shutdown for long periods. The company's depressed share price is not unique to WH Smith, with SSP, the transport catering group, also drawing interest from activists in recent months. WH Smith trades from more than 1,200 travel stores in over 30 countries. \"The group operates in structurally advantaged growth markets,\" it said in April. \"Passenger numbers are forecast to grow in air travel by 2.5 times between 2024 and 2050, driven by both population and economic growth. \"Investment in airport infrastructure is also increasing across the globe creating more opportunities for airport retailing.\" Palliser is understood to have identified WH Smith's high growth potential in the US as particularly attractive, and is said to believe that there is scope for its shares to nearly double in value in the next three years. WH Smith's decision to offload its town centre business, which dates back to 1792, was revealed by Sky News in January, and was viewed as a fresg symbol of the British high street's decline. Comprising about 480 stores and roughly 5,000 staff, the unit was sold to Modella Capital, an increasingly prolific investor in retail businesses. The stores are being rebranded under the new name TG Jones. Read more from Sky News:Thousands of Poundland jobs at risk as brand soldBillionaire Blavatnik courted to take Telegraph stakeSpending review's key points at a glance On Thursday afternoon, shares in WH Smith were trading at around £10.60 - down more than 10% over the last year, and giving the company a market capitalisation of £1.36bn. A spokesman for Palliser, which led a successful campaign against the board of London-listed Capricorn Energy, declined to comment. WH Smith has been contacted for comment."
    },
    {
        "title": "Rachel Reeves 'a gnat's whisker' from having to raise taxes, says IFS",
        "description": "Rachel Reeves is a \"gnat's whisker\" away from having to raise taxes in the autumn budget, a leading economist has warned - despite the chancellor insisting her plans are \"fully funded\".",
        "url": "https://news.sky.com/story/rachel-reeves-a-gnats-whisker-from-having-to-raise-taxes-says-ifs-13382868",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-politics_6940579.jpg?20250612204238",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-12 19:14:00",
        "Headline": "The chancellor pledged tens of billions of pounds to the NHS, transport projects, the defence budget and more in her spending review - but attention has already started turning towards her next fiscal event as the economy continues to struggle.",
        "Content": " Rachel Reeves is a \"gnat's whisker\" away from having to raise taxes in the autumn budget, a leading economist has warned - despite the chancellor insisting her plans are \"fully funded\". Paul Johnson, director of the Institute for Fiscal Studies (IFS), said \"any move in the wrong direction\" for the economy before the next fiscal event would \"almost certainly spark more tax rises\". 'Sting in the tail' in chancellor's plans - politics latest Speaking the morning after she delivered her spending review, which sets government budgets until 2029, Ms Reeves told Wilfred Frost hiking taxes wasn't inevitable. \"Everything I set out yesterday was fully costed and fully funded,\" she told Sky News Breakfast. Her plans - which include £29bn for day-to-day NHS spending, £39bn for affordable and social housing, and boosts for defence and transport - are based on what she set out in October's budget. That budget, her first as chancellor, included controversial tax hikes on employers and increased borrowing to help public services.  Chancellor won't rule out tax rises The Labour government has long vowed not to raise taxes on \"working people\" - specifically income tax, national insurance for employees, and VAT. Ms Reeves refused to completely rule out tax rises in her next budget, saying the world is \"very uncertain\". The Conservatives have claimed she will almost certainly have to put taxes up, with shadow chancellor Mel Stride accusing her of mismanaging the economy. Taxes on businesses had \"destroyed growth\" and increased spending had been \"inflationary\", he told Sky News. New official figures showed the economy contracted in April by 0.3% - more than expected. It coincided with Donald Trump imposing tariffs across the world. Ms Reeves admitted the figures were \"disappointing\" but pointed to more positive figures from previous months. Read more:Chancellor running out of levers to pullGrowth stats make for unpleasant readingYour spending review questions answered  'Sting in the tail' She is hoping Labour's plans will provide more jobs and boost growth, with major infrastructure projects \"spread\" across the country - from the Sizewell C nuclear plant in Suffolk, to a rail line connecting Liverpool and Manchester. But the IFS said further contractions in the economy, and poor forecasts from the Office for Budget Responsibility, would likely require the chancellor to increase the national tax take once again. It said her spending review already accounted for a 5% rise in council tax to help local authorities, labelling it a \"sting in the tail\" after she told Sky's Beth Rigby that it wouldn't have to go up."
    },
    {
        "title": "Trump tariffs a big factor - but latest UK economic performance makes for unpleasant reading",
        "description": "Economists suspected that the comfortable growth enjoyed at the beginning of the year might prove to be short-lived, and they appear to be right.",
        "url": "https://news.sky.com/story/trump-tariffs-a-big-factor-but-latest-uk-economy-performance-makes-for-unpleasant-reading-13382463",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-downing-street_6939449.jpg?20250611152956",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-06-12 07:32:00",
        "Headline": "Now temporary growth has faded away, the better gauge of the economy makes for unpleasant reading. The UK is being hobbled by low growth and high taxes, with the two reinforcing each other.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n Economists suspected that the comfortable growth enjoyed at the beginning of the year might prove to be short-lived, and they appear to be right. After expanding by 0.7% in the first quarter of the year, output struggled at the start of the second quarter, shrinking by 0.3% in April. The damp performance is likely to continue, with economists expecting a 0.1% decline over the second quarter. The dashboard is flashing warning signs. The economic data for the start of the year was flattered by people bringing forward house purchases to beat the stamp duty holiday deadline as well as businesses racing to get orders out of the door to beat possible US tariffs. Now that those temporary factors have faded away, we can better gauge the state of the economy. It makes for unpleasant reading. A hobbled economy \n                  Rachel Reeves 'a gnat's whisker' from having to raise taxes, says IFS\n                 \n                  Economy shock overshadows Reeves' big day\n                 \n                  Spending review: Treasury minister Emma Reynolds tells Sky News she is 'not ruling out' tax rises in the autumn\n                 We are still being hobbled by low growth and high taxes, and the two are reinforcing each other. In a more detailed breakdown, the ONS revealed that the services sector shrank by 0.4%. Although economists were expecting consumer spending to hold up, businesses are gripped by a crisis of confidence, with higher national insurance contributions forcing them to put up prices. This led to a drop in sales. At the same time, the legal sector also came crashing down to earth following a drop in house purchases.  Consumers have less space than usual to absorb price rises, with utility bills on the up and general inflation proving persistent. Taxes are already at a generational high, and they could go higher if the economy disappoints. The Chancellor Rachel Reeves's headroom against her fiscal rule is tight, with debt interest payments on the country's debt eating into her room for manoeuvre. A Reeves or a Trump problem? The chancellor today pointed to factors outside of her control, hinting towards President Trump's tariff policy. Most of Britain's problems are domestic ones - high government borrowing costs, rising cost of living pressures and higher taxation, but geopolitical forces have also conspired against us. The production sector, which captures manufacturing, fell by 0.6%. This was driven by a 9.5% drop in the manufacturing of cars, with industry groups warning of a slump in export orders after Trump's imposition of industry-wide tariffs at the end of March. British officials are hopeful that the US will start lifting car tariffs this week after a deal was struck back in May, but it still hangs in the balance. Even then, a new quota limits the scope for companies to grow in the US market. That's bad news for the likes of JLR, the maker of Jaguars and Land Rovers. All this matters for a chancellor with a historically small fiscal headroom. Even small changes in the growth outlook could derail her plans, forcing further tax rises to pay for her spending plans. She is betting big on investment in infrastructure- trains, nuclear power, social housing - but it could take many years for that to pay dividends, if it pays dividends at all. In the meantime, the debt continues to grow as she borrows to fund those projects, putting further pressure on her budget to cover the interest payments alone. It's a painful feedback loop for the economy."
    },
    {
        "title": "Economy shock overshadows Reeves' big day",
        "description": "Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics.",
        "url": "https://news.sky.com/story/economy-shock-overshadows-reeves-big-day-13382403",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-12 05:15:00",
        "Headline": "No subtitle found",
        "Content": "Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. Rachel Reeves has said this morning that the latest figures showing the UK economy has shrunk by more than expected are \"disappointing\". How much will this overshadow yesterday's major spending announcement? The chancellor has now planted Labour's fiscal flag in the sand - and spending mistakes from here on in certainly cannot be blamed on their predecessors. How will Labour react to a potential internal revolt over disability benefit cuts? And how will the party manage the politics around expected tax rises in the autumn?"
    },
    {
        "title": "Video game actor strike ends in US - but AI described as 'direct threat' to UK industry",
        "description": "Video game actors in the US have ended their strike after nearly a year of industrial action, over the use of artificial intelligence by game studios.&#160;",
        "url": "https://news.sky.com/story/video-game-actor-strike-ends-in-us-but-ai-described-as-direct-threat-to-uk-industry-13382550",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-video-game-actor-strike_6939978.jpg?20250612105738",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-12 09:42:00",
        "Headline": "Earlier this week, the British Film Institute (BFI) released a report detailing the risks posed by AI to the UK screen sector, including games, and described it as a \"direct threat\".",
        "Content": "\n          Science and Technology reporter\n       Video game actors in the US have ended their strike after nearly a year of industrial action, over the use of artificial intelligence by game studios.  More than 2,500 US performers were barred from working on games impacted by the strike while the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA) negotiated a deal with studios. Now, after more than 11 months of discussions, a \"tentative\" agreement has been reached. \"Patience and persistence has resulted in a deal that puts in place the necessary AI guardrails that defend performers' livelihoods in the AI age, alongside other important gains,\" said SAG-AFTRA's national executive director Duncan Crabtree-Ireland. Actors were banned from working with major game makers like Activision, Blindlight, Disney Character Voices, Electronic Arts, Epic Games, Formosa, Insomniac Games, Take 2 and WB Games. Other studios were also impacted by the strike, as actors took industrial action in solidarity. \"We are pleased to have reached a tentative contract agreement that reflects the important contributions of SAG-AFTRA-represented performers in video games,\" said Audrey Cooling, spokesperson for the video game producers, to Sky News. \n                  Did ChatGPT get the spending review right? Treasury minister gives his verdict\n                 \n                  Powerful new supercomputer to be built in Scotland in government U-turn\n                 \n                  Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts\n                 \"It delivers historic wage increases of over 24% for performers, enhanced health and safety protections, and industry-leading AI provisions requiring transparency, consent and compensation for the use of digital replicas in games.\" In the UK, actors protested in solidarity with their American counterparts, while Equity, the UK actors' union, called for a similar wide-reaching agreement between UK studios and actors. Earlier this week, the British Film Institute (BFI) released a report detailing the risks posed by AI to the UK screen sector, including video games, and described it as a \"direct threat\". Read more from Sky News:Powerful new supercomputer to be built in government U-turn'Trump's anti-migrant rhetoric boosting UK's tech industry'Number of Nintendo Switch 2s sold in four days revealed The scripts of more than 130,000 films and TV shows, YouTube videos, and databases of pirated books have been used to train AI models, according to the report. AI poses a particular threat to some video game voice actors, according to one expert, because of the nature of their work creating animal or monster sound effects. \"The generic stuff is the easiest thing for generative AI to replace,\" Video Games Industry Memo author George Osborn told Sky News previously. \"Just saying to the model, 'make 200 monster noises' is much easier than convincingly [making AI] sound like it is having a conversation with someone,\" he said. Unlike the SAG-AFTRA actors' strike in 2023, which saw blockbusters like Deadpool 3 and Gladiator 2 delayed and entire TV series cancelled, huge delays to games were unlikely. Games take years to make and any game already in development before September 2023 was exempt from the strike. Tensions have risen in the game actor community since the industrial action began, as studios appeared to hire international actors to replace the striking US workers."
    },
    {
        "title": "Video game actor strike ends in US - but AI described as 'direct threat' to UK industry",
        "description": "Video game actors in the US have ended their strike after nearly a year of industrial action, over the use of artificial intelligence by game studios.&#160;",
        "url": "https://news.sky.com/story/video-game-actor-strike-ends-in-us-but-ai-described-as-direct-threat-to-uk-industry-13382550",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-video-game-actor-strike_6939978.jpg?20250612105738",
        "type": "Entertainment",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-12 09:42:00",
        "Headline": "Earlier this week, the British Film Institute (BFI) released a report detailing the risks posed by AI to the UK screen sector, including games, and described it as a \"direct threat\".",
        "Content": "\n          Science and Technology reporter\n       Video game actors in the US have ended their strike after nearly a year of industrial action, over the use of artificial intelligence by game studios.  More than 2,500 US performers were barred from working on games impacted by the strike while the Screen Actors Guild-American Federation of Television and Radio Artists (SAG-AFTRA) negotiated a deal with studios. Now, after more than 11 months of discussions, a \"tentative\" agreement has been reached. \"Patience and persistence has resulted in a deal that puts in place the necessary AI guardrails that defend performers' livelihoods in the AI age, alongside other important gains,\" said SAG-AFTRA's national executive director Duncan Crabtree-Ireland. Actors were banned from working with major game makers like Activision, Blindlight, Disney Character Voices, Electronic Arts, Epic Games, Formosa, Insomniac Games, Take 2 and WB Games. Other studios were also impacted by the strike, as actors took industrial action in solidarity. \"We are pleased to have reached a tentative contract agreement that reflects the important contributions of SAG-AFTRA-represented performers in video games,\" said Audrey Cooling, spokesperson for the video game producers, to Sky News. \n                  Did ChatGPT get the spending review right? Treasury minister gives his verdict\n                 \n                  Powerful new supercomputer to be built in Scotland in government U-turn\n                 \n                  Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts\n                 \"It delivers historic wage increases of over 24% for performers, enhanced health and safety protections, and industry-leading AI provisions requiring transparency, consent and compensation for the use of digital replicas in games.\" In the UK, actors protested in solidarity with their American counterparts, while Equity, the UK actors' union, called for a similar wide-reaching agreement between UK studios and actors. Earlier this week, the British Film Institute (BFI) released a report detailing the risks posed by AI to the UK screen sector, including video games, and described it as a \"direct threat\". Read more from Sky News:Powerful new supercomputer to be built in government U-turn'Trump's anti-migrant rhetoric boosting UK's tech industry'Number of Nintendo Switch 2s sold in four days revealed The scripts of more than 130,000 films and TV shows, YouTube videos, and databases of pirated books have been used to train AI models, according to the report. AI poses a particular threat to some video game voice actors, according to one expert, because of the nature of their work creating animal or monster sound effects. \"The generic stuff is the easiest thing for generative AI to replace,\" Video Games Industry Memo author George Osborn told Sky News previously. \"Just saying to the model, 'make 200 monster noises' is much easier than convincingly [making AI] sound like it is having a conversation with someone,\" he said. Unlike the SAG-AFTRA actors' strike in 2023, which saw blockbusters like Deadpool 3 and Gladiator 2 delayed and entire TV series cancelled, huge delays to games were unlikely. Games take years to make and any game already in development before September 2023 was exempt from the strike. Tensions have risen in the game actor community since the industrial action began, as studios appeared to hire international actors to replace the striking US workers."
    }
]