[
    {
        "title": "Israeli embassy 'deeply disturbed' by Bob Vylan's 'death to the IDF' Glastonbury chant",
        "description": "The Israeli embassy has said it's \"deeply disturbed\" by chants of \"death to the IDF\" at Glastonbury - as police also investigate the incident.",
        "url": "https://news.sky.com/story/israeli-embassy-deeply-disturbed-by-bob-vylans-death-to-the-idf-glastonbury-chant-13389912",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952844.jpg?20250628213421",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 20:28:00",
        "Headline": "The government and the Tories have condemned the outburst - which happened in front of thousands at the festival's West Holts Stage.",
        "Content": " The Israeli embassy has said it's \"deeply disturbed\" by chants of \"death to the IDF\" at Glastonbury - as police also investigate the incident. Video shows one of the members of Bob Vylan shouting the slogan into the mic and some of the crowd joining in. The duo were performing ahead of a performance by Kneecap, the Irish act who the prime minister said should be ditched from the line-up. \"The Embassy of Israel in the United Kingdom is deeply disturbed by the inflammatory and hateful rhetoric expressed on stage at the Glastonbury Festival,\" a statement said. It said slogans like Saturday's chant \"advocate for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" Avon and Somerset Police said they are looking at whether a criminal offence was committed. Bob Vylan also performed in front of a screen quoting a claim that Israel's actions in Gaza amount to genocide. Culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what due diligence it carried out into Bob Vylan. A spokesman said the government strongly condemned the \"threatening comments\" by the group, whose X bio describes them as a \"punk/rap/alt thing\". A BBC statement said: \"Some of the comments made during Bob Vylan's set were deeply offensive. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. \"We have no plans to make the performance available on demand.\" Tory leader Kemi Badenoch re-posted a clip of the incident and called it \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Read more:Kneecap rapper tells Glastonbury he's a 'free man'Lewis Capaldi plays 'secret' set at GlastonburyRobbie Williams addresses Glastonbury rumours A statement from Glastonbury Festival said it \"does not condone hate speech or incitement to violence of any kind from its performers\". Irish group Kneecap followed Bob Vylan - with the broadcaster not carrying their performance live amid concern over what they might do or say. However, it's understood their show will be made available on demand after a review. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of proscribed terror group Hezbollah at a gig. Bandmate Naoise O Caireallain told the packed Glastonbury crowd they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for Saturday's set and told fans he was a \"free man\"."
    },
    {
        "title": "Girl, 7, dies after tree collapses at park in Southend",
        "description": "One girl has died and another is in a critical condition after a tree partially collapsed at a park in Essex.",
        "url": "https://news.sky.com/story/two-children-in-hospital-after-tree-falls-in-park-13389774",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chalkwell-park-essex_6952763.png?20250628175621",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 13:07:00",
        "Headline": "The girls, aged seven and six, suffered serious injuries when they were among a number of children caught beneath the tree at Chalkwell Park in Southend.",
        "Content": "One girl has died and another is in a critical condition after a tree partially collapsed at a park in Essex. The girls, aged seven and six, suffered serious injuries when they were among a number of children caught beneath the tree at Chalkwell Park in Southend. Essex Police confirmed the seven-year-old girl died in hospital and her family is receiving support from specialist officers. Three other children suffered minor injuries following the incident. An East of England Ambulance Service spokesperson said: \"We were called at 2.55pm to reports that a tree had fallen in Chalkwell Park in Chalkwell. \"Six ambulances, three ambulance officer vehicles, the London Air Ambulance and Kent Air Ambulance were sent to the scene.\" Police said an investigation is continuing into what caused the tree to collapse. 'Unimaginable hardship' for families Chief Superintendent Leighton Hammett said: \"Families are facing unimaginable hardship this evening and all of our thoughts are with them at this time. \"I cannot begin to put into words how difficult today's events have been, and continue to be, for them. \"It's also not lost on me how traumatic it must have been for the members of the public who witnessed this awful incident. \"Across a matter of moments, many of them went from enjoying the warm summer weather to rushing to the aid of strangers without a second thought.\" Chief Sup Hammett also paid tribute to police, ambulance and fire crews who \"did all they could,\" adding that \"today's loss is one they will all take personally\". Read more from Sky News:Hundreds of NHS quangos to be axedAmber health heat alert issuedBGT star on dealing with body dysmorphia Death is 'truly devastating' Local MP David Burton-Sampson said: \"The news of the sad death of one of the children involved in the incident at Chalkwell Park today is truly devastating. \"I am sure I reflect the thoughts of all our residents here in Southend in sending my deepest condolences to the child's family and friends. \"My thoughts are also with the other children injured and I wish them a full and speedy recovery.\" "
    },
    {
        "title": "Fixing welfare a 'moral imperative', Starmer says, after government U-turn",
        "description": "Sir Keir Starmer has said fixing the UK's welfare system is a \"moral imperative\" after the government's U-turn.",
        "url": "https://news.sky.com/story/fixing-welfare-a-moral-imperative-starmer-says-after-government-u-turn-13389651",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-labour_6952434.jpg?20250628115442",
        "type": "Home",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-28 09:04:00",
        "Headline": "Speaking at Welsh Labour's annual conference in Llandudno, the prime minister says \"everyone agrees that our welfare system is broken\".",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n  Sir Keir Starmer has said fixing the UK's welfare system is a \"moral imperative\" after the government's U-turn. The prime minister faced a significant rebellion over plans to cut sickness and disability benefits as part of a package he said would shave £5bn off the welfare bill and get more people into work. The government has since offered concessions ahead of a vote in the Commons on Tuesday, including exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Speaking at Welsh Labour's annual conference in Llandudno, North Wales, on Saturday, Sir Keir said: \"Everyone agrees that our welfare system is broken, failing people every day. \"Fixing it is a moral imperative, but we need to do it in a Labour way, conference, and we will.\" First minister Eluned Morgan said the Welsh government had been \"really concerned about the impact\" about the proposed changes, and told Sky News she was \"really pleased\" that he had listened. \"It was my duty to speak out as the Labour leader in Wales for those communities, for the people who are going to be impacted. And I am really pleased that the prime minister did listen,\" she said. \"Yes, he heard his Labour backbenchers. But our letter arrived just at the same time, so I like to think that we had an influence as well.\"  Sir Keir also warned of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections. He said such a deal would mark a \"return to the chaos and division of the last decade\". But opposition parties have hit back at the prime minister's \"imaginary coalitions\", with Plaid Cymru accusing Labour of \"scraping the barrel\". Reform UK said the NHS \"isn't safe in Labour's hands\" and people are \"left waiting in pain\" while ministers \"make excuses\". Voters in Wales will head to the polls next May and recent polls suggest Labour are in third place, behind Reform and Plaid. Labour have been the largest party at every Senedd election since devolution began in 1999. Conservative Party leader Kemi Badenoch has not ruled out making deals with Plaid Cymru or Reform at the Senedd election. Wales reporter Don't Stop Me Now - that was the soundtrack to Eluned Morgan’s arrival on stage.\n And that's her hope, the first minister who has \"no intention of being stopped\". But with the polls suggesting Labour could fall to third place at next year's Senedd election, there's a very real chance that decision could be taken out of her hands. The conference comes in a week where the UK government has made a U-turn on controversial welfare reforms. Those changes would have seen Wales, which has a higher number of people reliant on disability benefits, affected more than other parts of the UK. Baroness Morgan previously called out the plans but says the U-turn shows that Starmer is listening to her government's calls. Outside the building, others wanted to make their own voices heard, including farmers opposing the controversial changes to inheritance tax. Their hope is that one government U-turn will open the door to another. At the conference, the prime minister was joined on stage by Wales Secretary Jo Stevens, Baroness Morgan and deputy leader of Welsh Labour Carolyn Harries. He described Baroness Morgan as a \"fierce champion for Wales\" and \"the best person to lead Wales into the future\". Sir Keir said the £80m transition board to support Port Talbot steelworkers after the closure of the plant's blast furnaces was a result of \"two Labour governments working together for the people of Wales\". Read more:This has been the PM's most damaging U-turn yet Is Starmer at the mercy of his MPs? He described Nigel Farage as a \"wolf in Wall Street clothing\" who has \"no idea what he's talking about\" on the issue. The PM said the Reform UK leader \"isn't interested in Wales\" and has no viable plan for the blast furnaces at Port Talbot. \"When you ask him about Clacton, he thinks he's running in the 2.10 at Ascot,\" Sir Keir joked. \"He's a wolf in Wall Street clothing.\" Mr Farage has said his party wants to restart the blast furnaces at Port Talbot. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The first minister was introduced to the stage by former Wales rugby captain Ken Owens. In his introduction, he said: \"Being captain is so much more than leading a team, it's about carrying a nation.\" The first minister said the next Senedd election will be \"a moment of reckoning\" for the nation. \"I've got a nation to fight for, and I don't intend to lose,\" she added. Around 20 tractors were parked on the promenade in Llandudno ahead of the speech, as farmers gathered outside the conference to stage a protest. Later, around 200 people staged a pro-Palestine demonstration - with about a dozen counter-protesters also there."
    },
    {
        "title": "Thousands defy ban to join Pride march in Budapest",
        "description": "If Hungary's authorities thought banning this year's Pride march would keep people off the streets, they were wrong.",
        "url": "https://news.sky.com/story/thousands-defy-ban-to-join-pride-march-in-budapest-13389870",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pride-budapest-hungary_6952786.jpg?20250628185758",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-06-28 17:22:00",
        "Headline": "Hungarians had been warned they risked a 500 euro fine if they attended the march, and police would use facial recognition cameras to identify them. But they didn't care.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  If Hungary's authorities thought banning this year's Pride march would keep people off the streets, they were wrong. Thousands turned out in Budapest, defying a law which said LGBTQ+ events like this should be cancelled to protect children. The crowd was determined to fight for their rights. \"This is a special march, not just because it was the 30th, but also because it was banned,\" said Orsi, who proudly wore a rainbow headband and waved a rainbow flag. \"I mean that's all the more reason to go out on the street and show that Budapest and Hungary is a place where everybody is welcome, where love is equal,\" she added. Attendees had been warned that just being there could mean a 500 euro fine or prison time for the organisers. They were told police would use facial recognition cameras to identify them, but they didn't care. \n                  Hungary suggests foot-and-mouth outbreak could be 'biological attack'\n                 \n                  Hungary says it will withdraw from International Criminal Court as Benjamin Netanyahu arrives on its soil despite arrest warrant\n                 \n                  Agnes Keleti: Holocaust survivor and oldest living Olympic medallist dies at the age of 103\n                 Orsi said it was worth a fine. Leonas had travelled from Poland to show his support and was also happy to take the risk. \"LGBT rights are attacked across the whole world, and we need to defend each other and work with each other,\" he said. Viktor Orban's government has repeatedly pitched family values against LGBTQ+ rights. \"The mother is a woman, the father is a man and leave our kids alone,\" he told conservative audiences in the past. He says he is protecting Hungary's Christian values, but critics say this is just part of a wider attack on democracy which has happened during his 15 years in control. The Pride ban is just the latest targeting of LGBTQ+ communities. In 2020, the country abolished its legal recognition of transgender people, and in 2021, politicians passed a law banning the depiction of homosexuality to under-18s. While many were outraged by the attempt to cancel the Pride march, a small number of far-right activists organised demonstrations to show their support: \"Hungary and the Hungarian nation don't want the aggressive LGBTQ+ propaganda. They are dangerous for our families, they are dangerous for our kids,\" said Gabor Kelemen, a member of the 64 Counties Youth Movement. However, the packed streets showed many disagree. At one point, as far as the eye could see, the march snaked through streets and across the city's bridges. The sound of drums and whistles mixing with gay anthems blaring out of speakers. The organisers said they believed this will be the largest Pride march ever in Budapest. Read more from Sky News:Tom Daley says LGBT rights 'threatened'Thailand legalises same-sex marriagePride celebrations in New Delhi The crowd was eclectic, with Hungarians from different communities joining a demonstration which many believe is now part of a fight for Hungary's future. \"This is not only about the complexity of Pride, not only about love or equality... for Hungarians, it's about sticking together, supporting each other, showing the government that we believe in a different kind of Hungary. We believe in freedom, we believe in democracy,\" said activist Adam Kanicsar. Despite the ban, today Pride attendees were celebrating a victory. But make no mistake, many in Hungary do not support the parade or what they see as an attack on traditional values. Next year, the country will hold a general election, a vote which will expose how divided Hungary really is."
    },
    {
        "title": "At least 72 killed in Israeli strikes across Gaza, health staff say",
        "description": "At least 72 people have been killed in Israeli strikes across Gaza, health staff have said.",
        "url": "https://news.sky.com/story/at-least-60-killed-in-israeli-strikes-across-gaza-health-staff-say-13389711",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-israel-strikes_6952514.jpg?20250628133943",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 12:06:00",
        "Headline": "The strikes across Friday and Saturday came as US President Donald Trump said there could be a ceasefire agreement within the next week.",
        "Content": " At least 72 people have been killed in Israeli strikes across Gaza, health staff have said. A dozen people were killed near the Palestine Stadium in Gaza City, which was sheltering displaced people, along with eight more living in apartments, according to staff at Shifa hospital, where the bodies were brought. Six others were killed in southern Gaza when a strike hit their tent in Muwasi, according to the hospital. Follow latest: 'Death to America' chants in Tehran The strikes, which began late on Friday and continued into Saturday morning, came as US President Donald Trump said there could be a ceasefire agreement within the next week. \"We're working on Gaza and trying to get it taken care of,\" he told reporters in the Oval Office on Friday. Ron Dermer, Israel's minister for strategic affairs, will arrive in Washington next week for talks on Gaza's ceasefire, Iran and other subjects, an official told the Associated Press on condition of anonymity. The last ceasefire agreed back in mid-January ended in March.  The war in Gaza was sparked after Hamas launched its attack on Israel in October 2023, killing some 1,200 people, mostly civilians, and abducting 251 people. Some 50 hostages remain in Gaza, with fewer than half of them still believed to be alive. More than 56,000 Palestinians have been killed during the war, according to Gaza's Hamas-run health ministry, which does not distinguish between civilians and combatants. Read more from Sky News:Truth about success of US strikes on Iran lies deep undergroundFury of helicopter crash victim's son over sealed documents The UN has also warned that people in Gaza are \"starving\", with Israel allowing a trickle of supplies into the territory since mid-May after blocking all food for more than two months.  Palestinians have been shot at and killed while on their way to get food at aid sites, according to Gaza's health officials and witnesses. Israel's military said it was investigating incidents in which civilians had been harmed while approaching the sites."
    },
    {
        "title": "England beat Germany in final to retain U21 European Championship title",
        "description": "England have beaten Germany 3-2 in the Under-21s European Championship final after a thrilling match in Slovakia.",
        "url": "https://news.sky.com/story/england-beat-germany-in-final-to-retain-u21-european-championship-title-13389868",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-england-germany-euro_6952878.jpg?20250628225711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 17:17:00",
        "Headline": "Goals from Harvey Elliott, Omari Hutchinson and Jonathan Rowe handed Lee Carsley's side a 3-2 win over Germany in Slovakia.",
        "Content": "England have beaten Germany 3-2 in the Under-21s European Championship final after a thrilling match in Slovakia. Lee Carsley's side were defending champions and led 2-0 after just 25 minutes, but Germany forced the game into extra-time with goals either side of half-time. Marseille forward Jonathan Rowe then grabbed the winner with his first touch two minutes after being introduced, putting England's name on the trophy for the second tournament running. Liverpool's Harvey Elliott gave the Young Lions a dream start in Bratislava, opening the scoring inside five minutes with a composed finish into the bottom corner. Omari Hutchinson doubled England's lead midway through the first half, driving the ball through the legs of German goalkeeper Noah Atubolu after neat work from captain James McAtee in the build-up. Carsley's side threatened to put the game out of sight when Hutchinson bent an effort narrowly wide after half an hour. But they were pegged back on the stroke of half-time when Nelson Weiper's powerful header flew past James Beadle in the England goal to make it 2-1. \n                  Jess Fishlock: Mural of Wales star unveiled in 'European first'\n                 \n                  Former England boss Gareth Southgate receives knighthood\n                 \n                  Wales announce squad for women's Euros\n                 Read more from Sky News:Thousands defy ban to join Pride march in BudapestTwo more arrests over damage to aircraft at RAF baseHundreds of NHS quangos to be axed Germany committed more bodies forward after the restart in search of an equaliser and deservedly found it on the hour mark. Paul Nebel was afforded too much space in the England box and curled home via a slight deflection. Carsley recognised the need for fresh legs after the game went to extra-time and his decision to bring on Marseille's Jonathan Rowe paid off immediately. The former Norwich City man caught the Germany defence sleeping as he got on the end of Tyler Morton's cross and headed home with what was his first touch of the game. It ended up being the crucial goal that retained the title the Young Lions won against Spain in Georgia two years ago. The victory against England's old rival came just 10 days after they lost 2-1 in the same fixture during the tournament's group stages."
    },
    {
        "title": "Two more people arrested over damage to aircraft at RAF base",
        "description": "Two more people have been arrested on suspicion of a terror offence after two aircraft were vandalised at RAF Brize Norton in Oxfordshire.",
        "url": "https://news.sky.com/story/two-more-people-arrested-over-damage-to-aircraft-at-raf-base-13389916",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brize-plane_6946806.jpg?20250627113358",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 20:44:00",
        "Headline": "Palestine Action has claimed responsibility for damage to two aircraft at RAF Brize Norton in Oxfordshire on 20 June. Sir Keir Starmer condemned the \"act of vandalism\" as \"disgraceful\".",
        "Content": " Two more people have been arrested on suspicion of a terror offence after two aircraft were vandalised at RAF Brize Norton in Oxfordshire. Counter Terrorism Policing South East said the men, aged 22 and 24 and both from London, were arrested on Saturday afternoon on suspicion of the commission, preparation or instigation of acts of terrorism, contrary to Section 41 of the Terrorism Act 2000. On Thursday, police said a woman, aged 29 of no fixed address, and two men, aged 36 and 24 from London, had been taken into police custody after the incident at RAF Brize Norton on 20 June. A 41-year-old woman, of no fixed address, was also arrested on suspicion of assisting an offender, they previously said. Read more: What does proscription mean?Palestine Action supporters defiant as group faces banThe 'enemy within' or non-violent protesters? The group posted a video online claiming it was behind the vandalism at the Oxfordshire airbase last Friday, saying activists had damaged two military planes at the base. Palestine Action - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\".  Repurposed fire extinguishers were used to spray red paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. \"Red paint, symbolising Palestinian bloodshed was also sprayed across the runway and a Palestine flag was left on the scene,\" a statement by the group said. Brize Norton is the largest RAF station, with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. A security review was launched across the \"whole defence estate\" following the breach, which was condemned as \"absolutely staggering\" by Ben Obese-Jecty, a Tory MP and former Army officer. Sir Keir Starmer condemned the \"act of vandalism\" as \"disgraceful\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" Home Secretary Yvette Cooper said on Monday that Palestine Action will be proscribed as a terrorist organisation following the breach at RAF Brize Norton. She said a draft proscription order will be laid in parliament next week, and if passed, it will make it illegal to be a member of, or invite support for, Palestine Action."
    },
    {
        "title": "Carrie Johnson admitted to hospital over 'severe dehydration'",
        "description": "Carrie Johnson - the wife of former prime minister Boris Johnson - has revealed she was admitted to hospital with severe dehydration, as she offered advice to other breastfeeding mothers in the hot weather.",
        "url": "https://news.sky.com/story/carrie-johnson-admitted-to-hospital-over-severe-dehydration-13389681",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-boris-johnson-carrie-johnson_6215407.jpg?20250628123452",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 10:39:00",
        "Headline": "Boris Johnson's wife posted a picture of herself and her newborn daughter in a hospital bed - and offered advice to other \"breastfeeding mums\".",
        "Content": "Carrie Johnson - the wife of former prime minister Boris Johnson - has revealed she was admitted to hospital with severe dehydration, as she offered advice to other breastfeeding mothers in the hot weather. Mrs Johnson, 37, posted a picture of herself and her newborn daughter Poppy Eliza Josephine on Friday in a hospital bed. \"Being hospitalised for two nights for severe dehydration was not on my postpartum bingo card,\" she captioned the Instagram post. Mrs Johnson urged other \"breastfeeding mums\" to make sure they eat and drink enough \"in this heat\", especially those who are \"clusterfeeding\". Poppy was born on 21 May, becoming the couple's fourth child after their son Frank, born in July 2023, daughter Romy, born in December 2021, and son Wilfred, born in April 2020. In a separate Instagram story, Mrs Johnson described an \"honestly brutal week\". \"Mastitis (me), reflux (her), dehydration (me). What a pair we are!,\" she said. \"But thank you for all the kind messages, especially all the brilliant advice on reflux. Really appreciate it and made me feel way less alone going thru (sic) it all. And as ever, thanks to our amazing NHS.\" Read more from Sky News:Hundreds of NHS quangos to be axed'Most effective' protection to avoid sunburn (and it isn't suncream) The NHS recommends drinking plenty of fluids while breastfeeding - and avoiding caffeine and alcohol to stop their effects being passed on to the baby. Having a drink nearby when mothers stop to feed is advised, as is water, lower-fat milk, and low-sugar drinks. The UK Health Security Agency (UKHSA) has issued an amber heat health alert for the next four days. Although not a public weather warning, it advises health and social care organisations of possible dangers to their patients and facilities. Temperatures could reach 34C on Monday - with a 20% chance of beating the hottest June day on record of 35.6C from 1976. The likelihood of record-breaking temperatures could increase over the weekend as the day approaches."
    },
    {
        "title": "Chants of 'death to America' at funeral for Iranian military commanders and scientists",
        "description": "Thousands of people have taken to the streets of Tehran to mourn top military commanders, nuclear scientists and others killed in Iran's 12-day war with Israel.",
        "url": "https://news.sky.com/story/chants-of-death-to-america-at-funeral-for-iranian-military-commanders-and-scientists-13389648",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-iran-funeral_6952372.jpg?20250628101905",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-28 08:58:00",
        "Headline": "Thousands of people lined the streets of capital Tehran as coffins were driven on trucks. ",
        "Content": " Thousands of people have taken to the streets of Tehran to mourn top military commanders, nuclear scientists and others killed in Iran's 12-day war with Israel. State-run Press TV said the event - dubbed the \"funeral procession of the Martyrs of Power\" - was held for 60 people, including four women and four children. It said at least 16 scientists and 10 senior commanders were among the dead, including head of the Revolutionary Guard General Hossein Salami and the head of the guard's ballistic missile programme, General Amir Ali Hajizadeh. Their coffins were driven to Azadi Square on trucks adorned with their pictures as well as rose petals and flowers, as crowds waved Iranian flags. Chants of \"death to America\" and \"death to Israel\" could be heard. Attending the funeral were Iranian President Masoud Pezeshkian and other senior figures, including Ali Shamkhani who was seriously wounded during the fighting and is an adviser to Iran's supreme leader. There was no immediate sign of the supreme leader in the state broadcast of the funeral. Iran's president later thanked people for turning out. \"From the bottom of my heart, I thank you dear people,\" Mr Pezeshkian wrote on social media. \"With love, you bid farewell to the martyrs of our homeland, and our voice of unity reached the ears of the world.\" Iranian foreign minister Abbas Araghchi called the deaths \"hard and painful\". Seemingly referencing the recent airstrikes, he added: \"Institutions and structures, however important and valuable, return with new glory and greater strength over time, even if it takes years.\" Israel, the only Middle Eastern country widely believed to have nuclear weapons, said its attacks on Iran aimed to prevent Tehran from developing its own nuclear weapons. The US joined in by launching strikes on three nuclear enrichment sites in Iran, which Donald Trump said left them \"obliterated\", however the exact extent of the damage remains unclear. Iran denies having a nuclear weapons programme and the UN nuclear watchdog, which carries out inspections in Iran, has said it has \"no credible indication\" of an active, coordinated weapons project.  Over almost two weeks of fighting, Israel claimed it killed around 30 Iranian commanders and 11 nuclear scientists, before a ceasefire began on Tuesday. Read more from Sky News:Truth about airstrikes on Iran lies deep undergroundFury of helicopter crash victim's son over documents 'sealed for 100 years' According to Iranian health ministry figures, 610 people were killed, 13 of whom were children and 49 were women. Israel's health ministry said 28 people were killed there in Iranian attacks - with 3,238 injured."
    },
    {
        "title": "Girl, 7, dies after tree collapses at park in Southend",
        "description": "One girl has died and another is in a critical condition after a tree partially collapsed at a park in Essex.",
        "url": "https://news.sky.com/story/two-children-in-hospital-after-tree-falls-in-park-13389774",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chalkwell-park-essex_6952763.png?20250628175621",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-28 13:07:00",
        "Headline": "The girls, aged seven and six, suffered serious injuries when they were among a number of children caught beneath the tree at Chalkwell Park in Southend.",
        "Content": "One girl has died and another is in a critical condition after a tree partially collapsed at a park in Essex. The girls, aged seven and six, suffered serious injuries when they were among a number of children caught beneath the tree at Chalkwell Park in Southend. Essex Police confirmed the seven-year-old girl died in hospital and her family is receiving support from specialist officers. Three other children suffered minor injuries following the incident. An East of England Ambulance Service spokesperson said: \"We were called at 2.55pm to reports that a tree had fallen in Chalkwell Park in Chalkwell. \"Six ambulances, three ambulance officer vehicles, the London Air Ambulance and Kent Air Ambulance were sent to the scene.\" Police said an investigation is continuing into what caused the tree to collapse. 'Unimaginable hardship' for families Chief Superintendent Leighton Hammett said: \"Families are facing unimaginable hardship this evening and all of our thoughts are with them at this time. \"I cannot begin to put into words how difficult today's events have been, and continue to be, for them. \"It's also not lost on me how traumatic it must have been for the members of the public who witnessed this awful incident. \"Across a matter of moments, many of them went from enjoying the warm summer weather to rushing to the aid of strangers without a second thought.\" Chief Sup Hammett also paid tribute to police, ambulance and fire crews who \"did all they could,\" adding that \"today's loss is one they will all take personally\". Read more from Sky News:Hundreds of NHS quangos to be axedAmber health heat alert issuedBGT star on dealing with body dysmorphia Death is 'truly devastating' Local MP David Burton-Sampson said: \"The news of the sad death of one of the children involved in the incident at Chalkwell Park today is truly devastating. \"I am sure I reflect the thoughts of all our residents here in Southend in sending my deepest condolences to the child's family and friends. \"My thoughts are also with the other children injured and I wish them a full and speedy recovery.\" "
    },
    {
        "title": "Israeli embassy 'deeply disturbed' by Bob Vylan's 'death to the IDF' Glastonbury chant",
        "description": "The Israeli embassy has said it's \"deeply disturbed\" by chants of \"death to the IDF\" at Glastonbury - as police also investigate the incident.",
        "url": "https://news.sky.com/story/israeli-embassy-deeply-disturbed-by-bob-vylans-death-to-the-idf-glastonbury-chant-13389912",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952844.jpg?20250628213421",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-28 20:28:00",
        "Headline": "The government and the Tories have condemned the outburst - which happened in front of thousands at the festival's West Holts Stage.",
        "Content": " The Israeli embassy has said it's \"deeply disturbed\" by chants of \"death to the IDF\" at Glastonbury - as police also investigate the incident. Video shows one of the members of Bob Vylan shouting the slogan into the mic and some of the crowd joining in. The duo were performing ahead of a performance by Kneecap, the Irish act who the prime minister said should be ditched from the line-up. \"The Embassy of Israel in the United Kingdom is deeply disturbed by the inflammatory and hateful rhetoric expressed on stage at the Glastonbury Festival,\" a statement said. It said slogans like Saturday's chant \"advocate for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" Avon and Somerset Police said they are looking at whether a criminal offence was committed. Bob Vylan also performed in front of a screen quoting a claim that Israel's actions in Gaza amount to genocide. Culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what due diligence it carried out into Bob Vylan. A spokesman said the government strongly condemned the \"threatening comments\" by the group, whose X bio describes them as a \"punk/rap/alt thing\". A BBC statement said: \"Some of the comments made during Bob Vylan's set were deeply offensive. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. \"We have no plans to make the performance available on demand.\" Tory leader Kemi Badenoch re-posted a clip of the incident and called it \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Read more:Kneecap rapper tells Glastonbury he's a 'free man'Lewis Capaldi plays 'secret' set at GlastonburyRobbie Williams addresses Glastonbury rumours A statement from Glastonbury Festival said it \"does not condone hate speech or incitement to violence of any kind from its performers\". Irish group Kneecap followed Bob Vylan - with the broadcaster not carrying their performance live amid concern over what they might do or say. However, it's understood their show will be made available on demand after a review. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of proscribed terror group Hezbollah at a gig. Bandmate Naoise O Caireallain told the packed Glastonbury crowd they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for Saturday's set and told fans he was a \"free man\"."
    },
    {
        "title": "Fixing welfare a 'moral imperative', Starmer says, after government U-turn",
        "description": "Sir Keir Starmer has said fixing the UK's welfare system is a \"moral imperative\" after the government's U-turn.",
        "url": "https://news.sky.com/story/fixing-welfare-a-moral-imperative-starmer-says-after-government-u-turn-13389651",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-labour_6952434.jpg?20250628115442",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-28 09:04:00",
        "Headline": "Speaking at Welsh Labour's annual conference in Llandudno, the prime minister says \"everyone agrees that our welfare system is broken\".",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n  Sir Keir Starmer has said fixing the UK's welfare system is a \"moral imperative\" after the government's U-turn. The prime minister faced a significant rebellion over plans to cut sickness and disability benefits as part of a package he said would shave £5bn off the welfare bill and get more people into work. The government has since offered concessions ahead of a vote in the Commons on Tuesday, including exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Speaking at Welsh Labour's annual conference in Llandudno, North Wales, on Saturday, Sir Keir said: \"Everyone agrees that our welfare system is broken, failing people every day. \"Fixing it is a moral imperative, but we need to do it in a Labour way, conference, and we will.\" First minister Eluned Morgan said the Welsh government had been \"really concerned about the impact\" about the proposed changes, and told Sky News she was \"really pleased\" that he had listened. \"It was my duty to speak out as the Labour leader in Wales for those communities, for the people who are going to be impacted. And I am really pleased that the prime minister did listen,\" she said. \"Yes, he heard his Labour backbenchers. But our letter arrived just at the same time, so I like to think that we had an influence as well.\"  Sir Keir also warned of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections. He said such a deal would mark a \"return to the chaos and division of the last decade\". But opposition parties have hit back at the prime minister's \"imaginary coalitions\", with Plaid Cymru accusing Labour of \"scraping the barrel\". Reform UK said the NHS \"isn't safe in Labour's hands\" and people are \"left waiting in pain\" while ministers \"make excuses\". Voters in Wales will head to the polls next May and recent polls suggest Labour are in third place, behind Reform and Plaid. Labour have been the largest party at every Senedd election since devolution began in 1999. Conservative Party leader Kemi Badenoch has not ruled out making deals with Plaid Cymru or Reform at the Senedd election. Wales reporter Don't Stop Me Now - that was the soundtrack to Eluned Morgan’s arrival on stage.\n And that's her hope, the first minister who has \"no intention of being stopped\". But with the polls suggesting Labour could fall to third place at next year's Senedd election, there's a very real chance that decision could be taken out of her hands. The conference comes in a week where the UK government has made a U-turn on controversial welfare reforms. Those changes would have seen Wales, which has a higher number of people reliant on disability benefits, affected more than other parts of the UK. Baroness Morgan previously called out the plans but says the U-turn shows that Starmer is listening to her government's calls. Outside the building, others wanted to make their own voices heard, including farmers opposing the controversial changes to inheritance tax. Their hope is that one government U-turn will open the door to another. At the conference, the prime minister was joined on stage by Wales Secretary Jo Stevens, Baroness Morgan and deputy leader of Welsh Labour Carolyn Harries. He described Baroness Morgan as a \"fierce champion for Wales\" and \"the best person to lead Wales into the future\". Sir Keir said the £80m transition board to support Port Talbot steelworkers after the closure of the plant's blast furnaces was a result of \"two Labour governments working together for the people of Wales\". Read more:This has been the PM's most damaging U-turn yet Is Starmer at the mercy of his MPs? He described Nigel Farage as a \"wolf in Wall Street clothing\" who has \"no idea what he's talking about\" on the issue. The PM said the Reform UK leader \"isn't interested in Wales\" and has no viable plan for the blast furnaces at Port Talbot. \"When you ask him about Clacton, he thinks he's running in the 2.10 at Ascot,\" Sir Keir joked. \"He's a wolf in Wall Street clothing.\" Mr Farage has said his party wants to restart the blast furnaces at Port Talbot. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The first minister was introduced to the stage by former Wales rugby captain Ken Owens. In his introduction, he said: \"Being captain is so much more than leading a team, it's about carrying a nation.\" The first minister said the next Senedd election will be \"a moment of reckoning\" for the nation. \"I've got a nation to fight for, and I don't intend to lose,\" she added. Around 20 tractors were parked on the promenade in Llandudno ahead of the speech, as farmers gathered outside the conference to stage a protest. Later, around 200 people staged a pro-Palestine demonstration - with about a dozen counter-protesters also there."
    },
    {
        "title": "Hundreds of NHS quangos to be axed - as plans unveiled for health funding to be linked to patient feedback",
        "description": "NHS funding could be linked to patient feedback under new plans, with poorly performing services that \"don't listen\" penalised with less money.",
        "url": "https://news.sky.com/story/plans-unveiled-for-nhs-funding-to-be-linked-to-patient-feedback-but-concerns-raised-13389627",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nhs-hospitals-file-pic_6952348.jpg?20250628092523",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-28 07:36:00",
        "Headline": "In a trial scheme, patients will be asked to rate the service they received - and if they feel it should get a funding boost.",
        "Content": "NHS funding could be linked to patient feedback under new plans, with poorly performing services that \"don't listen\" penalised with less money. As part of the \"10 Year Health Plan\" to be unveiled next week, a new scheme will be trialled that will see patients asked to rate the service they received - and if they feel it should get a funding boost or not. It will be introduced first for services that have a track record of very poor performance and where there is evidence of patients \"not being listened to\", the government said. This will create a \"powerful incentive for services to listen to feedback and improve patients' experience\", it added. Sky News understands that it will not mean bonuses or pay increases for the best performing staff. NHS payment mechanisms will also be reformed to reward services that keep patients out of hospital as part of a new 'Year of Care Payments' initiative and the government's wider plan for change.  Speaking to The Times, chief executive of the NHS Confederation Matthew Taylor expressed concerns about the trial. He told the newspaper: \"Patient experience is determined by far more than their individual interaction with the clinician and so, unless this is very carefully designed and evaluated, there is a risk that providers could be penalised for more systemic issues, such as constraints around staffing or estates, that are beyond their immediate control to fix.\" He said that NHS leaders would be keen to \"understand more about the proposal\", because elements were \"concerning\". Read more from Sky NewsAmber health heat alert issuedPatient died 'unexpectedly' after NHS cyber attackDoctors told to stop using unapproved AI Health Secretary Wes Streeting said: \"We will reward great patient care, so patient experience and clinical excellence are met with extra cash. These reforms are key to keeping people healthy and out of hospital, and to making the NHS sustainable for the long-term as part of the Plan for Change.\" In the raft of announcements in the 10 Year Health Plan, the government has said 201 bodies responsible for overseeing and running parts of the NHS in England - known as quangos - will be scrapped. These include Healthwatch England, set up in 2012 to speak out on behalf of NHS and social care patients, the National Guardian's Office, created in 2015 to support NHS whistleblowers, and the Health Services Safety Investigations Body (HSSIB). The head of the Royal College of Nursing described the move as \"so unsafe for patients right now\". Professor Nicola Ranger said: \"Today, in hospitals across the NHS, we know one nurse can be left caring for 10, 15 or more patients at a time. It's not safe. It's not effective. And it's not acceptable. \"For these proposed changes to be effective, government must take ownership of the real issue, the staffing crisis on our wards, and not just shuffle people into new roles. Protecting patients has to be the priority and not just a drive for efficiency.\" Elsewhere, the new head of NHS England Sir Jim Mackey said key parts of the NHS appear \"built to keep the public away because it's an inconvenience\". \"We've made it really hard, and we've probably all been on the end of it,\" he told the Daily Telegraph. \"The ward clerk only works nine to five, or they're busy doing other stuff; the GP practice scrambles every morning.\""
    },
    {
        "title": "England beat Germany in final to retain U21 European Championship title",
        "description": "England have beaten Germany 3-2 in the Under-21s European Championship final after a thrilling match in Slovakia.",
        "url": "https://news.sky.com/story/england-beat-germany-in-final-to-retain-u21-european-championship-title-13389868",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-england-germany-euro_6952878.jpg?20250628225711",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-28 17:17:00",
        "Headline": "Goals from Harvey Elliott, Omari Hutchinson and Jonathan Rowe handed Lee Carsley's side a 3-2 win over Germany in Slovakia.",
        "Content": "England have beaten Germany 3-2 in the Under-21s European Championship final after a thrilling match in Slovakia. Lee Carsley's side were defending champions and led 2-0 after just 25 minutes, but Germany forced the game into extra-time with goals either side of half-time. Marseille forward Jonathan Rowe then grabbed the winner with his first touch two minutes after being introduced, putting England's name on the trophy for the second tournament running. Liverpool's Harvey Elliott gave the Young Lions a dream start in Bratislava, opening the scoring inside five minutes with a composed finish into the bottom corner. Omari Hutchinson doubled England's lead midway through the first half, driving the ball through the legs of German goalkeeper Noah Atubolu after neat work from captain James McAtee in the build-up. Carsley's side threatened to put the game out of sight when Hutchinson bent an effort narrowly wide after half an hour. But they were pegged back on the stroke of half-time when Nelson Weiper's powerful header flew past James Beadle in the England goal to make it 2-1. \n                  Jess Fishlock: Mural of Wales star unveiled in 'European first'\n                 \n                  Former England boss Gareth Southgate receives knighthood\n                 \n                  Wales announce squad for women's Euros\n                 Read more from Sky News:Thousands defy ban to join Pride march in BudapestTwo more arrests over damage to aircraft at RAF baseHundreds of NHS quangos to be axed Germany committed more bodies forward after the restart in search of an equaliser and deservedly found it on the hour mark. Paul Nebel was afforded too much space in the England box and curled home via a slight deflection. Carsley recognised the need for fresh legs after the game went to extra-time and his decision to bring on Marseille's Jonathan Rowe paid off immediately. The former Norwich City man caught the Germany defence sleeping as he got on the end of Tyler Morton's cross and headed home with what was his first touch of the game. It ended up being the crucial goal that retained the title the Young Lions won against Spain in Georgia two years ago. The victory against England's old rival came just 10 days after they lost 2-1 in the same fixture during the tournament's group stages."
    },
    {
        "title": "Cocaine haul worth nearly £100m seized in one of UK's biggest-ever drugs busts",
        "description": "A haul of cocaine worth nearly &#163;100m has been seized at a UK port, authorities say.",
        "url": "https://news.sky.com/story/cocaine-haul-worth-nearly-163100m-seized-in-one-of-uks-biggest-ever-drugs-busts-13389647",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-cocaine-london-gateway-port_6952361.jpg?20250628100011",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-28 08:48:00",
        "Headline": "The massive haul of cocaine was found under containers on a ship arriving into London Gateway port from Panama.",
        "Content": "A haul of cocaine worth nearly £100m has been seized at a UK port, authorities say. The haul, weighing 2.4 tonnes, was found under containers on a ship arriving from Panama at London Gateway port in Thurrock, Essex. It had been detected earlier this year after an intelligence-led operation but was intercepted as it arrived in the UK this week. With the help of the port operator, 37 large containers were moved to uncover the drugs, worth an estimated £96m. The haul is the sixth-largest cocaine seizure in UK history, according to Border Force. Its maritime director Charlie Eastaugh said: \"This seizure - one of the largest of its kind - is just one example of how dedicated Border Force maritime officers remain one step ahead of the criminal gangs who threaten our security. \"Our message to these criminals is clear - more than ever before, we are using intelligence and international law enforcement cooperation to disrupt and dismantle your operations.\" Read more from Sky NewsRobbie Williams addresses Glasto rumoursBody found in search for missing womanLife sentence for sword murderer of schoolboy Container ships are one of the main ways international gangs smuggle Class A drugs into the UK, Mr Eastaugh said. Cocaine deaths in England and Wales increased by 31% between 2022 and 2023, according to the latest Home Office data. Elsewhere this weekend, a separate haul of 170 kilos of ketamine, 4,000 MDMA pills, and 20 firearms were found on a lorry at Dover Port in Kent. Experts estimate the ketamine's street value to be £4.5m, with the MDMA worth at least £40,000. The driver of the lorry, a 34-year-old Tajikistan national, was arrested at the scene on suspicion of smuggling the items, the National Crime Agency said."
    },
    {
        "title": "Pulp revealed as mystery Glastonbury band as they echo famous 1990s headline set",
        "description": "Declaring a 'Pulp Summer' on the screen behind them, the band appeared on Glastonbury's Pyramid Stage for another of the festival's \"surprise\" performances.",
        "url": "https://news.sky.com/story/pulp-revealed-as-mystery-glastonbury-band-as-they-echo-famous-1990s-headline-set-13389894",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jarvis-cocker-glastonbury_6952814.jpg?20250628200350",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-28 19:05:00",
        "Headline": "As well as Lewis Capaldi and Pulp, acts including Lorde and Haim have also popped up as \"secrets\" this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Declaring a 'Pulp Summer' on the screen behind them, the band appeared on Glastonbury's Pyramid Stage for another of the festival's \"surprise\" performances. Billed as the non-existent act Patchwork in the days beforehand, fans knew to expect something big - similar to when The ChurnUps turned out to be the Foo Fighters in 2023. A group of people mysteriously walked on to the stage in waterproof ponchos before the \"secret\" was revealed and the Pulp homage to fellow Saturday night performer Charli XCX's Brat Summer appeared on screen. Glastonbury's greatest secret sets of all time Like Lewis Capaldi's unannounced set on Friday, everyone at Glastonbury knew who to expect by the time Jarvis Cocker and co began at 6.15pm, thanks to the bookies' odds, \"secret\" sources and whispers around the festival. The Sheffield band were welcomed with a huge turnout at the festival's biggest stage. In tribute to their headline performance in 1995, when they famously took over from The Stone Roses at short notice, Pulp started with Sorted For E's And Whizz and then straight into Disco 2000 - two songs played live for the first time on this same stage 30 years ago. \n                  Israeli embassy 'deeply disturbed' by Bob Vylan's 'death to the IDF' Glastonbury chant\n                 \n                  Kneecap rapper tells Glastonbury he's a 'free man' after terror charge court appearance\n                 \n                  The 'rascal' and the radical: How Michael and Emily Eavis have shaped Glastonbury\n                 \"It was the very, very first time they were played - you could say they were born in Glastonbury,\" Cocker told the crowd. From the Mercury Prize-winning Different Class, the album that propelled Pulp to topping the charts and platinum sales, and one of the most critically acclaimed records of the 1990s, the songs prompted a mass sing-along - and jump-along from an enthusiastic crowd who knew every word. \"My name's Jarvis, this is Pulp,\" Cocker announced, just in case anyone was in any doubt. \"Sorry for people who were expecting Patchwork. Did you know that we were going to play?\" After their 1990s hits, the band launched into Spike Island, the lead single from More - their first album in 24 years, released earlier this month. It was a set full of memorable moments - including the Red Arrows flying over - and Cocker picking up an acoustic guitar for the poignant Something Changed. Do You Remember The First Time? And Babies also featured, before the band of course ended on their biggest hit - Common People. Pulp's appearance came after keyboard player Candida Doyle appeared to confirm the band would not perform at the festival in a BBC interview beforehand, despite much speculation that they would fill one of the unannounced slots. Read more from Sky News:Kneecap rapper says he's a 'free man'Performers criticise political interferenceListen: The future of Glastonbury \"We wanted to, just because it's the 30th anniversary and that kind of thing, and they weren't interested,\" she said. \"And then we were thinking maybe next year, and then they're not doing it next year.\" Along with the headliners and the Sunday afternoon \"legends slots\", unannounced sets from the likes of the Foo Fighters, The Killers, and Radiohead have become some of the most talked-about performances at Glastonbury in recent years. As well as Capaldi and Pulp, acts including Lorde and Haim have also popped up as \"secrets\" this year. Pulp have a history of surprises at the festival, having performed a secret set on the Park Stage in 2011 following their first hiatus. Formed in 1978, they released three albums in the 1980s and early '90s before finding mainstream success with 1994's His And Hers. Different Class came 18 months later in October 1995 and Pulp became huge, helped in no small part by their memorable performance at Glastonbury earlier in the year. Thirty years later, they have entered the festival's history books once again."
    },
    {
        "title": "Two more people arrested over damage to aircraft at RAF base",
        "description": "Two more people have been arrested on suspicion of a terror offence after two aircraft were vandalised at RAF Brize Norton in Oxfordshire.",
        "url": "https://news.sky.com/story/two-more-people-arrested-over-damage-to-aircraft-at-raf-base-13389916",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brize-plane_6946806.jpg?20250627113358",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-28 20:44:00",
        "Headline": "Palestine Action has claimed responsibility for damage to two aircraft at RAF Brize Norton in Oxfordshire on 20 June. Sir Keir Starmer condemned the \"act of vandalism\" as \"disgraceful\".",
        "Content": " Two more people have been arrested on suspicion of a terror offence after two aircraft were vandalised at RAF Brize Norton in Oxfordshire. Counter Terrorism Policing South East said the men, aged 22 and 24 and both from London, were arrested on Saturday afternoon on suspicion of the commission, preparation or instigation of acts of terrorism, contrary to Section 41 of the Terrorism Act 2000. On Thursday, police said a woman, aged 29 of no fixed address, and two men, aged 36 and 24 from London, had been taken into police custody after the incident at RAF Brize Norton on 20 June. A 41-year-old woman, of no fixed address, was also arrested on suspicion of assisting an offender, they previously said. Read more: What does proscription mean?Palestine Action supporters defiant as group faces banThe 'enemy within' or non-violent protesters? The group posted a video online claiming it was behind the vandalism at the Oxfordshire airbase last Friday, saying activists had damaged two military planes at the base. Palestine Action - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\".  Repurposed fire extinguishers were used to spray red paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. \"Red paint, symbolising Palestinian bloodshed was also sprayed across the runway and a Palestine flag was left on the scene,\" a statement by the group said. Brize Norton is the largest RAF station, with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. A security review was launched across the \"whole defence estate\" following the breach, which was condemned as \"absolutely staggering\" by Ben Obese-Jecty, a Tory MP and former Army officer. Sir Keir Starmer condemned the \"act of vandalism\" as \"disgraceful\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" Home Secretary Yvette Cooper said on Monday that Palestine Action will be proscribed as a terrorist organisation following the breach at RAF Brize Norton. She said a draft proscription order will be laid in parliament next week, and if passed, it will make it illegal to be a member of, or invite support for, Palestine Action."
    },
    {
        "title": "Kneecap rapper tells Glastonbury he's a 'free man' after terror charge court appearance",
        "description": "Kneecap rapper Liam Og O hAnnaidh told Glastonbury he is a \"free man\" as the Irish rap band played to a huge crowd.",
        "url": "https://news.sky.com/story/kneecap-rapper-mo-chara-says-hes-a-free-man-as-band-draw-huge-glastonbury-crowd-13389645",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kneecap-glastonbury_6952760.jpg?20250628175309",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-28 08:36:00",
        "Headline": "There was political pressure to ditch the controversial group - but thousands turned out for their set at Glastonbury, despite the terror charge.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Kneecap rapper Liam Og O hAnnaidh told Glastonbury he is a \"free man\" as the Irish rap band played to a huge crowd. O hAnnaidh, also known as Liam O'Hanna - or by his stage name Mo Chara - was charged with a terror offence in May and appeared at Westminster Magistrates' Court earlier this month. The 27-year-old is accused of displaying a flag in support of the proscribed group Hezbollah at a gig in London last November, after video footage circulated online. He was released on unconditional bail ahead of a second court appearance in August. Before their performance at Glastonbury there had been calls from some politicians for them to be cut from the line-up. But they were greeted by cheers of support, and dozens of Palestinian flags waving in the audience, as well as Irish flags and a few \"Free Mo Chara\" T-shirts. On stage, they said it was the biggest crowd they had ever played to. Kneecap played the West Holts stage, which has a capacity of about 30,000, and the area was closed by security about 45 minutes before their set. They started with a montage of news readers covering O hAnnaidh's charge. \"Has anybody been watching the news?\" bandmate Naoise O Caireallain joked. They also thanked Glastonbury organisers Michael Eavis and daughter Emily for not bowing to pressure to remove them from the bill. In reference to his bandmate's upcoming court date, O Caireallain, who performs under the name Moglai Bap, said they would \"start a riot outside the courts\", before clarifying: \"No riots, just love and support, and support for Palestine.\" Earlier on Saturday, the BBC confirmed they would not be live-streaming the set but said the performance could be made available on-demand later. Before their set, rap-punk duo Bob Vylan also caused controversy, leading the crowd in chants of: \"Free, free Palestine\" and: \"Death, death to the IDF (Israel Defence Forces).\" Police said afterwards that they were assessing footage of both performances to decide whether any offences may have been committed. Culture Secretary Lisa Nandy has spoken to the BBC Director General about Bob Vylan's performance, a government spokesperson said. Kneecap were removed from other festivals earlier this year, and before Glastonbury there were calls from some for them to be taken off the bill - including from Prime Minister Sir Keir Starmer. The rappers have had the support of dozens of musicians including Massive Attack, Pulp, Primal Scream and Paul Weller, who signed an open letter in May saying there had been a \"concerted attempt to censor and ultimately de-platform\" the group. Read more:'Prime ministers and pop music don't go together'Lewis Capaldi plays emotional 'secret' set at GlastonburyRobbie Williams addresses Glastonbury rumours Kneecap released their first single in 2017 and built a loyal fanbase in the following years. They rose to wider prominence in 2024 following the release of their debut album and eponymous film - a fictionalised retelling of how the band came together and their fight to save the Irish language."
    },
    {
        "title": "Thousands defy ban to join Pride march in Budapest",
        "description": "If Hungary's authorities thought banning this year's Pride march would keep people off the streets, they were wrong.",
        "url": "https://news.sky.com/story/thousands-defy-ban-to-join-pride-march-in-budapest-13389870",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pride-budapest-hungary_6952786.jpg?20250628185758",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-06-28 17:22:00",
        "Headline": "Hungarians had been warned they risked a 500 euro fine if they attended the march, and police would use facial recognition cameras to identify them. But they didn't care.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  If Hungary's authorities thought banning this year's Pride march would keep people off the streets, they were wrong. Thousands turned out in Budapest, defying a law which said LGBTQ+ events like this should be cancelled to protect children. The crowd was determined to fight for their rights. \"This is a special march, not just because it was the 30th, but also because it was banned,\" said Orsi, who proudly wore a rainbow headband and waved a rainbow flag. \"I mean that's all the more reason to go out on the street and show that Budapest and Hungary is a place where everybody is welcome, where love is equal,\" she added. Attendees had been warned that just being there could mean a 500 euro fine or prison time for the organisers. They were told police would use facial recognition cameras to identify them, but they didn't care. \n                  Hungary suggests foot-and-mouth outbreak could be 'biological attack'\n                 \n                  Hungary says it will withdraw from International Criminal Court as Benjamin Netanyahu arrives on its soil despite arrest warrant\n                 \n                  Agnes Keleti: Holocaust survivor and oldest living Olympic medallist dies at the age of 103\n                 Orsi said it was worth a fine. Leonas had travelled from Poland to show his support and was also happy to take the risk. \"LGBT rights are attacked across the whole world, and we need to defend each other and work with each other,\" he said. Viktor Orban's government has repeatedly pitched family values against LGBTQ+ rights. \"The mother is a woman, the father is a man and leave our kids alone,\" he told conservative audiences in the past. He says he is protecting Hungary's Christian values, but critics say this is just part of a wider attack on democracy which has happened during his 15 years in control. The Pride ban is just the latest targeting of LGBTQ+ communities. In 2020, the country abolished its legal recognition of transgender people, and in 2021, politicians passed a law banning the depiction of homosexuality to under-18s. While many were outraged by the attempt to cancel the Pride march, a small number of far-right activists organised demonstrations to show their support: \"Hungary and the Hungarian nation don't want the aggressive LGBTQ+ propaganda. They are dangerous for our families, they are dangerous for our kids,\" said Gabor Kelemen, a member of the 64 Counties Youth Movement. However, the packed streets showed many disagree. At one point, as far as the eye could see, the march snaked through streets and across the city's bridges. The sound of drums and whistles mixing with gay anthems blaring out of speakers. The organisers said they believed this will be the largest Pride march ever in Budapest. Read more from Sky News:Tom Daley says LGBT rights 'threatened'Thailand legalises same-sex marriagePride celebrations in New Delhi The crowd was eclectic, with Hungarians from different communities joining a demonstration which many believe is now part of a fight for Hungary's future. \"This is not only about the complexity of Pride, not only about love or equality... for Hungarians, it's about sticking together, supporting each other, showing the government that we believe in a different kind of Hungary. We believe in freedom, we believe in democracy,\" said activist Adam Kanicsar. Despite the ban, today Pride attendees were celebrating a victory. But make no mistake, many in Hungary do not support the parade or what they see as an attack on traditional values. Next year, the country will hold a general election, a vote which will expose how divided Hungary really is."
    },
    {
        "title": "Chants of 'death to America' at funeral for Iranian military commanders and scientists",
        "description": "Thousands of people have taken to the streets of Tehran to mourn top military commanders, nuclear scientists and others killed in Iran's 12-day war with Israel.",
        "url": "https://news.sky.com/story/chants-of-death-to-america-at-funeral-for-iranian-military-commanders-and-scientists-13389648",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-iran-funeral_6952372.jpg?20250628101905",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-28 08:58:00",
        "Headline": "Thousands of people lined the streets of capital Tehran as coffins were driven on trucks. ",
        "Content": " Thousands of people have taken to the streets of Tehran to mourn top military commanders, nuclear scientists and others killed in Iran's 12-day war with Israel. State-run Press TV said the event - dubbed the \"funeral procession of the Martyrs of Power\" - was held for 60 people, including four women and four children. It said at least 16 scientists and 10 senior commanders were among the dead, including head of the Revolutionary Guard General Hossein Salami and the head of the guard's ballistic missile programme, General Amir Ali Hajizadeh. Their coffins were driven to Azadi Square on trucks adorned with their pictures as well as rose petals and flowers, as crowds waved Iranian flags. Chants of \"death to America\" and \"death to Israel\" could be heard. Attending the funeral were Iranian President Masoud Pezeshkian and other senior figures, including Ali Shamkhani who was seriously wounded during the fighting and is an adviser to Iran's supreme leader. There was no immediate sign of the supreme leader in the state broadcast of the funeral. Iran's president later thanked people for turning out. \"From the bottom of my heart, I thank you dear people,\" Mr Pezeshkian wrote on social media. \"With love, you bid farewell to the martyrs of our homeland, and our voice of unity reached the ears of the world.\" Iranian foreign minister Abbas Araghchi called the deaths \"hard and painful\". Seemingly referencing the recent airstrikes, he added: \"Institutions and structures, however important and valuable, return with new glory and greater strength over time, even if it takes years.\" Israel, the only Middle Eastern country widely believed to have nuclear weapons, said its attacks on Iran aimed to prevent Tehran from developing its own nuclear weapons. The US joined in by launching strikes on three nuclear enrichment sites in Iran, which Donald Trump said left them \"obliterated\", however the exact extent of the damage remains unclear. Iran denies having a nuclear weapons programme and the UN nuclear watchdog, which carries out inspections in Iran, has said it has \"no credible indication\" of an active, coordinated weapons project.  Over almost two weeks of fighting, Israel claimed it killed around 30 Iranian commanders and 11 nuclear scientists, before a ceasefire began on Tuesday. Read more from Sky News:Truth about airstrikes on Iran lies deep undergroundFury of helicopter crash victim's son over documents 'sealed for 100 years' According to Iranian health ministry figures, 610 people were killed, 13 of whom were children and 49 were women. Israel's health ministry said 28 people were killed there in Iranian attacks - with 3,238 injured."
    },
    {
        "title": "At least 72 killed in Israeli strikes across Gaza, health staff say",
        "description": "At least 72 people have been killed in Israeli strikes across Gaza, health staff have said.",
        "url": "https://news.sky.com/story/at-least-60-killed-in-israeli-strikes-across-gaza-health-staff-say-13389711",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-israel-strikes_6952514.jpg?20250628133943",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-28 12:06:00",
        "Headline": "The strikes across Friday and Saturday came as US President Donald Trump said there could be a ceasefire agreement within the next week.",
        "Content": " At least 72 people have been killed in Israeli strikes across Gaza, health staff have said. A dozen people were killed near the Palestine Stadium in Gaza City, which was sheltering displaced people, along with eight more living in apartments, according to staff at Shifa hospital, where the bodies were brought. Six others were killed in southern Gaza when a strike hit their tent in Muwasi, according to the hospital. Follow latest: 'Death to America' chants in Tehran The strikes, which began late on Friday and continued into Saturday morning, came as US President Donald Trump said there could be a ceasefire agreement within the next week. \"We're working on Gaza and trying to get it taken care of,\" he told reporters in the Oval Office on Friday. Ron Dermer, Israel's minister for strategic affairs, will arrive in Washington next week for talks on Gaza's ceasefire, Iran and other subjects, an official told the Associated Press on condition of anonymity. The last ceasefire agreed back in mid-January ended in March.  The war in Gaza was sparked after Hamas launched its attack on Israel in October 2023, killing some 1,200 people, mostly civilians, and abducting 251 people. Some 50 hostages remain in Gaza, with fewer than half of them still believed to be alive. More than 56,000 Palestinians have been killed during the war, according to Gaza's Hamas-run health ministry, which does not distinguish between civilians and combatants. Read more from Sky News:Truth about success of US strikes on Iran lies deep undergroundFury of helicopter crash victim's son over sealed documents The UN has also warned that people in Gaza are \"starving\", with Israel allowing a trickle of supplies into the territory since mid-May after blocking all food for more than two months.  Palestinians have been shot at and killed while on their way to get food at aid sites, according to Gaza's health officials and witnesses. Israel's military said it was investigating incidents in which civilians had been harmed while approaching the sites."
    },
    {
        "title": "Lauren Sanchez shares picture with Jeff Bezos as they tie the knot in star-studded ceremony in Venice",
        "description": "Billionaire Amazon founder Jeff Bezos and journalist Lauren Sanchez have tied the knot in a lavish and star-studded wedding in Venice, Italy.",
        "url": "https://news.sky.com/story/lauren-sanchez-shares-picture-with-jeff-bezos-as-they-tie-the-knot-in-star-studded-ceremony-in-venice-13389593",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jeff-bezos-lauren-sanchez_6951665.jpg?20250627084555",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-28 00:38:00",
        "Headline": "The couple exchanged their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square, in front of VIP guests including the Kardashians, Orlando Bloom and Oprah Winfrey.",
        "Content": "Billionaire Amazon founder Jeff Bezos and journalist Lauren Sanchez have tied the knot in a lavish and star-studded wedding in Venice, Italy. The couple exchanged their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square, in front of VIP guests including the Kardashians, Orlando Bloom and Oprah Winfrey. Sanchez, 55, posted a picture of herself on Instagram where she beamed in a white gown as she walked arm in arm with Bezos. She captioned it with the date of the nuptials, namely 27 June 2025, followed by a heart emoji. She also posted pictures of her in the classic mermaid-line gown, which featured Dolce & Gabbana's signature Italian lace. A traditional tulle-and-lace veil completed her look. \"Not just a gown, a piece of poetry,\" she wrote on Instagram on the second day of the couple's three-day celebrations. \n                  Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests\n                 \n                  Guests descend on Venice for Jeff Bezos wedding - amid last-minute change after protests\n                 \n                  Why protesters have vowed to make Jeff Bezos's Venice wedding to Lauren Sanchez a 'nightmare'\n                 Among the celebrities who were pictured on the wedding day were Ivanka Trump with her husband Jared Kushner, Italian supermodel Vittoria Ceretti, Kendall and Kylie Jenner and Khloe and Kim Kardashian.  Bill Gates, Usher and Tom Brady were also pictured. Read more from Sky News:Trump tariffs will cost us $1bn, says NikeLewis Capaldi plays emotional not-so-secret comeback set at Glastonbury Some 200-250 A-list guests from showbusiness, politics and finance are expected to attend the events, with the wedding and its parts estimated to cost €40m-€48m (£34m-£41m). Bezos, his now-wife and their famous guests have taken over numerous locations in the city, with the couple staying in the luxury Aman hotel, where rooms go for at least €4,000 per night. While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders. An activist climbed one of the poles in the main St Mark's Square on Thursday, unfurling a banner which said: \"The 1% ruins the world.\" Another party will follow on Saturday - the venue for which was changed at the last minute earlier this week."
    },
    {
        "title": "Lauren Sanchez shares picture with Jeff Bezos as they tie the knot in star-studded ceremony in Venice",
        "description": "Billionaire Amazon founder Jeff Bezos and journalist Lauren Sanchez have tied the knot in a lavish and star-studded wedding in Venice, Italy.",
        "url": "https://news.sky.com/story/lauren-sanchez-shares-picture-with-jeff-bezos-as-they-tie-the-knot-in-star-studded-ceremony-in-venice-13389593",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jeff-bezos-lauren-sanchez_6951665.jpg?20250627084555",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-28 00:38:00",
        "Headline": "The couple exchanged their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square, in front of VIP guests including the Kardashians, Orlando Bloom and Oprah Winfrey.",
        "Content": "Billionaire Amazon founder Jeff Bezos and journalist Lauren Sanchez have tied the knot in a lavish and star-studded wedding in Venice, Italy. The couple exchanged their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square, in front of VIP guests including the Kardashians, Orlando Bloom and Oprah Winfrey. Sanchez, 55, posted a picture of herself on Instagram where she beamed in a white gown as she walked arm in arm with Bezos. She captioned it with the date of the nuptials, namely 27 June 2025, followed by a heart emoji. She also posted pictures of her in the classic mermaid-line gown, which featured Dolce & Gabbana's signature Italian lace. A traditional tulle-and-lace veil completed her look. \"Not just a gown, a piece of poetry,\" she wrote on Instagram on the second day of the couple's three-day celebrations. \n                  Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests\n                 \n                  Guests descend on Venice for Jeff Bezos wedding - amid last-minute change after protests\n                 \n                  Why protesters have vowed to make Jeff Bezos's Venice wedding to Lauren Sanchez a 'nightmare'\n                 Among the celebrities who were pictured on the wedding day were Ivanka Trump with her husband Jared Kushner, Italian supermodel Vittoria Ceretti, Kendall and Kylie Jenner and Khloe and Kim Kardashian.  Bill Gates, Usher and Tom Brady were also pictured. Read more from Sky News:Trump tariffs will cost us $1bn, says NikeLewis Capaldi plays emotional not-so-secret comeback set at Glastonbury Some 200-250 A-list guests from showbusiness, politics and finance are expected to attend the events, with the wedding and its parts estimated to cost €40m-€48m (£34m-£41m). Bezos, his now-wife and their famous guests have taken over numerous locations in the city, with the couple staying in the luxury Aman hotel, where rooms go for at least €4,000 per night. While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders. An activist climbed one of the poles in the main St Mark's Square on Thursday, unfurling a banner which said: \"The 1% ruins the world.\" Another party will follow on Saturday - the venue for which was changed at the last minute earlier this week."
    },
    {
        "title": "Spanish-owned Scottish Power sparks merger talks with Ovo Energy",
        "description": "Scottish Power, the Spanish-owned energy supplier, and larger rival Ovo Energy have begun holding exploratory talks about a merger that would create a company serving more than six million British households.",
        "url": "https://news.sky.com/story/spanish-owned-scottish-power-sparks-merger-talks-with-ovo-energy-13389804",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-electrical-substation_6952707.jpg?20250628165139",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-28 15:26:00",
        "Headline": "Iberdrola, which bought Scottish Power in 2007, is in early talks with Ovo about a deal that would establish Britain's third-largest home energy supplier, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Scottish Power, the Spanish-owned energy supplier, and larger rival Ovo Energy have begun holding exploratory talks about a merger that would create a company serving more than six million British households. Sky News has learnt that executives from Iberdrola, which owns Scottish Power, and Ovo have been engaged in preliminary discussions in recent weeks about the possibility of a deal. The talks are at an early stage and any formal transaction would be months away, if it materialised at all. If the two companies do agree a merger of their residential gas and electricity operations, it would create the third-largest supplier behind Centrica-owned British Gas and Octopus Energy. As the larger company, with 4 million customers, Ovo would probably be the acquiring entity, but with Iberdrola potentially contributing cash and remaining as a shareholder in the enlarged group, according to one banking source. Scottish Power serves about 2.4 million households. The discussions between the two companies are running in parallel to a separate process through which Ovo is exploring the potential to raise roughly £300m from the sale of new shares in the company, according to industry sources. \n                  Why are UK industrial electricity prices so high - and what can be done about it?\n                 \n                  Government considering measure to slash industrial energy prices\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 In recent weeks, a number of financial investors have been contacted by Rothschild, the investment bank advising Ovo, about the opportunity. Exactly a year ago, Sky News revealed that Ovo had hired Rothschild to explore options, including bringing in a new investor or a sale, 15 years after it launched in a bid to challenge the industry's oligopoly. Founded by Stephen Fitzpatrick, the entrepreneur who now owns London's Kensington Roof Gardens, Ovo's shareholders include the private equity firm Mayfair Equity Partners, Morgan Stanley Investment Management and Mitsubishi Corporation, the Japanese conglomerate. Under Mr Fitzpatrick, who launched Ovo in 2009, the company positioned itself as a challenger brand offering superior service to the industry's established players. Ovo's transformational moment came in 2020, when it bought the retail supply arm of SSE, transforming it overnight into one of Britain's leading energy companies. Read more from Sky News:Compensation over prepayment metersEnergy prices could be slashedOvo Energy buys brand from founder Its growth has not been without difficulties, however, particularly in relation to its challenged relationship with Ofgem and a torrent of customer complaints about overcharging. Justin King, the former J Sainsbury chief who now chairs Ovo, has made repairing its regulatory relationships a priority for the company. He also oversaw the recruitment of David Buttress, who was briefly Boris Johnson's cost-of-living tsar after leaving the top job at Just Eat, as its chief executive. Key to Ovo's longer-term valuation will be the performance of its technology platform, Kaluza, which was set up to license software to other energy suppliers and provides customers with smart electric vehicle charging and heat pumps. Ovo announced last year that AGL Energy, one of Australia's biggest energy suppliers, had bought a 20% stake in Kaluza at a $500m (£395m) valuation. The British energy company has also entered the electric vehicle car charging sector under the brand Charge Anywhere, adding tens of thousands of public charging points across the UK. Iberdrola bought Scottish Power in 2007 in a deal valuing the company at more than £11bn. Next week, the UK's energy price cap will fall by 7% to £1,720 a year, following an announcement by Ofgem, the industry regulator. Ovo and Scottish Power both declined to comment."
    },
    {
        "title": "Fixing welfare a 'moral imperative', Starmer says, after government U-turn",
        "description": "Sir Keir Starmer has said fixing the UK's welfare system is a \"moral imperative\" after the government's U-turn.",
        "url": "https://news.sky.com/story/fixing-welfare-a-moral-imperative-starmer-says-after-government-u-turn-13389651",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-labour_6952434.jpg?20250628115442",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-28 09:04:00",
        "Headline": "Speaking at Welsh Labour's annual conference in Llandudno, the prime minister says \"everyone agrees that our welfare system is broken\".",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n  Sir Keir Starmer has said fixing the UK's welfare system is a \"moral imperative\" after the government's U-turn. The prime minister faced a significant rebellion over plans to cut sickness and disability benefits as part of a package he said would shave £5bn off the welfare bill and get more people into work. The government has since offered concessions ahead of a vote in the Commons on Tuesday, including exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Speaking at Welsh Labour's annual conference in Llandudno, North Wales, on Saturday, Sir Keir said: \"Everyone agrees that our welfare system is broken, failing people every day. \"Fixing it is a moral imperative, but we need to do it in a Labour way, conference, and we will.\" First minister Eluned Morgan said the Welsh government had been \"really concerned about the impact\" about the proposed changes, and told Sky News she was \"really pleased\" that he had listened. \"It was my duty to speak out as the Labour leader in Wales for those communities, for the people who are going to be impacted. And I am really pleased that the prime minister did listen,\" she said. \"Yes, he heard his Labour backbenchers. But our letter arrived just at the same time, so I like to think that we had an influence as well.\"  Sir Keir also warned of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections. He said such a deal would mark a \"return to the chaos and division of the last decade\". But opposition parties have hit back at the prime minister's \"imaginary coalitions\", with Plaid Cymru accusing Labour of \"scraping the barrel\". Reform UK said the NHS \"isn't safe in Labour's hands\" and people are \"left waiting in pain\" while ministers \"make excuses\". Voters in Wales will head to the polls next May and recent polls suggest Labour are in third place, behind Reform and Plaid. Labour have been the largest party at every Senedd election since devolution began in 1999. Conservative Party leader Kemi Badenoch has not ruled out making deals with Plaid Cymru or Reform at the Senedd election. Wales reporter Don't Stop Me Now - that was the soundtrack to Eluned Morgan’s arrival on stage.\n And that's her hope, the first minister who has \"no intention of being stopped\". But with the polls suggesting Labour could fall to third place at next year's Senedd election, there's a very real chance that decision could be taken out of her hands. The conference comes in a week where the UK government has made a U-turn on controversial welfare reforms. Those changes would have seen Wales, which has a higher number of people reliant on disability benefits, affected more than other parts of the UK. Baroness Morgan previously called out the plans but says the U-turn shows that Starmer is listening to her government's calls. Outside the building, others wanted to make their own voices heard, including farmers opposing the controversial changes to inheritance tax. Their hope is that one government U-turn will open the door to another. At the conference, the prime minister was joined on stage by Wales Secretary Jo Stevens, Baroness Morgan and deputy leader of Welsh Labour Carolyn Harries. He described Baroness Morgan as a \"fierce champion for Wales\" and \"the best person to lead Wales into the future\". Sir Keir said the £80m transition board to support Port Talbot steelworkers after the closure of the plant's blast furnaces was a result of \"two Labour governments working together for the people of Wales\". Read more:This has been the PM's most damaging U-turn yet Is Starmer at the mercy of his MPs? He described Nigel Farage as a \"wolf in Wall Street clothing\" who has \"no idea what he's talking about\" on the issue. The PM said the Reform UK leader \"isn't interested in Wales\" and has no viable plan for the blast furnaces at Port Talbot. \"When you ask him about Clacton, he thinks he's running in the 2.10 at Ascot,\" Sir Keir joked. \"He's a wolf in Wall Street clothing.\" Mr Farage has said his party wants to restart the blast furnaces at Port Talbot. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 The first minister was introduced to the stage by former Wales rugby captain Ken Owens. In his introduction, he said: \"Being captain is so much more than leading a team, it's about carrying a nation.\" The first minister said the next Senedd election will be \"a moment of reckoning\" for the nation. \"I've got a nation to fight for, and I don't intend to lose,\" she added. Around 20 tractors were parked on the promenade in Llandudno ahead of the speech, as farmers gathered outside the conference to stage a protest. Later, around 200 people staged a pro-Palestine demonstration - with about a dozen counter-protesters also there."
    },
    {
        "title": "Hundreds of NHS quangos to be axed - as plans unveiled for health funding to be linked to patient feedback",
        "description": "NHS funding could be linked to patient feedback under new plans, with poorly performing services that \"don't listen\" penalised with less money.",
        "url": "https://news.sky.com/story/plans-unveiled-for-nhs-funding-to-be-linked-to-patient-feedback-but-concerns-raised-13389627",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nhs-hospitals-file-pic_6952348.jpg?20250628092523",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-28 07:36:00",
        "Headline": "In a trial scheme, patients will be asked to rate the service they received - and if they feel it should get a funding boost.",
        "Content": "NHS funding could be linked to patient feedback under new plans, with poorly performing services that \"don't listen\" penalised with less money. As part of the \"10 Year Health Plan\" to be unveiled next week, a new scheme will be trialled that will see patients asked to rate the service they received - and if they feel it should get a funding boost or not. It will be introduced first for services that have a track record of very poor performance and where there is evidence of patients \"not being listened to\", the government said. This will create a \"powerful incentive for services to listen to feedback and improve patients' experience\", it added. Sky News understands that it will not mean bonuses or pay increases for the best performing staff. NHS payment mechanisms will also be reformed to reward services that keep patients out of hospital as part of a new 'Year of Care Payments' initiative and the government's wider plan for change.  Speaking to The Times, chief executive of the NHS Confederation Matthew Taylor expressed concerns about the trial. He told the newspaper: \"Patient experience is determined by far more than their individual interaction with the clinician and so, unless this is very carefully designed and evaluated, there is a risk that providers could be penalised for more systemic issues, such as constraints around staffing or estates, that are beyond their immediate control to fix.\" He said that NHS leaders would be keen to \"understand more about the proposal\", because elements were \"concerning\". Read more from Sky NewsAmber health heat alert issuedPatient died 'unexpectedly' after NHS cyber attackDoctors told to stop using unapproved AI Health Secretary Wes Streeting said: \"We will reward great patient care, so patient experience and clinical excellence are met with extra cash. These reforms are key to keeping people healthy and out of hospital, and to making the NHS sustainable for the long-term as part of the Plan for Change.\" In the raft of announcements in the 10 Year Health Plan, the government has said 201 bodies responsible for overseeing and running parts of the NHS in England - known as quangos - will be scrapped. These include Healthwatch England, set up in 2012 to speak out on behalf of NHS and social care patients, the National Guardian's Office, created in 2015 to support NHS whistleblowers, and the Health Services Safety Investigations Body (HSSIB). The head of the Royal College of Nursing described the move as \"so unsafe for patients right now\". Professor Nicola Ranger said: \"Today, in hospitals across the NHS, we know one nurse can be left caring for 10, 15 or more patients at a time. It's not safe. It's not effective. And it's not acceptable. \"For these proposed changes to be effective, government must take ownership of the real issue, the staffing crisis on our wards, and not just shuffle people into new roles. Protecting patients has to be the priority and not just a drive for efficiency.\" Elsewhere, the new head of NHS England Sir Jim Mackey said key parts of the NHS appear \"built to keep the public away because it's an inconvenience\". \"We've made it really hard, and we've probably all been on the end of it,\" he told the Daily Telegraph. \"The ward clerk only works nine to five, or they're busy doing other stuff; the GP practice scrambles every morning.\""
    },
    {
        "title": "Carrie Johnson admitted to hospital over 'severe dehydration'",
        "description": "Carrie Johnson - the wife of former prime minister Boris Johnson - has revealed she was admitted to hospital with severe dehydration, as she offered advice to other breastfeeding mothers in the hot weather.",
        "url": "https://news.sky.com/story/carrie-johnson-admitted-to-hospital-over-severe-dehydration-13389681",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-boris-johnson-carrie-johnson_6215407.jpg?20250628123452",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-28 10:39:00",
        "Headline": "Boris Johnson's wife posted a picture of herself and her newborn daughter in a hospital bed - and offered advice to other \"breastfeeding mums\".",
        "Content": "Carrie Johnson - the wife of former prime minister Boris Johnson - has revealed she was admitted to hospital with severe dehydration, as she offered advice to other breastfeeding mothers in the hot weather. Mrs Johnson, 37, posted a picture of herself and her newborn daughter Poppy Eliza Josephine on Friday in a hospital bed. \"Being hospitalised for two nights for severe dehydration was not on my postpartum bingo card,\" she captioned the Instagram post. Mrs Johnson urged other \"breastfeeding mums\" to make sure they eat and drink enough \"in this heat\", especially those who are \"clusterfeeding\". Poppy was born on 21 May, becoming the couple's fourth child after their son Frank, born in July 2023, daughter Romy, born in December 2021, and son Wilfred, born in April 2020. In a separate Instagram story, Mrs Johnson described an \"honestly brutal week\". \"Mastitis (me), reflux (her), dehydration (me). What a pair we are!,\" she said. \"But thank you for all the kind messages, especially all the brilliant advice on reflux. Really appreciate it and made me feel way less alone going thru (sic) it all. And as ever, thanks to our amazing NHS.\" Read more from Sky News:Hundreds of NHS quangos to be axed'Most effective' protection to avoid sunburn (and it isn't suncream) The NHS recommends drinking plenty of fluids while breastfeeding - and avoiding caffeine and alcohol to stop their effects being passed on to the baby. Having a drink nearby when mothers stop to feed is advised, as is water, lower-fat milk, and low-sugar drinks. The UK Health Security Agency (UKHSA) has issued an amber heat health alert for the next four days. Although not a public weather warning, it advises health and social care organisations of possible dangers to their patients and facilities. Temperatures could reach 34C on Monday - with a 20% chance of beating the hottest June day on record of 35.6C from 1976. The likelihood of record-breaking temperatures could increase over the weekend as the day approaches."
    },
    {
        "title": "Israeli embassy 'deeply disturbed' by Bob Vylan's 'death to the IDF' Glastonbury chant",
        "description": "The Israeli embassy has said it's \"deeply disturbed\" by chants of \"death to the IDF\" at Glastonbury - as police also investigate the incident.",
        "url": "https://news.sky.com/story/israeli-embassy-deeply-disturbed-by-bob-vylans-death-to-the-idf-glastonbury-chant-13389912",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952844.jpg?20250628213421",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-28 20:28:00",
        "Headline": "The government and the Tories have condemned the outburst - which happened in front of thousands at the festival's West Holts Stage.",
        "Content": " The Israeli embassy has said it's \"deeply disturbed\" by chants of \"death to the IDF\" at Glastonbury - as police also investigate the incident. Video shows one of the members of Bob Vylan shouting the slogan into the mic and some of the crowd joining in. The duo were performing ahead of a performance by Kneecap, the Irish act who the prime minister said should be ditched from the line-up. \"The Embassy of Israel in the United Kingdom is deeply disturbed by the inflammatory and hateful rhetoric expressed on stage at the Glastonbury Festival,\" a statement said. It said slogans like Saturday's chant \"advocate for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" Avon and Somerset Police said they are looking at whether a criminal offence was committed. Bob Vylan also performed in front of a screen quoting a claim that Israel's actions in Gaza amount to genocide. Culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what due diligence it carried out into Bob Vylan. A spokesman said the government strongly condemned the \"threatening comments\" by the group, whose X bio describes them as a \"punk/rap/alt thing\". A BBC statement said: \"Some of the comments made during Bob Vylan's set were deeply offensive. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. \"We have no plans to make the performance available on demand.\" Tory leader Kemi Badenoch re-posted a clip of the incident and called it \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Read more:Kneecap rapper tells Glastonbury he's a 'free man'Lewis Capaldi plays 'secret' set at GlastonburyRobbie Williams addresses Glastonbury rumours A statement from Glastonbury Festival said it \"does not condone hate speech or incitement to violence of any kind from its performers\". Irish group Kneecap followed Bob Vylan - with the broadcaster not carrying their performance live amid concern over what they might do or say. However, it's understood their show will be made available on demand after a review. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of proscribed terror group Hezbollah at a gig. Bandmate Naoise O Caireallain told the packed Glastonbury crowd they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for Saturday's set and told fans he was a \"free man\"."
    },
    {
        "title": "Pulp revealed as mystery Glastonbury band as they echo famous 1990s headline set",
        "description": "Declaring a 'Pulp Summer' on the screen behind them, the band appeared on Glastonbury's Pyramid Stage for another of the festival's \"surprise\" performances.",
        "url": "https://news.sky.com/story/pulp-revealed-as-mystery-glastonbury-band-as-they-echo-famous-1990s-headline-set-13389894",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jarvis-cocker-glastonbury_6952814.jpg?20250628200350",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-28 19:05:00",
        "Headline": "As well as Lewis Capaldi and Pulp, acts including Lorde and Haim have also popped up as \"secrets\" this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Declaring a 'Pulp Summer' on the screen behind them, the band appeared on Glastonbury's Pyramid Stage for another of the festival's \"surprise\" performances. Billed as the non-existent act Patchwork in the days beforehand, fans knew to expect something big - similar to when The ChurnUps turned out to be the Foo Fighters in 2023. A group of people mysteriously walked on to the stage in waterproof ponchos before the \"secret\" was revealed and the Pulp homage to fellow Saturday night performer Charli XCX's Brat Summer appeared on screen. Glastonbury's greatest secret sets of all time Like Lewis Capaldi's unannounced set on Friday, everyone at Glastonbury knew who to expect by the time Jarvis Cocker and co began at 6.15pm, thanks to the bookies' odds, \"secret\" sources and whispers around the festival. The Sheffield band were welcomed with a huge turnout at the festival's biggest stage. In tribute to their headline performance in 1995, when they famously took over from The Stone Roses at short notice, Pulp started with Sorted For E's And Whizz and then straight into Disco 2000 - two songs played live for the first time on this same stage 30 years ago. \n                  Israeli embassy 'deeply disturbed' by Bob Vylan's 'death to the IDF' Glastonbury chant\n                 \n                  Kneecap rapper tells Glastonbury he's a 'free man' after terror charge court appearance\n                 \n                  The 'rascal' and the radical: How Michael and Emily Eavis have shaped Glastonbury\n                 \"It was the very, very first time they were played - you could say they were born in Glastonbury,\" Cocker told the crowd. From the Mercury Prize-winning Different Class, the album that propelled Pulp to topping the charts and platinum sales, and one of the most critically acclaimed records of the 1990s, the songs prompted a mass sing-along - and jump-along from an enthusiastic crowd who knew every word. \"My name's Jarvis, this is Pulp,\" Cocker announced, just in case anyone was in any doubt. \"Sorry for people who were expecting Patchwork. Did you know that we were going to play?\" After their 1990s hits, the band launched into Spike Island, the lead single from More - their first album in 24 years, released earlier this month. It was a set full of memorable moments - including the Red Arrows flying over - and Cocker picking up an acoustic guitar for the poignant Something Changed. Do You Remember The First Time? And Babies also featured, before the band of course ended on their biggest hit - Common People. Pulp's appearance came after keyboard player Candida Doyle appeared to confirm the band would not perform at the festival in a BBC interview beforehand, despite much speculation that they would fill one of the unannounced slots. Read more from Sky News:Kneecap rapper says he's a 'free man'Performers criticise political interferenceListen: The future of Glastonbury \"We wanted to, just because it's the 30th anniversary and that kind of thing, and they weren't interested,\" she said. \"And then we were thinking maybe next year, and then they're not doing it next year.\" Along with the headliners and the Sunday afternoon \"legends slots\", unannounced sets from the likes of the Foo Fighters, The Killers, and Radiohead have become some of the most talked-about performances at Glastonbury in recent years. As well as Capaldi and Pulp, acts including Lorde and Haim have also popped up as \"secrets\" this year. Pulp have a history of surprises at the festival, having performed a secret set on the Park Stage in 2011 following their first hiatus. Formed in 1978, they released three albums in the 1980s and early '90s before finding mainstream success with 1994's His And Hers. Different Class came 18 months later in October 1995 and Pulp became huge, helped in no small part by their memorable performance at Glastonbury earlier in the year. Thirty years later, they have entered the festival's history books once again."
    },
    {
        "title": "Kneecap rapper tells Glastonbury he's a 'free man' after terror charge court appearance",
        "description": "Kneecap rapper Liam Og O hAnnaidh told Glastonbury he is a \"free man\" as the Irish rap band played to a huge crowd.",
        "url": "https://news.sky.com/story/kneecap-rapper-mo-chara-says-hes-a-free-man-as-band-draw-huge-glastonbury-crowd-13389645",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kneecap-glastonbury_6952760.jpg?20250628175309",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-28 08:36:00",
        "Headline": "There was political pressure to ditch the controversial group - but thousands turned out for their set at Glastonbury, despite the terror charge.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Kneecap rapper Liam Og O hAnnaidh told Glastonbury he is a \"free man\" as the Irish rap band played to a huge crowd. O hAnnaidh, also known as Liam O'Hanna - or by his stage name Mo Chara - was charged with a terror offence in May and appeared at Westminster Magistrates' Court earlier this month. The 27-year-old is accused of displaying a flag in support of the proscribed group Hezbollah at a gig in London last November, after video footage circulated online. He was released on unconditional bail ahead of a second court appearance in August. Before their performance at Glastonbury there had been calls from some politicians for them to be cut from the line-up. But they were greeted by cheers of support, and dozens of Palestinian flags waving in the audience, as well as Irish flags and a few \"Free Mo Chara\" T-shirts. On stage, they said it was the biggest crowd they had ever played to. Kneecap played the West Holts stage, which has a capacity of about 30,000, and the area was closed by security about 45 minutes before their set. They started with a montage of news readers covering O hAnnaidh's charge. \"Has anybody been watching the news?\" bandmate Naoise O Caireallain joked. They also thanked Glastonbury organisers Michael Eavis and daughter Emily for not bowing to pressure to remove them from the bill. In reference to his bandmate's upcoming court date, O Caireallain, who performs under the name Moglai Bap, said they would \"start a riot outside the courts\", before clarifying: \"No riots, just love and support, and support for Palestine.\" Earlier on Saturday, the BBC confirmed they would not be live-streaming the set but said the performance could be made available on-demand later. Before their set, rap-punk duo Bob Vylan also caused controversy, leading the crowd in chants of: \"Free, free Palestine\" and: \"Death, death to the IDF (Israel Defence Forces).\" Police said afterwards that they were assessing footage of both performances to decide whether any offences may have been committed. Culture Secretary Lisa Nandy has spoken to the BBC Director General about Bob Vylan's performance, a government spokesperson said. Kneecap were removed from other festivals earlier this year, and before Glastonbury there were calls from some for them to be taken off the bill - including from Prime Minister Sir Keir Starmer. The rappers have had the support of dozens of musicians including Massive Attack, Pulp, Primal Scream and Paul Weller, who signed an open letter in May saying there had been a \"concerted attempt to censor and ultimately de-platform\" the group. Read more:'Prime ministers and pop music don't go together'Lewis Capaldi plays emotional 'secret' set at GlastonburyRobbie Williams addresses Glastonbury rumours Kneecap released their first single in 2017 and built a loyal fanbase in the following years. They rose to wider prominence in 2024 following the release of their debut album and eponymous film - a fictionalised retelling of how the band came together and their fight to save the Irish language."
    },
    {
        "title": "Lauren Sanchez shares picture with Jeff Bezos as they tie the knot in star-studded ceremony in Venice",
        "description": "Billionaire Amazon founder Jeff Bezos and journalist Lauren Sanchez have tied the knot in a lavish and star-studded wedding in Venice, Italy.",
        "url": "https://news.sky.com/story/lauren-sanchez-shares-picture-with-jeff-bezos-as-they-tie-the-knot-in-star-studded-ceremony-in-venice-13389593",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jeff-bezos-lauren-sanchez_6951665.jpg?20250627084555",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-28 00:38:00",
        "Headline": "The couple exchanged their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square, in front of VIP guests including the Kardashians, Orlando Bloom and Oprah Winfrey.",
        "Content": "Billionaire Amazon founder Jeff Bezos and journalist Lauren Sanchez have tied the knot in a lavish and star-studded wedding in Venice, Italy. The couple exchanged their vows on Friday, on the small island of San Giorgio, opposite St Mark's Square, in front of VIP guests including the Kardashians, Orlando Bloom and Oprah Winfrey. Sanchez, 55, posted a picture of herself on Instagram where she beamed in a white gown as she walked arm in arm with Bezos. She captioned it with the date of the nuptials, namely 27 June 2025, followed by a heart emoji. She also posted pictures of her in the classic mermaid-line gown, which featured Dolce & Gabbana's signature Italian lace. A traditional tulle-and-lace veil completed her look. \"Not just a gown, a piece of poetry,\" she wrote on Instagram on the second day of the couple's three-day celebrations. \n                  Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests\n                 \n                  Guests descend on Venice for Jeff Bezos wedding - amid last-minute change after protests\n                 \n                  Why protesters have vowed to make Jeff Bezos's Venice wedding to Lauren Sanchez a 'nightmare'\n                 Among the celebrities who were pictured on the wedding day were Ivanka Trump with her husband Jared Kushner, Italian supermodel Vittoria Ceretti, Kendall and Kylie Jenner and Khloe and Kim Kardashian.  Bill Gates, Usher and Tom Brady were also pictured. Read more from Sky News:Trump tariffs will cost us $1bn, says NikeLewis Capaldi plays emotional not-so-secret comeback set at Glastonbury Some 200-250 A-list guests from showbusiness, politics and finance are expected to attend the events, with the wedding and its parts estimated to cost €40m-€48m (£34m-£41m). Bezos, his now-wife and their famous guests have taken over numerous locations in the city, with the couple staying in the luxury Aman hotel, where rooms go for at least €4,000 per night. While the couple and their A-list guests were all smiles, some in Venice are not happy about the wedding - with protesters seeing it as an example of the city being gift-wrapped for ultra-rich outsiders. An activist climbed one of the poles in the main St Mark's Square on Thursday, unfurling a banner which said: \"The 1% ruins the world.\" Another party will follow on Saturday - the venue for which was changed at the last minute earlier this week."
    }
]