[
    {
        "title": "Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit",
        "description": "Donald Trump and Vladimir Putin will meet for the first time in six years on Friday, with a possible deal to end the Ukraine war on the agenda.",
        "url": "https://news.sky.com/story/trumps-pride-vs-putins-legacy-what-to-expect-from-pivotal-summit-13411124",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-putin-trump-ukraine_6990186.jpg?20250813231050",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-13 14:34:00",
        "Headline": "An Alaskan army base will be the focus of the world's media when the two leaders come face to face - here's what three of our correspondents think it could mean for the two men and Ukraine.",
        "Content": "Donald Trump and Vladimir Putin will meet for the first time in six years on Friday, with a possible deal to end the Ukraine war on the agenda. Mr Trump has threatened \"very severe consequences\" if his Russian counterpart doesn't agree to a ceasefire at the summit, being hosted at a remote US army base in snowy Anchorage, Alaska. Follow latest updates from Ukraine war But there are fears they will discuss a deal robbing Ukraine of the land currently occupied by Russia - something Volodymyr Zelenskyy has said he won't accept. Here's what three of our correspondents think ahead of the much-anticipated face-to-face. Putin's legacy is at stake - he'll want territory and moreBy Ivor Bennett, Moscow correspondent Putin doesn't just want victory. He needs it. Three and a half years after he ordered the invasion of Ukraine, this war has to end in a visible win for the Russian president. It can't have been for nothing. His legacy is at stake. So the only deal I think he'll be willing to accept at Friday's summit is one that secures Moscow's goals. These include territory (full control of the four Ukrainian regions which Russia has already claimed), permanent neutrality for Kyiv and limits on its armed forces. I expect he'll be trying to convince Trump that such a deal is the quickest path to peace. The only alternative, in Russia's eyes, is an outright triumph on the battlefield. I think Putin's hope is that the American president agrees with this view and then gives Ukraine a choice: accept our terms or go it alone without US support. A deal like that might not be possible this week, but it may be in the future if Putin can give Trump something in return. That's why there's been lots of talk from Moscow this week about all the lucrative business deals that can come from better US-Russia relations. The Kremlin will want to use this opportunity to remind the White House of what else it can offer, apart from an end to the fighting. Read more:What could Ukraine be asked to give up?Trump-Putin summit starting to feel quite 'Midnight Sun'  Ukraine would rather this summit not be happeningBy Dominic Waghorn, international affairs editor Ukraine would far rather this meeting wasn't happening. Trump seemed to have lost patience with Putin and was about to hit Russia with more severe sanctions until he was distracted by the Russian leader's suggestion that they meet. Ukrainians say the Alaska summit rewards Putin by putting him back on the world stage. But the meeting is happening, and they have to be realistic. Most of all, they want a ceasefire before any negotiations can happen. Then they want the promise of security guarantees.  That is because they know that Putin may well come back for more even if peace does break out. They need to be able to defend themselves should that happen. And they want the promise of reparations to rebuild their country, devastated by Putin's wanton, unprovoked act of aggression. There are billions of Russian roubles and assets frozen across the West. They want them released and sent their way. What they fear is Trump being hoodwinked by Putin with the lure of profit from US-Russian relations being restored, regardless of Ukraine's fate. That would allow Russia to regain its strength, rearm and prepare for another round of fighting in a few years' time. Trump and his golf buddy-turned-negotiator Steve Witkoff appear to believe Putin might be satisfied with keeping some of the land he has taken by force. Putin says he wants much more than that. He wants Ukraine to cease to exist as a country separate from Russia. Any agreement short of that is only likely to be temporary.  Trump's pride on the line - he has a reputation to restoreBy Martha Kelner, US correspondent As with anything Donald Trump does, he already has a picture in his mind. The image of Trump shaking hands with the ultimate strongman leader, Vladimir Putin, on US soil calls to his vanity and love of an attention-grabbing moment. There is also pride at stake. Trump campaigned saying he would end the Russia-Ukraine war on his first day in office, so there is an element of him wanting to follow through on that promise to voters, even though it's taken him 200-plus days in office and all he's got so far is this meeting, without apparently any concessions on Putin's end. In Trump's mind - and in the minds of many of his supporters - he is the master negotiator, the chief dealmaker, and he wants to bolster that reputation. He is keen to further the notion that he negotiates in a different, more straightforward way than his predecessors and that it is paying dividends. So far, despite sanctions on Russia, despite warnings and deadlines, the situation in Ukraine is only getting worse. He's hoping that this meeting, simply the act of sitting down with Putin, can change the tide. The Russian president may have different ideas."
    },
    {
        "title": "Mosquito bite warning after rise in chikungunya cases in travellers returning to UK",
        "description": "Travellers are being warned about mosquito bites on holiday after a rise in chikungunya infections in people returning to the UK.",
        "url": "https://news.sky.com/story/mosquito-bite-warning-after-rise-in-chikungunya-cases-in-travellers-returning-to-uk-13411070",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-aedes-mosquito-mosquito_6989784.jpg?20250813134412",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-13 12:23:00",
        "Headline": "Doctors say people visiting certain regions should use insect repellent, cover their skin and sleep under bed nets.",
        "Content": "Travellers are being warned about mosquito bites on holiday after a rise in chikungunya infections in people returning to the UK. The UK Health Security Agency (UKHSA) also said the first cases of the emerging oropouche virus had been recorded. Chikungunya typically causes sudden fever and joint pain, which can be debilitating, and lasts from a few days to weeks. The name comes from a word in a Tanzanian language meaning \"that which bends up\", owing to the joint pain associated with it. Most people recover but in some cases the symptoms can last several months or even years. It's spread by mosquito bites in tropical and subtropical regions, and most of the 73 cases reported in the UK so far this year were in London and linked to travel to Sri Lanka, India, and Mauritius. Only 27 cases were reported in the same January to June period last year. \n                  Man accused of driving into Liverpool title parade crowds to appear in court today\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 \n                  UEFA Super Cup: Spurs let slip 2-0 lead to lose to PSG on penalties\n                 Chikungunya can't spread directly from person to person - so if someone becomes ill in the UK, they can't pass the infection on, and the mosquitos responsible aren't present here. Dr Philip Veal, consultant in public health at the UKHSA, said it can be a \"nasty disease\" and the increase in cases was \"worrying\". \"It is essential to take precautions against mosquito bites when travelling,\" he said. More on this story:Thousands fall ill with chikungunya in China \"Simple steps, such as using insect repellent, covering up your skin and sleeping under insecticide-treated bed nets can greatly reduce the risk.\" Chikungunya is mainly found in Asia and Africa, but cases have been reported in Europe and North America this year. Two vaccines to guard against the infection are available in the UK from private travel clinics. The first cases of the Oropouche virus have also been confirmed in Britain, according to the UKHSA. It's spread by midge and mosquito bites and the three cases are all linked to travel to Brazil. Oropouche was first identified in Trinidad and Tobago in the 1950s and had been mainly confined to the Amazon area. However, cases have been increasing since 2023 and have shown up in places such as the Dominican Republic, Cuba, and Peru. Read more from Sky News:Swarm of jellyfish shuts down nuclear plantVaccine gives hope for pancreatic cancer patients Symptoms include fever, headache, muscle and joint pain, nausea and vomiting. Anyone who gets such symptoms after being in Central and South America or the Caribbean is advised to get urgent medical advice. Most people recover on their own, but it can cause severe disease in the very elderly or those with a weak immune system."
    },
    {
        "title": "Trump praises Frank Spencer actor as he prepares for major summit - sometimes the script writes itself",
        "description": "It's official. Donald Trump will host the 2025 Kennedy Center Honors - Washington's annual black-tie celebration of artistic achievement.",
        "url": "https://news.sky.com/story/trump-praises-frank-spencer-actor-as-he-prepares-for-major-summit-sometimes-the-script-writes-itself-13411315",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-frank-spencer-donald_6990179.jpg?20250813224558",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-08-13 19:54:00",
        "Headline": "The actor Michael Crawford is firmly in the US president's cultural sweet spot - but Donald Trump may not be aware of the comedy role that made him famous in the UK.   ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It's official. Donald Trump will host the 2025 Kennedy Center Honors - Washington's annual black-tie celebration of artistic achievement. In previous years, occupants of the White House simply attended the event in the building named after President John F Kennedy. Earlier this year, the US president sacked the board and installed himself as chairman and is threatening to put his own name on the door. \"GREAT nominees for the TRUMP/KENNEDY Center, whoops, I mean KENNEDY CENTER AWARDS…\" he posted on his Truth Social platform. Vowing that the show will be \"non-woke\", he announced this year's nominees - a stroll through Trump's cultural sweet spot: Crawford's West End and Broadway career spans Barnum, The Woman in White and, of course, The Phantom Of The Opera.. The Phantom's tendency to buy grand, chandelier-filled buildings, has won the approval of the real-estate mogul now remodelling the White House. \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 \n                  Pictures of 'zombie-rabbits' with twisting black horns go viral - so are they real?\n                 \n                  National Guard arrives on streets of Washington DC despite 'historic' lows in crime\n                 Read more:Trump's aims for Putin summit appear fluidThe snowy remote base where Trump will host Putin for talks  But there's something Americans might have missed - the character who made Michael Crawford a household name back home: Frank Spencer. The star of the sitcom \"Some Mothers Do 'Ave 'Em\" was endlessly optimistic but completely hapless, and oblivious to his own incompetence. Revealing that he would host the awards himself, just two days before he hosts Vladimir Putin, is quintessential Trump, the prime-time president. But \"Ooh Betty,\" as Frank Spencer would say, when Donald Trump extols Michael Crawford, an icon of slapstick comedy, the script writes itself."
    },
    {
        "title": "UEFA Super Cup: Spurs let slip 2-0 lead to lose to PSG on penalties",
        "description": "Tottenham let slip a two-goal lead before losing a penalty shootout to Paris St Germain (PSG) in the final of the UEFA Super Cup.",
        "url": "https://news.sky.com/story/uefa-super-cup-spurs-let-slip-2-0-lead-to-lose-to-psg-on-penalties-13411364",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tottenham-psg_6990196.jpg?20250813234619",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-13 22:17:00",
        "Headline": "Thomas Frank was looking set to win a major trophy in his first game as Tottenham manager when his side went two goals up at the Bluenergy Stadium in Udine, Italy, but late drama saw them come unstuck.",
        "Content": "Tottenham let slip a two-goal lead before losing a penalty shootout to Paris St Germain (PSG) in the final of the UEFA Super Cup. Spurs defenders Micky van de Ven and Cristian Romero scored from set pieces to put the north London side on their way to winning the trophy, in what was manager Thomas Frank's first game in charge. However, Champions League winners PSG, who were thrashed in the Club World Cup final by Chelsea last month, produced a stunning response after Kang-in Lee pulled one back with five minutes left. PSG striker Goncalo Ramos, who was brought on in the 77th minute, forced the game to penalties after scoring a header in the fourth minute of stoppage time. The Super Cup final, played each year between the winners of the Champions League and Europa League, does not feature extra time - meaning the game went straight to spot kicks. Europa League winners Tottenham initially had the advantage when Vitinha missed PSG's first kick - but it was followed by Van de Ven and Mathys Tel failing to score their penalties. PSG, managed by Luis Enrqiue, went on to win 4-3. The PSG players poured on to the pitch in celebration, knowing they had etched their names into history as the first French side to lift the trophy. \"It's incredible to win like this. This team once again showed character, even if we're not at our physical best,\" PSG defender Marquinhos said. Read more from Sky News:Three teens in court over man's murderWhat to expect from Trump-Putin summit \"We managed to get the goals we needed through the substitutions, and in the shootout we have players who take their penalties well and a goalkeeper who helped us.\" Tottenham, who finished 17th in the Premier League last season, were unable to win what would have been their second trophy in 17 years - with the first one coming when they beat Manchester United in Europe's second-tier competition in May."
    },
    {
        "title": "Man staying at hotel that has been focus of protests denies sexual assault charge",
        "description": "A man staying at a hotel that has been the focus of a series of protests has denied a charge of sexual assault and faces a trial next month.",
        "url": "https://news.sky.com/story/man-staying-at-hotel-that-has-been-focus-of-protests-denies-sexual-assault-charge-13411127",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-bell-hotel-epping_6967902.jpg?20250718155828",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-13 14:31:00",
        "Headline": "Mohammed Sharwarq, a 32-year-old Syrian national, has also denied two counts of common assault and four counts of assault by beating.",
        "Content": "A man staying at a hotel that has been the focus of a series of protests has denied a charge of sexual assault and faces a trial next month. Mohammed Sharwarq, a 32-year-old Syrian national, was arrested after police were called to the Bell Hotel on the Epping High Road in Essex yesterday, police said. Sharwarq, who is alleged to have kissed a man on the neck, indicated a plea of not guilty to a charge of sexual assault at Chelmsford Magistrates' Court today. He indicated guilty pleas to six further charges concerning four complainants - with two counts of common assault and four of assault by beating. Sharwarq is alleged to have punched a man in the face, thrown an object at a man, slapped a third man in the face and attempted to punch a fourth. Sky News understands the alleged offences took place inside the hotel between 25 July and 12 August. Read more from Sky News:Three teens in court over man's murderWhat to expect from Trump-Putin summit District judge Lynette Woodrow remanded Sharwarq, who was assisted in court by an Arabic interpreter, in custody until his trial on 30 September. The arrest followed weeks of protests outside the hotel. Neil Hudson, the Conservative MP for Epping Forest, said last month that the protests were a crisis that \"risks boiling over\"."
    },
    {
        "title": "European wildfires kill at least three as British bar worker joins emergency efforts on Greek island",
        "description": "Wildfires intensified across southern Europe on Wednesday with at least three deaths reported in Spain, Turkey and Albania.",
        "url": "https://news.sky.com/story/european-wildfires-kill-at-least-three-as-british-bar-worker-joins-emergency-efforts-on-greek-island-13411288",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-greece-europe-heatwave_6989590.jpg?20250813085545",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-13 18:42:00",
        "Headline": "Thousands of residents have been evacuated as emergency teams continue to battle large fires across southern Europe amid record-breaking temperatures.",
        "Content": " Wildfires intensified across southern Europe on Wednesday with at least three deaths reported in Spain, Turkey and Albania. Firefighting teams in several countries are struggling to contain numerous fires after weeks of heatwaves and soaring temperatures across the Mediterranean. Emergency teams are working around the clock to protect the outskirts of Patras, Greece's third-largest city, and blazes are raging on numerous Greek islands. A British bar worker on Zakynthos has told Sky News how he joined emergency services and locals to help combat a \"shocking\" fire near a popular tourist resort. Aircraft rotated between blazes on the western Greek mainland, the Patras area and Zakynthos. On the Greek island of Chios, exhausted firefighters slept on the roadside following a night-long shift. Crews struggled to protect homes and agricultural facilities around the port city of Patras as flames tore through pine forests and olive groves. Columns of flames rose behind apartment blocks on the outskirts of the city and dozens of vehicles were torched. Athens also provided aid to neighbouring Albania as part of a wider international response to tackle dozens of wildfires. An 80-year-old man died in a fire south of the capital Tirana, officials reported on Wednesday. In Spain, a firefighting volunteer in the hard-hit Castile and Leon region north of Madrid, has died, Spanish Prime Minister Pedro Sanchez said. Thousands have been displaced by evacuations in the region. \"The wildfire situation remains serious, and taking extra precautions is essential,\" Mr Sanchez wrote in a post on social media. In southern Turkey, officials said a forestry worker died on Wednesday while responding to a wildfire. The Forestry Ministry said the worker's death was caused by an accident involving a fire truck, which also injured four others. Since late June, Turkey has been fighting intense wildfires, resulting in 18 deaths so far, including 10 rescue volunteers and forestry workers who died in July. British bar worker helps firefighters On the popular Greek island of Zakynthos, also known as Zante, British national Richard Hall told Sky News on Wednesday that two fires were still raging on the island. One of the fires started Tuesday night, and Mr Hall, along with colleagues from the Kostas Pool Bar Kalamaki and local residents, went to the scene to assist emergency teams. \"We do our best and obviously take advice from the emergency services before doing anything,\" he said. Mr Hall said helicopters were still circling the area on Wednesday. \"It's shocking, but everybody is safe. The local government and authorities have been doing a fantastic job,\" he said. Fellow Brits have also been helping local authorities, he added. Mr Hall pointed out that the dry weather and dry grass increase the risk of more fires, especially those sparked by cigarettes, and called for caution. Read more:The West Bank city locked down by armed troopsLand Ukraine could be forced to give up The European Union has been sending aid, including ground crews and water-dropping aircraft, to fire-stricken countries, even non-members. Much of the recent help has focused on Montenegro, where wildfires near the capital Podgorica continue to burn. \"Natural disasters know no borders,\" said Ljuban Tmusic, head of Montenegro's civil protection agency. \"Our resources clearly aren't enough.\""
    },
    {
        "title": "Hashem Abedi: Manchester Arena bomb plotter charged with three counts of attempted murder",
        "description": "Manchester Arena bomb plotter Hashem Abedi has been charged with three counts of attempted murder.",
        "url": "https://news.sky.com/story/hashem-abedi-manchester-arena-bomb-plotter-charged-with-three-counts-of-attempted-murder-13411196",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hashem-abedi-manchester-arena_6989923.jpg?20250813165629",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-13 15:42:00",
        "Headline": "The charges come after four prison officers were injured in an attack at HMP Frankland in Co Durham in April.",
        "Content": "Manchester Arena bomb plotter Hashem Abedi has been charged with three counts of attempted murder. It comes after four prison officers were injured in an attack at the maximum security prison HMP Frankland in Co Durham on 12 April. Abedi has also been charged with one count of assault occasioning actual bodily harm and one count of unauthorised possession of a knife or offensive weapon. Counter Terrorism Policing North East has said it carried out a \"thorough investigation\" of the incident with Durham Constabulary and HMP Frankland. He remains in prison and is due to appear at Westminster Magistrates' Court on 18 September. Three prison officers were taken to hospital with serious injuries following the incident."
    },
    {
        "title": "Mosquito bite warning after rise in chikungunya cases in travellers returning to UK",
        "description": "Travellers are being warned about mosquito bites on holiday after a rise in chikungunya infections in people returning to the UK.",
        "url": "https://news.sky.com/story/mosquito-bite-warning-after-rise-in-chikungunya-cases-in-travellers-returning-to-uk-13411070",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-aedes-mosquito-mosquito_6989784.jpg?20250813134412",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 12:23:00",
        "Headline": "Doctors say people visiting certain regions should use insect repellent, cover their skin and sleep under bed nets.",
        "Content": "Travellers are being warned about mosquito bites on holiday after a rise in chikungunya infections in people returning to the UK. The UK Health Security Agency (UKHSA) also said the first cases of the emerging oropouche virus had been recorded. Chikungunya typically causes sudden fever and joint pain, which can be debilitating, and lasts from a few days to weeks. The name comes from a word in a Tanzanian language meaning \"that which bends up\", owing to the joint pain associated with it. Most people recover but in some cases the symptoms can last several months or even years. It's spread by mosquito bites in tropical and subtropical regions, and most of the 73 cases reported in the UK so far this year were in London and linked to travel to Sri Lanka, India, and Mauritius. Only 27 cases were reported in the same January to June period last year. \n                  Man accused of driving into Liverpool title parade crowds to appear in court today\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 \n                  UEFA Super Cup: Spurs let slip 2-0 lead to lose to PSG on penalties\n                 Chikungunya can't spread directly from person to person - so if someone becomes ill in the UK, they can't pass the infection on, and the mosquitos responsible aren't present here. Dr Philip Veal, consultant in public health at the UKHSA, said it can be a \"nasty disease\" and the increase in cases was \"worrying\". \"It is essential to take precautions against mosquito bites when travelling,\" he said. More on this story:Thousands fall ill with chikungunya in China \"Simple steps, such as using insect repellent, covering up your skin and sleeping under insecticide-treated bed nets can greatly reduce the risk.\" Chikungunya is mainly found in Asia and Africa, but cases have been reported in Europe and North America this year. Two vaccines to guard against the infection are available in the UK from private travel clinics. The first cases of the Oropouche virus have also been confirmed in Britain, according to the UKHSA. It's spread by midge and mosquito bites and the three cases are all linked to travel to Brazil. Oropouche was first identified in Trinidad and Tobago in the 1950s and had been mainly confined to the Amazon area. However, cases have been increasing since 2023 and have shown up in places such as the Dominican Republic, Cuba, and Peru. Read more from Sky News:Swarm of jellyfish shuts down nuclear plantVaccine gives hope for pancreatic cancer patients Symptoms include fever, headache, muscle and joint pain, nausea and vomiting. Anyone who gets such symptoms after being in Central and South America or the Caribbean is advised to get urgent medical advice. Most people recover on their own, but it can cause severe disease in the very elderly or those with a weak immune system."
    },
    {
        "title": "Man staying at hotel that has been focus of protests denies sexual assault charge",
        "description": "A man staying at a hotel that has been the focus of a series of protests has denied a charge of sexual assault and faces a trial next month.",
        "url": "https://news.sky.com/story/man-staying-at-hotel-that-has-been-focus-of-protests-denies-sexual-assault-charge-13411127",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-bell-hotel-epping_6967902.jpg?20250718155828",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 14:31:00",
        "Headline": "Mohammed Sharwarq, a 32-year-old Syrian national, has also denied two counts of common assault and four counts of assault by beating.",
        "Content": "A man staying at a hotel that has been the focus of a series of protests has denied a charge of sexual assault and faces a trial next month. Mohammed Sharwarq, a 32-year-old Syrian national, was arrested after police were called to the Bell Hotel on the Epping High Road in Essex yesterday, police said. Sharwarq, who is alleged to have kissed a man on the neck, indicated a plea of not guilty to a charge of sexual assault at Chelmsford Magistrates' Court today. He indicated guilty pleas to six further charges concerning four complainants - with two counts of common assault and four of assault by beating. Sharwarq is alleged to have punched a man in the face, thrown an object at a man, slapped a third man in the face and attempted to punch a fourth. Sky News understands the alleged offences took place inside the hotel between 25 July and 12 August. Read more from Sky News:Three teens in court over man's murderWhat to expect from Trump-Putin summit District judge Lynette Woodrow remanded Sharwarq, who was assisted in court by an Arabic interpreter, in custody until his trial on 30 September. The arrest followed weeks of protests outside the hotel. Neil Hudson, the Conservative MP for Epping Forest, said last month that the protests were a crisis that \"risks boiling over\"."
    },
    {
        "title": "UEFA Super Cup: Spurs let slip 2-0 lead to lose to PSG on penalties",
        "description": "Tottenham let slip a two-goal lead before losing a penalty shootout to Paris St Germain (PSG) in the final of the UEFA Super Cup.",
        "url": "https://news.sky.com/story/uefa-super-cup-spurs-let-slip-2-0-lead-to-lose-to-psg-on-penalties-13411364",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tottenham-psg_6990196.jpg?20250813234619",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 22:17:00",
        "Headline": "Thomas Frank was looking set to win a major trophy in his first game as Tottenham manager when his side went two goals up at the Bluenergy Stadium in Udine, Italy, but late drama saw them come unstuck.",
        "Content": "Tottenham let slip a two-goal lead before losing a penalty shootout to Paris St Germain (PSG) in the final of the UEFA Super Cup. Spurs defenders Micky van de Ven and Cristian Romero scored from set pieces to put the north London side on their way to winning the trophy, in what was manager Thomas Frank's first game in charge. However, Champions League winners PSG, who were thrashed in the Club World Cup final by Chelsea last month, produced a stunning response after Kang-in Lee pulled one back with five minutes left. PSG striker Goncalo Ramos, who was brought on in the 77th minute, forced the game to penalties after scoring a header in the fourth minute of stoppage time. The Super Cup final, played each year between the winners of the Champions League and Europa League, does not feature extra time - meaning the game went straight to spot kicks. Europa League winners Tottenham initially had the advantage when Vitinha missed PSG's first kick - but it was followed by Van de Ven and Mathys Tel failing to score their penalties. PSG, managed by Luis Enrqiue, went on to win 4-3. The PSG players poured on to the pitch in celebration, knowing they had etched their names into history as the first French side to lift the trophy. \"It's incredible to win like this. This team once again showed character, even if we're not at our physical best,\" PSG defender Marquinhos said. Read more from Sky News:Three teens in court over man's murderWhat to expect from Trump-Putin summit \"We managed to get the goals we needed through the substitutions, and in the shootout we have players who take their penalties well and a goalkeeper who helped us.\" Tottenham, who finished 17th in the Premier League last season, were unable to win what would have been their second trophy in 17 years - with the first one coming when they beat Manchester United in Europe's second-tier competition in May."
    },
    {
        "title": "UK weather: Yellow heat health alert extended across large parts of country amid heatwave",
        "description": "A yellow heat health alert has been extended into next week, affecting seven regions in England amid the fourth heatwave of the summer.",
        "url": "https://news.sky.com/story/fourth-uk-heatwave-of-summer-to-peak-today-with-34c-possible-in-some-areas-13411044",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-weather-uk-saltburn_6989733.jpg?20250813123448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 11:27:00",
        "Headline": "The alerts are from 6pm today to 6pm next Monday and affect Yorkshire and The Humber, the East Midlands, the West Midlands, the East of England, London, the South East, and the South West.",
        "Content": "A yellow heat health alert has been extended into next week, affecting seven regions in England amid the fourth heatwave of the summer. The alerts are from 6pm on Wednesday to 6pm next Monday and are for Yorkshire and The Humber, the East Midlands, the West Midlands, the East of England, London, the South East, and South West. The warnings mean significant impacts on health and social care services are possible due to high temperatures, including a potential rise in deaths among the elderly or those with pre-existing health conditions. Alerts were previously due to end at 6pm on Wednesday. Heavy rain and thunder hit London and Kent on Wednesday afternoon, and the Met Office said it was likely the South East would continue to experience thick clouds and a risk of heavy thundery showers overnight. Northern England and Northern Ireland were expected to have isolated afternoon and evening thunderstorms. The Met Office issued a yellow thunderstorm warning for most of Scotland from 2pm until midnight, with the potential for up to 30mm of rain in less than an hour, and 50mm locally, as well as hail and gusty winds. \n                  UK weather: Water shortfall declared 'nationally significant' - as amber heat health alert comes into force\n                 \n                  UK weather: Amber heat health alert issued for large parts of England\n                 \n                  UK weather: Yellow heat health alert issued - with temperatures set to hit 30C and a fourth summer heatwave forecast\n                 Tuesday's temperatures reached 33.4C in Benson in Oxfordshire and Ross-on-Wye in Herefordshire. It's predicted to cool by a couple of degree as the week goes - but will stay very warm. \"On Thursday, there will still be a few showers, particularly in the North, and it will not be quite as hot, but temperatures will still peak around 29C to 30C in East and South East England,\" said Marco Petagna, a meteorologist at the Met Office. \"Friday looks mostly fine, with very hot sunshine in the South and South East, where temperatures could reach 31C, while Scotland will see highs in the low 20s.\" Read more:Get the Sky News weather forecast for your areaThree teenagers charged with man's murder at seaside resort The National Drought Group - which includes the Met Office, water firms and others - met on Tuesday over what it said was now a \"nationally significant incident\" in England. Five areas remain in drought and six more are in prolonged dry weather status. The group said it had been the driest six months to July since 1976, and the latest heatwave was putting more pressure on water supplies. A hosepipe ban remains in place in Yorkshire, while Thames Water, South East Water and Southern Water have bans in certain postcodes."
    },
    {
        "title": "Hashem Abedi: Manchester Arena bomb plotter charged with three counts of attempted murder",
        "description": "Manchester Arena bomb plotter Hashem Abedi has been charged with three counts of attempted murder.",
        "url": "https://news.sky.com/story/hashem-abedi-manchester-arena-bomb-plotter-charged-with-three-counts-of-attempted-murder-13411196",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hashem-abedi-manchester-arena_6989923.jpg?20250813165629",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 15:42:00",
        "Headline": "The charges come after four prison officers were injured in an attack at HMP Frankland in Co Durham in April.",
        "Content": "Manchester Arena bomb plotter Hashem Abedi has been charged with three counts of attempted murder. It comes after four prison officers were injured in an attack at the maximum security prison HMP Frankland in Co Durham on 12 April. Abedi has also been charged with one count of assault occasioning actual bodily harm and one count of unauthorised possession of a knife or offensive weapon. Counter Terrorism Policing North East has said it carried out a \"thorough investigation\" of the incident with Durham Constabulary and HMP Frankland. He remains in prison and is due to appear at Westminster Magistrates' Court on 18 September. Three prison officers were taken to hospital with serious injuries following the incident."
    },
    {
        "title": "Three teenagers appear in court charged with murder of man at seaside resort",
        "description": "Three teenagers have been charged with the murder of a man in Kent.",
        "url": "https://news.sky.com/story/three-teenagers-charged-with-murder-after-death-of-man-49-in-kent-13410889",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-alexander-cashford_6989677.jpg?20250813112844",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 10:18:00",
        "Headline": "Alexander Cashford, 49, was found dead at the scene in Leysdown-on-Sea, on the Isle of Sheppey, shortly after 7pm on Sunday.",
        "Content": "Three teenagers have been charged with the murder of a man in Kent. Kent Police were called to an incident in Leysdown-on-Sea, on the Isle of Sheppey, shortly after 7pm on Sunday. Alexander Cashford, 49, from Kent, was found dead at the scene, having suffered multiple injuries. He was allegedly assaulted following a \"disturbance involving a small group of people\", according to police. A 16-year-old girl and two boys, aged 14 and 15, were arrested and taken into custody shortly after. The three suspects, who were all from London, were charged with murder by joint venture on Tuesday. They appeared at Medway Magistrates' Court on Wednesday. The teenagers cannot be named for legal reasons. \n                  Man who plotted to murder gang member involved in record-breaking heist attacked in prison\n                 \n                  'Restriction zones' to be introduced for domestic abusers\n                 \n                  Daniel Gunter guilty of murdering his two-week-old baby son in hospital\n                 The defendants were accompanied in the well of the court by their parents. Other family members were in the public gallery. Prosecuting, Dylan Bradshaw said: \"What we know is that Alexander Cashford, a 49-year-old male, shortly after 7pm on Sunday August 10, went to the beach area of Warden's Bay. \"About an hour and five mins later, he was pronounced dead - during that period, he was the subject of a violent assault.\" The 16-year-old and 14-year-old both cried during the hearing, while the 15-year-old looked at the floor, rocking slightly. The girl and two boys have been remanded into youth detention accommodation to appear on Thursday at Maidstone Crown Court. A 12-year-old girl was arrested on Tuesday in Basildon, Essex, in connection with the incident. She remains in custody while enquiries continue. Read more from Sky News:Jay Blades appears in court charged with rapeBacklash over police vans with facial recognition  Kent Police are appealing for witnesses who have not yet spoken to detectives to contact the force."
    },
    {
        "title": "Mohamed al Fayed: 146 people report crimes to police investigation",
        "description": "The Metropolitan Police&#160;say a total of  146 people have now stepped forward&#160;to report crimes as part of their ongoing investigation into former Harrods owner Mohamed al Fayed.  ",
        "url": "https://news.sky.com/story/mohamed-al-fayed-146-people-report-crimes-to-police-investigation-13411186",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-harrods-fayed_6941749.jpg?20250614091908",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 15:35:00",
        "Headline": "No subtitle found",
        "Content": "The Metropolitan Police say a total of  146 people have now stepped forward to report crimes as part of their ongoing investigation into former Harrods owner Mohamed al Fayed.   Police said updates in the case were shared with all victims during a video briefing on Monday. The latest figure is more than double the 61 people officers said had reported allegations the last time it released a number, back in October. The Met also announced last year that it was conducting an investigation into how it handled historical allegations against the former Harrods and Fulham FC owner, who died in August 2023, aged 94. It was initially contacted by 21 different women who made allegations including rape and sexual assault, between 2005 and 2023. Subsequently, a file of evidence was passed to the Crown Prosecution Service to decide whether to charge al Fayed in just two cases. Announcing the latest figures, released on Wednesday, a spokesperson for the Metropolitan Police said: \"The live investigation into those who could have facilitated or enabled Mohamed al Fayed's offending continues. The spokesperson added: \"We continue to support all victims and we urge anyone with information, whether they were directly affected by Mohamed al Fayed's actions or aware of others who may have been involved, or committed offences to come forward.\" \n                  Mosquito bite warning after rise in chikungunya cases in travellers returning to UK\n                 \n                  Man accused of driving into Liverpool title parade crowds to appear in court today\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 The Met also said it \"moved on immeasurably\" in the way it investigates rape and sexual offences. \"We're working with partners across the criminal justice system to ensure that victim-survivors are at the heart of our response, with a greater focus on suspects and their offending,\" it said in its latest statement. Al Fayed is suspected of having raped or sexually abused hundreds of women over the 25 years he owned Harrods. Since his death, numerous victims have come forward, revealing a torrent of details about his abuse. Earlier this year, Sky News revealed details of the compensation scheme designed by Harrods to award six-figure sums to women he abused. Even so, there appeared to be confusion about the legal representation of his estate. In March, the BBC reported that Fladgate, a UK-based law firm, was representing it in an article which said that women who worked for him as nannies and private air stewards were preparing to file legal claims against the estate. However, in June, a spokesman for Fladgate declined to comment on whether it was acting for al Fayed's estate, citing confidentiality restrictions. A source close to the law firm insisted that it was not acting for the estate. KP Law, another law firm representing abuse survivors, has criticised the process led by Harrods. The firm has also faced scrutiny over plans to take up to 25% of compensation payouts as fees for managing the cases. The Egyptian-born businessman owned the luxury London department store between 1985 and 2010."
    },
    {
        "title": "Moor fire near North Yorkshire RAF base declared major incident",
        "description": "A moorland fire near an RAF base in North Yorkshire has been declared a major incident.",
        "url": "https://news.sky.com/story/moor-fire-near-north-yorkshire-raf-base-declared-major-incident-13411256",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-fire-langdale-moor_6990004.jpg?20250813181815",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 17:15:00",
        "Headline": "Pictures taken by Bedale fire station showed the fire burning overnight, while daytime drone video showed huge flames and vast clouds of smoke.",
        "Content": "A moorland fire near an RAF base in North Yorkshire has been declared a major incident. Crews were first called to Langdale Moor after reports of smoke on Monday and found the blaze had jumped a firebreak. An overnight watch took place but by Tuesday morning, the fire covered 300 x 300m, growing to 1km x 1km by the afternoon. Water bowsers, six fire engines and all-terrain vehicles were being used to fight the fire - near RAF Fylingdales - early on Wednesday. North Yorkshire Fire Service said the blaze had shrunk overnight, but by 12.30pm it had spread to cover 5sq km and was declared a major incident. Pictures posted on Facebook by Bedale fire station showed the fire burning overnight, while drone footage filmed on Tuesday showed huge flames and vast clouds of smoke. More resources are now being sent to the scene in an effort to bring it under control. The hot, dry weather in the UK has made such fires more likely and a fire on heathland in Dorset was also declared a major incident at the weekend. Crews were still on site at Holt Heath today, dealing with hotspots and occasional flare-ups sparked by wind. However, Dorset and Wiltshire Fire Service said \"good progress\" was being made across all four sectors of the incident. Wildfires causing havoc in Europe European nations have been dealing with much more destructive fires this summer in what is becoming a growing problem - especially in the south of the continent. At least 1,400 firefighters were deployed in France's southern Aude region last week to try to stop the country's biggest wildfire in decades from reigniting.  About 7,700 residents were also evacuated yesterday from near the Greek city of Patras, west of Athens. People were also ordered to move as fires spread on the popular holiday islands of Chios and Kefalonia. Read more from Sky News:Jay Blades appears in court charged with rapeBacklash over police vans with facial recognition In Spain, a 35-year-old volunteer firefighter died from burns after trying to build firebreaks near the town of Nogarejas. He is the sixth person to die in wildfires in the country this year. Other serious fires have also broken out this summer in Turkey and Albania, where authorities said 10,000 personnel were battling 24 wildfires."
    },
    {
        "title": "Police release image of car they want to trace after man is shot dead near petrol station",
        "description": "Police have released an image of a car they want to trace after a man was shot dead near a petrol station in West Yorkshire.",
        "url": "https://news.sky.com/story/police-release-image-of-car-they-want-to-trace-after-man-is-shot-dead-near-petrol-station-13411295",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-toyota-car_6990086.jpg?20250813202007",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-13 18:59:00",
        "Headline": "A murder investigation has been launched after a man was gunned down in Wakefield, West Yorkshire, on Tuesday night.",
        "Content": "Police have released an image of a car they want to trace after a man was shot dead near a petrol station in West Yorkshire. Officers received a report at 9:43pm on Tuesday that a man had been seriously injured after a shot was fired from a car on Doncaster Road near the BP petrol station in Wakefield. The victim was taken to hospital where he died from his injuries. Police said he is understood to be a 50-year-old man who was living in the local area. A murder investigation has been launched and the victim's immediate family are being supported by specially-trained officers. The force said it believes the vehicle used in the offence was \"on false plates\" and was stolen in a burglary in Castleford, West Yorkshire, on 3 August. Police believe the car is a blue/grey-coloured Toyota RAV4 with a grey trim, displaying cloned plates FV53 FXT. \n                  Mosquito bite warning after rise in chikungunya cases in travellers returning to UK\n                 \n                  Man accused of driving into Liverpool title parade crowds to appear in court today\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 The vehicle is described as being \"distinctive due to having bull lights on the roof above the windshield\". Anyone who may have seen the car following the suspected burglary or around the time of the shooting has been asked to contact the force. Police said the car may now have different number plates. Read more from Sky News:Jay Blades appears in court charged with rapeBacklash over police vans with facial recognition Detective Chief Inspector James Entwistle, of West Yorkshire Police's homicide and major inquiry team, said: \"A man has lost his life, and it is an absolute priority for us to understand the circumstances of what has taken place and identify anyone who has had any involvement in this incident.\" He added: \"Motorists who were in the Doncaster Road area last night who have dashcams fitted are also asked to check whether they have captured any footage of this vehicle. \"The driver was driving in the direction of Wakefield before they have turned around near the BP petrol station immediately prior to the shooting and then driven off in the direction they came from.\" DCI Entwistle said the force is \"dedicating significant resources\" to the investigation and there is an increased police presence in the area to \"provide reassurance to the community\"."
    },
    {
        "title": "Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit",
        "description": "Donald Trump and Vladimir Putin will meet for the first time in six years on Friday, with a possible deal to end the Ukraine war on the agenda.",
        "url": "https://news.sky.com/story/trumps-pride-vs-putins-legacy-what-to-expect-from-pivotal-summit-13411124",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-putin-trump-ukraine_6990186.jpg?20250813231050",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-13 14:34:00",
        "Headline": "An Alaskan army base will be the focus of the world's media when the two leaders come face to face - here's what three of our correspondents think it could mean for the two men and Ukraine.",
        "Content": "Donald Trump and Vladimir Putin will meet for the first time in six years on Friday, with a possible deal to end the Ukraine war on the agenda. Mr Trump has threatened \"very severe consequences\" if his Russian counterpart doesn't agree to a ceasefire at the summit, being hosted at a remote US army base in snowy Anchorage, Alaska. Follow latest updates from Ukraine war But there are fears they will discuss a deal robbing Ukraine of the land currently occupied by Russia - something Volodymyr Zelenskyy has said he won't accept. Here's what three of our correspondents think ahead of the much-anticipated face-to-face. Putin's legacy is at stake - he'll want territory and moreBy Ivor Bennett, Moscow correspondent Putin doesn't just want victory. He needs it. Three and a half years after he ordered the invasion of Ukraine, this war has to end in a visible win for the Russian president. It can't have been for nothing. His legacy is at stake. So the only deal I think he'll be willing to accept at Friday's summit is one that secures Moscow's goals. These include territory (full control of the four Ukrainian regions which Russia has already claimed), permanent neutrality for Kyiv and limits on its armed forces. I expect he'll be trying to convince Trump that such a deal is the quickest path to peace. The only alternative, in Russia's eyes, is an outright triumph on the battlefield. I think Putin's hope is that the American president agrees with this view and then gives Ukraine a choice: accept our terms or go it alone without US support. A deal like that might not be possible this week, but it may be in the future if Putin can give Trump something in return. That's why there's been lots of talk from Moscow this week about all the lucrative business deals that can come from better US-Russia relations. The Kremlin will want to use this opportunity to remind the White House of what else it can offer, apart from an end to the fighting. Read more:What could Ukraine be asked to give up?Trump-Putin summit starting to feel quite 'Midnight Sun'  Ukraine would rather this summit not be happeningBy Dominic Waghorn, international affairs editor Ukraine would far rather this meeting wasn't happening. Trump seemed to have lost patience with Putin and was about to hit Russia with more severe sanctions until he was distracted by the Russian leader's suggestion that they meet. Ukrainians say the Alaska summit rewards Putin by putting him back on the world stage. But the meeting is happening, and they have to be realistic. Most of all, they want a ceasefire before any negotiations can happen. Then they want the promise of security guarantees.  That is because they know that Putin may well come back for more even if peace does break out. They need to be able to defend themselves should that happen. And they want the promise of reparations to rebuild their country, devastated by Putin's wanton, unprovoked act of aggression. There are billions of Russian roubles and assets frozen across the West. They want them released and sent their way. What they fear is Trump being hoodwinked by Putin with the lure of profit from US-Russian relations being restored, regardless of Ukraine's fate. That would allow Russia to regain its strength, rearm and prepare for another round of fighting in a few years' time. Trump and his golf buddy-turned-negotiator Steve Witkoff appear to believe Putin might be satisfied with keeping some of the land he has taken by force. Putin says he wants much more than that. He wants Ukraine to cease to exist as a country separate from Russia. Any agreement short of that is only likely to be temporary.  Trump's pride on the line - he has a reputation to restoreBy Martha Kelner, US correspondent As with anything Donald Trump does, he already has a picture in his mind. The image of Trump shaking hands with the ultimate strongman leader, Vladimir Putin, on US soil calls to his vanity and love of an attention-grabbing moment. There is also pride at stake. Trump campaigned saying he would end the Russia-Ukraine war on his first day in office, so there is an element of him wanting to follow through on that promise to voters, even though it's taken him 200-plus days in office and all he's got so far is this meeting, without apparently any concessions on Putin's end. In Trump's mind - and in the minds of many of his supporters - he is the master negotiator, the chief dealmaker, and he wants to bolster that reputation. He is keen to further the notion that he negotiates in a different, more straightforward way than his predecessors and that it is paying dividends. So far, despite sanctions on Russia, despite warnings and deadlines, the situation in Ukraine is only getting worse. He's hoping that this meeting, simply the act of sitting down with Putin, can change the tide. The Russian president may have different ideas."
    },
    {
        "title": "Trump's targets for Putin summit appear fluid - can he even get a ceasefire?",
        "description": "The \"if\" was doing some heavy lifting.",
        "url": "https://news.sky.com/story/is-the-trump-putin-meeting-a-listening-exercise-or-an-attempt-to-secure-an-immediate-ceasefire-13411293",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kharkiv-ukraine-russia-war-invasion_6988607.jpg?20250812080421",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-08-13 18:39:00",
        "Headline": "The US president has been fluid on what the meeting in Alaska on Friday can really achieve.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The \"if\" was doing some heavy lifting. Mr Trump floated the idea of a second meeting, this one between Putin, Zelenskyy and possibly himself, \"if\" the Alaska summit goes well. Speaking to European leaders earlier, in a virtual call he rated at \"10\" and \"very friendly\", he'd shared his intention to try to broker a ceasefire on Friday. So, the strategy is crystallising - he will press for a trilateral meeting to discuss territory \"if\" he manages to secure a truce during the bilateral meeting. But that begs the obvious question: what if he can't? The US president is keeping his options open - rating the chance of a second meeting as \"very good\" but preparing the ground for failure too. \"There may be no second meeting because if I feel that it is not appropriate to have it because I didn't get the answers that we have to have, then we're not going to have a second meeting,\" he said. \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  The snowy remote army base where Trump will host Putin for talks\n                 \n                  Trump-Putin summit starting to feel quite 'Midnight Sun' - as White House confirms location\n                 Unusually, given how often he talks about his abilities, he conceded that he may not persuade Vladimir Putin to stop targeting civilians.  Read MoreTrump's threat to Putin - Ukraine latestWhat could Ukraine be asked to give up?Sky News' Ukraine Q&A But without elaborating on what any sanctions might be, he warned that Russia would face \"very severe consequences\" if it doesn't end the war. Even if he achieves the seemingly impossible - a halt to the fighting - there seems little chance of agreement on any swapping of territory. Mr Zelenskyy has told Mr Trump that Putin \"is bluffing\" and wants to \"push forward along the whole front\" not return land. In the space of a week, Donald Trump has gone from talking about a land-swapping deal, to a \"listening exercise\", to the potential for a ceasefire. His expectations appear changeable, an indication of how fluid back-room negotiations are in the run-up to his first face-to-face with Vladimir Putin in six years. He described Friday's summit as \"setting the table for a second meeting\", but that's presumptuous when the meal - or deal - isn't cooked yet."
    },
    {
        "title": "Over 100 people killed in Gaza in 24 hours, officials say, marking deadliest day in a week",
        "description": "More than 100 people have been killed in Gaza within 24 hours, officials there have said - the deadliest day recorded in a week.",
        "url": "https://news.sky.com/story/over-100-people-killed-in-gaza-in-24-hours-officials-say-marking-deadliest-day-in-a-week-13411088",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-palestinians-israel_6989593.jpg?20250813085729",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-13 12:58:00",
        "Headline": "Eastern areas of Gaza City were bombed heavily by Israeli planes and tanks, according to residents, who say many homes were destroyed in the Zeitoun and Shejaia neighbourhoods overnight. ",
        "Content": "More than 100 people have been killed in Gaza within 24 hours, officials there have said - the deadliest day recorded in a week. The Gaza health ministry said 123 people were killed, adding to the tens of thousands of fatalities during the near two-year war raging in the Strip. It comes as officials said Israel's planned re-seizure of Gaza City, which it took in the early days of the war before withdrawing, is likely weeks away. Follow the latest: Netanyahu accused of having 'lost the plot'  Eastern areas of Gaza City were bombed heavily by Israeli planes and tanks, according to residents, who said that many homes were destroyed in the Zeitoun and Shejaia neighbourhoods overnight. Al-Ahli hospital said 12 people were killed in an airstrike on a house in Zeitoun. Israeli tanks also destroyed several homes in the southern Gaza city of Khan Younis, Palestinian medics said.  They added that in central Gaza, Israeli gunfire killed nine people seeking aid in two separate incidents. The Israel Defence Forces (IDF) did not comment on this. The number of Palestinians who died of starvation and malnutrition in Gaza has risen to 235, including 106 children, since the war began, following the death of eight more people, including three children, in the past 24 hours, the Gaza health ministry said. The malnutrition and hunger death figures have been reported by the Hamas-run ministry and have been disputed by Israel. Israeli Prime Minister Benjamin Netanyahu said on Sunday: \"If we had a starvation policy, no one in Gaza would have survived after two years of war.\" He also repeated the allegation that Hamas has been looting aid trucks and claimed uncollected food has been \"rotting\" at the border, blaming the UN for not distributing it. The latest death figures come as Hamas held further talks with Egyptian mediators in Cairo with a focus on stopping the war, delivering aid and \"enduring the suffering of our people in Gaza\", an official for the group said in a statement. Egyptian security sources said the possibility of a comprehensive ceasefire would also be discussed. This would see Hamas relinquish governance in Gaza and concede its weapons, with a Hamas official saying the group was open to all ideas as long as Israel would end the war and pull out of Gaza. But the official added that \"laying down arms before the occupation is dismissed as impossible\". 👉 Listen to Sky News Daily on your podcast app 👈 Meanwhile, Mr Netanyahu reiterated that Palestinians should simply leave Gaza, an idea which has also been enthusiastically floated by US President Donald Trump. \"They're not being pushed out, they'll be allowed to exit,\" Mr Netanyahu told Israeli television channel i24NEWS. \"All those who are concerned for the Palestinians and say they want to help the Palestinians should open their gates and stop lecturing us.\" World leaders have rejected the idea of displacing the Gaza population, and Mr Netanyahu's plan to expand military control over Gaza, which Israeli sources said could be launched in October, has increased global outcry over the widespread devastation, displacement and hunger in the enclave.  The humanitarian crisis in Gaza is at \"unimaginable levels\", Britain and 26 partners said in a statement on Tuesday, warning: \"Famine is unfolding before our eyes.\" The statement added: \"Urgent action is needed now to halt and reverse starvation. Humanitarian space must be protected, and aid should never be politicised.\" It was signed by the foreign ministers of Australia, Belgium, Canada, Cyprus, Denmark, Estonia, Finland, France, Greece, Iceland, Ireland, Japan, Lithuania, Luxembourg, Malta, the Netherlands, Norway, Portugal, Slovakia, Slovenia, Spain, Sweden, Switzerland and the UK. Read more from Sky News:West Bank: The city locked down by armed troopsWho were the journalists killed by Israel in Gaza? The war in Gaza began on 7 October 2023 when Hamas killed about 1,200 people - mostly civilians - and abducted 251 others in its attack. Most of the hostages have been released in ceasefires or other deals. It is believed Hamas is still holding 50 captives, with 20 believed to be alive. Israel's retaliatory offensive has killed more than 61,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "At least 26 dead and around a dozen missing after boat capsizes off Italian island",
        "description": "At least 26 people have died and around a dozen are missing after a boat carrying nearly 100 migrants capsized off the coast of Lampedusa, the Italian coastguard and UN agencies said.",
        "url": "https://news.sky.com/story/at-least-26-dead-and-around-a-dozen-missing-after-migrant-boat-capsizes-off-coast-of-italian-island-13411261",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lampedusa-italy_6990030.jpg?20250813190836",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-13 17:15:00",
        "Headline": "Sixty survivors were taken to a centre on Lampedusa following the disaster - with the Italian Red Cross saying four needed hospital treatment.",
        "Content": "At least 26 people have died and around a dozen are missing after a boat carrying nearly 100 migrants capsized off the coast of Lampedusa, the Italian coastguard and UN agencies said. Sixty survivors were taken to a centre on the Italian island, said Filippo Ungaro, a spokesman for the United Nations High Commissioner for Refugees (UNHCR) in Italy. There were up to 97 migrants on board when the boat departed Libya, according to survivor accounts. Authorities were still searching for any remaining survivors. An Italian law enforcement aircraft spotted a capsized boat with bodies in the water about 14 miles (23km) off Lampedusa on Wednesday morning, triggering a rescue operation, the coastguard said in a statement. It also said five ships, two aircraft and one helicopter were operating at the rescue site. The coastguard said 26 deaths had been confirmed so far but that was \"provisional and being updated\". \n                  Ukraine war latest: Trump 'won't discuss land divisions' with Putin after talks with European leaders\n                 \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 \n                  Trump's targets for Putin summit appear fluid - can he even get a ceasefire?\n                 Cristina Palma, who works for the Italian Red Cross in Lampedusa, said in a video statement that the survivors - 56 men and four women - were in \"decent\" health but four of them had been hospitalised for checks. Based on survivor accounts, about 95 migrants left the Tripoli area of Libya on two boats, International Organisation for Migration spokesperson Flavio Di Giacomo said. When one of the two vessels started to take on water, all the passengers were transferred to the other boat - made of fibreglass - which then capsized in international waters because of overloading, he said. It was not immediately known how long the migrants had been at sea. Italian PM's 'strong sense of dismay' Lampedusa mayor Filippo Mannino said the disaster happened \"presumably at dawn\". Italian Premier Giorgia Meloni, who made combating illegal immigration a top priority of her right-wing government, pledged on Wednesday to continue fighting \"unscrupulous traffickers\" by \"preventing irregular departures\" and \"managing migration flows\". She said in a statement: \"When a tragedy like this occurs, with the deaths of dozens of people in the waters of the Mediterranean, a strong sense of dismay and compassion arises in all of us... That today's tragedy occurred despite a ready and operational international response warns us that the necessary rescue effort is not sufficient and, above all, does not address the root causes of this tragic problem.\" A total of 675 migrants have died making the perilous central Mediterranean crossing so far this year, not counting the latest sinking, according to the UNHCR. \"Deep anguish over yet another shipwreck off the coast of Lampedusa, where UNHCR is now assisting the survivors,\" Mr Ungaro wrote on the X social media site. Read more:First migrants detained under returns dealTories pinpoint 'pull factor' driving small boat crossings  Tens of thousands die making crossing A total of 30,060 refugees and migrants arrived in Italy by sea in the first six months of 2025 - a 16% increase compared with the same period last year, according to the UNHCR. The irregular migration route from northern Africa to southern Europe is considered one of the most dangerous in the world, with almost 24,500 people dying or disappearing on the Mediterranean crossing in the past 10 years, according to the International Organisation for Migration. Most of the deaths have been attributed to small boats setting off from the coasts of Tunisia and Libya. The deadliest migrant boat disaster off the coast of Lampedusa occurred on 3 October 2013, when a vessel carrying more than 500 migrants from Eritrea, Somalia and Ghana caught fire and capsized, killing at least 368 people. The tragedy prompted international calls for action to address the crisis. The sinking off the coast of Lampedusa comes a day after figures showed more than 50,000 migrants have crossed the Channel from France to the UK since Sir Keir Starmer became prime minister. Home Office statistics reveal that 474 people arrived on Monday in eight vessels - the highest number to make the journey in one day in August."
    },
    {
        "title": "Who is Jimmy Lai? 'Prisoner of conscience' who has endured 1,600 days behind bars",
        "description": "Hong Kong media tycoon Jimmy Lai has been in a high-security prison for more than 1,600 days.",
        "url": "https://news.sky.com/story/who-is-jimmy-lai-prisoner-of-conscience-who-has-endured-1600-days-behind-bars-13410999",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-jimmy-lai-hong-kong_6751604.jpg?20241119084034",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-13 10:00:00",
        "Headline": "Jimmy Lai has been in prison for his role in pro-democracy protests since 2020. His trial has faced lengthy delays, but is scheduled to resume. Here is all you need to know.",
        "Content": "Hong Kong media tycoon Jimmy Lai has been in a high-security prison for more than 1,600 days. The 77-year-old was arrested over his role in pro-democracy protests in 2019 and has since been charged with various offences, including collusion with foreign forces, as well as sedition under colonial-era laws. His trial for alleged national security offences has faced lengthy delays, but is due to restart in Hong Kong on Thursday. Here is everything you need to know about the \"world's most famous prisoner of conscience\" and his trial, as it draws ever closer to a long-awaited conclusion. Who is Jimmy Lai? Lai was born in mainland China but fled to Hong Kong at the age of 12, after stowing away on a fishing boat. Here, he began working as a child labourer in a garment factory. He went on to build a fortune with the fashion empire Giordano and, after the 1989 Tiananmen Square massacre, when thousands of people protested for political reforms in Beijing, he became a democracy advocate and turned his hand to newspapers. Ahead of the 1997 handover of Hong Kong from the UK to China, he started the Chinese-language newspaper Apple Daily in an attempt to maintain freedom of speech. The paper was staunchly pro-democratic and did not shy away from criticising authorities in Beijing. Around the same time, in 1994, he became a full British citizen. He has never held a Chinese or Hong Kong passport, but is seen as a Chinese citizen by Hong Kong authorities. Why is he in jail? It was his pro-democratic beliefs that led to Lai becoming a key figure in the 2019 protests in Hong Kong, spurred by Beijing's tightening squeeze on wide-ranging freedoms. Lai's Apple Daily newspaper backed the protesters, criticising the government reforms. Lai and his sons were arrested in August 2020 after police raided the offices of the Apple Daily publisher, Next Digital. He was granted bail, but this was overturned in December of the same year, when Lai was charged with fraud. He was charged under the very national security laws, put in place in 2020, that he had protested. The charges include collusion with foreign forces, as well as conspiracy to print and distribute seditious publications. Lai has been in solitary confinement for most of his imprisonment. During this time, he has lost a significant amount of weight and his son, Sebastien Lai, has consistently raised concerns for his father's declining health. His legal team has claimed he has been denied independent medical care for diabetes, is only allowed out of his cell for 50 minutes a day and, as a devout Catholic, has been denied the Eucharist. However, this week the South China Morning Post has reported a Hong Kong government spokesman saying that Lai had received appropriate treatment and welfare in prison. What has happened during his trial so far? After years of delay, Lai's national security trial started in December 2023. Prosecutors allege that Lai conspired with senior executives at Apple Daily to publish 161 seditious articles intended to incite hatred toward the central or Hong Kong governments. They labelled him a \"radical political figure\" and accused him of asking the US and other foreign countries to impose sanctions on Hong Kong and mainland China. The charges he faces under the territory's national security law could see him handed a life sentence. But Lai has always denied the charges against him. Nearly a year after the trial started, in November 2024, Lai took to the stand to testify. During his 52 days on the stand he faced questions about his editorial control over Apple Daily, links to activists in Hong Kong, the UK and US - and about alleged meetings with US politicians. Closing arguments in the trial were due to start on 28 July, but were delayed until 14 August. The next hearing is due to last around eight days. How is the British government involved? As he is a British citizen, the UK government expressed concern when Lai was first charged under the national security law in 2020. Subsequent British governments, including the current Labour one, have said Lai's imprisonment is a breach of the Sino-British Joint Declaration - the 1984 agreement which set out the conditions of the transfer of Hong Kong from the UK to China. Three months after winning the general election, Sir Keir Starmer said securing Lai's release was a \"priority\" for his government and said his government would \"continue\" to raise the case with China. Most recently, during a January trip to China, Chancellor Rachel Reeves said she raised the question over Lai's imprisonment with every minister she met. Foreign Secretary David Lammy said he has also pressed Chinese foreign minister Wang Yi on Lai's detention during previous visits. In March, Lai's son, Sebastien, delivered a letter to 10 Downing Street asking for a meeting with Sir Keir to get his father released immediately. He said he was worried his father might die in prison and the case is a \"litmus test\" for the government to see if it will stand up to China for a British citizen who is in jail \"for peaceful campaigning and journalism\"."
    },
    {
        "title": "The snowy remote army base where Trump will host Putin for talks",
        "description": "Donald Trump and Vladimir Putin will meet on Friday at the remote Joint Base Elmendorf-Richardson, a US military installation in Anchorage, Alaska.",
        "url": "https://news.sky.com/story/the-snowy-remote-army-base-where-trump-will-host-putin-for-talks-13410886",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anchorage-us-base_6989505.jpg?20250813031404",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-13 04:41:00",
        "Headline": "Elmendorf-Richardson sits in an area that is significant for both America and Russia, but while Anchorage has welcomed plenty of US presidents, Vladimir Putin has never once visited during his time in the Kremlin.",
        "Content": "Donald Trump and Vladimir Putin will meet on Friday at the remote Joint Base Elmendorf-Richardson, a US military installation in Anchorage, Alaska. Elmendorf-Richardson combines the Air Force's Elmendorf base and the US Army's Fort Richardson. Read more: Zelenskyy and Trump talk ahead of summit It is Alaska's largest military base and is home to more than 32,000 people - about 10% of Anchorage's population. The area is also significant for Russia: the US purchased Alaska from the Russian Empire 158 years ago. In fact, Alaska's Little Diomede Island is less than three miles from Russia's Big Diomede Island in the Bering Strait, showing how geographically close the two countries are. Vladimir Putin's foreign affairs adviser, Yuri Ushakov, said: \"It seems entirely logical for our delegation to simply fly across the Bering Strait, and for such an important and anticipated summit of the leaders of the two countries to be held in Alaska.\" Holding talks there centres the conversation where global energy and territorial stakes are high, and the US president thrives on spectacle. The rugged frontier of Alaska plays into his flair for the theatrical. But the Trump administration has also been managing expectations of a peace deal. On Tuesday, White House press secretary Karoline Leavitt described the meeting as a \"listening exercise\" to seek a \"better understanding\" of the situation. During the Cold War, the base was regarded as \"particularly important\" in defending the US against the then-Soviet Union, according to the Library of Congress. Despite this proximity, Putin will be the first Russian president to visit Anchorage. Some have criticised the US president's decision to hold talks on the Russia-Ukraine conflict in Alaska. \"It's easy to imagine Putin making the argument during his meetings with Trump that, 'Well, look, territories can change hands,'\" said Nigel Gould-Davies, former British ambassador to Belarus. \"'We gave you Alaska. Why can't Ukraine give us a part of its territory?'\" Although this will be Trump's first trip to Alaska since beginning his second term, he made several visits to Elmendorf-Richardson during his first term. Read more:What happened last time Putin was in the USLand Ukraine could be forced to give up Joe Biden and Barack Obama also visited; in 2015, Obama became the first US president to set foot north of the Arctic Circle during his trip. Elmendorf-Richardson hosts aircraft like the F-22 Raptor - a fighter jet the Air Force says \"cannot be matched by any known or projected fighter aircraft\". The US defence department describes the area as having \"picturesque, majestic, snow-capped mountains, lakes, rivers, glaciers, and plenty of wildlife\". It also advises visitors attempting to drive to the base to bring emergency kits, food, blankets and extra fuel, as it is so remote."
    },
    {
        "title": "If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine",
        "description": "Ahead of President Trump's summit with President Putin, it was vital Ukraine's European allies presented a united front and that's exactly what we got following a string of virtual meetings.",
        "url": "https://news.sky.com/story/if-trump-sticks-to-the-script-at-putin-summit-there-may-be-a-ceasefire-in-ukraine-13411317",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-president_6990177.jpg?20250813223031",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-08-13 19:56:00",
        "Headline": "There may now be a viable chance for a ceasefire thanks to Donald Trump, but his unpredictability remains a concern.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  Ahead of President Trump's summit with President Putin, it was vital Ukraine's European allies presented a united front and that's exactly what we got following a string of virtual meetings. The German chancellor, the EU Commission chief and NATO's top official were among the leaders to celebrate the productive call with Donald Trump. Germany's leader Friedrich Merz said the positions of Ukraine, its European allies and US were \"very much in agreement\" - well on most points, at least. And that's important because Wednesday was possibly the last chance they had to lay down their red lines and try to influence Trump's thinking before his summit with Mr Putin in Alaska on Friday. The points they pushed on aren't new: they said Ukraine must be at the table for any discussions on its future, that a ceasefire must be the starting point, that Europe's security must be upheld in the talks and that Ukraine must get future security guarantees. President Zelenskyy warned he believed that Moscow's only desire was the total occupation of Ukraine and urged Trump to apply maximum pressure if Putin didn't show any commitment to ending the fighting. All this seems sensible, and we are told Trump listened to their requests. \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 \n                  National Guard arrives on streets of Washington DC despite 'historic' lows in crime\n                 \n                  The snowy remote army base where Trump will host Putin for talks\n                 He certainly indicated to reporters later that there would be consequences if Vladimir Putin did not agree to stop the war when they met. The careful planning of Wednesday's calls show how crucial the next few days could be in deciding what happens in the war in Ukraine. Read more:Analysis - Trump's targets for Putin summit appear fluid Before Wednesday's meeting with the US, Ukraine held discussions with its biggest European backers and NATO where they agreed on their main points. Sources say it meant that when the US asked, \"What do you want?\" they could reply with joint and clear answers. Security on both calls was tight - the European round was held in a secure, soundproof room at the German Chancellery, while the meeting with Donald Trump was audio only. Sources suggest, following the discussions, that concerns that Friday's meeting could spiral in an unplanned way have significantly reduced.  The UK's prime minister was especially positive, saying at a meeting of the Coalition of the Willing attended by JD Vance that there's now a viable chance of a ceasefire thanks to Trump. And if the US president sticks to the script, that hope could well be realised. The problem is, he rarely does, which could make Friday's meeting even more high stakes."
    },
    {
        "title": "European wildfires kill at least three as British bar worker joins emergency efforts on Greek island",
        "description": "Wildfires intensified across southern Europe on Wednesday with at least three deaths reported in Spain, Turkey and Albania.",
        "url": "https://news.sky.com/story/european-wildfires-kill-at-least-three-as-british-bar-worker-joins-emergency-efforts-on-greek-island-13411288",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-greece-europe-heatwave_6989590.jpg?20250813085545",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-13 18:42:00",
        "Headline": "Thousands of residents have been evacuated as emergency teams continue to battle large fires across southern Europe amid record-breaking temperatures.",
        "Content": " Wildfires intensified across southern Europe on Wednesday with at least three deaths reported in Spain, Turkey and Albania. Firefighting teams in several countries are struggling to contain numerous fires after weeks of heatwaves and soaring temperatures across the Mediterranean. Emergency teams are working around the clock to protect the outskirts of Patras, Greece's third-largest city, and blazes are raging on numerous Greek islands. A British bar worker on Zakynthos has told Sky News how he joined emergency services and locals to help combat a \"shocking\" fire near a popular tourist resort. Aircraft rotated between blazes on the western Greek mainland, the Patras area and Zakynthos. On the Greek island of Chios, exhausted firefighters slept on the roadside following a night-long shift. Crews struggled to protect homes and agricultural facilities around the port city of Patras as flames tore through pine forests and olive groves. Columns of flames rose behind apartment blocks on the outskirts of the city and dozens of vehicles were torched. Athens also provided aid to neighbouring Albania as part of a wider international response to tackle dozens of wildfires. An 80-year-old man died in a fire south of the capital Tirana, officials reported on Wednesday. In Spain, a firefighting volunteer in the hard-hit Castile and Leon region north of Madrid, has died, Spanish Prime Minister Pedro Sanchez said. Thousands have been displaced by evacuations in the region. \"The wildfire situation remains serious, and taking extra precautions is essential,\" Mr Sanchez wrote in a post on social media. In southern Turkey, officials said a forestry worker died on Wednesday while responding to a wildfire. The Forestry Ministry said the worker's death was caused by an accident involving a fire truck, which also injured four others. Since late June, Turkey has been fighting intense wildfires, resulting in 18 deaths so far, including 10 rescue volunteers and forestry workers who died in July. British bar worker helps firefighters On the popular Greek island of Zakynthos, also known as Zante, British national Richard Hall told Sky News on Wednesday that two fires were still raging on the island. One of the fires started Tuesday night, and Mr Hall, along with colleagues from the Kostas Pool Bar Kalamaki and local residents, went to the scene to assist emergency teams. \"We do our best and obviously take advice from the emergency services before doing anything,\" he said. Mr Hall said helicopters were still circling the area on Wednesday. \"It's shocking, but everybody is safe. The local government and authorities have been doing a fantastic job,\" he said. Fellow Brits have also been helping local authorities, he added. Mr Hall pointed out that the dry weather and dry grass increase the risk of more fires, especially those sparked by cigarettes, and called for caution. Read more:The West Bank city locked down by armed troopsLand Ukraine could be forced to give up The European Union has been sending aid, including ground crews and water-dropping aircraft, to fire-stricken countries, even non-members. Much of the recent help has focused on Montenegro, where wildfires near the capital Podgorica continue to burn. \"Natural disasters know no borders,\" said Ljuban Tmusic, head of Montenegro's civil protection agency. \"Our resources clearly aren't enough.\""
    },
    {
        "title": "Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit",
        "description": "Donald Trump and Vladimir Putin will meet for the first time in six years on Friday, with a possible deal to end the Ukraine war on the agenda.",
        "url": "https://news.sky.com/story/trumps-pride-vs-putins-legacy-what-to-expect-from-pivotal-summit-13411124",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-putin-trump-ukraine_6990186.jpg?20250813231050",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-13 14:34:00",
        "Headline": "An Alaskan army base will be the focus of the world's media when the two leaders come face to face - here's what three of our correspondents think it could mean for the two men and Ukraine.",
        "Content": "Donald Trump and Vladimir Putin will meet for the first time in six years on Friday, with a possible deal to end the Ukraine war on the agenda. Mr Trump has threatened \"very severe consequences\" if his Russian counterpart doesn't agree to a ceasefire at the summit, being hosted at a remote US army base in snowy Anchorage, Alaska. Follow latest updates from Ukraine war But there are fears they will discuss a deal robbing Ukraine of the land currently occupied by Russia - something Volodymyr Zelenskyy has said he won't accept. Here's what three of our correspondents think ahead of the much-anticipated face-to-face. Putin's legacy is at stake - he'll want territory and moreBy Ivor Bennett, Moscow correspondent Putin doesn't just want victory. He needs it. Three and a half years after he ordered the invasion of Ukraine, this war has to end in a visible win for the Russian president. It can't have been for nothing. His legacy is at stake. So the only deal I think he'll be willing to accept at Friday's summit is one that secures Moscow's goals. These include territory (full control of the four Ukrainian regions which Russia has already claimed), permanent neutrality for Kyiv and limits on its armed forces. I expect he'll be trying to convince Trump that such a deal is the quickest path to peace. The only alternative, in Russia's eyes, is an outright triumph on the battlefield. I think Putin's hope is that the American president agrees with this view and then gives Ukraine a choice: accept our terms or go it alone without US support. A deal like that might not be possible this week, but it may be in the future if Putin can give Trump something in return. That's why there's been lots of talk from Moscow this week about all the lucrative business deals that can come from better US-Russia relations. The Kremlin will want to use this opportunity to remind the White House of what else it can offer, apart from an end to the fighting. Read more:What could Ukraine be asked to give up?Trump-Putin summit starting to feel quite 'Midnight Sun'  Ukraine would rather this summit not be happeningBy Dominic Waghorn, international affairs editor Ukraine would far rather this meeting wasn't happening. Trump seemed to have lost patience with Putin and was about to hit Russia with more severe sanctions until he was distracted by the Russian leader's suggestion that they meet. Ukrainians say the Alaska summit rewards Putin by putting him back on the world stage. But the meeting is happening, and they have to be realistic. Most of all, they want a ceasefire before any negotiations can happen. Then they want the promise of security guarantees.  That is because they know that Putin may well come back for more even if peace does break out. They need to be able to defend themselves should that happen. And they want the promise of reparations to rebuild their country, devastated by Putin's wanton, unprovoked act of aggression. There are billions of Russian roubles and assets frozen across the West. They want them released and sent their way. What they fear is Trump being hoodwinked by Putin with the lure of profit from US-Russian relations being restored, regardless of Ukraine's fate. That would allow Russia to regain its strength, rearm and prepare for another round of fighting in a few years' time. Trump and his golf buddy-turned-negotiator Steve Witkoff appear to believe Putin might be satisfied with keeping some of the land he has taken by force. Putin says he wants much more than that. He wants Ukraine to cease to exist as a country separate from Russia. Any agreement short of that is only likely to be temporary.  Trump's pride on the line - he has a reputation to restoreBy Martha Kelner, US correspondent As with anything Donald Trump does, he already has a picture in his mind. The image of Trump shaking hands with the ultimate strongman leader, Vladimir Putin, on US soil calls to his vanity and love of an attention-grabbing moment. There is also pride at stake. Trump campaigned saying he would end the Russia-Ukraine war on his first day in office, so there is an element of him wanting to follow through on that promise to voters, even though it's taken him 200-plus days in office and all he's got so far is this meeting, without apparently any concessions on Putin's end. In Trump's mind - and in the minds of many of his supporters - he is the master negotiator, the chief dealmaker, and he wants to bolster that reputation. He is keen to further the notion that he negotiates in a different, more straightforward way than his predecessors and that it is paying dividends. So far, despite sanctions on Russia, despite warnings and deadlines, the situation in Ukraine is only getting worse. He's hoping that this meeting, simply the act of sitting down with Putin, can change the tide. The Russian president may have different ideas."
    },
    {
        "title": "Trump praises Frank Spencer actor as he prepares for major summit - sometimes the script writes itself",
        "description": "It's official. Donald Trump will host the 2025 Kennedy Center Honors - Washington's annual black-tie celebration of artistic achievement.",
        "url": "https://news.sky.com/story/trump-praises-frank-spencer-actor-as-he-prepares-for-major-summit-sometimes-the-script-writes-itself-13411315",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-frank-spencer-donald_6990179.jpg?20250813224558",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-08-13 19:54:00",
        "Headline": "The actor Michael Crawford is firmly in the US president's cultural sweet spot - but Donald Trump may not be aware of the comedy role that made him famous in the UK.   ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It's official. Donald Trump will host the 2025 Kennedy Center Honors - Washington's annual black-tie celebration of artistic achievement. In previous years, occupants of the White House simply attended the event in the building named after President John F Kennedy. Earlier this year, the US president sacked the board and installed himself as chairman and is threatening to put his own name on the door. \"GREAT nominees for the TRUMP/KENNEDY Center, whoops, I mean KENNEDY CENTER AWARDS…\" he posted on his Truth Social platform. Vowing that the show will be \"non-woke\", he announced this year's nominees - a stroll through Trump's cultural sweet spot: Crawford's West End and Broadway career spans Barnum, The Woman in White and, of course, The Phantom Of The Opera.. The Phantom's tendency to buy grand, chandelier-filled buildings, has won the approval of the real-estate mogul now remodelling the White House. \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 \n                  Pictures of 'zombie-rabbits' with twisting black horns go viral - so are they real?\n                 \n                  National Guard arrives on streets of Washington DC despite 'historic' lows in crime\n                 Read more:Trump's aims for Putin summit appear fluidThe snowy remote base where Trump will host Putin for talks  But there's something Americans might have missed - the character who made Michael Crawford a household name back home: Frank Spencer. The star of the sitcom \"Some Mothers Do 'Ave 'Em\" was endlessly optimistic but completely hapless, and oblivious to his own incompetence. Revealing that he would host the awards himself, just two days before he hosts Vladimir Putin, is quintessential Trump, the prime-time president. But \"Ooh Betty,\" as Frank Spencer would say, when Donald Trump extols Michael Crawford, an icon of slapstick comedy, the script writes itself."
    },
    {
        "title": "National Guard arrives on streets of Washington DC despite 'historic' lows in crime",
        "description": "National Guard troops have begun arriving on the streets of Washington DC in a controversial move by Donald Trump to \"rescue our nation's capital from crime\".",
        "url": "https://news.sky.com/story/national-guard-arrives-on-streets-of-washington-dc-despite-historic-lows-in-crime-13411013",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-national-guard-washington-dc_6989674.jpg?20250813112742",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-13 10:18:00",
        "Headline": "Official data shows violent crime is already sharply declining in Washington DC, while critics have called the deployment by Donald Trump \"political theatre\".",
        "Content": "National Guard troops have begun arriving on the streets of Washington DC in a controversial move by Donald Trump to \"rescue our nation's capital from crime\". The deployment of some of the planned 800 troops comes despite the Washington mayor revealing crime in the capital was at its \"lowest level in 30 years\" - and with official data also showing a steep decline. President Trump has promised to take over the district's police department, something the law allows him to do temporarily. The army has indicated there were no specific locations for the deployment, according to the Associated Press, citing a White House official who spoke on the condition of anonymity.   At the beginning of the week, Mr Trump said he was sending in 800 National Guard troops to \"re-establish law, order, and public safety\". He announced a \"historic action to rescue our nation's capital from crime, bloodshed, bedlam and squalor and worse\". But according to preliminary figures from Washington DC's Metropolitan Police, violent crime is down 26% in 2025 - after dropping 35% in 2024 compared with 2023. Washington mayor Muriel Bowser said crime was at historic lows in the capital and called the move \"unsettling and unprecedented\" - but would use the extra personnel to reduce crime further. And in a post on social media, she wrote: \"Violent crime in DC is at its lowest level in 30 years. We had an unacceptable spike in 2023, so we changed our laws and strategies.\" She said the National Guard would not have the power to arrest people. Troops will carry no weapons but will have their standard issue firearms, usually rifles, close at hand, an official said. Read more from Sky News:West Bank: The city locked down by armed troopsFacial recognition vans to be used by some police forces  The Democrats and other critics have called Mr Trump's deployment \"political theatre\" - but the president has threatened to repeat the move in other big cities. Jeanine Pirro, the US attorney for the capital, dismissed a question from a reporter about how violence in Washington compared to other cities. She said: \"All I know is we rank in death. I don't need any more statistics.\" In Washington, the DC National Guard reports directly to the president. In the states, the troops answer to the governor except when called into federal service."
    },
    {
        "title": "Trump's targets for Putin summit appear fluid - can he even get a ceasefire?",
        "description": "The \"if\" was doing some heavy lifting.",
        "url": "https://news.sky.com/story/is-the-trump-putin-meeting-a-listening-exercise-or-an-attempt-to-secure-an-immediate-ceasefire-13411293",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kharkiv-ukraine-russia-war-invasion_6988607.jpg?20250812080421",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-08-13 18:39:00",
        "Headline": "The US president has been fluid on what the meeting in Alaska on Friday can really achieve.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The \"if\" was doing some heavy lifting. Mr Trump floated the idea of a second meeting, this one between Putin, Zelenskyy and possibly himself, \"if\" the Alaska summit goes well. Speaking to European leaders earlier, in a virtual call he rated at \"10\" and \"very friendly\", he'd shared his intention to try to broker a ceasefire on Friday. So, the strategy is crystallising - he will press for a trilateral meeting to discuss territory \"if\" he manages to secure a truce during the bilateral meeting. But that begs the obvious question: what if he can't? The US president is keeping his options open - rating the chance of a second meeting as \"very good\" but preparing the ground for failure too. \"There may be no second meeting because if I feel that it is not appropriate to have it because I didn't get the answers that we have to have, then we're not going to have a second meeting,\" he said. \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  The snowy remote army base where Trump will host Putin for talks\n                 \n                  Trump-Putin summit starting to feel quite 'Midnight Sun' - as White House confirms location\n                 Unusually, given how often he talks about his abilities, he conceded that he may not persuade Vladimir Putin to stop targeting civilians.  Read MoreTrump's threat to Putin - Ukraine latestWhat could Ukraine be asked to give up?Sky News' Ukraine Q&A But without elaborating on what any sanctions might be, he warned that Russia would face \"very severe consequences\" if it doesn't end the war. Even if he achieves the seemingly impossible - a halt to the fighting - there seems little chance of agreement on any swapping of territory. Mr Zelenskyy has told Mr Trump that Putin \"is bluffing\" and wants to \"push forward along the whole front\" not return land. In the space of a week, Donald Trump has gone from talking about a land-swapping deal, to a \"listening exercise\", to the potential for a ceasefire. His expectations appear changeable, an indication of how fluid back-room negotiations are in the run-up to his first face-to-face with Vladimir Putin in six years. He described Friday's summit as \"setting the table for a second meeting\", but that's presumptuous when the meal - or deal - isn't cooked yet."
    },
    {
        "title": "The snowy remote army base where Trump will host Putin for talks",
        "description": "Donald Trump and Vladimir Putin will meet on Friday at the remote Joint Base Elmendorf-Richardson, a US military installation in Anchorage, Alaska.",
        "url": "https://news.sky.com/story/the-snowy-remote-army-base-where-trump-will-host-putin-for-talks-13410886",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anchorage-us-base_6989505.jpg?20250813031404",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-13 04:41:00",
        "Headline": "Elmendorf-Richardson sits in an area that is significant for both America and Russia, but while Anchorage has welcomed plenty of US presidents, Vladimir Putin has never once visited during his time in the Kremlin.",
        "Content": "Donald Trump and Vladimir Putin will meet on Friday at the remote Joint Base Elmendorf-Richardson, a US military installation in Anchorage, Alaska. Elmendorf-Richardson combines the Air Force's Elmendorf base and the US Army's Fort Richardson. Read more: Zelenskyy and Trump talk ahead of summit It is Alaska's largest military base and is home to more than 32,000 people - about 10% of Anchorage's population. The area is also significant for Russia: the US purchased Alaska from the Russian Empire 158 years ago. In fact, Alaska's Little Diomede Island is less than three miles from Russia's Big Diomede Island in the Bering Strait, showing how geographically close the two countries are. Vladimir Putin's foreign affairs adviser, Yuri Ushakov, said: \"It seems entirely logical for our delegation to simply fly across the Bering Strait, and for such an important and anticipated summit of the leaders of the two countries to be held in Alaska.\" Holding talks there centres the conversation where global energy and territorial stakes are high, and the US president thrives on spectacle. The rugged frontier of Alaska plays into his flair for the theatrical. But the Trump administration has also been managing expectations of a peace deal. On Tuesday, White House press secretary Karoline Leavitt described the meeting as a \"listening exercise\" to seek a \"better understanding\" of the situation. During the Cold War, the base was regarded as \"particularly important\" in defending the US against the then-Soviet Union, according to the Library of Congress. Despite this proximity, Putin will be the first Russian president to visit Anchorage. Some have criticised the US president's decision to hold talks on the Russia-Ukraine conflict in Alaska. \"It's easy to imagine Putin making the argument during his meetings with Trump that, 'Well, look, territories can change hands,'\" said Nigel Gould-Davies, former British ambassador to Belarus. \"'We gave you Alaska. Why can't Ukraine give us a part of its territory?'\" Although this will be Trump's first trip to Alaska since beginning his second term, he made several visits to Elmendorf-Richardson during his first term. Read more:What happened last time Putin was in the USLand Ukraine could be forced to give up Joe Biden and Barack Obama also visited; in 2015, Obama became the first US president to set foot north of the Arctic Circle during his trip. Elmendorf-Richardson hosts aircraft like the F-22 Raptor - a fighter jet the Air Force says \"cannot be matched by any known or projected fighter aircraft\". The US defence department describes the area as having \"picturesque, majestic, snow-capped mountains, lakes, rivers, glaciers, and plenty of wildlife\". It also advises visitors attempting to drive to the base to bring emergency kits, food, blankets and extra fuel, as it is so remote."
    },
    {
        "title": "Harvey Weinstein to be tried for third time in New York after mistrial on rape charge",
        "description": "Disgraced US film producer Harvey Weinstein is to be tried for a third time in a sexual assault case.",
        "url": "https://news.sky.com/story/harvey-weinstein-to-be-tried-for-third-time-in-new-york-after-mistrial-on-rape-charge-13410961",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-harvey-weinstein-court_6908256.jpg?20250506165629",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-13 08:11:00",
        "Headline": "In June this year, a New York jury could not reach a verdict against the 73-year-old disgraced film producer who was accused of raping actress Jessica Mann, and a mistrial was declared.",
        "Content": "Disgraced US film producer Harvey Weinstein is to be tried for a third time in a sexual assault case. A jury in New York could not reach a verdict in June against the 73-year-old who was accused of raping actress Jessica Mann, and a mistrial was declared. Judge Curtis Farber has said he wants the new trial to happen before the end of this year. The same jury found Weinstein guilty in June of sexually assaulting former Project Runway production assistant Miriam Haley in 2006 and not guilty of assaulting Polish former runway model Kaja Sokola the same year. Weinstein will be sentenced for the guilty verdict in Ms Haley's case on 30 September. He denied all of the charges. Throughout the retrial, his lawyers insisted the sexual encounters with his three accusers were \"transactional\" and \"consensual,\" and labelled the women as opportunists. Weinstein was originally convicted of rape and criminal sexual act by the same court in 2020 and sentenced to 23 years in prison for the crimes. Last year, however, New York's highest court overturned the conviction, prompting Weinstein's retrial this summer. Weinstein was once one of the most powerful people in Hollywood - the co-founder of film and television production companies Miramax and The Weinstein Company, who produced films such as the Oscar-winning Shakespeare In Love, Pulp Fiction, and The Crying Game. In 2017, a series of sexual misconduct allegations against him propelled the #MeToo movement. Some of those accusations later led to criminal charges and his convictions in New York and California. Before the retrial, Weinstein was also serving a 16-year prison sentence after being found guilty of rape in California in December 2022. He has also denied this charge."
    },
    {
        "title": "Claire's falls into administration with more than 2,000 jobs at risk",
        "description": "Fashion accessories chain Claire's is set to appoint administrators for its UK and Ireland business - putting around 2,150 jobs at risk. ",
        "url": "https://news.sky.com/story/claires-to-appoint-administrators-for-uk-and-ireland-business-putting-thousands-of-jobs-at-risk-13411175",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-accessories-claires-accessories_6965200.jpg?20250720165751",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-13 15:25:00",
        "Headline": "The move will raise fears over the future of 306 stores - with 278 of those in the UK and 28 in Ireland.",
        "Content": "Fashion accessories chain Claire's is set to appoint administrators for its UK and Ireland business - putting around 2,150 jobs at risk.  The move will raise fears over the future of 306 stores, with 278 of those in the UK and 28 in Ireland. Sky News' City editor Mark Kleinman reported last week that the US-based Claire's group had been struggling to find a buyer for its British high street operations. Money latest: 7 popular cars recalled in UK over loose nuts Prospective bidders for Claire's British arm, including the Lakeland owner Hilco Capital, backed away from making offers in recent weeks as the scale of the chain's challenges became clear, a senior insolvency practitioner said. Claire's has now filed a formal notice to administrators from advisory firm Interpath. Administrators are set to seek a potential rescue deal for the chain, which has seen sales tumble in the face of recent weak consumer demand. \n                  Typical two-year mortgage deal at near three-year low - below 5% since mini-budget\n                 \n                  Going to university is not what it once was - and students face a very different question\n                 \n                  Money latest: 7 popular cars recalled in UK over loose nuts - full list \n                 Claire's UK branches will remain open as usual and store staff will stay in their positions once administrators are appointed, the company said. Will Wright, UK chief executive at Interpath, said: \"Claire's has long been a popular brand across the UK, known not only for its trend-led accessories but also as the go-to destination for ear piercing. \"Over the coming weeks, we will endeavour to continue to operate all stores as a going concern for as long as we can, while we assess options for the company. \"This includes exploring the possibility of a sale which would secure a future for this well-loved brand.\" The development comes after the Claire's group filed for Chapter 11 bankruptcy in a court in Delaware last week. It is the second time the group has declared bankruptcy, after first filing for the process in 2018. Chris Cramer, chief executive of Claire's, said: \"This decision, while difficult, is part of our broader effort to protect the long-term value of Claire's across all markets. \"In the UK, taking this step will allow us to continue to trade the business while we explore the best possible path forward. We are deeply grateful to our employees, partners and our customers during this challenging period.\" Read more money news:Legoland-owner shelves sale of Sea Life venuesMinisters line up administrators for utility giant Susannah Streeter, head of money and markets at Hargreaves Lansdown, said: \"Claire's attraction has waned, with its high street stores failing to pull in the business they used to. \"While they may still be a beacon for younger girls, families aren't heading out on so many shopping trips, with footfall in retail centres falling. \"The chain is now faced with stiff competition from TikTok and Insta shops, and by cheap accessories sold by fast fashion giants like Shein and Temu.\" Claire's has been a fixture in British shopping centres and on high streets for decades, and is particularly popular among teenage shoppers. Founded in 1961, it is reported to trade from 2,750 stores globally. The company is owned by former creditors Elliott Management and Monarch Alternative Capital following a previous financial restructuring."
    },
    {
        "title": "Typical two-year mortgage deal at near three-year low - below 5% since mini-budget",
        "description": "The average two-year mortgage rate has fallen below 5% for the first time since the Liz Truss mini-budget.",
        "url": "https://news.sky.com/story/typical-two-year-mortgage-deal-at-near-three-year-low-below-5-since-mini-budget-13411037",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-istock-stock-file-generic_6967505.jpg?20250718061507",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-13 11:04:00",
        "Headline": "It's nearly three years since the average two-year fixed mortgage rate was below 5%.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The average two-year mortgage rate has fallen below 5% for the first time since the Liz Truss mini-budget. The interest rate charged on a typical two-year fixed mortgage deal is now 4.99%, according to financial information company Moneyfacts. It means there are more expensive and also cheaper two-year mortgage products on the market, but the average has fallen to a near three-year low. Money blog: Bingo players 'won' share of £1.6m - then Gala took it back Not since September 2022 has the average been at this level, before former prime minister Liz Truss announced her so-called mini-budget. The programme of unfunded spending and tax cuts, done without the commentary of independent watchdog the Office for Budget Responsibility, led to a steep rise in the cost of government borrowing and necessitated an intervention by monetary regulator the Bank of England to prevent a collapse of pension funds. It was also a key reason mortgage costs rose as high as they did - up to 6% for a typical two-year deal in the weeks after the mini-budget. \n                  Lloyds Bank's Charlie Nunn expects two more interest rate cuts in 2025\n                 \n                  Trump takes aim at Fed chair Jerome Powell again and says he 'should be ashamed'\n                 \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 Why? The mortgage borrowing rate dropped on Wednesday as the base interest rate - set by the Bank of England - was cut last week to 4%. The reduction made borrowing less expensive, as signs of a struggling economy were evident to the rate-setting central bankers and despite inflation forecast to rise further.  It's that expectation of elevated price rises that has stopped mortgage rates from falling further. The Bank had raised interest rates and has kept them comparatively high as inflation is anticipated to rise faster due to poor harvests and increased employer costs, making goods more expensive. The group behind the figures, Moneyfacts, said \"While the cost of borrowing is still well above the rock-bottom rates of the years immediately preceding that fiscal event, this milestone shows lenders are competing more aggressively for business.\" In turn, mortgage providers are reluctant to offer cheaper products. A further cut to the base interest rate is expected before the end of 2025, according to London Stock Exchange Group (LSEG) data. Traders currently bet the rate will be brought to 3.75% in December. This expectation can influence what rates lenders offer."
    },
    {
        "title": "Legoland-owner Merlin shelves sale of Sea Life venues",
        "description": "The owner of Legoland and Madame Tussauds has abandoned plans to sell some of its British aquariums after failing to reel in sufficiently attractive bids.",
        "url": "https://news.sky.com/story/legoland-owner-merlin-shelves-sale-of-sea-life-venues-13411002",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-penguins-sea-life_6827474.jpg?20250213112046",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-13 09:59:00",
        "Headline": "Merlin Entertainments has halted plans to sell aquarium assets in locations such as Blackpool and Brighton after prospective buyers failed to submit sufficiently attractive offers, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Legoland and Madame Tussauds has abandoned plans to sell some of its British aquariums after failing to reel in sufficiently attractive bids. Sky News has learnt that Merlin Entertainments has decided to call off an auction of more than half a dozen Sea Life visitor attractions in locations including Blackpool, Brighton, Loch Lomond and Scarborough. Sources said that private equity firms such as Epiris and Platinum Equity had expressed an interest in the venues, but added that none of the offers had been at a level which persuaded Merlin to pursue a deal. In a statement issued in response to an enquiry from Sky News, a Merlin spokesperson said: \"Like any well-run business Merlin regularly reviews its estate, in line with the company's long-term growth strategy. \"We continue to invest in our Sea Life aquariums, to ensure they provide wonderful experiences for guests and inspire a love for the ocean and its creatures.\" One person close to the group, which is the world's biggest theme park operator and counts Chessington World of Adventures and Alton Towers among its prized British assets, said it would be open to considering compelling offers for the aquarium assets in future. Merlin owns more than 40 aquariums globally, many of which trade under the SEA LIFE brand. \n                  Claire's falls into administration with more than 2,000 jobs at risk\n                 \n                  Typical two-year mortgage deal at near three-year low - below 5% since mini-budget\n                 \n                  Going to university is not what it once was - and students face a very different question\n                 In the UK, there are 11 such attractions, including in London, Birmingham and Manchester. One source said Merlin had been open to expanding the sale perimeter to include one or more of the SEA LIFE venues in major English cities in order to entice more lucrative offers. Merlin is jointly owned by the private equity giant Blackstone and the investment vehicle of the family behind the Lego dynasty, having been a publicly traded company on the London stock market for several years."
    },
    {
        "title": "Car repair finance firm lands Bumper funding round from auto giants",
        "description": "A buy now, pay later specialist which helps motorists spread the cost of repairing their cars has landed millions of pounds from the venture arms of Jaguar Land Rover, Porsche and other leading automotive groups.",
        "url": "https://news.sky.com/story/car-repair-finance-firm-lands-bumper-funding-round-from-auto-giants-13411009",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bumper-car-phone_6989666.jpg?20250813112318",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-13 10:18:00",
        "Headline": "London-based Bumper, which was founded in 2013, will this week announce an £8m injection from the venture arms of companies including Jaguar Land Rover, Porsche, Shell and Suzuki, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A buy now, pay later specialist which helps motorists spread the cost of repairing their cars has landed millions of pounds from the venture arms of Jaguar Land Rover, Porsche and other leading automotive groups. Sky News understands that Bumper, which is based in London and Sheffield, will announce later this week that it has raised $11m (£8.1m) in an extension to its Series B funding round. Founded in 2013 by James Jackson and Jack Allman, Bumper's latest capital injection is also backed by Suzuki Ventures and Shell Ventures. The round was led by Autotech Ventures. The company, which has seen the number of motorists it assists soar in the past year, helps drivers split repair bills into BNPL interest-free instalments, and says it is now \"operationally profitable\". It has expanded to Germany, Ireland, the Netherlands and Spain, and is also diversifying into other payment and software services through what it describes as \"a targeted M&A strategy\". \"A sudden repair bill can hit families hard,\" said Mr Jackson, Bumper's chief executive. \n                  Claire's falls into administration with more than 2,000 jobs at risk\n                 \n                  Typical two-year mortgage deal at near three-year low - below 5% since mini-budget\n                 \n                  Going to university is not what it once was - and students face a very different question\n                 \"We created Bumper to give people control, flexibility and peace of mind when the unexpected happens. \"Over 1.5 million drivers have now used our platform to keep their cars on the road without breaking the bank.\"Bumper is available as a financing option in more than 5,000 dealerships and garages, and counts car-makers including Audi, Ford, JLR, Nissan and Volkswagen among those with which it works. Last October, the company acquired AutoBI, a business intelligence platform for car retailers and OEMs (original equipment manufacturers). More recently, it bought Cocoon Payments, a white-label solution which helps dealerships streamline digital payment processes.\"We're building out from our consumer BNPL roots into a full-stack platform for automotive retail,\" Mr Jackson said. \"By owning more of the payments stack and delivering software solutions to dealers, we can improve margins, simplify operations and support the future of mobility retail.\" The valuation at which Bumper's new funding had been raised was unclear on Wednesday."
    },
    {
        "title": "More Britons now eligible for savings account that could get them free £1,200",
        "description": "For this week's Savings Guide, Anna Bowes, personal finance expert from The Private Office, explains what the Help to Save scheme is...",
        "url": "https://news.sky.com/story/many-more-now-eligible-for-bank-account-that-could-get-free-1631200-13410984",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-money-banking-laptop_6989634.jpg?20250813104018",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-13 09:23:00",
        "Headline": "This week, expert Anna Bowes, from The Private Office, looks into one bank account that gives savers a generous government bonus.",
        "Content": "For this week's Savings Guide, Anna Bowes, personal finance expert from The Private Office, explains what the Help to Save scheme is... The Help to Save Scheme is essentially a programme that incentivises people claiming certain benefits to save money. It gives savers a generous government bonus if they put away between £1 and £50 a month over four years. Unlike a normal savings account, no interest is earned. Money blog: Follow the latest But at the end of the first two years, the government pays a bonus worth 50% of the highest balance you have achieved during that time. So, if you have paid in the maximum £1,200 over the first two years, you would get a bonus of £600. \n                  Outrage as bingo players 'win' share of £1.6m - then Gala takes it back\n                 \n                  Chancellor doesn't rule out raising gambling taxes after report said it could lift 500,000 children out of poverty\n                 \n                  Martin Lewis reveals who is due for car finance compensation - and how much they'll get\n                 After four years, you get another bonus of 50% of the difference between the highest balance achieved during the first two years and the highest balance during the third and fourth years. Here are a couple of examples: • If the highest balance after the first two years is £1,200 and the highest balance in the third and fourth years is £1,800, the bonus will be calculated on the £600 difference. So, in this case, you'll get a second bonus of £300. • If you manage to save the maximum £50 a month once again, after four years you'll have saved another £1,200, so assuming you've not made any withdrawals, the highest balance will have reached £2,400, so you could receive another £600 bonus payment. In total, that could mean up to £1,200 in free money over the life of the account. Although unlike some schemes, you are not locked in - you can withdraw your savings at any point - but doing so will affect your bonus. \"The generous bonus is a great incentive, but of course only to those who can afford to save to get it,\" Bowes says. \"For those that are on the lowest incomes, they may struggle with the day-to-day cost of living, let alone putting money aside in a savings account, but if they can afford to utilise the account, the bonus is a great incentive.\" She adds that the returns on the top-paying savings accounts are \"nowhere near as generous\". Here are the best ones on the market... Who is eligible for Help to Save? The scheme was originally due to end in September 2023 but after a number of extensions, it will be around until April 2027. The extension has also come with a relaxation of the eligibility rules. Previously, those receiving universal credit had to be earning the equivalent of at least 16 hours a week at the national living wage - roughly £793 a month - in order to qualify. Read more from Sky News Money:Ministers line up administrator for Thames WaterWhat's in this week's Money newsletterWhy Freddo creator's daughter refuses to buy it From this April, that threshold was reduced dramatically so that anyone in receipt of universal credit who has earned at least £1 in their last monthly assessment period will be eligible, opening the door to hundreds of thousands more potential savers. It's important to note that you can only hold the account for four years - after that it will be closed and no further Help to Save accounts can be opened."
    },
    {
        "title": "Labour MP Tulip Siddiq hits out at 'farce' anti-corruption trial in Bangladesh",
        "description": "Labour MP Tulip Siddiq has called her anti-corruption trial a \"farce\" which is \"driven by a clear political agenda\" as proceedings began on Wednesday in Bangladesh.",
        "url": "https://news.sky.com/story/labour-mp-tulip-siddiq-hits-out-at-farce-anti-corruption-trial-in-bangladesh-13410921",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tulip-siddiq-bangladesh_6845305.jpg?20250303164319",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-13 12:00:00",
        "Headline": "The former anti-corruption minister has claimed the proceedings are politically motivated and is being tried in absentia. She is accused of having \"exerted pressure and influence\" on her aunt to get planning officials to appoint them a 7,200-square-foot plot of land.",
        "Content": "Labour MP Tulip Siddiq has called her anti-corruption trial a \"farce\" which is \"driven by a clear political agenda\" as proceedings began on Wednesday in Bangladesh. In a statement seen by Sky News, Ms Siddiq has said the case was \"built on fabricated accusations\". The Bangladesh authorities allege the Labour MP \"exerted pressure and influence\" on her aunt, the country's ousted former prime minister, Sheikh Hasina, to get planning officials to appoint them 7,200sq ft of land. When Ms Hasina was removed as prime minister last year and replaced by the current government, hundreds of protesters were killed during the uprising. Ms Siddiq resigned from her Treasury job in January after facing calls to step down over links to her aunt, who is being investigated by Bangladesh's Anti-Corruption Commission (ACC) over charges including crimes against humanity. Politics latest: Reeves 'considering tightening inheritance tax' Ms Siddiq previously denied all the allegations against her through lawyers, saying the prosecution is politically motivated. \n                  Politics latest: Reeves considering tightening inheritance tax, reports suggest\n                 \n                  More small boat arrivals under Starmer than Sunak, despite ex-PM being in power seven months longer\n                 \n                  What is former minister Tulip Siddiq on trial for in Bangladesh?\n                 Bangladesh's ACC claims the Labour MP received the land in a diplomatic zone through \"abuse of power and influence\". The trial in Dhaka began in the early hours of UK time, with Ms Siddiq on trial alongside her mother and siblings. The family are being tried in absentia as they have not returned to Bangladesh for the proceedings. The court opened with ACC prosecutors laying out the case against Ms Siddiq. Read more:What are the allegations against Siddiq?Siddiq boasted of links with Hasina In her statement, Ms Siddiq said: \"The so-called trial now under way in Dhaka is nothing more than a farce, built on fabricated accusations and driven by a clear political vendetta. \"Over the past year, the allegations against me have repeatedly shifted, yet I have never been contacted by the Bangladeshi authorities once. I have never received a court summons, no official communication, and no evidence. \"If this were a genuine legal process, the authorities would have engaged with me or my legal team, responded to our formal correspondence, and presented the evidence they claim to hold. \"Instead, they have peddled false and vexatious allegations that have been briefed to the media but never formally put to me by investigators. \"Even my offer to meet Bangladesh's chief adviser Muhammad Yunus during his recent visit to London was refused. Such conduct is wholly incompatible with the principles of a fair trial that we uphold in the UK. \"I have been clear from the outset that I have done nothing wrong and will respond to any credible evidence that is presented to me. Continuing to smear my name to score political points is both baseless and damaging.\" Responding to Ms Siddiq's statement, Bangladeshi prosecutor Mohammad Sultan Mahmud highlighted the difference between the British and Bangladeshi legal system. This includes Ms Siddiq only being able to receive a court summons if she returns to Bangladesh. The Labour MP's legal team are understood to have sought legal advice regarding the Bangladeshi prosecutor's response. Sky News understands the MP's lawyer requested to attend the trial in Bangladesh on her behalf but was denied access. We also understand the Bangladeshi authorities did not tell Ms Siddiq of a date change for the trial, and she only found out when Sky News contacted her lawyer about it. On the other points, Mr Mahmud denied there was any political motivation to the case. He added that Mr Yunus likely rejected meeting Ms Siddiq due to a busy schedule and not wanting to interfere in the proceedings. The prosecutor went on to claim he had \"a lot of evidence\" against Ms Siddiq and her family, and intends to bring further cases against her. A separate anti-corruption allegation into Ms Siddiq's family has also been launched, with allegations they were involved in brokering a 2013 deal with Russia for a nuclear power plant in Bangladesh, in which large sums of money were said to have been embezzled. Ms Siddiq's aunt, Ms Hasina, was ousted last year following student protests, having been in power for more than a decade. She has since fled to India. Hundreds of protesters were killed during the uprising, and Ms Hasina now faces charges including crimes against humanity. 👉Listen to Politics at Sam and Anne's on your podcast app👈     Nobel Peace Prize laureate Muhammad Yunus took over as interim leader and vowed to prosecute Ms Hasina. Allegations have also been made about Ms Siddiq and a house she rents in north London, which is owned by a businessman reportedly linked to Ms Hasina's Awami League Party."
    },
    {
        "title": "More small boat arrivals under Starmer than Sunak, despite ex-PM being in power seven months longer",
        "description": "More migrants have crossed the English Channel in small boats in the 13 months that Sir Keir Starmer has been in power than that did during the whole of Rishi Sunak's 20-month premiership.",
        "url": "https://news.sky.com/story/more-small-boat-arrivals-under-starmer-than-sunak-despite-ex-pm-being-in-power-seven-months-longer-13411131",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-small-boats-starmer_6989917.png?20250813164711",
        "type": "Politics",
        "Author": "Daniel Dunford",
        "Date Published": "2025-08-13 14:47:00",
        "Headline": "Starmer promised to \"smash the gangs\" when he ran for election last year, and reduce the number of migrants arriving in the UK on small boats. Just over a year later, records are being broken, but not in the way he had in mind.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n More migrants have crossed the English Channel in small boats in the 13 months that Sir Keir Starmer has been in power than that did during the whole of Rishi Sunak's 20-month premiership. The total number of people who have arrived under Sir Keir's time in government has now reached 50,716 - equivalent to 126 per day, surpassing the total of 50,637 (82 per day) that arrived under his predecessor. If the current rate is sustained, by the end of 2025 more migrants will have crossed the Channel under Sir Keir than the number that did under Boris Johnson, despite Mr Johnson having been prime minister for more than three years. Mr Johnson's premiership coincided with the COVID pandemic, when the number of people arriving in the UK was low for a sustained period while lockdowns were in place in both the UK and Europe.     \n                  What does the data tell us about road traffic accidents in the UK?\n                 \n                  A father criticised the use of airdrops in Gaza. Five days later, he was killed by a falling pallet\n                 \n                  'We're being hunted': Russian attacks on Ukrainian emergency services rise ahead of Trump-Putin talks\n                 Talking about the weather The Home Office has pointed out that Labour took office in summer, when good weather tends to boost the number of Channel crossings. That is true, although the number of arrivals in a rolling 12-month period has also been steadily rising and now sits just short of the all-time record. A total of 45,823 people have arrived in the past 365 days, the highest total since April 2023. It was 46,870 when Rishi Sunak took office at the end of October 2022, following very high numbers of arrivals during the last months of Mr Johnson's tenure that continued through the short reign of Liz Truss. Within five days it reached 48,670, which is still the record. By the time Mr Sunak handed over to Sir Keir, it had fallen by more than a third, to 31,578. It has risen by 45% since then. Analysing the number of crossings over a full year means each period is equal in terms of the seasons it represents, but not necessarily the weather. The Home Office says that this winter was unusually sunny and lacking in wind, which has contributed to the record number of arrivals so far in 2025. That is true, but previous analysis by the Sky News Data x Forensics team found the high number of small boat arrivals under Labour cannot just be blamed on this. More migrants were also crossing on days when weather conditions were more challenging. This week, the first migrants were detained under a new \"one-in one-out\" deal agreed with France. Under the pilot scheme, the UK can exchange a migrant who arrived illegally for one who has not tried to cross and can pass security and eligibility checks. Numbers are limited and are thought to be up to 50 a week. The government hopes this will act as a deterrent. But our analysis found 50 people a week is less than 5% of the average number of weekly arrivals, and less than 0.3% of total net migration to the UK. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "David Lammy refers himself to watchdog after fishing with US vice president",
        "description": "David Lammy has referred himself to the environment watchdog after an \"administrative oversight\" meant he went fishing with JD Vance without a rod licence.",
        "url": "https://news.sky.com/story/david-lammy-refers-himself-to-watchdog-after-fishing-with-jd-vance-13411064",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jd-vance-david-lammy_6985600.jpg?20250808135753",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-13 12:13:00",
        "Headline": "The foreign secretary's failure to buy a valid rod licence was described as an \"administrative error\", but it could have netted him a fine of up to £2,500 - even though he did not catch anything.",
        "Content": "David Lammy has referred himself to the environment watchdog after an \"administrative oversight\" meant he went fishing with JD Vance without a rod licence. The foreign secretary failed to catch any fish when he hosted the US vice president at his grace-and-favour retreat in Kent on Friday. \"The Foreign Secretary has written to the Environment Agency over an administrative oversight that meant the appropriate licences had not been acquired for fishing on a private lake as part of a diplomatic engagement at Chevening House last week,\" a Foreign Office spokesperson said. Anglers in England and Wales aged 13 or over must have a rod licence to fish for freshwater species, such as carp, according to the Environment Agency. Failing to have a valid licence could result in a fine of up to £2,500. Mr Vance and his family had been staying with Mr Lammy at Chevening for two days before heading to the Cotswolds for a summer holiday. During their visit, Mr Vance described the foreign secretary as a \"good friend\" and a \"very, very gracious host\". \n                  JD Vance warns against UK going down 'dark path' of losing free speech during meeting with David Lammy\n                 \n                  Chevening is the ultimate ministerial perk – but the foreign secretary's mansion has an ungodly history\n                 \n                  People smugglers to have assets frozen and be banned from UK\n                  The vice president added: \"Unfortunately, the one strain on the special relationship is that all of my kids caught fish, but the foreign secretary did not.\" All fish that were caught were returned to the private lake, the PA news agency understands. Read more from Sky News:Clarkson targets JD Vance in CotswoldsJD Vance's candid comments over UKChevening is the ultimate ministerial perk A Foreign Office spokesperson added that as soon as the foreign secretary was made aware of the \"administrative error\" he purchased a fishing licence, then \"wrote to the Environment Agency notifying them of the error\". An Environment Agency spokesperson said: \"Everyone who goes fishing needs a licence to help improve our rivers, lakes and the sport anglers love. \"We understand the relevant licences have been purchased.\""
    },
    {
        "title": "Mosquito bite warning after rise in chikungunya cases in travellers returning to UK",
        "description": "Travellers are being warned about mosquito bites on holiday after a rise in chikungunya infections in people returning to the UK.",
        "url": "https://news.sky.com/story/mosquito-bite-warning-after-rise-in-chikungunya-cases-in-travellers-returning-to-uk-13411070",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-aedes-mosquito-mosquito_6989784.jpg?20250813134412",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-13 12:23:00",
        "Headline": "Doctors say people visiting certain regions should use insect repellent, cover their skin and sleep under bed nets.",
        "Content": "Travellers are being warned about mosquito bites on holiday after a rise in chikungunya infections in people returning to the UK. The UK Health Security Agency (UKHSA) also said the first cases of the emerging oropouche virus had been recorded. Chikungunya typically causes sudden fever and joint pain, which can be debilitating, and lasts from a few days to weeks. The name comes from a word in a Tanzanian language meaning \"that which bends up\", owing to the joint pain associated with it. Most people recover but in some cases the symptoms can last several months or even years. It's spread by mosquito bites in tropical and subtropical regions, and most of the 73 cases reported in the UK so far this year were in London and linked to travel to Sri Lanka, India, and Mauritius. Only 27 cases were reported in the same January to June period last year. \n                  Man accused of driving into Liverpool title parade crowds to appear in court today\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 \n                  UEFA Super Cup: Spurs let slip 2-0 lead to lose to PSG on penalties\n                 Chikungunya can't spread directly from person to person - so if someone becomes ill in the UK, they can't pass the infection on, and the mosquitos responsible aren't present here. Dr Philip Veal, consultant in public health at the UKHSA, said it can be a \"nasty disease\" and the increase in cases was \"worrying\". \"It is essential to take precautions against mosquito bites when travelling,\" he said. More on this story:Thousands fall ill with chikungunya in China \"Simple steps, such as using insect repellent, covering up your skin and sleeping under insecticide-treated bed nets can greatly reduce the risk.\" Chikungunya is mainly found in Asia and Africa, but cases have been reported in Europe and North America this year. Two vaccines to guard against the infection are available in the UK from private travel clinics. The first cases of the Oropouche virus have also been confirmed in Britain, according to the UKHSA. It's spread by midge and mosquito bites and the three cases are all linked to travel to Brazil. Oropouche was first identified in Trinidad and Tobago in the 1950s and had been mainly confined to the Amazon area. However, cases have been increasing since 2023 and have shown up in places such as the Dominican Republic, Cuba, and Peru. Read more from Sky News:Swarm of jellyfish shuts down nuclear plantVaccine gives hope for pancreatic cancer patients Symptoms include fever, headache, muscle and joint pain, nausea and vomiting. Anyone who gets such symptoms after being in Central and South America or the Caribbean is advised to get urgent medical advice. Most people recover on their own, but it can cause severe disease in the very elderly or those with a weak immune system."
    },
    {
        "title": "Cancer survival rates rise substantially but 'longer waits' hit progress for more deadly types of the disease, say researchers",
        "description": "The chances of surviving cancer for 10 years after diagnosis has increased by more than 24% in England and Wales over nearly five decades, but researchers say progress has slowed partly because of longer waiting times.",
        "url": "https://news.sky.com/story/cancer-survival-rates-rise-substantially-but-longer-waits-hit-progress-for-more-deadly-types-of-the-disease-say-researchers-13410898",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mammogram-istock_6819074.jpg?20250204101727",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-13 05:58:00",
        "Headline": "A study has found major variations in survival rates between different cancers, with Cancer Research UK saying some patients face unacceptable delays.",
        "Content": "The chances of surviving cancer for 10 years after diagnosis has increased by more than 24% in England and Wales over nearly five decades, but researchers say progress has slowed partly because of longer waiting times. A study, led by the London School of Hygiene and Tropical Medicine (LSHTM), suggests survival rates between the most and least deadly types of the disease are wider than ever before. Researchers examined long-term cancer trends for adults across England and Wales over 48 years, from 1971 to 2018. They found the cancer survival index (CSI) - the percentage surviving 10 years after diagnosis - was 49.8% for all cancers in 2018. That compares with just 23.7% in 1971. But experts say the speed of improvement has slowed down and \"is likely to be at least partly explained by longer waits for diagnosis and treatment,\" according to the report authors.  The study, funded by Cancer Research UK and published in the Lancet, shows the 10-year CSI between 2000/01 to 2005/06 rose by 4%. But examining a more recent period, between 2010/11 and 2015/16, the increase was just 1.4%. There were also major gaps in survival when it came to different cancer types. The 10-year survival for testicular cancer was 97%, compared with 4.3% for pancreatic cancer. Michelle Mitchell, chief executive of Cancer Research UK, said: \"Thanks to research, most patients today are far more likely to survive their cancer than at any point in the past. \"But the reality is that this progress is slowing - and for some cancers, it never got going in the first place.\" Screening programmes have significantly increased survival rates, including for breast cancer, where 76.6% now survive 10 years or more, along with bowel (53.9%) and cervix (63.5%), according to the most recent figures from Cancer Research UK. But survival rates for other types, like stomach cancer (16.1%), lung (10%) and brain (19.2%), have increased by only a small amount in the past few decades. Health correspondent With cancer, early intervention is the key. More screening, faster diagnosis and specialist treatment gives patients hope of much better outcomes. The government’s national cancer plan is expected to be published in the autumn and will address all of this and more, including prevention and research. The huge gap in survival rates for different cancers is worrying and needs to be addressed. It is true some cancers are more difficult to detect and treat. But the NHS has had some success in prostate cancer treatments, and that has happened partly because of targeted public information campaigns and extra screening. Mobile scanners have been deployed to areas where smoking rates are still high, and this strategy has proven successful for the early identification of previously undetected tumours. New therapies are emerging all the time. Personalised cancer vaccines will have a significant impact on survival rates. The workforce plan has promised to recruit and retain more specialists, including radiologists. But all of this will come as little comfort to the families who have been, and continue to be, devastated by this killer disease. Improving survival rates for many cancers is welcome news. For too long, the UK has fallen behind comparable healthcare systems. Michel Coleman, professor of epidemiology and statistics at LSHTM, said he had seen \"substantial increases\" in survival rates for most types of cancer, but \"allowing this trend to stall will have devastating consequences\". \"It's vital that the government provides the political and financial support to ensure we maintain this crucial data. Without these, the government will be flying blind on cancer control. \"The National Cancer Plan is a chance to improve NHS cancer pathways and reap the benefits of new research - the Government must take it,\" Prof Coleman said. Read more from Sky News:Vaccine to treat pancreatic cancerBreast removal calls to avoid cancer  Cancer Research UK is calling for the national cancer plan to slash waiting times for diagnosis and treatment, saying some patients face unacceptable delays. A Department of Health and Social Care spokesperson said: \"We are prioritising cancer care as we turn around more than a decade of neglect of our NHS. \"We're already seeing progress, with 95,000 more people having cancer diagnosed or ruled out within 28 days between July 2024 and May 2025, compared to the same period the previous year. \"The National Cancer Plan will set out how we will improve survival rates further and address the variation between different cancer types.\""
    },
    {
        "title": "UK weather: Yellow heat health alert extended across large parts of country amid heatwave",
        "description": "A yellow heat health alert has been extended into next week, affecting seven regions in England amid the fourth heatwave of the summer.",
        "url": "https://news.sky.com/story/fourth-uk-heatwave-of-summer-to-peak-today-with-34c-possible-in-some-areas-13411044",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-weather-uk-saltburn_6989733.jpg?20250813123448",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-13 11:27:00",
        "Headline": "The alerts are from 6pm today to 6pm next Monday and affect Yorkshire and The Humber, the East Midlands, the West Midlands, the East of England, London, the South East, and the South West.",
        "Content": "A yellow heat health alert has been extended into next week, affecting seven regions in England amid the fourth heatwave of the summer. The alerts are from 6pm on Wednesday to 6pm next Monday and are for Yorkshire and The Humber, the East Midlands, the West Midlands, the East of England, London, the South East, and South West. The warnings mean significant impacts on health and social care services are possible due to high temperatures, including a potential rise in deaths among the elderly or those with pre-existing health conditions. Alerts were previously due to end at 6pm on Wednesday. Heavy rain and thunder hit London and Kent on Wednesday afternoon, and the Met Office said it was likely the South East would continue to experience thick clouds and a risk of heavy thundery showers overnight. Northern England and Northern Ireland were expected to have isolated afternoon and evening thunderstorms. The Met Office issued a yellow thunderstorm warning for most of Scotland from 2pm until midnight, with the potential for up to 30mm of rain in less than an hour, and 50mm locally, as well as hail and gusty winds. \n                  UK weather: Water shortfall declared 'nationally significant' - as amber heat health alert comes into force\n                 \n                  UK weather: Amber heat health alert issued for large parts of England\n                 \n                  UK weather: Yellow heat health alert issued - with temperatures set to hit 30C and a fourth summer heatwave forecast\n                 Tuesday's temperatures reached 33.4C in Benson in Oxfordshire and Ross-on-Wye in Herefordshire. It's predicted to cool by a couple of degree as the week goes - but will stay very warm. \"On Thursday, there will still be a few showers, particularly in the North, and it will not be quite as hot, but temperatures will still peak around 29C to 30C in East and South East England,\" said Marco Petagna, a meteorologist at the Met Office. \"Friday looks mostly fine, with very hot sunshine in the South and South East, where temperatures could reach 31C, while Scotland will see highs in the low 20s.\" Read more:Get the Sky News weather forecast for your areaThree teenagers charged with man's murder at seaside resort The National Drought Group - which includes the Met Office, water firms and others - met on Tuesday over what it said was now a \"nationally significant incident\" in England. Five areas remain in drought and six more are in prolonged dry weather status. The group said it had been the driest six months to July since 1976, and the latest heatwave was putting more pressure on water supplies. A hosepipe ban remains in place in Yorkshire, while Thames Water, South East Water and Southern Water have bans in certain postcodes."
    },
    {
        "title": "Harvey Weinstein to be tried for third time in New York after mistrial on rape charge",
        "description": "Disgraced US film producer Harvey Weinstein is to be tried for a third time in a sexual assault case.",
        "url": "https://news.sky.com/story/harvey-weinstein-to-be-tried-for-third-time-in-new-york-after-mistrial-on-rape-charge-13410961",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-harvey-weinstein-court_6908256.jpg?20250506165629",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-13 08:11:00",
        "Headline": "In June this year, a New York jury could not reach a verdict against the 73-year-old disgraced film producer who was accused of raping actress Jessica Mann, and a mistrial was declared.",
        "Content": "Disgraced US film producer Harvey Weinstein is to be tried for a third time in a sexual assault case. A jury in New York could not reach a verdict in June against the 73-year-old who was accused of raping actress Jessica Mann, and a mistrial was declared. Judge Curtis Farber has said he wants the new trial to happen before the end of this year. The same jury found Weinstein guilty in June of sexually assaulting former Project Runway production assistant Miriam Haley in 2006 and not guilty of assaulting Polish former runway model Kaja Sokola the same year. Weinstein will be sentenced for the guilty verdict in Ms Haley's case on 30 September. He denied all of the charges. Throughout the retrial, his lawyers insisted the sexual encounters with his three accusers were \"transactional\" and \"consensual,\" and labelled the women as opportunists. Weinstein was originally convicted of rape and criminal sexual act by the same court in 2020 and sentenced to 23 years in prison for the crimes. Last year, however, New York's highest court overturned the conviction, prompting Weinstein's retrial this summer. Weinstein was once one of the most powerful people in Hollywood - the co-founder of film and television production companies Miramax and The Weinstein Company, who produced films such as the Oscar-winning Shakespeare In Love, Pulp Fiction, and The Crying Game. In 2017, a series of sexual misconduct allegations against him propelled the #MeToo movement. Some of those accusations later led to criminal charges and his convictions in New York and California. Before the retrial, Weinstein was also serving a 16-year prison sentence after being found guilty of rape in California in December 2022. He has also denied this charge."
    },
    {
        "title": "TV presenter Jay Blades appears in court charged with two counts of rape",
        "description": "TV presenter Jay Blades has appeared in court charged with two counts of rape.",
        "url": "https://news.sky.com/story/tv-presenter-jay-blades-appears-in-court-charged-with-two-counts-of-rape-13410910",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-jay-blades-l-court_6688159.jpg?20250813104232",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-13 06:18:00",
        "Headline": "Blades, who fronted BBC show The Repair Shop, was granted conditional bail to appear at Shrewsbury Crown Court on 10 September.",
        "Content": "TV presenter Jay Blades has appeared in court charged with two counts of rape. The 55-year-old appeared via video link at Telford Magistrates' Court and spoke only to confirm his name, address and date of birth at the six-minute hearing on Wednesday. Blades, from Claverley in Shropshire, was granted conditional bail to appear at Shrewsbury Crown Court on 10 September. He was not required to enter pleas during his first appearance. The presenter found fame on the furniture restoration programme The Repair Shop after he started presenting in 2017. A furniture restorer, he was the face of the popular BBC show that featured people having their treasured objects repaired and rejuvenated until he stepped back from presenting the programme last year. Read more from Sky News:Backlash over police vans with facial recognitionNew questions for driving theory tests Blades was also the presenter of the BBC's Money For Nothing until 2020 and took part in Celebrity Masterchef, Celebrity Bake Off, and Comic Relief."
    }
]