[
    {
        "title": "Swiss bar fire: Likely cause of resort blaze identified - as teen educated in UK named among missing",
        "description": "Sparklers on champagne bottles have been identified by officials as the likely cause of a deadly fire at a Swiss ski resort, as pictures of teenagers still unaccounted for began to emerge.",
        "url": "https://news.sky.com/story/swiss-bar-fire-likely-cause-of-resort-blaze-identified-as-teen-educated-in-uk-named-among-missing-13489737",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-swiss-bar-fire-switzerland_7124818.jpg?20260102234433",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-02 15:55:00",
        "Headline": "The identities of some young people caught in the bar blaze have been revealed. But the severity of burns mean it could take weeks for all victims to be identified. Authorities have now named the likely cause of the fire, but investigations are ongoing.",
        "Content": "Sparklers on champagne bottles have been identified by officials as the likely cause of a deadly fire at a Swiss ski resort, as pictures of teenagers still unaccounted for began to emerge. At least 40 were killed and a further 119 were injured in the blaze that swept through the Constellation bar in Crans-Montana in the early hours of New Year's Day. Read more: Everything we know about ski resort fire A former Hertfordshire schoolgirl is among the teenagers still missing. The severity of burns is making it harder to identify the dead and injured. Experts are relying on DNA samples for some cases, in a process that could take weeks. Scrutiny turns to safety set-up and fire's cause On Friday officials tentatively confirmed a theory circulating online about the cause of the fire. \"It would appear that the fire started from sparkler candles, otherwise known as flares, which were placed on top of champagne bottles,\" Valais attorney general Beatrice Pilloud told a news conference. Images shared on social media showed a group of people with sparklers affixed to bottles that appear to be setting fire to the ceiling, and a woman on a man's shoulders holding up champagne bottles with sparklers in them. But Ms Pilloud said it was too soon to say whether a foam-like material on the ceiling, possibly sound-proofing, had contributed to the spread of the fire. A retired fire firefighter told Sky News the same type of material used to clad Grenfell Tower was likely coating the ceiling of the basement bar. Having reviewed images and videos circulating online, Steve Dudney said he believed the foam that ignited was highly flammable polyurethane, which should be \"nowhere where there are uncontrolled naked flames\". Ms Pilloud said the bar's owners, Jacques and Jessica Moretti, a French couple, were interviewed as \"people called to give information\", not under caution. There are many outstanding questions about the nature of exits and about safety protocols in the bar. It had more than one emergency exit, but it wasn't found by victims. Agonising wait for families The severity of the damage means details about the victims have emerged in instalments, leaving relatives in a painstaking limbo. Some 22 young patients are in critical condition at Lausanne University Hospital. The injured included 71 from Switzerland, 14 French nationals and 11 Italians, along with citizens of Serbia, Bosnia-Herzegovina, Luxembourg, Belgium, Portugal and Poland, according to Frederic Gisler, police commander of the Valais region. The nationalities of 14 people were unclear. Read more from Sky News:Snow warnings upgradedMagistrates recruitment drive launched Who has been named so far? Those still unaccounted for include Charlotte Niddam, who previously attended Immanuel College, a private school in Hertfordshire. Her nationality has not been confirmed. According to the Crans-Montana resort website, she had been working as a babysitter in the area. Italian national Emanuele Galeppini, 17 and a golf prodigy, was the first victim to be reported dead, with news confirmed by the Italian Golf Federation earlier on Friday. Another teenager who is still missing is Arthur Brodard. CNN reported that the Swiss 16-year-old joined around 10 of his friends on New Year's Eve at Le Constellation. His parents Laetitia Brodard and her husband Christophe, who are from the Swiss city of Lausanne, said the group often met in the resort town. \"We are so empty,\" Mr Brodard said. \"We think he could still be alive, so we still have hope of finding him.\" He added: \"They ordered a bottle of champagne with a sparkler. One or two minutes later, it was the apocalypse.\" Alice Kallergis, a 15-year-old girl from Greece, is also reportedly missing. Her brother, Romain, told protothema.gr: \"We still know nothing about my sister.\" The family of another young person has appealed for information. Emilie Pralong has been missing since the fire, according to posts on Facebook."
    },
    {
        "title": "Recruitment drive launched for new magistrates",
        "description": "The government is launching a drive to recruit thousands of new volunteers to serve as magistrates in England and Wales, as it seeks to get a grip of the courts backlog.",
        "url": "https://news.sky.com/story/recruitment-drive-launched-for-new-magistrates-13489785",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-lammy-lord-chancellor_7124719.jpg?20260102200448",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-02 19:30:00",
        "Headline": "Justice Secretary David Lammy wants to recruit 2,000 new magistrates in the next year, as the government seeks to tackle the courts backlog and speed up access to justice.",
        "Content": "The government is launching a drive to recruit thousands of new volunteers to serve as magistrates in England and Wales, as it seeks to get a grip of the courts backlog. More than 2,000 magistrates have been trained since 2022, and ministers want to recruit the same number again over the next financial year, the Ministry of Justice (MoJ) says. The recruitment effort is part of the government's bid to reduce the backlog and speed up justice for victims, and comes on the heels of the announcement of a series of reforms - including controversial plans to limit jury trials. Deputy Prime Minister and Justice Secretary David Lammy said: \"Magistrates play a vital role in our court system - hearing thousands of cases across every jurisdiction and delivering justice. \"They are everyday heroes - and we need more people of every age and background to volunteer not just to deliver justice but to serve and represent their local communities. \"Volunteering to become a magistrate can make a real difference to your life and the lives of others - that's why I'm calling on the public to apply and play your part.\" The Magistrates' Association said the move was a \"big vote of confidence\" in magistrates, but more resources are needed for the courts, including enough trained, well-paid legal advisers, and repairing crumbling court buildings. What's expected of new recruits? Magistrates are expected to volunteer at least 13 days a year to hear cases, and judiciary bosses are seeking candidates with good communication skills, a sense of fairness and the ability to see an argument from different sides. New recruits are wanted across criminal, youth, and civil and family proceedings, and have specialist legal advisers to support them to deal with a range of cases. According to the latest figures from the MoJ, 57% of magistrates are female and 14% come from an ethnic minority background, aside from London where it is the highest proportion of 31%. Read more from Sky News:Snow warnings upgradedLikely cause of Swiss bar fire identified Shadow justice minister Kieran Mullan welcomed efforts to recruit more magistrates, but said it \"cannot paper over the failings of a justice secretary and Labour government that has consistently failed to deliver meaningful reform.\" The senior Tory described the previously announced plans to scrap jury trials as \"reckless\", and warned it \"risks undermining public confidence\". The drive to recruit new magistrates comes after Mr Lammy announced a series of proposals last month to overhaul the courts, including increasing magistrates' sentencing powers up to 18 months' imprisonment, up from 12 months currently, so they will be able to deal with more serious cases. But the most controversial of the planned reforms is to remove the right to a jury trial for defendants who are likely to get a sentence of three years or less. It has sparked concerns across the political spectrum, and 38 Labour MPs have come out publicly against the move, describing it in a letter to the prime minister as an \"ineffective way\" of dealing with the backlog, although it is understood that more are privately opposed as well."
    },
    {
        "title": "Two people die after being pulled from the sea off Yorkshire coast with one still missing",
        "description": "Two people have died amid a major search and rescue operation for people who got into difficulty in the sea off the Yorkshire coast.",
        "url": "https://news.sky.com/story/major-search-for-two-missing-people-in-sea-off-yorkshire-coast-13489773",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dover-kent-coastguard_7015302.jpg?20250909164621",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-02 18:32:00",
        "Headline": "A mass rescue operation has called in ambulance, police, fire and the coastguard in a race to find people who had gone missing in the water near Withernsea.",
        "Content": "Two people have died amid a major search and rescue operation for people who got into difficulty in the sea off the Yorkshire coast. Officials were first alerted to reports of people in trouble near Withernsea at 3.10pm on Friday. A 67-year-old man was found unconscious in the water and later confirmed to have died. Late on Friday evening, Humberside Police said a second body was recovered from the sea and added that \"circumstances are not believed to be suspicious.\" Searches are ongoing, and one person is still thought to be missing. The force asked people to avoid the area to allow the emergency services to carry out their work. HM Coastguard said it had deployed a search and rescue helicopter and a fixed-wing aircraft to the scene on England's east coast. The rescue operation also called in local coastguard and RNLI (Royal National Lifeboat Institution) rescue teams, Yorkshire Ambulance Service, an air ambulance, Humberside Police and Humberside Fire and Rescue. Temperatures in the seaside town are forecast to drop to freezing overnight. Earlier, East Riding of Yorkshire council confirmed a severe weather protocol was in place due to the cold. Read more from Sky News:Snow warnings upgradedMagistrates recruitment drive launched Hornsea Inshore Rescue, a local independent group of volunteers, earlier said the treacherous conditions had stopped it from launching. \"Called out, unable to launch the lifeboat due to horrendous conditions and 3 metre waves breaking on our slipway which would knock the tractor and trailer sideways off the ramp,\" it said in a statement on social media this afternoon. In a post yesterday, the group said it had called off a New Year's Day public swim because \"the sea conditions were just not suitable today for us to condone anyone entering the water\". Yesterday in Brighton a 51-year-old man died after getting into difficulty in the water."
    },
    {
        "title": "US 'locked and loaded' Trump warns Iran, as he pledges to rescue protesters",
        "description": "US President Donald Trump has threatened to intervene in Iran's cost-of-living protests, provoking a warning that he could destabilise the entire region. ",
        "url": "https://news.sky.com/story/us-locked-and-loaded-trump-warns-iran-as-he-pledges-to-rescue-protesters-13489621",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran-grand-bazaar_7123708.jpg?20260101151714",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-02 10:37:00",
        "Headline": "The Islamic republic faces its largest demonstrations in more than three years the currency plunges and people chant against the regime.",
        "Content": "US President Donald Trump has threatened to intervene in Iran's cost-of-living protests, provoking a warning that he could destabilise the entire region.  In a post on his social media platform, Truth Social, on Friday, Mr Trump wrote: \"If Iran shoots [sic] and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue.\" \"We are locked and loaded and ready to go.\" At least seven people have been reported to have been killed in violence during protests sweeping parts of Iran, including capital Tehran. They have been sparked in part by the collapse of country's rial currency. In response to Mr Trump's post, the secretary of Iran's Supreme National Security Council, Ali ⁠Larijani, wrote on X: \"Trump should know that U.S. interference in this internal matter would mean destabilising the entire region and destroying America's interests. \"The American people should know - Trump started this adventurism. They should be mindful of their soldiers' safety.\" America has a large wide military footprint in the region and tensions had already been rising with Iran. In June the Islamic republic attacked the US Al Udeid Air Base in Qatar. \n                  Several people killed in Iran as cost-of-living protests turn deadly\n                 \n                  Iranian protesters attempt to break in to government building\n                 \n                  Iranian university students join protests over soaring cost of living\n                 The missile launches were a retaliation for US strikes on three nuclear sites during Israel's 12-day war on the Islamic Republic, also in June. Protests in the Iran have now reached their sixth day, making them the biggest since 2022, when the death of 22-year-old Mahsa Amini in police custody triggered nationwide demonstrations. But the protests have yet to go countrywide and have not been as intense as those surrounding the death of Ms Amini, who was detained for not wearing her headscarf to the liking of authorities. Read more:What we know about deadly New Year's fire at Swiss ski resortNew York's new mayor 'won't hesitate' to use his power The latest demonstrations were initially triggered by economic concerns, but have included chants against Iran's theocracy. Iran's civilian government led by reformist President Masoud Pezeshkian has been trying to signal it wants to negotiate with protesters. But Mr Pezeshkian has acknowledged there is little he can do as the currency rapidly depreciates, with one dollar now costing some 1.4 million rials, pushing up domestic prices."
    },
    {
        "title": "Russian winemakers think they're ready to join the elite - our taste test says otherwise",
        "description": "You've probably never had a glass of Russian sparkling wine before. Perhaps you never even knew such a thing existed. If that's the case, Mikhail Nikolaev believes you're missing out.",
        "url": "https://news.sky.com/story/russian-winemakers-think-theyre-ready-to-join-the-elite-our-taste-test-says-otherwise-13489675",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mikhail-nikolaev-bennett_7124462.jpg?20260102133100",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2026-01-02 13:08:00",
        "Headline": "With sanctions preventing the importing of Western wines, Russian winemakers have been striving to up their game and produce vintages that match those from France or other grape-growing regions. But what do drinkers think?",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n You've probably never had a glass of Russian sparkling wine before. Perhaps you never even knew such a thing existed. If that's the case, Mikhail Nikolaev believes you're missing out. He's one of the sons in Nikolaev & Sons, a wine producer in Russia's Krasnodar region, near the Black Sea. \"If you're looking for a kind-of-like Champagne that is not made in Champagne, you have, obviously, the British options, you have Northern Italy, and you have us,\" he tells me, across a table inside the vineyard's stylish restaurant. His father started the business two decades ago. Standing outside the Tuscan-style visitor complex that is now at the centre of it, I can see hills all around me carpeted in rows of grapevines. They specialise in sparkling wine, from Chardonnay and Pinot Noir varieties, and follow the traditional method of production, which involves ageing the wine on dead yeast cells, known as \"lees\". Big ambition Champagne and a lot of English fizz is made in the same way, hence Mikhail's comparison. \"I know it's going to sound maybe a little pretentious, but climatically, we have the potential to be within the top sparkling regions of the world,\" he says confidently. International recognition will have to wait for now, though. Russia's invasion of Ukraine has put paid to that, with sanctions cutting off Western export markets. But while conflict has constrained growth abroad, it's had the opposite effect at home, where sanctions have forced Russians to buy more domestic vintages to quench their thirst. Nikolaev & Sons currently produces 60,000 bottles of sparkling wine a year but plans to double that by 2032 to meet the ripening demand. \"Right now is the moment where we can potentially grow considerably,\" Mikhail says. \"I think that there's not really some sort of cap.\" Patriotic push Ten years ago, local wines made up a quarter of the Russian market, but now they account for nearly two-thirds of all sales, after sanctions reduced the availability of foreign wines and made them a lot more expensive. The Kremlin has also engaged in a patriotic push of local produce, to help offset the economic impact of sanctions. You can see it on the supermarket shelves, where Russian wines now dominate and are heavily promoted. But are they actually any good? If sanctions were lifted, would European imports reclaim their top spot? How do the two compare? \"If we are talking about mass market wines, there is no difference,\" Denis Rudenko, a member of the Russian Sommelier Society, tells me. He's been a sommelier for 25 years and has followed the local wine industry's transformation. Russia doesn't have many \"collectables\" yet, but he believes it might within the next two decades. That's the theory, at least. Time to put it to the test... At an upmarket wine bar in Moscow, we've set up a blind tasting - a Russian Riesling (wine number one) versus a German Riesling (wine number two). Which one do punters prefer? \"The second one,\" replies our first volunteer, unsure why. Another sip…\"It's lighter,\" she says. Her choice is matched by a man on the next table, but for different reasons. \"The second one has more nuanced flavours,\" he says after careful deliberation. \"The first is more acidic.\" One more table over, and it's the same again. \"I like how the first one smells,\" a blonde-haired woman says, \"but I prefer how the second one tastes, it's softer.\" So, a win for the Western wine. Three-nil. Wine patriotism only goes so far, it seems."
    },
    {
        "title": "The Voice Of Hind Rajab: Brad Pitt-backed film about death of child in Gaza set for UK release",
        "description": "A film based on the death of a five-year-old girl during Israel's war in Gaza is set to hit UK cinemas this month.",
        "url": "https://news.sky.com/story/the-voice-of-hind-rajab-brad-pitt-backed-film-about-death-of-child-in-gaza-set-for-uk-release-13489718",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-hind-rajab-film-venice_7124529.jpg?20260102145739",
        "type": "Home",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2026-01-02 14:37:00",
        "Headline": "The death of Hind Rajab in January 2024 was investigated by Sky News, which found Israeli tanks were present in the area and likely to have fired at civilians. A new film - backed by Brad Pitt and Joaquin Phoenix - dramatises the story.",
        "Content": "\n          News correspondent\n              @esadiya\n A film based on the death of a five-year-old girl during Israel's war in Gaza is set to hit UK cinemas this month. The January 2024 killing of Hind Rajab shocked the world after her desperate telephone calls with the Palestinian Red Crescent Society (PRCS) emergency services were recorded in real time and made public. Hind and six of her relatives (the Hamada family) had been attempting to escape the fighting in Gaza City when their car came under attack. The Voice Of Hind Rajab, directed by Kaouther Ben Hania, fuses Hind's actual voice with a dramatised performance to tell the story of her desperate cries for help. Set inside the charity's West Bank call centre, the film reconstructs the resolute efforts of Red Crescent workers during a hopeless negotiation with the Israelis over a safe route for the rescue. Over 90 minutes, an avoidable tragedy is played out from the perspective of the call handlers who listen, refuse to abandon hope, and sometimes fight over the rules of sending an ambulance out to a deadly mission. The film invites an audience that already knows how the story ends to feel the long and frustrating wait, and to experience the complex Israeli protocols Palestinians have to live by. What unfolds is an uncomfortable watch as day turns to evening and the child's voice pleads: \"Please don't leave me, I'm afraid of the dark.\" 'The magical power of cinema' Director Kaouther Ben Hania says the film was not about investigating the death. Speaking to Sky News, she said she wanted to let audiences feel what life is like for Palestinians living under Israeli occupation. \"This story was investigated by The Washington Post and Sky News, so in terms of explaining what happened, this was done,\" she said. \"I asked myself what can cinema bring to the table? Cinema has a magical power of empathy - you experience 'otherness', you live the life of others. And I thought, we are done explaining, now let's feel. \"What does it mean to be Palestinian, working in the Red Crescent? Your mission is to save lives, and you have this system making your life impossible.\" PRCS staff kept Hind on the line for hours through multiple calls before an ambulance could finally be dispatched. By 6pm, the ambulance crew were close to the family car, telling dispatchers they had their emergency lights on but no siren. \"Oh, there she is,\" a paramedic said, just before communication ended abruptly with the sound of heavy gunfire. Both paramedics were killed, and all nine bodies were found 12 days later. 'I felt my heart going to explode' Palestinian actor Motaz Malhees plays Omar, the first call handler to take Hind's call. He told Sky News how repeatedly hearing the child's voice during the making of the film took its toll on the cast and crew. \"Thinking about it and hearing her voice begging to be rescued, I was feeling so powerless,\" he said. \"There were some moments I felt I had panic attacks, and during one of the scenes I felt my heart is going to explode.\" Awards buzz and big name backing The film is a contender at this year's Oscars and received a record 23-minute standing ovation at the 2025 Venice Film Festival where it won the Grand Jury Prize. Hollywood elites Brad Pitt and Joaquin Phoenix signed on as executive producers, which Malhees said felt like \"a great honour.\" The Israel Defence Forces (IDF) said it was not in the area on the day of Hind's death, but it made its presence there public, perhaps mistakenly. Twelve days after the attack, on the same day the car and ambulance were found, the IDF published a press release about its activities in Gaza, saying \"over the last two weeks\" it had \"conducted raids on terror targets\" with forces operating in Shati and Tel al Hawa neighbourhoods in Gaza. Tel al Hawa is the same neighbourhood where Hind Rajab, the Hamada family, and the paramedics were killed. The press release was later deleted from the IDF website and a Sky News investigation found a number of Israeli tanks were indeed present and likely to have fired at civilians. The Voice Of Hind Rajab is set for UK and Irish theatrical release on 16 January."
    },
    {
        "title": "'The State of South Arabia': Yemen separatists announce plan for independence",
        "description": "Yemen's southern separatist movement has announced a constitution and aims to hold a referendum on independence from the north.",
        "url": "https://news.sky.com/story/the-state-of-south-arabia-yemen-separatists-announce-plan-for-independence-13489815",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-yemen-stc-aden_7124821.jpg?20260102235901",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-02 22:54:00",
        "Headline": "Saudi Arabia, the United Arab Emirates and their allies in Yemen have all been part of a coalition fighting Iranian-backed Houthi rebels in the north - but growing tensions between the factions and the two Gulf nations appear to be unravelling the coalition.",
        "Content": "Yemen's southern separatist movement has announced a constitution and aims to hold a referendum on independence from the north. It is not immediately clear if the move by the Southern Transitional Council (STC), backed by the United Arab Emirates (UAE), could be implemented or was largely symbolic. But it is an escalation of a confrontation that has pitted Saudi Arabia, which supports Yemen's internationally recognised government, and the UAE against each other. The UAE announced it was pulling its troops out of Yemen shortly after the separatists' statement. Last month, STC-linked fighters seized control of two southern provinces from Saudi-backed forces and took over the presidential palace in the south's main city, Aden, forcing the government there to flee to the Saudi capital, Riyadh. On Friday, Saudi warplanes bombed camps and military positions held by the STC in Hadramout province as Saudi-backed fighters tried to seize the facilities, a separatist official said. It was the latest intervention by Saudi Arabia, which in recent weeks has bombed STC forces and struck what it said was a shipment of Emirati weapons destined for the separatists. Saudi Arabia, the UAE, and their allies in Yemen have all been part of a Saudi-led coalition fighting Iranian-backed Houthi rebels who control the north. The decade-long civil war has devastated the Arab world's poorest country. The coalition's goal is to restore the internationally recognised government, which was driven out of the north by the Houthis. But tensions between the factions and the two Gulf nations appear to be unravelling the coalition. 'The right to self-determination' The head of the STC, Aidarous al Zoubeidi, issued a video statement on Friday saying the constitution would be in effect for two years, after which a referendum would be held on \"exercising the right to self-determination for the people of the South\". Read more from Sky News:Israel's deadly strikes on YemenHouthi rebels raid UN sitesHouthi drone attack on Israel During those two years, he said, the \"relevant parties\" in north and south Yemen should hold a dialogue on \"a path and mechanisms that guarantee the right of the people of the South\". The 30-article constitution describes the creation of \"the State of South Arabia\", covering the same territory as the former People's Democratic Republic of Yemen, the independent southern state that existed from 1967 to 1990. It was not clear what practical impact it would have. But the declaration could set back efforts to avert an outright conflict between the separatists and the rest of the Saudi-led coalition. The UAE's foreign ministry said in a statement that the country was dealing with the situation \"with restraint, coordination, and a deliberate commitment to de-escalation, guided by a foreign policy that consistently prioritises regional stability over impulsive action\". In a post on X, the Saudi ambassador to Yemen, Mohammed al-Jaber, said the kingdom had tried \"all efforts with STC\" for weeks \"to stop the escalation\" and urge the separatists to leave Hadramout and Mahra, but faced \"continued intransigence and rejection from Aidarous al Zoubeidi\"."
    },
    {
        "title": "Nigel Farage giving 'serious thought' to scrapping OBR if Reform wins next general election",
        "description": "Nigel Farage has said he is giving \"serious thought\" to scrapping the Office for Budget Responsibility (OBR) if his party wins the next general election and he becomes prime minister.",
        "url": "https://news.sky.com/story/nigel-farage-giving-serious-thought-to-scrapping-obr-if-reform-wins-next-general-election-13489799",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigel-farage-press-conference_7124747.jpg?20260102211715",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-02 21:10:00",
        "Headline": "The Reform UK leader said the budget watchdog is \"effectively dictating to elected politicians\". But Labour warned against \"fiscal recklessness\".",
        "Content": "Nigel Farage has said he is giving \"serious thought\" to scrapping the Office for Budget Responsibility (OBR) if his party wins the next general election and he becomes prime minister. The Reform UK leader said the budget watchdog leaves chancellors \"beholden to it rather than doing their own thinking\", and said it is \"effectively dictating to elected politicians\". But Treasury minister James Murray warned against \"fiscal recklessness\" and claimed Mr Farage would \"hammer the British economy with a Liz Truss plan on steroids\". Speaking to The Telegraph newspaper, Mr Farage said: \"I have questioned the need for it. The question we have to ask ourselves is 'is the OBR serving any useful purpose?'\" He added: \"We have to discuss whether we would be better off without the OBR. I am giving that very serious thought.\" He went on: \"With the OBR I worry once again that we have a Blairite-style quango effectively dictating to elected politicians what they should or should not do. \"It seems that in too many areas of our public life the power has moved to judges and quangos and not the government the people choose.\" \n                  Nigel Farage vows to go 'double or quits' with £5m local elections spending blitz\n                 \n                  Too late to investigate Farage election expenses, Essex Police say\n                 \n                  Attempting to rejoin EU customs union 'complete fuel for Reform', Starmer warned\n                 The OBR was created in 2010 by the Conservative-Liberal Democrat coalition government, and it is mandated to produce five-year forecasts for the economy and the public finances. These are published twice yearly, alongside the budget and the spring statement, and factor in any tax and spending decisions announced by the chancellor. However, the watchdog has come under fire in recent years over the accuracy of its forecast, as well as its perceived excessive influence over politicians' decision-making. It also hit the headlines at last year's budget after its forecasts were accessible on its website before the chancellor had delivered her statement in the Commons, resulting in the resignation of its chairman, Richard Hughes. There have also been tensions with the Treasury, and OBR officials had raised concerns with the Treasury about budget leaks spreading \"misconceptions\" about its forecasts. Mr Farage told The Telegraph that the OBR \"distorts policy\", and said: \"Chancellors become beholden to it rather than doing their own thinking. \"Given the economic decline that we're in, we need a government of radicalism. It is difficult to imagine the OBR is capable of radicalism in any way at all.\" Asked who would be responsible for economic forecasts if he were to scrap the watchdog, the Reform UK leader declined to answer. Prior to the OBR's creation, forecasts were produced by the Treasury, which led to accusations the numbers were skewed in favour of the government. Former prime minister Liz Truss declined to get the OBR to analyse her 2022 \"mini-budget\" ahead of its delivery, which is seen as having contributed to the negative market reaction that led to her resignation. In response to Mr Farage's comments, chief secretary to the Treasury Mr Murray said: \"Not content with taking advice from Liz Truss, Nigel Farage is now willing to go further. \"Working people know the price of fiscal recklessness - many are still paying huge sums more on their mortgages than they would have done before Liz Truss crashed the economy. Yet Farage still called it the best Conservative budget since 1986. \"It's time Nigel Farage realised that politics isn't a game. He'd hammer the British economy with a Liz Truss plan on steroids - and it's working people and British businesses who'd be left to foot a very heavy bill.\""
    },
    {
        "title": "Recruitment drive launched for new magistrates",
        "description": "The government is launching a drive to recruit thousands of new volunteers to serve as magistrates in England and Wales, as it seeks to get a grip of the courts backlog.",
        "url": "https://news.sky.com/story/recruitment-drive-launched-for-new-magistrates-13489785",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-lammy-lord-chancellor_7124719.jpg?20260102200448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-02 19:30:00",
        "Headline": "Justice Secretary David Lammy wants to recruit 2,000 new magistrates in the next year, as the government seeks to tackle the courts backlog and speed up access to justice.",
        "Content": "The government is launching a drive to recruit thousands of new volunteers to serve as magistrates in England and Wales, as it seeks to get a grip of the courts backlog. More than 2,000 magistrates have been trained since 2022, and ministers want to recruit the same number again over the next financial year, the Ministry of Justice (MoJ) says. The recruitment effort is part of the government's bid to reduce the backlog and speed up justice for victims, and comes on the heels of the announcement of a series of reforms - including controversial plans to limit jury trials. Deputy Prime Minister and Justice Secretary David Lammy said: \"Magistrates play a vital role in our court system - hearing thousands of cases across every jurisdiction and delivering justice. \"They are everyday heroes - and we need more people of every age and background to volunteer not just to deliver justice but to serve and represent their local communities. \"Volunteering to become a magistrate can make a real difference to your life and the lives of others - that's why I'm calling on the public to apply and play your part.\" The Magistrates' Association said the move was a \"big vote of confidence\" in magistrates, but more resources are needed for the courts, including enough trained, well-paid legal advisers, and repairing crumbling court buildings. What's expected of new recruits? Magistrates are expected to volunteer at least 13 days a year to hear cases, and judiciary bosses are seeking candidates with good communication skills, a sense of fairness and the ability to see an argument from different sides. New recruits are wanted across criminal, youth, and civil and family proceedings, and have specialist legal advisers to support them to deal with a range of cases. According to the latest figures from the MoJ, 57% of magistrates are female and 14% come from an ethnic minority background, aside from London where it is the highest proportion of 31%. Read more from Sky News:Snow warnings upgradedLikely cause of Swiss bar fire identified Shadow justice minister Kieran Mullan welcomed efforts to recruit more magistrates, but said it \"cannot paper over the failings of a justice secretary and Labour government that has consistently failed to deliver meaningful reform.\" The senior Tory described the previously announced plans to scrap jury trials as \"reckless\", and warned it \"risks undermining public confidence\". The drive to recruit new magistrates comes after Mr Lammy announced a series of proposals last month to overhaul the courts, including increasing magistrates' sentencing powers up to 18 months' imprisonment, up from 12 months currently, so they will be able to deal with more serious cases. But the most controversial of the planned reforms is to remove the right to a jury trial for defendants who are likely to get a sentence of three years or less. It has sparked concerns across the political spectrum, and 38 Labour MPs have come out publicly against the move, describing it in a letter to the prime minister as an \"ineffective way\" of dealing with the backlog, although it is understood that more are privately opposed as well."
    },
    {
        "title": "Hundreds of jobs to be lost in TGI Fridays insolvency plan",
        "description": "Hundreds of British hospitality workers face losing their jobs in the coming days as the owner of TGI Fridays finalises plans to buy back a slimmed-down version of one of Britain's best-known casual dining chains.",
        "url": "https://news.sky.com/story/hundreds-of-jobs-to-be-lost-in-tgi-fridays-insolvency-plan-13489776",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-swaminarayan-leicester-square_7067973.jpg?20251031151744",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-02 18:49:00",
        "Headline": "The new owner of one of the UK’s most prominent restaurant chains is finalising plans for a pre-pack administration which will involve site closures and job cuts, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Hundreds of British hospitality workers face losing their jobs in the coming days as the owner of TGI Fridays finalises plans to buy back a slimmed-down version of one of Britain's best-known casual dining chains. Sky News has learnt that Sugarloaf TGIF Management, which only took control of TGI Fridays two months ago, is preparing to implement a pre-pack administration of the business in a deal which is expected to take place next week. Insiders said a transaction was expected to involve the closure of a significant proportion of the estate's 49 restaurants. One suggested that between 15 and 20 of the sites could be permanently axed, although the final number is still being worked on and has yet to be determined. They cautioned that a deal could yet be delayed beyond next week. A pre-pack insolvency involves a buyer being lined up for a company or its assets without its financial liabilities, immediately after the appointment of administrators takes place. If the pre-pack scenario and site closure plan does materialise, it would inevitably mean hundreds of TGI Fridays' nearly 2,000-strong workforce in the UK being made redundant. \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  Former TGI Fridays chief in move to snap up UK chain \n                 \n                  Private equity backers call time on bar chain The Alchemist\n                 Interpath Advisory has been lined up to handle the pre-pack administration, with two notices of intention to appoint the firm having been filed in the run-up to Christmas. A company spokesperson told Sky News on Friday: \"TGI Fridays UK is still assessing all options for the future of the business. \"No decisions have been made yet and locations continue to operate as usual.\" The crisis at TGI Fridays represents another blow to the hospitality sector, with bosses complaining bitterly about the impact of national insurance and other tax hits in chancellor Rachel Reeves's Budgets in 2024 and 2025. Read more from Sky News:Starmer accused of diverting NHS 'billions' to appease TrumpAnthony Joshua's driver charged over deadly Nigeria crash The chain was put up for sale in November, just a few weeks after Sugarloaf TGIF Management, a company run by the chain's former chief executive, Ray Blanchette, bought it. Under Breal and Calveton, its previous owners, the performance of the business was said to have stabilised. They had acquired the chain from London-listed Hostmore, under the ownership of which a previous insolvency filing had taken place in 2024. At that point, TGI Fridays traded from close to 90 UK restaurants. The company declined to comment on the details of the potential pre-pack deal."
    },
    {
        "title": "The Voice Of Hind Rajab: Brad Pitt-backed film about death of child in Gaza set for UK release",
        "description": "A film based on the death of a five-year-old girl during Israel's war in Gaza is set to hit UK cinemas this month.",
        "url": "https://news.sky.com/story/the-voice-of-hind-rajab-brad-pitt-backed-film-about-death-of-child-in-gaza-set-for-uk-release-13489718",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-hind-rajab-film-venice_7124529.jpg?20260102145739",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2026-01-02 14:37:00",
        "Headline": "The death of Hind Rajab in January 2024 was investigated by Sky News, which found Israeli tanks were present in the area and likely to have fired at civilians. A new film - backed by Brad Pitt and Joaquin Phoenix - dramatises the story.",
        "Content": "\n          News correspondent\n              @esadiya\n A film based on the death of a five-year-old girl during Israel's war in Gaza is set to hit UK cinemas this month. The January 2024 killing of Hind Rajab shocked the world after her desperate telephone calls with the Palestinian Red Crescent Society (PRCS) emergency services were recorded in real time and made public. Hind and six of her relatives (the Hamada family) had been attempting to escape the fighting in Gaza City when their car came under attack. The Voice Of Hind Rajab, directed by Kaouther Ben Hania, fuses Hind's actual voice with a dramatised performance to tell the story of her desperate cries for help. Set inside the charity's West Bank call centre, the film reconstructs the resolute efforts of Red Crescent workers during a hopeless negotiation with the Israelis over a safe route for the rescue. Over 90 minutes, an avoidable tragedy is played out from the perspective of the call handlers who listen, refuse to abandon hope, and sometimes fight over the rules of sending an ambulance out to a deadly mission. The film invites an audience that already knows how the story ends to feel the long and frustrating wait, and to experience the complex Israeli protocols Palestinians have to live by. What unfolds is an uncomfortable watch as day turns to evening and the child's voice pleads: \"Please don't leave me, I'm afraid of the dark.\" 'The magical power of cinema' Director Kaouther Ben Hania says the film was not about investigating the death. Speaking to Sky News, she said she wanted to let audiences feel what life is like for Palestinians living under Israeli occupation. \"This story was investigated by The Washington Post and Sky News, so in terms of explaining what happened, this was done,\" she said. \"I asked myself what can cinema bring to the table? Cinema has a magical power of empathy - you experience 'otherness', you live the life of others. And I thought, we are done explaining, now let's feel. \"What does it mean to be Palestinian, working in the Red Crescent? Your mission is to save lives, and you have this system making your life impossible.\" PRCS staff kept Hind on the line for hours through multiple calls before an ambulance could finally be dispatched. By 6pm, the ambulance crew were close to the family car, telling dispatchers they had their emergency lights on but no siren. \"Oh, there she is,\" a paramedic said, just before communication ended abruptly with the sound of heavy gunfire. Both paramedics were killed, and all nine bodies were found 12 days later. 'I felt my heart going to explode' Palestinian actor Motaz Malhees plays Omar, the first call handler to take Hind's call. He told Sky News how repeatedly hearing the child's voice during the making of the film took its toll on the cast and crew. \"Thinking about it and hearing her voice begging to be rescued, I was feeling so powerless,\" he said. \"There were some moments I felt I had panic attacks, and during one of the scenes I felt my heart is going to explode.\" Awards buzz and big name backing The film is a contender at this year's Oscars and received a record 23-minute standing ovation at the 2025 Venice Film Festival where it won the Grand Jury Prize. Hollywood elites Brad Pitt and Joaquin Phoenix signed on as executive producers, which Malhees said felt like \"a great honour.\" The Israel Defence Forces (IDF) said it was not in the area on the day of Hind's death, but it made its presence there public, perhaps mistakenly. Twelve days after the attack, on the same day the car and ambulance were found, the IDF published a press release about its activities in Gaza, saying \"over the last two weeks\" it had \"conducted raids on terror targets\" with forces operating in Shati and Tel al Hawa neighbourhoods in Gaza. Tel al Hawa is the same neighbourhood where Hind Rajab, the Hamada family, and the paramedics were killed. The press release was later deleted from the IDF website and a Sky News investigation found a number of Israeli tanks were indeed present and likely to have fired at civilians. The Voice Of Hind Rajab is set for UK and Irish theatrical release on 16 January."
    },
    {
        "title": "Nigel Farage giving 'serious thought' to scrapping OBR if Reform wins next general election",
        "description": "Nigel Farage has said he is giving \"serious thought\" to scrapping the Office for Budget Responsibility (OBR) if his party wins the next general election and he becomes prime minister.",
        "url": "https://news.sky.com/story/nigel-farage-giving-serious-thought-to-scrapping-obr-if-reform-wins-next-general-election-13489799",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigel-farage-press-conference_7124747.jpg?20260102211715",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-02 21:10:00",
        "Headline": "The Reform UK leader said the budget watchdog is \"effectively dictating to elected politicians\". But Labour warned against \"fiscal recklessness\".",
        "Content": "Nigel Farage has said he is giving \"serious thought\" to scrapping the Office for Budget Responsibility (OBR) if his party wins the next general election and he becomes prime minister. The Reform UK leader said the budget watchdog leaves chancellors \"beholden to it rather than doing their own thinking\", and said it is \"effectively dictating to elected politicians\". But Treasury minister James Murray warned against \"fiscal recklessness\" and claimed Mr Farage would \"hammer the British economy with a Liz Truss plan on steroids\". Speaking to The Telegraph newspaper, Mr Farage said: \"I have questioned the need for it. The question we have to ask ourselves is 'is the OBR serving any useful purpose?'\" He added: \"We have to discuss whether we would be better off without the OBR. I am giving that very serious thought.\" He went on: \"With the OBR I worry once again that we have a Blairite-style quango effectively dictating to elected politicians what they should or should not do. \"It seems that in too many areas of our public life the power has moved to judges and quangos and not the government the people choose.\" \n                  Nigel Farage vows to go 'double or quits' with £5m local elections spending blitz\n                 \n                  Too late to investigate Farage election expenses, Essex Police say\n                 \n                  Attempting to rejoin EU customs union 'complete fuel for Reform', Starmer warned\n                 The OBR was created in 2010 by the Conservative-Liberal Democrat coalition government, and it is mandated to produce five-year forecasts for the economy and the public finances. These are published twice yearly, alongside the budget and the spring statement, and factor in any tax and spending decisions announced by the chancellor. However, the watchdog has come under fire in recent years over the accuracy of its forecast, as well as its perceived excessive influence over politicians' decision-making. It also hit the headlines at last year's budget after its forecasts were accessible on its website before the chancellor had delivered her statement in the Commons, resulting in the resignation of its chairman, Richard Hughes. There have also been tensions with the Treasury, and OBR officials had raised concerns with the Treasury about budget leaks spreading \"misconceptions\" about its forecasts. Mr Farage told The Telegraph that the OBR \"distorts policy\", and said: \"Chancellors become beholden to it rather than doing their own thinking. \"Given the economic decline that we're in, we need a government of radicalism. It is difficult to imagine the OBR is capable of radicalism in any way at all.\" Asked who would be responsible for economic forecasts if he were to scrap the watchdog, the Reform UK leader declined to answer. Prior to the OBR's creation, forecasts were produced by the Treasury, which led to accusations the numbers were skewed in favour of the government. Former prime minister Liz Truss declined to get the OBR to analyse her 2022 \"mini-budget\" ahead of its delivery, which is seen as having contributed to the negative market reaction that led to her resignation. In response to Mr Farage's comments, chief secretary to the Treasury Mr Murray said: \"Not content with taking advice from Liz Truss, Nigel Farage is now willing to go further. \"Working people know the price of fiscal recklessness - many are still paying huge sums more on their mortgages than they would have done before Liz Truss crashed the economy. Yet Farage still called it the best Conservative budget since 1986. \"It's time Nigel Farage realised that politics isn't a game. He'd hammer the British economy with a Liz Truss plan on steroids - and it's working people and British businesses who'd be left to foot a very heavy bill.\""
    },
    {
        "title": "Two people die after being pulled from the sea off Yorkshire coast with one still missing",
        "description": "Two people have died amid a major search and rescue operation for people who got into difficulty in the sea off the Yorkshire coast.",
        "url": "https://news.sky.com/story/major-search-for-two-missing-people-in-sea-off-yorkshire-coast-13489773",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dover-kent-coastguard_7015302.jpg?20250909164621",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-02 18:32:00",
        "Headline": "A mass rescue operation has called in ambulance, police, fire and the coastguard in a race to find people who had gone missing in the water near Withernsea.",
        "Content": "Two people have died amid a major search and rescue operation for people who got into difficulty in the sea off the Yorkshire coast. Officials were first alerted to reports of people in trouble near Withernsea at 3.10pm on Friday. A 67-year-old man was found unconscious in the water and later confirmed to have died. Late on Friday evening, Humberside Police said a second body was recovered from the sea and added that \"circumstances are not believed to be suspicious.\" Searches are ongoing, and one person is still thought to be missing. The force asked people to avoid the area to allow the emergency services to carry out their work. HM Coastguard said it had deployed a search and rescue helicopter and a fixed-wing aircraft to the scene on England's east coast. The rescue operation also called in local coastguard and RNLI (Royal National Lifeboat Institution) rescue teams, Yorkshire Ambulance Service, an air ambulance, Humberside Police and Humberside Fire and Rescue. Temperatures in the seaside town are forecast to drop to freezing overnight. Earlier, East Riding of Yorkshire council confirmed a severe weather protocol was in place due to the cold. Read more from Sky News:Snow warnings upgradedMagistrates recruitment drive launched Hornsea Inshore Rescue, a local independent group of volunteers, earlier said the treacherous conditions had stopped it from launching. \"Called out, unable to launch the lifeboat due to horrendous conditions and 3 metre waves breaking on our slipway which would knock the tractor and trailer sideways off the ramp,\" it said in a statement on social media this afternoon. In a post yesterday, the group said it had called off a New Year's Day public swim because \"the sea conditions were just not suitable today for us to condone anyone entering the water\". Yesterday in Brighton a 51-year-old man died after getting into difficulty in the water."
    },
    {
        "title": "Man dies after New Year's Day swim at Brighton beach",
        "description": "A man has died after getting into difficulty at Brighton beach on New Year's Day.",
        "url": "https://news.sky.com/story/man-dies-after-new-years-day-swim-at-brighton-beach-13489690",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brighton-beach_7124536.jpg?20260102151322",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-02 13:40:00",
        "Headline": "The man was pronounced dead at the scene despite the coastguard and RNLI teams intervening. ",
        "Content": "A man has died after getting into difficulty at Brighton beach on New Year's Day. Sussex Police were alerted to a man having been recovered from the sea after getting into difficulty at around 10.35 on the morning of Thursday, 1 January. He had been in the water to the west of Brighton Palace Pier, the force said. The 51-year-old man from Kettering in Northamptonshire was brought to shore and received medical attention, but was pronounced dead at the scene. His next of kin and the coroner have been informed. The death is not being treated as suspicious. A spokesperson from HM Coastguard said it was first alerted to \"an incident involving a male swimmer in difficulty in the water\" at about 10.10am. \n                  Four arrested in Eastbourne and Brighton in right-wing terror investigation\n                 \n                  DNA identifies suspected killer 20 years after Jennifer Kiely found dead on Eastbourne seafront\n                 \n                  Man charged with luggage theft from Gatwick Airport\n                 \"Coastguard rescue teams from Shoreham and Newhaven were sent alongside Brighton RNLI [Royal National Lifeboat Institution] inshore lifeboat.\" It comes after Devon and Cornwall Police over Christmas urged people to avoid coastal swimming after two men, in their 40s and 60s, went missing in the water off a beach in Devon on Christmas morning. The search for them was called off on the evening of Christmas Day."
    },
    {
        "title": "Anthony Joshua's driver charged over Nigeria crash that killed two",
        "description": "The man behind the wheel of a car that crashed into a lorry in Nigeria, killing two passengers and injuring Anthony Joshua has been charged.",
        "url": "https://news.sky.com/story/anthony-joshuas-driver-charged-over-nigeria-crash-that-killed-two-13489745",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-anthony-joshua-boxing_7121430.jpg?20251229143737",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-02 16:31:00",
        "Headline": "Nigerian police have charged Adeniyi Mobolaji Kayode on four counts, including allegedly dangerous driving causing death and driving without a valid national licence.",
        "Content": "The man behind the wheel of a car that crashed into a lorry in Nigeria, killing two passengers and injuring Anthony Joshua has been charged. He is alleged to have been driving recklessly and without a valid national licence. Joshua, a two-time world champion boxer, was travelling in the back of a black SUV when it struck a stationary truck on a major road near Lagos on Monday, killing his friends Latif Ayodele and Sina Ghami. Ghami was Joshua's strength and conditioning coach, while Ayodele was a trainer and described as being like a \"twin brother\" to Joshua. Hours before the accident, Joshua and Ayodele posted clips on social media showing them playing table tennis together. The Ogun State Police Command on Friday confirmed that the driver of the Lexus SUV, Adeniyi Mobolaji Kayode, had been charged on four counts. Kayode was charged with dangerous driving causing death, reckless and negligent driving, driving without due care and attention and driving without a valid national driver's licence. \n                  Anthony Joshua pays respects to friends killed in road crash\n                 \n                  Anthony Joshua's friend describes 'crazy nightmare' after Nigeria car crash\n                 \n                  Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says\n                 The 46-year-old appeared at the Sagamu Magistrate Court, and the case has been adjourned to 20 January for trial. On Wednesday local authorities confirmed Joshua, who is British-Nigerian, had been discharged from the hospital and was recuperating at his home in Nigeria. The 36-year-old boxer and his mother had been \"at the funeral home in Lagos this afternoon to pay their final respects to his two departed friends\", Lagos state commissioner for information, Gbenga Omotoso, said on social media on Wednesday."
    },
    {
        "title": "Starmer accused of diverting NHS 'billions' to appease Trump",
        "description": "Sir Keir Starmer has been accused of diverting &#163;3 billion of NHS funding a year to appease Donald Trump.",
        "url": "https://news.sky.com/story/starmer-accused-of-diverting-nhs-billions-to-appease-trump-13489684",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lib-dems-daisy-cooper_7124469.jpg?20260102133558",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-02 13:31:00",
        "Headline": "Lib Dems critical of deal that means UK pays 25% more for new medicines but stops US imposing trade tariffs on drugs.",
        "Content": "Sir Keir Starmer has been accused of diverting £3 billion of NHS funding a year to appease Donald Trump. Daisy Cooper, the Liberal Democrat deputy leader, said taxpayers' money was being \"rerouted at the request of Donald Trump\" from frontline NHS services \"into the pockets of big pharmaceutical companies\". At the beginning of December, the UK agreed to pay 25% more for new medicines by 2035 to stop the US imposing trade tariffs on pharmaceutical products. The deal involves an increase in the baseline threshold used to assess whether medicines can be offered by the NHS. The National Institute for Health and Care Excellence (NICE) will increase the threshold by 25%: from £20,000-£30,000 to £25,000-£35,000. The government says this means NICE will be able to approve innovative medicines that deliver significant health improvements but might have previously been declined on cost-effectiveness grounds. It has suggested the deal will cost around £1bn a year by 2029. Others, including the Lancet medical journal, have said the cost to the NHS will be £3bn. Exact costs will depend on how many medicines are approved under the new system. \n                  Trump issues warning as National Guard troops withdrawn from US cities\n                 \n                  2026 preview: The most consequential year in modern American history?\n                 \n                  A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?\n                 Ms Cooper said it was \"outrageous\" the agreement was made without any public debate or parliamentary scrutiny - \"just a decision by the Labour prime minister, Keir Starmer\". She called on Sir Keir to \"scrap this £3bn Trump tax\" and instead invest it in social care. \"There is no doubt at all that this money will not bring lots of new drugs to our NHS,\" she said. \"Independent experts suggest it could just be three or four, possibly five at most. \"What this money will do is simply increase the amount of money that we will pay for the existing drugs that we use, and it will be rerouted from frontline services... \"That is why our message is clear: Scrap this £3bn 'Trump tax' and fix social care now.\" When the US-UK drug pricing deal was announced, NHS leaders backed the government's assessment that it would lead to tens of thousands of patients receiving groundbreaking new drugs. However, they warned the NHS receives too little funding to absorb the costs and said care, services and treatment budgets must not be raided. Read more:2025 second-highest year for small boat crossingsWorkers being 'hammered' while pensioners benefit Whitehall sources claimed the hike in drug prices will not be paid for out of budgets for NHS services but from hundreds of millions of pounds given to the NHS last year to cover the costs of the deal in its early years. Science Secretary Liz Kendall said the deal would \"enable and incentivise life sciences companies to continue to invest and innovate right here in the UK\". But Ms Cooper said the government needs to be \"standing strong\" against Mr Trump as he only understands \"the language of strength\". And she accused the government of being \"all spin and no substance\" as she said it has held only one meeting on social care after promising to launch cross-party talks to fix social care a year ago. Sky News has contacted the government for a comment."
    },
    {
        "title": "Swiss bar fire: Likely cause of resort blaze identified - as teen educated in UK named among missing",
        "description": "Sparklers on champagne bottles have been identified by officials as the likely cause of a deadly fire at a Swiss ski resort, as pictures of teenagers still unaccounted for began to emerge.",
        "url": "https://news.sky.com/story/swiss-bar-fire-likely-cause-of-resort-blaze-identified-as-teen-educated-in-uk-named-among-missing-13489737",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-swiss-bar-fire-switzerland_7124818.jpg?20260102234433",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-02 15:55:00",
        "Headline": "The identities of some young people caught in the bar blaze have been revealed. But the severity of burns mean it could take weeks for all victims to be identified. Authorities have now named the likely cause of the fire, but investigations are ongoing.",
        "Content": "Sparklers on champagne bottles have been identified by officials as the likely cause of a deadly fire at a Swiss ski resort, as pictures of teenagers still unaccounted for began to emerge. At least 40 were killed and a further 119 were injured in the blaze that swept through the Constellation bar in Crans-Montana in the early hours of New Year's Day. Read more: Everything we know about ski resort fire A former Hertfordshire schoolgirl is among the teenagers still missing. The severity of burns is making it harder to identify the dead and injured. Experts are relying on DNA samples for some cases, in a process that could take weeks. Scrutiny turns to safety set-up and fire's cause On Friday officials tentatively confirmed a theory circulating online about the cause of the fire. \"It would appear that the fire started from sparkler candles, otherwise known as flares, which were placed on top of champagne bottles,\" Valais attorney general Beatrice Pilloud told a news conference. Images shared on social media showed a group of people with sparklers affixed to bottles that appear to be setting fire to the ceiling, and a woman on a man's shoulders holding up champagne bottles with sparklers in them. But Ms Pilloud said it was too soon to say whether a foam-like material on the ceiling, possibly sound-proofing, had contributed to the spread of the fire. A retired fire firefighter told Sky News the same type of material used to clad Grenfell Tower was likely coating the ceiling of the basement bar. Having reviewed images and videos circulating online, Steve Dudney said he believed the foam that ignited was highly flammable polyurethane, which should be \"nowhere where there are uncontrolled naked flames\". Ms Pilloud said the bar's owners, Jacques and Jessica Moretti, a French couple, were interviewed as \"people called to give information\", not under caution. There are many outstanding questions about the nature of exits and about safety protocols in the bar. It had more than one emergency exit, but it wasn't found by victims. Agonising wait for families The severity of the damage means details about the victims have emerged in instalments, leaving relatives in a painstaking limbo. Some 22 young patients are in critical condition at Lausanne University Hospital. The injured included 71 from Switzerland, 14 French nationals and 11 Italians, along with citizens of Serbia, Bosnia-Herzegovina, Luxembourg, Belgium, Portugal and Poland, according to Frederic Gisler, police commander of the Valais region. The nationalities of 14 people were unclear. Read more from Sky News:Snow warnings upgradedMagistrates recruitment drive launched Who has been named so far? Those still unaccounted for include Charlotte Niddam, who previously attended Immanuel College, a private school in Hertfordshire. Her nationality has not been confirmed. According to the Crans-Montana resort website, she had been working as a babysitter in the area. Italian national Emanuele Galeppini, 17 and a golf prodigy, was the first victim to be reported dead, with news confirmed by the Italian Golf Federation earlier on Friday. Another teenager who is still missing is Arthur Brodard. CNN reported that the Swiss 16-year-old joined around 10 of his friends on New Year's Eve at Le Constellation. His parents Laetitia Brodard and her husband Christophe, who are from the Swiss city of Lausanne, said the group often met in the resort town. \"We are so empty,\" Mr Brodard said. \"We think he could still be alive, so we still have hope of finding him.\" He added: \"They ordered a bottle of champagne with a sparkler. One or two minutes later, it was the apocalypse.\" Alice Kallergis, a 15-year-old girl from Greece, is also reportedly missing. Her brother, Romain, told protothema.gr: \"We still know nothing about my sister.\" The family of another young person has appealed for information. Emilie Pralong has been missing since the fire, according to posts on Facebook."
    },
    {
        "title": "US 'locked and loaded' Trump warns Iran, as he pledges to rescue protesters",
        "description": "US President Donald Trump has threatened to intervene in Iran's cost-of-living protests, provoking a warning that he could destabilise the entire region. ",
        "url": "https://news.sky.com/story/us-locked-and-loaded-trump-warns-iran-as-he-pledges-to-rescue-protesters-13489621",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran-grand-bazaar_7123708.jpg?20260101151714",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-02 10:37:00",
        "Headline": "The Islamic republic faces its largest demonstrations in more than three years the currency plunges and people chant against the regime.",
        "Content": "US President Donald Trump has threatened to intervene in Iran's cost-of-living protests, provoking a warning that he could destabilise the entire region.  In a post on his social media platform, Truth Social, on Friday, Mr Trump wrote: \"If Iran shoots [sic] and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue.\" \"We are locked and loaded and ready to go.\" At least seven people have been reported to have been killed in violence during protests sweeping parts of Iran, including capital Tehran. They have been sparked in part by the collapse of country's rial currency. In response to Mr Trump's post, the secretary of Iran's Supreme National Security Council, Ali ⁠Larijani, wrote on X: \"Trump should know that U.S. interference in this internal matter would mean destabilising the entire region and destroying America's interests. \"The American people should know - Trump started this adventurism. They should be mindful of their soldiers' safety.\" America has a large wide military footprint in the region and tensions had already been rising with Iran. In June the Islamic republic attacked the US Al Udeid Air Base in Qatar. \n                  Several people killed in Iran as cost-of-living protests turn deadly\n                 \n                  Iranian protesters attempt to break in to government building\n                 \n                  Iranian university students join protests over soaring cost of living\n                 The missile launches were a retaliation for US strikes on three nuclear sites during Israel's 12-day war on the Islamic Republic, also in June. Protests in the Iran have now reached their sixth day, making them the biggest since 2022, when the death of 22-year-old Mahsa Amini in police custody triggered nationwide demonstrations. But the protests have yet to go countrywide and have not been as intense as those surrounding the death of Ms Amini, who was detained for not wearing her headscarf to the liking of authorities. Read more:What we know about deadly New Year's fire at Swiss ski resortNew York's new mayor 'won't hesitate' to use his power The latest demonstrations were initially triggered by economic concerns, but have included chants against Iran's theocracy. Iran's civilian government led by reformist President Masoud Pezeshkian has been trying to signal it wants to negotiate with protesters. But Mr Pezeshkian has acknowledged there is little he can do as the currency rapidly depreciates, with one dollar now costing some 1.4 million rials, pushing up domestic prices."
    },
    {
        "title": "Russian winemakers think they're ready to join the elite - our taste test says otherwise",
        "description": "You've probably never had a glass of Russian sparkling wine before. Perhaps you never even knew such a thing existed. If that's the case, Mikhail Nikolaev believes you're missing out.",
        "url": "https://news.sky.com/story/russian-winemakers-think-theyre-ready-to-join-the-elite-our-taste-test-says-otherwise-13489675",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-mikhail-nikolaev-bennett_7124462.jpg?20260102133100",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2026-01-02 13:08:00",
        "Headline": "With sanctions preventing the importing of Western wines, Russian winemakers have been striving to up their game and produce vintages that match those from France or other grape-growing regions. But what do drinkers think?",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n You've probably never had a glass of Russian sparkling wine before. Perhaps you never even knew such a thing existed. If that's the case, Mikhail Nikolaev believes you're missing out. He's one of the sons in Nikolaev & Sons, a wine producer in Russia's Krasnodar region, near the Black Sea. \"If you're looking for a kind-of-like Champagne that is not made in Champagne, you have, obviously, the British options, you have Northern Italy, and you have us,\" he tells me, across a table inside the vineyard's stylish restaurant. His father started the business two decades ago. Standing outside the Tuscan-style visitor complex that is now at the centre of it, I can see hills all around me carpeted in rows of grapevines. They specialise in sparkling wine, from Chardonnay and Pinot Noir varieties, and follow the traditional method of production, which involves ageing the wine on dead yeast cells, known as \"lees\". Big ambition Champagne and a lot of English fizz is made in the same way, hence Mikhail's comparison. \"I know it's going to sound maybe a little pretentious, but climatically, we have the potential to be within the top sparkling regions of the world,\" he says confidently. International recognition will have to wait for now, though. Russia's invasion of Ukraine has put paid to that, with sanctions cutting off Western export markets. But while conflict has constrained growth abroad, it's had the opposite effect at home, where sanctions have forced Russians to buy more domestic vintages to quench their thirst. Nikolaev & Sons currently produces 60,000 bottles of sparkling wine a year but plans to double that by 2032 to meet the ripening demand. \"Right now is the moment where we can potentially grow considerably,\" Mikhail says. \"I think that there's not really some sort of cap.\" Patriotic push Ten years ago, local wines made up a quarter of the Russian market, but now they account for nearly two-thirds of all sales, after sanctions reduced the availability of foreign wines and made them a lot more expensive. The Kremlin has also engaged in a patriotic push of local produce, to help offset the economic impact of sanctions. You can see it on the supermarket shelves, where Russian wines now dominate and are heavily promoted. But are they actually any good? If sanctions were lifted, would European imports reclaim their top spot? How do the two compare? \"If we are talking about mass market wines, there is no difference,\" Denis Rudenko, a member of the Russian Sommelier Society, tells me. He's been a sommelier for 25 years and has followed the local wine industry's transformation. Russia doesn't have many \"collectables\" yet, but he believes it might within the next two decades. That's the theory, at least. Time to put it to the test... At an upmarket wine bar in Moscow, we've set up a blind tasting - a Russian Riesling (wine number one) versus a German Riesling (wine number two). Which one do punters prefer? \"The second one,\" replies our first volunteer, unsure why. Another sip…\"It's lighter,\" she says. Her choice is matched by a man on the next table, but for different reasons. \"The second one has more nuanced flavours,\" he says after careful deliberation. \"The first is more acidic.\" One more table over, and it's the same again. \"I like how the first one smells,\" a blonde-haired woman says, \"but I prefer how the second one tastes, it's softer.\" So, a win for the Western wine. Three-nil. Wine patriotism only goes so far, it seems."
    },
    {
        "title": "Anthony Joshua's driver charged over Nigeria crash that killed two",
        "description": "The man behind the wheel of a car that crashed into a lorry in Nigeria, killing two passengers and injuring Anthony Joshua has been charged.",
        "url": "https://news.sky.com/story/anthony-joshuas-driver-charged-over-nigeria-crash-that-killed-two-13489745",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-anthony-joshua-boxing_7121430.jpg?20251229143737",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-02 16:31:00",
        "Headline": "Nigerian police have charged Adeniyi Mobolaji Kayode on four counts, including allegedly dangerous driving causing death and driving without a valid national licence.",
        "Content": "The man behind the wheel of a car that crashed into a lorry in Nigeria, killing two passengers and injuring Anthony Joshua has been charged. He is alleged to have been driving recklessly and without a valid national licence. Joshua, a two-time world champion boxer, was travelling in the back of a black SUV when it struck a stationary truck on a major road near Lagos on Monday, killing his friends Latif Ayodele and Sina Ghami. Ghami was Joshua's strength and conditioning coach, while Ayodele was a trainer and described as being like a \"twin brother\" to Joshua. Hours before the accident, Joshua and Ayodele posted clips on social media showing them playing table tennis together. The Ogun State Police Command on Friday confirmed that the driver of the Lexus SUV, Adeniyi Mobolaji Kayode, had been charged on four counts. Kayode was charged with dangerous driving causing death, reckless and negligent driving, driving without due care and attention and driving without a valid national driver's licence. \n                  Anthony Joshua pays respects to friends killed in road crash\n                 \n                  Anthony Joshua's friend describes 'crazy nightmare' after Nigeria car crash\n                 \n                  Anthony Joshua was 'shocked' and 'couldn't talk' after crash, eyewitness says\n                 The 46-year-old appeared at the Sagamu Magistrate Court, and the case has been adjourned to 20 January for trial. On Wednesday local authorities confirmed Joshua, who is British-Nigerian, had been discharged from the hospital and was recuperating at his home in Nigeria. The 36-year-old boxer and his mother had been \"at the funeral home in Lagos this afternoon to pay their final respects to his two departed friends\", Lagos state commissioner for information, Gbenga Omotoso, said on social media on Wednesday."
    },
    {
        "title": "How indoor fireworks keep causing deadly nightclub infernos ",
        "description": "The death of at least 40 people in a New Year's Eve fire in a Swiss ski resort has once again highlighted the dangers of igniting indoor fireworks in bars and nightclubs. ",
        "url": "https://news.sky.com/story/how-indoor-fireworks-keep-causing-deadly-nightclub-infernos-13489664",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-crans-montana-switzerland_7124588.jpg?20260102162915",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-02 12:45:00",
        "Headline": "Swiss officials think sparklers were the likely cause of a New Year's Eve tragedy, making it the latest in a long line of bar blazes where fireworks have been blamed. ",
        "Content": "The death of at least 40 people in a New Year's Eve fire in a Swiss ski resort has once again highlighted the dangers of igniting indoor fireworks in bars and nightclubs.  As emergency services work to identify everyone killed and injured in the blaze at Le Constellation bar in Crans-Montana, officials revealed more details about what happened at a press conference on Friday afternoon. \"It would appear that the fire started from sparkler candles, otherwise known as flares, which were placed on top of champagne bottles,\" local attorney general Beatrice Pilloud said. \"These flares were taken too close to the ceiling. This led to what is referred to as a flashover incident, where the fire spread very rapidly.\" Follow latest: Former pupil at UK school missing after blaze Ms Pilloud said an investigation will look into whether a type of foam on the bar's ceiling contributed to the spread of the fire. Fires in nightclubs, which can often be cramped, dark spaces, have claimed lives around the world over the years - and fireworks are often to blame. Here are some recent examples. December 2025: Nightclub fire in Goa, India Last month 25 people were killed when a fire ripped through a nightclub in Goa, India. The incident happened a venue in Arpora village, a party hub in North Goa. Goa's chief minister Pramod Sawant said the inferno broke out after electrical firecrackers were set off inside the club. India's Prime Minister Narendra Modi said the deadly fire was \"deeply saddening\". Read more:Everything we know about Swiss ski resort firePartygoer seen trying to tackle flames March 2025: Deaths in blaze and stampede in North Macedonia Earlier last year, 63 people were killed at the crowded Pulse club in Kocani, North Macedonia. Most of the dead were young revellers and more than 200 were injured. The fire was set off by a pyrotechnic flame that engulfed the roof of the club while local band DNK was performing. Hundreds of people scrambled for the small venue's single exit, causing a stampede. January 2022: 17 killed in Cameroon blaze A fire at Liv's Nightclub Yaouba in Cameroon's capital, Yaounde, set off explosions that killed 17 people. The government suggested that fireworks set the roof alight and the fire then spread to areas where cooking gas was stored. Workers at the club had initially said the fire was caused by a short circuit. October 2015: The fire that brought down a prime minister A fire during a rock concert at the Colectiv nightclub in Bucharest claimed 64 lives and left some 190 people injured. Fireworks set insulation foam ablaze and there was a stampede towards the only exit, trapping many of the 400 people inside. Tens of thousands of people subsequently took to the streets across Romania to express their anger at the government, which many regarded as corrupt. Prime Minister Victor Ponta and his cabinet subsequently resigned. January 2013: More than 200 people killed in Brazil A blaze at the Kiss nightclub in the Brazilian city of Santa Maria caused the deaths of more than 200 people. The fire started when the band playing in the crowded, windowless club lit a flare which in turn ignited flammable soundproofing foam on the ceiling. Poisonous gases were released that quickly killed those attending a university party. February 2003: Fireworks in US club lead to blaze that kills 100  A fire at the Station nightclub in West Warwick, Rhode Island, in the United States, killed 100 people and injured more than 200 others. Fireworks being used by the band set fire to flammable foam inside the club. Technology correspondent One apparently universal truth of fires is that people will try and leave the way they’ve come, even if other exits are available.  In 2003, a fire started at a nightclub in Rhode Island called The Station which – just as in Crans-Montana – spread to flammable material in the walls and ceilings. One fact which emerged later: although there were four possible exits, most people fled for the door through which they had entered, causing a crush which increased the final death toll.   It’s not clear how much difference these insights would have made in the basement at Le Constellation. The fire spread very quickly. But local officials have confirmed that although there was more than one exit, most people headed back the way they’d came.   Fire safety expert Steve Dudeney says the only solution is to have trained staff basically push people towards the exits. \"You have to show people what to do,\" he says."
    },
    {
        "title": "'The State of South Arabia': Yemen separatists announce plan for independence",
        "description": "Yemen's southern separatist movement has announced a constitution and aims to hold a referendum on independence from the north.",
        "url": "https://news.sky.com/story/the-state-of-south-arabia-yemen-separatists-announce-plan-for-independence-13489815",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-yemen-stc-aden_7124821.jpg?20260102235901",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-02 22:54:00",
        "Headline": "Saudi Arabia, the United Arab Emirates and their allies in Yemen have all been part of a coalition fighting Iranian-backed Houthi rebels in the north - but growing tensions between the factions and the two Gulf nations appear to be unravelling the coalition.",
        "Content": "Yemen's southern separatist movement has announced a constitution and aims to hold a referendum on independence from the north. It is not immediately clear if the move by the Southern Transitional Council (STC), backed by the United Arab Emirates (UAE), could be implemented or was largely symbolic. But it is an escalation of a confrontation that has pitted Saudi Arabia, which supports Yemen's internationally recognised government, and the UAE against each other. The UAE announced it was pulling its troops out of Yemen shortly after the separatists' statement. Last month, STC-linked fighters seized control of two southern provinces from Saudi-backed forces and took over the presidential palace in the south's main city, Aden, forcing the government there to flee to the Saudi capital, Riyadh. On Friday, Saudi warplanes bombed camps and military positions held by the STC in Hadramout province as Saudi-backed fighters tried to seize the facilities, a separatist official said. It was the latest intervention by Saudi Arabia, which in recent weeks has bombed STC forces and struck what it said was a shipment of Emirati weapons destined for the separatists. Saudi Arabia, the UAE, and their allies in Yemen have all been part of a Saudi-led coalition fighting Iranian-backed Houthi rebels who control the north. The decade-long civil war has devastated the Arab world's poorest country. The coalition's goal is to restore the internationally recognised government, which was driven out of the north by the Houthis. But tensions between the factions and the two Gulf nations appear to be unravelling the coalition. 'The right to self-determination' The head of the STC, Aidarous al Zoubeidi, issued a video statement on Friday saying the constitution would be in effect for two years, after which a referendum would be held on \"exercising the right to self-determination for the people of the South\". Read more from Sky News:Israel's deadly strikes on YemenHouthi rebels raid UN sitesHouthi drone attack on Israel During those two years, he said, the \"relevant parties\" in north and south Yemen should hold a dialogue on \"a path and mechanisms that guarantee the right of the people of the South\". The 30-article constitution describes the creation of \"the State of South Arabia\", covering the same territory as the former People's Democratic Republic of Yemen, the independent southern state that existed from 1967 to 1990. It was not clear what practical impact it would have. But the declaration could set back efforts to avert an outright conflict between the separatists and the rest of the Saudi-led coalition. The UAE's foreign ministry said in a statement that the country was dealing with the situation \"with restraint, coordination, and a deliberate commitment to de-escalation, guided by a foreign policy that consistently prioritises regional stability over impulsive action\". In a post on X, the Saudi ambassador to Yemen, Mohammed al-Jaber, said the kingdom had tried \"all efforts with STC\" for weeks \"to stop the escalation\" and urge the separatists to leave Hadramout and Mahra, but faced \"continued intransigence and rejection from Aidarous al Zoubeidi\"."
    },
    {
        "title": "Tesla loses title of world's biggest electric vehicle maker to Chinese rival BYD",
        "description": "Tesla has lost its crown as the world's bestselling electric vehicle maker.",
        "url": "https://news.sky.com/story/tesla-loses-title-of-worlds-biggest-electric-vehicle-maker-to-chinese-rival-byd-13489720",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tesla-elon-musk_7124528.jpg?20260102145623",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-02 14:46:00",
        "Headline": "The US firm faced a difficult year with unease over chief executive Elon Musk’s political activities and stiff overseas competition.",
        "Content": "Tesla has lost its crown as the world's bestselling electric vehicle maker. The US firm faced a difficult year with unease over chief executive Elon Musk's political activities and stiff overseas competition that pushed sales down for a second year in a row. Tesla said that it delivered 1.64 million vehicles in 2025, a decrease of 9% from a year earlier. Chinese rival BYD, which sold 2.26 million vehicles last year, is now the biggest EV maker. Tesla sales totalled 418,227 between October and December, falling short of the 440,000 that analysts polled by FactSet expected. The sales total may have been hit by the end of a $7,500 (£5,500) tax credit phased out by the Trump administration at the end of September. Despite this Tesla stock finished 2025 with a gain of approximately 11%. Investors hope Musk can deliver on his ambitions to make the company a leader in robotaxi services and get consumers to embrace humanoid robots that can perform basic tasks in homes and offices. \n                  Why Trump administration is so annoyed with Europe's online rules\n                 \n                  Elon Musk closer to becoming first-ever trillionaire as he marks major milestone\n                 \n                  The year America changed - 2025 in review\n                 Shares of Tesla rose almost 2% before the opening bell on Friday, with stock mostly unchanged at $450.27 in early trading. Read more:Musk's $1trn pay package approved by TeslaTesla looks to cheaper model amid sales slump The latest quarter was the first with sales of stripped-down versions of the Model Y and Model 3 that Musk unveiled in early October as part of an effort to revive sales. The new Model Y costs just under $40,000 (£30,000) while customers can buy the cheaper Model 3 for under $37,000 (£27,000). The new versions are aimed at helping Tesla to compete with Chinese models in Europe and Asia. For fourth-quarter earnings coming out in late January, analysts are expecting the company to post a 3% decrease in sales and a nearly 40% drop in earnings per share, according to FactSet. Analysts expect the downward trend in sales and profits to eventually reverse itself further into 2026. In November, Musk won a shareholder vote that will see him net a $1trn (£742bn) pay package if the firm meets a series of extremely ambitious performance targets over the next 10 years. Already the world's richest man, he scored another huge windfall last month when the Delaware Supreme Court reversed a decision that deprived him of a $550bn (£408bn) pay package that Tesla gave him in 2018."
    },
    {
        "title": "Starmer accused of diverting NHS 'billions' to appease Trump",
        "description": "Sir Keir Starmer has been accused of diverting &#163;3 billion of NHS funding a year to appease Donald Trump.",
        "url": "https://news.sky.com/story/starmer-accused-of-diverting-nhs-billions-to-appease-trump-13489684",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lib-dems-daisy-cooper_7124469.jpg?20260102133558",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-02 13:31:00",
        "Headline": "Lib Dems critical of deal that means UK pays 25% more for new medicines but stops US imposing trade tariffs on drugs.",
        "Content": "Sir Keir Starmer has been accused of diverting £3 billion of NHS funding a year to appease Donald Trump. Daisy Cooper, the Liberal Democrat deputy leader, said taxpayers' money was being \"rerouted at the request of Donald Trump\" from frontline NHS services \"into the pockets of big pharmaceutical companies\". At the beginning of December, the UK agreed to pay 25% more for new medicines by 2035 to stop the US imposing trade tariffs on pharmaceutical products. The deal involves an increase in the baseline threshold used to assess whether medicines can be offered by the NHS. The National Institute for Health and Care Excellence (NICE) will increase the threshold by 25%: from £20,000-£30,000 to £25,000-£35,000. The government says this means NICE will be able to approve innovative medicines that deliver significant health improvements but might have previously been declined on cost-effectiveness grounds. It has suggested the deal will cost around £1bn a year by 2029. Others, including the Lancet medical journal, have said the cost to the NHS will be £3bn. Exact costs will depend on how many medicines are approved under the new system. \n                  Trump issues warning as National Guard troops withdrawn from US cities\n                 \n                  2026 preview: The most consequential year in modern American history?\n                 \n                  A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?\n                 Ms Cooper said it was \"outrageous\" the agreement was made without any public debate or parliamentary scrutiny - \"just a decision by the Labour prime minister, Keir Starmer\". She called on Sir Keir to \"scrap this £3bn Trump tax\" and instead invest it in social care. \"There is no doubt at all that this money will not bring lots of new drugs to our NHS,\" she said. \"Independent experts suggest it could just be three or four, possibly five at most. \"What this money will do is simply increase the amount of money that we will pay for the existing drugs that we use, and it will be rerouted from frontline services... \"That is why our message is clear: Scrap this £3bn 'Trump tax' and fix social care now.\" When the US-UK drug pricing deal was announced, NHS leaders backed the government's assessment that it would lead to tens of thousands of patients receiving groundbreaking new drugs. However, they warned the NHS receives too little funding to absorb the costs and said care, services and treatment budgets must not be raided. Read more:2025 second-highest year for small boat crossingsWorkers being 'hammered' while pensioners benefit Whitehall sources claimed the hike in drug prices will not be paid for out of budgets for NHS services but from hundreds of millions of pounds given to the NHS last year to cover the costs of the deal in its early years. Science Secretary Liz Kendall said the deal would \"enable and incentivise life sciences companies to continue to invest and innovate right here in the UK\". But Ms Cooper said the government needs to be \"standing strong\" against Mr Trump as he only understands \"the language of strength\". And she accused the government of being \"all spin and no substance\" as she said it has held only one meeting on social care after promising to launch cross-party talks to fix social care a year ago. Sky News has contacted the government for a comment."
    },
    {
        "title": "US 'locked and loaded' Trump warns Iran, as he pledges to rescue protesters",
        "description": "US President Donald Trump has threatened to intervene in Iran's cost-of-living protests, provoking a warning that he could destabilise the entire region. ",
        "url": "https://news.sky.com/story/us-locked-and-loaded-trump-warns-iran-as-he-pledges-to-rescue-protesters-13489621",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-tehran-grand-bazaar_7123708.jpg?20260101151714",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-02 10:37:00",
        "Headline": "The Islamic republic faces its largest demonstrations in more than three years the currency plunges and people chant against the regime.",
        "Content": "US President Donald Trump has threatened to intervene in Iran's cost-of-living protests, provoking a warning that he could destabilise the entire region.  In a post on his social media platform, Truth Social, on Friday, Mr Trump wrote: \"If Iran shoots [sic] and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue.\" \"We are locked and loaded and ready to go.\" At least seven people have been reported to have been killed in violence during protests sweeping parts of Iran, including capital Tehran. They have been sparked in part by the collapse of country's rial currency. In response to Mr Trump's post, the secretary of Iran's Supreme National Security Council, Ali ⁠Larijani, wrote on X: \"Trump should know that U.S. interference in this internal matter would mean destabilising the entire region and destroying America's interests. \"The American people should know - Trump started this adventurism. They should be mindful of their soldiers' safety.\" America has a large wide military footprint in the region and tensions had already been rising with Iran. In June the Islamic republic attacked the US Al Udeid Air Base in Qatar. \n                  Several people killed in Iran as cost-of-living protests turn deadly\n                 \n                  Iranian protesters attempt to break in to government building\n                 \n                  Iranian university students join protests over soaring cost of living\n                 The missile launches were a retaliation for US strikes on three nuclear sites during Israel's 12-day war on the Islamic Republic, also in June. Protests in the Iran have now reached their sixth day, making them the biggest since 2022, when the death of 22-year-old Mahsa Amini in police custody triggered nationwide demonstrations. But the protests have yet to go countrywide and have not been as intense as those surrounding the death of Ms Amini, who was detained for not wearing her headscarf to the liking of authorities. Read more:What we know about deadly New Year's fire at Swiss ski resortNew York's new mayor 'won't hesitate' to use his power The latest demonstrations were initially triggered by economic concerns, but have included chants against Iran's theocracy. Iran's civilian government led by reformist President Masoud Pezeshkian has been trying to signal it wants to negotiate with protesters. But Mr Pezeshkian has acknowledged there is little he can do as the currency rapidly depreciates, with one dollar now costing some 1.4 million rials, pushing up domestic prices."
    },
    {
        "title": "Hundreds of jobs to be lost in TGI Fridays insolvency plan",
        "description": "Hundreds of British hospitality workers face losing their jobs in the coming days as the owner of TGI Fridays finalises plans to buy back a slimmed-down version of one of Britain's best-known casual dining chains.",
        "url": "https://news.sky.com/story/hundreds-of-jobs-to-be-lost-in-tgi-fridays-insolvency-plan-13489776",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-swaminarayan-leicester-square_7067973.jpg?20251031151744",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-02 18:49:00",
        "Headline": "The new owner of one of the UK’s most prominent restaurant chains is finalising plans for a pre-pack administration which will involve site closures and job cuts, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Hundreds of British hospitality workers face losing their jobs in the coming days as the owner of TGI Fridays finalises plans to buy back a slimmed-down version of one of Britain's best-known casual dining chains. Sky News has learnt that Sugarloaf TGIF Management, which only took control of TGI Fridays two months ago, is preparing to implement a pre-pack administration of the business in a deal which is expected to take place next week. Insiders said a transaction was expected to involve the closure of a significant proportion of the estate's 49 restaurants. One suggested that between 15 and 20 of the sites could be permanently axed, although the final number is still being worked on and has yet to be determined. They cautioned that a deal could yet be delayed beyond next week. A pre-pack insolvency involves a buyer being lined up for a company or its assets without its financial liabilities, immediately after the appointment of administrators takes place. If the pre-pack scenario and site closure plan does materialise, it would inevitably mean hundreds of TGI Fridays' nearly 2,000-strong workforce in the UK being made redundant. \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  Former TGI Fridays chief in move to snap up UK chain \n                 \n                  Private equity backers call time on bar chain The Alchemist\n                 Interpath Advisory has been lined up to handle the pre-pack administration, with two notices of intention to appoint the firm having been filed in the run-up to Christmas. A company spokesperson told Sky News on Friday: \"TGI Fridays UK is still assessing all options for the future of the business. \"No decisions have been made yet and locations continue to operate as usual.\" The crisis at TGI Fridays represents another blow to the hospitality sector, with bosses complaining bitterly about the impact of national insurance and other tax hits in chancellor Rachel Reeves's Budgets in 2024 and 2025. Read more from Sky News:Starmer accused of diverting NHS 'billions' to appease TrumpAnthony Joshua's driver charged over deadly Nigeria crash The chain was put up for sale in November, just a few weeks after Sugarloaf TGIF Management, a company run by the chain's former chief executive, Ray Blanchette, bought it. Under Breal and Calveton, its previous owners, the performance of the business was said to have stabilised. They had acquired the chain from London-listed Hostmore, under the ownership of which a previous insolvency filing had taken place in 2024. At that point, TGI Fridays traded from close to 90 UK restaurants. The company declined to comment on the details of the potential pre-pack deal."
    },
    {
        "title": "Next weighs cut-price swoop on struggling fashion brand LK Bennett",
        "description": "Next, the FTSE-100 retail behemoth, is among a pack of suitors considering a new year swoop to buy LK Bennett, the struggling fashion retailer.",
        "url": "https://news.sky.com/story/next-weighs-cut-price-swoop-on-struggling-fashion-brand-lk-bennett-13489791",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-istock-money_7115638.jpg?20251220080451",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-02 20:28:00",
        "Headline": "The FTSE-100 retailer is among the parties considering buying one of the Princess of Wales's favourite fashion retailers as it teeters on the brink of collapse, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Next, the FTSE-100 retail behemoth, is among a pack of suitors considering a new year swoop to buy LK Bennett, the struggling fashion retailer. Sky News has learnt that Next is weighing a cut-price offer to buy LK Bennett's brand and other intellectual property assets as it prepares to call in administrators. Retail industry sources said that Next was unlikely to pursue any offer involving LK Bennett's small estate of retail outlets. Marks & Spencer and TFG London, the group which owns Phase Eight, White Stuff and Hobbs, were also among the parties tipped by analysts as contenders to consider an acquisition of the ailing brand. An offer from Next would mirror its strategy of acquiring distressed retailers in recent years. It has bought brands such as Cath Kidston, Joules and Seraphine, the maternitywear retailer, while it is currently examining the purchase of family-owned footwear retailer Russell & Bromley. LK Bennett filed a notice of intention to appoint administrators earlier this week, ten days after Sky News revealed that the company faced collapse as it urgently sought a buyer. \n                  Hundreds of jobs to be lost in TGI Fridays insolvency plan\n                 \n                  FTSE 100 breaks 'historic' 10,000 points mark for the first time in 'best present chancellor could want'\n                 \n                  Major FTSE record as much about companies not in the index as the ones that are\n                 Founded by Linda Bennett in 1990, LK Bennett has been working with advisers at Alvarez & Marsal (A&M) in recent weeks. At one stage, LK Bennett was among the most recognisable brands on the high street, expanding to 200 branded outlets in the UK and overseas markets including China, Russia and the US. In its home market it now trades from just nine standalone stores, with a further 13 listed as concessions on its website. The brand is currently owned by Byland UK, a company established in 2019 for the purpose of rescuing LK Bennett from a previous brush with insolvency. Byland UK was formed by Rebecca Feng, who ran LK Bennett's Chinese franchises. At the time of that deal, Ms Feng said: Ms Feng said: \"Under our plan, the business will continue to operate out of the UK, looking to maintain the long-standing and undoubted heritage of the brand. \"This will be achieved through a combination of working with quality British design, and the business's existing supply chain.\" Accounts for LK Bennett Fashion for the period ended January 27, 2024 show the company made a post-tax loss of £3.5m on turnover of £42.1m. The figures showed a steep decline in sales from £48.8m in 2023. Ms Bennett founded the eponymous chain by opening a store in Wimbledon, southwest London, in 1990, and promised to \"bring a bit of Bond Street to the high street\". Her eye for design earned her the nickname 'queen of the kitten heel' and saw her products worn by the Princess of Wales and Theresa May, the former prime minister. In 2008, Ms Bennett sold the business for an estimated £100m to a consortium led by the private equity firm Phoenix Equity Partners. She retained a stake and then bought back the remaining equity in 2017. The company's administration in 2019 resulted in the closure of 15 stores. Next declined to comment, while an M&S spokeswoman said it was not considering a bid for LK Bennett."
    },
    {
        "title": "FTSE 100 breaks 'historic' 10,000 points mark for the first time in 'best present chancellor could want'",
        "description": "The UK's flagship stock index has broken the symbolic 10,000 points mark for the first time.",
        "url": "https://news.sky.com/story/ftse-100-breaks-10000-points-mark-for-the-first-time-13489592",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-stock-exchange-london_7114201.jpg?20251218155412",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-02 08:57:00",
        "Headline": "The latest record high for the FTSE 100 follows its best year since 2009 and outperformance of rivals.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK's flagship stock index has broken the symbolic 10,000 points mark for the first time. The new high was reached within a half hour of the first day of trading in the new year. The Financial Times Stock Exchange (FTSE) 100 comprises the hundred most valuable companies listed on the London Stock Exchange. Notable constituents include lenders such as Barclays, Natwest, HSBC and Lloyds and supermarket chains Tesco, Marks & Spencer and Sainsbury's. The index is also largely made up of mining and international oil and gas companies. \"This is a historic moment and already makes 2026 one of the most significant years for the blue-chip index since its launch in 1984,\" said Dan Coatsworth, the head of markets at investment platform AJ Bell. Boosting the top flight on Friday morning were share price rises from aerospace company Rolls-Royce Holdings and mining company Fresnillo, the company which saw the single largest rise last year. A run of records \n                  Major FTSE record as much about companies not in the index as the ones that are\n                 \n                  FTSE 100 has best year since 2009 - outperforming US and European rivals\n                 \n                  Schwimmer urges Reeves to unleash £100bn UK stock market boom\n                 It comes off a record-breaking year for the FTSE 100, in which it closed at an all-time high 41 times, according to data from the London Stock Exchange Group (LSEG). In 2025, it had its best year since 2009, outperforming rivals including the S&P 500, the US index containing the most valuable companies in the world. Before smashing the 10,000 mark, the previous symbolic level of 9,000 was passed in July. Expectations of cheaper borrowing from interest rate cuts and a weaker pound at times helped FTSE 100 company competitiveness as it made buying sterling-priced shares better value. Why the new year rise? Policy announcements by Rachel Reeves have been credited with part of the new year rise. \"Breaking through the 10,000 level is the best New Year's present Chancellor Rachel Reeves could want,\" Mr Coatsworth said. \"She has been banging the drum about the merits of investing over parking cash in the bank, and the FTSE 100's achievements just go to show what's possible when buying UK shares.\" The change to cash ISAs announced in the budget, whereby savers can only put up to £12,000 tax-free a year, is intended to get people to put their money in the stock market. New measures mean banks and building societies will also be empowered to give customers financial advice. After the initial 10,000 threshold was reached, the FTSE 100 fell back slightly to 9,982 later in the morning."
    },
    {
        "title": "Major FTSE record as much about companies not in the index as the ones that are",
        "description": "Passing the 10,000-point barrier is a largely symbolic milestone for the FTSE 100, but it underlines an upward trend for the index of the UK's largest companies and offers some cautious optimism for the year ahead.",
        "url": "https://news.sky.com/story/major-ftse-record-as-much-about-companies-not-in-the-index-as-the-ones-that-are-13489648",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ftse-london-stock-exchange_7124411.jpg?20260102122917",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2026-01-02 11:57:00",
        "Headline": "The index's mix of banking, mining, defence and pharma companies means London is home to a healthy blend of major players in sectors that have thrived.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Passing the 10,000-point barrier is a largely symbolic milestone for the FTSE 100, but it underlines an upward trend for the index of the UK's largest companies and offers some cautious optimism for the year ahead. Founded in 1984 with an index value of 1,000, last year was the FTSE's best since 2009, rising 21.5% despite gloomy prognostications about the future of London as a trading centre in the shadow of mighty tech-driven American markets. The FTSE 100 has defied those forecasts thanks to a combination of the companies it represents and those it omits. London remains home to a healthy blend of major players in sectors that have thrived in recent months: banking, mining, defence, oil and gas, along with pharmaceuticals and consumer brands. What it does not include is any tech giants, and with concerns over the stratospheric valuations assigned to US megascalers driving the AI boom, the FTSE offers a means of diversifying portfolios and hedging risk should the bubble burst. Defence stocks led by Rolls-Royce have benefitted from the commitment to greater European defence spending, while mining has been boosted by the rush to gold as a safe haven and a rally in silver, a crucial material in electrification technologies. Precious metal miner Fresnillo was the best performer on the FTSE 100 in 2025, up more than 360%. Banks and financial services, meanwhile, were grateful for the absence of tax-raising measures in the last budget, crowning a year that saw Lloyds up 80%, Standard Chartered and Prudential more than 70% and Barclays more than 60%. Pharmaceutical giants AstraZeneca and GSK have held their own, too, despite neither having a GLP-1 weight loss drug in the market, helped by the recent UK-US pharmaceuticals deal that will see NHS drugs spending increase. Cause for optimism - but not so rosy in the UK If these buoyant valuations feel at odds with the gloom that pervades in the real economy, it's worth remembering that while they may be listed in the UK, FTSE 100 constituents like HSBC, Anglo American, BAE Systems, Shell, Unilever and AstraZeneca are international players that generate the bulk of their revenue overseas. The FTSE 250, an index of the next largest tranche of British companies with greater exposure to UK trends, was up just 9% in 2025. But a buoyant start to the trading year after a rewarding 2025 for investors in London does give cause for optimism. All stock market speculation is in part a bet on the future and, with inflation and interest rates falling and forecast to continue in 2026, a wager on better vibes might be rewarded."
    },
    {
        "title": "Tesla loses title of world's biggest electric vehicle maker to Chinese rival BYD",
        "description": "Tesla has lost its crown as the world's bestselling electric vehicle maker.",
        "url": "https://news.sky.com/story/tesla-loses-title-of-worlds-biggest-electric-vehicle-maker-to-chinese-rival-byd-13489720",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tesla-elon-musk_7124528.jpg?20260102145623",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-02 14:46:00",
        "Headline": "The US firm faced a difficult year with unease over chief executive Elon Musk’s political activities and stiff overseas competition.",
        "Content": "Tesla has lost its crown as the world's bestselling electric vehicle maker. The US firm faced a difficult year with unease over chief executive Elon Musk's political activities and stiff overseas competition that pushed sales down for a second year in a row. Tesla said that it delivered 1.64 million vehicles in 2025, a decrease of 9% from a year earlier. Chinese rival BYD, which sold 2.26 million vehicles last year, is now the biggest EV maker. Tesla sales totalled 418,227 between October and December, falling short of the 440,000 that analysts polled by FactSet expected. The sales total may have been hit by the end of a $7,500 (£5,500) tax credit phased out by the Trump administration at the end of September. Despite this Tesla stock finished 2025 with a gain of approximately 11%. Investors hope Musk can deliver on his ambitions to make the company a leader in robotaxi services and get consumers to embrace humanoid robots that can perform basic tasks in homes and offices. \n                  Why Trump administration is so annoyed with Europe's online rules\n                 \n                  Elon Musk closer to becoming first-ever trillionaire as he marks major milestone\n                 \n                  The year America changed - 2025 in review\n                 Shares of Tesla rose almost 2% before the opening bell on Friday, with stock mostly unchanged at $450.27 in early trading. Read more:Musk's $1trn pay package approved by TeslaTesla looks to cheaper model amid sales slump The latest quarter was the first with sales of stripped-down versions of the Model Y and Model 3 that Musk unveiled in early October as part of an effort to revive sales. The new Model Y costs just under $40,000 (£30,000) while customers can buy the cheaper Model 3 for under $37,000 (£27,000). The new versions are aimed at helping Tesla to compete with Chinese models in Europe and Asia. For fourth-quarter earnings coming out in late January, analysts are expecting the company to post a 3% decrease in sales and a nearly 40% drop in earnings per share, according to FactSet. Analysts expect the downward trend in sales and profits to eventually reverse itself further into 2026. In November, Musk won a shareholder vote that will see him net a $1trn (£742bn) pay package if the firm meets a series of extremely ambitious performance targets over the next 10 years. Already the world's richest man, he scored another huge windfall last month when the Delaware Supreme Court reversed a decision that deprived him of a $550bn (£408bn) pay package that Tesla gave him in 2018."
    },
    {
        "title": "Recruitment drive launched for new magistrates",
        "description": "The government is launching a drive to recruit thousands of new volunteers to serve as magistrates in England and Wales, as it seeks to get a grip of the courts backlog.",
        "url": "https://news.sky.com/story/recruitment-drive-launched-for-new-magistrates-13489785",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-lammy-lord-chancellor_7124719.jpg?20260102200448",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-02 19:30:00",
        "Headline": "Justice Secretary David Lammy wants to recruit 2,000 new magistrates in the next year, as the government seeks to tackle the courts backlog and speed up access to justice.",
        "Content": "The government is launching a drive to recruit thousands of new volunteers to serve as magistrates in England and Wales, as it seeks to get a grip of the courts backlog. More than 2,000 magistrates have been trained since 2022, and ministers want to recruit the same number again over the next financial year, the Ministry of Justice (MoJ) says. The recruitment effort is part of the government's bid to reduce the backlog and speed up justice for victims, and comes on the heels of the announcement of a series of reforms - including controversial plans to limit jury trials. Deputy Prime Minister and Justice Secretary David Lammy said: \"Magistrates play a vital role in our court system - hearing thousands of cases across every jurisdiction and delivering justice. \"They are everyday heroes - and we need more people of every age and background to volunteer not just to deliver justice but to serve and represent their local communities. \"Volunteering to become a magistrate can make a real difference to your life and the lives of others - that's why I'm calling on the public to apply and play your part.\" The Magistrates' Association said the move was a \"big vote of confidence\" in magistrates, but more resources are needed for the courts, including enough trained, well-paid legal advisers, and repairing crumbling court buildings. What's expected of new recruits? Magistrates are expected to volunteer at least 13 days a year to hear cases, and judiciary bosses are seeking candidates with good communication skills, a sense of fairness and the ability to see an argument from different sides. New recruits are wanted across criminal, youth, and civil and family proceedings, and have specialist legal advisers to support them to deal with a range of cases. According to the latest figures from the MoJ, 57% of magistrates are female and 14% come from an ethnic minority background, aside from London where it is the highest proportion of 31%. Read more from Sky News:Snow warnings upgradedLikely cause of Swiss bar fire identified Shadow justice minister Kieran Mullan welcomed efforts to recruit more magistrates, but said it \"cannot paper over the failings of a justice secretary and Labour government that has consistently failed to deliver meaningful reform.\" The senior Tory described the previously announced plans to scrap jury trials as \"reckless\", and warned it \"risks undermining public confidence\". The drive to recruit new magistrates comes after Mr Lammy announced a series of proposals last month to overhaul the courts, including increasing magistrates' sentencing powers up to 18 months' imprisonment, up from 12 months currently, so they will be able to deal with more serious cases. But the most controversial of the planned reforms is to remove the right to a jury trial for defendants who are likely to get a sentence of three years or less. It has sparked concerns across the political spectrum, and 38 Labour MPs have come out publicly against the move, describing it in a letter to the prime minister as an \"ineffective way\" of dealing with the backlog, although it is understood that more are privately opposed as well."
    },
    {
        "title": "Nigel Farage giving 'serious thought' to scrapping OBR if Reform wins next general election",
        "description": "Nigel Farage has said he is giving \"serious thought\" to scrapping the Office for Budget Responsibility (OBR) if his party wins the next general election and he becomes prime minister.",
        "url": "https://news.sky.com/story/nigel-farage-giving-serious-thought-to-scrapping-obr-if-reform-wins-next-general-election-13489799",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigel-farage-press-conference_7124747.jpg?20260102211715",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-02 21:10:00",
        "Headline": "The Reform UK leader said the budget watchdog is \"effectively dictating to elected politicians\". But Labour warned against \"fiscal recklessness\".",
        "Content": "Nigel Farage has said he is giving \"serious thought\" to scrapping the Office for Budget Responsibility (OBR) if his party wins the next general election and he becomes prime minister. The Reform UK leader said the budget watchdog leaves chancellors \"beholden to it rather than doing their own thinking\", and said it is \"effectively dictating to elected politicians\". But Treasury minister James Murray warned against \"fiscal recklessness\" and claimed Mr Farage would \"hammer the British economy with a Liz Truss plan on steroids\". Speaking to The Telegraph newspaper, Mr Farage said: \"I have questioned the need for it. The question we have to ask ourselves is 'is the OBR serving any useful purpose?'\" He added: \"We have to discuss whether we would be better off without the OBR. I am giving that very serious thought.\" He went on: \"With the OBR I worry once again that we have a Blairite-style quango effectively dictating to elected politicians what they should or should not do. \"It seems that in too many areas of our public life the power has moved to judges and quangos and not the government the people choose.\" \n                  Nigel Farage vows to go 'double or quits' with £5m local elections spending blitz\n                 \n                  Too late to investigate Farage election expenses, Essex Police say\n                 \n                  Attempting to rejoin EU customs union 'complete fuel for Reform', Starmer warned\n                 The OBR was created in 2010 by the Conservative-Liberal Democrat coalition government, and it is mandated to produce five-year forecasts for the economy and the public finances. These are published twice yearly, alongside the budget and the spring statement, and factor in any tax and spending decisions announced by the chancellor. However, the watchdog has come under fire in recent years over the accuracy of its forecast, as well as its perceived excessive influence over politicians' decision-making. It also hit the headlines at last year's budget after its forecasts were accessible on its website before the chancellor had delivered her statement in the Commons, resulting in the resignation of its chairman, Richard Hughes. There have also been tensions with the Treasury, and OBR officials had raised concerns with the Treasury about budget leaks spreading \"misconceptions\" about its forecasts. Mr Farage told The Telegraph that the OBR \"distorts policy\", and said: \"Chancellors become beholden to it rather than doing their own thinking. \"Given the economic decline that we're in, we need a government of radicalism. It is difficult to imagine the OBR is capable of radicalism in any way at all.\" Asked who would be responsible for economic forecasts if he were to scrap the watchdog, the Reform UK leader declined to answer. Prior to the OBR's creation, forecasts were produced by the Treasury, which led to accusations the numbers were skewed in favour of the government. Former prime minister Liz Truss declined to get the OBR to analyse her 2022 \"mini-budget\" ahead of its delivery, which is seen as having contributed to the negative market reaction that led to her resignation. In response to Mr Farage's comments, chief secretary to the Treasury Mr Murray said: \"Not content with taking advice from Liz Truss, Nigel Farage is now willing to go further. \"Working people know the price of fiscal recklessness - many are still paying huge sums more on their mortgages than they would have done before Liz Truss crashed the economy. Yet Farage still called it the best Conservative budget since 1986. \"It's time Nigel Farage realised that politics isn't a game. He'd hammer the British economy with a Liz Truss plan on steroids - and it's working people and British businesses who'd be left to foot a very heavy bill.\""
    },
    {
        "title": "Starmer accused of diverting NHS 'billions' to appease Trump",
        "description": "Sir Keir Starmer has been accused of diverting &#163;3 billion of NHS funding a year to appease Donald Trump.",
        "url": "https://news.sky.com/story/starmer-accused-of-diverting-nhs-billions-to-appease-trump-13489684",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lib-dems-daisy-cooper_7124469.jpg?20260102133558",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-02 13:31:00",
        "Headline": "Lib Dems critical of deal that means UK pays 25% more for new medicines but stops US imposing trade tariffs on drugs.",
        "Content": "Sir Keir Starmer has been accused of diverting £3 billion of NHS funding a year to appease Donald Trump. Daisy Cooper, the Liberal Democrat deputy leader, said taxpayers' money was being \"rerouted at the request of Donald Trump\" from frontline NHS services \"into the pockets of big pharmaceutical companies\". At the beginning of December, the UK agreed to pay 25% more for new medicines by 2035 to stop the US imposing trade tariffs on pharmaceutical products. The deal involves an increase in the baseline threshold used to assess whether medicines can be offered by the NHS. The National Institute for Health and Care Excellence (NICE) will increase the threshold by 25%: from £20,000-£30,000 to £25,000-£35,000. The government says this means NICE will be able to approve innovative medicines that deliver significant health improvements but might have previously been declined on cost-effectiveness grounds. It has suggested the deal will cost around £1bn a year by 2029. Others, including the Lancet medical journal, have said the cost to the NHS will be £3bn. Exact costs will depend on how many medicines are approved under the new system. \n                  Trump issues warning as National Guard troops withdrawn from US cities\n                 \n                  2026 preview: The most consequential year in modern American history?\n                 \n                  A head-spinning two days of Trump diplomacy - but how much was theatrical hot air?\n                 Ms Cooper said it was \"outrageous\" the agreement was made without any public debate or parliamentary scrutiny - \"just a decision by the Labour prime minister, Keir Starmer\". She called on Sir Keir to \"scrap this £3bn Trump tax\" and instead invest it in social care. \"There is no doubt at all that this money will not bring lots of new drugs to our NHS,\" she said. \"Independent experts suggest it could just be three or four, possibly five at most. \"What this money will do is simply increase the amount of money that we will pay for the existing drugs that we use, and it will be rerouted from frontline services... \"That is why our message is clear: Scrap this £3bn 'Trump tax' and fix social care now.\" When the US-UK drug pricing deal was announced, NHS leaders backed the government's assessment that it would lead to tens of thousands of patients receiving groundbreaking new drugs. However, they warned the NHS receives too little funding to absorb the costs and said care, services and treatment budgets must not be raided. Read more:2025 second-highest year for small boat crossingsWorkers being 'hammered' while pensioners benefit Whitehall sources claimed the hike in drug prices will not be paid for out of budgets for NHS services but from hundreds of millions of pounds given to the NHS last year to cover the costs of the deal in its early years. Science Secretary Liz Kendall said the deal would \"enable and incentivise life sciences companies to continue to invest and innovate right here in the UK\". But Ms Cooper said the government needs to be \"standing strong\" against Mr Trump as he only understands \"the language of strength\". And she accused the government of being \"all spin and no substance\" as she said it has held only one meeting on social care after promising to launch cross-party talks to fix social care a year ago. Sky News has contacted the government for a comment."
    },
    {
        "title": "Double murderer awarded £7,500 compensation over human rights breaches",
        "description": "A double murderer has been awarded &#163;7,500 compensation by the High Court over breaches of his human rights.",
        "url": "https://news.sky.com/story/double-murderer-awarded-1637500-compensation-over-human-rights-breaches-13489562",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-high-court-london_7071787.jpg?20251104133843",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-02 00:53:00",
        "Headline": "Fuad Awale, who is serving a life sentence for shooting two teenagers in the head, was moved to a special unit for dangerous prisoners after threatening to kill a prison officer. Awale was later stopped from having contact with other prisoners.",
        "Content": "A double murderer has been awarded £7,500 compensation by the High Court over breaches of his human rights. Fuad Awale, who is serving a life sentence for shooting two teenagers in the head in 2011, was moved to a close supervision centre (CSC) - a special unit for dangerous prisoners - after helping to take a prison officer hostage and threatening to kill him. He was later stopped from having contact with other prisoners, including one of the men who killed Fusilier Lee Rigby in Woolwich, southeast London, in 2013. Awale claimed it impacted his mental health and breached his human rights. The High Court last year agreed, ruling that his treatment had breached Article 8 of the European Convention on Human Rights (ECHR), his right to a private and family life. The ruling was discussed in parliament in November, when it was revealed that Awale was awarded £234,000 in legal costs by the High Court. Shadow justice secretary Robert Jenrick asked whether Justice Secretary David Lammy would pay any compensation to Awale out of his own pocket instead of using taxpayers' money if he wanted to follow the court's ruling. In a letter sent to Mr Jenrick on 29 December, Mr Lammy mentioned the previously unreported compensation amount of £7,500 for Awale, which he said \"constitutes only a modest proportion of the overall settlement\". \"This payment was mandated following a court judgment against the department, after we had defended the claim in line with the established policy of contesting all litigation brought by prisoners convicted of terrorist offences - a policy that has remained consistent under successive governments,\" Mr Lammy added. Mr Jenrick accused the deputy prime minister of putting the ECHR \"above the safety of officers and the interests of the British people\" and \"cowing to one of the most despicable terrorists in Britain\" in a post on X. Read more from Sky News:'Horror movie' ski resort fire kills 40UK snow and ice warnings upgraded In a statement on Awale's High Court win, the Ministry of Justice repeated Mr Lammy's letter, saying: \"This government will not be cowed by legal threats from prisoners. \"The Separation Centre remains an essential operational tool to protect the public and other prisoners and when dangerous radicalisers pose a risk, they will be placed in one. \"This government is committed to the European Convention on Human Rights. Commitment does not mean complacency, however, and we must keep under review whether the application of the convention is acting as a barrier to us protecting national security.\" It comes weeks after Mr Lammy met with ministers from member states signed up to the ECHR, who all agreed to consider reforming the treaty and tackle illegal migration within the existing framework. In a statement, the member states also called for changes to address decision-making in migration cases including in Article 8."
    },
    {
        "title": "Tesla loses title of world's biggest electric vehicle maker to Chinese rival BYD",
        "description": "Tesla has lost its crown as the world's bestselling electric vehicle maker.",
        "url": "https://news.sky.com/story/tesla-loses-title-of-worlds-biggest-electric-vehicle-maker-to-chinese-rival-byd-13489720",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tesla-elon-musk_7124528.jpg?20260102145623",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-02 14:46:00",
        "Headline": "The US firm faced a difficult year with unease over chief executive Elon Musk’s political activities and stiff overseas competition.",
        "Content": "Tesla has lost its crown as the world's bestselling electric vehicle maker. The US firm faced a difficult year with unease over chief executive Elon Musk's political activities and stiff overseas competition that pushed sales down for a second year in a row. Tesla said that it delivered 1.64 million vehicles in 2025, a decrease of 9% from a year earlier. Chinese rival BYD, which sold 2.26 million vehicles last year, is now the biggest EV maker. Tesla sales totalled 418,227 between October and December, falling short of the 440,000 that analysts polled by FactSet expected. The sales total may have been hit by the end of a $7,500 (£5,500) tax credit phased out by the Trump administration at the end of September. Despite this Tesla stock finished 2025 with a gain of approximately 11%. Investors hope Musk can deliver on his ambitions to make the company a leader in robotaxi services and get consumers to embrace humanoid robots that can perform basic tasks in homes and offices. \n                  Why Trump administration is so annoyed with Europe's online rules\n                 \n                  Elon Musk closer to becoming first-ever trillionaire as he marks major milestone\n                 \n                  The year America changed - 2025 in review\n                 Shares of Tesla rose almost 2% before the opening bell on Friday, with stock mostly unchanged at $450.27 in early trading. Read more:Musk's $1trn pay package approved by TeslaTesla looks to cheaper model amid sales slump The latest quarter was the first with sales of stripped-down versions of the Model Y and Model 3 that Musk unveiled in early October as part of an effort to revive sales. The new Model Y costs just under $40,000 (£30,000) while customers can buy the cheaper Model 3 for under $37,000 (£27,000). The new versions are aimed at helping Tesla to compete with Chinese models in Europe and Asia. For fourth-quarter earnings coming out in late January, analysts are expecting the company to post a 3% decrease in sales and a nearly 40% drop in earnings per share, according to FactSet. Analysts expect the downward trend in sales and profits to eventually reverse itself further into 2026. In November, Musk won a shareholder vote that will see him net a $1trn (£742bn) pay package if the firm meets a series of extremely ambitious performance targets over the next 10 years. Already the world's richest man, he scored another huge windfall last month when the Delaware Supreme Court reversed a decision that deprived him of a $550bn (£408bn) pay package that Tesla gave him in 2018."
    },
    {
        "title": "The Voice Of Hind Rajab: Brad Pitt-backed film about death of child in Gaza set for UK release",
        "description": "A film based on the death of a five-year-old girl during Israel's war in Gaza is set to hit UK cinemas this month.",
        "url": "https://news.sky.com/story/the-voice-of-hind-rajab-brad-pitt-backed-film-about-death-of-child-in-gaza-set-for-uk-release-13489718",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-hind-rajab-film-venice_7124529.jpg?20260102145739",
        "type": "Entertainment",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2026-01-02 14:37:00",
        "Headline": "The death of Hind Rajab in January 2024 was investigated by Sky News, which found Israeli tanks were present in the area and likely to have fired at civilians. A new film - backed by Brad Pitt and Joaquin Phoenix - dramatises the story.",
        "Content": "\n          News correspondent\n              @esadiya\n A film based on the death of a five-year-old girl during Israel's war in Gaza is set to hit UK cinemas this month. The January 2024 killing of Hind Rajab shocked the world after her desperate telephone calls with the Palestinian Red Crescent Society (PRCS) emergency services were recorded in real time and made public. Hind and six of her relatives (the Hamada family) had been attempting to escape the fighting in Gaza City when their car came under attack. The Voice Of Hind Rajab, directed by Kaouther Ben Hania, fuses Hind's actual voice with a dramatised performance to tell the story of her desperate cries for help. Set inside the charity's West Bank call centre, the film reconstructs the resolute efforts of Red Crescent workers during a hopeless negotiation with the Israelis over a safe route for the rescue. Over 90 minutes, an avoidable tragedy is played out from the perspective of the call handlers who listen, refuse to abandon hope, and sometimes fight over the rules of sending an ambulance out to a deadly mission. The film invites an audience that already knows how the story ends to feel the long and frustrating wait, and to experience the complex Israeli protocols Palestinians have to live by. What unfolds is an uncomfortable watch as day turns to evening and the child's voice pleads: \"Please don't leave me, I'm afraid of the dark.\" 'The magical power of cinema' Director Kaouther Ben Hania says the film was not about investigating the death. Speaking to Sky News, she said she wanted to let audiences feel what life is like for Palestinians living under Israeli occupation. \"This story was investigated by The Washington Post and Sky News, so in terms of explaining what happened, this was done,\" she said. \"I asked myself what can cinema bring to the table? Cinema has a magical power of empathy - you experience 'otherness', you live the life of others. And I thought, we are done explaining, now let's feel. \"What does it mean to be Palestinian, working in the Red Crescent? Your mission is to save lives, and you have this system making your life impossible.\" PRCS staff kept Hind on the line for hours through multiple calls before an ambulance could finally be dispatched. By 6pm, the ambulance crew were close to the family car, telling dispatchers they had their emergency lights on but no siren. \"Oh, there she is,\" a paramedic said, just before communication ended abruptly with the sound of heavy gunfire. Both paramedics were killed, and all nine bodies were found 12 days later. 'I felt my heart going to explode' Palestinian actor Motaz Malhees plays Omar, the first call handler to take Hind's call. He told Sky News how repeatedly hearing the child's voice during the making of the film took its toll on the cast and crew. \"Thinking about it and hearing her voice begging to be rescued, I was feeling so powerless,\" he said. \"There were some moments I felt I had panic attacks, and during one of the scenes I felt my heart is going to explode.\" Awards buzz and big name backing The film is a contender at this year's Oscars and received a record 23-minute standing ovation at the 2025 Venice Film Festival where it won the Grand Jury Prize. Hollywood elites Brad Pitt and Joaquin Phoenix signed on as executive producers, which Malhees said felt like \"a great honour.\" The Israel Defence Forces (IDF) said it was not in the area on the day of Hind's death, but it made its presence there public, perhaps mistakenly. Twelve days after the attack, on the same day the car and ambulance were found, the IDF published a press release about its activities in Gaza, saying \"over the last two weeks\" it had \"conducted raids on terror targets\" with forces operating in Shati and Tel al Hawa neighbourhoods in Gaza. Tel al Hawa is the same neighbourhood where Hind Rajab, the Hamada family, and the paramedics were killed. The press release was later deleted from the IDF website and a Sky News investigation found a number of Israeli tanks were indeed present and likely to have fired at civilians. The Voice Of Hind Rajab is set for UK and Irish theatrical release on 16 January."
    }
]