[
    {
        "title": "Nadjib, who tipped off police over released prisoner Brahim Kaddour-Cherif, tells Sky News he's 'happy to see him arrested'",
        "description": "\"It's him, it's him, it's him\", the man told me urgently.",
        "url": "https://news.sky.com/story/nadjib-who-tipped-off-police-over-escaped-prisoner-brahim-kaddour-cherif-tells-sky-news-hes-happy-to-see-him-arrested-13465885",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nadjib-finsbury-park_7074927.png?20251107163929",
        "type": "Home",
        "Author": "Tom Parmenter",
        "Date Published": "2025-11-07 16:29:00",
        "Headline": "Nadjib told Sky News he had been looking out for Brahim Kaddour-Cherif since the convicted sex offender was mistakenly released from prison and knew him \"from the community\".",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  \"It's him, it's him, it's him\", the man told me urgently. While police were frantically searching in Finsbury Park for wanted sex offender Brahim Kaddour-Cherif, locals were telling me where he was. Immediately after the dramatic arrest, filmed exclusively by Sky News we spoke to the North African man who tipped off the police. Nadjib had been on the lookout for the convicted sex offender, who had been spending time in different parts of north London since his release from HMP Wandsworth. He even had a folded-up newspaper clipping in his pocket so that he could check the picture himself. He told Sky News he was \"very happy when he got arrested\". \"I don't like the sex offenders,\" he said. \n                  Highland protesters speak out as asylum seekers set for army barracks move\n                 \n                  Wrongly-released migrant sex offender Hadush Kebatu claims he was 'ignored' by police while trying to hand himself in\n                 \n                  Military barracks to be used to house asylum seekers\n                 \"I know him from the community. He has been around here every night since he was released from prison.\" Not only did he tip the police off about the prisoner's whereabouts, but he also witnessed the other high-profile manhunt that ended in the same park last month. Ethiopian asylum seeker Hadush Kebatu was also arrested in Finsbury Park after a 48-hour manhunt in the capital. He was then deported to Ethiopia. \"When he [Kebatu] got arrested in the park I was there,\" Nadjib said. I asked him why both men ended up in the same park in north London. \"Because the community, he came here for the community of Algerians,\" he said. Several Algerian people that I spoke to on Friday told me how shameful they thought it was that this sex offender was still on the run. \"Job done,\" Nadjib said, before walking off."
    },
    {
        "title": "Madeleine McCann's parents respond after harassment conviction of woman who claimed to be their daughter",
        "description": "The parents of Madeleine McCann have said \"we take no pleasure in the result\" after a woman who claimed to be their missing daughter was found guilty of harassing them.",
        "url": "https://news.sky.com/story/woman-who-claimed-to-be-madeleine-mccann-found-guilty-of-harassing-missing-toddlers-parents-13464212",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2025-11-07 00:01:00",
        "Headline": "Police told Julia Wandelt - who was cleared of stalking the couple - she was not Madeleine and ordered her not to approach her family, but she ignored the warning. She turned up at the McCanns' home and sent sinister letters and messages repeatedly begging for a DNA test.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  The parents of Madeleine McCann have said \"we take no pleasure in the result\" after a woman who claimed to be their missing daughter was found guilty of harassing them. After the conviction of Polish national Julia Wandelt, Kate and Gerry McCann said: \"Like most people, we did not want to go through a court process and only wanted the harassment to stop.\" Wandelt, 24, was cleared of stalking the couple. Trial judge Mrs Justice Cutts made Wandelt the subject of a restraining order against the McCanns because she posed a \"significant risk of harassment\" towards the couple in the future. The judge told Wandelt her \"pestering\" and \"badgering\" of the McCanns was \"unwarranted\" and \"unkind\". She said: \"An order is necessary in this case for the sake of the McCanns. Even when giving evidence you did not accept you were not Madeleine.\" Wandelt was sentenced to six months' imprisonment - which the judge said she had already served in custody since her arrest in February. \"It's not for me to say that you could be released at this point, notwithstanding that you have served your sentence,\" the judge said. \"A notice of deportation has been served on you and it's a matter for the secretary of state as to how things proceed.\" Born three years after Madeleine, Wandelt said she suspected she had been abducted and brought up by a couple who were not her real parents. She was having mental health issues at the time and had been abused by an elderly relative. The relative looked like an artist's drawing of a man who was once a suspect in the Madeleine case, which she stumbled across during internet research on missing children. She went to Los Angeles and told a US TV chat show audience: \"I believe I am Madeleine McCann.\" Madeleine was nearly four when she vanished from the family's rented holiday apartment in Praia da Luz, Portugal, in May 2007. She had been left sleeping with her younger twin siblings, Sean and Amelia, while her parents dined nearby with friends, making intermittent checks on the children. Madeleine is the world's most famous missing child - the subject of three international police investigations that have failed to find any trace of her. Wandelt claimed to have a blemish in the iris of her right eye, like Madeleine's, and to resemble aged-progressed images of her. Over three years, she attracted half a million followers on her Instagram account, iammadeleinemccan, and posted her claims on TikTok. Police told her she was not Madeleine and ordered her not to approach her family, but she ignored the warning. She turned up at the McCanns' home and sent sinister letters and messages repeatedly begging for a DNA test. The McCanns and their children gave evidence in the five-week trial at Leicester Crown Court, describing the upset Wandelt had caused them. The court heard Wandelt claimed to have memories, induced by hypnosis sessions, of being abducted and of living with the McCanns as a child, including feeding Madeleine's brother and playing ring-a-ring-a-roses. Wandelt called and messaged Mrs McCann more than 60 times in one day on 13 April last year, claiming to have a memory of the mother stroking her head. When Wandelt was arrested earlier this year, a DNA test proved she was not Madeleine. In the witness box, Wandelt denied her claims were driven by a desire for money or fame. She said she was not a liar and never intended to cause the McCanns and their children harm. The restraining order bans Wandelt from contacting Mr and Mrs McCann and their children either directly or indirectly, entering Leicestershire or publishing or broadcasting any information relating to the family until another order is made. Her co-defendant, Karen Spragg, 61, from Cardiff, was found not guilty of stalking and harassment. Spragg was made subject to the same restrictions, but her restraining order was imposed for a period of five years."
    },
    {
        "title": "COP's potential for change limited not by who turned up, but by the elephants not in the room",
        "description": "The COP climate summit in Belem opened with a diplomatic double-whammy.",
        "url": "https://news.sky.com/story/cops-potential-for-change-limited-not-by-who-turned-up-but-by-the-elephants-not-in-the-room-13466030",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-lula-da-silva_7074146.jpg?20251106222739",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-07 19:31:00",
        "Headline": "The leaders of China, the US and India - the world's three largest contributors to climate change - are not at the summit in Brazil, meaning significant progress on addressing climate change will be even harder this time.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  The COP climate summit in Belem opened with a diplomatic double-whammy. The Prince of Wales and Sir Keir Starmer reaffirmed the UK's commitment to fighting climate change and urged the rest of the world to do so, too. But as the tropical rain beat down on the tarpaulin roof of this temporary summit venue, it's hard not to feel the air going out of the process.  Sir Keir and Prince William's presence doesn't make up for the geopolitical weight of the elephants not in the room. The leaders of China, the US and India - the world's three largest contributors to climate change - are no-shows. Donald Trump's highly-publicised decision to withdraw America from the UN climate talks is a blow. Before Mr Trump, America - the world's largest economy, largest oil and gas producer, and major market for renewable energy - had serious deal-making power here. \n                  Prince William plays volleyball and football ahead of Brazil climate events\n                 \n                  Prince William to attend Earthshot Prize and COP30 in Brazil - with his team hoping to refocus attention away from Andrew\n                 \n                  Families mourn dozens killed during Rio de Janeiro's 'biggest' raid against drugs gang\n                 Having formally withdrawn, there is no US delegation. And, as far as I can tell, any US broadcasters either, so for Americans, this meeting may as well not be happening at all.  Without the US, things will be harder. But does that mean the process is doomed? The leaders of China and India may be absent but they've sent high-level delegations. Read more on COP 30:Is net zero dead?Why is COP 30 controversial? China is represented by vice-premier Ding Xuexiang, the country's most high-ranking politician after President Xi himself. And, while China and India might not be big on eco-messaging, between them they are busy driving the most rapid shift away from fossil fuels towards wind, solar and nuclear power the world has ever seen. What's more, the real work at these summits isn't done by heads of state, but experienced sherpas, some of whom have trodden the nylon carpeted corridors of COP for 30 years.  It's reasonable to ask what they've achieved in all that time. The commitments of the Paris agreement of a decade ago have been missed by a wide margin. The world is about to blow past 1.5 degrees of warming and almost certainly exceed two degrees as well. But when the Paris deal was signed, the trajectory was for four degrees of warming. There are good COPs and bad COPs, but the world is undoubtedly a safer place now than it would have been without them."
    },
    {
        "title": "Putin's right-hand man made him look weak - it may have cost him his seat at Kremlin's top table",
        "description": "In Soviet times, Western observers would scrutinise video footage of state occasions, like military parades on Red Square, to try to learn more about Kremlin hierarchy.",
        "url": "https://news.sky.com/story/where-is-sergei-lavrov-questions-swirl-over-putin8217s-veteran-foreign-minister-13465965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lavrov-putin_7074599.jpg?20251107210618",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-07 18:09:00",
        "Headline": "The heavyweight diplomat's absence from a key Kremlin meeting and the G20 delegation has fuelled speculation that he has fallen out of favour with President Vladimir Putin.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n In Soviet times, Western observers would scrutinise video footage of state occasions, like military parades on Red Square, to try to learn more about Kremlin hierarchy. Who was positioned closest to the leader? What did the body language say? Which officials were in and out of favour? In some ways, not much has changed. The footage present-day Kremlinologists are currently pouring over is from Wednesday's landmark meeting of Russia's Security Council, in which Vladimir Putin told his top officials to start drafting proposals for a possible nuclear weapons test.  It was an important moment. Not one you'd expect a trusted lieutenant to miss. But Sergei Lavrov, Russia's veteran foreign minister, was conspicuously absent - the only permanent member of the Council not present. According to the Russian business daily, Kommersant, his absence was \"coordinated\". \n                  Briton who volunteered as spy for Russia jailed\n                 \n                  Russian drones: The tiny, kamikaze killing machines being raced rather than used to hunt targets\n                 \n                  As Russia marks Stalin's political repression, some fear the country's dark history could repeat itself\n                 That episode alone would have been enough to raise eyebrows. But coupled with the selection of a more junior official to lead the Russian delegation at the upcoming G20 summit (a role Lavrov has filled in recent years) - well, that's when questions get asked, namely: Has Moscow's top diplomat been sidelined? The question has grown loud enough to force the Kremlin into a denial, but it's done little to quell speculation that Lavrov has fallen out of favour. Rumours of a rift have been mounting since Donald Trump called off a planned summit with Putin in Budapest last month, following a phone call between Lavrov and US secretary of state Marco Rubio. According to the Financial Times, it was Lavrov's uncompromising stance that prompted the White House to put the summit on ice. Conversations I had with diplomatic sources here at the time revealed a belief that Lavrov had either dropped the ball or gone off-script. Whether it was by accident or by design, his diplomacy (or lack of it) torpedoed the summit and seemingly set back a US-Russia rapprochement.  That would've angered Putin, who is keen to engage with Washington, not only on Ukraine but on other issues, like nuclear arms control. More importantly, perhaps, it made the Russian president appear weak - unable to control his foreign minister. And Putin is not a man who likes to be undermined. Football fans will be familiar with Sir Alex Ferguson's golden rule of management: Never let a player grow bigger than the club. Putin operates in a similar fashion. Loyalty is valued extremely highly. If Lavrov has indeed been sidelined, it would be a very significant moment indeed. The 75-year-old has been the face of Russian diplomacy for more than two decades and effectively Putin's right-hand man for most of the Kremlin leader's rule. Known for his abrasive style and acerbic putdowns, Lavrov has also been a vociferous cheerleader for Russia's invasion of Ukraine. At the Putin-Trump summit in Alaska, he arrived wearing a jumper emblazoned with the initials \"CCCP\", the Russian letters for USSR. The apparent message: Ukraine still belongs to Moscow. And in the melee that immediately followed the presidents' press statements at the summit, I remember racing over to Lavrov as he was leaving and yelling a question to him through the line of security guards. He didn't even turn. Instead, he just shouted back: \"Who are you?\" It was typical of a diplomatic heavyweight, who's known for not pulling his punches. But has that uncompromising approach finally taken its toll?"
    },
    {
        "title": "Ex-British soldier contests extradition over alleged murder of Kenyan woman",
        "description": "A former British soldier wanted by Kenyan authorities over an alleged 2012 murder has said he does not consent to extradition.",
        "url": "https://news.sky.com/story/ex-british-soldier-contests-extradition-over-murder-of-kenyan-woman-13465921",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-agnes-wanjiru-kenya_7049490.jpg?20251013061155",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-07 16:58:00",
        "Headline": "Robert James Purkiss, 38,  is accused of murdering 21-year-old Agnes Wanjiru in Nanyuki, Kenya, in 2012. ",
        "Content": " A former British soldier wanted by Kenyan authorities over an alleged 2012 murder has said he does not consent to extradition. Robert James Purkiss, 38, appeared at Westminster Magistrates' Court on Friday as extradition proceedings began. Purkiss is accused of murdering 21-year-old Agnes Wanjiru in the town of Nanyuki, Kenya, in 2012. Her body was found in a septic tank. District Judge Briony Clarke told the former soldier: \"You are sought by Kenya to face this allegation of murder. \"You face a very serious allegation.\" Home Office barrister Joel Smith KC said Purkiss had \"confessed\" to the \"brutal murder\".  The court heard that in the days after the alleged murder, there were \"rumours on the camp that the defendant had killed someone\". \n                  Ukraine war latest: Trump explains why he cancelled Putin meeting as he hosts Orban - who says Ukraine need 'miracle'\n                 \n                  What could Elon Musk do with $1trn?\n                 \n                  COP's potential for change limited not by who turned up, but by the elephants not in the room\n                 In an alleged confession, Purkiss is said to have told a colleague, \"it was sex that went wrong\". David Josse KC, representing the former soldier, said he \"vehemently denies\" the charge. Mr Smith said: \"There is evidence that when the soldiers were given time off, they would go into town, drink heavily, and they would pay local women for sex.\" Read more from Sky News:Ex-footballer Joey Barton guilty over social media postsTeenager sentenced to five years for causing death of a friend \"Many of them, including this defendant, ended up in the Lions Court Hotel,\" he said. \"The last time Ms Wanjiru was seen alive, she was leaving the hotel with a soldier. \"As she left, she told a friend in her local language that she was going to 'hustle for her daughter'.\" Her body was found weeks later in the hotel grounds in a septic tank, Mr Smith said. The body was \"significantly decomposed\" and a post-mortem examination identified a 2cm stab wound to the lower abdomen and a collapsed lung, he said. The family of Ms Wanjiru, through their spokesperson Esther Njoki, also her neice, said they were unhappy with the progress of the judicial process. \"We urge the United Kingdom to expedite the extradition on their end so that there are no more delays in this case.\" In September, a UK government spokesperson said: \"Our thoughts remain with the family of Agnes Wanjiru, and we remain absolutely committed to helping them secure justice.\" Purkiss has been remanded in custody until his next court appearance on 14 November."
    },
    {
        "title": "Nadjib, who tipped off police over released prisoner Brahim Kaddour-Cherif, tells Sky News he's 'happy to see him arrested'",
        "description": "\"It's him, it's him, it's him\", the man told me urgently.",
        "url": "https://news.sky.com/story/nadjib-who-tipped-off-police-over-escaped-prisoner-brahim-kaddour-cherif-tells-sky-news-hes-happy-to-see-him-arrested-13465885",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nadjib-finsbury-park_7074927.png?20251107163929",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-11-07 16:29:00",
        "Headline": "Nadjib told Sky News he had been looking out for Brahim Kaddour-Cherif since the convicted sex offender was mistakenly released from prison and knew him \"from the community\".",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  \"It's him, it's him, it's him\", the man told me urgently. While police were frantically searching in Finsbury Park for wanted sex offender Brahim Kaddour-Cherif, locals were telling me where he was. Immediately after the dramatic arrest, filmed exclusively by Sky News we spoke to the North African man who tipped off the police. Nadjib had been on the lookout for the convicted sex offender, who had been spending time in different parts of north London since his release from HMP Wandsworth. He even had a folded-up newspaper clipping in his pocket so that he could check the picture himself. He told Sky News he was \"very happy when he got arrested\". \"I don't like the sex offenders,\" he said. \n                  Highland protesters speak out as asylum seekers set for army barracks move\n                 \n                  Wrongly-released migrant sex offender Hadush Kebatu claims he was 'ignored' by police while trying to hand himself in\n                 \n                  Military barracks to be used to house asylum seekers\n                 \"I know him from the community. He has been around here every night since he was released from prison.\" Not only did he tip the police off about the prisoner's whereabouts, but he also witnessed the other high-profile manhunt that ended in the same park last month. Ethiopian asylum seeker Hadush Kebatu was also arrested in Finsbury Park after a 48-hour manhunt in the capital. He was then deported to Ethiopia. \"When he [Kebatu] got arrested in the park I was there,\" Nadjib said. I asked him why both men ended up in the same park in north London. \"Because the community, he came here for the community of Algerians,\" he said. Several Algerian people that I spoke to on Friday told me how shameful they thought it was that this sex offender was still on the run. \"Job done,\" Nadjib said, before walking off."
    },
    {
        "title": "Why a Sky-ITV deal makes sense in a shifting entertainment landscape",
        "description": "The proposed &#163;1.6bn takeover of a big chunk of ITV by Sky would be the biggest consolidation in British broadcasting in more than 20 years, and reflects fundamental changes in viewing habits and commercial realities.",
        "url": "https://news.sky.com/story/why-a-sky-itv-deal-makes-sense-in-a-shifting-entertainment-landscape-13465639",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-ant-and-dec-im-a-celebrity_5950651.jpg?20221101084257",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-07 09:03:00",
        "Headline": "Sky's Paul Kelso examines why both parties would be keen to see an agreement reached, with the future firmly focused on streaming.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The proposed £1.6bn takeover of a big chunk of ITV by Sky would be the biggest consolidation in British broadcasting in more than 20 years, and reflects fundamental changes in viewing habits and commercial realities. For Sky, a deal that brings together Ant and Dec with Gary Neville and Jamie Carragher would make it the UK's largest commercial broadcaster, and strengthen its hand in the battle with US streaming giants that have upended the entertainment business. For ITV's shareholders, who have seen the value of their investment decline as advertising revenue, like viewers, has migrated online, it may be a chance to say, \"I own a terrestrial broadcaster, get me out of here.\" Money latest: Mortgage price war predicted Neither Sky or ITV would publicly discuss who made the initial offer, and both stress that talks are at an early stage, but privately, both sides emphasise the mutual opportunity. For Sky, owned by US giant Comcast since 2018, there is the opportunity to create a larger pool of content and subscribers. The deal would see it acquire ITV's media and entertainment business, including its free-to-air channels and public sector broadcaster (PSB) licence, which runs to 2034, as well as the ITVX streaming platform, which has 40 million registered users. \n                  ITV in 'preliminary' talks over £1.6bn sale of media and entertainment arm to Sky\n                 \n                  How the world's richest man is boosting the British right\n                 \n                  Is Aldi's cheap Ring doorbell dupe actually any good? | Money blog\n                 The ITV brand is likely to be retained, and the two companies run separately, but Sky would look to leverage its commercial and technology strengths. ITV's PSB licence includes the requirement that ITV’s app be \"available, prominent and easily accessible\" on online platforms, a crucial shop window as viewers access content directly. Added to Sky's existing 13 million subscribers for largely pay-walled content in the UK, it would add muscle as the broadcaster competes for attention, subscription revenue and advertiser spend. The acquisition would be a restatement of commitment to Sky from Comcast. Having paid £31bn for Sky in a bidding war with Disney seven years ago, it wrote down that investment by more than £6bn in 2022, and earlier this year announced the sale of Sky Deutschland. While it is navigating the conclusion of exclusivity deals with content providers, including with HBO that gave it rights to hits including Succession, the £5bn renewal of Premier League rights this season underlined the centrality of sport to Sky's offer. Scale matters because even companies as prominent in the UK as Sky and ITV are competing with giants, both for audiences and advertisers. Netflix has 301 million subscribers worldwide and annual revenues approaching $40bn. Amazon, the largest retailer in the world, is now an entertainment content provider. In the US, Warner Bros. Discovery is considering a sale, having already rejected reported offers worth more than $60bn. Google and Meta, meanwhile, gobble up to 60% of all UK advertising spend, a shift in the last decade that has hit ITV particularly hard. When it was founded 70 years ago, the third channel was the only way advertisers could reach television viewers. Today, it and Sky are competing for a slice of a shrinking pie, with one source citing an estimate that their combined UK advertising revenue is nine times smaller than Google and Meta's. Any proposed deal will face regulatory scrutiny from Ofcom and the Competition and Markets Authority, but both parties will argue that these commercial realities mean consolidation would strengthen the broadcast sector rather than weaken it. ITV still generates critical and commercial hits and live moments. Last year, the largest audiences for sport (England’s Euro 2024 semi-final), drama (Mr Bates v the Post Office) and entertainment (I’m a Celebrity) were all on ITV. Translating that into a commercial model that satisfies investors has proved difficult, with the general drift of the UK economy not helping. The 19% bump in the share price on news of the proposed takeover may be a welcome series finale. "
    },
    {
        "title": "Ex-footballer Joey Barton guilty of posting grossly offensive messages on social media",
        "description": "Joey Barton has been found guilty of&#160;posting grossly offensive&#160;messages on social&#160;media.",
        "url": "https://news.sky.com/story/ex-footballer-joey-barton-guilty-of-posting-grossly160offensive160messages-on-social160media-13465820",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-joey-barton-court-offensive_7072596.jpg?20251107183524",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-07 14:37:00",
        "Headline": "The former Manchester City midfielder \"crossed the line\" with posts about Jeremy Vine,  Lucy Ward and Eni Aluko, a jury decided.",
        "Content": "Joey Barton has been found guilty of posting grossly offensive messages on social media. Barton was found guilty by a jury at Liverpool Crown Court of six counts of sending a grossly offensive electronic communication with intent to cause distress or anxiety. During his trial at Liverpool Crown Court, the ex-Manchester City and Newcastle midfielder, 43, said he believed he was the victim of a \"political prosecution\" and denied his aim was \"to get clicks and promote himself\".   But the jury decided Barton, who also played for England in 2007, had \"crossed the line between free speech and a crime\" with six posts he made on X. The prosecution argued his comments on the platform, where he boasts more than two million followers, \"may well be characterised as cutting, caustic, controversial and forthright\". Peter Wright KC continued: \"Everyone is entitled to express views that are all of those things. \"What someone is not entitled to do is to post communications electronically that are - applying those standards - beyond the pale of what is tolerable in society.\" Barton, of Widnes, Cheshire, denied 12 counts of sending a grossly offensive electronic communication with intent to cause distress or anxiety between January and March last year. On six counts he was found guilty, but on another six he was cleared. Barton wore a scarf patterned with the Union flag as the verdicts were returned. Addressing him, the honorary Recorder of Liverpool, Andrew Menary KC, said: \"He has chosen to adorn himself with a particular flag which I suppose is a stunt to make a point. \"He will not be permitted to do that on the sentencing date.\" In one post on X, in January 2024, Barton compared football commentators Lucy Ward and Eni Aluko to the \"Fred and Rose West of football commentary\", and superimposed the women's faces on a photograph of the serial murderers. He also described Aluko as being in the \"Joseph Stalin/Pol Pot category\", suggesting that she had \"murdered hundreds of thousands, if not millions, of football fans' ears\". Read more:Barton insults left Eni Aluko 'scared to go out'Barton says women 'not qualified' to speak on men's football The jury found him not guilty in relation to the comparison with the Wests, and Stalin and Pol Pot, but decided the superimposed image was grossly offensive. Another message allegedly suggested Jeremy Vine had a sexual interest in children after the broadcaster posted a question, relating to the posts about the football commentators, asking whether Barton had a \"brain injury\". Vine told the jury he felt \"wickedly torn down for no reason\" after the posts. Describing the episode in court, he said: \"He is accusing me of being a paedophile. These are disgusting actions. It's a despicable thing to say. \"It gravely upset me, and I had a sleepless night that night.\" The ex-footballer told the court the posts were \"dark and stupid humour\" and \"crude banter\". He also said he had no intention of implying Vine was a paedophile. But in his closing speech to the jury, Peter Wright KC dismissed his defence. He said: \"Mr Barton is not the victim here. He is not the free speech crusader that he would like to paint himself to be. \"He is not some martyr to be sacrificed on the altar of political correctness. \"He is just simply an undiluted, unapologetic bully - a little bully who takes pleasure sitting there with his phone in his hand and then posting these slurs.\" In a statement, Aluko said social media was a \"cesspit\" where \"too many people feel they can say things to others they wouldn't dream of saying in real life under the guise of freedom of speech\". \"This is a reminder that actions online do not come without consequences,\" she said. \"The messages directed at me, Lucy Ward and Jeremy Vine by Joey Barton were deeply distressing and had a real damaging impact on my life and career. I am glad that justice has been served.\""
    },
    {
        "title": "Six police officers face misconduct probe after three people died in crash in Wales",
        "description": "Six police officers will face disciplinary proceedings after a crash in which three people died.",
        "url": "https://news.sky.com/story/six-police-officers-face-misconduct-probe-after-three-people-died-in-crash-in-wales-13465809",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-cardiff-car-crash-st-mellons_6079938.jpg?20230306112559",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-07 14:13:00",
        "Headline": "Eve Smith, Darcy Ross and Rafel Jeanne were found dead at the scene in Cardiff in 2023.",
        "Content": "Six police officers will face disciplinary proceedings after a crash in which three people died. Eve Smith and Darcy Ross, both 21, and Rafel Jeanne, 24, were found dead at the scene of the incident in the St Mellons area of Cardiff, South Wales, in March 2023. Passengers Sophie Russon, then 20, and Shane Loughlin, then 32, were also found with the Volkswagen Tiguan they had been travelling in. It was almost 48 hours after they were all last seen. Now the Independent Office for Police Conduct (IOPC) has determined that six officers should face disciplinary proceedings. Gwent Police says it fully co-operated with the probe relating to the fatal accident. The decision was made after examining Gwent Police's response to missing person reports made by family members, assessing if they were appropriately risk-assessed, reviewed and resourced. \n                  Four out of five drivers worried about dazzling headlights in the dark, survey shows\n                 \n                  Drivers urged to keep sunglasses in their cars after clocks go back\n                 \n                  Roadwork levels hit record highs – as expert partially blames Boris Johnson\n                 Derrick Campbell, director of the IOPC, said: \"Our thoughts and sympathies remain with the young people who tragically lost their lives, those who were left seriously injured and everyone affected by this incident. \"This investigation has been complex and resource intensive, but it is important for public confidence in policing that this tragic incident was subject to thorough and independent scrutiny. \"It will now be for a police disciplinary panel, arranged by Gwent Police, to consider the evidence and reach a decision based on all the available information.\" The fatal collision is believed to have happened at about 2am on 4 March, with Gwent Police receiving the first missing persons report for the group at about 7.30pm that day. The group were discovered just after midnight on 6 March, 46 hours after their last contact. An initial inquest hearing into the deaths of Mr Jeanne, Ms Ross and Ms Smith heard they were declared dead at the scene. Revealing its decision, the IOPC determined that a police sergeant has a case to answer for gross misconduct for their supervision of the missing persons enquiry. It was further determined that another police sergeant has a case to answer for misconduct, after allegedly failing to review all available information at the time of conducting a risk assessment for the missing persons. Read more:Probe into fatal Cardiff crash 'close to concluding'Cardiff crash: Man who found car was victim's best friend Four police constables were also found to have cases to answer. One allegedly failed to carry out basic enquiries, including not recording and sharing that information with their supervisor, in a case of gross misconduct. Two more are accused of gross misconduct after allegedly failing to conduct house searches, and giving dishonest accounts to their supervisor and IOPC investigators. According to the IOPC, one of the two police constables was also criminally investigated, but there was insufficient evidence to charge them with misconduct in a public office and perverting the course of justice. More than 30 complaints were made by victims' families regarding the actions and decisions made by Gwent Police and South Wales Police. A spokesperson for the IOPC said: \"We determined that for more than half, the service provided was unacceptable, with recommendations for several officers and staff to take part in the reflective practice review process (RPRP).\" Deputy Chief Constable Nicky Brain of Gwent Police said: \"Our thoughts and condolences continue to be with the family and friends of Darcy, Eve and Rafel who tragically lost their lives, and those who sustained injuries that night. \"We acknowledge the impact that this investigation has had on them and understand how important the findings of the IOPC will be to all those affected and the wider community. \"We have fully co-operated with the IOPC in their investigation. It's important that these matters were investigated thoroughly in an open and transparent manner. \"We will now start the process to hold the relevant misconduct hearings and misconduct meetings.\""
    },
    {
        "title": "Madeleine McCann's parents respond after harassment conviction of woman who claimed to be their daughter",
        "description": "The parents of Madeleine McCann have said \"we take no pleasure in the result\" after a woman who claimed to be their missing daughter was found guilty of harassing them.",
        "url": "https://news.sky.com/story/woman-who-claimed-to-be-madeleine-mccann-found-guilty-of-harassing-missing-toddlers-parents-13464212",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-julia-wandelt-madeleine-mccann_7044386.jpg?20251006193949",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-11-07 00:01:00",
        "Headline": "Police told Julia Wandelt - who was cleared of stalking the couple - she was not Madeleine and ordered her not to approach her family, but she ignored the warning. She turned up at the McCanns' home and sent sinister letters and messages repeatedly begging for a DNA test.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n  The parents of Madeleine McCann have said \"we take no pleasure in the result\" after a woman who claimed to be their missing daughter was found guilty of harassing them. After the conviction of Polish national Julia Wandelt, Kate and Gerry McCann said: \"Like most people, we did not want to go through a court process and only wanted the harassment to stop.\" Wandelt, 24, was cleared of stalking the couple. Trial judge Mrs Justice Cutts made Wandelt the subject of a restraining order against the McCanns because she posed a \"significant risk of harassment\" towards the couple in the future. The judge told Wandelt her \"pestering\" and \"badgering\" of the McCanns was \"unwarranted\" and \"unkind\". She said: \"An order is necessary in this case for the sake of the McCanns. Even when giving evidence you did not accept you were not Madeleine.\" Wandelt was sentenced to six months' imprisonment - which the judge said she had already served in custody since her arrest in February. \"It's not for me to say that you could be released at this point, notwithstanding that you have served your sentence,\" the judge said. \"A notice of deportation has been served on you and it's a matter for the secretary of state as to how things proceed.\" Born three years after Madeleine, Wandelt said she suspected she had been abducted and brought up by a couple who were not her real parents. She was having mental health issues at the time and had been abused by an elderly relative. The relative looked like an artist's drawing of a man who was once a suspect in the Madeleine case, which she stumbled across during internet research on missing children. She went to Los Angeles and told a US TV chat show audience: \"I believe I am Madeleine McCann.\" Madeleine was nearly four when she vanished from the family's rented holiday apartment in Praia da Luz, Portugal, in May 2007. She had been left sleeping with her younger twin siblings, Sean and Amelia, while her parents dined nearby with friends, making intermittent checks on the children. Madeleine is the world's most famous missing child - the subject of three international police investigations that have failed to find any trace of her. Wandelt claimed to have a blemish in the iris of her right eye, like Madeleine's, and to resemble aged-progressed images of her. Over three years, she attracted half a million followers on her Instagram account, iammadeleinemccan, and posted her claims on TikTok. Police told her she was not Madeleine and ordered her not to approach her family, but she ignored the warning. She turned up at the McCanns' home and sent sinister letters and messages repeatedly begging for a DNA test. The McCanns and their children gave evidence in the five-week trial at Leicester Crown Court, describing the upset Wandelt had caused them. The court heard Wandelt claimed to have memories, induced by hypnosis sessions, of being abducted and of living with the McCanns as a child, including feeding Madeleine's brother and playing ring-a-ring-a-roses. Wandelt called and messaged Mrs McCann more than 60 times in one day on 13 April last year, claiming to have a memory of the mother stroking her head. When Wandelt was arrested earlier this year, a DNA test proved she was not Madeleine. In the witness box, Wandelt denied her claims were driven by a desire for money or fame. She said she was not a liar and never intended to cause the McCanns and their children harm. The restraining order bans Wandelt from contacting Mr and Mrs McCann and their children either directly or indirectly, entering Leicestershire or publishing or broadcasting any information relating to the family until another order is made. Her co-defendant, Karen Spragg, 61, from Cardiff, was found not guilty of stalking and harassment. Spragg was made subject to the same restrictions, but her restraining order was imposed for a period of five years."
    },
    {
        "title": "Soldiers hospitalised yet again after riding around in army's problem-plagued vehicle",
        "description": "Soldiers had to go to hospital this summer because of hearing and other issues after trialling the British Army's Ajax armoured vehicle, raising fresh fears about the problem-plagued platform.",
        "url": "https://news.sky.com/story/soldiers-hospitalised-yet-again-after-riding-around-in-armys-problem-plagued-vehicle-13465828",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ajax-army-fighting-vehicle_7073720.jpg?20251106124425",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-07 14:50:00",
        "Headline": "The Ministry of Defence confirmed a \"small number\" of troops had reported noise and vibration concerns following trials on three variants of the 40-tonne, tracked vehicle.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  Soldiers had to go to hospital this summer because of hearing and other issues after trialling the British Army's Ajax armoured vehicle, raising fresh fears about the problem-plagued platform. The Ministry of Defence confirmed that a \"small number\" of troops had reported noise and vibration concerns following trials on three variants of the 40-tonne, tracked vehicle. A spokesperson said an investigation was carried out and \"no systemic issues were found\". However, sources signalled that worries remain over the safety of personnel who are required to operate for long hours inside the army's new war-fighting machine. \"Soldiers are still being hurt,\" one source said. The revelation comes after Luke Pollard, the defence procurement minister, insisted that the platform - which was this week finally declared ready for operations, eight years behind schedule - is safe to use and historical concerns about hearing being harmed were \"firmly in the past\". \"We would not be putting it in the hands of our armed forces, if it were not safe,\" he told reporters on Wednesday during a trip to a sprawling factory in Merthyr Tydfil, South Wales, where the vehicles, made by the US company General Dynamics, are being assembled. \n                  Expensive, noisy and delayed - but is the Army's new fighting vehicle any good?\n                 \n                  Ex-sergeant major jailed for sexually assaulting teenage soldier Jaysley Beck\n                 \n                  British troops deployed to Israel to 'monitor Gaza ceasefire' after US request\n                 \"I've been reassured from the top of the army down to the folks that work on the platform that it is safe, and those lessons have been learned,\" he said. The UK hopes to export Ajax vehicles - which cost about £10m - to other countries. Read more: Is the Army's new fighting vehicle any good? Any suggestion that the platform is still causing harm to soldiers would be a serious blow to such ambitions. While a big, tracked vehicle like Ajax - which is as heavy as a Russian tank - is bound to generate noise and vibrations, the army has been criticised in the past for failing to alert ministers to concerns about the impact on troops of exposure to such sounds and jolts. An internal review published in 2021 found that senior soldiers and Ministry of Defence officials had known for up to two years that earlier faults with the Ajax vehicle had been putting troops at risk of harm, but they failed to act. The health and safety report revealed that issues such as potential hearing damage had first been raised in December 2018, but trials were not suspended until November 2020. At that time, more than 300 soldiers were offered hearing tests, with 17 still under specialist care as of December 2021. The scandal put a spotlight on the programme when trials resumed two years later. By then, mitigations had been put in place to protect the troops that have to operate the machine, including additional ear protection and more cushioning on the seating. However, Francis Tusa, a leading defence journalist who writes for the specialist online publication Defence Eye, said he does not believe that the fundamental issue of too much noise and vibration was ever resolved. \"They are making the best out of a bad job,\" he told Sky News. Defence Eye was the first to reveal that troops had again experienced hearing and motion sickness problems during the summer trials. \"A lot of people threw up,\" Tusa said, adding he had been told about half a dozen service personnel went to hospital for checks. The Ministry of Defence spokesperson said: \"Safety of our personnel is a top priority. Ajax has been through rigorous trials and an assured safety process, and the evidence shows it is safe to operate. \"Where concerns were raised over the summer, these were investigated by a safety team and no systemic issues were found. All armoured vehicles produce noise and vibration - we continue to ensure these do not exceed statutory limits.\" Out of the \"small number\" of soldiers who raised noise and vibration concerns, some attended a military medical centre. Those affected had been conducting trials on the main Ajax variant of the vehicle, which is designed for reconnaissance and strike operations, as well as the Ares model, which is being used to carry troops - potentially a crucial role. The other affected version was the Athena model, used as a command hub to relay information and orders to and from other units in a fight. It is claimed that the Ajax vehicle does not produce any more noise than the army's existing tracked vehicles, which comprise the Challenger 2 tank and the Warrior fighting vehicle. Read more from Sky News:Prisoners charged with murder of child killerScores injured after multiple explosions hit mosque The £5.5bn Ajax programme is delivering the army's first armoured fighting vehicles in almost three decades after previous projects were scrapped. The service is in desperate need of new kit to replace much older models that came into service half a century ago. However, the threats on the battlefield have transformed since the Ajax contract was first signed more than 15 years ago. It means as well as hearing concerns, there are also worries about how such a large, heavy and noisy vehicle will be used in a combat zone where it would be an easy target for drones."
    },
    {
        "title": "What could Elon Musk do with $1trn?",
        "description": "Elon&#160;Musk&#160;could&#160;be&#160;on&#160;track&#160;for&#160;a&#160;$1trn pay&#160;packet.",
        "url": "https://news.sky.com/story/what-could-elon-musk-do-with-1trn-13465758",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-07 12:33:00",
        "Headline": "We have drilled down into the numbers and examined what you can do with a trillion dollars (£761,910,000,000) and it turns out, quite a lot.",
        "Content": " Elon Musk could be on track for a $1trn pay packet. Tesla shareholders have approved the whopping financial package for the CEO - who's already worth an estimated $491bn - if he hits a series of ambitious targets over the next 10 years. But that $1trn figure (or £761,910,000,000) - which is both one thousand billion and one million million - is almost impossible to imagine for most people. Even so, we have drilled down into the numbers and examined what you can do with a trillion US dollars - and it turns out, quite a lot.  Show me the money Laid end to end, a trillion one-dollar bills would cover a distance of approximately 156 billion metres. \n                  Elon Musk's $1trn pay package approved by Tesla\n                 \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 That could wrap around the equator 3,890 times, easily reach the sun from Earth (around 149.6 million km) or loop from Earth to the moon 405 times. That many one-dollar notes could cover a massive area (roughly 10,339 km squared), meaning you could blanket nearly all of Lebanon or Jamaica in bills. Spend it on sport You could splash out on virtually all of the world's major sporting leagues. The clubs which make up the Premier League are relatively cheap ($30bn), and even when snapping up the UEFA Champions League clubs and the big five top divisions of Spain, Italy, Germany, and France, there's still $858bn left in the kitty. The four major US sports leagues for ice hockey, baseball, basketball, and American football (NFL, NBA, MLB and NHL) have a rough valuation of $544bn, according to Sportico. But then add the IPL cricket league ($120bn) and F1 ($23.1bn) and Musk still has change from an estimated total spend of $829.7bn. Take over Tesla's rivals He could buy up the top 15 largest publicly traded automakers (excluding Tesla) by market capitalisation. They would include firms like Japan's Toyota ($275bn), Chinese automaker BYD ($120bn), and luxury brands like Ferrari ($81bn) and Mercedes-Benz ($62bn), as well as BMW ($52bn), Volkswagen ($50bn) and Ford ($48bn). But there would still be a little change left over; the total bill would be an eye-watering $992bn. Buy up San Diego He could buy up every single residential property in San Diego County - valued at a total of $1trn. Seattle is just slightly out of reach at $1.1trn, according to recent data from real estate firm Zillow. But if he wanted to buy big - there is always Tennessee. The total value of homes in the US state is estimated at $957bn. Or there is Maryland, which at $1.01trn could be bought if he can find a little more cash behind the sofa. Sadly, he would struggle to scoop up London's entire housing stock, which in February was valued at just under £2trn ($2.53trn), according to agents Savills. Cities like New York ($4.6trn) and Los Angeles ($3.9trn) are also not within his budget, hosting America's most expensive residential markets. Do something charitable? There is always the possibility Musk could follow in the footsteps of Microsoft founder Bill Gates, who intends to give away 99% of his vast fortune over the next 20 years. He could give every single man, woman, and child in the US a share of his cash pile. They would receive approximately $2,917.32 (£2,223.29), based on a population estimate of 342.7 million. Although it would be roughly $14,348.79 (£10,935.20) for every person (roughly 69.6 million) in the UK. If he wanted to give the entire globe an early Christmas present, then based on the rough world population estimate of 8.2 billion, everyone would receive $121.80 (£92.87). Pay off the credit card  With $1trn, he could instantly rewrite history and erase debt interest payments and the government debt from dozens of the world's sovereign nations. Or Musk could wipe out the debts of Singapore ($1trn) or South Korea ($0.99trn) in one go, according to figures from the International Monetary Fund's latest World Economic Outlook (Oct 2025). But when it comes to the biggest debt-laden countries, $1trn would not even touch the sides. The US has $38.3trn of government debt (just over one third of the total global debt pile) while the UK has a modest $4.1trn."
    },
    {
        "title": "COP's potential for change limited not by who turned up, but by the elephants not in the room",
        "description": "The COP climate summit in Belem opened with a diplomatic double-whammy.",
        "url": "https://news.sky.com/story/cops-potential-for-change-limited-not-by-who-turned-up-but-by-the-elephants-not-in-the-room-13466030",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-lula-da-silva_7074146.jpg?20251106222739",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-07 19:31:00",
        "Headline": "The leaders of China, the US and India - the world's three largest contributors to climate change - are not at the summit in Brazil, meaning significant progress on addressing climate change will be even harder this time.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  The COP climate summit in Belem opened with a diplomatic double-whammy. The Prince of Wales and Sir Keir Starmer reaffirmed the UK's commitment to fighting climate change and urged the rest of the world to do so, too. But as the tropical rain beat down on the tarpaulin roof of this temporary summit venue, it's hard not to feel the air going out of the process.  Sir Keir and Prince William's presence doesn't make up for the geopolitical weight of the elephants not in the room. The leaders of China, the US and India - the world's three largest contributors to climate change - are no-shows. Donald Trump's highly-publicised decision to withdraw America from the UN climate talks is a blow. Before Mr Trump, America - the world's largest economy, largest oil and gas producer, and major market for renewable energy - had serious deal-making power here. \n                  Prince William plays volleyball and football ahead of Brazil climate events\n                 \n                  Prince William to attend Earthshot Prize and COP30 in Brazil - with his team hoping to refocus attention away from Andrew\n                 \n                  Families mourn dozens killed during Rio de Janeiro's 'biggest' raid against drugs gang\n                 Having formally withdrawn, there is no US delegation. And, as far as I can tell, any US broadcasters either, so for Americans, this meeting may as well not be happening at all.  Without the US, things will be harder. But does that mean the process is doomed? The leaders of China and India may be absent but they've sent high-level delegations. Read more on COP 30:Is net zero dead?Why is COP 30 controversial? China is represented by vice-premier Ding Xuexiang, the country's most high-ranking politician after President Xi himself. And, while China and India might not be big on eco-messaging, between them they are busy driving the most rapid shift away from fossil fuels towards wind, solar and nuclear power the world has ever seen. What's more, the real work at these summits isn't done by heads of state, but experienced sherpas, some of whom have trodden the nylon carpeted corridors of COP for 30 years.  It's reasonable to ask what they've achieved in all that time. The commitments of the Paris agreement of a decade ago have been missed by a wide margin. The world is about to blow past 1.5 degrees of warming and almost certainly exceed two degrees as well. But when the Paris deal was signed, the trajectory was for four degrees of warming. There are good COPs and bad COPs, but the world is undoubtedly a safer place now than it would have been without them."
    },
    {
        "title": "Ex-British soldier contests extradition over alleged murder of Kenyan woman",
        "description": "A former British soldier wanted by Kenyan authorities over an alleged 2012 murder has said he does not consent to extradition.",
        "url": "https://news.sky.com/story/ex-british-soldier-contests-extradition-over-murder-of-kenyan-woman-13465921",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-agnes-wanjiru-kenya_7049490.jpg?20251013061155",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-07 16:58:00",
        "Headline": "Robert James Purkiss, 38,  is accused of murdering 21-year-old Agnes Wanjiru in Nanyuki, Kenya, in 2012. ",
        "Content": " A former British soldier wanted by Kenyan authorities over an alleged 2012 murder has said he does not consent to extradition. Robert James Purkiss, 38, appeared at Westminster Magistrates' Court on Friday as extradition proceedings began. Purkiss is accused of murdering 21-year-old Agnes Wanjiru in the town of Nanyuki, Kenya, in 2012. Her body was found in a septic tank. District Judge Briony Clarke told the former soldier: \"You are sought by Kenya to face this allegation of murder. \"You face a very serious allegation.\" Home Office barrister Joel Smith KC said Purkiss had \"confessed\" to the \"brutal murder\".  The court heard that in the days after the alleged murder, there were \"rumours on the camp that the defendant had killed someone\". \n                  Ukraine war latest: Trump explains why he cancelled Putin meeting as he hosts Orban - who says Ukraine need 'miracle'\n                 \n                  What could Elon Musk do with $1trn?\n                 \n                  COP's potential for change limited not by who turned up, but by the elephants not in the room\n                 In an alleged confession, Purkiss is said to have told a colleague, \"it was sex that went wrong\". David Josse KC, representing the former soldier, said he \"vehemently denies\" the charge. Mr Smith said: \"There is evidence that when the soldiers were given time off, they would go into town, drink heavily, and they would pay local women for sex.\" Read more from Sky News:Ex-footballer Joey Barton guilty over social media postsTeenager sentenced to five years for causing death of a friend \"Many of them, including this defendant, ended up in the Lions Court Hotel,\" he said. \"The last time Ms Wanjiru was seen alive, she was leaving the hotel with a soldier. \"As she left, she told a friend in her local language that she was going to 'hustle for her daughter'.\" Her body was found weeks later in the hotel grounds in a septic tank, Mr Smith said. The body was \"significantly decomposed\" and a post-mortem examination identified a 2cm stab wound to the lower abdomen and a collapsed lung, he said. The family of Ms Wanjiru, through their spokesperson Esther Njoki, also her neice, said they were unhappy with the progress of the judicial process. \"We urge the United Kingdom to expedite the extradition on their end so that there are no more delays in this case.\" In September, a UK government spokesperson said: \"Our thoughts remain with the family of Agnes Wanjiru, and we remain absolutely committed to helping them secure justice.\" Purkiss has been remanded in custody until his next court appearance on 14 November."
    },
    {
        "title": "Prince Harry apologises to Canada for wearing LA Dodgers cap at World Series",
        "description": "Prince Harry has apologised to Canada for wearing a Los Angeles Dodgers cap while attending a World Series game against the Toronto Blue Jays.",
        "url": "https://news.sky.com/story/prince-harry-apologises-to-canada-for-wearing-la-dodgers-cap-at-world-series-13465596",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-harry-meghan_7074462.jpg?20251107071501",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-07 07:13:00",
        "Headline": "Duke of Sussex told Canadian broadcaster CTV that he wore the Dodgers merchandise \"under duress\". \"When you're missing a lot of hair on top, and you're sitting under floodlights, you'll take any hat that's available,\" he joked.",
        "Content": "Prince Harry has apologised to Canada for wearing a Los Angeles Dodgers cap while attending a World Series game against the Toronto Blue Jays. The Duke of Sussex and his wife, Meghan, were pictured at the baseball game last Tuesday, which Toronto ultimately lost to the Dodgers in a seventh-game decider on Sunday. The prince joked to Canadian broadcaster CTV that he wore the Dodgers merchandise \"under duress\". He said it felt like \"the polite thing to do\" after being invited to the dugout by the team's owner. \"Firstly, I would like to apologise to Canada for wearing it,\" he said. \"Secondly, I was under duress. There wasn't much choice.\" \"When you're missing a lot of hair on top, and you're sitting under floodlights, you'll take any hat that's available,\" he joked. \"Game five, game six, game seven, I was Blue Jays throughout. Now that I've admitted that, it's going to be pretty hard for me to return back to Los Angeles.\" Harry, who is in Canada for Remembrance Week events, conducted the interview wearing a Toronto Blue Jays cap. He added he was \"devastated\" at the Blue Jays' defeat. Read more from Sky News:Manhunt under way for another foreign national offenderA year on from Trump's win, an untold story emerges The royal couple, who met in 2016 and married in 2018, moved to California in 2020 - after initially setting up home in Canada. They live in Montecito with their children Archie, six, and Lilibet, four. Harry's father, the King, is the head of state of Canada - a Commonwealth nation. Meghan has previously shown her support for the Blue Jays, a nod to her former home city. The former actress lived in Toronto while filming the legal drama Suits. She appeared in more than 100 episodes. She and Harry also spent time together there during the early stages of their relationship."
    },
    {
        "title": "Putin's right-hand man made him look weak - it may have cost him his seat at Kremlin's top table",
        "description": "In Soviet times, Western observers would scrutinise video footage of state occasions, like military parades on Red Square, to try to learn more about Kremlin hierarchy.",
        "url": "https://news.sky.com/story/where-is-sergei-lavrov-questions-swirl-over-putin8217s-veteran-foreign-minister-13465965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lavrov-putin_7074599.jpg?20251107210618",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-07 18:09:00",
        "Headline": "The heavyweight diplomat's absence from a key Kremlin meeting and the G20 delegation has fuelled speculation that he has fallen out of favour with President Vladimir Putin.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n In Soviet times, Western observers would scrutinise video footage of state occasions, like military parades on Red Square, to try to learn more about Kremlin hierarchy. Who was positioned closest to the leader? What did the body language say? Which officials were in and out of favour? In some ways, not much has changed. The footage present-day Kremlinologists are currently pouring over is from Wednesday's landmark meeting of Russia's Security Council, in which Vladimir Putin told his top officials to start drafting proposals for a possible nuclear weapons test.  It was an important moment. Not one you'd expect a trusted lieutenant to miss. But Sergei Lavrov, Russia's veteran foreign minister, was conspicuously absent - the only permanent member of the Council not present. According to the Russian business daily, Kommersant, his absence was \"coordinated\". \n                  Briton who volunteered as spy for Russia jailed\n                 \n                  Russian drones: The tiny, kamikaze killing machines being raced rather than used to hunt targets\n                 \n                  As Russia marks Stalin's political repression, some fear the country's dark history could repeat itself\n                 That episode alone would have been enough to raise eyebrows. But coupled with the selection of a more junior official to lead the Russian delegation at the upcoming G20 summit (a role Lavrov has filled in recent years) - well, that's when questions get asked, namely: Has Moscow's top diplomat been sidelined? The question has grown loud enough to force the Kremlin into a denial, but it's done little to quell speculation that Lavrov has fallen out of favour. Rumours of a rift have been mounting since Donald Trump called off a planned summit with Putin in Budapest last month, following a phone call between Lavrov and US secretary of state Marco Rubio. According to the Financial Times, it was Lavrov's uncompromising stance that prompted the White House to put the summit on ice. Conversations I had with diplomatic sources here at the time revealed a belief that Lavrov had either dropped the ball or gone off-script. Whether it was by accident or by design, his diplomacy (or lack of it) torpedoed the summit and seemingly set back a US-Russia rapprochement.  That would've angered Putin, who is keen to engage with Washington, not only on Ukraine but on other issues, like nuclear arms control. More importantly, perhaps, it made the Russian president appear weak - unable to control his foreign minister. And Putin is not a man who likes to be undermined. Football fans will be familiar with Sir Alex Ferguson's golden rule of management: Never let a player grow bigger than the club. Putin operates in a similar fashion. Loyalty is valued extremely highly. If Lavrov has indeed been sidelined, it would be a very significant moment indeed. The 75-year-old has been the face of Russian diplomacy for more than two decades and effectively Putin's right-hand man for most of the Kremlin leader's rule. Known for his abrasive style and acerbic putdowns, Lavrov has also been a vociferous cheerleader for Russia's invasion of Ukraine. At the Putin-Trump summit in Alaska, he arrived wearing a jumper emblazoned with the initials \"CCCP\", the Russian letters for USSR. The apparent message: Ukraine still belongs to Moscow. And in the melee that immediately followed the presidents' press statements at the summit, I remember racing over to Lavrov as he was leaving and yelling a question to him through the line of security guards. He didn't even turn. Instead, he just shouted back: \"Who are you?\" It was typical of a diplomatic heavyweight, who's known for not pulling his punches. But has that uncompromising approach finally taken its toll?"
    },
    {
        "title": "Initial report does not blame captain for Air India crash, court tells pilot's father",
        "description": "India's Supreme Court said the preliminary report into the Air India crash does&#160;not&#160;insinuate&#160;anything against the captain, but&#160;judges will consider a plea from the pilot's father for an independent investigation.",
        "url": "https://news.sky.com/story/initial-report-does-not-blame-captain-for-air-india-crash-court-tells-pilots-father-13465616",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ahmedabad-plane-crash_6944966.jpg?20250618101311",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-07 11:09:00",
        "Headline": "Pushkar Raj Sabharwal claims investigators have implied his son, Sumeet Sabharwal, cut the fuel supply to the plane's engine after take-off.",
        "Content": "India's Supreme Court said the preliminary report into the Air India crash does not insinuate anything against the captain, but judges will consider a plea from the pilot's father for an independent investigation. In June, Air India Flight 171 to London Gatwick struck a building shortly after take-off in Ahmedabad, killing 241 people on board, while a further 19 people died on the ground. Briton Viswashkumar Ramesh was the only passenger who walked away from the wreckage. In an interview with Sophy Ridge on the Mornings with Ridge and Frost programme, Mr Ramesh said he had been \"broken down\" by the trauma.  On Friday, Pushkar Raj Sabharwal, 91, called for the Supreme Court to order an investigation by a panel of aviation experts into the crash. A hearing to consider that plea is scheduled for 10 November. His son Sumeet Sabharwal was the captain on the flight and was in charge as the pilot-in-command, while Clive Kunder was the first officer flying the plane. Mr Sabharwal has called for an independent committee to examine the Boeing 787 Dreamliner crash, headed by a retired Supreme Court judge, and criticised the Aircraft Accident Investigation Bureau (AAIB). \n                  Only survivor of Air India Flight 171 crash tells Sky News the trauma 'broke' him\n                 \n                  Air India crash: Families prepared for court fight over disaster which left 260 dead\n                 \n                  How Air India crash victim's grieving family discovered remains mix-up\n                 Weeks earlier, he said two officials from the AAIB visited him and had implied that his son cut the fuel to the plane's engine after take-off. The government has denied such accusations, calling the investigation \"very clean\" and \"very thorough\". According to a preliminary report, published by the AAIB in July, switches in the cockpit that controlled fuel were moved to a \"CUTOFF\" position. It added that, in an audio recording from the cockpit, one of the pilots is then heard asking the other why he \"cut off\". The other pilot responds that he did not do so. The 15-page report did not identify which comments were made by the flight's captain and which were made by the first officer. Both pilots were experienced, with around 19,000 flying hours between them, including more than 9,000 on the 787. Read more from Sky News:Crash families prepare for court fightTown still reeling from Air India crash A total of 241 people were on board the plane, including 53 UK citizens. Mr Ramesh has been offered a flat interim payment of £21,500 - a one-off sum given to a claimant in advance of reaching the end of a personal injury claim. Mr Ramesh, who lives in Leicester with his wife and their four-year-old son, told Sky News he is still suffering physical discomfort, dealing with knee, shoulder and back pain, along with burns to his left arm."
    },
    {
        "title": "At least 55 injured after multiple explosions hit mosque in Indonesia",
        "description": "At least 55 people have been injured after multiple explosions rocked a mosque at a school in Indonesia.",
        "url": "https://news.sky.com/story/at-least-55-injured-after-multiple-explosions-hit-mosque-in-indonesia-13465676",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-explosion-jakarta-mosque_7074588.jpg?20251107102742",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-07 10:20:00",
        "Headline": "Witnesses described hearing two blasts just as the sermon started at the mosque at a school in the capital Jakarta. Students and others ran out in panic as grey smoke filled the building.",
        "Content": "At least 55 people have been injured after multiple explosions rocked a mosque at a school in Indonesia. The blasts were heard in the Kelapa Gading neighbourhood of the Indonesian capital, Jakarta, during Friday prayers. Witnesses told local TV they heard two loud blasts around midday, just as the sermon started at the mosque. Students and others ran out in panic as grey smoke filled the building at SMA 27, a state high school within a navy compound. A 17-year-old has been identified as the \"suspected perpetrator\". Sufmi Dasco Ahmad, the country's deputy house speaker, said the suspect was undergoing surgery. At least 55 people, mostly students, were injured in the blasts, the city's police chief Asep Edi Suheri said. He said the cause of the explosions is not yet known but they came from near the mosque's loudspeaker. Most victims suffered injuries from glass shards, with multiple casualties taken to nearby hospitals. Some 20 students remain in hospital, three with serious injuries, the police chief said. A bomb squad deployed at the scene found toy rifles and a toy gun nearby, he added. Read more from Sky News:China dominates renewables - this project shows whyOne year on from Trump's win, an untold story has emerged The police chief urged people to avoid speculating about the blasts before the police investigation is completed. \"Police are still investigating the scene to determine the cause of the blasts,\" he said. \"Let the authorities work first. We will convey whatever the results are to the public.\""
    },
    {
        "title": "One year on from Donald Trump's election win, an untold story has emerged",
        "description": "It's a year since the US put Donald Trump back in the White House and I've spent this anniversary week in Florida and in Pennsylvania - two worlds in one country where I found two such contrasting snapshots of Trump's America.",
        "url": "https://news.sky.com/story/when-trump-was-elected-a-year-ago-he-vowed-to-make-america-affordable-again-hows-he-done-13465549",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-trump-in-florida_7074571.jpg?20251107095433",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-11-07 03:23:00",
        "Headline": "The president marked the election's anniversary with a speech to Florida's wealthy - but 1,000 miles away, many don't feel the \"greatest economy\" he talks about.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  It's a year since the US put Donald Trump back in the White House and I've spent this anniversary week in Florida and in Pennsylvania - two worlds in one country where I found two such contrasting snapshots of Trump's America. There are many ways to reflect on the successes and failures of the past year. Different issues matter to different people. But the thing which matters to all Americans is money. The cost of living was a key factor in Donald Trump's victory. He promised to make the country more affordable again. So: how's he done? On Wednesday, exactly a year since Americans went to the polls, the president was in Miami. He had picked this city and a particular crowd for his anniversary speech. I was in the audience at the America Business Forum as he told wealthy entrepreneurs and investors how great life is now. \"One year ago we were a dead country, now we're considered the hottest country in the world,\" he told them to cheers. \"Record high, record high, record high…\" The vibe was glitzy and wealthy. These days, these are his voters; his crowd. \"After just one year since that glorious election, I'm thrilled to say that America is back, America is back bigger, better, stronger than ever,\" he said. \"We've done really well. I think it's the best nine months, they say, of any president. And I really believe that if we can have a few more nine months like this, you'd be very happy. You'd be very satisfied.\" There was little question here that people are happy. \"Trump's been a good thing?\" I asked one attendee, Liz Ciborowski. \"Yes. He has really pushed for a lot of issues that are really important for our economy,\" she said. \"I'm an investor,\" said another, Andrea. \"I'm a happy girl. I'm doing good,\" she said with a laugh. A year on from his historic victory, the president was, notably, not with the grassroots folk in the places that propelled him back to the White House. He had chosen to be among business leaders in Miami. Safe crowd, safe state, safe space. But there was just one hint in his speech which seemed to acknowledge the reality that should be a concern for him. \"We have the greatest economy right now,\" he said, adding: \"A lot of people don't see that.\" That is the crux of it: many people beyond the fortunate here don't feel the \"greatest economy\" he talks about. And many of those people are in the places that delivered Trump his victory. That's the untold story of the past year. A thousand miles to the north of Miami is another America - another world. Steelton, Pennsylvania sits in one of Donald Trump's heartlands. But it is not feeling the beat of his greatest economy. Not at all. At the local steel union, I was invited to attend a meeting of a group of steel workers. It was an intimate glimpse into a hard, life-changing moment for the men. The steel plant is shutting down and they were listening to their union representative explaining what happens next. The conversation was punctuated with all the words no one wants to hear: laid off, severance, redundancy. \"For over 100 years, my family has been here working. And I was planning on possibly one day having my son join me, but I don't know if that's a possibility now,\" former employee David Myers told me. \"And...\" he paused. \"Sorry I'm getting a little emotional about it. We've been supplying America with railroad tracks for over a century and a half, and it feels weird for it to be coming to an end.\" Cleveland Cliffs Steelton plant is closing because of weakening demand, according to its owners. Their stock price has since surged. Good news for the Miami crowd, probably. It is the irony between the two Americas. Read more US news:JD Vance's reaction to a big 24 hours in US politics is tellingNew York's new mayor shouldn't expect any easy wins Down at the shuttered plant, it's empty, eerie and depressing. It is certainly not the image or the vision that Donald Trump imagined for his America. Pennsylvania, remember, was key to propelling Trump back to the White House. In this swing state, they swung to his promises - factories reopened and life more affordable. Up the road, conversations outside the town's government-subsidised homes framed the challenges here so starkly. \"How much help does the community need?\" I asked a man running the local food bank. \"As much as they can get. I mean, help is a four-letter word but it has a big meaning. So help!\" community organiser Elder Melvin Watts said. I asked if he thought things were worse than a year ago. \"Yes sir. I believe they needed it then and they need it that much more now. You know it's not hard to figure that out. The cost of living is high.\" Nearby, I met a woman called Sandra. \"It's been harder, and I'm a hard-working woman,\" she told me. \"I don't get no food stamps, I don't get none of that. You've got to take care of them bills, eat a little bit or don't have the lights on. Then you have people like Mr Melvin, he's been out here for years, serving the community.\" Inside Mr Melvin's food bank, a moment then unfolded that cut to the heart of the need here. A woman called Geraldine Santiago arrived, distressed, emotional and then overwhelmed by the boxes of food available to her. \"We'll help you…\" Mr Melvin said as she sobbed. Geraldine is one of 40 million Americans now not receiving the full nutritional assistance programme, known as SNAP, and usually provided by the federal government. SNAP benefits have stopped because the government remains shut down amid political deadlock. I watched Geraldine's rollercoaster emotions spilling out - from desperation to gratitude at this moment of respite. She left with a car boot full of food. A year on from his victory, Donald Trump continues to frame himself as the \"America First\" president and now with an economy transformed. But parts of America feel far, far away."
    },
    {
        "title": "One year on from Donald Trump's election win, an untold story has emerged",
        "description": "It's a year since the US put Donald Trump back in the White House and I've spent this anniversary week in Florida and in Pennsylvania - two worlds in one country where I found two such contrasting snapshots of Trump's America.",
        "url": "https://news.sky.com/story/when-trump-was-elected-a-year-ago-he-vowed-to-make-america-affordable-again-hows-he-done-13465549",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-trump-in-florida_7074571.jpg?20251107095433",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-11-07 03:23:00",
        "Headline": "The president marked the election's anniversary with a speech to Florida's wealthy - but 1,000 miles away, many don't feel the \"greatest economy\" he talks about.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  It's a year since the US put Donald Trump back in the White House and I've spent this anniversary week in Florida and in Pennsylvania - two worlds in one country where I found two such contrasting snapshots of Trump's America. There are many ways to reflect on the successes and failures of the past year. Different issues matter to different people. But the thing which matters to all Americans is money. The cost of living was a key factor in Donald Trump's victory. He promised to make the country more affordable again. So: how's he done? On Wednesday, exactly a year since Americans went to the polls, the president was in Miami. He had picked this city and a particular crowd for his anniversary speech. I was in the audience at the America Business Forum as he told wealthy entrepreneurs and investors how great life is now. \"One year ago we were a dead country, now we're considered the hottest country in the world,\" he told them to cheers. \"Record high, record high, record high…\" The vibe was glitzy and wealthy. These days, these are his voters; his crowd. \"After just one year since that glorious election, I'm thrilled to say that America is back, America is back bigger, better, stronger than ever,\" he said. \"We've done really well. I think it's the best nine months, they say, of any president. And I really believe that if we can have a few more nine months like this, you'd be very happy. You'd be very satisfied.\" There was little question here that people are happy. \"Trump's been a good thing?\" I asked one attendee, Liz Ciborowski. \"Yes. He has really pushed for a lot of issues that are really important for our economy,\" she said. \"I'm an investor,\" said another, Andrea. \"I'm a happy girl. I'm doing good,\" she said with a laugh. A year on from his historic victory, the president was, notably, not with the grassroots folk in the places that propelled him back to the White House. He had chosen to be among business leaders in Miami. Safe crowd, safe state, safe space. But there was just one hint in his speech which seemed to acknowledge the reality that should be a concern for him. \"We have the greatest economy right now,\" he said, adding: \"A lot of people don't see that.\" That is the crux of it: many people beyond the fortunate here don't feel the \"greatest economy\" he talks about. And many of those people are in the places that delivered Trump his victory. That's the untold story of the past year. A thousand miles to the north of Miami is another America - another world. Steelton, Pennsylvania sits in one of Donald Trump's heartlands. But it is not feeling the beat of his greatest economy. Not at all. At the local steel union, I was invited to attend a meeting of a group of steel workers. It was an intimate glimpse into a hard, life-changing moment for the men. The steel plant is shutting down and they were listening to their union representative explaining what happens next. The conversation was punctuated with all the words no one wants to hear: laid off, severance, redundancy. \"For over 100 years, my family has been here working. And I was planning on possibly one day having my son join me, but I don't know if that's a possibility now,\" former employee David Myers told me. \"And...\" he paused. \"Sorry I'm getting a little emotional about it. We've been supplying America with railroad tracks for over a century and a half, and it feels weird for it to be coming to an end.\" Cleveland Cliffs Steelton plant is closing because of weakening demand, according to its owners. Their stock price has since surged. Good news for the Miami crowd, probably. It is the irony between the two Americas. Read more US news:JD Vance's reaction to a big 24 hours in US politics is tellingNew York's new mayor shouldn't expect any easy wins Down at the shuttered plant, it's empty, eerie and depressing. It is certainly not the image or the vision that Donald Trump imagined for his America. Pennsylvania, remember, was key to propelling Trump back to the White House. In this swing state, they swung to his promises - factories reopened and life more affordable. Up the road, conversations outside the town's government-subsidised homes framed the challenges here so starkly. \"How much help does the community need?\" I asked a man running the local food bank. \"As much as they can get. I mean, help is a four-letter word but it has a big meaning. So help!\" community organiser Elder Melvin Watts said. I asked if he thought things were worse than a year ago. \"Yes sir. I believe they needed it then and they need it that much more now. You know it's not hard to figure that out. The cost of living is high.\" Nearby, I met a woman called Sandra. \"It's been harder, and I'm a hard-working woman,\" she told me. \"I don't get no food stamps, I don't get none of that. You've got to take care of them bills, eat a little bit or don't have the lights on. Then you have people like Mr Melvin, he's been out here for years, serving the community.\" Inside Mr Melvin's food bank, a moment then unfolded that cut to the heart of the need here. A woman called Geraldine Santiago arrived, distressed, emotional and then overwhelmed by the boxes of food available to her. \"We'll help you…\" Mr Melvin said as she sobbed. Geraldine is one of 40 million Americans now not receiving the full nutritional assistance programme, known as SNAP, and usually provided by the federal government. SNAP benefits have stopped because the government remains shut down amid political deadlock. I watched Geraldine's rollercoaster emotions spilling out - from desperation to gratitude at this moment of respite. She left with a car boot full of food. A year on from his victory, Donald Trump continues to frame himself as the \"America First\" president and now with an economy transformed. But parts of America feel far, far away."
    },
    {
        "title": "What could Elon Musk do with $1trn?",
        "description": "Elon&#160;Musk&#160;could&#160;be&#160;on&#160;track&#160;for&#160;a&#160;$1trn pay&#160;packet.",
        "url": "https://news.sky.com/story/what-could-elon-musk-do-with-1trn-13465758",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-07 12:33:00",
        "Headline": "We have drilled down into the numbers and examined what you can do with a trillion dollars (£761,910,000,000) and it turns out, quite a lot.",
        "Content": " Elon Musk could be on track for a $1trn pay packet. Tesla shareholders have approved the whopping financial package for the CEO - who's already worth an estimated $491bn - if he hits a series of ambitious targets over the next 10 years. But that $1trn figure (or £761,910,000,000) - which is both one thousand billion and one million million - is almost impossible to imagine for most people. Even so, we have drilled down into the numbers and examined what you can do with a trillion US dollars - and it turns out, quite a lot.  Show me the money Laid end to end, a trillion one-dollar bills would cover a distance of approximately 156 billion metres. \n                  Elon Musk's $1trn pay package approved by Tesla\n                 \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 That could wrap around the equator 3,890 times, easily reach the sun from Earth (around 149.6 million km) or loop from Earth to the moon 405 times. That many one-dollar notes could cover a massive area (roughly 10,339 km squared), meaning you could blanket nearly all of Lebanon or Jamaica in bills. Spend it on sport You could splash out on virtually all of the world's major sporting leagues. The clubs which make up the Premier League are relatively cheap ($30bn), and even when snapping up the UEFA Champions League clubs and the big five top divisions of Spain, Italy, Germany, and France, there's still $858bn left in the kitty. The four major US sports leagues for ice hockey, baseball, basketball, and American football (NFL, NBA, MLB and NHL) have a rough valuation of $544bn, according to Sportico. But then add the IPL cricket league ($120bn) and F1 ($23.1bn) and Musk still has change from an estimated total spend of $829.7bn. Take over Tesla's rivals He could buy up the top 15 largest publicly traded automakers (excluding Tesla) by market capitalisation. They would include firms like Japan's Toyota ($275bn), Chinese automaker BYD ($120bn), and luxury brands like Ferrari ($81bn) and Mercedes-Benz ($62bn), as well as BMW ($52bn), Volkswagen ($50bn) and Ford ($48bn). But there would still be a little change left over; the total bill would be an eye-watering $992bn. Buy up San Diego He could buy up every single residential property in San Diego County - valued at a total of $1trn. Seattle is just slightly out of reach at $1.1trn, according to recent data from real estate firm Zillow. But if he wanted to buy big - there is always Tennessee. The total value of homes in the US state is estimated at $957bn. Or there is Maryland, which at $1.01trn could be bought if he can find a little more cash behind the sofa. Sadly, he would struggle to scoop up London's entire housing stock, which in February was valued at just under £2trn ($2.53trn), according to agents Savills. Cities like New York ($4.6trn) and Los Angeles ($3.9trn) are also not within his budget, hosting America's most expensive residential markets. Do something charitable? There is always the possibility Musk could follow in the footsteps of Microsoft founder Bill Gates, who intends to give away 99% of his vast fortune over the next 20 years. He could give every single man, woman, and child in the US a share of his cash pile. They would receive approximately $2,917.32 (£2,223.29), based on a population estimate of 342.7 million. Although it would be roughly $14,348.79 (£10,935.20) for every person (roughly 69.6 million) in the UK. If he wanted to give the entire globe an early Christmas present, then based on the rough world population estimate of 8.2 billion, everyone would receive $121.80 (£92.87). Pay off the credit card  With $1trn, he could instantly rewrite history and erase debt interest payments and the government debt from dozens of the world's sovereign nations. Or Musk could wipe out the debts of Singapore ($1trn) or South Korea ($0.99trn) in one go, according to figures from the International Monetary Fund's latest World Economic Outlook (Oct 2025). But when it comes to the biggest debt-laden countries, $1trn would not even touch the sides. The US has $38.3trn of government debt (just over one third of the total global debt pile) while the UK has a modest $4.1trn."
    },
    {
        "title": "Prince Harry apologises to Canada for wearing LA Dodgers cap at World Series",
        "description": "Prince Harry has apologised to Canada for wearing a Los Angeles Dodgers cap while attending a World Series game against the Toronto Blue Jays.",
        "url": "https://news.sky.com/story/prince-harry-apologises-to-canada-for-wearing-la-dodgers-cap-at-world-series-13465596",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-harry-meghan_7074462.jpg?20251107071501",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-07 07:13:00",
        "Headline": "Duke of Sussex told Canadian broadcaster CTV that he wore the Dodgers merchandise \"under duress\". \"When you're missing a lot of hair on top, and you're sitting under floodlights, you'll take any hat that's available,\" he joked.",
        "Content": "Prince Harry has apologised to Canada for wearing a Los Angeles Dodgers cap while attending a World Series game against the Toronto Blue Jays. The Duke of Sussex and his wife, Meghan, were pictured at the baseball game last Tuesday, which Toronto ultimately lost to the Dodgers in a seventh-game decider on Sunday. The prince joked to Canadian broadcaster CTV that he wore the Dodgers merchandise \"under duress\". He said it felt like \"the polite thing to do\" after being invited to the dugout by the team's owner. \"Firstly, I would like to apologise to Canada for wearing it,\" he said. \"Secondly, I was under duress. There wasn't much choice.\" \"When you're missing a lot of hair on top, and you're sitting under floodlights, you'll take any hat that's available,\" he joked. \"Game five, game six, game seven, I was Blue Jays throughout. Now that I've admitted that, it's going to be pretty hard for me to return back to Los Angeles.\" Harry, who is in Canada for Remembrance Week events, conducted the interview wearing a Toronto Blue Jays cap. He added he was \"devastated\" at the Blue Jays' defeat. Read more from Sky News:Manhunt under way for another foreign national offenderA year on from Trump's win, an untold story emerges The royal couple, who met in 2016 and married in 2018, moved to California in 2020 - after initially setting up home in Canada. They live in Montecito with their children Archie, six, and Lilibet, four. Harry's father, the King, is the head of state of Canada - a Commonwealth nation. Meghan has previously shown her support for the Blue Jays, a nod to her former home city. The former actress lived in Toronto while filming the legal drama Suits. She appeared in more than 100 episodes. She and Harry also spent time together there during the early stages of their relationship."
    },
    {
        "title": "Several people at Air Force One base fall ill after 'suspicious package' opened",
        "description": "Several people have fallen ill after a \"suspicious package\" containing white powder was opened at the home base for the presidential plane Air Force One, according to US media reports.",
        "url": "https://news.sky.com/story/several-people-at-air-force-one-base-fall-ill-after-suspicious-package-opened-13465677",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-malcolm-grow-medical-centre_7074562.jpg?20251107093835",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-07 10:18:00",
        "Headline": "Investigators are also assessing political propaganda that was included in the package delivered to Joint Base Andrews in Maryland - the home base for the aircraft used to transport the president of the United States.",
        "Content": "Several people have fallen ill after a \"suspicious package\" containing white powder was opened at the home base for the presidential plane Air Force One, according to US media reports. A building on the US military base was evacuated on Thursday after an individual \"opened a suspicious package\", CNN reported, citing a statement from Joint Base Andrews, which is located outside the US capital, Washington, DC. \"As a precaution, the building and connecting building were evacuated, and a cordon was established around the area,\" the statement said. \"Joint Base Andrews first responders were dispatched to the scene, determined there were no immediate threats, and have turned the scene over to the Office of Special Investigations. \"An investigation is currently ongoing.\" Several people were taken to Malcolm Grow Medical Center on the base. The extent of their illnesses was not known. An initial field test from the HAZMAT team did not detect anything hazardous, reported CNN. The room where the package was opened, located in a building that houses the Air National Guard Readiness Center, remains shut. Investigators are also assessing political propaganda that was included in the package. Read more from Sky News:Prince Harry apologises to CanadaA year on from Trump's win, an untold story emerges Joint Base Andrews in Maryland is home to military personnel and their families. It is famously known as the home base for Air Force One, the aircraft used to transport the president of the United States. Donald Trump and other senior political figures routinely pass through the base when travelling abroad. Mr Trump was at Joint Base Andrews on Wednesday."
    },
    {
        "title": "Kendrick Lamar leads Grammy nominations as K-pop makes it mark",
        "description": "Kendrick Lamar is leading this year's Grammy nominations, up for nine trophies, including record, song and album of the year.",
        "url": "https://news.sky.com/story/kendrick-lamar-leads-grammy-nominations-as-k-pop-makes-it-mark-13465852",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kendrick-lamar-grammys_6818179.jpg?20250203044350",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-07 15:49:00",
        "Headline": "Kendrick Lamar's diss track Not Like Us cleaned up at this year's Grammys, and he's getting plenty of love at this year's nominations too.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Kendrick Lamar is leading this year's Grammy nominations, up for nine trophies, including record, song and album of the year. The 38-year-old swept last year's awards, taking home five gongs for his hit dis track Not Like Us. The varied bag of Grammy nominees - featuring big names and a few surprises - also saw K-pop stars, a knighted British rocker and a Hollywood leading man make it into the Grammy competition.   Lady Gaga (who is up for record, song and album of the year too), Jack Antonoff and Canadian record producer-songwriter Cirkut follow Lamar with seven nominations each. Sabrina Carpenter got six nods, matching her nomination tally for last year. \n                  Charli XCX, Beyonce, Taylor Swift - the Grammy moments everyone is talking about\n                 \n                  Grammy Awards 2025: Full list of winners\n                 \n                  Grammys 2025: Beyonce makes history as she wins album of the year\n                 Alongside Lamar's GNX, other albums to make it into the best album category this year include Lady Gaga's Mayhem and Bad Bunny's Debí Tirar Más Fotos (only the second all-Spanish language album to be nominated in the category, following the Puerto Rican rapper's 2023 all-Spanish album Un Verano Sin Ti). They are all potential first-time winners in the category. Also up for the top album prize are Sabrina Carpenter's Man's Best Friend, Justin Bieber's Swag, Clipse, Pusha T & Malice's Let God Sort Em Out, Leon Thomas's Mutt, and Tyler, the Creator's Chromakopia. Despite releasing a new album earlier this year, Taylor Swift, didn't make it on to the best album nominees as The Life Of A Showgirl came out after the close of the eligibility period. The window ran from 31 August 2024 to 30 August 2025. K-pop gets its moment With K-pop typically ignored by the Grammys (BTS are the only K-pop artists to previously get a nod) this year saw two K-pop tracks in contention for best song. Golden, the lead track from global phenomenon KPop Demon Hunters and APT, the megahit by former Blackpink member Rosé alongside Bruno Mars, both made it on to the list. Rosé got nods in four other categories, including best record, while KPop Demon Hunters got three other nominations, including in the best pop duo/group performance category. British artist Lola Young, who is the niece of acclaimed children's writer Julia Donaldson, got a nod in the best new artist category, alongside Olivia Dean. Both topped the UK charts this year. They will compete against KATSEYE, The Marias, Addison Rae, sombr, Leon Thomas and Alex Warren. Last year the category was won by Good Luck, Babe! singer Chappell Roan. Timothée Chalamet is up for a Grammy In less expected Grammy news, Sir Elton John also got a nod alongside US singer-songwriter Brandi Carlile for the song Never Too Late, which features on the soundtrack of the 2024 Sir Elton documentary of the same name. Meanwhile, actor Timothée Chalamet got his first Grammy nod in the best compilation soundtrack for visual media category for his work on Oscar-nominated movie A Complete Unknown, in which he played Bob Dylan. Nominations were announced by past Grammy winners, including Sabrina Carpenter, Doechii and last year's best new artist winner, Chappell Roan. Sharon, Kelly and Jack Osbourne came together to announce the rock and metal album nominations in tribute to Ozzy, who died in July. He had previously won in both categories. The annual ceremony - which gives out a whopping 95 gongs in total - has four big categories: album, record and song of the year, and best new artist. Following Beyoncé's historic win for best album and best country album for Cowboy Carter, this year the country category has been divided into two: best traditional country album and best contemporary country album. There's also the new addition of a standalone category for best album cover. Last year, Beyoncé made history as the Grammy's most nominated artist, winning album of the year for the first time. Winners will be chosen by the roughly 15,000 voting members of the Recording Academy. The 68th Grammy Awards take place on Sunday, 1 February 2026, at the Crypto.com Arena in Los Angeles. Main category nominees Album Of The YearDeBi TiRAR MaS FOtoS, Bad BunnySwag, Justin BieberMan's Best Friend, Sabrina CarpenterLet God Sort Em Out, Clipse, Pusha T and MaliceMAYHEM, Lady GagaGNX, Kendrick LamarMutt, Leon ThomasCHROMAKOPIA, Tyler, The Creator Record Of The YearDtMF, Bad BunnyManchild, Sabrina CarpenterAnxiety, DoechiiWildflower, Billie EilishAbracadabra, Lady Gagaluther, Kendrick Lamar with SZAThe Subway, Chappell RoanAPT, Bruno Mars and Rosé Song Of The YearAbracadabra, Lady GagaAnxiety, DoechiiAPT, Bruno Mars and RoséDtMF, Bad BunnyGolden, EJAE, Audrey Nuna and REI AMIluther, Kendrick Lamar with SZAManchild, Sabrina CarpenterWildflower, Billie Eilish Best New ArtistOlivia DeanKATSEYEThe MariasAddison RaesombrLeon ThomasAlex WarrenLola Young"
    },
    {
        "title": "Why a Sky-ITV deal makes sense in a shifting entertainment landscape",
        "description": "The proposed &#163;1.6bn takeover of a big chunk of ITV by Sky would be the biggest consolidation in British broadcasting in more than 20 years, and reflects fundamental changes in viewing habits and commercial realities.",
        "url": "https://news.sky.com/story/why-a-sky-itv-deal-makes-sense-in-a-shifting-entertainment-landscape-13465639",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-ant-and-dec-im-a-celebrity_5950651.jpg?20221101084257",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-07 09:03:00",
        "Headline": "Sky's Paul Kelso examines why both parties would be keen to see an agreement reached, with the future firmly focused on streaming.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The proposed £1.6bn takeover of a big chunk of ITV by Sky would be the biggest consolidation in British broadcasting in more than 20 years, and reflects fundamental changes in viewing habits and commercial realities. For Sky, a deal that brings together Ant and Dec with Gary Neville and Jamie Carragher would make it the UK's largest commercial broadcaster, and strengthen its hand in the battle with US streaming giants that have upended the entertainment business. For ITV's shareholders, who have seen the value of their investment decline as advertising revenue, like viewers, has migrated online, it may be a chance to say, \"I own a terrestrial broadcaster, get me out of here.\" Money latest: Mortgage price war predicted Neither Sky or ITV would publicly discuss who made the initial offer, and both stress that talks are at an early stage, but privately, both sides emphasise the mutual opportunity. For Sky, owned by US giant Comcast since 2018, there is the opportunity to create a larger pool of content and subscribers. The deal would see it acquire ITV's media and entertainment business, including its free-to-air channels and public sector broadcaster (PSB) licence, which runs to 2034, as well as the ITVX streaming platform, which has 40 million registered users. \n                  ITV in 'preliminary' talks over £1.6bn sale of media and entertainment arm to Sky\n                 \n                  How the world's richest man is boosting the British right\n                 \n                  Is Aldi's cheap Ring doorbell dupe actually any good? | Money blog\n                 The ITV brand is likely to be retained, and the two companies run separately, but Sky would look to leverage its commercial and technology strengths. ITV's PSB licence includes the requirement that ITV’s app be \"available, prominent and easily accessible\" on online platforms, a crucial shop window as viewers access content directly. Added to Sky's existing 13 million subscribers for largely pay-walled content in the UK, it would add muscle as the broadcaster competes for attention, subscription revenue and advertiser spend. The acquisition would be a restatement of commitment to Sky from Comcast. Having paid £31bn for Sky in a bidding war with Disney seven years ago, it wrote down that investment by more than £6bn in 2022, and earlier this year announced the sale of Sky Deutschland. While it is navigating the conclusion of exclusivity deals with content providers, including with HBO that gave it rights to hits including Succession, the £5bn renewal of Premier League rights this season underlined the centrality of sport to Sky's offer. Scale matters because even companies as prominent in the UK as Sky and ITV are competing with giants, both for audiences and advertisers. Netflix has 301 million subscribers worldwide and annual revenues approaching $40bn. Amazon, the largest retailer in the world, is now an entertainment content provider. In the US, Warner Bros. Discovery is considering a sale, having already rejected reported offers worth more than $60bn. Google and Meta, meanwhile, gobble up to 60% of all UK advertising spend, a shift in the last decade that has hit ITV particularly hard. When it was founded 70 years ago, the third channel was the only way advertisers could reach television viewers. Today, it and Sky are competing for a slice of a shrinking pie, with one source citing an estimate that their combined UK advertising revenue is nine times smaller than Google and Meta's. Any proposed deal will face regulatory scrutiny from Ofcom and the Competition and Markets Authority, but both parties will argue that these commercial realities mean consolidation would strengthen the broadcast sector rather than weaken it. ITV still generates critical and commercial hits and live moments. Last year, the largest audiences for sport (England’s Euro 2024 semi-final), drama (Mr Bates v the Post Office) and entertainment (I’m a Celebrity) were all on ITV. Translating that into a commercial model that satisfies investors has proved difficult, with the general drift of the UK economy not helping. The 19% bump in the share price on news of the proposed takeover may be a welcome series finale. "
    },
    {
        "title": "ITV in 'preliminary' talks over £1.6bn sale of media and entertainment arm to Sky",
        "description": "ITV has revealed talks with Sky, the owner of Sky News, over the possible sale of its media and entertainment (M&E) division in a deal worth &#163;1.6bn.",
        "url": "https://news.sky.com/story/itv-in-preliminary-talks-over-16316bn-sale-of-media-and-entertainment-arm-to-sky-13465599",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sky-itv-logos-campus_7074511.jpg?20251107081729",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-11-07 07:13:00",
        "Headline": "Sky News understands the main aim of the talks is the creation of a UK-focused streaming giant, as the TV advertising market continues to stutter. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  ITV has revealed talks with Sky, the owner of Sky News, over the possible sale of its media and entertainment (M&E) division in a deal worth £1.6bn. Sky News understands the approach centres on the potential creation of a UK-focused streaming giant. The division takes in ITV's current broadcast operations and channels, which are largely dependent on advertising revenue. The talks do not include the company's studios arm, which makes shows such as I'm A Celebrity... Get Me Out Of Here! Money latest: Mortgage price war predicted \"There can be no certainty as to the terms upon which any potential sale may be agreed or whether any transaction will take place\", a statement by ITV to the London Stock Exchange said. \"A further announcement will be made in due course if appropriate\", it concluded. \n                  Why a Sky-ITV deal makes sense in a shifting entertainment landscape\n                 \n                  How the world's richest man is boosting the British right\n                 \n                  Is Aldi's cheap Ring doorbell dupe actually any good? | Money blog\n                 ITV shares jumped by 15% in early trading in response to the statement. ITV chief executive Dame Carolyn McCall told staff in an email: \"It's important for you to be aware that currently there is no agreement in place and there is no certainty around whether any acquisition will go ahead. \"I appreciate this news may come as a surprise... While we don't have any more information we can share today, I want to reassure you we will be as open and transparent as possible. At this stage, it's very much business as usual.\" Sky, which is wholly owned by the US media and entertainment firm Comcast, declined to comment. ITV released its statement after news of the discussions were first revealed by Bloomberg News. Arts and entertainment correspondent When ITV launched in 1955, the idea was to challenge the BBC's monopoly. Which they did.  But this would be a massive adjustment – worlds away from those early days when ITV was effectively a series of regional broadcasters with ads coming under one umbrella. While the USP of this deal seems to be creating a UK-focused streamer – with Sky's American owners - the size of this deal would see ITV and Sky be taken seriously on a global stage. Of course, it'd depend on regulatory approval. A decade ago, Ofcom would have likely said no way to a deal like this because of the dominance it would give the pair… but so much is changing incredibly quickly within TV. For linear TV, the situation is seriously bleak with streamers having moved in – plus the huge number of young people migrating to YouTube. What's so interesting about this is how – if the deal goes ahead – it would fundamentally reshape our television landscape. Just hours earlier, the company's latest financial results showed it was moving to save millions of pounds due to an advertising slowdown. ITV reported delays to some programmes over the coming months to save costs as a result. It predicted a 9% decline in ad revenues across 2025, with the most recent trends being blamed on advertisers pulling back on spending in anticipation of the chancellor's budget later this month. It is understood that a possible deal between Sky and ITV would seek to create a larger, more attractive proposition for advertisers in the UK streaming sphere through a focus on UK audiences. ITV has long been the subject of takeover speculation. The latest came from the Reuters news agency earlier this year when it reported early-stage talks with Abu Dhabi-backed group RedBird IMI about a possible merger of their respective production businesses. French media group Banijay was also reported to have held discussions about a possible offer for ITV's studio business or a full takeover. Read more: Why a Sky-ITV deal makes sense in a shifting entertainment landscape Dan Coatsworth, head of markets at AJ Bell, said news of the approach came as a surprise. \"Despite the success of ITVX, the media and entertainment arm has acted like an anchor on the group. \"ITV’s latest results show that advertisers these days prefer to run promotions on digital platforms and not traditional ‘live’ TV. This has created problems for the broadcaster and meant that the historical revenue generation engine has become lopsided. \"ITV has flourished with its production arm, churning out hit TV shows and dramas that have entertained millions of people around the world. Streaming platforms are screaming out for new content, and ITV Studios has been an important cog in the wheel. \"Many investors would prefer if ITV only consisted of the Studios arm, and the prospect of a separation has fired up the share price\", he noted. "
    },
    {
        "title": "What could Elon Musk do with $1trn?",
        "description": "Elon&#160;Musk&#160;could&#160;be&#160;on&#160;track&#160;for&#160;a&#160;$1trn pay&#160;packet.",
        "url": "https://news.sky.com/story/what-could-elon-musk-do-with-1trn-13465758",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-elon-musk-tesla_7074762.jpg?20251107133019",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-07 12:33:00",
        "Headline": "We have drilled down into the numbers and examined what you can do with a trillion dollars (£761,910,000,000) and it turns out, quite a lot.",
        "Content": " Elon Musk could be on track for a $1trn pay packet. Tesla shareholders have approved the whopping financial package for the CEO - who's already worth an estimated $491bn - if he hits a series of ambitious targets over the next 10 years. But that $1trn figure (or £761,910,000,000) - which is both one thousand billion and one million million - is almost impossible to imagine for most people. Even so, we have drilled down into the numbers and examined what you can do with a trillion US dollars - and it turns out, quite a lot.  Show me the money Laid end to end, a trillion one-dollar bills would cover a distance of approximately 156 billion metres. \n                  Elon Musk's $1trn pay package approved by Tesla\n                 \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 That could wrap around the equator 3,890 times, easily reach the sun from Earth (around 149.6 million km) or loop from Earth to the moon 405 times. That many one-dollar notes could cover a massive area (roughly 10,339 km squared), meaning you could blanket nearly all of Lebanon or Jamaica in bills. Spend it on sport You could splash out on virtually all of the world's major sporting leagues. The clubs which make up the Premier League are relatively cheap ($30bn), and even when snapping up the UEFA Champions League clubs and the big five top divisions of Spain, Italy, Germany, and France, there's still $858bn left in the kitty. The four major US sports leagues for ice hockey, baseball, basketball, and American football (NFL, NBA, MLB and NHL) have a rough valuation of $544bn, according to Sportico. But then add the IPL cricket league ($120bn) and F1 ($23.1bn) and Musk still has change from an estimated total spend of $829.7bn. Take over Tesla's rivals He could buy up the top 15 largest publicly traded automakers (excluding Tesla) by market capitalisation. They would include firms like Japan's Toyota ($275bn), Chinese automaker BYD ($120bn), and luxury brands like Ferrari ($81bn) and Mercedes-Benz ($62bn), as well as BMW ($52bn), Volkswagen ($50bn) and Ford ($48bn). But there would still be a little change left over; the total bill would be an eye-watering $992bn. Buy up San Diego He could buy up every single residential property in San Diego County - valued at a total of $1trn. Seattle is just slightly out of reach at $1.1trn, according to recent data from real estate firm Zillow. But if he wanted to buy big - there is always Tennessee. The total value of homes in the US state is estimated at $957bn. Or there is Maryland, which at $1.01trn could be bought if he can find a little more cash behind the sofa. Sadly, he would struggle to scoop up London's entire housing stock, which in February was valued at just under £2trn ($2.53trn), according to agents Savills. Cities like New York ($4.6trn) and Los Angeles ($3.9trn) are also not within his budget, hosting America's most expensive residential markets. Do something charitable? There is always the possibility Musk could follow in the footsteps of Microsoft founder Bill Gates, who intends to give away 99% of his vast fortune over the next 20 years. He could give every single man, woman, and child in the US a share of his cash pile. They would receive approximately $2,917.32 (£2,223.29), based on a population estimate of 342.7 million. Although it would be roughly $14,348.79 (£10,935.20) for every person (roughly 69.6 million) in the UK. If he wanted to give the entire globe an early Christmas present, then based on the rough world population estimate of 8.2 billion, everyone would receive $121.80 (£92.87). Pay off the credit card  With $1trn, he could instantly rewrite history and erase debt interest payments and the government debt from dozens of the world's sovereign nations. Or Musk could wipe out the debts of Singapore ($1trn) or South Korea ($0.99trn) in one go, according to figures from the International Monetary Fund's latest World Economic Outlook (Oct 2025). But when it comes to the biggest debt-laden countries, $1trn would not even touch the sides. The US has $38.3trn of government debt (just over one third of the total global debt pile) while the UK has a modest $4.1trn."
    },
    {
        "title": "One year on from Donald Trump's election win, an untold story has emerged",
        "description": "It's a year since the US put Donald Trump back in the White House and I've spent this anniversary week in Florida and in Pennsylvania - two worlds in one country where I found two such contrasting snapshots of Trump's America.",
        "url": "https://news.sky.com/story/when-trump-was-elected-a-year-ago-he-vowed-to-make-america-affordable-again-hows-he-done-13465549",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-trump-in-florida_7074571.jpg?20251107095433",
        "type": "Business",
        "Author": "Mark Stone",
        "Date Published": "2025-11-07 03:23:00",
        "Headline": "The president marked the election's anniversary with a speech to Florida's wealthy - but 1,000 miles away, many don't feel the \"greatest economy\" he talks about.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  It's a year since the US put Donald Trump back in the White House and I've spent this anniversary week in Florida and in Pennsylvania - two worlds in one country where I found two such contrasting snapshots of Trump's America. There are many ways to reflect on the successes and failures of the past year. Different issues matter to different people. But the thing which matters to all Americans is money. The cost of living was a key factor in Donald Trump's victory. He promised to make the country more affordable again. So: how's he done? On Wednesday, exactly a year since Americans went to the polls, the president was in Miami. He had picked this city and a particular crowd for his anniversary speech. I was in the audience at the America Business Forum as he told wealthy entrepreneurs and investors how great life is now. \"One year ago we were a dead country, now we're considered the hottest country in the world,\" he told them to cheers. \"Record high, record high, record high…\" The vibe was glitzy and wealthy. These days, these are his voters; his crowd. \"After just one year since that glorious election, I'm thrilled to say that America is back, America is back bigger, better, stronger than ever,\" he said. \"We've done really well. I think it's the best nine months, they say, of any president. And I really believe that if we can have a few more nine months like this, you'd be very happy. You'd be very satisfied.\" There was little question here that people are happy. \"Trump's been a good thing?\" I asked one attendee, Liz Ciborowski. \"Yes. He has really pushed for a lot of issues that are really important for our economy,\" she said. \"I'm an investor,\" said another, Andrea. \"I'm a happy girl. I'm doing good,\" she said with a laugh. A year on from his historic victory, the president was, notably, not with the grassroots folk in the places that propelled him back to the White House. He had chosen to be among business leaders in Miami. Safe crowd, safe state, safe space. But there was just one hint in his speech which seemed to acknowledge the reality that should be a concern for him. \"We have the greatest economy right now,\" he said, adding: \"A lot of people don't see that.\" That is the crux of it: many people beyond the fortunate here don't feel the \"greatest economy\" he talks about. And many of those people are in the places that delivered Trump his victory. That's the untold story of the past year. A thousand miles to the north of Miami is another America - another world. Steelton, Pennsylvania sits in one of Donald Trump's heartlands. But it is not feeling the beat of his greatest economy. Not at all. At the local steel union, I was invited to attend a meeting of a group of steel workers. It was an intimate glimpse into a hard, life-changing moment for the men. The steel plant is shutting down and they were listening to their union representative explaining what happens next. The conversation was punctuated with all the words no one wants to hear: laid off, severance, redundancy. \"For over 100 years, my family has been here working. And I was planning on possibly one day having my son join me, but I don't know if that's a possibility now,\" former employee David Myers told me. \"And...\" he paused. \"Sorry I'm getting a little emotional about it. We've been supplying America with railroad tracks for over a century and a half, and it feels weird for it to be coming to an end.\" Cleveland Cliffs Steelton plant is closing because of weakening demand, according to its owners. Their stock price has since surged. Good news for the Miami crowd, probably. It is the irony between the two Americas. Read more US news:JD Vance's reaction to a big 24 hours in US politics is tellingNew York's new mayor shouldn't expect any easy wins Down at the shuttered plant, it's empty, eerie and depressing. It is certainly not the image or the vision that Donald Trump imagined for his America. Pennsylvania, remember, was key to propelling Trump back to the White House. In this swing state, they swung to his promises - factories reopened and life more affordable. Up the road, conversations outside the town's government-subsidised homes framed the challenges here so starkly. \"How much help does the community need?\" I asked a man running the local food bank. \"As much as they can get. I mean, help is a four-letter word but it has a big meaning. So help!\" community organiser Elder Melvin Watts said. I asked if he thought things were worse than a year ago. \"Yes sir. I believe they needed it then and they need it that much more now. You know it's not hard to figure that out. The cost of living is high.\" Nearby, I met a woman called Sandra. \"It's been harder, and I'm a hard-working woman,\" she told me. \"I don't get no food stamps, I don't get none of that. You've got to take care of them bills, eat a little bit or don't have the lights on. Then you have people like Mr Melvin, he's been out here for years, serving the community.\" Inside Mr Melvin's food bank, a moment then unfolded that cut to the heart of the need here. A woman called Geraldine Santiago arrived, distressed, emotional and then overwhelmed by the boxes of food available to her. \"We'll help you…\" Mr Melvin said as she sobbed. Geraldine is one of 40 million Americans now not receiving the full nutritional assistance programme, known as SNAP, and usually provided by the federal government. SNAP benefits have stopped because the government remains shut down amid political deadlock. I watched Geraldine's rollercoaster emotions spilling out - from desperation to gratitude at this moment of respite. She left with a car boot full of food. A year on from his victory, Donald Trump continues to frame himself as the \"America First\" president and now with an economy transformed. But parts of America feel far, far away."
    },
    {
        "title": "Mistaken prison releases 'could be opportunity' for justice secretary, Harriet Harman says",
        "description": "Multiple mistaken prisoner releases could actually be an \"opportunity\" for David Lammy, Harriet Harman has said.",
        "url": "https://news.sky.com/story/mistaken-prison-releases-could-be-opportunity-for-justice-secretary-harriet-harman-says-13465114",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/david-lammy-mp-migrant_7062872.jpg?20251026155900",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-07 05:00:00",
        "Headline": "It's a chance for David Lammy to \"sort out\" his department, Labour peer tells Electoral Dysfunction.",
        "Content": "Multiple mistaken prisoner releases could actually be an \"opportunity\" for David Lammy, Harriet Harman has said. Speaking to Sky News' Electoral Dysfunction podcast with political editor Beth Rigby, the Labour peer said the release errors are a chance for the justice secretary to \"roll up his sleeves\" and sort out his department. It emerged on Wednesday that two prisoners were wrongly freed from HMP Wandsworth last week. It follows the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford. Baroness Harman said this has \"shone a spotlight on a systemic problem which needs to be sorted out\". Rather than become a \"ding dong\" between Labour and the Tories, she said: \"I think ironically it's a bit of an opportunity for him [Lammy] to actually be able to roll up his sleeves and insist the department gets the resources and the focus it needs to sort out this problem, which is not a new problem.\"  She added that figures showing 262 prisoners were mistakenly released in the 12 months to March 2025 is \"five a week, more or less being let out early\" and \"we don't even know that is the full extent\". Mr Lammy, who is also the deputy prime minister, is under fire over his handling of the saga. He stood in for Sir Keir Starmer at PMQs on Wednesday when he refused to answer whether any more asylum seekers had been wrongly released since Kebatu, an Ethiopian national, who was later deported.  As PMQs was ending, the story broke that Algerian sex offender Brahim Kaddour-Cherif had been released in error. It has since emerged that Mr Lammy was made aware of this overnight on Tuesday. He has defended not revealing that he knew about the incident, saying he did not have the full details and did not want to mislead the public. Read more from Sky News:Andrew Mountbatten Windsor summoned by US Congress'Iconic, wise' Shirley Valentine actress Pauline Collins diesElon Musk's $1trn pay package Mr Lammy is also being criticised as following Kebatu's mistaken release, he promised on 27 October that stronger prison checks would be introduced immediately. But Kaddour-Cherif was released in error two days later, on 29 October, while another prisoner, William \"Billy\" Smith, was mistakenly released on Monday. Smith handed himself in on Thursday, while Kaddour-Cherif was arrested on Friday."
    },
    {
        "title": "Why are prisoners being released by mistake?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/why-are-prisoners-being-released-by-mistake-13465265",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-07 05:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Who is to blame for two more inmates being wrongly freed from prison? The Conservatives attempted a mic drop moment with David Lammy this week by trying to get the justice secretary to admit to it live in the House of Commons. So why did Lammy avoid the question five times? And when 262 prisoners were released by mistake in the year to March - how is this happening every week? At the very least, Harriet sees the saga as an opportunity for the government to sort out the prison service. Plus Beth, Ruth and Harriet are joined by pollster Luke Tryl, and a group of voters who tell us why they're not convinced by the prime minister so far. So how tricky is this budget going to be for Rachel Reeves when most people's top worry is the cost of living? Can she actually put up taxes? And will more people just end up supporting Nigel Farage and Zack Polanski? Remember, you can also watch Beth Rigby, Harriet Harman and Ruth Davidson on YouTube."
    },
    {
        "title": "Lisa Nandy defended in 'cronyism' row over appointment of football regulator",
        "description": "A cabinet minister has defended Lisa Nandy after the culture secretary apologised for breaching the governance code on public appointments over her choice of the independent football regulator.",
        "url": "https://news.sky.com/story/lisa-nandy-defended-in-cronyism-row-over-appointment-of-football-regulator-13465626",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lisa-nandy-downing-street_7021886.jpg?20250916093641",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-07 09:57:00",
        "Headline": "The culture secretary apologised after she was found to have breached the  governance code on public appointments by appointing a former Labour donor to the role.",
        "Content": "A cabinet minister has defended Lisa Nandy after the culture secretary apologised for breaching the governance code on public appointments over her choice of the independent football regulator. Ms Nandy has been accused by the Conservatives of \"cronyism\" after she \"unknowingly\" broke the code by failing to declare she had received £2,900 in donations from David Kogan, her pick to chair the new football watchdog. Politics latest: Starmer backs Lammy over missing prisoner  Speaking to Anna Jones on Sky News, Housing Secretary Steve Reed said Ms Nandy had apologised for her actions and did not know he was a donor at the time she appointed him. \"As soon as she found out, she took the appropriate action and the independent investigator has confirmed that,\" he said. In October, Mr Kogan was appointed as the football regulator, conceived by the Tories in the wake of the furore over the failed European Super League project. However, his appointment became controversial after it emerged that Mr Kogan, a former broadcasting executive who has advised clients including the Premier League, was not on the original shortlist and donated to the leadership campaigns of both future prime minister, Sir Keir Starmer, as well as Ms Nandy. Sir William Shawcross, the commissioner for public appointments, ruled that the government's appointment of Mr Kogan made three breaches of the code. As well as Ms Nandy's failure to disclose his donations to her 2020 leadership campaign, the potential conflict of interest arising from that was not discussed with Mr Kogan at interview, and his links to the Labour Party were not revealed, the report said. Mr Kogan was also a director of LabourList, the independent news site, and has written two books about the party. In a letter to the prime minister, Ms Nandy said: \"I am writing to you following the publication of the Commissioner for Public Appointments' report into the appointment of the chair of the Independent Football Regulator (IFR) released [on Thursday]. \"The commissioner's conclusions include a finding that I unknowingly breached an aspect of the governance code on public appointments. I deeply regret this error. I appreciate the perception it could create, but it was not deliberate and I apologise for it.\" In her letter to Sir Keir following the findings, she said: \"I welcome the clear recognition that I did not know about two donations I received as a leadership candidate in 2020, when I was a backbench opposition MP, and that as soon as I discovered these donations existed, I chose to declare them and recuse myself from the process. \"I want to assure you that I took robust steps before the process began to check the Electoral Commission and parliamentary register for any donations I had received since I became a member of parliament in 2010, and made proactive enquiries with former campaign staff. None of these clear steps identified the donations in question.\"  Sir Keir told Ms Nandy in a written reply that she had \"acted in good faith\", but said \"the process followed was not entirely up to the standard expected\". Mr Kogan said in a statement: \"I have cooperated fully throughout the investigation and can now draw a line under the process. \"As the commissioner states, my suitability for the role has never been in question and at no point was I aware of any deviation from best practice. \"It is now time to move on and get on with the business of setting up the IFR [independent football regulator] so we can tackle the critical and urgent issues facing football.\" The Tories accused Labour of \"cronyism\" over the appointment and said it was \"completely untenable\". Read more:What we know so far about the prisoners freed by mistakeIs Reeves about to repeat this 1970s horror budget? Shadow culture secretary Nigel Huddleston said: \"This appointment bears all the hallmarks of Labour cronyism. We now know there have been three clear breaches of the process, leaving this appointment completely untenable. \"If Labour is serious about integrity and transparency, this appointment must be withdrawn immediately. Anything less would be a betrayal of the very standards Labour claim to uphold.\""
    },
    {
        "title": "COP's potential for change limited not by who turned up, but by the elephants not in the room",
        "description": "The COP climate summit in Belem opened with a diplomatic double-whammy.",
        "url": "https://news.sky.com/story/cops-potential-for-change-limited-not-by-who-turned-up-but-by-the-elephants-not-in-the-room-13466030",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-lula-da-silva_7074146.jpg?20251106222739",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-07 19:31:00",
        "Headline": "The leaders of China, the US and India - the world's three largest contributors to climate change - are not at the summit in Brazil, meaning significant progress on addressing climate change will be even harder this time.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n  The COP climate summit in Belem opened with a diplomatic double-whammy. The Prince of Wales and Sir Keir Starmer reaffirmed the UK's commitment to fighting climate change and urged the rest of the world to do so, too. But as the tropical rain beat down on the tarpaulin roof of this temporary summit venue, it's hard not to feel the air going out of the process.  Sir Keir and Prince William's presence doesn't make up for the geopolitical weight of the elephants not in the room. The leaders of China, the US and India - the world's three largest contributors to climate change - are no-shows. Donald Trump's highly-publicised decision to withdraw America from the UN climate talks is a blow. Before Mr Trump, America - the world's largest economy, largest oil and gas producer, and major market for renewable energy - had serious deal-making power here. \n                  Prince William plays volleyball and football ahead of Brazil climate events\n                 \n                  Prince William to attend Earthshot Prize and COP30 in Brazil - with his team hoping to refocus attention away from Andrew\n                 \n                  Families mourn dozens killed during Rio de Janeiro's 'biggest' raid against drugs gang\n                 Having formally withdrawn, there is no US delegation. And, as far as I can tell, any US broadcasters either, so for Americans, this meeting may as well not be happening at all.  Without the US, things will be harder. But does that mean the process is doomed? The leaders of China and India may be absent but they've sent high-level delegations. Read more on COP 30:Is net zero dead?Why is COP 30 controversial? China is represented by vice-premier Ding Xuexiang, the country's most high-ranking politician after President Xi himself. And, while China and India might not be big on eco-messaging, between them they are busy driving the most rapid shift away from fossil fuels towards wind, solar and nuclear power the world has ever seen. What's more, the real work at these summits isn't done by heads of state, but experienced sherpas, some of whom have trodden the nylon carpeted corridors of COP for 30 years.  It's reasonable to ask what they've achieved in all that time. The commitments of the Paris agreement of a decade ago have been missed by a wide margin. The world is about to blow past 1.5 degrees of warming and almost certainly exceed two degrees as well. But when the Paris deal was signed, the trajectory was for four degrees of warming. There are good COPs and bad COPs, but the world is undoubtedly a safer place now than it would have been without them."
    },
    {
        "title": "Why Grand Theft Auto VI has been delayed again and how it'll affect other games",
        "description": "The release of Grand Theft Auto VI, expected to be one of the best-selling games of all time, is delayed once again.",
        "url": "https://news.sky.com/story/why-grand-theft-auto-vi-has-been-delayed-again-and-how-itll-affect-other-games-13465727",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-grand-theft-auto-hacking_6400523.jpg?20231221120735",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-07 11:47:00",
        "Headline": "There's plenty of frustration about the ongoing delays but maybe good things come to those who wait…",
        "Content": "\n          Science and technology reporter\n       The release of Grand Theft Auto VI, expected to be one of the best-selling games of all time, is delayed once again. The sequel to the 2013 blockbuster Grand Theft Auto (GTA) V was originally supposed to be released this autumn but was pushed back earlier this year by developers Rockstar Games. Now, it has been delayed once again, pushed to November 2026. Why is it being delayed again? Rockstar says the delay will give them extra time to \"finish the game with the level of polish you have come to expect and deserve\". That's not a surprise to George Osborn, games industry commentator and author of the Games Industry Memo. \"For something that is as enormous, as big budget, as high production value as this, and given Rockstar's history as a company of delaying stuff until it's absolutely ready, it's not hugely unexpected,\" he told Sky News. \n                  Minecraft users targeted by criminals posing as game coders\n                 \n                  Video game actor strike ends in US - but AI described as 'direct threat' to UK industry\n                 \n                  Nintendo reveals how many Switch 2 consoles were sold in the first four days - as stock remains low on UK shelves \n                 The expectations around GTA VI are high. While other recent releases seem to have decided \"less is more\", Rockstar is likely working with a budget of over £1bn and fans who have been waiting over a decade for the new game, according to Mr Osborn. \"If you look at the Indiana Jones that came out last year, it looks great, it's really fun to play, but it actually only lasts about 20 hours in terms of game time, not much more than a prestige TV series,\" he said. \"But [GTA6] might be one of the handful of gigantic games that really does need to be that polished to meet the expectations of consumers, but also the ridiculously high production standards they have within Rockstar itself.\" Could internal problems at Rockstar have anything to do with the delay?  Rockstar already hit the headlines once this week after the studio was accused of union-busting when around 30 members of staff were fired. The union representing the workers, the Independent Workers' Union of Great Britain (IWGB), said the staff who were fired were all taking part in trade union activity. A Rockstar spokesperson told Bloomberg, however, that the studio had taken action against \"a small number\" of employees for \"distributing and discussing confidential information in a public forum\". Take-Two Interactive, Rockstar's parent company, has also launched multiple rounds of job cuts across its business in the last two years. However, Mr Osborn doesn't think these internal issues will have impacted GTA VI's release. \"For Take-Two, Grand Theft Auto is essentially the golden egg,\" he said. \"They're waiting for the goose to lay, so they're not too fussed [about] reductions of headcount at Rockstar.\" As for the workers who were let go this week, he said his \"gut feeling\" is their departures are probably not enough to \"push the needle\" in terms of release dates. Sky News has approached Take-Two Interactive for comment. Could the delay be a good thing? There's plenty of frustration about the ongoing delays but maybe good things come to those who wait… \"Better it come out good than rushed, but still disappointing… Hope they at least give us trailer two as an apology,\" said one gamer on X. As well as giving the studio more time to perfect the game, the delay may also mean the people working on GTA VI are put under less intense pressure, according to Mr Osborn. \"The company came in for a lot of criticism in the run-up to previous releases for basically crunching too hard, getting the staff working too hard on the project in the run-up to it, burning them out,\" he said. In 2018, Rockstar faced a backlash after workers described intense working conditions in the run-up to big releases like Red Dead Redemption and GTA V. \"During the GTA IV era, it was like working with a gun to your head seven days a week,\" posted one former employee at the time. Since then, Rockstar has tried to reform its working culture. \"The repercussion of that [reform] is essentially it takes them even longer to make stuff because the production standards are so high,\" said Mr Osborn. \"For GTA VI, it has to be perfect out of the gate. Otherwise, it's going to be hard for them to get towards that £1bn mark they need to make the money back.\" Read more from Sky News:How the world's richest man is boosting the British rightTech giants warn Reeves of IPO 'flight risk' over budget What does this mean for other games? GTA VI is expected to eat up game sales as soon as it is released. Its last iteration, GTA V, is still the second-best-selling game of all time (Minecraft is the best-selling). \"It's going to just dominate everything and take the air out of the room,\" said Mr Osborn. As such, the games industry has been on tenterhooks waiting to see if Rockstar would make their May 2026 deadline, so they could avoid their own game releases being overshadowed. \"The immediate winners are probably Resident Evil Requiem in February and First Light, the James Bond game that is releasing in March,\" said Mr Osborn. \"Both of those games [now] have a much, much clearer run into the year.\" As for games like The Elder Scrolls VI or Fable, both potentially being released next autumn, they may now be seeing if they can move their timelines to avoid clashing with Grand Theft Auto VI. \"Ultimately, when the GTA VI release date moves, the entire industry moves around it.\" Mr Osborn also counts himself as one of the winners of the deadline move, as his book on the games industry can now be released far in advance of Grand Theft Auto VI. \"For someone who's trying to convince people who like video games to spend £25 on something, it's really handy that something that's going to cost £70, £80 has just been shoved out of the calendar.\""
    },
    {
        "title": "Kendrick Lamar leads Grammy nominations as K-pop makes it mark",
        "description": "Kendrick Lamar is leading this year's Grammy nominations, up for nine trophies, including record, song and album of the year.",
        "url": "https://news.sky.com/story/kendrick-lamar-leads-grammy-nominations-as-k-pop-makes-it-mark-13465852",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kendrick-lamar-grammys_6818179.jpg?20250203044350",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-07 15:49:00",
        "Headline": "Kendrick Lamar's diss track Not Like Us cleaned up at this year's Grammys, and he's getting plenty of love at this year's nominations too.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Kendrick Lamar is leading this year's Grammy nominations, up for nine trophies, including record, song and album of the year. The 38-year-old swept last year's awards, taking home five gongs for his hit dis track Not Like Us. The varied bag of Grammy nominees - featuring big names and a few surprises - also saw K-pop stars, a knighted British rocker and a Hollywood leading man make it into the Grammy competition.   Lady Gaga (who is up for record, song and album of the year too), Jack Antonoff and Canadian record producer-songwriter Cirkut follow Lamar with seven nominations each. Sabrina Carpenter got six nods, matching her nomination tally for last year. \n                  Charli XCX, Beyonce, Taylor Swift - the Grammy moments everyone is talking about\n                 \n                  Grammy Awards 2025: Full list of winners\n                 \n                  Grammys 2025: Beyonce makes history as she wins album of the year\n                 Alongside Lamar's GNX, other albums to make it into the best album category this year include Lady Gaga's Mayhem and Bad Bunny's Debí Tirar Más Fotos (only the second all-Spanish language album to be nominated in the category, following the Puerto Rican rapper's 2023 all-Spanish album Un Verano Sin Ti). They are all potential first-time winners in the category. Also up for the top album prize are Sabrina Carpenter's Man's Best Friend, Justin Bieber's Swag, Clipse, Pusha T & Malice's Let God Sort Em Out, Leon Thomas's Mutt, and Tyler, the Creator's Chromakopia. Despite releasing a new album earlier this year, Taylor Swift, didn't make it on to the best album nominees as The Life Of A Showgirl came out after the close of the eligibility period. The window ran from 31 August 2024 to 30 August 2025. K-pop gets its moment With K-pop typically ignored by the Grammys (BTS are the only K-pop artists to previously get a nod) this year saw two K-pop tracks in contention for best song. Golden, the lead track from global phenomenon KPop Demon Hunters and APT, the megahit by former Blackpink member Rosé alongside Bruno Mars, both made it on to the list. Rosé got nods in four other categories, including best record, while KPop Demon Hunters got three other nominations, including in the best pop duo/group performance category. British artist Lola Young, who is the niece of acclaimed children's writer Julia Donaldson, got a nod in the best new artist category, alongside Olivia Dean. Both topped the UK charts this year. They will compete against KATSEYE, The Marias, Addison Rae, sombr, Leon Thomas and Alex Warren. Last year the category was won by Good Luck, Babe! singer Chappell Roan. Timothée Chalamet is up for a Grammy In less expected Grammy news, Sir Elton John also got a nod alongside US singer-songwriter Brandi Carlile for the song Never Too Late, which features on the soundtrack of the 2024 Sir Elton documentary of the same name. Meanwhile, actor Timothée Chalamet got his first Grammy nod in the best compilation soundtrack for visual media category for his work on Oscar-nominated movie A Complete Unknown, in which he played Bob Dylan. Nominations were announced by past Grammy winners, including Sabrina Carpenter, Doechii and last year's best new artist winner, Chappell Roan. Sharon, Kelly and Jack Osbourne came together to announce the rock and metal album nominations in tribute to Ozzy, who died in July. He had previously won in both categories. The annual ceremony - which gives out a whopping 95 gongs in total - has four big categories: album, record and song of the year, and best new artist. Following Beyoncé's historic win for best album and best country album for Cowboy Carter, this year the country category has been divided into two: best traditional country album and best contemporary country album. There's also the new addition of a standalone category for best album cover. Last year, Beyoncé made history as the Grammy's most nominated artist, winning album of the year for the first time. Winners will be chosen by the roughly 15,000 voting members of the Recording Academy. The 68th Grammy Awards take place on Sunday, 1 February 2026, at the Crypto.com Arena in Los Angeles. Main category nominees Album Of The YearDeBi TiRAR MaS FOtoS, Bad BunnySwag, Justin BieberMan's Best Friend, Sabrina CarpenterLet God Sort Em Out, Clipse, Pusha T and MaliceMAYHEM, Lady GagaGNX, Kendrick LamarMutt, Leon ThomasCHROMAKOPIA, Tyler, The Creator Record Of The YearDtMF, Bad BunnyManchild, Sabrina CarpenterAnxiety, DoechiiWildflower, Billie EilishAbracadabra, Lady Gagaluther, Kendrick Lamar with SZAThe Subway, Chappell RoanAPT, Bruno Mars and Rosé Song Of The YearAbracadabra, Lady GagaAnxiety, DoechiiAPT, Bruno Mars and RoséDtMF, Bad BunnyGolden, EJAE, Audrey Nuna and REI AMIluther, Kendrick Lamar with SZAManchild, Sabrina CarpenterWildflower, Billie Eilish Best New ArtistOlivia DeanKATSEYEThe MariasAddison RaesombrLeon ThomasAlex WarrenLola Young"
    },
    {
        "title": "Celebrity Traitors star reveals the double-bluff that fooled the faithful in final",
        "description": "Celebrity Traitors star David Olusoga says there was one major flaw in the faithful's gameplay, and that was having \"too much fun\".",
        "url": "https://news.sky.com/story/celebrity-traitors-star-reveals-the-double-bluff-that-fooled-the-faithful-in-final-13465714",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/4852b65890f331d176a0fda51e71dbaaa02884aa1036b98c66dba9d8d96fd3b8_7074758.jpg?20251107132647",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-07 12:50:00",
        "Headline": "Celebrity Traitors saw the faithful battle to find traitors in their midst, culminating in a nail-biting final on Thursday night.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Celebrity Traitors star David Olusoga says there was one major flaw in the faithful's gameplay, and that was having \"too much fun\". The first UK celebrity series of the popular reality show has been a ratings hit since its launch a month ago, wrapping up with a tense finale on Thursday night. NB. This article contains spoilers related to the final episode Speaking to Sky News' Anna Jones and Kamali Melbourne on the new Mornings with Jones and Melbourne, Olusoga said: \"We were brilliant at the tasks and every day we went out and did what were basically bonding exercises. \"We all really got to know each other, and then we were terrible at the round table because we just liked each other too much.\" The 55-year-old historian says it was a \"devilishly difficult game,\" admitting he would have been a \"terrible\" traitor because he \"wasn't very good as a faithful\". Treacherous Alan Carr was crowned the winner of the show, after a nail-biting roundtable which saw fellow traitor Cat Burns banished, followed by faithful Joe Marler. \n                  Bob Vylan on 'death, death to the IDF' chant: 'I'd do it again tomorrow, twice on Sundays'\n                 \n                  BBC Gaza documentary breached broadcasting code, Ofcom finds\n                 \n                  Bob Vylan: BBC partly upholds complaints over Glastonbury set\n                 The celebrities proved to be the worst in the show's UK history at rooting out the traitors, a fact not lost on Olusoga: \"For the most part, it was people sort of not being very good to pointing fingers at each other\". Respected for his intellect and insight, Olusoga says the show has left him questioning his skill set: \"I learned the limits of my kind of my approach to logic, which made a lot of sense to me but didn't really get me very far.\" Despite many viewers feeling Carr let slip plenty of clues that he was a traitor, Olusoga says he never once suspected him. Olusoga says: \"It was like a double bluff. It was somebody who wasn't trying to disguise that they were a traitor, therefore, it seemed logical that they weren't a traitor… \"I think, of all the people, Alan probably got the fewest votes in the entire show. The other thing is, Alan is a national treasure. He's innately likeable. I think none of us really wanted to believe Alan was a traitor because he had us laughing, we were in stitches the whole time.\" Despite his lack of competitive success on the show, he says it's an experience he relished. \"It's very easy to get stuck in your own ruts as an adult, so to be plucked out of your world, to have your phone taken away from you, to be put in this entirely new environment - this amazing, surreal environment, with these amazing people - it was like the first week of university again. It was like starting a new school. That was wonderful.\" Previously a fan of the show, he says being a player was a completely different ballgame: \"You really haven't got a clue… you see patterns in the clouds\". He also has no regrets about his decision to get involved: \"I've been asked to do a lot of different shows. And I've always said no to all of them. But even before doing it, my view was, Traitors is special\". Olusoga is currently working on a Remembrance project with Findmypast to archive pictures of fallen soldiers in the First World War."
    },
    {
        "title": "New film 'proves beyond shadow of a doubt' that Elgin Marbles were stolen, director claims ",
        "description": "A new documentary proves \"beyond any shadow of a doubt\" that the Elgin Marbles were stolen, according to its director. ",
        "url": "https://news.sky.com/story/new-film-proves-beyond-shadow-of-a-doubt-that-elgin-marbles-were-stolen-director-claims-13465533",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-parthenon-marbles-elgin-marbles_6013846.jpg?20230104105326",
        "type": "Entertainment",
        "Author": "Jayson Mansaray",
        "Date Published": "2025-11-07 05:00:00",
        "Headline": "The film revisits how the sculptures were removed from the Parthenon in Athens while Greece was under Ottoman rule - but not all experts agree with its conclusion.",
        "Content": "\n          Arts and entertainment producer\n        A new documentary proves \"beyond any shadow of a doubt\" that the Elgin Marbles were stolen, according to its director.  David Wilkinson claims The Marbles settles one of the most divisive debates in cultural heritage: whether 19th-century diplomat Lord Elgin legally acquired the Parthenon Sculptures, better known as the Elgin Marbles. The film revisits how the sculptures were removed from the Parthenon in Athens while Greece was under Ottoman rule - and ended up in London.  It argues that Lord Elgin did not legally acquire the artefacts - and instead, it amounts to \"the greatest heist in art history\". Actor Brian Cox, historian Dominic Selwood and solicitor Mark Stephens are among those who appear in the documentary. The British government bought the sculptures from Lord Elgin and installed them into the trusteeship of the British Museum, where they have remained for 200 years. \"He needed the money from the British government to pay for all the bribes he'd given to members of the Ottoman Empire,\" Mr Wilkinson said of the transaction. \"Lord Elgin did sell them ... but the question becomes, did Lord Elgin actually have the right to purchase them?\" Classical archaeologist, Dr Mario Trabucco della Torretta dismisses Mr Wilkinson's claims. \"The allegation of bribery to obtain the Marbles is just wrong in historical terms,\" he told Sky News. Dr Torretta was the key architect behind a joint letter that included former prime minister Liz Truss, historian Dr David Starkey and Sir John Redwood - alleging the British Museum is part of a \"covert\" and \"accelerating campaign\" to return the Elgin Marbles to Greece. Responding to Mr Wilkinson's claims of bribery, he added: \"The only reference to 'presents' comes years after the start of the removals … do people presume that they run a 'bribe now, pay later' scheme back then in Constantinople?\" One of the most contentious points in the debate is the legitimacy of an Ottoman permission document known as a \"firman\", which is claimed to have authorised Lord Elgin removing the items from Greece. There is only an Italian text referred to as a translation of this document. Mr Wilkinson said: \"It was normal practice at the time that a copy would be kept in what was then Constantinople, and another copy would have been sent off to Athens. \"There would be a record in Istanbul and the Turks have gone through it in great detail over many decades and they can find nothing.\" Speaking to Sky News in 2024, Dr Zeynep Boz, head of combating illicit trafficking for Turkey's culture ministry, said there is no proof of the firman in the Ottoman archive. \"Despite extensive archival research, no such firman has been found. It is even difficult to call this document a translation when the original is not available,\" she said at the time. Dr Torretta offers an explanation: \"Burning the Ottoman governor's archive was one of the first acts of the Greek revolution.\" While the arguments are not new, The Marbles also examines how other institutions have handled similar restitution cases. In the film, Cox says the marbles would have gone back to Athens already if they had found their way to Edinburgh and not London. Back in 2023, the National Museum of Scotland returned the House of Ni'isjoohl memorial pole to Canada. Meanwhile, Glasgow's Kelvingrove Art Gallery and Museum returned a shirt to the South Dakota Cultural Heritage Center in the US. And when it comes to the Parthenon Sculptures, Germany's Heidelberg University and the Vatican have both returned fragments to Greece.  The British Museum Act 1963 prevents treasures from being legally given away by the British Museum. The government has repeatedly said it has no plans to change existing policy on restitution, and that it is up to the trustees of the museum to decide. A spokesperson for the British Museum repeated a statement given to Sky News in July: \"Discussions with Greece about a Parthenon Partnership are ongoing and constructive.\" The documentary scrutinises the ethics of foreign national treasures that were taken and are now housed in Western museums, but as it stands the institutional and governmental answers don't appear to be changing. The Marbles is in UK and Irish cinemas from today."
    },
    {
        "title": "Why a Sky-ITV deal makes sense in a shifting entertainment landscape",
        "description": "The proposed &#163;1.6bn takeover of a big chunk of ITV by Sky would be the biggest consolidation in British broadcasting in more than 20 years, and reflects fundamental changes in viewing habits and commercial realities.",
        "url": "https://news.sky.com/story/why-a-sky-itv-deal-makes-sense-in-a-shifting-entertainment-landscape-13465639",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-ant-and-dec-im-a-celebrity_5950651.jpg?20221101084257",
        "type": "Entertainment",
        "Author": "Paul Kelso",
        "Date Published": "2025-11-07 09:03:00",
        "Headline": "Sky's Paul Kelso examines why both parties would be keen to see an agreement reached, with the future firmly focused on streaming.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The proposed £1.6bn takeover of a big chunk of ITV by Sky would be the biggest consolidation in British broadcasting in more than 20 years, and reflects fundamental changes in viewing habits and commercial realities. For Sky, a deal that brings together Ant and Dec with Gary Neville and Jamie Carragher would make it the UK's largest commercial broadcaster, and strengthen its hand in the battle with US streaming giants that have upended the entertainment business. For ITV's shareholders, who have seen the value of their investment decline as advertising revenue, like viewers, has migrated online, it may be a chance to say, \"I own a terrestrial broadcaster, get me out of here.\" Money latest: Mortgage price war predicted Neither Sky or ITV would publicly discuss who made the initial offer, and both stress that talks are at an early stage, but privately, both sides emphasise the mutual opportunity. For Sky, owned by US giant Comcast since 2018, there is the opportunity to create a larger pool of content and subscribers. The deal would see it acquire ITV's media and entertainment business, including its free-to-air channels and public sector broadcaster (PSB) licence, which runs to 2034, as well as the ITVX streaming platform, which has 40 million registered users. \n                  ITV in 'preliminary' talks over £1.6bn sale of media and entertainment arm to Sky\n                 \n                  How the world's richest man is boosting the British right\n                 \n                  Is Aldi's cheap Ring doorbell dupe actually any good? | Money blog\n                 The ITV brand is likely to be retained, and the two companies run separately, but Sky would look to leverage its commercial and technology strengths. ITV's PSB licence includes the requirement that ITV’s app be \"available, prominent and easily accessible\" on online platforms, a crucial shop window as viewers access content directly. Added to Sky's existing 13 million subscribers for largely pay-walled content in the UK, it would add muscle as the broadcaster competes for attention, subscription revenue and advertiser spend. The acquisition would be a restatement of commitment to Sky from Comcast. Having paid £31bn for Sky in a bidding war with Disney seven years ago, it wrote down that investment by more than £6bn in 2022, and earlier this year announced the sale of Sky Deutschland. While it is navigating the conclusion of exclusivity deals with content providers, including with HBO that gave it rights to hits including Succession, the £5bn renewal of Premier League rights this season underlined the centrality of sport to Sky's offer. Scale matters because even companies as prominent in the UK as Sky and ITV are competing with giants, both for audiences and advertisers. Netflix has 301 million subscribers worldwide and annual revenues approaching $40bn. Amazon, the largest retailer in the world, is now an entertainment content provider. In the US, Warner Bros. Discovery is considering a sale, having already rejected reported offers worth more than $60bn. Google and Meta, meanwhile, gobble up to 60% of all UK advertising spend, a shift in the last decade that has hit ITV particularly hard. When it was founded 70 years ago, the third channel was the only way advertisers could reach television viewers. Today, it and Sky are competing for a slice of a shrinking pie, with one source citing an estimate that their combined UK advertising revenue is nine times smaller than Google and Meta's. Any proposed deal will face regulatory scrutiny from Ofcom and the Competition and Markets Authority, but both parties will argue that these commercial realities mean consolidation would strengthen the broadcast sector rather than weaken it. ITV still generates critical and commercial hits and live moments. Last year, the largest audiences for sport (England’s Euro 2024 semi-final), drama (Mr Bates v the Post Office) and entertainment (I’m a Celebrity) were all on ITV. Translating that into a commercial model that satisfies investors has proved difficult, with the general drift of the UK economy not helping. The 19% bump in the share price on news of the proposed takeover may be a welcome series finale. "
    },
    {
        "title": "ITV in 'preliminary' talks over £1.6bn sale of media and entertainment arm to Sky",
        "description": "ITV has revealed talks with Sky, the owner of Sky News, over the possible sale of its media and entertainment (M&E) division in a deal worth &#163;1.6bn.",
        "url": "https://news.sky.com/story/itv-in-preliminary-talks-over-16316bn-sale-of-media-and-entertainment-arm-to-sky-13465599",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sky-itv-logos-campus_7074511.jpg?20251107081729",
        "type": "Entertainment",
        "Author": "James Sillars",
        "Date Published": "2025-11-07 07:13:00",
        "Headline": "Sky News understands the main aim of the talks is the creation of a UK-focused streaming giant, as the TV advertising market continues to stutter. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  ITV has revealed talks with Sky, the owner of Sky News, over the possible sale of its media and entertainment (M&E) division in a deal worth £1.6bn. Sky News understands the approach centres on the potential creation of a UK-focused streaming giant. The division takes in ITV's current broadcast operations and channels, which are largely dependent on advertising revenue. The talks do not include the company's studios arm, which makes shows such as I'm A Celebrity... Get Me Out Of Here! Money latest: Mortgage price war predicted \"There can be no certainty as to the terms upon which any potential sale may be agreed or whether any transaction will take place\", a statement by ITV to the London Stock Exchange said. \"A further announcement will be made in due course if appropriate\", it concluded. \n                  Why a Sky-ITV deal makes sense in a shifting entertainment landscape\n                 \n                  How the world's richest man is boosting the British right\n                 \n                  Is Aldi's cheap Ring doorbell dupe actually any good? | Money blog\n                 ITV shares jumped by 15% in early trading in response to the statement. ITV chief executive Dame Carolyn McCall told staff in an email: \"It's important for you to be aware that currently there is no agreement in place and there is no certainty around whether any acquisition will go ahead. \"I appreciate this news may come as a surprise... While we don't have any more information we can share today, I want to reassure you we will be as open and transparent as possible. At this stage, it's very much business as usual.\" Sky, which is wholly owned by the US media and entertainment firm Comcast, declined to comment. ITV released its statement after news of the discussions were first revealed by Bloomberg News. Arts and entertainment correspondent When ITV launched in 1955, the idea was to challenge the BBC's monopoly. Which they did.  But this would be a massive adjustment – worlds away from those early days when ITV was effectively a series of regional broadcasters with ads coming under one umbrella. While the USP of this deal seems to be creating a UK-focused streamer – with Sky's American owners - the size of this deal would see ITV and Sky be taken seriously on a global stage. Of course, it'd depend on regulatory approval. A decade ago, Ofcom would have likely said no way to a deal like this because of the dominance it would give the pair… but so much is changing incredibly quickly within TV. For linear TV, the situation is seriously bleak with streamers having moved in – plus the huge number of young people migrating to YouTube. What's so interesting about this is how – if the deal goes ahead – it would fundamentally reshape our television landscape. Just hours earlier, the company's latest financial results showed it was moving to save millions of pounds due to an advertising slowdown. ITV reported delays to some programmes over the coming months to save costs as a result. It predicted a 9% decline in ad revenues across 2025, with the most recent trends being blamed on advertisers pulling back on spending in anticipation of the chancellor's budget later this month. It is understood that a possible deal between Sky and ITV would seek to create a larger, more attractive proposition for advertisers in the UK streaming sphere through a focus on UK audiences. ITV has long been the subject of takeover speculation. The latest came from the Reuters news agency earlier this year when it reported early-stage talks with Abu Dhabi-backed group RedBird IMI about a possible merger of their respective production businesses. French media group Banijay was also reported to have held discussions about a possible offer for ITV's studio business or a full takeover. Read more: Why a Sky-ITV deal makes sense in a shifting entertainment landscape Dan Coatsworth, head of markets at AJ Bell, said news of the approach came as a surprise. \"Despite the success of ITVX, the media and entertainment arm has acted like an anchor on the group. \"ITV’s latest results show that advertisers these days prefer to run promotions on digital platforms and not traditional ‘live’ TV. This has created problems for the broadcaster and meant that the historical revenue generation engine has become lopsided. \"ITV has flourished with its production arm, churning out hit TV shows and dramas that have entertained millions of people around the world. Streaming platforms are screaming out for new content, and ITV Studios has been an important cog in the wheel. \"Many investors would prefer if ITV only consisted of the Studios arm, and the prospect of a separation has fired up the share price\", he noted. "
    }
]