[
    {
        "title": "Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan",
        "description": "Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel.",
        "url": "https://news.sky.com/story/putin-has-really-let-me-down-says-us-president-donald-trump-13433413",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-keir-starmer_7024260.jpg?20250918154118",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:56:00",
        "Headline": "Sir Keir Starmer pointed to the UK's action, including the first return under the \"one in, one out\" deal with France, that happened earlier on Thursday.",
        "Content": " Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel. The US president made the suggestion while stood alongside the prime minister for a typically wide-ranging news conference on Thursday afternoon, bringing his state visit to Britain to an end. Catch up on updates from Trump's state visit Speaking at Chequers, Sir Keir's country retreat, Mr Trump warned illegal migration is \"going to destroy [...] countries from within\" and said \"it doesn't matter if you call out the military\" to deal with small boats. He talked up his own record of stopping people crossing the US-Mexico border. Sir Keir instead pointed to his government's migrant return deal with France, with the first deportation of a man who arrived via small boat taking place on Thursday morning. Further flights are scheduled to take place this week and next, starting Friday, while exchange arrivals to Britain via the legal route agreed with the French are due in the coming days. \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  Four men freed on bail over Trump-Epstein projection at Windsor Castle\n                 \n                  Donald Trump historic state visit - second day in pictures\n                 Mr Trump also used the news conference to admit Vladimir Putin \"has really let me down\", having stepped up his attacks against Ukraine since the two men held a peace summit in Alaska last month.  But asked by Sky News' political editor Beth Rigby if it was a mistake to invite Mr Putin and if he regrets it, the president replied: \"No.\" It's the \"biggest disappointment\" of his presidency that he hasn't managed to end the war, Mr Trump admitted. He said he thought it would be the \"easiest\" to solve because of his relationship with Mr Putin. Sir Keir said the Russian president has \"shown his true face\", and more \"pressure\" is required to make him stop.  Trump reignites war of words with Khan While disappointed with Mr Putin, Mr Trump spared his harshest rhetoric for Sir Keir's friend Sadiq Khan. Speaking on Air Force One on his way back to the US, where he touched down in the early hours of Friday, he said he asked for the London mayor to be banned from attending the state banquet at Windsor Castle on Wednesday. \"I didn't want him there,\" the president said. \"I asked that he not be there.\" He claimed Sir Sadiq had wanted to be at the event, adding: \"I think the mayor of London Khan is among the worst mayors in the world, and we have some bad ones.\" Sky News understands the mayor didn't seek or expect an invitation. A source close to Sir Sadiq said the capital is a \"global success story\" and \"record numbers of Americans are choosing to make London their home\".  The Trump-Starmer news conference also covered the war in Gaza, the sacking of Lord Mandelson as Britain's US ambassador, energy policy, and a newly signed UK-US tech deal. Speaking about the situation in Gaza, Mr Trump said: \"Simply I want all hostages to be released now.\" He said he disagreed with the UK's plan to recognise a Palestinian state at the UN within days, should Israel not improve the humanitarian situation in Gaza. Trump claims not to know Mandelson Also asked by Beth Rigby if he has sympathy with Lord Mandelson, who was sacked by Sir Keir over past links to paedophile financier Jeffrey Epstein, the president simply said: \"I don't know him.\" That's despite the president being pictured shaking hands with the Labour peer in the Oval Office after announcing a trade deal with the UK back in May. There had been concerns that the Epstein issue could cast a shadow on the president's second state visit to the UK, not least because Mr Trump was also close to Epstein, although they fell out before his conviction in 2009. Read more:Trump historic state visit - second day in picturesEight things you might have missed from state visit Energy policy Mr Trump urged Sir Keir to exploit the UK's North Sea oil and gas resources, dismissing wind power as a \"very expensive joke\". The UK government has ruled out new oil and gas licences in the North Sea, focusing on renewables and building nuclear power stations. Despite their differences, Mr Trump said the bond between the US and Britain is like no other, and he described the prime minister as a \"tough negotiator\". The pair signed a technology prosperity deal, offering major investment by US tech firms in the UK, that will help to develop artificial intelligence (AI) capabilities. Sir Keir also hailed the prospect of £150bn flowing into the UK from big US companies such as Palantir and Blackstone, part of a wider £250bn package that officials say will benefit both sides.  Jimmy Kimmel controversy Meanwhile, Mr Trump also commented on US late-night chat show host Jimmy Kimmel, whose programme has been pulled from schedules after his remarks about the fatal shooting of conservative activist Charlie Kirk. The president claimed the show, Jimmy Kimmel Live!, was suspended because he \"is not a talented person\" and had \"very bad ratings\"."
    },
    {
        "title": "After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump",
        "description": "For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run.",
        "url": "https://news.sky.com/story/after-his-hardest-two-weeks-yet-this-isnt-what-i-expected-to-write-about-starmer-and-trump-13433735",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-trump-starmer_7024444.png?20250918175706",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-18 22:43:00",
        "Headline": "From bagpipe choruses and big ticket tech deals, to disagreeing \"agreeably\", Donald Trump's state visit has put the government back on track after a testing start to the new term, writes Sky's political editor.",
        "Content": "\n          Political editor\n              @BethRigby\n  For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run. It's not a sentence I imagined writing in the run-up to this state visit - particularly when the UK ambassador to the US, Peter Mandelson, was sacked from his post but days ago - but this state visit will go down as a success for a PM in dire need of a win. From the pomp and pageantry of the first day, to the hard business at Chequers, every detail was carefully choreographed to appeal to the president - including a stay in Windsor Castle, and a bagpipe chorus welcoming him (in a nod to his Scottish heritage) into Sir Keir Starmer's country retreat. Starmer went all out to flex all the soft power he could deploy to garner some hard results. There were real wins. The showstopper US-UK tech partnership was hailed by both sides as a new phase in the special relationship, as Trump gathered some of the world's biggest tech billionaires - Nvidia chief Jensen Huang and Apple's Tim Cook - to attend the signing of the deal at Chequers. Number 10 added up a series of planned commercial decisions to tout the prospect of £150bn of inward investment.  How that shakes down remains to be seen, but it undoubtedly gave the PM a positive story to sell ahead of the November budget, as the government spoke of thousands of tech and nuclear jobs being created in red wall seats like Hartlepool and Blythe in Northumberland. A prime minister doing business on behalf of hard-working Britons is the message No 10 wants you to take away from all of it. Because for a Labour government on the ropes, being able to talk about investment and new jobs in red wall towns is a story Sir Keir really needs to tell. This is a PM who desperately needs to persuade voters he and Chancellor Rachel Reeves can deliver a real growth strategy ahead of the budget. You could see it on the face of the PM as he hailed the new tech deal and massive investment into the UK. No 10 figures tell me Starmer's personal relationship with Trump helped created \"bigger than expected deals\". Another long-term ally of the PM told me: \"Today [the prime minister] got to remind people what he's in it for, and what he's good at.\" Beyond the business, Sir Keir also found a way to disagree agreeably with the president. On the matter of the UK's imminent decision to recognise the Palestine state, the president was open that this was an area of disagreement, but didn't berate Sir Keir over it. Explainer: What does recognising a Palestinian state mean?  Not rocking the boats There was a bit of a ripple at the news conference when Trump said he'd told Sir Keir he should \"call out the military\" to stop illegal migration into Britain, but these were two leaders who clearly had genuine regard and respect for each other, and for the lesser partner in the relationship - the UK - that really is a boon. But in the main, Trump didn't want to rock the boat. When I asked him, as the final question of the news conference, whether he had sympathy for Lord Mandelson for being sacked over his relationship with Jeffrey Epstein, the president, who also has an historic connection, totally swerved the question, saying - despite having Lord Mandelson in the Oval Office several times - he \"didn't know him\".  'Extraneous shocks' For a firebrand president, it was an overt attempt to avoid a headline. For the Starmer team, this state visit was a bit - dare I say it, after all the resets - of an attempt to get the government back on track after a torrid start to the new term. There is a view in Downing Street that the PM was hit by two \"extraneous shocks\" - Angela Rayner's tax affairs and Mandelson's emails in which he backed Epstein after his conviction - which were out of No 10's control. Listen: The fall and rise and fall (again) of Peter Mandelson This state visit was a moment to get the government back on track with momentum going into the Labour Party conference later this month. It will no doubt be a huge confidence boost to a battered prime minister who will perhaps find a renewed sense of purpose from being instrumental in landing real wins for the British people beyond the platitudes of the \"special relationship\". In a way, it's curious for me that the state visit of Trump, which I remember as a moment of jeopardy (see Theresa May in 2019), has been a moment of respite and validation for the prime minister. It is perhaps a reflection that Sir Keir has found it easier to navigate the global stage since winning power than the domestic one. He faces big challenges into the autumn, not least turning up at the party conference to address a Labour membership out of sorts with their leader. Then comes the budget, with all the pain of the economic outlook and prospects of tax rises. There is the pressure over small boats and the sluggish performance in the polls, too. But there is also the much-needed lift of a successful state visit, touting billions of investment and thousands of new jobs which the prime minister will grab as he looks for momentum - as he eyes the long journey ahead."
    },
    {
        "title": "MI6 launches new drive to recruit spies - including Russians",
        "description": "MI6 is launching a new dark web portal to recruit spies for the UK.",
        "url": "https://news.sky.com/story/mi6-launches-new-drive-to-recruit-spies-including-russians-13433714",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vauxhall-london-mi6_6943025.jpg?20250615212519",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-18 21:41:00",
        "Headline": "The secure messaging platform Silent Courier aims to boost national security by making it easier for the MI6 to recruit potential agents, the Foreign Office said.",
        "Content": "MI6 is launching a new dark web portal to recruit spies for the UK. The secure messaging platform Silent Courier aims to boost national security by making it easier for the intelligence agency to recruit potential agents in Russia and around the world, the Foreign Office said. Foreign Secretary Yvette Cooper said: \"As the world changes, and the threats we're facing multiply, we must ensure the UK is always one step ahead of our adversaries.\" Silent Courier is accessible from Friday and enables a secure avenue to submit sensitive information to the UK relating to terrorism or hostile intelligence activity. Instructions on how to use the portal - including recommendations to use trustworthy VPNs and devices not linked to users - will be available on MI6's verified YouTube channel. Sir Richard Moore, the outgoing MI6 chief, is set to announce Silent Courier and confirm details about the portal during a speech in Istanbul on Friday. Read more from Sky News:Three arrested on suspicion of helping Russian intelligenceTeenagers charged over cyber attack on TfL costing millions Mr Moore, who has previously called on Russians to spy for Britain, is expected to say: \"Today we're asking those with sensitive information on global instability, international terrorism or hostile state intelligence activity to contact MI6 securely online. \"Our virtual door is open to you.\" The CIA launched a similar approach in 2023, publishing videos on social media to target potential Russian spies."
    },
    {
        "title": "Trade unions gear up to nominate candidate in contest for Labour deputy",
        "description": "Two of the most important Labour-affiliated unions are set to nominate their choice for who should replace Angela Rayner as the party's deputy leader.",
        "url": "https://news.sky.com/story/trade-unions-gear-up-to-nominate-candidate-in-contest-for-labour-deputy-13433308",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "Home",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-09-18 11:19:00",
        "Headline": "Unison and GMB will soon choose whether they want Bridget Phillipson or Lucy Powell to replace Angela Rayner as Labour's deputy leader.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Two of the most important Labour-affiliated unions are set to nominate their choice for who should replace Angela Rayner as the party's deputy leader. Unison and GMB will pick their candidate on 25 September - two days ahead of the deadline for nominations for Labour affiliates and local party branches. Bridget Phillipson, the education secretary, is seen as the government's choice of candidate in the race, which has effectively turned into a de facto confidence vote on Sir Keir Starmer's leadership. She is up against Lucy Powell, who was sacked as Commons leader in the recent reshuffle and has become the candidate for MPs who are unhappy with the party's direction after a difficult first year in government. Ms Phillipson has already secured the backing of the two unions - Community and the Union of Shop, Distributive and Allied Workers. Will unions want to say 'sod you' to PM? There are question marks over who Unison, GMB and Unite will back in the race, triggered by Ms Rayner quitting as deputy leader, deputy prime minister and housing secretary over underpaid stamp duty on a second home. While Ms Phillipson may be boosted by having the backing of Number 10, the level of discontent in the Labour Party and wider union movement is at such a level that Ms Powell's \"outsider\" status may benefit her. One union source told Sky News that while they felt Ms Phillipson was the \"better candidate\", \"the temptation to vote Lucy to give a 'sod you' to government is a lot\". They added: \"Number 10 need to start fearing the party. They've had it too easy.\" Read more:Why sacking Lucy Powell might come back to haunt StarmerHow can a UK prime minister be ousted? Another union insider said there was a \"sense among union leaders that they wish this wasn't happening\". They questioned how important a role the unions would play in this contest due to the tight timetable, making it harder for them to mobilise behind a candidate. \"Most unions feel this is not a hugely impactful moment either way,\" they said. \"Many of their members will be feeling quite grumpy at how things are going with the government, but at the same time, union leaders won't want to get on the wrong side of Number 10 over something that is not going to make a meaningful difference in the long term.\" There are questions over the extent of Unite's involvement and interest in the race. Although the union is Labour's biggest supporter, Sharon Graham, its general secretary, has sought to turn its focus away from internal party politics and on to industrial disputes. On the first day of the Trades Union Congress in Brighton, she told Sky News she'd be \"looking very much at their track record - have they backed workers? That's what I'll be looking for\". How will the race play out? In order to proceed to the next stage of the contest, the two candidates must each secure nominations from at least 5% of constituency Labour parties, or at least three organisations affiliated that to the party. At least two of these must be trade unions which make up 5% of fully paid-up affiliated party members. The deadline to secure the necessary support is Saturday 27 September. The Labour Party's annual conference begins the next day, where the candidates who have secured the required backing will be able to make their pitches directly to members in a final hustings. Ms Phillipson has pitched herself as the candidate who can \"unite\" the party after a difficult first year in power, which has seen Labour sink to just 20% in the polls, behind Nigel Farage's Reform, which is leading on 28%. Ms Phillipson, who has spoken of growing up in a working class area of Sunderland before going on to high office, said she was the person to take on Reform and secure a second term for Labour. Speaking at a hustings event last week, she told members: \"You can use this contest to look backward, to pass judgment on what has happened in the last year, or you can use it to shape positively what happens in the run-up to the next election.\"  'Unforced errors' cost government Her message comes in contrast to that of Ms Powell, who has pitched herself as the \"shop steward\" of the parliamentary party willing to deliver criticism to the prime minister if necessary. She said Labour's mistakes in office over welfare and winter fuel payments had given the impression that it is \"not on the side of ordinary people\". In an interview with the BBC, Ms Powell praised the government's \"many achievements\", but added: \"Some of the mistakes that we've made, or some of the unforced errors, have given a sense that we're not on the side of ordinary people.\" Although Ms Powell secured fewer nominations from MPs than Ms Phillipson, recent polling by Survation suggests she is ahead with members on 47%, compared with 30% for her rival."
    },
    {
        "title": "Norman Foster on 'incredible' masterplan for new Manchester United ground",
        "description": "Football and the royals are two subjects which have always attracted very outspoken fans. Now, aged 90, Lord Norman Foster is attempting to please both.",
        "url": "https://news.sky.com/story/norman-foster-on-incredible-masterplan-for-new-manchester-united-ground-13433516",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-manchester-united-new-stadium_6852942.jpg?20250311101208",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-18 16:11:00",
        "Headline": "Lord Norman Foster says Manchester United's new stadium is going to be \"different... and better\"  - and criticises the short-term thinking he blames for the cancellation of HS2.",
        "Content": "\n          Arts and entertainment correspondent\n        Football and the royals are two subjects which have always attracted very outspoken fans. Now, aged 90, Lord Norman Foster is attempting to please both. One of the one of the world's most important living architects, he is known for being the vision behind some of the world's most iconic designs - including London's \"Gherkin\" building, the Millennium Bridge and the British Museum's spectacular Great Court. Arguably, however, two of his most talked about designs are yet to be built. In June, his firm Foster + Partners was announced as having won the commission to build a national memorial in honour of the late Queen Elizabeth II. Before that, in March, his firm's vision for a new 100,000-seater stadium at Old Trafford was revealed, which he describes as \"the project of a lifetime\". 'A galvanising project' \"The fan base is incredible,\" Lord Foster said of his excitement at being commissioned to work on the new ground. For the renowned architect it is a homecoming of sorts, given Lord Foster's working-class roots, having grown-up in Manchester. Was he excited to be involved? \"You bet,\" he exclaims. \"It's a galvanising project… and so many things can naturally ride on the back of that sporting, emblematic kind of team.\" Set to cost around £2bn - with its three tall masts acting as a vast umbrella over Old Trafford - the design is part of a larger regeneration project which Lord Foster claims could be completed in five years. It is described as a \"master plan that will create streets, squares, neighbourhoods and connect with the heart of Manchester.\" Asked whether it will feel unlike any other British stadium, he said: \"Manchester United is different and therefore its stadium's going to be different… and better, of course.\" And what of the QEII memorial? He says his design to remember the late monarch in London's St James' Park will be \"more of all the good things\". His plans include a statue of Queen Elizabeth II standing next to her husband Prince Philip, and a semi-glass bridge which is a nod to her wedding tiara. As for those who've questioned whether maintaining its sparkle might prove to be problematic, Lord Foster insists it'll be \"less maintenance, more joy\". He says his hope is \"to address the many millions who traverse that [park], the daily commuters and many tourists, and to make that more human, to make it a better experience and a reminder of the legacy of the most extraordinary long-serving monarch\". After collecting the London Design Festival's prestigious lifetime achievement medal earlier this week, with six decades of experience under his belt, Lord Foster says he finds Britain's inability to invest in infrastructure frustrating. \"I lamented, like so many, the cancellation of HS2,\" he says. The long-delayed rail route's northern leg to Manchester was scrapped by Rishi Sunak in 2023. \"That was about levelling-up. It wasn't about getting from one place in lightning speed, it was taking the burden off the regional network so it would serve local communities better.\" He says \"connectivity is the answer to many of the social issues that we talk about\". The tendency of politicians, he says, to prioritise short-term issues doesn't help when it comes to seeing the bigger picture. \"There is not the awareness of the importance of design and planning… you do need a political awareness,\" he says. \"The city is not static, it's dynamic. It's always changing, evolving, adapting to change, and it can do that well, or it can do it badly. But it needs planning, it needs anticipation.\""
    },
    {
        "title": "Why Starmer's move to recognise Palestine is a major shift",
        "description": "The UK is to recognise the state of Palestine, potentially as soon as this weekend - with the prime minister insisting it was always part of the plan.",
        "url": "https://news.sky.com/story/why-starmers-move-to-recognise-palestine-is-a-major-shift-13433439",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-action-court_7021794.jpg?20250916074318",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-18 14:28:00",
        "Headline": "Sir Keir Starmer is expected to formally recognise Palestine as a state in the coming days, despite opposition from Donald Trump. Sky News takes a look at how the prime minister's position has evolved.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  The UK is to recognise the state of Palestine, potentially as soon as this weekend - with the prime minister insisting it was always part of the plan. It was a Labour manifesto commitment, but the party's position has evolved in government. Some of the party's early positions cast a long shadow over its year in power, sometimes obscuring what action the government has taken. So here's what actually happened. Keir Starmer's reputation among those most passionate about Gaza largely rested on one LBC interview he did shortly after the 7 October attacks, while still in opposition, where he seemed to suggest Israel had the right to withhold power and water from Gaza. But it wasn't just one interview that caused the collapse in what many have called the \"Muslim vote\". The party changed from supporting a \"humanitarian pause\" to an \"immediate ceasefire\" four months into the war. Some, even within the shadow front bench at the time, said this had come too late. To make things worse, the SNP forced an unedifying vote calling for a ceasefire which Labour initially didn't support, only to change their position a few days later.  Huge swathes of dissatisfaction within the base led to some communities galvanising support behind independent candidates who then took major Labour seats, notably Jonathan Ashworth's in Leicester South and Khalid Mahmood's in Birmingham. So, when a Labour government walked into Downing Street in July last year, they knew their actions had to be very different - and they were. They removed blocks on the delivery of humanitarian aid, they restored UK funding for UNRWA, a UN aid agency in the Gaza Strip, and they demanded the international courts (ICC and ICJ) be respected, undoing blocks imposed by the previous Conservative government. But they stopped short of publishing legal advice they had promised to do while in opposition. Now, after a year in power, they point to other serious interventions.  The government said it would respect its obligations in regards to an international arrest warrant for Benjamin Netanyahu for alleged war crimes. It suspended talks on a trade deal with Israel and imposed new sanctions against organisations that have supported and perpetuated \"heinous abuses of human rights\" against Palestinian communities in the occupied West Bank. It also imposed sanctions on two Israeli ministers, Itamar Ben-Gvir and Bezalel Smotrich, for \"repeated incitements of violence against Palestinian communities\". But there are still questions over arms licenses and publishing legal advice - a promise not kept - that we asked about. We \"categorically do not export any bombs or ammunition for use in military operations in Gaza\", said a government spokesperson. \"Most military export licenses to Israel are for commercial or civilian use, such as product testing or body-armour for journalists and NGOs,\" they added. Read more:What does recognising a Palestinian state mean?Sadiq Khan calls out Gaza 'genocide' Backbenchers should also get some credit. This summer, just before the UK hastily announced it would recognise Palestinian statehood right after France declared, a letter signed by over 100 MPs (including many of Starmer's own) demanded the government state its position. MPs I've spoken to say this pressure undoubtedly helped make the case for it inside the government. It's hard to predict what's next, but it's likely backbenchers will now be pushing for stronger language from the government after a commission established by the UN said this month that a genocide was taking place in Gaza - something repeatedly denied by Israel.  Sadiq Khan, the mayor of London, has also now publicly labelled Israel's actions as genocidal. The biggest hope for the UK is that a peace deal is achieved, that's what this recognition is largely about - a condition set by some of the Arab states. But, until that outcome, this recognition is a major policy shift for the UK - perhaps the biggest one the Labour government has made on this issue since the conflict began."
    },
    {
        "title": "The big story from Bank of England is an easing in tightening to avert massive losses",
        "description": "For the most part, when people think about the Bank of England and what it does to control the economy, they think about interest rates. ",
        "url": "https://news.sky.com/story/the-big-story-from-bank-of-england-is-an-easing-in-tightening-to-avert-massive-losses-13433278",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-living-money-bailey_6965893.png?20250716092313",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-09-18 10:26:00",
        "Headline": "Sky's economics and data editor Ed Conway explains how an unwinding of historic Bank support for the UK economy has been rowed back on, to save us many billions of pounds.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n For the most part, when people think about the Bank of England and what it does to control the economy, they think about interest rates.  And that's quite understandable. After all, influencing inflation by raising or lowering the prevailing borrowing costs across the UK has been the Bank's main tool for the vast majority of its history. There are data series on interest rates in the Bank's archives that go all the way back to its foundation in 1694. But depicting the Bank of England as being mostly about interest rates is no longer entirely true. For one thing, these days it is also in charge of regulating the financial system. And, even more relevant for the wider economy, it is engaged in another policy with enormous consequences - both for the markets and for the public purse. But since this policy is pretty complex, few outside of the financial world are even aware of it. Money latest: What interest rate hold means for you That project is quantitative easing (QE) or, as it's better known these days, quantitative tightening (QT). You might recall QE from the financial crisis. It was, in short, what the Bank did when interest rates went down to zero and it needed an extra tool to inject some oomph into the economy. That tool was QE. Essentially it involved creating money (printing it electronically) to buy up assets. The idea was twofold: first, it means you have more money sloshing around the economy - an important concept given the Great Depression of the 1930s had been associated with a sudden shortage of money. Second, it was designed to try to bring down the interest rates prevailing in financial markets - in other words, not the interest rate set by the Bank of England but the yields on long-dated bonds like the ones issued by the government. \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 \n                  Firms cut jobs at fastest pace since 2021, Bank of England data shows\n                 \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                  So the Bank printed a lot of money - hundreds of billions of pounds - and bought hundreds of billions worth of assets. It could theoretically have spent that money on anything: stocks, shares, debt, housing. I calculated a few years ago that with the sums it forked out, it could theoretically have bought every home in Scotland.  But the assets it chose to buy were not Scottish homes but government bonds, mostly, it said back at the time (this was 2009) because they were the most available liquid asset out there. That had a couple of profound consequences. The first was that from the very beginning QE was a technical policy most people didn't entirely understand. It was all happening under the radar in financial markets. No one, save for the banks and funds selling government bonds (gilts, as they're known) ever saw the money. The second consequence is that we're starting to reckon with today. Roll on a decade-and-a-half and the Bank of England had about £895bn worth of bonds sitting on its balance sheet, bought during the various spurts of QE - a couple of spurts during the financial crisis, another in the wake of the EU referendum and more during COVID. Some of those bonds were bought at low prices but, especially during the pandemic, they were bought for far higher prices (or, since the yield on these bonds moves in opposite directions to the price, at lower yields). Then, three years ago, the Bank began to reverse QE. That meant selling off those bonds. And while it bought many of those bonds at high prices, it has been selling them at low prices. In some cases it has been losing astounding amounts on each sale. Take the 2061 gilt. It bought a slug of them for £101 a go, and has sold them for £28 a piece. Hence realising a staggering 73% loss. Tot it all up and you're talking about losses, as a result of the reversal of QE, of many billions of pounds. At this point it's worth calibrating your sense of these big numbers. Broadly speaking, £10bn is a lot of money - equivalent to around an extra penny on income tax. The fiscal \"black hole\" Rachel Reeves is facing at the forthcoming budget is, depending on who you ask, maybe £20bn.  Well, the total losses expected on the Bank of England's Quantitative Tightening programme (\"tightening\" because it's the opposite of easing) is a whopping £134bn, according to the Office for Budget Responsibility. Now it's worth saying first off that, as things stand at least, not all of those losses have been crystallised. But over time it is expected to lose what are, to put it lightly, staggering sums. And they are sums that are being, and will be paid, by British taxpayers in the coming years and decades. Now, if you're the Bank of England, you argue that the cost was justifiable given the scale of economic emergency faced in 2008 and onwards. Looking at it purely in terms of fiscal losses is to miss the point, they say, because the alternative was that the Bank didn't intervene and the UK economy would have faced hideous levels of recession and unemployment in those periods. However, there's another, more subtle, critique, voiced recently by economists like Christopher Mahon at Columbia Threadneedle Investments, which is that the Bank has been imprudent in its strategy of selling off these assets. They could, he argues, have sold off these bonds less quickly. They could, for that matter, have been more careful when buying assets not to invest too wholeheartedly in a single class of asset (in this case government bonds) that might be sensitive in future to changes in interest rates. Most obviously, there are other central banks - most notably the Federal Reserve and European Central Bank - that have refrained from actively selling the bonds in their QE portfolios. And, coincidentally or not, these other central banks have incurred far smaller losses than the Bank of England. Or at least it looks like they have - trying to calculate these things is fiendishly hard. But there's another consequence to all of this as well. Because if you're selling off a load of long-dated government bonds then, all else equal, that would have the tendency to push up the yields on those bonds. And this brings us back to the big issue so many people are fixated with right now: really high gilt yields. And it so happens that the very moment Britain's long-term gilt yields began to lurch higher than most other central banks was the moment the Bank embarked on quantitative tightening. But (the plot thickens) that moment was also the precise moment Liz Truss's mini-budget took place. In other words, it's very hard to unpick precisely how much of the divergence in British borrowing costs in recent years was down to Liz Truss and how much was down to the Bank of England. Either way, perhaps by now you see the issue. This incredibly technical and esoteric economic policy might just have had enormous consequences. All of which brings us to the Bank's decision today. By reducing the rate at which it's selling those bonds into the market and - equally importantly - reducing the proportion of long-dated (eg 30 year or so) bonds it's selling, the Bank seems to be tacitly acknowledging (without actually quite acknowledging it formally) that the plan wasn't working - and it needs to change track. However, the extent of the change is smaller than many would have hoped for. So questions about whether the Bank's QT strategy was an expensive mistake are likely to get louder in the coming months."
    },
    {
        "title": "Kimmel 'fired for lack of talent', Trump says, as Obama decries 'government coercion'",
        "description": "Donald Trump has claimed Jimmy Kimmel's late-night talk show was pulled off the air because of \"bad ratings\".",
        "url": "https://news.sky.com/story/jimmy-kimmel-should-have-been-fired-a-long-time-ago-says-trump-after-obamas-criticism-13433412",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel_7024425.jpg?20250918174422",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:45:00",
        "Headline": "Kimmel used his show on Monday to criticise Donald Trump for his response to the assassination of Charlie Kirk.",
        "Content": " Donald Trump has claimed Jimmy Kimmel's late-night talk show was pulled off the air because of \"bad ratings\". Kimmel's programme on US network ABC was axed after he criticised the US president and his allies for their response to the assassination of the right-wing influencer Charlie Kirk. The decision led to accusations that free speech was under attack in the US, with Democrats including former US president Barack Obama and a number of celebrities sounding an alarm. Mr Trump said: \"Well, Jimmy Kimmel was fired because he had bad ratings, more than anything else.\" \"And he said a horrible thing about a great gentleman known as Charlie Kirk.\" Speaking at a news conference alongside Sir Keir Starmer, Mr Trump added: \"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. \"So, you know, you could call that free speech or not. He was fired for lack of talent.\" \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  What we can learn about Charlie Kirk suspect Tyler Robinson from his charging document\n                 \n                  FBI director Kash Patel shouts at Democrat senators over Charlie Kirk and Jeffrey Epstein during oversight hearing\n                 Aboard Air Force One, Mr Trump said: \"When a host is on network television, there is a license. ... I think maybe their license should be taken away.\" He said whether ABC's license could be taken away over Kimmel's comments \"will be up to Brendan Carr\", chairman of the Federal Communications Commission. The US president also said that Kimmel's \"ratings were worse than cold air. I think they got rid of cold air, which is a good thing to do. Look, that's something that we should be talking about for licensing, too\". The latest season of Jimmy Kimmel Live averaged 1.57 million viewers per episode, according to media research firm Nielsen - and the show's YouTube channel has almost 21 million subscribers. What did Kimmel say? Kimmel made the controversial remark on Monday night. He said: \"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\" Speaking about Mr Trump, he added: \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish.\" \"Many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk,\" he continued.  Free speech under attack? Disney-owned ABC then said the show would be taken off air indefinitely, and with immediate effect, after network operator Nexstar - which operates a number of ABC affiliates - said it would stop broadcasting it. But the move - months after fellow CBS late-night show host Stephen Colbert saw his programme cancelled - sparked concern over the state of freedom of speech in the country. Former US president Barack Obama wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\" A string of high-profile celebrities, including actor Ben Stiller, criticised the decision. Mr Stiller reacted to another post on the news, replying: \"This isn't right.\" Actress Alison Brie said in an Instagram story: \"This is unreal. And very scary.\" Actress Jean Smart and comedian Alex Edelman also attacked the move. The American Federation of Musicians, Directors Guild of America, IATSE and SAG-AFTRA have also condemned the ABC's decision in a joint statement. \"The indefinite removal of Jimmy Kimmel Live under government pressure is not an isolated incident. It is part of a disturbing trend of increasing interference in creative expression,\" the unions said. \"This kind of political pressure on broadcasters and artists chills free speech and threatens the livelihoods of thousands of working Americans.\" What happened Kimmel's comments led to the Trump backer Mr Carr threatening to \"take action\" against Disney and ABC. In an interview with conservative podcaster Benny Johnson, he said: \"We can do this the easy way or the hard way.\" After the show was pulled, he then praised Nexstar's broadcasting division, saying \"it is important for broadcasters to push back on Disney programming that they determine falls short of community values\". Kimmel's suspension has triggered outrage from Democrats like California Governor Gavin Newsom, who posted on X: \"The @GOP [Republican Party] does not believe in free speech. They are censoring you in real time.\" Senate minority leader Chuck Schumer called for people \"across the political spectrum… to stop what's happening to Jimmy Kimmel\". A representative for Kimmel did not immediately respond to a request for comment. He has not issued any statement since the show's withdrawal. Sinclear, the largest ABC affiliate group in the US, has called on Mr Kimmel to \"issue a direct apology to the Kirk family\" and \"make a meaningful personal donation to the Kirk Family and Turning Point USA\" in a statement on Thursday. Read more:Analysis: Trump has a creeping control over what gets saidWhat did Jimmy Kimmel say about Charlie Kirk? The company said its ABC stations will air a special in remembrance of Mr Kirk during Jimmy Kimmel Live's timeslot on Friday. Both Disney and Nexstar have FCC business ahead of them. Disney is seeking regulatory approval for ESPN's acquisition of the NFL Network and Nexstar needs the Trump administration go-ahead to complete its $6.2bn purchase of broadcast rival Tegna. Mr Kirk's suspected killer, Tyler Robinson, appeared in court for the first time on Tuesday. Prosecutors said he had expressed negative views about Mr Kirk, an influential media figure in the MAGA movement."
    },
    {
        "title": "Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan",
        "description": "Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel.",
        "url": "https://news.sky.com/story/putin-has-really-let-me-down-says-us-president-donald-trump-13433413",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-trump_7024776.jpg?20250919031400",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:56:00",
        "Headline": "Sir Keir Starmer pointed to the UK's action, including the first return under the \"one in, one out\" deal with France, that happened earlier on Thursday.",
        "Content": " Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel. The US president made the suggestion while stood alongside the prime minister for a typically wide-ranging news conference on Thursday afternoon, bringing his state visit to Britain to an end. Catch up on updates from Trump's state visit Speaking at Chequers, Sir Keir's country retreat, Mr Trump warned illegal migration is \"going to destroy [...] countries from within\" and said \"it doesn't matter if you call out the military\" to deal with small boats. He talked up his own record of stopping people crossing the US-Mexico border. Sir Keir instead pointed to his government's migrant return deal with France, with the first deportation of a man who arrived via small boat taking place on Thursday morning. Further flights are scheduled to take place this week and next, starting Friday, while exchange arrivals to Britain via the legal route agreed with the French are due in the coming days. \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  Four men freed on bail over Trump-Epstein projection at Windsor Castle\n                 \n                  Donald Trump historic state visit - second day in pictures\n                 Mr Trump also used the news conference to admit Vladimir Putin \"has really let me down\", having stepped up his attacks against Ukraine since the two men held a peace summit in Alaska last month.  But asked by Sky News' political editor Beth Rigby if it was a mistake to invite Mr Putin and if he regrets it, the president replied: \"No.\" It's the \"biggest disappointment\" of his presidency that he hasn't managed to end the war, Mr Trump admitted. He said he thought it would be the \"easiest\" to solve because of his relationship with Mr Putin. Sir Keir said the Russian president has \"shown his true face\", and more \"pressure\" is required to make him stop.  Trump reignites war of words with Khan While disappointed with Mr Putin, Mr Trump spared his harshest rhetoric for Sir Keir's friend Sadiq Khan. Speaking on Air Force One on his way back to the US, where he touched down in the early hours of Friday, he said he asked for the London mayor to be banned from attending the state banquet at Windsor Castle on Wednesday. \"I didn't want him there,\" the president said. \"I asked that he not be there.\" He claimed Sir Sadiq had wanted to be at the event, adding: \"I think the mayor of London Khan is among the worst mayors in the world, and we have some bad ones.\" Sky News understands the mayor didn't seek or expect an invitation. A source close to Sir Sadiq said the capital is a \"global success story\" and \"record numbers of Americans are choosing to make London their home\".  The Trump-Starmer news conference also covered the war in Gaza, the sacking of Lord Mandelson as Britain's US ambassador, energy policy, and a newly signed UK-US tech deal. Speaking about the situation in Gaza, Mr Trump said: \"Simply I want all hostages to be released now.\" He said he disagreed with the UK's plan to recognise a Palestinian state at the UN within days, should Israel not improve the humanitarian situation in Gaza. Trump claims not to know Mandelson Also asked by Beth Rigby if he has sympathy with Lord Mandelson, who was sacked by Sir Keir over past links to paedophile financier Jeffrey Epstein, the president simply said: \"I don't know him.\" That's despite the president being pictured shaking hands with the Labour peer in the Oval Office after announcing a trade deal with the UK back in May. There had been concerns that the Epstein issue could cast a shadow on the president's second state visit to the UK, not least because Mr Trump was also close to Epstein, although they fell out before his conviction in 2009. Read more:Trump historic state visit - second day in picturesEight things you might have missed from state visit Energy policy Mr Trump urged Sir Keir to exploit the UK's North Sea oil and gas resources, dismissing wind power as a \"very expensive joke\". The UK government has ruled out new oil and gas licences in the North Sea, focusing on renewables and building nuclear power stations. Despite their differences, Mr Trump said the bond between the US and Britain is like no other, and he described the prime minister as a \"tough negotiator\". The pair signed a technology prosperity deal, offering major investment by US tech firms in the UK, that will help to develop artificial intelligence (AI) capabilities. Sir Keir also hailed the prospect of £150bn flowing into the UK from big US companies such as Palantir and Blackstone, part of a wider £250bn package that officials say will benefit both sides.  Jimmy Kimmel controversy Meanwhile, Mr Trump also commented on US late-night chat show host Jimmy Kimmel, whose programme has been pulled from schedules after his remarks about the fatal shooting of conservative activist Charlie Kirk. The president claimed the show, Jimmy Kimmel Live!, was suspended because he \"is not a talented person\" and had \"very bad ratings\"."
    },
    {
        "title": "After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump",
        "description": "For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run.",
        "url": "https://news.sky.com/story/after-his-hardest-two-weeks-yet-this-isnt-what-i-expected-to-write-about-starmer-and-trump-13433735",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-trump-starmer_7024444.png?20250918175706",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-18 22:43:00",
        "Headline": "From bagpipe choruses and big ticket tech deals, to disagreeing \"agreeably\", Donald Trump's state visit has put the government back on track after a testing start to the new term, writes Sky's political editor.",
        "Content": "\n          Political editor\n              @BethRigby\n  For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run. It's not a sentence I imagined writing in the run-up to this state visit - particularly when the UK ambassador to the US, Peter Mandelson, was sacked from his post but days ago - but this state visit will go down as a success for a PM in dire need of a win. From the pomp and pageantry of the first day, to the hard business at Chequers, every detail was carefully choreographed to appeal to the president - including a stay in Windsor Castle, and a bagpipe chorus welcoming him (in a nod to his Scottish heritage) into Sir Keir Starmer's country retreat. Starmer went all out to flex all the soft power he could deploy to garner some hard results. There were real wins. The showstopper US-UK tech partnership was hailed by both sides as a new phase in the special relationship, as Trump gathered some of the world's biggest tech billionaires - Nvidia chief Jensen Huang and Apple's Tim Cook - to attend the signing of the deal at Chequers. Number 10 added up a series of planned commercial decisions to tout the prospect of £150bn of inward investment.  How that shakes down remains to be seen, but it undoubtedly gave the PM a positive story to sell ahead of the November budget, as the government spoke of thousands of tech and nuclear jobs being created in red wall seats like Hartlepool and Blythe in Northumberland. A prime minister doing business on behalf of hard-working Britons is the message No 10 wants you to take away from all of it. Because for a Labour government on the ropes, being able to talk about investment and new jobs in red wall towns is a story Sir Keir really needs to tell. This is a PM who desperately needs to persuade voters he and Chancellor Rachel Reeves can deliver a real growth strategy ahead of the budget. You could see it on the face of the PM as he hailed the new tech deal and massive investment into the UK. No 10 figures tell me Starmer's personal relationship with Trump helped created \"bigger than expected deals\". Another long-term ally of the PM told me: \"Today [the prime minister] got to remind people what he's in it for, and what he's good at.\" Beyond the business, Sir Keir also found a way to disagree agreeably with the president. On the matter of the UK's imminent decision to recognise the Palestine state, the president was open that this was an area of disagreement, but didn't berate Sir Keir over it. Explainer: What does recognising a Palestinian state mean?  Not rocking the boats There was a bit of a ripple at the news conference when Trump said he'd told Sir Keir he should \"call out the military\" to stop illegal migration into Britain, but these were two leaders who clearly had genuine regard and respect for each other, and for the lesser partner in the relationship - the UK - that really is a boon. But in the main, Trump didn't want to rock the boat. When I asked him, as the final question of the news conference, whether he had sympathy for Lord Mandelson for being sacked over his relationship with Jeffrey Epstein, the president, who also has an historic connection, totally swerved the question, saying - despite having Lord Mandelson in the Oval Office several times - he \"didn't know him\".  'Extraneous shocks' For a firebrand president, it was an overt attempt to avoid a headline. For the Starmer team, this state visit was a bit - dare I say it, after all the resets - of an attempt to get the government back on track after a torrid start to the new term. There is a view in Downing Street that the PM was hit by two \"extraneous shocks\" - Angela Rayner's tax affairs and Mandelson's emails in which he backed Epstein after his conviction - which were out of No 10's control. Listen: The fall and rise and fall (again) of Peter Mandelson This state visit was a moment to get the government back on track with momentum going into the Labour Party conference later this month. It will no doubt be a huge confidence boost to a battered prime minister who will perhaps find a renewed sense of purpose from being instrumental in landing real wins for the British people beyond the platitudes of the \"special relationship\". In a way, it's curious for me that the state visit of Trump, which I remember as a moment of jeopardy (see Theresa May in 2019), has been a moment of respite and validation for the prime minister. It is perhaps a reflection that Sir Keir has found it easier to navigate the global stage since winning power than the domestic one. He faces big challenges into the autumn, not least turning up at the party conference to address a Labour membership out of sorts with their leader. Then comes the budget, with all the pain of the economic outlook and prospects of tax rises. There is the pressure over small boats and the sluggish performance in the polls, too. But there is also the much-needed lift of a successful state visit, touting billions of investment and thousands of new jobs which the prime minister will grab as he looks for momentum - as he eyes the long journey ahead."
    },
    {
        "title": "Trade unions gear up to nominate candidate in contest for Labour deputy",
        "description": "Two of the most important Labour-affiliated unions are set to nominate their choice for who should replace Angela Rayner as the party's deputy leader.",
        "url": "https://news.sky.com/story/trade-unions-gear-up-to-nominate-candidate-in-contest-for-labour-deputy-13433308",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-09-18 11:19:00",
        "Headline": "Unison and GMB will soon choose whether they want Bridget Phillipson or Lucy Powell to replace Angela Rayner as Labour's deputy leader.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Two of the most important Labour-affiliated unions are set to nominate their choice for who should replace Angela Rayner as the party's deputy leader. Unison and GMB will pick their candidate on 25 September - two days ahead of the deadline for nominations for Labour affiliates and local party branches. Bridget Phillipson, the education secretary, is seen as the government's choice of candidate in the race, which has effectively turned into a de facto confidence vote on Sir Keir Starmer's leadership. She is up against Lucy Powell, who was sacked as Commons leader in the recent reshuffle and has become the candidate for MPs who are unhappy with the party's direction after a difficult first year in government. Ms Phillipson has already secured the backing of the two unions - Community and the Union of Shop, Distributive and Allied Workers. Will unions want to say 'sod you' to PM? There are question marks over who Unison, GMB and Unite will back in the race, triggered by Ms Rayner quitting as deputy leader, deputy prime minister and housing secretary over underpaid stamp duty on a second home. While Ms Phillipson may be boosted by having the backing of Number 10, the level of discontent in the Labour Party and wider union movement is at such a level that Ms Powell's \"outsider\" status may benefit her. One union source told Sky News that while they felt Ms Phillipson was the \"better candidate\", \"the temptation to vote Lucy to give a 'sod you' to government is a lot\". They added: \"Number 10 need to start fearing the party. They've had it too easy.\" Read more:Why sacking Lucy Powell might come back to haunt StarmerHow can a UK prime minister be ousted? Another union insider said there was a \"sense among union leaders that they wish this wasn't happening\". They questioned how important a role the unions would play in this contest due to the tight timetable, making it harder for them to mobilise behind a candidate. \"Most unions feel this is not a hugely impactful moment either way,\" they said. \"Many of their members will be feeling quite grumpy at how things are going with the government, but at the same time, union leaders won't want to get on the wrong side of Number 10 over something that is not going to make a meaningful difference in the long term.\" There are questions over the extent of Unite's involvement and interest in the race. Although the union is Labour's biggest supporter, Sharon Graham, its general secretary, has sought to turn its focus away from internal party politics and on to industrial disputes. On the first day of the Trades Union Congress in Brighton, she told Sky News she'd be \"looking very much at their track record - have they backed workers? That's what I'll be looking for\". How will the race play out? In order to proceed to the next stage of the contest, the two candidates must each secure nominations from at least 5% of constituency Labour parties, or at least three organisations affiliated that to the party. At least two of these must be trade unions which make up 5% of fully paid-up affiliated party members. The deadline to secure the necessary support is Saturday 27 September. The Labour Party's annual conference begins the next day, where the candidates who have secured the required backing will be able to make their pitches directly to members in a final hustings. Ms Phillipson has pitched herself as the candidate who can \"unite\" the party after a difficult first year in power, which has seen Labour sink to just 20% in the polls, behind Nigel Farage's Reform, which is leading on 28%. Ms Phillipson, who has spoken of growing up in a working class area of Sunderland before going on to high office, said she was the person to take on Reform and secure a second term for Labour. Speaking at a hustings event last week, she told members: \"You can use this contest to look backward, to pass judgment on what has happened in the last year, or you can use it to shape positively what happens in the run-up to the next election.\"  'Unforced errors' cost government Her message comes in contrast to that of Ms Powell, who has pitched herself as the \"shop steward\" of the parliamentary party willing to deliver criticism to the prime minister if necessary. She said Labour's mistakes in office over welfare and winter fuel payments had given the impression that it is \"not on the side of ordinary people\". In an interview with the BBC, Ms Powell praised the government's \"many achievements\", but added: \"Some of the mistakes that we've made, or some of the unforced errors, have given a sense that we're not on the side of ordinary people.\" Although Ms Powell secured fewer nominations from MPs than Ms Phillipson, recent polling by Survation suggests she is ahead with members on 47%, compared with 30% for her rival."
    },
    {
        "title": "Norman Foster on 'incredible' masterplan for new Manchester United ground",
        "description": "Football and the royals are two subjects which have always attracted very outspoken fans. Now, aged 90, Lord Norman Foster is attempting to please both.",
        "url": "https://news.sky.com/story/norman-foster-on-incredible-masterplan-for-new-manchester-united-ground-13433516",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-manchester-united-new-stadium_6852942.jpg?20250311101208",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-18 16:11:00",
        "Headline": "Lord Norman Foster says Manchester United's new stadium is going to be \"different... and better\"  - and criticises the short-term thinking he blames for the cancellation of HS2.",
        "Content": "\n          Arts and entertainment correspondent\n        Football and the royals are two subjects which have always attracted very outspoken fans. Now, aged 90, Lord Norman Foster is attempting to please both. One of the one of the world's most important living architects, he is known for being the vision behind some of the world's most iconic designs - including London's \"Gherkin\" building, the Millennium Bridge and the British Museum's spectacular Great Court. Arguably, however, two of his most talked about designs are yet to be built. In June, his firm Foster + Partners was announced as having won the commission to build a national memorial in honour of the late Queen Elizabeth II. Before that, in March, his firm's vision for a new 100,000-seater stadium at Old Trafford was revealed, which he describes as \"the project of a lifetime\". 'A galvanising project' \"The fan base is incredible,\" Lord Foster said of his excitement at being commissioned to work on the new ground. For the renowned architect it is a homecoming of sorts, given Lord Foster's working-class roots, having grown-up in Manchester. Was he excited to be involved? \"You bet,\" he exclaims. \"It's a galvanising project… and so many things can naturally ride on the back of that sporting, emblematic kind of team.\" Set to cost around £2bn - with its three tall masts acting as a vast umbrella over Old Trafford - the design is part of a larger regeneration project which Lord Foster claims could be completed in five years. It is described as a \"master plan that will create streets, squares, neighbourhoods and connect with the heart of Manchester.\" Asked whether it will feel unlike any other British stadium, he said: \"Manchester United is different and therefore its stadium's going to be different… and better, of course.\" And what of the QEII memorial? He says his design to remember the late monarch in London's St James' Park will be \"more of all the good things\". His plans include a statue of Queen Elizabeth II standing next to her husband Prince Philip, and a semi-glass bridge which is a nod to her wedding tiara. As for those who've questioned whether maintaining its sparkle might prove to be problematic, Lord Foster insists it'll be \"less maintenance, more joy\". He says his hope is \"to address the many millions who traverse that [park], the daily commuters and many tourists, and to make that more human, to make it a better experience and a reminder of the legacy of the most extraordinary long-serving monarch\". After collecting the London Design Festival's prestigious lifetime achievement medal earlier this week, with six decades of experience under his belt, Lord Foster says he finds Britain's inability to invest in infrastructure frustrating. \"I lamented, like so many, the cancellation of HS2,\" he says. The long-delayed rail route's northern leg to Manchester was scrapped by Rishi Sunak in 2023. \"That was about levelling-up. It wasn't about getting from one place in lightning speed, it was taking the burden off the regional network so it would serve local communities better.\" He says \"connectivity is the answer to many of the social issues that we talk about\". The tendency of politicians, he says, to prioritise short-term issues doesn't help when it comes to seeing the bigger picture. \"There is not the awareness of the importance of design and planning… you do need a political awareness,\" he says. \"The city is not static, it's dynamic. It's always changing, evolving, adapting to change, and it can do that well, or it can do it badly. But it needs planning, it needs anticipation.\""
    },
    {
        "title": "MI6 launches new drive to recruit spies - including Russians",
        "description": "MI6 is launching a new dark web portal to recruit spies for the UK.",
        "url": "https://news.sky.com/story/mi6-launches-new-drive-to-recruit-spies-including-russians-13433714",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vauxhall-london-mi6_6943025.jpg?20250615212519",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-18 21:41:00",
        "Headline": "The secure messaging platform Silent Courier aims to boost national security by making it easier for the MI6 to recruit potential agents, the Foreign Office said.",
        "Content": "MI6 is launching a new dark web portal to recruit spies for the UK. The secure messaging platform Silent Courier aims to boost national security by making it easier for the intelligence agency to recruit potential agents in Russia and around the world, the Foreign Office said. Foreign Secretary Yvette Cooper said: \"As the world changes, and the threats we're facing multiply, we must ensure the UK is always one step ahead of our adversaries.\" Silent Courier is accessible from Friday and enables a secure avenue to submit sensitive information to the UK relating to terrorism or hostile intelligence activity. Instructions on how to use the portal - including recommendations to use trustworthy VPNs and devices not linked to users - will be available on MI6's verified YouTube channel. Sir Richard Moore, the outgoing MI6 chief, is set to announce Silent Courier and confirm details about the portal during a speech in Istanbul on Friday. Read more from Sky News:Three arrested on suspicion of helping Russian intelligenceTeenagers charged over cyber attack on TfL costing millions Mr Moore, who has previously called on Russians to spy for Britain, is expected to say: \"Today we're asking those with sensitive information on global instability, international terrorism or hostile state intelligence activity to contact MI6 securely online. \"Our virtual door is open to you.\" The CIA launched a similar approach in 2023, publishing videos on social media to target potential Russian spies."
    },
    {
        "title": "Why Starmer's move to recognise Palestine is a major shift",
        "description": "The UK is to recognise the state of Palestine, potentially as soon as this weekend - with the prime minister insisting it was always part of the plan.",
        "url": "https://news.sky.com/story/why-starmers-move-to-recognise-palestine-is-a-major-shift-13433439",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-action-court_7021794.jpg?20250916074318",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-18 14:28:00",
        "Headline": "Sir Keir Starmer is expected to formally recognise Palestine as a state in the coming days, despite opposition from Donald Trump. Sky News takes a look at how the prime minister's position has evolved.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  The UK is to recognise the state of Palestine, potentially as soon as this weekend - with the prime minister insisting it was always part of the plan. It was a Labour manifesto commitment, but the party's position has evolved in government. Some of the party's early positions cast a long shadow over its year in power, sometimes obscuring what action the government has taken. So here's what actually happened. Keir Starmer's reputation among those most passionate about Gaza largely rested on one LBC interview he did shortly after the 7 October attacks, while still in opposition, where he seemed to suggest Israel had the right to withhold power and water from Gaza. But it wasn't just one interview that caused the collapse in what many have called the \"Muslim vote\". The party changed from supporting a \"humanitarian pause\" to an \"immediate ceasefire\" four months into the war. Some, even within the shadow front bench at the time, said this had come too late. To make things worse, the SNP forced an unedifying vote calling for a ceasefire which Labour initially didn't support, only to change their position a few days later.  Huge swathes of dissatisfaction within the base led to some communities galvanising support behind independent candidates who then took major Labour seats, notably Jonathan Ashworth's in Leicester South and Khalid Mahmood's in Birmingham. So, when a Labour government walked into Downing Street in July last year, they knew their actions had to be very different - and they were. They removed blocks on the delivery of humanitarian aid, they restored UK funding for UNRWA, a UN aid agency in the Gaza Strip, and they demanded the international courts (ICC and ICJ) be respected, undoing blocks imposed by the previous Conservative government. But they stopped short of publishing legal advice they had promised to do while in opposition. Now, after a year in power, they point to other serious interventions.  The government said it would respect its obligations in regards to an international arrest warrant for Benjamin Netanyahu for alleged war crimes. It suspended talks on a trade deal with Israel and imposed new sanctions against organisations that have supported and perpetuated \"heinous abuses of human rights\" against Palestinian communities in the occupied West Bank. It also imposed sanctions on two Israeli ministers, Itamar Ben-Gvir and Bezalel Smotrich, for \"repeated incitements of violence against Palestinian communities\". But there are still questions over arms licenses and publishing legal advice - a promise not kept - that we asked about. We \"categorically do not export any bombs or ammunition for use in military operations in Gaza\", said a government spokesperson. \"Most military export licenses to Israel are for commercial or civilian use, such as product testing or body-armour for journalists and NGOs,\" they added. Read more:What does recognising a Palestinian state mean?Sadiq Khan calls out Gaza 'genocide' Backbenchers should also get some credit. This summer, just before the UK hastily announced it would recognise Palestinian statehood right after France declared, a letter signed by over 100 MPs (including many of Starmer's own) demanded the government state its position. MPs I've spoken to say this pressure undoubtedly helped make the case for it inside the government. It's hard to predict what's next, but it's likely backbenchers will now be pushing for stronger language from the government after a commission established by the UN said this month that a genocide was taking place in Gaza - something repeatedly denied by Israel.  Sadiq Khan, the mayor of London, has also now publicly labelled Israel's actions as genocidal. The biggest hope for the UK is that a peace deal is achieved, that's what this recognition is largely about - a condition set by some of the Arab states. But, until that outcome, this recognition is a major policy shift for the UK - perhaps the biggest one the Labour government has made on this issue since the conflict began."
    },
    {
        "title": "Home Office can deport migrant under 'one in one out deal', court says - after losing similar case on Tuesday",
        "description": "An Eritrean man can be deported to France under the government's 'one in, one out' scheme, a judge has ruled.",
        "url": "https://news.sky.com/story/home-office-wins-second-legal-challenge-over-deportation-flights-under-one-in-one-out-deal-13433425",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-small-boat-migrants_6962503.jpg?20250711110447",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-18 14:12:00",
        "Headline": "The Home Office faced its second legal challenge after a High Court judge issued a temporary halt to plans to deport another man over human trafficking concerns.",
        "Content": "An Eritrean man can be deported to France under the government's 'one in, one out' scheme, a judge has ruled. It's the second similar case to come before the High Court this week. In the first, separate case, another man's deportation was temporarily blocked. Whereas, the government has won the right to return the man at the centre of this legal challenge to France. The man, who cannot be named for legal reasons, is from Eritrea and arrived in the UK last month after crossing the English Channel on a small boat. He was allegedly forced to flee his home country in 2019 because of forced conscription, and passed through Ethiopia, South Sudan, Libya and France, before entering the UK. Lawyers acting for the migrant in today's case said he is due to be deported at 6.15am on Friday morning, but argued he had a \"number of different medical needs\" and that he has been a \"victim of trafficking\". Sonaili Naik KC, representing the migrant, also told the High Court that her client's case had been rushed. She said: \"They have just simply expedited a decision, for the purposes of trying to rush to maintain a removal.\" \n                  What a moment for Shabana Mahmood to take the helm at the Home Office\n                 \n                  Ten organisations write urgent letter to home secretary over violence against women and girls strategy\n                 \n                  'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls\n                 The judge who ruled on this case was also the one who issued the temporary block preventing the other migrant from being deported on Tuesday night, in a move the Home Secretary Shabana Mahmood called \"intolerable\" and vowed to \"fight\".  Mr Justice Sheldon's ruling in that case led to the Home Office revising its policy on reconsidering modern slavery decisions, so that anyone removed to a safe country who wants to appeal against a National Referral Mechanism (NRM) decision - which identifies and assesses victims of slavery and human trafficking - will now be unable to do so. Instead, they can now appeal via judicial review from another country, such as France. This then change came to play a role in this separate case today. Ms Naik told the High Court: \"The secretary of state [Ms Mahmood] has today come to this court to say, without notice to the claimant, that the procedures in France are fine, it is all safe, no problems, the trafficking claims will be dealt with. \"Our prima facie case is that the secretary of state needs assurances from France that that is the case, that non-French nationals trafficked in Libya will have access to the NRM there.\" But Sian Reeves, for the Home Office, responded that there was \"no arguable public law error\" in the way Ms Mahmood altered the policy, given that \"she had ample evidence\". The government lawyer added that there was \"no serious issue to be tried\" as the migrant's alleged \"trafficking claim can be investigated in France\". She insisted to the court that his deportation could go ahead, as his \"rights are protected\" there. Mr Sheldon ruled this evening that he agreed with government lawyers that there was \"no serious issue to be tried in this case\". He added that there is \"significant public interest in favour of the claimant's removal\". The High Court judge also said the migrant had given two very different accounts of being trafficked, meaning that \"his credibility was severely damaged\" and his allegations \"could not reasonably be believed\". Mr Sheldon concluded that the Home Office had \"sufficient information\" to deport the man and that it was \"reasonable\" to conclude that \"further information would not make any material difference\". Read more:How does the UK-France migrants deal work? Has anybody been successfully deported under the scheme yet? Yes. Earlier in the day, a man who illegally crossed the English Channel last month became the first person to be deported under the terms of the government's \"one in, one out\" migrant return deal with France. The Home Office confirmed the man was sent back to France on a commercial flight at 6.15am this morning. His departure follows efforts to deport an Eritrean man on Wednesday morning being blocked the night before by Mr Sheldon.  The department has said further deportation flights are due later this week and into next week. The UK-France deal was signed in July and saw the first migrants detained in the UK to await deportation in August. It allows the UK to send back a migrant who crosses the Channel illegally in exchange for accepting the same number of migrants in France who have a valid asylum claim. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Longer jail term for speeding driver Tasham Mahmood who killed great-grandmother Carol Andrew as she crossed a road",
        "description": "A speeding driver who killed a great-grandmother as she was crossing a road has had his jail sentence increased by more than two years at the Court of Appeal.",
        "url": "https://news.sky.com/story/longer-jail-term-for-speeding-driver-tasham-mahmood-who-killed-great-grandmother-carol-andrew-as-she-crossed-a-road-13433635",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-carol-andrew-west-yorkshire-police_7024609.jpg?20250918204652",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-18 19:27:00",
        "Headline": "Mahmood's sentence was increased to six years and four months after judges accepted the original punishment was \"unduly lenient\".",
        "Content": "A speeding driver who killed a great-grandmother as she was crossing a road has had his jail sentence increased by more than two years at the Court of Appeal. Tasham Mahmood was jailed for four years for killing Carol Andrew as she crossed a road in Heckmondwike, West Yorkshire, in July 2021. Mahmood, 34, who had thrown his dashcam into another vehicle after the collision, was sentenced in April after admitting causing death by dangerous driving. Trump latest - president hits out at mayor On Thursday, the term was increased to six years and four months after a panel of three judges accepted the Solicitor General's case that the original term was \"unduly lenient\" as Mahmood's dangerous driving was \"persistent and prolonged\" and caused an \"unnecessary and avoidable loss of life\". Barristers for Mahmood, who was driving home after being told his brother, who died later that night, was \"seriously unwell\" said the sentence should not be increased. In the judgment, Lord Justice Singh said Ms Andrew's death was \"tragic and needless\", and offered \"sincere sympathy\" to her family. \n                  Man arrested over metal theft at exploded house in Bradford\n                 \n                  Boy, 16, arrested on suspicion of rape and murder after 13-year-old girl's 'unexplained' death\n                 \n                  Ten men arrested over historical child sexual abuse allegations in Bradford\n                 CCTV and dashcam footage showed the \"appalling nature of the offender's driving over a sustained period of time. \"The offender drove dangerously and without regard to the safety of other road users. He performed dangerous manoeuvres.\" Mahmood's disqualification from driving, originally set at seven years, was changed to eight years and two months. Ms Andrew, 69, was walking home with her dog as she crossed White Lee Road in Heckmondwike when she was hit by Mahmood's Seat Leon, lawyers for the Solicitor General said in written submissions. A mother of two, grandmother of four and great-grandmother of one, Ms Andrew suffered \"multiple injuries, including 'massive chest injuries'\" and was pronounced dead at the scene. In the minutes before the collision, Mahmood overtook several vehicles, drove through three red lights, and reached speeds of more than 80mph (129kmh). Read more:Trump visit - day two in picturesEight things you might have missed'Putin has let me down' - Trump He also averaged a speed of more than 60mph (96kmh) on White Lee Road, twice the 30mph (48kmh) speed limit. Mahmood threw his dashcam into the car of a passing motorist who had stopped because of the incident, but the device was later handed in, Ms Oakley said. Mahmood admitted causing Ms Andrew's death in January and was sentenced at Leeds Crown Court in April. Ms Oakley said that in a victim statement, Ms Andrew's family described her as a \"warm, popular and much-loved woman\" whose death had \"devastated the entire family\". Solicitor General Ellie Reeves welcomed the decision, saying Ms Andrew had \"served her community diligently\" while Mahmood's \"reckless driving needlessly took an innocent woman's life\"."
    },
    {
        "title": "Police fire tear gas at protesters during day of strikes in France",
        "description": "Hundreds of thousands of people have taken part in anti-austerity protests and strikes in France.",
        "url": "https://news.sky.com/story/police-fire-tear-gas-at-protesters-during-day-of-strikes-in-france-13433724",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-protester-france-nantes_7024743.jpg?20250918231005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-18 21:55:00",
        "Headline": "There were clashes on the margins of the rallies but the level of violence was not as high as interior minister Bruno Retailleau had feared. Some 80,000 police and gendarmes were deployed.",
        "Content": "Hundreds of thousands of people have taken part in anti-austerity protests and strikes in France. The demonstrators included teachers, train drivers, pharmacists, and hospital staff. A third of primary school teachers were on strike nationwide on Thursday, and nearly half walked out in Paris, the FSU-SNUipp union said. Regional trains were heavily affected, while most of the country's high-speed TGV services were working, officials said. There were clashes on the margins of the rallies, but the level of violence was not as high as interior minister Bruno Retailleau had feared. Some 80,000 police and gendarmes were deployed. Officers in the capital threw tear gas to disperse troublemakers dressed in black who hurled beer cans and stones at them. Police also stopped people targeting banks. There were brief clashes at other protests as well, including in Nantes, and in Lyon, where three people were reportedly injured. The French interior ministry said more than 180 people had been arrested in the unrest. Authorities said over 450,000 people demonstrated outside Paris while another 55,000 marched in the capital. But the CGT union said a million people took part in the strikes and protests. What's driving the unrest? Protesters and unions want President Emmanuel Macron and his new prime minister, close ally Sebastien Lecornu, to scrap looming budget cuts. They have called for the previous government's fiscal plans to be axed, for more spending on public services, and for the wealthy to pay more tax. But Mr Macron and Mr Lecornu, who is a member of his centrist Renaissance party, are also under pressure from investors who are concerned about the deficit in the EU's second-largest economy. Read more:Macron taking big risk in picking loyalist to be next PMThe Block Everything movement has mobilised protesters The country's budget deficit last year was almost double the EU's 3% ceiling. But even though he wants to reduce that, Mr Lecornu - who is reliant on other parties to push through legislation - will face a battle to get enough parliamentary support for a 2026 budget. His predecessor, Francois Bayrou, was ousted by parliament last week over his plan for €44bn (£38bn) of budget cuts. The new prime minister has not yet said what he will do about Mr Bayrou's plans, but has shown a willingness to compromise."
    },
    {
        "title": "Gaza could be 'real estate bonanza', Israeli minister Bezalel Smotrich says",
        "description": "A controversial Israeli minister has said Gaza could be a \"real estate bonanza\" - and that a business plan for redeveloping it had been sent to the US president.",
        "url": "https://news.sky.com/story/gaza-could-be-real-estate-bonanza-israeli-minister-bezalel-smotrich-says-13433205",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-palestinians-israeli_7021890.jpg?20250916093927",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-18 08:00:00",
        "Headline": "Mr Smotrich says Israel has \"paid a lot of money for this war, so we need to divide how we make a percentage on the land marketing\".",
        "Content": "A controversial Israeli minister has said Gaza could be a \"real estate bonanza\" - and that a business plan for redeveloping it had been sent to the US president. Bezalel Smotrich, the country's far-right finance chief, told a Tel Aviv conference he had \"started negotiations\" with the US on how to share the proceeds of any future deal. The comments echo controversial remarks by Donald Trump in February, when he said America would take over Gaza and redevelop it into the \"riviera of the Middle East\" - with its population going to \"various domains\". He later shared a AI-generated video showing it as a Dubai-style city, featuring exotic beaches, skyscrapers, luxury yachts and people partying. Mr Smotrich told the urban regeneration event \"there's a business plan set by the most professional people there is and is on President Trump's table and how this thing turns into a real estate bonanza. I'm not kidding; it pays off\". The minister, who is sanctioned by countries including the UK, Canada and Australia, claimed discussions were already under way on how cash from redeveloping Gaza's shattered landscape would be allocated. Mr Smotrich said Israel had \"paid a lot of money for this war, so we need to divide how we make a percentage on the land marketing later in Gaza\". He added: \"We've done the demolition phase, which is always the first phase of urban renewal. Now we need to build; it's much cheaper.\"  Any effort to forcibly displace Gaza's population for a building project would almost certainly breach the Geneva Convention and cause international outrage - as Mr Trump found when he mooted his plan earlier this year. Israel's offensive in Gaza ratcheted up this week as it launched a major ground offensive to seize all of Gaza City and destroy Hamas. Thousands are heading south with whatever they can in an effort to avoid being killed in the fighting. The operation has prompted widespread condemnation, with UK Foreign Secretary Yvette Cooper calling it \"utterly reckless and appalling\". Ms Cooper - who helped greet the pro-Israel President Trump when he landed in Britain on Tuesday - said it would \"only bring more bloodshed, kill more innocent civilians & endanger the remaining hostages\". With no sign of an imminent ceasefire in Gaza and the situation increasingly dire, Prime Minister Sir Keir Starmer is expected to shortly announce Britain's recognition of a Palestinian state. It is believed he could make the declaration at the weekend to avoid causing division on the issue while President Trump is in the country. The two leaders held talks today at Chequers, where the prime minister was under pressure to urge Mr Trump to use his influence over Israel to rein in its new offensive. The prime minister said in July that recognition would come unless Israel met certain conditions, including taking \"substantive steps\" to end the war and commit to long-term peace. France, Canada and Australia are also set to recognise a Palestinian state at the UN General Assembly next month, while Ireland, Spain and Norway all took the step last year. Read more:What does recognising a Palestinian state mean?Sadiq Khan calls out Gaza 'genocide' Israel says the recognition of a Palestinian state is unacceptable, rewards Hamas, and makes it harder to create the conditions needed to free the remaining hostages. This comes as the Israeli military said that it has advised the government to stop the entry of humanitarian aid for Gaza from Jordan after a deadly shooting until the completion of an inquiry into the incident. The shooting at the Allenby Crossing into the West Bank on Thursday involved a driver bringing humanitarian aid from Jordan for Gaza, who opened fire and killed two Israeli soldiers before being shot dead by security forces. Israel called the incident a \"terror attack\" at the only gateway for Palestinians from the Israeli-occupied West Bank to Jordan, but no group has immediately claimed responsibility for the shooting. \"The driver accused of the operation is Abdul Mutalib al-Qaisi, born in 1968. He is a civilian who began working as a driver delivering aid to Gaza three months ago,\" Jordan's foreign ministry said, adding that the shooting is a threat to its humanitarian role in Gaza. The Israeli military said it asked the government to implement revised screening procedures for Jordanian drivers. More than 65,000 people in Gaza have now been killed in the war, according to the Hamas-run health ministry. The figure does not specify the number of Hamas members killed. At least 63 people were killed on Wednesday, with most of the casualties in Gaza City, local health authorities said. The Hamas terror attack on Israel in October 2023 saw around 1,200 people killed and 251 people taken hostage. Forty-eight remain in Gaza, but fewer than half are thought to still be alive. A report this week from a UN commission said Israel was committing genocide in Gaza - a claim the country vehemently denies as \"distorted and false\". Sky News analysis shows thousands of families remain in crowded tent camps in Gaza City, with the UN estimating last week that a million people remain there. Israel, however, believes 40% of the population has already fled south and on Wednesday opened a new evacuation route for 48 hours."
    },
    {
        "title": "India's state of Kerala fighting rise in cases of rare 'brain-eating' disease",
        "description": "Kerala is facing a serious public health challenge as it's seen a surge in cases of a \"brain-eating\" disease which has caused 19 deaths.",
        "url": "https://news.sky.com/story/indias-state-of-kerala-fighting-rise-in-cases-of-rare-brain-eating-disease-13433206",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-kerala-boat-water-lake_7023743.jpg?20250918100825",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-18 07:59:00",
        "Headline": " The \"brain-eating\" amoeba is a rare but lethal central nervous system infection caused by free-living amoebae found in freshwater, lakes and rivers, a document by the Kerala government showed.",
        "Content": "Kerala is facing a serious public health challenge as it's seen a surge in cases of a \"brain-eating\" disease which has caused 19 deaths. India's southern state of Kerala has reported around 69 cases of primary amoebic meningoencephalitis (PAM) since the beginning of this year, including 19 deaths, the state health minister told the state assembly on Wednesday. Three of the deaths occurred in the last month, including that of a three-month-old child. The rare but fatal form of encephalitis is caused by Naegleria fowleri, commonly known as the \"brain-eating\" amoeba. It is a rare but lethal central nervous system infection caused by free-living amoebae found in freshwater, lakes and rivers, the government document showed. \"Unlike last year, we are not seeing clusters linked to a single water source. These are single, isolated cases, which hascomplicated our epidemiological investigations,\" minister Veena George was quoted as saying by NDTV news. Last year, the state reported 36 cases of PAM and nine deaths, NDTV said. \n                  Internet access in Middle East and Asia disrupted after 'undersea cables cut'\n                 \n                  Chinese, Russian and Indian leaders seek to show unity and push for new world order in Beijing meeting\n                 \n                  China and India discuss disputed border at key summit - as Putin talks about Trump\n                 Read more from Sky News:Jimmy Kimmel taken off air over Charlie Kirk commentsChristian B celebrates release with burger and cigarette The government has begun chlorinating wells, water tanks and public bathing areas, and areas where people are likely to bathe and come in contact with the amoeba, NDTV reported. Globally, the survival rate of PAM is around 3% but because of advanced testing and diagnosis, Kerala has achieved 24%, Ms George has been quoted as saying in local media. \"Climate change raising the water temperature and the heat driving more people to recreational water use is likely toincrease the encounters with this pathogen,\" the government said in the document, which was published last year."
    },
    {
        "title": "Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan",
        "description": "Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel.",
        "url": "https://news.sky.com/story/putin-has-really-let-me-down-says-us-president-donald-trump-13433413",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-trump_7024776.jpg?20250919031400",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:56:00",
        "Headline": "Sir Keir Starmer pointed to the UK's action, including the first return under the \"one in, one out\" deal with France, that happened earlier on Thursday.",
        "Content": " Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel. The US president made the suggestion while stood alongside the prime minister for a typically wide-ranging news conference on Thursday afternoon, bringing his state visit to Britain to an end. Catch up on updates from Trump's state visit Speaking at Chequers, Sir Keir's country retreat, Mr Trump warned illegal migration is \"going to destroy [...] countries from within\" and said \"it doesn't matter if you call out the military\" to deal with small boats. He talked up his own record of stopping people crossing the US-Mexico border. Sir Keir instead pointed to his government's migrant return deal with France, with the first deportation of a man who arrived via small boat taking place on Thursday morning. Further flights are scheduled to take place this week and next, starting Friday, while exchange arrivals to Britain via the legal route agreed with the French are due in the coming days. \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  Four men freed on bail over Trump-Epstein projection at Windsor Castle\n                 \n                  Donald Trump historic state visit - second day in pictures\n                 Mr Trump also used the news conference to admit Vladimir Putin \"has really let me down\", having stepped up his attacks against Ukraine since the two men held a peace summit in Alaska last month.  But asked by Sky News' political editor Beth Rigby if it was a mistake to invite Mr Putin and if he regrets it, the president replied: \"No.\" It's the \"biggest disappointment\" of his presidency that he hasn't managed to end the war, Mr Trump admitted. He said he thought it would be the \"easiest\" to solve because of his relationship with Mr Putin. Sir Keir said the Russian president has \"shown his true face\", and more \"pressure\" is required to make him stop.  Trump reignites war of words with Khan While disappointed with Mr Putin, Mr Trump spared his harshest rhetoric for Sir Keir's friend Sadiq Khan. Speaking on Air Force One on his way back to the US, where he touched down in the early hours of Friday, he said he asked for the London mayor to be banned from attending the state banquet at Windsor Castle on Wednesday. \"I didn't want him there,\" the president said. \"I asked that he not be there.\" He claimed Sir Sadiq had wanted to be at the event, adding: \"I think the mayor of London Khan is among the worst mayors in the world, and we have some bad ones.\" Sky News understands the mayor didn't seek or expect an invitation. A source close to Sir Sadiq said the capital is a \"global success story\" and \"record numbers of Americans are choosing to make London their home\".  The Trump-Starmer news conference also covered the war in Gaza, the sacking of Lord Mandelson as Britain's US ambassador, energy policy, and a newly signed UK-US tech deal. Speaking about the situation in Gaza, Mr Trump said: \"Simply I want all hostages to be released now.\" He said he disagreed with the UK's plan to recognise a Palestinian state at the UN within days, should Israel not improve the humanitarian situation in Gaza. Trump claims not to know Mandelson Also asked by Beth Rigby if he has sympathy with Lord Mandelson, who was sacked by Sir Keir over past links to paedophile financier Jeffrey Epstein, the president simply said: \"I don't know him.\" That's despite the president being pictured shaking hands with the Labour peer in the Oval Office after announcing a trade deal with the UK back in May. There had been concerns that the Epstein issue could cast a shadow on the president's second state visit to the UK, not least because Mr Trump was also close to Epstein, although they fell out before his conviction in 2009. Read more:Trump historic state visit - second day in picturesEight things you might have missed from state visit Energy policy Mr Trump urged Sir Keir to exploit the UK's North Sea oil and gas resources, dismissing wind power as a \"very expensive joke\". The UK government has ruled out new oil and gas licences in the North Sea, focusing on renewables and building nuclear power stations. Despite their differences, Mr Trump said the bond between the US and Britain is like no other, and he described the prime minister as a \"tough negotiator\". The pair signed a technology prosperity deal, offering major investment by US tech firms in the UK, that will help to develop artificial intelligence (AI) capabilities. Sir Keir also hailed the prospect of £150bn flowing into the UK from big US companies such as Palantir and Blackstone, part of a wider £250bn package that officials say will benefit both sides.  Jimmy Kimmel controversy Meanwhile, Mr Trump also commented on US late-night chat show host Jimmy Kimmel, whose programme has been pulled from schedules after his remarks about the fatal shooting of conservative activist Charlie Kirk. The president claimed the show, Jimmy Kimmel Live!, was suspended because he \"is not a talented person\" and had \"very bad ratings\"."
    },
    {
        "title": "After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump",
        "description": "For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run.",
        "url": "https://news.sky.com/story/after-his-hardest-two-weeks-yet-this-isnt-what-i-expected-to-write-about-starmer-and-trump-13433735",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-trump-starmer_7024444.png?20250918175706",
        "type": "US",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-18 22:43:00",
        "Headline": "From bagpipe choruses and big ticket tech deals, to disagreeing \"agreeably\", Donald Trump's state visit has put the government back on track after a testing start to the new term, writes Sky's political editor.",
        "Content": "\n          Political editor\n              @BethRigby\n  For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run. It's not a sentence I imagined writing in the run-up to this state visit - particularly when the UK ambassador to the US, Peter Mandelson, was sacked from his post but days ago - but this state visit will go down as a success for a PM in dire need of a win. From the pomp and pageantry of the first day, to the hard business at Chequers, every detail was carefully choreographed to appeal to the president - including a stay in Windsor Castle, and a bagpipe chorus welcoming him (in a nod to his Scottish heritage) into Sir Keir Starmer's country retreat. Starmer went all out to flex all the soft power he could deploy to garner some hard results. There were real wins. The showstopper US-UK tech partnership was hailed by both sides as a new phase in the special relationship, as Trump gathered some of the world's biggest tech billionaires - Nvidia chief Jensen Huang and Apple's Tim Cook - to attend the signing of the deal at Chequers. Number 10 added up a series of planned commercial decisions to tout the prospect of £150bn of inward investment.  How that shakes down remains to be seen, but it undoubtedly gave the PM a positive story to sell ahead of the November budget, as the government spoke of thousands of tech and nuclear jobs being created in red wall seats like Hartlepool and Blythe in Northumberland. A prime minister doing business on behalf of hard-working Britons is the message No 10 wants you to take away from all of it. Because for a Labour government on the ropes, being able to talk about investment and new jobs in red wall towns is a story Sir Keir really needs to tell. This is a PM who desperately needs to persuade voters he and Chancellor Rachel Reeves can deliver a real growth strategy ahead of the budget. You could see it on the face of the PM as he hailed the new tech deal and massive investment into the UK. No 10 figures tell me Starmer's personal relationship with Trump helped created \"bigger than expected deals\". Another long-term ally of the PM told me: \"Today [the prime minister] got to remind people what he's in it for, and what he's good at.\" Beyond the business, Sir Keir also found a way to disagree agreeably with the president. On the matter of the UK's imminent decision to recognise the Palestine state, the president was open that this was an area of disagreement, but didn't berate Sir Keir over it. Explainer: What does recognising a Palestinian state mean?  Not rocking the boats There was a bit of a ripple at the news conference when Trump said he'd told Sir Keir he should \"call out the military\" to stop illegal migration into Britain, but these were two leaders who clearly had genuine regard and respect for each other, and for the lesser partner in the relationship - the UK - that really is a boon. But in the main, Trump didn't want to rock the boat. When I asked him, as the final question of the news conference, whether he had sympathy for Lord Mandelson for being sacked over his relationship with Jeffrey Epstein, the president, who also has an historic connection, totally swerved the question, saying - despite having Lord Mandelson in the Oval Office several times - he \"didn't know him\".  'Extraneous shocks' For a firebrand president, it was an overt attempt to avoid a headline. For the Starmer team, this state visit was a bit - dare I say it, after all the resets - of an attempt to get the government back on track after a torrid start to the new term. There is a view in Downing Street that the PM was hit by two \"extraneous shocks\" - Angela Rayner's tax affairs and Mandelson's emails in which he backed Epstein after his conviction - which were out of No 10's control. Listen: The fall and rise and fall (again) of Peter Mandelson This state visit was a moment to get the government back on track with momentum going into the Labour Party conference later this month. It will no doubt be a huge confidence boost to a battered prime minister who will perhaps find a renewed sense of purpose from being instrumental in landing real wins for the British people beyond the platitudes of the \"special relationship\". In a way, it's curious for me that the state visit of Trump, which I remember as a moment of jeopardy (see Theresa May in 2019), has been a moment of respite and validation for the prime minister. It is perhaps a reflection that Sir Keir has found it easier to navigate the global stage since winning power than the domestic one. He faces big challenges into the autumn, not least turning up at the party conference to address a Labour membership out of sorts with their leader. Then comes the budget, with all the pain of the economic outlook and prospects of tax rises. There is the pressure over small boats and the sluggish performance in the polls, too. But there is also the much-needed lift of a successful state visit, touting billions of investment and thousands of new jobs which the prime minister will grab as he looks for momentum - as he eyes the long journey ahead."
    },
    {
        "title": "Kimmel 'fired for lack of talent', Trump says, as Obama decries 'government coercion'",
        "description": "Donald Trump has claimed Jimmy Kimmel's late-night talk show was pulled off the air because of \"bad ratings\".",
        "url": "https://news.sky.com/story/jimmy-kimmel-should-have-been-fired-a-long-time-ago-says-trump-after-obamas-criticism-13433412",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel_7024425.jpg?20250918174422",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:45:00",
        "Headline": "Kimmel used his show on Monday to criticise Donald Trump for his response to the assassination of Charlie Kirk.",
        "Content": " Donald Trump has claimed Jimmy Kimmel's late-night talk show was pulled off the air because of \"bad ratings\". Kimmel's programme on US network ABC was axed after he criticised the US president and his allies for their response to the assassination of the right-wing influencer Charlie Kirk. The decision led to accusations that free speech was under attack in the US, with Democrats including former US president Barack Obama and a number of celebrities sounding an alarm. Mr Trump said: \"Well, Jimmy Kimmel was fired because he had bad ratings, more than anything else.\" \"And he said a horrible thing about a great gentleman known as Charlie Kirk.\" Speaking at a news conference alongside Sir Keir Starmer, Mr Trump added: \"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. \"So, you know, you could call that free speech or not. He was fired for lack of talent.\" \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  What we can learn about Charlie Kirk suspect Tyler Robinson from his charging document\n                 \n                  FBI director Kash Patel shouts at Democrat senators over Charlie Kirk and Jeffrey Epstein during oversight hearing\n                 Aboard Air Force One, Mr Trump said: \"When a host is on network television, there is a license. ... I think maybe their license should be taken away.\" He said whether ABC's license could be taken away over Kimmel's comments \"will be up to Brendan Carr\", chairman of the Federal Communications Commission. The US president also said that Kimmel's \"ratings were worse than cold air. I think they got rid of cold air, which is a good thing to do. Look, that's something that we should be talking about for licensing, too\". The latest season of Jimmy Kimmel Live averaged 1.57 million viewers per episode, according to media research firm Nielsen - and the show's YouTube channel has almost 21 million subscribers. What did Kimmel say? Kimmel made the controversial remark on Monday night. He said: \"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\" Speaking about Mr Trump, he added: \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish.\" \"Many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk,\" he continued.  Free speech under attack? Disney-owned ABC then said the show would be taken off air indefinitely, and with immediate effect, after network operator Nexstar - which operates a number of ABC affiliates - said it would stop broadcasting it. But the move - months after fellow CBS late-night show host Stephen Colbert saw his programme cancelled - sparked concern over the state of freedom of speech in the country. Former US president Barack Obama wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\" A string of high-profile celebrities, including actor Ben Stiller, criticised the decision. Mr Stiller reacted to another post on the news, replying: \"This isn't right.\" Actress Alison Brie said in an Instagram story: \"This is unreal. And very scary.\" Actress Jean Smart and comedian Alex Edelman also attacked the move. The American Federation of Musicians, Directors Guild of America, IATSE and SAG-AFTRA have also condemned the ABC's decision in a joint statement. \"The indefinite removal of Jimmy Kimmel Live under government pressure is not an isolated incident. It is part of a disturbing trend of increasing interference in creative expression,\" the unions said. \"This kind of political pressure on broadcasters and artists chills free speech and threatens the livelihoods of thousands of working Americans.\" What happened Kimmel's comments led to the Trump backer Mr Carr threatening to \"take action\" against Disney and ABC. In an interview with conservative podcaster Benny Johnson, he said: \"We can do this the easy way or the hard way.\" After the show was pulled, he then praised Nexstar's broadcasting division, saying \"it is important for broadcasters to push back on Disney programming that they determine falls short of community values\". Kimmel's suspension has triggered outrage from Democrats like California Governor Gavin Newsom, who posted on X: \"The @GOP [Republican Party] does not believe in free speech. They are censoring you in real time.\" Senate minority leader Chuck Schumer called for people \"across the political spectrum… to stop what's happening to Jimmy Kimmel\". A representative for Kimmel did not immediately respond to a request for comment. He has not issued any statement since the show's withdrawal. Sinclear, the largest ABC affiliate group in the US, has called on Mr Kimmel to \"issue a direct apology to the Kirk family\" and \"make a meaningful personal donation to the Kirk Family and Turning Point USA\" in a statement on Thursday. Read more:Analysis: Trump has a creeping control over what gets saidWhat did Jimmy Kimmel say about Charlie Kirk? The company said its ABC stations will air a special in remembrance of Mr Kirk during Jimmy Kimmel Live's timeslot on Friday. Both Disney and Nexstar have FCC business ahead of them. Disney is seeking regulatory approval for ESPN's acquisition of the NFL Network and Nexstar needs the Trump administration go-ahead to complete its $6.2bn purchase of broadcast rival Tegna. Mr Kirk's suspected killer, Tyler Robinson, appeared in court for the first time on Tuesday. Prosecutors said he had expressed negative views about Mr Kirk, an influential media figure in the MAGA movement."
    },
    {
        "title": "Nine things you might have missed from Trump's UK state visit",
        "description": "From a carriage procession, state banquet and the meeting of leaders, Donald Trump's second state visit to the UK has been jam packed.&#160;",
        "url": "https://news.sky.com/story/eight-things-you-might-have-missed-from-trumps-uk-state-visit-13433390",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-state-visit_7024176.jpg?20250918144834",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:05:00",
        "Headline": "From a handshake that went against accepted custom, to Donald Trump denying he knew who the former UK's ambassador to the US was - here are nine things you may have missed from the Trump state visit.",
        "Content": " From a carriage procession, state banquet and the meeting of leaders, Donald Trump's second state visit to the UK has been jam packed.  Since touching down in London late on Tuesday, all attention has been on the US president and first lady, Melania. With a warm welcome from Sir Keir Starmer, a lavish royal display, and protests in London against the visit, the trip yielded a mixed reception - although the US president was shielded from the 'realities of life' and people outside of the Windsor walls, according to Sky News' International Affairs Editor Dominic Waghorn. As the unprecedented visit draws to a close, here are nine things you may have missed during Mr Trump's time in the UK. Follow Trump state visit live The handshake that breached royal protocol - or did it? Greeting the King and Prince of Wales with a firm handshake - something the US president has become known for - Mr Trump also touched the monarch and second-in-line to the throne on the arm. Mr Trump was captured again, this time putting his hand on the King's back, while they took seats before the Red Arrows flypast. While Buckingham Palace makes it clear that touching the King is not a breach of official protocol, it is an accepted custom not to initiate physical contact with a member of the Royal Family. It was clear neither Charles nor William took offence to the act. The first lady's eye-covering hat Keeping in line with the first lady's past fashion choices, Melania Trump arrived in Windsor wearing a purple hat that covered her eyes from virtually every angle. The hat was similar to one Mrs Trump wore to her husband's inauguration in January - that time a navy and white hat which was designed by Eric Javits. Despite the similarities, the designer of the hat for the UK state visit has yet to be publicly disclosed. 'Watch the sword' While inspecting a line of honour guard at Windsor Castle on Wednesday, the King playfully nudged Mr Trump on the arm, telling him to \"watch the sword\" as one member of the King's Guard shifted position, swinging the blade near the US leader. The moment was captured by Sky News' royal correspondent Rhiannon Mills.  The president's joke During the state banquet in Windsor Castle's St George's Hall, both the King and Mr Trump made speeches. Hailing the state visit as \"one of the highest honours of my life\" Mr Trump also made a joke, saying he hopes he is the last US president to be given an unprecedented second state visit. \"This was the second state visit, and that’s the first, and maybe that’s going to be the last time, I hope it is actually,\" he said to muffled laughter in the room.  Queen Nixon? In his own remarks at the state banquet, the King paid reference to some of the biggest issues of the day, referencing trade, Ukraine, and environmentalism. But he also recalled a story about another US president - who he claimed tried to set the then-Prince of Wales up with his daughter in the 1970s.  After the King spoke about how \"I cannot help but wonder what our forebears from 1776 would make of this friendship today,\" he talked up the special relationship between the US and UK, saying: \"Throughout my life... I have cherished the close ties between the British and American people. \"In fact, had the media succeeded in the 1970s in their own attempt at deepening the special relationship, I myself might have been married off within the Nixon family!\" Teetotal Trump Mr Trump is famously teetotal, having told Fox News after winning the presidential election for the first time that he has \"never had a drink\". And it appears during the state banquet the president stuck to water. In pictures showing guests raising a glass, the contents of Mr Trump's is noticeably different to those around him. It remains unknown if a non-alcoholic version of the banquet's special cocktail - a Transatlantic Whisky Sour - was made for the US leader. Beekeeper Kate When the Princess of Wales and the first lady joined a group of Scouts in the grounds of Frogmore Cottage, the youngsters were given honey sandwiches, which were made by bees kept by Kate at Anmer Hall, her Norfolk home. Keeping on theme, Melania also brought a jar of White House honey for each of the children. The Queen is also a keen apiarist (someone who looks after beehives) - and she keeps bees at Raymill, her retreat in Wiltshire.  Arrest (and release) over Epstein projections As Mr Trump flew into the UK, projections of him and convicted paedophile Jeffrey Epstein were projected on to Windsor Castle. The huge pictures were beamed from a nearby hotel, and the nine-minute film included several pictures showing the US president with Epstein.  A 60-year-old from East Sussex, a 37-year-old from Kent, a 36-year-old from London, and a 50-year-old also from London were detained over the incident on Tuesday night. All four were then released on bail on Thursday. Thames Valley Police said the men had been bailed until 12 December while they investigate \"possible offences including malicious communications and public nuisance\". Read more from Sky News:Trump historic state visit - second day in pictures'Putin has really let me down', says US president  'What is your answer to that?' The final question in a joint press conference between Mr Trump and Sir Keir came from Sky News' political editor Beth Rigby, who asked the two leaders about the recently sacked UK ambassador to the US, Peter Mandelson. But Mr Trump quickly moved the answer to Sir Keir. \"I don't know him, actually. I had heard that, and I think maybe the prime minister would be better speaking of that, it was a choice that he made,\" he said before turning to Sir Keir.  \"What is your answer to that?\" Starmer answered: \"Some information came to light last week, which wasn't available when he was appointed. \"And I made a decision.\" Lord Mandelson was fired last Thursday after it emerged that he had continued his friendship with Epstein after his first conviction in 2008, having encouraged him to fight for early release."
    },
    {
        "title": "King's light touch approach to Trump is a masterclass in how to make friends and influence people",
        "description": "Months of planning, days of rehearsing and a dinner table that took almost a week to set up, the financial and reputational cost of this state visit, with the UK entertaining such a controversial character, has been huge. ",
        "url": "https://news.sky.com/story/kings-light-touch-approach-to-trump-is-a-masterclass-in-how-to-make-friends-13433550",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-king-charles_7023054.jpg?20250917151426",
        "type": "US",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-18 17:34:00",
        "Headline": "As the King said goodbye, Donald Trump turned to the cameras as he always does, and said, \"he's a great gentleman. He's a great King\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Months of planning, days of rehearsing and a dinner table that took almost a week to set up, the financial and reputational cost of this state visit, with the UK entertaining such a controversial character, has been huge.  But it appears to have paid off, for now at least. Overt celebration isn't really their style at the palace - quite ironic when you think yesterday's military display was anything but low-key. But overall, you sense there is a feeling that it was a job well done, and in no small part because of the King. With the pressure on to make sure nothing went wrong and that Donald Trump felt as welcome as possible, it would have been easy for our efforts to look forced. Clearly, laying on the largest ceremonial welcome in living memory wasn't subtle, but the King's light-touch approach was a masterclass in how to make friends and influence people. In fact, Mr Trump, as the King said goodbye, couldn't help himself. Addressing the cameras as he always does, he said, \"he's a great gentleman. He's a great King\". \n                  Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 \n                  Trade unions gear up to nominate candidate in contest for Labour deputy\n                  His Majesty looked coy; Number 10 and the Foreign Office would have been doing cartwheels. He was heading in their direction, and, with a head full of pageantry, the politics at Chequers would hopefully now be easy. At the state banquet, we'd already seen how they'd been determined to use the president's perception that he and the King were friends for maximum leverage. Usually, we would get his majesty's speech in advance; this time, we didn't. Were they making changes up to the wire? And when it came, this certainly felt like a speech that went further than usual, with the King using the most straightforward language to encourage the president to do more on our trade deal. In return, Mr Trump was nothing but charm personified, albeit with an informality we don't usually see in that formal setting; there aren't many heads of state who'd publicly remark on the beauty of the Princess of Wales. As Marine One left the grounds of Windsor to head for the prime minister's country residence, everyone just hoped that it had been enough. With the difficult backdrop to this visit - Epstein, Ukraine, free speech, the list goes on - would the rosy glow of royal soft power evaporate under the pressure of questions from journalists? Read more:Trump at Chequers - in picturesWhat you might have missedFour bailed over Epstein Windsor projection But it felt like a repeat of 2019. The warmth of Queen Elizabeth's welcome for that first state visit meant that Donald Trump, when it came to a press conference with Theresa May, was on his best behaviour. He wasn't going to throw a grenade in and ruin his own big moment. Six years on, the King did the trick again, with any awkwardness avoided for Sir Keir Starmer.  Mr Trump had a picture book made up of photos from that first visit. Again, we have given him another coffee table book's worth of memories, as the Royal Family, as our diplomats-in-chief, have done their job. The pictures of Melania Trump and Kate, adding that state visit sparkle, will also play well with the American audience back home. The couple and members of their family have been wined and dined, he has been flattered, and he will want the world to see it, too.  Here we had a new monarch reinforcing those foundations of friendship, laid down over many decades between his mother and numerous other presidents. As one senior palace aide once told me, it is those foundations that are so important for weathering disagreements and more difficult periods in any relationship. And with a president like this, you could say they are even more essential, as we never know what's around the corner."
    },
    {
        "title": "Body found in Tesla registered to singer d4vd named as missing 15-year-old girl",
        "description": "A decomposed body found in a car registered to singer d4vd has been identified as a missing 15-year-old girl.",
        "url": "https://news.sky.com/story/body-found-in-tesla-registered-to-singer-d4vd-named-as-missing-15-year-old-girl-13433225",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-d4vd-2024_7023745.jpg?20250918102026",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-18 09:01:00",
        "Headline": "Celeste Rivas had been reported missing from Lake Elsinore in California before she was found in the Tesla.",
        "Content": "A decomposed body found in a car registered to singer d4vd has been identified as a missing 15-year-old girl. Celeste Rivas, reported missing from Lake Elsinore in California, was identified after forensic examinations on the remains discovered in the Tesla on 8 September. Police were called to Hollywood Tow, a towing and impounding firm in Los Angeles, because of a foul smell coming from the vehicle. The car had been impounded after it was reported abandoned. The girl's remains were not found intact and it appeared she had been dead in the car for an extended period of time, according to Sky News' US partner network NBC News. The Los Angeles County Medical Examiner's Office has not yet determined a cause of death. The Los Angeles Police Department said: \"At this time, the LAPD does not have a crime classification from the coroner as to the mode or manner of death. \n                  Trump suffers setback in bid to act as national police chief after chaos on streets of LA\n                 \n                  California: 21 children taken into custody - amid claims couple misled surrogate mothers across the US\n                 \n                  Did Melania convince Trump to back Ukraine?\n                 \"Thus, we do not have any suspect information at this time.\" A spokesperson for the 20-year-old singer, real name David Anthony Burke, said he had been informed about the discovery and was \"fully cooperating with the authorities\". The artist, who is currently on tour, was scheduled to perform in Seattle on Wednesday, but the show has since been cancelled."
    },
    {
        "title": "The big story from Bank of England is an easing in tightening to avert massive losses",
        "description": "For the most part, when people think about the Bank of England and what it does to control the economy, they think about interest rates. ",
        "url": "https://news.sky.com/story/the-big-story-from-bank-of-england-is-an-easing-in-tightening-to-avert-massive-losses-13433278",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-living-money-bailey_6965893.png?20250716092313",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-09-18 10:26:00",
        "Headline": "Sky's economics and data editor Ed Conway explains how an unwinding of historic Bank support for the UK economy has been rowed back on, to save us many billions of pounds.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n For the most part, when people think about the Bank of England and what it does to control the economy, they think about interest rates.  And that's quite understandable. After all, influencing inflation by raising or lowering the prevailing borrowing costs across the UK has been the Bank's main tool for the vast majority of its history. There are data series on interest rates in the Bank's archives that go all the way back to its foundation in 1694. But depicting the Bank of England as being mostly about interest rates is no longer entirely true. For one thing, these days it is also in charge of regulating the financial system. And, even more relevant for the wider economy, it is engaged in another policy with enormous consequences - both for the markets and for the public purse. But since this policy is pretty complex, few outside of the financial world are even aware of it. Money latest: What interest rate hold means for you That project is quantitative easing (QE) or, as it's better known these days, quantitative tightening (QT). You might recall QE from the financial crisis. It was, in short, what the Bank did when interest rates went down to zero and it needed an extra tool to inject some oomph into the economy. That tool was QE. Essentially it involved creating money (printing it electronically) to buy up assets. The idea was twofold: first, it means you have more money sloshing around the economy - an important concept given the Great Depression of the 1930s had been associated with a sudden shortage of money. Second, it was designed to try to bring down the interest rates prevailing in financial markets - in other words, not the interest rate set by the Bank of England but the yields on long-dated bonds like the ones issued by the government. \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 \n                  Firms cut jobs at fastest pace since 2021, Bank of England data shows\n                 \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                  So the Bank printed a lot of money - hundreds of billions of pounds - and bought hundreds of billions worth of assets. It could theoretically have spent that money on anything: stocks, shares, debt, housing. I calculated a few years ago that with the sums it forked out, it could theoretically have bought every home in Scotland.  But the assets it chose to buy were not Scottish homes but government bonds, mostly, it said back at the time (this was 2009) because they were the most available liquid asset out there. That had a couple of profound consequences. The first was that from the very beginning QE was a technical policy most people didn't entirely understand. It was all happening under the radar in financial markets. No one, save for the banks and funds selling government bonds (gilts, as they're known) ever saw the money. The second consequence is that we're starting to reckon with today. Roll on a decade-and-a-half and the Bank of England had about £895bn worth of bonds sitting on its balance sheet, bought during the various spurts of QE - a couple of spurts during the financial crisis, another in the wake of the EU referendum and more during COVID. Some of those bonds were bought at low prices but, especially during the pandemic, they were bought for far higher prices (or, since the yield on these bonds moves in opposite directions to the price, at lower yields). Then, three years ago, the Bank began to reverse QE. That meant selling off those bonds. And while it bought many of those bonds at high prices, it has been selling them at low prices. In some cases it has been losing astounding amounts on each sale. Take the 2061 gilt. It bought a slug of them for £101 a go, and has sold them for £28 a piece. Hence realising a staggering 73% loss. Tot it all up and you're talking about losses, as a result of the reversal of QE, of many billions of pounds. At this point it's worth calibrating your sense of these big numbers. Broadly speaking, £10bn is a lot of money - equivalent to around an extra penny on income tax. The fiscal \"black hole\" Rachel Reeves is facing at the forthcoming budget is, depending on who you ask, maybe £20bn.  Well, the total losses expected on the Bank of England's Quantitative Tightening programme (\"tightening\" because it's the opposite of easing) is a whopping £134bn, according to the Office for Budget Responsibility. Now it's worth saying first off that, as things stand at least, not all of those losses have been crystallised. But over time it is expected to lose what are, to put it lightly, staggering sums. And they are sums that are being, and will be paid, by British taxpayers in the coming years and decades. Now, if you're the Bank of England, you argue that the cost was justifiable given the scale of economic emergency faced in 2008 and onwards. Looking at it purely in terms of fiscal losses is to miss the point, they say, because the alternative was that the Bank didn't intervene and the UK economy would have faced hideous levels of recession and unemployment in those periods. However, there's another, more subtle, critique, voiced recently by economists like Christopher Mahon at Columbia Threadneedle Investments, which is that the Bank has been imprudent in its strategy of selling off these assets. They could, he argues, have sold off these bonds less quickly. They could, for that matter, have been more careful when buying assets not to invest too wholeheartedly in a single class of asset (in this case government bonds) that might be sensitive in future to changes in interest rates. Most obviously, there are other central banks - most notably the Federal Reserve and European Central Bank - that have refrained from actively selling the bonds in their QE portfolios. And, coincidentally or not, these other central banks have incurred far smaller losses than the Bank of England. Or at least it looks like they have - trying to calculate these things is fiendishly hard. But there's another consequence to all of this as well. Because if you're selling off a load of long-dated government bonds then, all else equal, that would have the tendency to push up the yields on those bonds. And this brings us back to the big issue so many people are fixated with right now: really high gilt yields. And it so happens that the very moment Britain's long-term gilt yields began to lurch higher than most other central banks was the moment the Bank embarked on quantitative tightening. But (the plot thickens) that moment was also the precise moment Liz Truss's mini-budget took place. In other words, it's very hard to unpick precisely how much of the divergence in British borrowing costs in recent years was down to Liz Truss and how much was down to the Bank of England. Either way, perhaps by now you see the issue. This incredibly technical and esoteric economic policy might just have had enormous consequences. All of which brings us to the Bank's decision today. By reducing the rate at which it's selling those bonds into the market and - equally importantly - reducing the proportion of long-dated (eg 30 year or so) bonds it's selling, the Bank seems to be tacitly acknowledging (without actually quite acknowledging it formally) that the plan wasn't working - and it needs to change track. However, the extent of the change is smaller than many would have hoped for. So questions about whether the Bank's QT strategy was an expensive mistake are likely to get louder in the coming months."
    },
    {
        "title": "Bank of England leaves interest rate unchanged and slows quantitative tightening ",
        "description": "The Bank of England has announced it is scaling back the rate at which it is selling bonds into the financial market as part of its quantitative tightening programme.",
        "url": "https://news.sky.com/story/bank-of-england-leaves-interest-rate-unchanged-13433268",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bank-of-england-rates_6984770.jpg?20250807120015",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-09-18 10:16:00",
        "Headline": "The decision to hold interest rates was not unanimous, with two members of the rate-setting committee voting to bring borrowing costs down.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n The Bank of England has announced it is scaling back the rate at which it is selling bonds into the financial market as part of its quantitative tightening programme. The Bank's Monetary Policy Committee (MPC) voted to leave interest rates unchanged at 4% at its September meeting, but more controversial still is its annual decision over the reversal of its crisis-era quantitative easing programme. Money blog: cost of visiting popular tourist destination rising Over the last two years, the Bank has been in the midst of actively selling off bonds bought during the financial crisis and COVID-19, as part of its economic rescue measures. Those amounts were averaging out at £100bn a year. Today, the Bank announced it is reducing the annual sale rate to £70bn a year. It has also announced it will, in future, be selling fewer long-dated government bonds. \"The new target means the MPC can continue to reduce the size of the Bank's balance sheet in line with its monetary policy objectives while continuing to minimise the impact on gilt [government bond] market conditions,\" said governor Andrew Bailey. \n                  The big story from Bank of England is an easing in tightening to avert massive losses\n                 \n                  Firms cut jobs at fastest pace since 2021, Bank of England data shows\n                 \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 Read more:The big story from the Bank of England is reversal of tightening to avert massive losses On the interest rate decision, Mr Bailey said, \"We held interest rates at 4% today. Although we expect inflation to return to our 2% target, we're not out of the woods yet so any future cuts will need to be made gradually and carefully.\"  He later added: \"There will be some further reductions but... the timing and scale of those is more uncertain now\". The decision was not unanimous, with two of the seven MPC members voting to cut the base interest rate by 0.25 percentage points. While the market expects rates to be held again at the next meeting in November, a cut in December is still seen as likely by traders, according to data from the London Stock Exchange Group (LSEG). It is not, however, fully priced in. John Wyn-Evans, head of market analysis at investment firm Rathbones, said: \"This meeting was another milestone on the road to what is scheduled to be the most important event between now and Christmas, namely the budget. \"The government would dearly love to see lower interest rates to stimulate the housing market and consumer demand more generally. However, the Bank of England is displaying its independence at a time when investors are nervous that central banks are at risk of succumbing to control from political leaders, with the battle between the White House and the US Federal Reserve being most critical. \"This leaves Chancellor Rachel Reeves struggling to balance the books, and her task will be made even more difficult should reports that the Office of Budget Responsibility is set to reduce its forecast for the UK's productivity growth be proved correct.\" "
    },
    {
        "title": "Former head of business group banned from directorships for 'abusing' COVID-19 loans",
        "description": "The former head of one of Britain's leading business groups has been banned from serving as a director for \"abusing\" state COVID-19 business loans.",
        "url": "https://news.sky.com/story/former-head-of-business-group-banned-from-directorships-for-abusing-covid-19-loans-13433350",
        "image_url": "https://e3.365dm.com/18/03/1920x1080/skynews-institute-of-directors_4249627.jpg?20180307211356",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-18 12:11:00",
        "Headline": "Anna Daroy, who once headed the Institute of Directors, did not pay back a £50,000 overpayment, the Insolvency Service said.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The former head of one of Britain's leading business groups has been banned from serving as a director for \"abusing\" state COVID-19 business loans. Award-nominated businesswoman Anna Daroy has 35 years experience advising company boards in the public and private sector and served as the interim director general of the Institute of Directors‎ (IoD), a prominent business lobby group, from October 2018 to November 2019. Money blog: cost of visiting popular tourist destination rising She herself has now been barred from being a director for 11 years after failing to pay back a £50,000 loan overpayment. It means Ms Daroy cannot be involved in the promotion, formation or management of a company without court permission. The Insolvency Service, which investigated the issue, said on Thursday that Ms Daroy \"abused\" the COVID-19 era bounce back loan scheme by obtaining two loans when businesses were only permitted one. Read more:Trump state visit is all about deals to turn around UK economyMeta announces new smart glasses - I've tried them \n                  Children experiencing 'unorthodox' schooling since pandemic, Ofsted says\n                 \n                  Kate Garraway 'can't earn enough' to cover debts racked up after cost of husband Derek Draper's care exceeded her ITV salary\n                 \n                  'Wish I'd acted earlier': Matt Hancock's defence at the COVID inquiry\n                 The maximum £50,000 amount under the bounce back scheme was paid out twice, from two banks, both within five days of each other in May 2020, the service said. Upon realising her company received double the sum allowed, Ms Daroy should have repaid one of the loans, it added. The recipient company, Globepoint Associates Ltd, went into liquidation in March 2023, with both loans outstanding. The Insolvency Service's chief investigator, Kevin Read, said the loans were \"designed to provide vital support to struggling businesses during the pandemic, not to be exploited by those who did not follow the terms of the scheme\". \"As someone with such extensive experience in senior business leadership roles, Ms Daroy should have known better than to break the rules,\" said Mr Read. \"More than 2,400 directors have been banned for COVID-19 loan abuse since investigations began in 2021.\" Who is Anna Daroy? Just last year, Ms Daroy was nominated for the prestigious Women's Business Club businesswoman of the year award. Since applying for the COVID-19 loans, she has held leadership positions at The Chartered Institution of Water and Environmental Management as well as the British Association for Counselling and Psychotherapy. Ms Daroy has been contacted for comment."
    },
    {
        "title": "Next issues scathing attack on UK economy as it reports tens of millions in profit growth ",
        "description": "The chief executive of Next has issued a scathing critique of the UK economy as the company posted strong sales and tens of millions in profit growth.",
        "url": "https://news.sky.com/story/next-issues-scathing-attack-on-uk-economy-as-it-reports-tens-of-millions-in-profit-growth-13433185",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-next-shop_6978999.jpg?20250731140048",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-18 06:46:00",
        "Headline": "The hottest spring and summer on record, and the M&S cyber attack helped the high street retailer boost sales.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The chief executive of Next has issued a scathing critique of the UK economy as the company posted strong sales and tens of millions in profit growth. Next's CEO, the Conservative life peer Lord Wolfson, said the high street chain has reason \"to be cautious\" and \"at best\" expects \"anaemic\" economic growth. Money blog: cost of visiting popular tourist destination rising Economic expansion is being held back by \"declining job opportunities, new regulation that erodes competitiveness, government spending commitments that are beyond its means, and a rising tax burden that undermines national productivity\", Lord Wolfson said. His comments come as the high street bellwether saw double-digit sales and profit growth, which was attributed to \"favourable weather and competitor disruption,\" as the UK recorded the hottest spring and summer on record, and department store Marks and Spencer (M&S) reeled from a cyberattack. M&S's online sales and click and collect were down for weeks, while some shelves were empty after the attack was detected after the Easter bank holiday weekend. Read more:Trump state visit is all about deals to turn around UK economyMeta announces new smart glasses - I've tried them \n                  'If we're not there already we're coming to a town near you' Aldi says, vowing lower prices before Christmas\n                 \n                  Good weather and Women's Euros helps UK net surprise boost to retail sales\n                 \n                  Cara Delevingne reveals how Topshop inspired her fashion sense - as brand relaunches in London\n                 This helped overall Next sales rise far more than it previously expected to 10.3% and profits grow from £452m to £515m in the six months to July, compared with a year earlier.  Also boosting sales was expansion in the UK and international growth. Nearly a third of international sales come from aggregator websites like Zalando. UK economy stalling further gains? Such a showing will be difficult to maintain due to a weakening economy, Next said. \"The first half [of the year] was boosted by factors that are unlikely to continue, and the belief that the UK economy is likely to weaken going forward\", Lord Wolfson said. \"To be clear, we do not believe the UK economy is approaching a cliff edge\", he added. Despite the dreary outlook, analysis from financial services firm Hargreaves Lansdown said \"Next is in a strong position to continue dominating the UK market\". \"Strong demand in its online channel remains a running theme, and it's likely to remain the main growth driver,\" said the firm's equity analyst Aarin Chiekrie."
    },
    {
        "title": "Former Centrica boss Conn in frame to chair IP Group",
        "description": "A former boss of Centrica, the owner of British Gas, is among the candidates being considered to chair IP Group, the early-stage science investor.",
        "url": "https://news.sky.com/story/former-centrica-boss-conn-in-frame-to-chair-ip-group-13433392",
        "image_url": "https://e3.365dm.com/18/02/1920x1080/skynews-iain-conn-centrica_4237464.jpg?20180222085638",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-18 13:05:00",
        "Headline": "Iain Conn, who left the British Gas-owner in 2020, is one of a small number of contenders to replace Sir Douglas Flint at the London-listed science investor, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A former boss of Centrica, the owner of British Gas, is among the candidates being considered to chair IP Group, the early-stage science investor. Sky News has learnt that Iain Conn, who spent a decade in senior roles at BP, is one of a small number of contenders to replace Sir Douglas Flint. City sources said a decision was expected to be made by IP Group's board about its next chairman before the end of the year. Money latest: What interest rate hold means for you  Mr Conn left Centrica in 2020 after five years in the top job. IP Group has backed companies including Hinge Health, which recently floated in New York, and London-listed Oxford Nanopore. \n                  Money blog: Interest rate held; ESTA prices rising; supermarket fights to stay in top five\n                 \n                  The big story from Bank of England is an easing in tightening to avert massive losses\n                 \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 Last year, it benefited from a substantial payout for its stake in Featurespace following its £700m sale to Visa. The London-listed company's portfolio also includes stakes in companies such as First Light, a nuclear fusion specialist. This week, it announced half-year results disclosing hat it referred to \"funding delays and pricing pressure for Oxa and Artios\", in which it said the value of its holdings had declined by more than £35m. IP Group's shares were trading at around 53p on Thursday afternoon, giving the company a market capitalisation of almost exactly £500m. A spokeswoman for IP Group declined to comment."
    },
    {
        "title": "AJ Bell founder backs period care start-up Here We Flo",
        "description": "The businessman who built AJ Bell into one of Britain's leading retail investment platforms is investing millions of pounds in Here We Flo, a period care brand which aims to remove the stigma from women's menstrual cycles.",
        "url": "https://news.sky.com/story/aj-bell-founder-backs-period-care-start-up-here-we-flo-13433245",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-here-we-flo-pads-period_7023798.jpg?20250918110338",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-18 09:35:00",
        "Headline": "Andy Bell has led a £3m funding round for a start-up which has struck partnership deals with Chelsea FC's women's team and the Netflix series Sex Education, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The businessman who built AJ Bell into one of Britain's leading retail investment platforms is investing millions of pounds in Here We Flo, a period care brand which aims to remove the stigma from women's menstrual cycles. Sky News understands that Andy Bell, who still holds a big stake in London-listed AJ Bell, injected £2m into Here We Flo as part of a recently concluded follow-on funding round. Fergus Lyons, a regular co-investor with Mr Bell, ploughed a further £1m into the business, which was founded by Susan Allen and Tara Chandra. Money blog: cost of visiting popular tourist destination rising The co-founders own a significant interest in Here We Flo. The brand gained national media attention earlier this month when Chelsea Football Club's women's team wore shorts marked with simulated blood, as part of a new partnership with the Women's Super League outfit. It also launched a co-branded product line with the Netflix series Sex Education. \n                  Money blog: Interest rate held; ESTA prices rising; supermarket fights to stay in top five\n                 \n                  The big story from Bank of England is an easing in tightening to avert massive losses\n                 \n                  Bank of England leaves interest rate unchanged and slows quantitative tightening \n                 Here We Flo's products, which use plant-based materials, are sold by retailers including Boots, Holland & Barrett, Sainsbury's, Superdrug and Tesco. A further partnership is expected to be announced next month. \"We operate in a $50bn global market traditionally called 'sanitary protection' or 'sanitary hygiene', and that alone tells you how ripe it is for disruption, both in product innovation and consumer education,\" Ms Allen and Ms Chandra said in a joint statement. \"We're here to be that change: creating products that are better for our bodies and better for the planet, while supporting people through life's messy moments - from menstrual flows and bladder leaks to sexual wellness.\" The £3m injection from Mr Bell and Mr Lyons is to be used to fund marketing and working capital, they added. Last year, Here We Flo became the second-biggest selling intimate hygiene brand on Amazon, behind Procter & Gamble's Always range."
    },
    {
        "title": "Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan",
        "description": "Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel.",
        "url": "https://news.sky.com/story/putin-has-really-let-me-down-says-us-president-donald-trump-13433413",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-keir-starmer_7024260.jpg?20250918154118",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:56:00",
        "Headline": "Sir Keir Starmer pointed to the UK's action, including the first return under the \"one in, one out\" deal with France, that happened earlier on Thursday.",
        "Content": " Donald Trump has told Sir Keir Starmer he should use the military to stop migrants crossing the Channel. The US president made the suggestion while stood alongside the prime minister for a typically wide-ranging news conference on Thursday afternoon, bringing his state visit to Britain to an end. Catch up on updates from Trump's state visit Speaking at Chequers, Sir Keir's country retreat, Mr Trump warned illegal migration is \"going to destroy [...] countries from within\" and said \"it doesn't matter if you call out the military\" to deal with small boats. He talked up his own record of stopping people crossing the US-Mexico border. Sir Keir instead pointed to his government's migrant return deal with France, with the first deportation of a man who arrived via small boat taking place on Thursday morning. Further flights are scheduled to take place this week and next, starting Friday, while exchange arrivals to Britain via the legal route agreed with the French are due in the coming days. \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  Four men freed on bail over Trump-Epstein projection at Windsor Castle\n                 \n                  Donald Trump historic state visit - second day in pictures\n                 Mr Trump also used the news conference to admit Vladimir Putin \"has really let me down\", having stepped up his attacks against Ukraine since the two men held a peace summit in Alaska last month.  But asked by Sky News' political editor Beth Rigby if it was a mistake to invite Mr Putin and if he regrets it, the president replied: \"No.\" It's the \"biggest disappointment\" of his presidency that he hasn't managed to end the war, Mr Trump admitted. He said he thought it would be the \"easiest\" to solve because of his relationship with Mr Putin. Sir Keir said the Russian president has \"shown his true face\", and more \"pressure\" is required to make him stop.  Trump reignites war of words with Khan While disappointed with Mr Putin, Mr Trump spared his harshest rhetoric for Sir Keir's friend Sadiq Khan. Speaking on Air Force One on his way back to the US, where he touched down in the early hours of Friday, he said he asked for the London mayor to be banned from attending the state banquet at Windsor Castle on Wednesday. \"I didn't want him there,\" the president said. \"I asked that he not be there.\" He claimed Sir Sadiq had wanted to be at the event, adding: \"I think the mayor of London Khan is among the worst mayors in the world, and we have some bad ones.\" Sky News understands the mayor didn't seek or expect an invitation. A source close to Sir Sadiq said the capital is a \"global success story\" and \"record numbers of Americans are choosing to make London their home\".  The Trump-Starmer news conference also covered the war in Gaza, the sacking of Lord Mandelson as Britain's US ambassador, energy policy, and a newly signed UK-US tech deal. Speaking about the situation in Gaza, Mr Trump said: \"Simply I want all hostages to be released now.\" He said he disagreed with the UK's plan to recognise a Palestinian state at the UN within days, should Israel not improve the humanitarian situation in Gaza. Trump claims not to know Mandelson Also asked by Beth Rigby if he has sympathy with Lord Mandelson, who was sacked by Sir Keir over past links to paedophile financier Jeffrey Epstein, the president simply said: \"I don't know him.\" That's despite the president being pictured shaking hands with the Labour peer in the Oval Office after announcing a trade deal with the UK back in May. There had been concerns that the Epstein issue could cast a shadow on the president's second state visit to the UK, not least because Mr Trump was also close to Epstein, although they fell out before his conviction in 2009. Read more:Trump historic state visit - second day in picturesEight things you might have missed from state visit Energy policy Mr Trump urged Sir Keir to exploit the UK's North Sea oil and gas resources, dismissing wind power as a \"very expensive joke\". The UK government has ruled out new oil and gas licences in the North Sea, focusing on renewables and building nuclear power stations. Despite their differences, Mr Trump said the bond between the US and Britain is like no other, and he described the prime minister as a \"tough negotiator\". The pair signed a technology prosperity deal, offering major investment by US tech firms in the UK, that will help to develop artificial intelligence (AI) capabilities. Sir Keir also hailed the prospect of £150bn flowing into the UK from big US companies such as Palantir and Blackstone, part of a wider £250bn package that officials say will benefit both sides.  Jimmy Kimmel controversy Meanwhile, Mr Trump also commented on US late-night chat show host Jimmy Kimmel, whose programme has been pulled from schedules after his remarks about the fatal shooting of conservative activist Charlie Kirk. The president claimed the show, Jimmy Kimmel Live!, was suspended because he \"is not a talented person\" and had \"very bad ratings\"."
    },
    {
        "title": "After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump",
        "description": "For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run.",
        "url": "https://news.sky.com/story/after-his-hardest-two-weeks-yet-this-isnt-what-i-expected-to-write-about-starmer-and-trump-13433735",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-beth-trump-starmer_7024444.png?20250918175706",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-09-18 22:43:00",
        "Headline": "From bagpipe choruses and big ticket tech deals, to disagreeing \"agreeably\", Donald Trump's state visit has put the government back on track after a testing start to the new term, writes Sky's political editor.",
        "Content": "\n          Political editor\n              @BethRigby\n  For a prime minister who has perhaps had his hardest two weeks in office, Donald Trump became the unlikely elixir of a tough political run. It's not a sentence I imagined writing in the run-up to this state visit - particularly when the UK ambassador to the US, Peter Mandelson, was sacked from his post but days ago - but this state visit will go down as a success for a PM in dire need of a win. From the pomp and pageantry of the first day, to the hard business at Chequers, every detail was carefully choreographed to appeal to the president - including a stay in Windsor Castle, and a bagpipe chorus welcoming him (in a nod to his Scottish heritage) into Sir Keir Starmer's country retreat. Starmer went all out to flex all the soft power he could deploy to garner some hard results. There were real wins. The showstopper US-UK tech partnership was hailed by both sides as a new phase in the special relationship, as Trump gathered some of the world's biggest tech billionaires - Nvidia chief Jensen Huang and Apple's Tim Cook - to attend the signing of the deal at Chequers. Number 10 added up a series of planned commercial decisions to tout the prospect of £150bn of inward investment.  How that shakes down remains to be seen, but it undoubtedly gave the PM a positive story to sell ahead of the November budget, as the government spoke of thousands of tech and nuclear jobs being created in red wall seats like Hartlepool and Blythe in Northumberland. A prime minister doing business on behalf of hard-working Britons is the message No 10 wants you to take away from all of it. Because for a Labour government on the ropes, being able to talk about investment and new jobs in red wall towns is a story Sir Keir really needs to tell. This is a PM who desperately needs to persuade voters he and Chancellor Rachel Reeves can deliver a real growth strategy ahead of the budget. You could see it on the face of the PM as he hailed the new tech deal and massive investment into the UK. No 10 figures tell me Starmer's personal relationship with Trump helped created \"bigger than expected deals\". Another long-term ally of the PM told me: \"Today [the prime minister] got to remind people what he's in it for, and what he's good at.\" Beyond the business, Sir Keir also found a way to disagree agreeably with the president. On the matter of the UK's imminent decision to recognise the Palestine state, the president was open that this was an area of disagreement, but didn't berate Sir Keir over it. Explainer: What does recognising a Palestinian state mean?  Not rocking the boats There was a bit of a ripple at the news conference when Trump said he'd told Sir Keir he should \"call out the military\" to stop illegal migration into Britain, but these were two leaders who clearly had genuine regard and respect for each other, and for the lesser partner in the relationship - the UK - that really is a boon. But in the main, Trump didn't want to rock the boat. When I asked him, as the final question of the news conference, whether he had sympathy for Lord Mandelson for being sacked over his relationship with Jeffrey Epstein, the president, who also has an historic connection, totally swerved the question, saying - despite having Lord Mandelson in the Oval Office several times - he \"didn't know him\".  'Extraneous shocks' For a firebrand president, it was an overt attempt to avoid a headline. For the Starmer team, this state visit was a bit - dare I say it, after all the resets - of an attempt to get the government back on track after a torrid start to the new term. There is a view in Downing Street that the PM was hit by two \"extraneous shocks\" - Angela Rayner's tax affairs and Mandelson's emails in which he backed Epstein after his conviction - which were out of No 10's control. Listen: The fall and rise and fall (again) of Peter Mandelson This state visit was a moment to get the government back on track with momentum going into the Labour Party conference later this month. It will no doubt be a huge confidence boost to a battered prime minister who will perhaps find a renewed sense of purpose from being instrumental in landing real wins for the British people beyond the platitudes of the \"special relationship\". In a way, it's curious for me that the state visit of Trump, which I remember as a moment of jeopardy (see Theresa May in 2019), has been a moment of respite and validation for the prime minister. It is perhaps a reflection that Sir Keir has found it easier to navigate the global stage since winning power than the domestic one. He faces big challenges into the autumn, not least turning up at the party conference to address a Labour membership out of sorts with their leader. Then comes the budget, with all the pain of the economic outlook and prospects of tax rises. There is the pressure over small boats and the sluggish performance in the polls, too. But there is also the much-needed lift of a successful state visit, touting billions of investment and thousands of new jobs which the prime minister will grab as he looks for momentum - as he eyes the long journey ahead."
    },
    {
        "title": "Why Starmer's move to recognise Palestine is a major shift",
        "description": "The UK is to recognise the state of Palestine, potentially as soon as this weekend - with the prime minister insisting it was always part of the plan.",
        "url": "https://news.sky.com/story/why-starmers-move-to-recognise-palestine-is-a-major-shift-13433439",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestine-action-court_7021794.jpg?20250916074318",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-18 14:28:00",
        "Headline": "Sir Keir Starmer is expected to formally recognise Palestine as a state in the coming days, despite opposition from Donald Trump. Sky News takes a look at how the prime minister's position has evolved.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  The UK is to recognise the state of Palestine, potentially as soon as this weekend - with the prime minister insisting it was always part of the plan. It was a Labour manifesto commitment, but the party's position has evolved in government. Some of the party's early positions cast a long shadow over its year in power, sometimes obscuring what action the government has taken. So here's what actually happened. Keir Starmer's reputation among those most passionate about Gaza largely rested on one LBC interview he did shortly after the 7 October attacks, while still in opposition, where he seemed to suggest Israel had the right to withhold power and water from Gaza. But it wasn't just one interview that caused the collapse in what many have called the \"Muslim vote\". The party changed from supporting a \"humanitarian pause\" to an \"immediate ceasefire\" four months into the war. Some, even within the shadow front bench at the time, said this had come too late. To make things worse, the SNP forced an unedifying vote calling for a ceasefire which Labour initially didn't support, only to change their position a few days later.  Huge swathes of dissatisfaction within the base led to some communities galvanising support behind independent candidates who then took major Labour seats, notably Jonathan Ashworth's in Leicester South and Khalid Mahmood's in Birmingham. So, when a Labour government walked into Downing Street in July last year, they knew their actions had to be very different - and they were. They removed blocks on the delivery of humanitarian aid, they restored UK funding for UNRWA, a UN aid agency in the Gaza Strip, and they demanded the international courts (ICC and ICJ) be respected, undoing blocks imposed by the previous Conservative government. But they stopped short of publishing legal advice they had promised to do while in opposition. Now, after a year in power, they point to other serious interventions.  The government said it would respect its obligations in regards to an international arrest warrant for Benjamin Netanyahu for alleged war crimes. It suspended talks on a trade deal with Israel and imposed new sanctions against organisations that have supported and perpetuated \"heinous abuses of human rights\" against Palestinian communities in the occupied West Bank. It also imposed sanctions on two Israeli ministers, Itamar Ben-Gvir and Bezalel Smotrich, for \"repeated incitements of violence against Palestinian communities\". But there are still questions over arms licenses and publishing legal advice - a promise not kept - that we asked about. We \"categorically do not export any bombs or ammunition for use in military operations in Gaza\", said a government spokesperson. \"Most military export licenses to Israel are for commercial or civilian use, such as product testing or body-armour for journalists and NGOs,\" they added. Read more:What does recognising a Palestinian state mean?Sadiq Khan calls out Gaza 'genocide' Backbenchers should also get some credit. This summer, just before the UK hastily announced it would recognise Palestinian statehood right after France declared, a letter signed by over 100 MPs (including many of Starmer's own) demanded the government state its position. MPs I've spoken to say this pressure undoubtedly helped make the case for it inside the government. It's hard to predict what's next, but it's likely backbenchers will now be pushing for stronger language from the government after a commission established by the UN said this month that a genocide was taking place in Gaza - something repeatedly denied by Israel.  Sadiq Khan, the mayor of London, has also now publicly labelled Israel's actions as genocidal. The biggest hope for the UK is that a peace deal is achieved, that's what this recognition is largely about - a condition set by some of the Arab states. But, until that outcome, this recognition is a major policy shift for the UK - perhaps the biggest one the Labour government has made on this issue since the conflict began."
    },
    {
        "title": "Trade unions gear up to nominate candidate in contest for Labour deputy",
        "description": "Two of the most important Labour-affiliated unions are set to nominate their choice for who should replace Angela Rayner as the party's deputy leader.",
        "url": "https://news.sky.com/story/trade-unions-gear-up-to-nominate-candidate-in-contest-for-labour-deputy-13433308",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bridget-phillipson_7016638.jpg?20250911011911",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-09-18 11:19:00",
        "Headline": "Unison and GMB will soon choose whether they want Bridget Phillipson or Lucy Powell to replace Angela Rayner as Labour's deputy leader.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Two of the most important Labour-affiliated unions are set to nominate their choice for who should replace Angela Rayner as the party's deputy leader. Unison and GMB will pick their candidate on 25 September - two days ahead of the deadline for nominations for Labour affiliates and local party branches. Bridget Phillipson, the education secretary, is seen as the government's choice of candidate in the race, which has effectively turned into a de facto confidence vote on Sir Keir Starmer's leadership. She is up against Lucy Powell, who was sacked as Commons leader in the recent reshuffle and has become the candidate for MPs who are unhappy with the party's direction after a difficult first year in government. Ms Phillipson has already secured the backing of the two unions - Community and the Union of Shop, Distributive and Allied Workers. Will unions want to say 'sod you' to PM? There are question marks over who Unison, GMB and Unite will back in the race, triggered by Ms Rayner quitting as deputy leader, deputy prime minister and housing secretary over underpaid stamp duty on a second home. While Ms Phillipson may be boosted by having the backing of Number 10, the level of discontent in the Labour Party and wider union movement is at such a level that Ms Powell's \"outsider\" status may benefit her. One union source told Sky News that while they felt Ms Phillipson was the \"better candidate\", \"the temptation to vote Lucy to give a 'sod you' to government is a lot\". They added: \"Number 10 need to start fearing the party. They've had it too easy.\" Read more:Why sacking Lucy Powell might come back to haunt StarmerHow can a UK prime minister be ousted? Another union insider said there was a \"sense among union leaders that they wish this wasn't happening\". They questioned how important a role the unions would play in this contest due to the tight timetable, making it harder for them to mobilise behind a candidate. \"Most unions feel this is not a hugely impactful moment either way,\" they said. \"Many of their members will be feeling quite grumpy at how things are going with the government, but at the same time, union leaders won't want to get on the wrong side of Number 10 over something that is not going to make a meaningful difference in the long term.\" There are questions over the extent of Unite's involvement and interest in the race. Although the union is Labour's biggest supporter, Sharon Graham, its general secretary, has sought to turn its focus away from internal party politics and on to industrial disputes. On the first day of the Trades Union Congress in Brighton, she told Sky News she'd be \"looking very much at their track record - have they backed workers? That's what I'll be looking for\". How will the race play out? In order to proceed to the next stage of the contest, the two candidates must each secure nominations from at least 5% of constituency Labour parties, or at least three organisations affiliated that to the party. At least two of these must be trade unions which make up 5% of fully paid-up affiliated party members. The deadline to secure the necessary support is Saturday 27 September. The Labour Party's annual conference begins the next day, where the candidates who have secured the required backing will be able to make their pitches directly to members in a final hustings. Ms Phillipson has pitched herself as the candidate who can \"unite\" the party after a difficult first year in power, which has seen Labour sink to just 20% in the polls, behind Nigel Farage's Reform, which is leading on 28%. Ms Phillipson, who has spoken of growing up in a working class area of Sunderland before going on to high office, said she was the person to take on Reform and secure a second term for Labour. Speaking at a hustings event last week, she told members: \"You can use this contest to look backward, to pass judgment on what has happened in the last year, or you can use it to shape positively what happens in the run-up to the next election.\"  'Unforced errors' cost government Her message comes in contrast to that of Ms Powell, who has pitched herself as the \"shop steward\" of the parliamentary party willing to deliver criticism to the prime minister if necessary. She said Labour's mistakes in office over welfare and winter fuel payments had given the impression that it is \"not on the side of ordinary people\". In an interview with the BBC, Ms Powell praised the government's \"many achievements\", but added: \"Some of the mistakes that we've made, or some of the unforced errors, have given a sense that we're not on the side of ordinary people.\" Although Ms Powell secured fewer nominations from MPs than Ms Phillipson, recent polling by Survation suggests she is ahead with members on 47%, compared with 30% for her rival."
    },
    {
        "title": "Home Office can deport migrant under 'one in one out deal', court says - after losing similar case on Tuesday",
        "description": "An Eritrean man can be deported to France under the government's 'one in, one out' scheme, a judge has ruled.",
        "url": "https://news.sky.com/story/home-office-wins-second-legal-challenge-over-deportation-flights-under-one-in-one-out-deal-13433425",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-small-boat-migrants_6962503.jpg?20250711110447",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-18 14:12:00",
        "Headline": "The Home Office faced its second legal challenge after a High Court judge issued a temporary halt to plans to deport another man over human trafficking concerns.",
        "Content": "An Eritrean man can be deported to France under the government's 'one in, one out' scheme, a judge has ruled. It's the second similar case to come before the High Court this week. In the first, separate case, another man's deportation was temporarily blocked. Whereas, the government has won the right to return the man at the centre of this legal challenge to France. The man, who cannot be named for legal reasons, is from Eritrea and arrived in the UK last month after crossing the English Channel on a small boat. He was allegedly forced to flee his home country in 2019 because of forced conscription, and passed through Ethiopia, South Sudan, Libya and France, before entering the UK. Lawyers acting for the migrant in today's case said he is due to be deported at 6.15am on Friday morning, but argued he had a \"number of different medical needs\" and that he has been a \"victim of trafficking\". Sonaili Naik KC, representing the migrant, also told the High Court that her client's case had been rushed. She said: \"They have just simply expedited a decision, for the purposes of trying to rush to maintain a removal.\" \n                  What a moment for Shabana Mahmood to take the helm at the Home Office\n                 \n                  Ten organisations write urgent letter to home secretary over violence against women and girls strategy\n                 \n                  'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls\n                 The judge who ruled on this case was also the one who issued the temporary block preventing the other migrant from being deported on Tuesday night, in a move the Home Secretary Shabana Mahmood called \"intolerable\" and vowed to \"fight\".  Mr Justice Sheldon's ruling in that case led to the Home Office revising its policy on reconsidering modern slavery decisions, so that anyone removed to a safe country who wants to appeal against a National Referral Mechanism (NRM) decision - which identifies and assesses victims of slavery and human trafficking - will now be unable to do so. Instead, they can now appeal via judicial review from another country, such as France. This then change came to play a role in this separate case today. Ms Naik told the High Court: \"The secretary of state [Ms Mahmood] has today come to this court to say, without notice to the claimant, that the procedures in France are fine, it is all safe, no problems, the trafficking claims will be dealt with. \"Our prima facie case is that the secretary of state needs assurances from France that that is the case, that non-French nationals trafficked in Libya will have access to the NRM there.\" But Sian Reeves, for the Home Office, responded that there was \"no arguable public law error\" in the way Ms Mahmood altered the policy, given that \"she had ample evidence\". The government lawyer added that there was \"no serious issue to be tried\" as the migrant's alleged \"trafficking claim can be investigated in France\". She insisted to the court that his deportation could go ahead, as his \"rights are protected\" there. Mr Sheldon ruled this evening that he agreed with government lawyers that there was \"no serious issue to be tried in this case\". He added that there is \"significant public interest in favour of the claimant's removal\". The High Court judge also said the migrant had given two very different accounts of being trafficked, meaning that \"his credibility was severely damaged\" and his allegations \"could not reasonably be believed\". Mr Sheldon concluded that the Home Office had \"sufficient information\" to deport the man and that it was \"reasonable\" to conclude that \"further information would not make any material difference\". Read more:How does the UK-France migrants deal work? Has anybody been successfully deported under the scheme yet? Yes. Earlier in the day, a man who illegally crossed the English Channel last month became the first person to be deported under the terms of the government's \"one in, one out\" migrant return deal with France. The Home Office confirmed the man was sent back to France on a commercial flight at 6.15am this morning. His departure follows efforts to deport an Eritrean man on Wednesday morning being blocked the night before by Mr Sheldon.  The department has said further deportation flights are due later this week and into next week. The UK-France deal was signed in July and saw the first migrants detained in the UK to await deportation in August. It allows the UK to send back a migrant who crosses the Channel illegally in exchange for accepting the same number of migrants in France who have a valid asylum claim. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Row breaks out at top of Your Party over claims of 'sexist boys club'",
        "description": "A row has broken out at the top of Your Party after Jeremy Corbyn accused co-leader Zarah Sultana of sending out unauthorised emails encouraging paid membership.",
        "url": "https://news.sky.com/story/row-breaks-out-at-top-of-your-party-over-claims-of-sexist-boys-club-13433394",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jeremy-corbyn-zarah-sultana_7024201.jpg?20250918150806",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-18 13:09:00",
        "Headline": "Jeremy Corbyn is seeking legal advice after Zarah Sultana sent out an \"unauthorised email\" about paid membership - which she claimed she did after being \"sidelined\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n A row has broken out at the top of Your Party after Jeremy Corbyn accused co-leader Zarah Sultana of sending out unauthorised emails encouraging paid membership. Meanwhile, Ms Sultana admitted she had broken ranks, but claimed she did so after being \"sidelined\" by a \"sexist boys club\". Suspicions were aroused when Mr Corbyn released a statement on social media warning followers to ignore an email they received today about a membership portal with a new domain name, and cancel any direct debits they may have set up. The statement, which said legal action was being considered, was signed by the former Labour leader and four other independent MPs who were part of the founding process of Your Party - Ayoub Khan, Adnan Hussain, Iqbal Mohamed and Shockat Adam. However, it was not signed by Ms Sultana, who quit Labour to launch the new left-wing party with Mr Corbyn in July and has been sharing links to the membership portal today. Mr Corbyn's letter said: \"This morning, an unauthorised email was sent to all yourparty.uk supporters with details of a supposed membership portal hosted in a new domain name. \"Legal advice is being taken. That email should be ignored by all supporters. If any direct debits have been set up, they should be immediately cancelled.\" \n                  Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 \n                  Why Starmer's move to recognise Palestine is a major shift\n                 Ms Sultana issued a statement shortly afterwards in which she admitted emails sent to followers this week did not have the \"dual authorisation of both myself and Jeremy - which was the agreement made at the start of this process\". However, she said: \"After being sidelined by the MPs named in today's statement and effectively frozen out of the official accounts, I took the step of launching a membership portal so that supporters could continue to engage and organise.\" She insisted that this was in line with the roadmap set out to members on Monday and that this is a \"safe, secure, legitimate portal for the party\". She added: \"My sole motivation has been to safeguard the grassroots involvement that is essential to building this party. \"Unfortunately, I have been subjected to what can only be described as a sexist boys' club: I have been treated appallingly and excluded completely.\" She called on Mr Corbyn to meet with her and \"agree to make public all agreed structures, processes and decision-making protocols\" to ensure that \"nothing like this can ever happen again\". The emails sent out by Ms Sultana had encouraged people to sign up for £5 a week or £55 a year. In a statement on Thursday evening, Your Party announced it has reported itself to the Information Commissioners Office after a \"false membership\" system was \"unilaterally launched\". It appears that Mr Corbyn was removed as a \"person of significant control\" of Your Party UK Ltd on Monday, 15 September. But the former Labour leader remains a director of the company. 'The right wing will love this' In a post earlier on Thursday, Ms Sultana, the now independent MP for Coventry South, had claimed 20,000 paid members had signed up. Sam T, who signed up to the monthly membership, told Sky News he was considering cancelling his membership and \"might as well go and give £5 to someone on the street\". Another supporter, Layla C from Glasgow, said she has cancelled her membership until she gets clarity on the situation, saying: \"I don’t think it’s a very good look for either of them. The right-wing will love this and it’s not looking good.\" But Ben Clinton from London said that while he wanted to see the co-leaders work together, he is not put off by the row. \"If you've got an old boys club who are more concerned about pointless control freakery in the background, then I think it's time for a new generation to take control,\" he said.  Critics of the pair were quick to ridicule the situation. Labour MP Connor Naismith tweeted: \"It's going really well I see.\" He added: \"Worth saying that this outfit is talking about contesting elections... The point of which would be to persuade people that they are capable of running the British state.\" Row 'brewing for some time' The rift comes after Your Party told supporters earlier this week that membership would open by the end of September, followed by national assemblies in October and an online vote on the new name for the party, before a founding conference in November. A source close to Your Party told Sky News that a row between the co-leaders had been brewing \"for some time\". The new organisation got off to a rocky start when it was announced by Ms Sultana in early July - in a move that appeared to blindside Mr Corbyn. The pair confirmed the launch a few weeks later, sharing a link to a website called Yourparty.co.uk, but then clarified that was not actually the name and members would decide that in due course. As Sky News previously reported, a debate quickly raged about its leadership model, with split opinions on whether Mr Corbyn and Ms Sultana should co-lead the party or whether outside candidates should be given the chance to run in a \"grassroots\" contest."
    },
    {
        "title": "Former Scottish Tory leader Douglas Ross accuses SNP minister Jamie Hepburn of assault and verbal abuse",
        "description": "Former Scottish Tory leader Douglas Ross has accused a government minister of assaulting and verbally abusing him at Holyrood.",
        "url": "https://news.sky.com/story/former-scottish-tory-leader-douglas-ross-accuses-snp-minister-jamie-hepburn-of-assault-and-verbal-abuse-13433354",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-douglas-ross-msp-douglas-ross_7024246.jpg?20250918153123",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-09-18 12:18:00",
        "Headline": "Jamie Hepburn admitted he put his hand on Douglas Ross' shoulder and \"probably used a few choice words I shouldn't have\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Former Scottish Tory leader Douglas Ross has accused a government minister of assaulting and verbally abusing him at Holyrood. Mr Ross made the allegation against parliamentary business minister Jamie Hepburn at the end of First Minister's Questions (FMQs) on Thursday. The alleged incident has not been reported to Police Scotland, but Mr Ross intends to speak with parliamentary police. The politician told the chamber that he had emailed Presiding Officer Alison Johnstone about the alleged incident. Addressing First Minister John Swinney, Mr Ross claimed he had been \"physically assaulted and verbally abused\" by Mr Hepburn on Wednesday. Speaking to journalists, Mr Hepburn admitted that he put his hand on Mr Ross' shoulder and \"probably used a few choice words I shouldn't have\". He added: \"That's it.\" \n                  What happens when an MP defects to another party?\n                 \n                  Former Tory minister Maria Caulfield defects to Reform UK\n                 \n                  Kemi Badenoch reveals her conditions for helping Sir Keir Starmer with 'out of control' welfare spending\n                 In a statement earlier, Mr Ross said: \"The minister grabbed me on the shoulder and held on to me all the way out of the chamber. \"At the same time he was continually swearing at me and getting more and more aggressive. He just wouldn't give up. \"He lost his temper in a big way and there is no way that behaviour can be tolerated in any workplace. \"Jamie Hepburn has a duty to listen to members and respond to them - that is his role as parliamentary business [minister]. \"However, it seems that if he disagrees with you he resorts to violent, threatening and intimidating behaviour. \"Given the seriousness of the incident and having alerted parliamentary officials yesterday afternoon, I felt it was right to also raise it with the first minister.\" Read more from Sky News:Three arrested on suspicion of assisting Russian intelligence serviceTeenagers charged over cyber attack on TfL costing millions of pounds Mr Ross, who served as leader of the Scottish Conservatives from 2020 until 2024 and is the MSP for the Highlands and Islands, noted that Mr Hepburn was absent from the chamber as he questioned whether Mr Swinney would be making a statement in regards to the allegation. The first minister, who was in Windsor on Wednesday for the state banquet held for US President Donald Trump, told journalists after FMQs: \"It's the first I've heard about it. Obviously, I was away yesterday so I don't have any knowledge about it.\" Mr Swinney added that he would \"consider these issues\". Following Mr Ross' claim, Presiding Officer Ms Johnstone said: \"This is a very serious allegation and it is important that it is dealt with through the appropriate processes. \"I expect all members to take their responsibilities under the code of conduct seriously.\" Mr Hepburn, MSP for Cumbernauld and Kilsyth, has held numerous roles within the Scottish government, and was most recently minister for independence from 2023 until 2024. Asked why he lost his temper, Mr Hepburn said: \"I think everyone knows the context. I was speaking to a business motion after we had just agreed landmark legislation to improve the experience for victims and witnesses yesterday. \"I think he spoke to the business motion in a way that he shouldn't have, but I recognise I should have kept my cool and not used the words I shouldn't have.\" When asked if he would apologise to Mr Ross, Mr Hepburn said he would \"freely speak to him\" if he wished. The Scottish parliament said there was no CCTV footage of the alleged incident. A spokesperson said: \"The parliament takes a zero-tolerance approach to bullying and harassment and any allegations of criminality should be reported directly to the police. \"As the presiding officer said in the chamber, this is a very serious allegation and it is important that it is dealt with through the appropriate processes.\" The Scottish government has been contacted for comment."
    },
    {
        "title": "Next issues scathing attack on UK economy as it reports tens of millions in profit growth ",
        "description": "The chief executive of Next has issued a scathing critique of the UK economy as the company posted strong sales and tens of millions in profit growth.",
        "url": "https://news.sky.com/story/next-issues-scathing-attack-on-uk-economy-as-it-reports-tens-of-millions-in-profit-growth-13433185",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-next-shop_6978999.jpg?20250731140048",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-18 06:46:00",
        "Headline": "The hottest spring and summer on record, and the M&S cyber attack helped the high street retailer boost sales.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The chief executive of Next has issued a scathing critique of the UK economy as the company posted strong sales and tens of millions in profit growth. Next's CEO, the Conservative life peer Lord Wolfson, said the high street chain has reason \"to be cautious\" and \"at best\" expects \"anaemic\" economic growth. Money blog: cost of visiting popular tourist destination rising Economic expansion is being held back by \"declining job opportunities, new regulation that erodes competitiveness, government spending commitments that are beyond its means, and a rising tax burden that undermines national productivity\", Lord Wolfson said. His comments come as the high street bellwether saw double-digit sales and profit growth, which was attributed to \"favourable weather and competitor disruption,\" as the UK recorded the hottest spring and summer on record, and department store Marks and Spencer (M&S) reeled from a cyberattack. M&S's online sales and click and collect were down for weeks, while some shelves were empty after the attack was detected after the Easter bank holiday weekend. Read more:Trump state visit is all about deals to turn around UK economyMeta announces new smart glasses - I've tried them \n                  'If we're not there already we're coming to a town near you' Aldi says, vowing lower prices before Christmas\n                 \n                  Good weather and Women's Euros helps UK net surprise boost to retail sales\n                 \n                  Cara Delevingne reveals how Topshop inspired her fashion sense - as brand relaunches in London\n                 This helped overall Next sales rise far more than it previously expected to 10.3% and profits grow from £452m to £515m in the six months to July, compared with a year earlier.  Also boosting sales was expansion in the UK and international growth. Nearly a third of international sales come from aggregator websites like Zalando. UK economy stalling further gains? Such a showing will be difficult to maintain due to a weakening economy, Next said. \"The first half [of the year] was boosted by factors that are unlikely to continue, and the belief that the UK economy is likely to weaken going forward\", Lord Wolfson said. \"To be clear, we do not believe the UK economy is approaching a cliff edge\", he added. Despite the dreary outlook, analysis from financial services firm Hargreaves Lansdown said \"Next is in a strong position to continue dominating the UK market\". \"Strong demand in its online channel remains a running theme, and it's likely to remain the main growth driver,\" said the firm's equity analyst Aarin Chiekrie."
    },
    {
        "title": "'It's embarrassing' - Your Party members speak out following Corbyn and Sultana clash",
        "description": "Supporters of Jeremy Corbyn and Zarah Sultana's left-wing movement, Your Party, have said a very public split between the two founders is \"embarrassing\" and \"frustrating\".",
        "url": "https://news.sky.com/story/its-embarrassing-your-party-members-speak-out-following-corbyn-and-sultana-clash-13433528",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jeremy-corbyn-zarah-sultana_6956648.jpg?20250724123351",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-18 16:44:00",
        "Headline": "Several supporters say they could cancel their memberships after 'really messy' split between party founders",
        "Content": "Supporters of Jeremy Corbyn and Zarah Sultana's left-wing movement, Your Party, have said a very public split between the two founders is \"embarrassing\" and \"frustrating\". A row broke out between the former Labour leader and Ms Sultana on Thursday afternoon, after he accused her of sending out unauthorised emails encouraging paid membership. The one-time potential prime minister accused his co-leader of wrongdoing, and said legal action was being considered, in a letter signed by four other independent MPs who were part of the founding process of Your Party. Ms Sultana, who resigned from the Labour Party to help found the new left-wing organisation in July this year, hit back and said she had been \"sidelined\" by a \"sexist boys club\". The 31-year-old MP added in a statement that she had been \"effectively frozen out of the official accounts\" of the group, and therefore \"took the step of launching a membership portal that supporters could continue to engage and organise\". She insisted she had acted solely to \"safeguard the grassroots involvement\" of Your Party.  But many of those who have signed using Ms Sultana's new, paid membership form have told Sky News they are unsure about the move - with several saying they are thinking of cancelling their membership. \n                  Is Corbyn's comeback a headache for Starmer - or a red herring?\n                 \n                  Inside Jeremy Corbyn's new party and the battle for leadership\n                 \n                  Green leadership contenders reject calls for Corbyn pact - and say party must retain 'distinctive identity'\n                 Sam T, who signed up for a £5 a month membership, called the public split \"a bit of a shambles\". He told Sky News he is \"willing to give Zarah the benefit of the doubt\", but said he might as well have given a fiver to a member of the public, instead. Sam said: \"I’m considering cancelling it now - I don’t want to pay for no reason. \"I might as well go and give £5 to someone on the street.\" Layla C, another person who signed up for the monthly membership this morning, has already cancelled her direct debit. She said she and others were \"really excited\" when the official looking email came out from Your Party, but said the split has been \"really messy and destroyed a bit of hope that we all held when the party was first announced\". Layla, from Glasgow, added: \"It looks so unprofessional, and we don't know what's happening. I don't think it's a very good look for either of them.\" Jack, who signed up to be a concession member, told Sky News: \"It's really frustrating as I was very happy to see there was finally a membership sign-up. \"Corbyn and Sultana don't have serious ideological differences. It seems like an entirely personality based split, and it's really confusing to me how the people around them expect ordinary left-wing voters to care about who's people are in charge. It just seems really self-indulgent.\" Dan, from London, signed up for a full membership this morning but admitted that \"the split is quite embarrassing\". But he added that he became a member \"because of Zarah\" and added he would be staying a member because \"as long as the money is going to the party, then that's all good\". Support for Ms Sultana over allegations of sexism Speaking to members who signed up this afternoon, there has also been quite a lot of sympathy for Ms Sultana's claim that she has faced sexism. Russel Whiting, a councillor for Gedling Borough Council, warned: \"I think if you've got any committee where it's five men and one woman then that's demonstrably a boy's club, and she's right to fight for the future of the party and change that.\" Layla, who as we heard has already cancelled her membership, admitted that she's \"inclined to side with Zarah on this\". She explained: \"Jeremy has started to align themselves with people who are not necessarily left leaning. It seems like it’s all the guys ganging up on her. But at the same time, it was unprofessional of her to go and launch the membership if she didn’t have the go ahead.\" Dan also told Sky News that while \"the old guard are great and Corbyn has done a lot for this country\", he believes that \"the future is with the young and Zarah's politics are something I subscribe to\". Sky News has contacted both Mr Corbyn and Ms Sultana for comment."
    },
    {
        "title": "MI6 launches new drive to recruit spies - including Russians",
        "description": "MI6 is launching a new dark web portal to recruit spies for the UK.",
        "url": "https://news.sky.com/story/mi6-launches-new-drive-to-recruit-spies-including-russians-13433714",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vauxhall-london-mi6_6943025.jpg?20250615212519",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-18 21:41:00",
        "Headline": "The secure messaging platform Silent Courier aims to boost national security by making it easier for the MI6 to recruit potential agents, the Foreign Office said.",
        "Content": "MI6 is launching a new dark web portal to recruit spies for the UK. The secure messaging platform Silent Courier aims to boost national security by making it easier for the intelligence agency to recruit potential agents in Russia and around the world, the Foreign Office said. Foreign Secretary Yvette Cooper said: \"As the world changes, and the threats we're facing multiply, we must ensure the UK is always one step ahead of our adversaries.\" Silent Courier is accessible from Friday and enables a secure avenue to submit sensitive information to the UK relating to terrorism or hostile intelligence activity. Instructions on how to use the portal - including recommendations to use trustworthy VPNs and devices not linked to users - will be available on MI6's verified YouTube channel. Sir Richard Moore, the outgoing MI6 chief, is set to announce Silent Courier and confirm details about the portal during a speech in Istanbul on Friday. Read more from Sky News:Three arrested on suspicion of helping Russian intelligenceTeenagers charged over cyber attack on TfL costing millions Mr Moore, who has previously called on Russians to spy for Britain, is expected to say: \"Today we're asking those with sensitive information on global instability, international terrorism or hostile state intelligence activity to contact MI6 securely online. \"Our virtual door is open to you.\" The CIA launched a similar approach in 2023, publishing videos on social media to target potential Russian spies."
    },
    {
        "title": "Norman Foster on 'incredible' masterplan for new Manchester United ground",
        "description": "Football and the royals are two subjects which have always attracted very outspoken fans. Now, aged 90, Lord Norman Foster is attempting to please both.",
        "url": "https://news.sky.com/story/norman-foster-on-incredible-masterplan-for-new-manchester-united-ground-13433516",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-manchester-united-new-stadium_6852942.jpg?20250311101208",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-18 16:11:00",
        "Headline": "Lord Norman Foster says Manchester United's new stadium is going to be \"different... and better\"  - and criticises the short-term thinking he blames for the cancellation of HS2.",
        "Content": "\n          Arts and entertainment correspondent\n        Football and the royals are two subjects which have always attracted very outspoken fans. Now, aged 90, Lord Norman Foster is attempting to please both. One of the one of the world's most important living architects, he is known for being the vision behind some of the world's most iconic designs - including London's \"Gherkin\" building, the Millennium Bridge and the British Museum's spectacular Great Court. Arguably, however, two of his most talked about designs are yet to be built. In June, his firm Foster + Partners was announced as having won the commission to build a national memorial in honour of the late Queen Elizabeth II. Before that, in March, his firm's vision for a new 100,000-seater stadium at Old Trafford was revealed, which he describes as \"the project of a lifetime\". 'A galvanising project' \"The fan base is incredible,\" Lord Foster said of his excitement at being commissioned to work on the new ground. For the renowned architect it is a homecoming of sorts, given Lord Foster's working-class roots, having grown-up in Manchester. Was he excited to be involved? \"You bet,\" he exclaims. \"It's a galvanising project… and so many things can naturally ride on the back of that sporting, emblematic kind of team.\" Set to cost around £2bn - with its three tall masts acting as a vast umbrella over Old Trafford - the design is part of a larger regeneration project which Lord Foster claims could be completed in five years. It is described as a \"master plan that will create streets, squares, neighbourhoods and connect with the heart of Manchester.\" Asked whether it will feel unlike any other British stadium, he said: \"Manchester United is different and therefore its stadium's going to be different… and better, of course.\" And what of the QEII memorial? He says his design to remember the late monarch in London's St James' Park will be \"more of all the good things\". His plans include a statue of Queen Elizabeth II standing next to her husband Prince Philip, and a semi-glass bridge which is a nod to her wedding tiara. As for those who've questioned whether maintaining its sparkle might prove to be problematic, Lord Foster insists it'll be \"less maintenance, more joy\". He says his hope is \"to address the many millions who traverse that [park], the daily commuters and many tourists, and to make that more human, to make it a better experience and a reminder of the legacy of the most extraordinary long-serving monarch\". After collecting the London Design Festival's prestigious lifetime achievement medal earlier this week, with six decades of experience under his belt, Lord Foster says he finds Britain's inability to invest in infrastructure frustrating. \"I lamented, like so many, the cancellation of HS2,\" he says. The long-delayed rail route's northern leg to Manchester was scrapped by Rishi Sunak in 2023. \"That was about levelling-up. It wasn't about getting from one place in lightning speed, it was taking the burden off the regional network so it would serve local communities better.\" He says \"connectivity is the answer to many of the social issues that we talk about\". The tendency of politicians, he says, to prioritise short-term issues doesn't help when it comes to seeing the bigger picture. \"There is not the awareness of the importance of design and planning… you do need a political awareness,\" he says. \"The city is not static, it's dynamic. It's always changing, evolving, adapting to change, and it can do that well, or it can do it badly. But it needs planning, it needs anticipation.\""
    },
    {
        "title": "Kimmel 'fired for lack of talent', Trump says, as Obama decries 'government coercion'",
        "description": "Donald Trump has claimed Jimmy Kimmel's late-night talk show was pulled off the air because of \"bad ratings\".",
        "url": "https://news.sky.com/story/jimmy-kimmel-should-have-been-fired-a-long-time-ago-says-trump-after-obamas-criticism-13433412",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel_7024425.jpg?20250918174422",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-18 13:45:00",
        "Headline": "Kimmel used his show on Monday to criticise Donald Trump for his response to the assassination of Charlie Kirk.",
        "Content": " Donald Trump has claimed Jimmy Kimmel's late-night talk show was pulled off the air because of \"bad ratings\". Kimmel's programme on US network ABC was axed after he criticised the US president and his allies for their response to the assassination of the right-wing influencer Charlie Kirk. The decision led to accusations that free speech was under attack in the US, with Democrats including former US president Barack Obama and a number of celebrities sounding an alarm. Mr Trump said: \"Well, Jimmy Kimmel was fired because he had bad ratings, more than anything else.\" \"And he said a horrible thing about a great gentleman known as Charlie Kirk.\" Speaking at a news conference alongside Sir Keir Starmer, Mr Trump added: \"Jimmy Kimmel is not a talented person. He had very bad ratings, and they should have fired him a long time ago. \"So, you know, you could call that free speech or not. He was fired for lack of talent.\" \n                  Trump has a creeping control over what gets said on the airwaves and it screams censorship\n                 \n                  What we can learn about Charlie Kirk suspect Tyler Robinson from his charging document\n                 \n                  FBI director Kash Patel shouts at Democrat senators over Charlie Kirk and Jeffrey Epstein during oversight hearing\n                 Aboard Air Force One, Mr Trump said: \"When a host is on network television, there is a license. ... I think maybe their license should be taken away.\" He said whether ABC's license could be taken away over Kimmel's comments \"will be up to Brendan Carr\", chairman of the Federal Communications Commission. The US president also said that Kimmel's \"ratings were worse than cold air. I think they got rid of cold air, which is a good thing to do. Look, that's something that we should be talking about for licensing, too\". The latest season of Jimmy Kimmel Live averaged 1.57 million viewers per episode, according to media research firm Nielsen - and the show's YouTube channel has almost 21 million subscribers. What did Kimmel say? Kimmel made the controversial remark on Monday night. He said: \"We hit some new lows over the weekend with the MAGA gang desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it.\" Speaking about Mr Trump, he added: \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish.\" \"Many in MAGA land are working very hard to capitalise on the murder of Charlie Kirk,\" he continued.  Free speech under attack? Disney-owned ABC then said the show would be taken off air indefinitely, and with immediate effect, after network operator Nexstar - which operates a number of ABC affiliates - said it would stop broadcasting it. But the move - months after fellow CBS late-night show host Stephen Colbert saw his programme cancelled - sparked concern over the state of freedom of speech in the country. Former US president Barack Obama wrote on X: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like. \"This is precisely the kind of government coercion that the First Amendment was designed to prevent, and media companies need to start standing up rather than capitulating it.\" A string of high-profile celebrities, including actor Ben Stiller, criticised the decision. Mr Stiller reacted to another post on the news, replying: \"This isn't right.\" Actress Alison Brie said in an Instagram story: \"This is unreal. And very scary.\" Actress Jean Smart and comedian Alex Edelman also attacked the move. The American Federation of Musicians, Directors Guild of America, IATSE and SAG-AFTRA have also condemned the ABC's decision in a joint statement. \"The indefinite removal of Jimmy Kimmel Live under government pressure is not an isolated incident. It is part of a disturbing trend of increasing interference in creative expression,\" the unions said. \"This kind of political pressure on broadcasters and artists chills free speech and threatens the livelihoods of thousands of working Americans.\" What happened Kimmel's comments led to the Trump backer Mr Carr threatening to \"take action\" against Disney and ABC. In an interview with conservative podcaster Benny Johnson, he said: \"We can do this the easy way or the hard way.\" After the show was pulled, he then praised Nexstar's broadcasting division, saying \"it is important for broadcasters to push back on Disney programming that they determine falls short of community values\". Kimmel's suspension has triggered outrage from Democrats like California Governor Gavin Newsom, who posted on X: \"The @GOP [Republican Party] does not believe in free speech. They are censoring you in real time.\" Senate minority leader Chuck Schumer called for people \"across the political spectrum… to stop what's happening to Jimmy Kimmel\". A representative for Kimmel did not immediately respond to a request for comment. He has not issued any statement since the show's withdrawal. Sinclear, the largest ABC affiliate group in the US, has called on Mr Kimmel to \"issue a direct apology to the Kirk family\" and \"make a meaningful personal donation to the Kirk Family and Turning Point USA\" in a statement on Thursday. Read more:Analysis: Trump has a creeping control over what gets saidWhat did Jimmy Kimmel say about Charlie Kirk? The company said its ABC stations will air a special in remembrance of Mr Kirk during Jimmy Kimmel Live's timeslot on Friday. Both Disney and Nexstar have FCC business ahead of them. Disney is seeking regulatory approval for ESPN's acquisition of the NFL Network and Nexstar needs the Trump administration go-ahead to complete its $6.2bn purchase of broadcast rival Tegna. Mr Kirk's suspected killer, Tyler Robinson, appeared in court for the first time on Tuesday. Prosecutors said he had expressed negative views about Mr Kirk, an influential media figure in the MAGA movement."
    },
    {
        "title": "Sally Rooney says she's been told not to enter UK because she may be arrested",
        "description": "Sally Rooney says she could not come to the UK to pick up an award earlier this week because she can \"no longer safely enter the UK without facing arrest\".",
        "url": "https://news.sky.com/story/sally-rooney-says-she-can-no-longer-safely-enter-uk-without-facing-arrest-13433341",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sally-rooney-author_6994490.jpg?20250818162218",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-18 11:59:00",
        "Headline": "The Normal People author said she was sorry not to be at the Sky Arts Awards in person and reiterated her solidarity with Palestinians.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Sally Rooney says she could not come to the UK to pick up an award earlier this week because she can \"no longer safely enter the UK without facing arrest\". The Irish author of hit novels including Normal People and Conversations With Friends recently pledged her royalties to proscribed group Palestine Action, meaning she is at risk of committing a terror offence under UK law. Palestine Action was proscribed as a terrorist organisation in the UK on 5 July. The 34-year-old had won a Sky Arts Award, in the literature category, for her latest novel, Intermezzo, beating fellow writers Alan Hollinghurst and Gwyneth Lewis. Rooney's editor, Alex Bowler, attended the ceremony on Tuesday at London's Roundhouse on her behalf. Accepting the award, he read a statement from Rooney, which said: \"I'm so touched and grateful to receive this prize. \"I truly loved writing Intermezzo, and it means the world to me to think that it found some small place in the lives of its readers. Thank you. \n                  First people charged with supporting Palestine Action plead not guilty\n                 \n                  New Banksy artwork to be removed from Royal Courts of Justice after report of criminal damage\n                 \n                  890 people arrested at Palestine Action protest - including 17 on suspicion of assaulting police officers\n                 \"I wish that I could be with you this evening to accept the honour in person, but because of my support for non-violent anti-war protest, I'm advised that I can no longer safely enter the UK without potentially facing arrest. \"In that context, I want to thank you all the more warmly for honouring my work tonight and to reiterate my belief in the dignity and beauty of all human life and my solidarity with the people of Palestine.\" Read more entertainment news:Spain votes to boycott Eurovision if Israel competesBob Geldof reveals why he won't run for Irish presidency  Rooney previously told the Irish Times that if backing the group \"makes me a 'supporter of terror' under UK law, so be it\". She has said she will use the proceeds of her work and her public platform to continue her support for Palestine Action and \"direct action against genocide in whatever way I can\". Palestine Action was banned under terrorism legislation in the UK, but not under Irish law. Rooney currently lives in the west of Ireland. More than 700 people have been arrested in relation to alleged support of Palestine Action since it was banned - including 522 during a protest in central London on 9 July. The group was proscribed after the group claimed responsibility for damage to jets at RAF Brize Norton and was also linked to \"allegations of a serious assault on staff\". Earlier this week, a UN Commission report found Israel was committing genocide in Gaza. Israel's foreign ministry said it \"categorically rejects this distorted and false report\" and called for the commission to be abolished. On Wednesday night, stars including Richard Gere, Florence Pugh, Damon Albarn and Louis Theroux all appeared at the Together for Palestine concert, at Ovo Arena Wembley, which raised £1.5m to support Palestinian humanitarian organisations. See all the Sky Arts Awards winners here."
    },
    {
        "title": "Together For Palestine: Star-studded concert at Wembley Arena raises £1.5m",
        "description": "A charity event at Wembley Arena has raised &#163;1.5m to support Palestinian-led organisations working on the frontline of the Israel-Hamas war.",
        "url": "https://news.sky.com/story/together-for-palestine-star-studded-concert-at-wembley-arena-raises-16315m-13433462",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-riz-ahmed-together-for-palestine_7024288.jpg?20250918155901",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-18 15:02:00",
        "Headline": "Stars including Richard Gere, Florence Pugh, Riz Ahmed, Nicola Coughlan and Damon Albarn took to the stage to show support for Palestine.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n A charity event at Wembley Arena has raised £1.5m to support Palestinian-led organisations working on the frontline of the Israel-Hamas war. Benedict Cumberbatch, Riz Ahmed and Richard Gere were among the stars lending their voice to Together For Palestine on Wednesday, organised by songwriter, artist and activist Brian Eno. It comes days after a two-year UN investigation found Israel has committed genocide in Gaza, which it denies. High-profile names from across the globe and spanning the generations were there, with musicians, actors, sportspeople, journalists and poets contributing to the show. Actress Florence Pugh spoke on stage, telling the crowd: \"Silence in the face of such suffering is not neutrality, it is complicity. Empathy should not be this hard and it should have never been this hard\". Hollywood actor Gere was joined on stage by medics who have served on the ground in Gaza, urging the audience to use their voices by \"speaking the truth with generosity and love, that's how you change things\". Bridgerton star Nicola Coughlan called on other artists to speak up too, saying: \"There are many artists that I love, and I know you love, who have hundreds of millions of followers, and they're saying nothing.\" \n                  Gaza could be 'real estate bonanza', Israeli minister Bezalel Smotrich says\n                 \n                  Sadiq Khan calls out Gaza 'genocide', as Starmer 'delays' recognising Palestinian state until end of Trump's state visit\n                 \n                  'At least 16' killed in latest Israeli attacks on Gaza - as 10 children arrive in UK for NHS treatment\n                 Broadcaster Louis Theroux spoke movingly about his time making a documentary in the West Bank, saying the people of Palestine were \"subjected to a kind of slow, grinding, relentless violence\". Music-wise, a live ensemble featuring Damon Albarn, Paul Weller, Adnan Joubran, Hot Chip's Alexis Taylor and Nadine Shah performed a specially composed musical piece, and Neneh Cherry, Greentea Peng, and Bastille singer Dan Smith united for a rendition of Cherry's hit song 7 Seconds. A pre-recorded version of Annie Lennox's Why was played, with revised lyrics to reflect the horrors of the Israel-Hamas war and there was an exclusive filmed performance by Bristol band Portishead. From the sports world, football star Eric Cantona called for a global boycott of Israel throughout football, asking clubs to refuse to play Israeli teams, saying: \"It's time for everyone to get off the sidelines, who will follow me?\" Poetry and prose were also read out, and Palestinian art was showcased throughout the concert. Money raised from the concert - which was arranged just seven weeks ago and saw tickets sell out in hours - will be distributed to Palestinian-led organisations such as Taawon, Palestine Children's Relief Fund and Palestine Medical Relief Service.  It's the first large-scale music event to show support for Palestine, following individual shows of solidarity from several artists, some of which have provoked backlash. Electronic music band Massive Attack projected a Palestinian flag on stage at one of their concerts in Bristol last year. Kneecap member Liam Og O hAnnaidh, who performs under the name Mo Chara, was charged with supporting a proscribed terror organisation after being accused of displaying a flag in support of Hezbollah at a gig in London in November last year. In June, punk duo Bob Vylan led chants of \"death to the IDF (Israel Defence Forces)\" during a set at Glastonbury Festival. The BBC, who livestreamed the set, were forced to apologise, and a police investigation is currently underway. Health officials in Hamas-run Gaza say nearly 65,000 people have been killed in the two years of the war - a figure that doesn't differentiate between fighters and civilians. The war began after the Hamas terror attack on Israel on 7 October 2023, which killed around 1,200 and saw 251 taken hostage. Forty-eight hostages remain in Gaza, but fewer than half are thought to still be alive."
    },
    {
        "title": "What did Jimmy Kimmel say about Charlie Kirk - and why was his show suspended?",
        "description": "Jimmy Kimmel's talk show has been suspended after comments he made about Charlie Kirk's death during an opening monologue.",
        "url": "https://news.sky.com/story/what-did-jimmy-kimmel-say-about-charlie-kirk-and-why-was-his-show-suspended-13433216",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jimmy-kimmel-emmy-awards_7024153.jpg?20250918143739",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-18 08:13:00",
        "Headline": "Jimmy Kimmel Live, a staple of US television since 2003, has been suspended days after the host criticised Trump's MAGA movement over its reaction to Charlie Kirk's death. ",
        "Content": "Jimmy Kimmel's talk show has been suspended after comments he made about Charlie Kirk's death during an opening monologue. The veteran late-night host used his show on Monday night to accuse Donald Trump and his allies of capitalising on the conservative influencer's assassination last week, causing backlash from right-wing politicians and influencers. Disney-owned ABC said on Wednesday it would be taken off-air indefinitely - and with immediate effect - sparking strong responses from both Republicans and Democrats. But what did Kimmel say, what reasons have been given for the suspension - and what has the reaction been? What did Kimmel say about Charlie Kirk's death? Delivering his opening monologue, the host said the \"MAGA gang\" was \"desperately trying to characterise this kid who murdered Charlie Kirk as anything other than one of them and doing everything they can to score political points from it\". He also accused them of \"working very hard to capitalise on the murder\". \n                  Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 \n                  Trump state visit latest: President attacks Sadiq Khan on flight home - and says he got him blocked from state banquet\n                 He then played a clip of Mr Trump being asked about how he was \"holding up\" by a reporter two days after Kirk's shooting, in which the president said he was doing \"very good\" before pivoting to the subject of construction being done nearby for the White House's new ballroom.  Kimmel then quipped: \"He's at the fourth stage of grief: construction. \"This is not how an adult grieves the murder of someone he calls a friend. This is how a four-year-old mourns a goldfish,\" he added. He highlighted supposed hypocrisy in how Republicans have responded to Kirk's death, suggesting Vice President JD Vance's unfounded claims that \"most of the lunatics in American politics today are proud members of the far left\" were \"complete bull****\". Mr Kimmel drew attention to Capitol rioters who, on 6 January 2021, \"wanted to hang\" Mr Trump's first term vice president, Mike Pence, for certifying Joe Biden's 2020 election win. He said: \"Was that the liberal left? Or the toothless army who stormed the Capitol on January 6?\" The MAGA movement, led by the president, has been critical of the left as a whole since Mr Kirk's shooting - even before suspect Tyler Robinson was arrested and charged. In his Oval Office address on the night of the shooting, Mr Trump said the \"radical left\" had \"compared wonderful Americans like Charlie to Nazis and the world's worst mass murderers and criminals\" for years, and that \"this kind of rhetoric is directly responsible\" for the shooting.  Show suspended after pressure mounted on Disney and ABC On Wednesday, an ABC spokesperson said Jimmy Kimmel Live would \"be pre-empted indefinitely\", without elaborating on the decision. It is not known when or if it will return. Before the announcement, the chairman of the Federal Communications Commission (FCC) Brendan Carr, an independent US government agency that regulates television and radio, threatened to \"take action\" against Disney and ABC. Mr Carr, a fervent Trump backer, warned the companies during an interview with conservative podcaster Benny Johnson on Wednesday: \"We can do this the easy way or the hard way.\" Further pressure came from network operator NexStar, which operates more than 20 ABC affiliates, after it announced it would be pulling Mr Kimmel's show from its channels over the comments, which it called \"offensive and insensitive\". Both Disney and NexStar have FCC business ahead of them. Disney is seeking regulatory approval for ESPN's acquisition of the NFL Network and NexStar needs the Trump administration's go-ahead to complete its $6.2billion purchase of broadcast rival Tegna. Fellow ABC affiliate Sinclair, which owns a swathe of local media in the United States, also said it would stop airing Mr Kimmel's show before ABC suspended it. What has been the reaction to Kimmel's 'cancellation'? The president - who is in the UK for his state visit - celebrated the move on Truth Social, writing: \"The ratings challenged Jimmy Kimmel Show is CANCELLED. Congratulations to ABC for finally having the courage to do what had to be done.\" His sentiments have been echoed widely on the right, while Democrats have shared their outrage at Mr Kimmel's suspension. California Governor Gavin Newsom said the Republicans did \"not believe in free speech\" and that they were \"censoring you in real time,\" while Senate minority leader Chuck Schumer called for people \"across the political spectrum… to stop what's happening to Jimmy Kimmel\". Celebrities who have guested on the show joined Democrats in speaking out. Wanda Sykes accused Mr Trump of seeking to end freedom of speech, while Ben Stiller tweeted: \"This isn't right.\" Actress Jean Smart shared a picture of her with Kimmel on Instagram and said she was \"horrified\" by the show's cancellation, and comedian Michael Kosta, a rotating host on Comedy Central's The Daily Show, urged TV networks to \"push back\". Read more:Body found in Tesla registered to singer named as missing 15-year-old girlRobert Redford's grandchildren pay tribute as they share family photos Similarly, unions representing writers and actors branded the move as an attack on free speech, and accused ABC of caving to pressure from the White House. The Writers Guild of America West and Writers Guild of America East said in a joint statement: \"Shame on those in government who forget this founding truth. As for our employers, our words have made you rich. Silencing us impoverishes the whole world.\" Kimmel has not commented. The group Refuse Fascism organised a protest outside the El Capitan Entertainment Centre in Hollywood for Thursday, where the show is usually filmed. 'A really dangerous moment for democracy' Fiona O'Brien, UK director of Reporters Without Borders, told Sky News that the show's suspension represented a \"really dangerous moment for democracy\".  \"The media is not there to serve politicians,\" she said. \"The media is there to hold those in power to account, to scrutinise them. The general public, which is who the media serve, have a right to know what those in power are doing.\" She suggested that the tactics the Trump administration is accused of using to \"block\" freedom of speech, such as threatening to sue media corporations, are used by authoritarian governments around the world. \"It's a way to try and control the narrative... silence your critics and have have only one side of the story told,\" she added. \"So any of these kinds of attacks represent a move away from objectivity.\" Writing on social media, former president Barack Obama, once a guest on Kimmel's show said: \"After years of complaining about cancel culture, the current administration has taken it to a new and dangerous level by routinely threatening regulatory action against media companies unless they muzzle or fire reporters and commentators it doesn't like.\" Trump targets two remaining late show hosts The president has taken issue with Kimmel - and other late-night hosts - throughout the years, as they often use their shows' monologues to criticise Mr Trump and other Republicans. Jimmy Kimmel Live's demise comes just weeks after Stephen Colbert's The Late Show was cancelled by CBS. After 10 years with Mr Colbert at the helm, the show is set to end when its current season ends next May. While CBS said the move was \"purely a financial decision\" and \"not related in any way to the show's performance, content or other matters happening at Paramount,\" his fans have speculated it was a result of Mr Trump, who he regularly criticises. The president praised the move at the time, saying \"his talent was even worse than his ratings\". Now Mr Trump is pushing for the axing of the two remaining late night shows belonging to Jimmy Fallon and Seth Myers, who also regularly make him and his aides the butt of their jokes. \"Kimmel has ZERO talent, and worse ratings than even Colbert, if that's possible,\" the president said on Truth Social after Mr Kimmel's show was cancelled. \"That leaves Jimmy and Seth, two total losers, on Fake News NBC. Their ratings are also horrible. Do it NBC!!! President DJT.\""
    },
    {
        "title": "Body found in Tesla registered to singer d4vd named as missing 15-year-old girl",
        "description": "A decomposed body found in a car registered to singer d4vd has been identified as a missing 15-year-old girl.",
        "url": "https://news.sky.com/story/body-found-in-tesla-registered-to-singer-d4vd-named-as-missing-15-year-old-girl-13433225",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-d4vd-2024_7023745.jpg?20250918102026",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-18 09:01:00",
        "Headline": "Celeste Rivas had been reported missing from Lake Elsinore in California before she was found in the Tesla.",
        "Content": "A decomposed body found in a car registered to singer d4vd has been identified as a missing 15-year-old girl. Celeste Rivas, reported missing from Lake Elsinore in California, was identified after forensic examinations on the remains discovered in the Tesla on 8 September. Police were called to Hollywood Tow, a towing and impounding firm in Los Angeles, because of a foul smell coming from the vehicle. The car had been impounded after it was reported abandoned. The girl's remains were not found intact and it appeared she had been dead in the car for an extended period of time, according to Sky News' US partner network NBC News. The Los Angeles County Medical Examiner's Office has not yet determined a cause of death. The Los Angeles Police Department said: \"At this time, the LAPD does not have a crime classification from the coroner as to the mode or manner of death. \n                  Trump suffers setback in bid to act as national police chief after chaos on streets of LA\n                 \n                  California: 21 children taken into custody - amid claims couple misled surrogate mothers across the US\n                 \n                  Did Melania convince Trump to back Ukraine?\n                 \"Thus, we do not have any suspect information at this time.\" A spokesperson for the 20-year-old singer, real name David Anthony Burke, said he had been informed about the discovery and was \"fully cooperating with the authorities\". The artist, who is currently on tour, was scheduled to perform in Seattle on Wednesday, but the show has since been cancelled."
    },
    {
        "title": "Trump has a creeping control over what gets said on the airwaves and it screams censorship",
        "description": "As a genre, think democracy noir.&#160;",
        "url": "https://news.sky.com/story/jimmy-kimmel-decision-shows-the-audience-of-one-trumps-free-speech-in-donalds-america-13433520",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-jimmy-kimmel_7024442.jpg?20250918175557",
        "type": "Entertainment",
        "Author": "James Matthews",
        "Date Published": "2025-09-18 16:11:00",
        "Headline": "After criticising the MAGA movement's reaction to the killing of Charlie Kirk, the chat show host found out the hard way, like Stephen Colbert, that entertainment executives worried about their bottom lines are prepared to axe shows to please the president.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n As a genre, think democracy noir.  This Jimmy Kimmel sketch has few laughs in it - the one about the TV host taken off-air after talking politics is the one we've heard before. Kimmel follows Stephen Colbert out of the stage door and the fate of two TV icons has catapulted the issue of free speech into America's front rooms. Trump latest - president flies out Both are leaving the stage after comments critical of Donald Trump, his administration and its politics. Sure, they are casualties of business decisions based on self-interest and that's always been the case - making money has always been at the heart of popular entertainment. But business has changed. Like never before, pleasing an audience means pleasing an audience of one. \n                  Kimmel 'fired for lack of talent', Trump says, as Obama decries 'government coercion'\n                 \n                  What we can learn about Charlie Kirk suspect Tyler Robinson from his charging document\n                 \n                  FBI director Kash Patel shouts at Democrat senators over Charlie Kirk and Jeffrey Epstein during oversight hearing\n                 Follow the trail behind the Colbert and Kimmel announcements and you'll find the power and influence of Donald Trump over the TV boardroom. He has a creeping control over what gets said on the airwaves and it screams censorship.  Read more on Jimmy Kimmel:Chat show suspended after Kirk commentsWhat did Jimmy Kimmel say? On social media, the president celebrated the Jimmy Kimmel announcement as \"great news for America\" and, in the same post, called for \"Jimmy and Seth\" (Fallon and Myers - also late-night fixtures) to be given the push. Who would bet against it? The notion of a US president having a direct input into who and what Americans watch on TV and consume via the wider media would have seemed bizarre until recently. Not now - now that it has the appearance of a slow-rolling operation to seize popular culture. Trump is currently suing the Wall Street Journal and the New York Times and he pocketed millions in settlements after suing the owners of ABC News and CBS News. On leaving for London this week, he told an Australian journalist he'd tell that country's prime minister about him after he asked a question regarding business deals whilst in office. He is the president who craves control and his critics say the threat extends beyond popular culture to the First Amendment, the right to free speech without interference from the government. Those same critics point to Trump's \"radical left\" rhetoric in the wake of the killing of conservative influencer Charlie Kirk last week and see an effort to channel the reaction towards a clampdown on political opponents. The US president and his allies have floated the suggestion of classifying some groups as domestic terrorists, loosely defined, and revoking tax-exempt status for non-profit organisations of a different political persuasion. Vice-president JD Vance has led an online campaign to have people \"celebrating Charlie's murder\" exposed and sacked from their jobs (people have been). Read more:Trump visit - day two in picturesEight things you might have missed'Putin has let me down' - Trump It is America's civil liberties show and Jimmy Kimmel is headlining the current run. He's the comedian playing it straight, as there are few laughs in this one. Think dark humour - more dark than humour."
    },
    {
        "title": "Actress Anna Friel tells court stalker left her feeling 'threatened and shocked'",
        "description": "Actress Anna Friel has told a court how a man who stalked her for nearly three years left her feeling \"threatened and shocked\".",
        "url": "https://news.sky.com/story/actress-anna-friel-tells-court-stalker-left-her-feeling-threatened-and-shocked-13433489",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-anna-friel-stalker_7024345.jpg?20250918163804",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-18 15:32:00",
        "Headline": "Phil Appleton, 71, was handed a restraining order of 15 years and a community order of 24 months on Thursday after he pleaded guilty to stalking Ms Friel.",
        "Content": "Actress Anna Friel has told a court how a man who stalked her for nearly three years left her feeling \"threatened and shocked\". Phil Appleton, 71, was handed a restraining order of 15 years and a community order of 24 months on Thursday after he pleaded guilty to stalking Ms Friel. Appleton sent the actress multiple messages and visited her home address several times, blowing kisses and mouthing \"I love you\" at the house's CCTV cameras as well as leaving \"unwanted\" gifts like empty cigarette packets, between 1 January 2022 and 11 December 2024, Reading Crown Court heard. Ms Friel, who did not attend the hearing, said in a victim statement read out in court: \"As a woman in the acting industry where there have been a lot of cases of stalking, it still shocked me when it happened to me. \"This case had made me feel very threatened and as though I have to look over my shoulder all the time.\" Appleton initially met the 49-year-old actress, who first found fame in the soap opera Brookside and is best known for roles in comedy series Pushing Daisies and the mystery drama Marcella, while she was on a walk with her daughter in Windsor, Berkshire, where he also lived at the time. Ms Friel believed she must have worked with Appleton due to the familiar way he spoke to her and gave him her email address, prosecutor Jay Patel said. Appleton started sending her regular messages in April 2022. \n                  Trump tells PM how to stop small boats and makes Putin admission - but saves harshest words for Sadiq Khan\n                 \n                  After PM's hardest two weeks yet, this isn't what I expected to write about him and Trump\n                 \n                  Trade unions gear up to nominate candidate in contest for Labour deputy\n                 \"In those emails, he said that he loved Ms Friel and missed her, he invited her to lunch and dinner at his home, he was telling his friends that he was going to marry Ms Friel,\" Mr Patel said. \"She decided not to respond in the hope that he would stop.\" But the messages did not stop, and Appleton's obsession with Ms Friel appeared to escalate, with the 71-year-old telling the actress that he wanted to marry her and sending her details of a wedding he was apparently planning, the court heard. He first went to her home address towards the end of 2023 while he was dressed in a dinner jacket to invite Ms Friel to come to a ball with him. In December 2024, Appleton went to Ms Friel's home again and was caught looking through her lounge window, Mr Patel said. The prosecutor added that Appleton handed Ms Friel's daughter an empty pack of cigarettes to give to her mother. CCTV footage revealed Appleton had been standing outside Ms Friel's home for several minutes before he was spotted, making \"facial expressions as though he was communicating with someone\" at the camera, mouthing the words \"I love you\" and holding up a ring, according to Mr Patel. On 10 December 2024, Appleton returned to Ms Friel's home and once again left an empty packet of cigarettes and a wooden ring, as well as mouthing something and blowing kisses at the CCTV camera. He was arrested the next day and later admitted to a mental health hospital, from where he was discharged in February 2025. He was remanded in custody for six months until he was granted conditional bail in August, when he pleaded guilty to a stalking offence. Read more from Sky News:Jimmy Kimmel 'fired' over Charlie Kirk commentsMissing teen's body found in car registered to singer Appleton felt \"unreserved apology and shame about his behaviour\", his defence lawyer told the court, adding that the defendant \"wishes nothing more than to return to the law-abiding life he has lived all these years\". As part of the restraining order, Appleton must not approach, follow, or contact Ms Friel or her daughter, directly or indirectly, and must stay away from the area surrounding Ms Friel's home in Windsor. Judge Alan Blake said Appleton's compliance with the community order requirements will also be monitored electronically for the next 12 months."
    }
]