[
    {
        "title": "Donald Trump sanctions International Criminal Court as he accuses it of 'abusing its power'",
        "description": "Donald Trump has sanctioned the International Criminal Court (ICC), accusing it of \"illegitimate and baseless actions targeting America and our close ally Israel\".",
        "url": "https://news.sky.com/story/judge-halts-donald-trumps-plan-to-get-rid-of-federal-employees-with-payout-13304316",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-us_6821783.jpg?20250206220923",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 19:34:00",
        "Headline": "In his first days and weeks in office, Donald Trump has signed a flurry of executive orders but some of the most high-profile ones have been blocked by judges over concerns about their legality.",
        "Content": "Donald Trump has sanctioned the International Criminal Court (ICC), accusing it of \"illegitimate and baseless actions targeting America and our close ally Israel\". In his latest round of executive orders, the US president has taken aim at the ICC and rallied against what he called anti-Christian bias in the US. It comes as a US federal judge temporarily blocked Mr Trump's plan to reduce the number of government employees. Follow live: Donald Trump latest The ICC order includes financial and travel sanctions against the organisation and its officials, and family members, who are found to have assisted in investigations into US citizens and allies, Sky News' US partner NBC News reported. The move coincides with a visit to Washington by Israeli Prime Minister Benjamin Netanyahu who, along with his former defence minister Yoav Gallant, is wanted by the ICC over the war in Gaza. The executive order says that by issuing those warrants, the ICC \"further abused its power\". \n                  Why are South African HIV clinics closing because of Trump? \n                 \n                  Israel leans hard into Trump plan for Gaza - but has anyone asked its people?\n                 \n                  UK government says it would 'oppose' Trump Gaza proposal\n                 It was unclear how quickly the US would announce the names of those sanctioned. In Mr Trump's first term, he imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the ICC's investigation into alleged war crimes by American troops in Afghanistan. 'Anti-Christian bias' A second executive order signed on Thursday night by Mr Trump targeted \"eradicating anti-Christian bias\" in the US federal government. The order will aim to \"work tirelessly to uphold\" religious freedom and attorney general Pam Bondi will lead a specific task force to achieve its aims. \"The mission of this task force will be to immediately halt all forms of anti-Christian targeting and discrimination withinthe federal government, including at the DOJ, which was absolutely terrible, the IRS, the FBI and other agencies,\" Mr Trump said.  'Fork in the road' Meanwhile, a judge ruled just hours before the midnight deadline for workers to apply for the \"fork in the road\" deferred resignation programme - which has been orchestrated by close Trump ally Elon Musk - that it should be temporarily halted. US district judge George O'Toole Jr, in Boston, did not express an opinion on the legality of the programme but scheduled a hearing for Monday. He also directed administration officials to extend the deadline for the programme until after the hearing. Mr O'Toole could opt to delay the scheme further or block it on a more permanent basis when he considers the legal challenge from unions on Monday. 👉 Listen to Sky News Daily on your podcast app 👈 The offer promises to pay employees their salaries until 30 September - but current spending laws expire on 14 March and it isn't clear whether salaries will be funded beyond this point. The worker buyout scheme is part of a broader move from Mr Trump's administration to shrink and reshape the federal government. An important aspect of that has been Mr Musk's Department of Government Efficiency. White House reaction to judge's ruling Responding to the development, press secretary Karoline Leavitt told NBC News: \"We are grateful to the judge for extending the deadline so more federal workers who refuse to show up to the office can take the administration up on this very generous, once-in-a-lifetime offer.\" She also said that more than 40,000 people had accepted the buyout so far - this figure corresponds to around 2% of the federal government's 2.3 million civilian workforce. NBC News reported this figure to be higher, at 60,000, citing a senior administration official. Around 6% of federal workers retire or resign in a normal year, according to the Partnership for Public Service. 'Offer not trustworthy' Labour unions and opposing Democrats have said the offer is not trustworthy. The buyout covers not just employees at domestic agencies, like the Environmental Protection Agency, but intelligence agencies like the CIA as well. Read more:Guantanamo Bay readied in response to Trump plansTrump's trans athletes rhetoric resonated with votersWhat's going on with Trump and tariffs? The administration also warned those who do not accept the buyout could still lose their jobs. This is the latest of Mr Trump's efforts to be blocked by a judge over concerns of legality. Mr Trump's plan to block birthright US citizenship has been blocked by a second federal judge in two days."
    },
    {
        "title": "Starmer has a battle on his hands - but when it's green v growth, there's only one winner",
        "description": "Keir Starmer was touring the UK National Nuclear Laboratory in Preston when the Bank of England halved its 2025 growth forecast, cut interest rates for the third time in six months, warned of an uptick in inflation and said the national insurance hike on employers would hit prices and jobs more than expected.&#160;",
        "url": "https://news.sky.com/story/starmer-has-a-battle-on-his-hands-but-when-its-green-v-growth-theres-only-one-winner-13304301",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-beth-nuclear_6821616.jpg?20250206192721",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-06 19:02:00",
        "Headline": "After backing a Heathrow runway, a North Sea drilling licence could push Labour supporters into the arms of other progressive parties, prompt cabinet splits and public rows. But if this government doesn't get economic growth, the Starmer project collapses.",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer was touring the UK National Nuclear Laboratory in Preston when the Bank of England halved its 2025 growth forecast, cut interest rates for the third time in six months, warned of an uptick in inflation and said the national insurance hike on employers would hit prices and jobs more than expected.  It was a blow to a prime minister and chancellor who have placed all their chips on growth, made all the more painful because of those budget decisions that - in the short term at least - have made matters worse. Rachel Reeves said soon after: \"I am still not satisfied with the growth rate.\" Keir Starmer, in Preston to talk up nuclear power generation, said \"there's more to do\" as he extolled the virtues of small modular reactors - faster to build than existing larger power stations - as a way of speeding up the delivery of new nuclear power stations in England and Wales. The government hopes the first one will be up and running by 2032. He wants to do it by shaking up the planning system to \"clear the path\" for smaller reactors (there are currently just eight favoured sites for nuclear power plants in the UK). This was a prime minister determined to channel his inner Donald Trump and - hat tip to Chris Mason at the BBC - \"build baby build\". \n                  Starmer contradicts Trump on president's calls for Middle East 'Riviera' in Gaza\n                 \n                  How does Starmer keep Trump's US and the EU sweet? \n                 \n                  Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending\n                 This is a PM determined to take on the \"blockers\" and get Britain building again. But what is fast emerging, as growth flatlines, is that he and Rachel Reeves - who once said she'd be the UK's \"first green chancellor\" - will also take on the blockers in the cabinet and party if that is what it takes to get growth.  When it comes to green versus growth, the latter is going to win. This is a prime minister who, for my money, is also prepared to \"drill baby drill\" in that hunt for growth. Having signalled last month that the government is going to press ahead with a third runway at Heathrow in the face of fierce opposition from environmentalists, the prime minister all but confirmed to me on Thursday that he's also minded to back the approval of a giant new oilfield in the North Sea. At stake is a licence for the Rosebank development - approved by the last government, but now blocked by the courts on environmental concerns over huge carbon emissions. Read more:Cut taxes to get people buying electric cars - motor industryDetails on plan for Great British Energy When I asked the prime minister if he was minded to grant new permissions, he all but said yes: \"The mindset is we know that oil and gas is going to be a big part of the future for many decades to come. \"We do need to transition to clean power, but in relation to this particular licence, it was granted in the first place, it is going back through a process. \"I can't pre-empt the decision but, you know, we did say that where licences have already been granted, we wouldn't interfere with them. \"But I'll be open with you, oil and gas is part of the future mix for decades to come.\"  The reality is that as growth comes hard to find, the prime minister and his chancellor are going to have to face down the environmentalists in the cabinet and the party. Nuclear might be an example where green and growth can go hand in hand, but the third runway at Heathrow or the approval of controversial licences for two major oil and gas sites in the North Sea are not. This could get difficult. The PM is intensely relaxed about taking on environmental \"zealots\" outside his party, but what about the fight within? Just a couple of days ago on the Labour List website for activists and members, there was an article that said the PM must reject a proposal to develop this giant oil field or \"risk imploding the party\". Ed Miliband, the climate secretary, described Rosebank as \"climate vandalism\" when it was issued a licence by the last government. Meanwhile, the Labour manifesto committed to no further oil and gas licences, so some will see allowing this development as a betrayal. Note, in the response to my question, the PM was at pains to stress this was not a new licence and the government had said it \"wouldn't interfere\" with licences already granted. It is going to be hugely controversial. It could push Labour supporters into the arms of other progressive parties, prompt cabinet splits and public rows. But if this government doesn't get economic growth, the Starmer project collapses. When it comes to decisions that pit growth versus green, it seems that Starmer has decided he doesn't have much choice."
    },
    {
        "title": "Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision",
        "description": "A survivor of the Grenfell Tower fire has called on Angela Rayner to reconsider her decision to demolish the west London tower block.",
        "url": "https://news.sky.com/story/grenfell-tower-fire-survivor-calls-on-rayner-to-reconsider-demolition-decision-13304413",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-grenfell-tower-london_6821055.jpg?20250206104119",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 22:08:00",
        "Headline": "A survivor of the 2017 fire has said he was \"shocked and appalled\" by Angela Rayner's decision to demolish the tower, and claimed that most of the victims' families and survivors were not consulted about the decision.",
        "Content": "A survivor of the Grenfell Tower fire has called on Angela Rayner to reconsider her decision to demolish the west London tower block. Bereaved family members and survivors of the 2017 blaze, which killed 72 people, have been critical of the deputy prime minister's decision, which she delivered to them in a meeting on Wednesday night. Speaking on The UK Tonight with Sarah-Jane Mee, Marcio Gomes, who escaped from his 21st-floor flat with his then wife and two daughters, called on Ms Rayner, who is also housing secretary, to \"reconsider her decision\". \"There was not one person in the room who agreed with her decision,\" he said. \"She didn't really explain the decision, we just got told what was going to happen.\" He said Ms Rayner \"wouldn't really give any answers\" to any questions asked by the bereaved families and survivors. \"I was shocked and quite frankly appalled by it. If you looked around the room, and it was packed, everybody was appalled by the decision - there was a lot of heartbreak, a lot of anger, a lot of tears. \n                  'Disgraceful and unforgiveable': Decision to demolish Grenfell Tower attacked\n                 \n                  Victims' families criticise 'deeply sensitive decision' to demolish Grenfell Tower\n                 \n                  Grenfell fire families sent letter about unidentified remains\n                 \"The consultation was, in my view, minimal. I can say, in the meeting, I think 90% were not consulted with, including myself. \"Nobody knew what was happening,\" he said. Read more:Grenfell fire families sent letter about unidentified remainsMinister loses brief after complaint by Grenfell survivors Other relatives of the victims have also hit out at Ms Rayner's actions. Karim Mussilhy, whose uncle died in the fire, said the decision was \"unforgivable\" and \"disgraceful\". \"This conversation is so sensitive, so sacred. This is the last resting place of our families whose deaths were clearly avoidable and we haven't been involved in these conversations.\" 'Very saddening and hurtful' Meanwhile, Nabil Choucair - who lost six relatives in the North Kensington tower - said it was \"very saddening and hurtful\" and called for a \"fitting memorial to be designed in its place or within in\". \"It's about our 72 loved ones, it's all about them.\" Mr Gomes said he would like any future memorial to maintain the height of the tower though admitted that \"everybody is going to have a slightly different view\" of the future plans for the site. But one thing is certain for Mr Gomes: \"Grenfell should have been the catalyst for change.\" \"And nearly eight years on, not a lot has changed. \"We're still going through the process, we still haven't had justice. The victims aren't being put at the centre of the decisions that are being made. \"It's almost like they want to knock it down, out of sight, out of mind,\" he added. \"This can still happen again. There's so many buildings up and down the country with this type of cladding.\" Grenfell United, which represents some bereaved and survivors, said: \"Angela Rayner could not give a reason for her decision to demolish the tower. She refused to confirm how many bereaved and survivors had been spoken to in the recent, short four-week consultation. \"But judging from the room alone - the vast majority of whom were bereaved - no-one supported her decision. But she claims her decision is based on our views.\" In September last year, the public inquiry into Grenfell found \"systematic dishonesty\" contributed to the fire. Inquiry chairman Sir Martin Moore-Bick said the \"simple truth\" was all the deaths were avoidable and that those who lived in the tower were \"badly failed\" by authorities \"in most cases through incompetence but, in some cases, through dishonesty and greed\". The Metropolitan Police said last year that decisions on criminal charges for the blaze are not expected until the end of 2026. Sky News has contacted the Department of Housing, Communities and Local Government for a response."
    },
    {
        "title": "TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour",
        "description": "TV chef Gino D'Acampo has denied dozens of allegations of inappropriate and intimidating behaviour on the sets of TV shows he has appeared on.",
        "url": "https://news.sky.com/story/tv-chef-gino-dacampo-denies-dozens-of-allegations-of-inappropriate-behaviour-13304383",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gino-dacampo_6821740.jpg?20250206213512",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 21:30:00",
        "Headline": "D'Acampo has said he would never do anything to \"distress anyone\" after multiple women accused him of aggressive behaviour and making highly sexualised remarks.",
        "Content": "TV chef Gino D'Acampo has denied dozens of allegations of inappropriate and intimidating behaviour on the sets of TV shows he has appeared on. D'Acampo actions were described as being \"unacceptable\", \"distressing\" and \"horrendous\", according to an ITV News investigation. Anonymous women who spoke to the news broadcaster also accused D'Acampo of aggressive behaviour and making highly sexualised remarks. In a statement to ITV News, D'Acampo has said he \"firmly\" denies the allegations and \"would not do anything that I thought would upset or distress anyone\". He adds: \"I am a father, husband... the suggestion that I have acted in an improper way against is deeply upsetting.\" Sky News has contacted D'Acampo for comment. ITV also reported that bosses at Objective Media Group, the production company behind Gordon, Gino And Fred's Roadtrip in 2018, appear to have been aware of concerns about D'Acampo's behaviour. \n                  Irv Gotti, the founder of Murder Inc Records behind hits with Ashanti and Ja Rule, dies aged 54\n                 \n                  Liam Payne's girlfriend Kate Cassidy says death 'still doesn't feel real' - and reveals why she left him in Argentina\n                 \n                  Steve Coogan avoids driving ban after plea to save new TV show The Trip with Rob Brydon\n                 Objective Media Group said: \"We have robust protocols and procedures in place for all cast and crew, including on-screen talent, that we review regularly whilst also ensuring that we take into account developments regarding industry wide 'Duty of Care' guidelines.\" The production company continued: \"Across all productions we encourage people to raise any concerns at the earliest opportunity... If there are incidents or complaints reported, we implement our Escalation Procedure and ensure that a full and thorough process is followed in close collaboration with the broadcaster.\" Read more from Sky News:Blake Lively and Justin Baldoni's legal battle explainedSteve Coogan avoids driving ban Other production companies that have worked with D'Acampo have also issued statements following the allegations. Studio Ramsay said: \"Whilst we do not disclose or discuss personnel matters publicly, Studio Ramsay is committed, in conjunction with our broadcast partners, to a safe and professional work environment. We take all allegations of inappropriate behaviour and workplace misconduct seriously, promptly investigate, and take appropriate remedial action when warranted.\" MultiStory Media said: \"It would be inappropriate to go into the detail of individual concerns but we give our assurance that we are reviewing the concerns which have been raised, what was known at the time and what action was taken. We will also look at any new concerns that have come to light.\""
    },
    {
        "title": "UK weather: Cold snap on the way as temperatures set to plummet to -7C and health alerts issued",
        "description": "The UK is set to see temperatures plunge as low as -7C (19.4F) as cold health alerts have been issued.",
        "url": "https://news.sky.com/story/uk-weather-cold-snap-on-the-way-as-temperatures-set-to-plummet-to-7c-and-health-alerts-issued-13304289",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-weather-uk-weather_6821577.jpg?20250206184320",
        "type": "Home",
        "Author": "Jo Robinson",
        "Date Published": "2025-02-06 18:31:00",
        "Headline": "While a cold spell is on the way, temperatures are not expected to fall as low as last month,  where -18.9C was recorded in Scotland.",
        "Content": "\n          Weather producer\n              @SkyJoRobinson\n The UK is set to see temperatures plunge as low as -7C (19.4F) as cold health alerts have been issued. From Friday, the country is heading into a colder and drier spell of weather. High pressure over Scandinavia will strengthen and lead to a blocked weather pattern with an easterly flow developing across the UK. A blocked weather pattern is where a weather system remains almost stationary for a relatively prolonged period of time. Get the weather forecast where you are In winter, when air comes from the east, it typically brings colder and drier conditions, with the risk of some snow. The term Beast from the East is used when we get exceptionally cold and snowy weather from an easterly direction, like in 2018, but that is unlikely in this set-up. \n                  Storm Herminia: Fresh weather warnings for wind and rain issued after weekend of battering from Storm Eowyn\n                 \n                  UK weather: Storm Herminia brings heavy rain and 80mph winds after 'strongest' storm in decade\n                 \n                  'Sting jet' over Ireland behind Storm Eowyn's record-breaking 114mph wind\n                 Firstly, the air over the Baltic States and Russia is not as cold as it would typically be at this time of the year. Temperatures there are about 5C-10C above average. Secondly, the airmass dips south before heading to the UK so there is not a direct easterly flow. 'Notable wind chill for many' So extreme cold is currently unlikely, but daytime temperatures will fall to below average this weekend, lasting through much of next week. There will also be a notable wind chill in the south and east at times, making it feel freezing. By night, temperatures will be more typical for February, with a frost forming where skies remain clear. Northwest Scotland will probably see the lowest overnight temperatures, as low as -7C in rural parts, but it doesn't look as cold as last month. Cold weather alerts issued In Altnaharra, northern Scotland, -18.9C (-2F) was recorded on 11 January, the coldest January night in 15 years. The UK Health Security Agency has also issued a number of yellow cold health alerts covering areas across England including the North East, North West, Yorkshire and the Humber, and the South East from 9am on Friday until 9am on Tuesday. Read more from Sky News:NHS warns hospitals are 'close to full'British woman, 24, dies in Sri Lanka'Visionary' music producer dies aged 54 Snow is forecast for some With the arrival of colder air, some will get excited about the chance of snow. At the moment, no significant snow is expected, but parts of the South and East may well see a covering of snow at times, especially on Saturday and Monday. How long the cold, easterly flow will last is uncertain, but any breakdown to milder, wetter weather would bring a greater chance of heavy snow. Usually, the UK's most significant snow events happen when warm, moist air moves in and meets cold air sitting across the country."
    },
    {
        "title": "Public asked to name next Archbishop of Canterbury after Justin Welby resignation",
        "description": "The public is being given the chance to suggest who should be the next Archbishop of Canterbury, replacing Justin Welby, who resigned after a report found the Church of England covered up sexual abuse by a barrister.",
        "url": "https://news.sky.com/story/public-asked-to-name-next-archbishop-of-canterbury-after-justin-welby-resignation-13304447",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-justin-welby-archbishop-of-canterbury_6821876.jpg?20250207005302",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 23:14:00",
        "Headline": "The Church of England has described the public consultation as \"an opportunity to gather the views of a wide range of people... on the gifts, qualities and skills needed\".",
        "Content": "The public is being given the chance to suggest who should be the next Archbishop of Canterbury, replacing Justin Welby, who resigned after a report found the Church of England covered up sexual abuse by a barrister. He stood down following the publication of the Makin Review which found John Smyth QC attacked as many as 130 boys and young men, including at Christian summer camps. The independent investigation, published in November, concluded he might have been brought to justice had Mr Welby formally reported it to police a decade ago. Smyth died aged 75 in Cape Town in 2018 while still under investigation by Hampshire Police. Stephen Cottrell, the Archbishop of York, has temporarily taken over from the Archbishop of Canterbury, who stepped down in January. People will be able to submit names via the Church of England website to the Crown Nominations Commission (CNC) - the body charged with nominating the new archbishop. Candidates must be aged at least 30 and generally younger than 70 and historically they have been people already holding senior leadership roles in ministry in the Church or elsewhere in the Anglican Communion. \n                  Bishop of Newcastle hits out at Archbishop of York's 'empty words' over sex scandals\n                 \n                  Archbishop of Canterbury Justin Welby 'sorry' for hurt caused by his final speech in the Lords\n                 \n                  Archbishop of Canterbury Justin Welby says a 'head had to roll' after Church of England sexual abuse scandal\n                 Numerous scandals have emerged within recent months within the Church around separate safeguarding failings. In December, Mr Cottrell apologised over his leadership regarding a sex abuse case when he was Bishop of Chelmsford and in January the Bishop of Liverpool announced his retirement amid misconduct allegations. The Church has described the public consultation as \"an opportunity to gather the views of a wide range of people... on the gifts, qualities and skills needed\" for the role of Archbishop of Canterbury. But while the CNC will use the public vote \"to inform the commission\", the Church says the panel - which effectively has the final say - will invite people to apply for the role. Read more from Sky News:Gino D'Acampo denies \"horrendous\" behaviourTrump takes action against international courtTwo men admit starting blaze during riots The consultation will run until 28 March but it is not thought potential candidates will be officially made public during the selection process. While the public can put forward names, it is the Crown Nominations Commission (CNC) which recommends the final candidate. The CNC consists of: • The chair (a layperson) - to be appointed by the prime minister • A bishop - to be elected by the House of Bishops • The Archbishop of York or, if he chooses not to be a member of the CNC, a further bishop to be elected by the House of Bishops • Three representatives elected from the Diocese of Canterbury by their Vacancy in See (Diocesan Synod) Committee • Six representatives (three clergy and three lay) elected by General Synod to serve as members of the Commission for a five year period • Five representatives from other churches in the Anglican Communion - one each from Africa; the Americas; Middle East and Asia; Oceania and Europe The full membership of the CNC is expected to be known next month with meetings planned for May, July and September to put together a longlist and shortlist. Usually, the CNC's suggested candidate is given to the prime minister who - by convention instead of law - advises the monarch to appoint them. An announcement on the new archbishop is expected by autumn."
    },
    {
        "title": "Orebro attack: Victim of Sweden shooting rang fiancee one last time to tell her he loved her",
        "description": "One of the victims of the attack on an adult education centre in Sweden rang his fiancee one last time after being shot to tell her he loved her.",
        "url": "https://news.sky.com/story/orebro-attack-victim-of-sweden-shooting-rang-fiancee-one-last-time-to-tell-her-he-loved-her-13304256",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sweden-orebro-shooting_6821516.jpg?20250206171412",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 17:06:00",
        "Headline": "Salim Iskef, 29, is thought to be one of the 10 people killed in Tuesday's massacre at an adult education centre. Swedish media has named the gunman as Rickard Andersson.",
        "Content": "One of the victims of the attack on an adult education centre in Sweden rang his fiancee one last time after being shot to tell her he loved her. Salim Iskef, 29, is thought to be one of the 10 people killed in Orebro on Tuesday. Local media has named Rickard Andersson as the perpetrator behind the attack, which the Swedish prime minister described as the worst mass shooting in the country's history. After being shot, Mr Iskef, a newly engaged nursing assistant, managed to call his fiancee one final time. \"He said he loved me so much\", Kareen Elia, his fiancee, told Sky News' Swedish partner TV4. \"You have no words. I can't describe the feelings. We were supposed to get married on July 25,\" she said. She added that, after he called her lying on the floor, she could not understand what she was seeing on FaceTime and was in shock. Then he said: \"Take care of my mother, yourself,\" Ms Elia told the Swedish outlet. She added: \"He said he had been shot. That they had shot us. I asked where. He hung up. I called again and again but he didn't answer.\" Ms Elia was critical of the police's handling of the situation, saying officers could have saved him if they had acted faster. She also said she was still waiting for confirmation of her fiancee's death. \"We haven't seen him yet,\" she added. 'We heard him walking around' It comes as one of the survivors told Sky News correspondent Ashna Hurynag how, as she hid fearing for her life, she heard the footsteps of Andersson close by. Meracil Kallkvist said: \"I was really shaking. It was scary. I was thinking, I was going to panic. \"I wanted to run to save my life because I was thinking I don't want to get... [hurt] here sitting down and hiding.\"  She recounted how she panicked as the first shots rang out, fearing something might have exploded, while some of the other students went to investigate the noises. Ms Kallkvist said: \"They wanted to know, then after like two seconds because [of the] other shots, one person ran back, someone was shooting, so I ran.\" While looking for somewhere to hide, she described how she met her teacher and, unable to lock the door of the room they were in, they pushed tables and chairs against it to try to block it. It was then they heard Andersson walking around. Read more from Sky News:Germany's race to be ready for warHottest January on record shocks scientistsBritish woman, 24, dies in Sri Lanka Ms Kallkvist added: \"After, we heard him walking around. Yes... it was really scary, if he'd just turned to the room where we were hiding... \"He [was] just walking around and talking and after we heard banging on the doors, I think it was the other room, then suddenly shots again.\" Police previously said they were yet to establish a motive and that the gunman was believed to have shot himself dead."
    },
    {
        "title": "King and Queen to meet Pope during state visit to Italy",
        "description": "The King and Queen are to pay state visits to Italy and the Vatican, Buckingham Palace has confirmed.",
        "url": "https://news.sky.com/story/king-and-queen-to-meet-pope-during-state-visit-to-italy-13304360",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-king-charles-christmas_6785004.jpg?20241225143648",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-02-06 21:00:00",
        "Headline": "Before the state visits to Italy and the Vatican, the King and Queen will join Hollywood star Stanley Tucci for a black tie dinner celebrating Italian cuisine at Highgrove.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The King and Queen are to pay state visits to Italy and the Vatican, Buckingham Palace has confirmed. The major spring tour will take place in early April and celebrate \"the strong bilateral relationship between Italy and the United Kingdom\". With royal overseas trips always carried out at the request of the Foreign Office, it can be seen as a part of a post-Brexit charm offensive, following trips by King Charles and Camilla to both Germany and France. They will meet Pope Francis at the Vatican and celebrate the Catholic Church's Pilgrims of Hope jubilee year. In Italy, the couple will visit Rome and the northeastern city of Ravenna, known for its early Christian mosaic artwork. At the end of last year it was confirmed that the King would have a busy diary of national and international engagements as he continues to have cancer treatment. His long-haul visit to Australia and Samoa last year was described as the \"perfect tonic\" for the monarch, and last week he travelled to Poland for the 80th anniversary of the liberation of Auschwitz. \n                  Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour\n                 The couple will attend the Holy See, the government of the Roman Catholic Church, which is located in the Vatican - the smallest independent state in the world, which is surrounded by Rome and is the residence of the spiritual leadership of the Roman Catholic Church. The King is Supreme Governor of the Church of England. Before the state visits, the King and Queen will join Hollywood star Stanley Tucci for a black tie dinner celebrating Italian cuisine at Highgrove on Friday evening. The pair have invited the Italian-American Devil Wears Prada actor and well-known foodie and the Italian ambassador to the UK, Inigo Lambertini, to Charles's Gloucestershire estate to enjoy a feast of sustainable Slow Food. The menu has been created by renowned Italian chef Francesco Mazzei and inspired by Tucci, who fronted the TV series Stanley Tucci: Searching for Italy. The Slow Food initiative was launched in 1986 in the small Italian town of Bra when food writer Carlo Petrini took exception to the opening of a McDonald's in Rome's Piazza di Spagna, leading to widespread national protests. Charles has long been a champion of the Slow Food philosophy."
    },
    {
        "title": "Two teenagers admit starting huge fire at former Crewe printworks during summer riots",
        "description": "Two teenagers have admitted starting a huge fire at a former printworks during last summer's riots - causing widespread disruption and displacing hundreds of people.",
        "url": "https://news.sky.com/story/two-teenagers-admit-starting-huge-fire-at-former-crewe-print-works-during-summer-riots-13304188",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-crewe-fire_6821489.jpg?20250206175600",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 14:27:00",
        "Headline": "More than 350 people had to be evacuated because their properties were at risk during the blaze in August - with some residents still unable to return home.",
        "Content": " Two teenagers have admitted starting a huge fire at a former printworks during last summer's riots - causing widespread disruption and displacing hundreds of people. James Evans, 19, and Justin Keeling, 18, entered the building in Crewe, Cheshire, on the afternoon of Friday 9 August and set a large pile of cardboard alight before the flames spread quickly and a major incident was declared. Keeling filmed some of the early stages of the fire on his mobile phone. Police have said the teenagers walked to Keeling's home after the blaze and were \"laughing and joking along the way\". The disused industrial premises is located on the junction of Catherine Street and Frances Street in Crewe town centre and is surrounded by a number of terraced houses. Five streets were evacuated, with firefighters from all over Cheshire called in to tackle the blaze. They remained at the scene for several days. Hundreds of residents evacuated \n                  Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour\n                 More than 350 people were evacuated because their homes were at risk, with some properties damaged by the fire. Displaced residents stayed in leisure centres or with friends and family as the fire raged. Cheshire Constabulary has said some families have still not be able to return home. 'Officers suffer health issues' The force added that some police officers who arrived at the scene were left with \"considerable health issues\" which \"caused them to have time off work\". When officers put cordons in place, Keeling was among the crowd of onlookers. He laughed at police, swore at them and shouted for people to riot. Keeling spoke to broadcaster Keeling also gave an interview to the BBC as news organisations reported on the fire and asked residents how they had been affected. In the article published three days after the blaze, Keeling said: \"I had to move out on Friday night along with other residents on Catherine Street because the flames were that big.\" He added: \"All the businesses stuck together and they helped deliver food to everyone which was great, it's great to see in a crisis everyone worked together.\" He also said he would have to get his house deep-cleaned to get rid of lingering smoke particles. While police were carrying out door-to-door enquiries they visited Keeling at his home. The teenager told officers he saw the fire when he was walking back to Catherine Street with Evans and a third man, Peter Lord, 20. He claimed to have seen some youths near the building, climbing over a gate onto Bedford Street. Read more:Decision to demolish Grenfell criticised'Jaw-dropping' EuroMillions jackpot claimed after 13 daysForeign Office expels Russian diplomat As a result, a 12-year-old boy was arrested. But he was later released without charge. Keeling later admitted to a friend that he was inside the building with two others and police were informed. He was arrested and then released on bail. Days later police discovered a video filmed by Keeling on his seized mobile phone. The footage showed a large amount of cardboard in flames before the camera panned round and showed another fire. Evans, Keeling and Lord were all arrested that day on suspicion of arson being reckless to endanger life. They each denied the offence despite the video. Evans, from Sandbach, and Keeling and Lord, both from Crewe, appeared at Chester Crown Court on 29 January for a trial. However, Evans and Keeling pleaded guilty to arson being reckless to endanger life on the first day. Lord was found not guilty on 3 February following a trial. Keeling also admitted to perverting the course of justice at an earlier hearing. Motive unknown Police have said Evans and Keeling's motive for starting the fire is still not known. They have been remanded in custody to be sentenced at Chester Crown Court on 14 April. The fire took place as far-right riots took place across the country for several days between the end of July and beginning of August. The violence initially broke out after three young girls were stabbed to death in Southport, Merseyside."
    },
    {
        "title": "Greece declares state of emergency on Santorini after earthquakes",
        "description": "Greece's authorities have declared a state of emergency on Santorini after a series of earthquakes shook the popular tourist destination.",
        "url": "https://news.sky.com/story/greece-declares-state-of-emergency-on-santorini-after-earthquakes-13304315",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-santorini-greece-earthquake_6821768.jpg?20250206235938",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-06 19:32:00",
        "Headline": "More than 10,000 residents and workers fled the popular tourist island this week after near-constant tremors, including a 5.2 magnitude earthquake on Wednesday night.",
        "Content": " Greece's authorities have declared a state of emergency on Santorini after a series of earthquakes shook the popular tourist destination. More than 10,000 residents and workers fled the island this week as near-constant tremors and undersea earthquakes have been recorded between Santorini and the islands of Amorgos, Anafi and Ios. A 5.2 magnitude quake struck on Wednesday night - the most powerful recorded since activity started on 31 January. Authorities warned of a high landslide risk, and have shut schools, dispatched rescuers, and advised residents to avoid ports and indoor gatherings. Some of the island's famous cliff-top towns have been cordoned off. Army, fire service and police units have also been deployed to the island. The state of emergency is set to be in place until 3 March to allow Greece's climate crisis and civil protection ministry to respond to the consequences of the seismic activity. \n                  Buildings in Vanuatu damaged and casualties reported as magnitude 7.3 earthquake hits South Pacific island nation\n                 \n                  Tsunami warning lifted after powerful earthquake off California coast\n                 \n                  7.0-magnitude earthquake triggers Russian volcano eruption and ash cloud warning for aircraft\n                 Greece is one of Europe's most earthquake-prone countries but seismologists have said the high level of activity is unprecedented and may last weeks or months. The experts say the tremors are unrelated to volcanic activity in the Aegean Sea, but are unable to say whether they could lead up to a more powerful earthquake. Read more: What is causing the 'unusual seismic activity'? \"We are not yet in a position to say that we are seeing any evidence that would lead to the sequence slowly coming to a conclusion,\" said Vassilis K Karastathis, a seismologist and director of research at National Observatory of Athens. \"We are still in the middle of the road, we haven't seen any easing, any sign that it's heading towards a regression.\" But the fact the tremors are underwater significantly reduces the potential for widespread damage compared to land-based seismic events. Santorini was formed in its current shape following one of the largest volcanic eruptions in history in around 1600 BC."
    },
    {
        "title": "Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision",
        "description": "A survivor of the Grenfell Tower fire has called on Angela Rayner to reconsider her decision to demolish the west London tower block.",
        "url": "https://news.sky.com/story/grenfell-tower-fire-survivor-calls-on-rayner-to-reconsider-demolition-decision-13304413",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-grenfell-tower-london_6821055.jpg?20250206104119",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-06 22:08:00",
        "Headline": "A survivor of the 2017 fire has said he was \"shocked and appalled\" by Angela Rayner's decision to demolish the tower, and claimed that most of the victims' families and survivors were not consulted about the decision.",
        "Content": "A survivor of the Grenfell Tower fire has called on Angela Rayner to reconsider her decision to demolish the west London tower block. Bereaved family members and survivors of the 2017 blaze, which killed 72 people, have been critical of the deputy prime minister's decision, which she delivered to them in a meeting on Wednesday night. Speaking on The UK Tonight with Sarah-Jane Mee, Marcio Gomes, who escaped from his 21st-floor flat with his then wife and two daughters, called on Ms Rayner, who is also housing secretary, to \"reconsider her decision\". \"There was not one person in the room who agreed with her decision,\" he said. \"She didn't really explain the decision, we just got told what was going to happen.\" He said Ms Rayner \"wouldn't really give any answers\" to any questions asked by the bereaved families and survivors. \"I was shocked and quite frankly appalled by it. If you looked around the room, and it was packed, everybody was appalled by the decision - there was a lot of heartbreak, a lot of anger, a lot of tears. \n                  'Disgraceful and unforgiveable': Decision to demolish Grenfell Tower attacked\n                 \n                  Victims' families criticise 'deeply sensitive decision' to demolish Grenfell Tower\n                 \n                  Grenfell fire families sent letter about unidentified remains\n                 \"The consultation was, in my view, minimal. I can say, in the meeting, I think 90% were not consulted with, including myself. \"Nobody knew what was happening,\" he said. Read more:Grenfell fire families sent letter about unidentified remainsMinister loses brief after complaint by Grenfell survivors Other relatives of the victims have also hit out at Ms Rayner's actions. Karim Mussilhy, whose uncle died in the fire, said the decision was \"unforgivable\" and \"disgraceful\". \"This conversation is so sensitive, so sacred. This is the last resting place of our families whose deaths were clearly avoidable and we haven't been involved in these conversations.\" 'Very saddening and hurtful' Meanwhile, Nabil Choucair - who lost six relatives in the North Kensington tower - said it was \"very saddening and hurtful\" and called for a \"fitting memorial to be designed in its place or within in\". \"It's about our 72 loved ones, it's all about them.\" Mr Gomes said he would like any future memorial to maintain the height of the tower though admitted that \"everybody is going to have a slightly different view\" of the future plans for the site. But one thing is certain for Mr Gomes: \"Grenfell should have been the catalyst for change.\" \"And nearly eight years on, not a lot has changed. \"We're still going through the process, we still haven't had justice. The victims aren't being put at the centre of the decisions that are being made. \"It's almost like they want to knock it down, out of sight, out of mind,\" he added. \"This can still happen again. There's so many buildings up and down the country with this type of cladding.\" Grenfell United, which represents some bereaved and survivors, said: \"Angela Rayner could not give a reason for her decision to demolish the tower. She refused to confirm how many bereaved and survivors had been spoken to in the recent, short four-week consultation. \"But judging from the room alone - the vast majority of whom were bereaved - no-one supported her decision. But she claims her decision is based on our views.\" In September last year, the public inquiry into Grenfell found \"systematic dishonesty\" contributed to the fire. Inquiry chairman Sir Martin Moore-Bick said the \"simple truth\" was all the deaths were avoidable and that those who lived in the tower were \"badly failed\" by authorities \"in most cases through incompetence but, in some cases, through dishonesty and greed\". The Metropolitan Police said last year that decisions on criminal charges for the blaze are not expected until the end of 2026. Sky News has contacted the Department of Housing, Communities and Local Government for a response."
    },
    {
        "title": "Starmer has a battle on his hands - but when it's green v growth, there's only one winner",
        "description": "Keir Starmer was touring the UK National Nuclear Laboratory in Preston when the Bank of England halved its 2025 growth forecast, cut interest rates for the third time in six months, warned of an uptick in inflation and said the national insurance hike on employers would hit prices and jobs more than expected.&#160;",
        "url": "https://news.sky.com/story/starmer-has-a-battle-on-his-hands-but-when-its-green-v-growth-theres-only-one-winner-13304301",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-beth-nuclear_6821616.jpg?20250206192721",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-06 19:02:00",
        "Headline": "After backing a Heathrow runway, a North Sea drilling licence could push Labour supporters into the arms of other progressive parties, prompt cabinet splits and public rows. But if this government doesn't get economic growth, the Starmer project collapses.",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer was touring the UK National Nuclear Laboratory in Preston when the Bank of England halved its 2025 growth forecast, cut interest rates for the third time in six months, warned of an uptick in inflation and said the national insurance hike on employers would hit prices and jobs more than expected.  It was a blow to a prime minister and chancellor who have placed all their chips on growth, made all the more painful because of those budget decisions that - in the short term at least - have made matters worse. Rachel Reeves said soon after: \"I am still not satisfied with the growth rate.\" Keir Starmer, in Preston to talk up nuclear power generation, said \"there's more to do\" as he extolled the virtues of small modular reactors - faster to build than existing larger power stations - as a way of speeding up the delivery of new nuclear power stations in England and Wales. The government hopes the first one will be up and running by 2032. He wants to do it by shaking up the planning system to \"clear the path\" for smaller reactors (there are currently just eight favoured sites for nuclear power plants in the UK). This was a prime minister determined to channel his inner Donald Trump and - hat tip to Chris Mason at the BBC - \"build baby build\". \n                  Starmer contradicts Trump on president's calls for Middle East 'Riviera' in Gaza\n                 \n                  How does Starmer keep Trump's US and the EU sweet? \n                 \n                  Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending\n                 This is a PM determined to take on the \"blockers\" and get Britain building again. But what is fast emerging, as growth flatlines, is that he and Rachel Reeves - who once said she'd be the UK's \"first green chancellor\" - will also take on the blockers in the cabinet and party if that is what it takes to get growth.  When it comes to green versus growth, the latter is going to win. This is a prime minister who, for my money, is also prepared to \"drill baby drill\" in that hunt for growth. Having signalled last month that the government is going to press ahead with a third runway at Heathrow in the face of fierce opposition from environmentalists, the prime minister all but confirmed to me on Thursday that he's also minded to back the approval of a giant new oilfield in the North Sea. At stake is a licence for the Rosebank development - approved by the last government, but now blocked by the courts on environmental concerns over huge carbon emissions. Read more:Cut taxes to get people buying electric cars - motor industryDetails on plan for Great British Energy When I asked the prime minister if he was minded to grant new permissions, he all but said yes: \"The mindset is we know that oil and gas is going to be a big part of the future for many decades to come. \"We do need to transition to clean power, but in relation to this particular licence, it was granted in the first place, it is going back through a process. \"I can't pre-empt the decision but, you know, we did say that where licences have already been granted, we wouldn't interfere with them. \"But I'll be open with you, oil and gas is part of the future mix for decades to come.\"  The reality is that as growth comes hard to find, the prime minister and his chancellor are going to have to face down the environmentalists in the cabinet and the party. Nuclear might be an example where green and growth can go hand in hand, but the third runway at Heathrow or the approval of controversial licences for two major oil and gas sites in the North Sea are not. This could get difficult. The PM is intensely relaxed about taking on environmental \"zealots\" outside his party, but what about the fight within? Just a couple of days ago on the Labour List website for activists and members, there was an article that said the PM must reject a proposal to develop this giant oil field or \"risk imploding the party\". Ed Miliband, the climate secretary, described Rosebank as \"climate vandalism\" when it was issued a licence by the last government. Meanwhile, the Labour manifesto committed to no further oil and gas licences, so some will see allowing this development as a betrayal. Note, in the response to my question, the PM was at pains to stress this was not a new licence and the government had said it \"wouldn't interfere\" with licences already granted. It is going to be hugely controversial. It could push Labour supporters into the arms of other progressive parties, prompt cabinet splits and public rows. But if this government doesn't get economic growth, the Starmer project collapses. When it comes to decisions that pit growth versus green, it seems that Starmer has decided he doesn't have much choice."
    },
    {
        "title": "TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour",
        "description": "TV chef Gino D'Acampo has denied dozens of allegations of inappropriate and intimidating behaviour on the sets of TV shows he has appeared on.",
        "url": "https://news.sky.com/story/tv-chef-gino-dacampo-denies-dozens-of-allegations-of-inappropriate-behaviour-13304383",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gino-dacampo_6821740.jpg?20250206213512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-06 21:30:00",
        "Headline": "D'Acampo has said he would never do anything to \"distress anyone\" after multiple women accused him of aggressive behaviour and making highly sexualised remarks.",
        "Content": "TV chef Gino D'Acampo has denied dozens of allegations of inappropriate and intimidating behaviour on the sets of TV shows he has appeared on. D'Acampo actions were described as being \"unacceptable\", \"distressing\" and \"horrendous\", according to an ITV News investigation. Anonymous women who spoke to the news broadcaster also accused D'Acampo of aggressive behaviour and making highly sexualised remarks. In a statement to ITV News, D'Acampo has said he \"firmly\" denies the allegations and \"would not do anything that I thought would upset or distress anyone\". He adds: \"I am a father, husband... the suggestion that I have acted in an improper way against is deeply upsetting.\" Sky News has contacted D'Acampo for comment. ITV also reported that bosses at Objective Media Group, the production company behind Gordon, Gino And Fred's Roadtrip in 2018, appear to have been aware of concerns about D'Acampo's behaviour. \n                  Irv Gotti, the founder of Murder Inc Records behind hits with Ashanti and Ja Rule, dies aged 54\n                 \n                  Liam Payne's girlfriend Kate Cassidy says death 'still doesn't feel real' - and reveals why she left him in Argentina\n                 \n                  Steve Coogan avoids driving ban after plea to save new TV show The Trip with Rob Brydon\n                 Objective Media Group said: \"We have robust protocols and procedures in place for all cast and crew, including on-screen talent, that we review regularly whilst also ensuring that we take into account developments regarding industry wide 'Duty of Care' guidelines.\" The production company continued: \"Across all productions we encourage people to raise any concerns at the earliest opportunity... If there are incidents or complaints reported, we implement our Escalation Procedure and ensure that a full and thorough process is followed in close collaboration with the broadcaster.\" Read more from Sky News:Blake Lively and Justin Baldoni's legal battle explainedSteve Coogan avoids driving ban Other production companies that have worked with D'Acampo have also issued statements following the allegations. Studio Ramsay said: \"Whilst we do not disclose or discuss personnel matters publicly, Studio Ramsay is committed, in conjunction with our broadcast partners, to a safe and professional work environment. We take all allegations of inappropriate behaviour and workplace misconduct seriously, promptly investigate, and take appropriate remedial action when warranted.\" MultiStory Media said: \"It would be inappropriate to go into the detail of individual concerns but we give our assurance that we are reviewing the concerns which have been raised, what was known at the time and what action was taken. We will also look at any new concerns that have come to light.\""
    },
    {
        "title": "UK weather: Cold snap on the way as temperatures set to plummet to -7C and health alerts issued",
        "description": "The UK is set to see temperatures plunge as low as -7C (19.4F) as cold health alerts have been issued.",
        "url": "https://news.sky.com/story/uk-weather-cold-snap-on-the-way-as-temperatures-set-to-plummet-to-7c-and-health-alerts-issued-13304289",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-weather-uk-weather_6821577.jpg?20250206184320",
        "type": "UK",
        "Author": "Jo Robinson",
        "Date Published": "2025-02-06 18:31:00",
        "Headline": "While a cold spell is on the way, temperatures are not expected to fall as low as last month,  where -18.9C was recorded in Scotland.",
        "Content": "\n          Weather producer\n              @SkyJoRobinson\n The UK is set to see temperatures plunge as low as -7C (19.4F) as cold health alerts have been issued. From Friday, the country is heading into a colder and drier spell of weather. High pressure over Scandinavia will strengthen and lead to a blocked weather pattern with an easterly flow developing across the UK. A blocked weather pattern is where a weather system remains almost stationary for a relatively prolonged period of time. Get the weather forecast where you are In winter, when air comes from the east, it typically brings colder and drier conditions, with the risk of some snow. The term Beast from the East is used when we get exceptionally cold and snowy weather from an easterly direction, like in 2018, but that is unlikely in this set-up. \n                  Storm Herminia: Fresh weather warnings for wind and rain issued after weekend of battering from Storm Eowyn\n                 \n                  UK weather: Storm Herminia brings heavy rain and 80mph winds after 'strongest' storm in decade\n                 \n                  'Sting jet' over Ireland behind Storm Eowyn's record-breaking 114mph wind\n                 Firstly, the air over the Baltic States and Russia is not as cold as it would typically be at this time of the year. Temperatures there are about 5C-10C above average. Secondly, the airmass dips south before heading to the UK so there is not a direct easterly flow. 'Notable wind chill for many' So extreme cold is currently unlikely, but daytime temperatures will fall to below average this weekend, lasting through much of next week. There will also be a notable wind chill in the south and east at times, making it feel freezing. By night, temperatures will be more typical for February, with a frost forming where skies remain clear. Northwest Scotland will probably see the lowest overnight temperatures, as low as -7C in rural parts, but it doesn't look as cold as last month. Cold weather alerts issued In Altnaharra, northern Scotland, -18.9C (-2F) was recorded on 11 January, the coldest January night in 15 years. The UK Health Security Agency has also issued a number of yellow cold health alerts covering areas across England including the North East, North West, Yorkshire and the Humber, and the South East from 9am on Friday until 9am on Tuesday. Read more from Sky News:NHS warns hospitals are 'close to full'British woman, 24, dies in Sri Lanka'Visionary' music producer dies aged 54 Snow is forecast for some With the arrival of colder air, some will get excited about the chance of snow. At the moment, no significant snow is expected, but parts of the South and East may well see a covering of snow at times, especially on Saturday and Monday. How long the cold, easterly flow will last is uncertain, but any breakdown to milder, wetter weather would bring a greater chance of heavy snow. Usually, the UK's most significant snow events happen when warm, moist air moves in and meets cold air sitting across the country."
    },
    {
        "title": "Public asked to name next Archbishop of Canterbury after Justin Welby resignation",
        "description": "The public is being given the chance to suggest who should be the next Archbishop of Canterbury, replacing Justin Welby, who resigned after a report found the Church of England covered up sexual abuse by a barrister.",
        "url": "https://news.sky.com/story/public-asked-to-name-next-archbishop-of-canterbury-after-justin-welby-resignation-13304447",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-justin-welby-archbishop-of-canterbury_6821876.jpg?20250207005302",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-06 23:14:00",
        "Headline": "The Church of England has described the public consultation as \"an opportunity to gather the views of a wide range of people... on the gifts, qualities and skills needed\".",
        "Content": "The public is being given the chance to suggest who should be the next Archbishop of Canterbury, replacing Justin Welby, who resigned after a report found the Church of England covered up sexual abuse by a barrister. He stood down following the publication of the Makin Review which found John Smyth QC attacked as many as 130 boys and young men, including at Christian summer camps. The independent investigation, published in November, concluded he might have been brought to justice had Mr Welby formally reported it to police a decade ago. Smyth died aged 75 in Cape Town in 2018 while still under investigation by Hampshire Police. Stephen Cottrell, the Archbishop of York, has temporarily taken over from the Archbishop of Canterbury, who stepped down in January. People will be able to submit names via the Church of England website to the Crown Nominations Commission (CNC) - the body charged with nominating the new archbishop. Candidates must be aged at least 30 and generally younger than 70 and historically they have been people already holding senior leadership roles in ministry in the Church or elsewhere in the Anglican Communion. \n                  Bishop of Newcastle hits out at Archbishop of York's 'empty words' over sex scandals\n                 \n                  Archbishop of Canterbury Justin Welby 'sorry' for hurt caused by his final speech in the Lords\n                 \n                  Archbishop of Canterbury Justin Welby says a 'head had to roll' after Church of England sexual abuse scandal\n                 Numerous scandals have emerged within recent months within the Church around separate safeguarding failings. In December, Mr Cottrell apologised over his leadership regarding a sex abuse case when he was Bishop of Chelmsford and in January the Bishop of Liverpool announced his retirement amid misconduct allegations. The Church has described the public consultation as \"an opportunity to gather the views of a wide range of people... on the gifts, qualities and skills needed\" for the role of Archbishop of Canterbury. But while the CNC will use the public vote \"to inform the commission\", the Church says the panel - which effectively has the final say - will invite people to apply for the role. Read more from Sky News:Gino D'Acampo denies \"horrendous\" behaviourTrump takes action against international courtTwo men admit starting blaze during riots The consultation will run until 28 March but it is not thought potential candidates will be officially made public during the selection process. While the public can put forward names, it is the Crown Nominations Commission (CNC) which recommends the final candidate. The CNC consists of: • The chair (a layperson) - to be appointed by the prime minister • A bishop - to be elected by the House of Bishops • The Archbishop of York or, if he chooses not to be a member of the CNC, a further bishop to be elected by the House of Bishops • Three representatives elected from the Diocese of Canterbury by their Vacancy in See (Diocesan Synod) Committee • Six representatives (three clergy and three lay) elected by General Synod to serve as members of the Commission for a five year period • Five representatives from other churches in the Anglican Communion - one each from Africa; the Americas; Middle East and Asia; Oceania and Europe The full membership of the CNC is expected to be known next month with meetings planned for May, July and September to put together a longlist and shortlist. Usually, the CNC's suggested candidate is given to the prime minister who - by convention instead of law - advises the monarch to appoint them. An announcement on the new archbishop is expected by autumn."
    },
    {
        "title": "King and Queen to meet Pope during state visit to Italy",
        "description": "The King and Queen are to pay state visits to Italy and the Vatican, Buckingham Palace has confirmed.",
        "url": "https://news.sky.com/story/king-and-queen-to-meet-pope-during-state-visit-to-italy-13304360",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-king-charles-christmas_6785004.jpg?20241225143648",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-02-06 21:00:00",
        "Headline": "Before the state visits to Italy and the Vatican, the King and Queen will join Hollywood star Stanley Tucci for a black tie dinner celebrating Italian cuisine at Highgrove.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The King and Queen are to pay state visits to Italy and the Vatican, Buckingham Palace has confirmed. The major spring tour will take place in early April and celebrate \"the strong bilateral relationship between Italy and the United Kingdom\". With royal overseas trips always carried out at the request of the Foreign Office, it can be seen as a part of a post-Brexit charm offensive, following trips by King Charles and Camilla to both Germany and France. They will meet Pope Francis at the Vatican and celebrate the Catholic Church's Pilgrims of Hope jubilee year. In Italy, the couple will visit Rome and the northeastern city of Ravenna, known for its early Christian mosaic artwork. At the end of last year it was confirmed that the King would have a busy diary of national and international engagements as he continues to have cancer treatment. His long-haul visit to Australia and Samoa last year was described as the \"perfect tonic\" for the monarch, and last week he travelled to Poland for the 80th anniversary of the liberation of Auschwitz. \n                  Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour\n                 The couple will attend the Holy See, the government of the Roman Catholic Church, which is located in the Vatican - the smallest independent state in the world, which is surrounded by Rome and is the residence of the spiritual leadership of the Roman Catholic Church. The King is Supreme Governor of the Church of England. Before the state visits, the King and Queen will join Hollywood star Stanley Tucci for a black tie dinner celebrating Italian cuisine at Highgrove on Friday evening. The pair have invited the Italian-American Devil Wears Prada actor and well-known foodie and the Italian ambassador to the UK, Inigo Lambertini, to Charles's Gloucestershire estate to enjoy a feast of sustainable Slow Food. The menu has been created by renowned Italian chef Francesco Mazzei and inspired by Tucci, who fronted the TV series Stanley Tucci: Searching for Italy. The Slow Food initiative was launched in 1986 in the small Italian town of Bra when food writer Carlo Petrini took exception to the opening of a McDonald's in Rome's Piazza di Spagna, leading to widespread national protests. Charles has long been a champion of the Slow Food philosophy."
    },
    {
        "title": "Two teenagers admit starting huge fire at former Crewe printworks during summer riots",
        "description": "Two teenagers have admitted starting a huge fire at a former printworks during last summer's riots - causing widespread disruption and displacing hundreds of people.",
        "url": "https://news.sky.com/story/two-teenagers-admit-starting-huge-fire-at-former-crewe-print-works-during-summer-riots-13304188",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-crewe-fire_6821489.jpg?20250206175600",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-06 14:27:00",
        "Headline": "More than 350 people had to be evacuated because their properties were at risk during the blaze in August - with some residents still unable to return home.",
        "Content": " Two teenagers have admitted starting a huge fire at a former printworks during last summer's riots - causing widespread disruption and displacing hundreds of people. James Evans, 19, and Justin Keeling, 18, entered the building in Crewe, Cheshire, on the afternoon of Friday 9 August and set a large pile of cardboard alight before the flames spread quickly and a major incident was declared. Keeling filmed some of the early stages of the fire on his mobile phone. Police have said the teenagers walked to Keeling's home after the blaze and were \"laughing and joking along the way\". The disused industrial premises is located on the junction of Catherine Street and Frances Street in Crewe town centre and is surrounded by a number of terraced houses. Five streets were evacuated, with firefighters from all over Cheshire called in to tackle the blaze. They remained at the scene for several days. Hundreds of residents evacuated \n                  Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision\n                 \n                  Starmer has a battle on his hands - but when it's green v growth, there's only one winner\n                 \n                  TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour\n                 More than 350 people were evacuated because their homes were at risk, with some properties damaged by the fire. Displaced residents stayed in leisure centres or with friends and family as the fire raged. Cheshire Constabulary has said some families have still not be able to return home. 'Officers suffer health issues' The force added that some police officers who arrived at the scene were left with \"considerable health issues\" which \"caused them to have time off work\". When officers put cordons in place, Keeling was among the crowd of onlookers. He laughed at police, swore at them and shouted for people to riot. Keeling spoke to broadcaster Keeling also gave an interview to the BBC as news organisations reported on the fire and asked residents how they had been affected. In the article published three days after the blaze, Keeling said: \"I had to move out on Friday night along with other residents on Catherine Street because the flames were that big.\" He added: \"All the businesses stuck together and they helped deliver food to everyone which was great, it's great to see in a crisis everyone worked together.\" He also said he would have to get his house deep-cleaned to get rid of lingering smoke particles. While police were carrying out door-to-door enquiries they visited Keeling at his home. The teenager told officers he saw the fire when he was walking back to Catherine Street with Evans and a third man, Peter Lord, 20. He claimed to have seen some youths near the building, climbing over a gate onto Bedford Street. Read more:Decision to demolish Grenfell criticised'Jaw-dropping' EuroMillions jackpot claimed after 13 daysForeign Office expels Russian diplomat As a result, a 12-year-old boy was arrested. But he was later released without charge. Keeling later admitted to a friend that he was inside the building with two others and police were informed. He was arrested and then released on bail. Days later police discovered a video filmed by Keeling on his seized mobile phone. The footage showed a large amount of cardboard in flames before the camera panned round and showed another fire. Evans, Keeling and Lord were all arrested that day on suspicion of arson being reckless to endanger life. They each denied the offence despite the video. Evans, from Sandbach, and Keeling and Lord, both from Crewe, appeared at Chester Crown Court on 29 January for a trial. However, Evans and Keeling pleaded guilty to arson being reckless to endanger life on the first day. Lord was found not guilty on 3 February following a trial. Keeling also admitted to perverting the course of justice at an earlier hearing. Motive unknown Police have said Evans and Keeling's motive for starting the fire is still not known. They have been remanded in custody to be sentenced at Chester Crown Court on 14 April. The fire took place as far-right riots took place across the country for several days between the end of July and beginning of August. The violence initially broke out after three young girls were stabbed to death in Southport, Merseyside."
    },
    {
        "title": "Princess Anne thanks hospital staff for 'filling in the blanks' after horse accident",
        "description": "Princess Anne has thanked hospital staff for helping her with \"filling in the blanks\" after her horse-related accident, as it was confirmed she was treated in intensive care.",
        "url": "https://news.sky.com/story/princess-anne-thanks-hospital-staff-for-filling-in-the-blanks-after-horse-accident-13304280",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-princess-royal-southmead-hospital_6821562.jpg?20250206195325",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-02-06 18:15:00",
        "Headline": "It was also revealed for the first time that the King's sister was treated in intensive care during her five-night stay last June.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Princess Anne has thanked hospital staff for helping her with \"filling in the blanks\" after her horse-related accident, as it was confirmed she was treated in intensive care. Anne told medical crews at Southmead Hospital in Bristol who cared for her after the incident last June: \"Sadly, I don't have huge memories of being in here either. \"I just know I was really well looked after so thank you.\" The 74-year-old princess is thought to have been struck by a horse's head or leg on her Gatcombe Park estate while on her way to see her chickens. An air ambulance and emergency services were dispatched before the princess was driven 30 miles to Southmead. It had not previously been known that the Princess Royal, who drove herself to the engagement on Thursday, had been treated in intensive care. Anne, in a short speech, told staff at the hospital: \"You've been filling in the blanks, which partly, from my perspective, is really useful to know what happened because I seriously don't have any idea and, sadly, I don't have huge memories of being in here either. I just know I was really well looked after, so thank you. \n                  Princess Anne speaks out about horse accident that left her concussed last year\n                 \n                  Boxing, horse riding and meeting a therapy poodle - what the royals have been up to\n                 \n                  Princess Anne returns to public duties after suffering concussion\n                 \"But whatever you did, it seemed to work… the recovery being relatively straightforward, thankfully. That isn't always true so I'm really grateful. \"I'm also grateful in a weird sort of way that I remember nothing because that has huge advantages - you can just carry on.\" Anne appeared to joke about which of her horses was responsible for her injuries, saying: \"I know if there was a perpetrator who managed to do that much damage, they're not letting on either, so relationships remain absolutely secure. \"No one has gone absent as a result of this.\" The King's sister spent five nights in hospital after her accident on 23 June. At the time, Buckingham Palace said the princess \"remains in Southmead Hospital, Bristol, as a precautionary measure for observation\". She did not return to public royal duties until almost three weeks later after rehabilitation support at home."
    },
    {
        "title": "Sri Lanka: British woman Ebony McIntosh, 24, dies after hostel fumigated for bed bugs, police say",
        "description": "A British woman has died on holiday in Sri Lanka after a room in her hostel was fumigated for bed bugs, local police said.",
        "url": "https://news.sky.com/story/sri-lanka-british-woman-ebony-mcintosh-24-dies-after-hostel-fumigated-for-bed-bugs-police-say-13304178",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ebony-mcintosh-derby_6821342.jpg?20250206143827",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-06 14:29:00",
        "Headline": "Ebony McIntosh, 24, from Derby, was taken to hospital in Colombo after falling ill with vomiting and breathing difficulties on Saturday - but died there hours later.",
        "Content": "A British woman has died on holiday in Sri Lanka after a room in her hostel was fumigated for bed bugs, local police said. Ebony McIntosh, 24, from Derby, was taken to hospital in the capital Colombo on Saturday after becoming ill. She had reportedly suffered vomiting, nausea and breathing difficulties - but died there hours later. Another woman Nadie Raguse, 26, from Germany, who was also staying at the Miracle Colombo City Hostel died, Sri Lanka police said. The force's spokesperson Buddhika Manatunga said a room in the hostel had been fumigated for bed bugs before the women fell ill - and that they are investigating the possibility of poisoning by noxious pesticides. The hostel is closed until further notice. The digital marketing and social media manager's family has set up a GoFundMe page to help with the cost of returning her body to the UK. 'Absolutely heartbroken' A statement on the page read: \"We are absolutely heartbroken to share that our beautiful baby girl and big sister Ebony has passed away unexpectedly on Saturday 1st February 2025, thousands of miles away from home. \"Words cannot begin to express how broken we are, it's been like a nightmare since we found out on Sunday morning, we have prayed and prayed that this can't be true. It couldn't possibly happen to our lovely Ebs.\" The statement added: \"We cannot even begin to imagine how scared she must have felt at the time and it hurts us so badly to think of the pain she was in. We need to be with her and bring her home safely. \"She passed away with someone from the hostel beside her. We are endlessly grateful to this man for staying with her during her last moments.\" The family said Ms McIntosh had started her holiday on 28 January when she flew from Heathrow to \"follow her dreams of travelling all over South Asia, starting in Sri Lanka\". They said she was \"full of excitement for her adventures ahead, in typical Ebony style she had spent months researching and planning and drawing up schedules for the coming months\". \"Her trip was cruelly cut short on Saturday 1st February, when she [was taken] very ill in the hostel she was staying in.\" Read more from Sky News:Decision to demolish Grenfell criticisedSteve Coogan avoids driving banEmaciated dog and tarantulas abandoned A cause of death has not been established - and a post-mortem examination cannot take place until the family arrives on 10 February, the police said. A Foreign, Commonwealth & Development Office (FCDO) spokesperson confirmed: \"We are supporting the family of a British woman who died in Sri Lanka, and are in contact with the local authorities.\""
    },
    {
        "title": "Social landlords forced to fix dangerous mould from October under Awaab's Law - as charity criticises 'delay'",
        "description": "A law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October, the government has announced.",
        "url": "https://news.sky.com/story/social-landlords-forced-to-fix-dangerous-mould-from-october-under-awaabs-law-as-charity-criticises-delay-13304222",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-awaab-ishak-rochdale_5970469.jpg?20221118162247",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-02-06 15:44:00",
        "Headline": "Awaab's Law is in memory of a two-year-old boy who died from a respiratory condition caused by prolonged exposure to mould.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n A law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October, the government has announced. The legislation is named after two-year-old Awaab Ishak, who died in December 2020 from a respiratory condition caused by prolonged exposure to mould in the social home his family rented in Rochdale, Greater Manchester. Politics latest: No 10 defends new US ambassador The tragedy sparked widespread calls for change after an inquest heard how action to treat and prevent the mould was not taken - despite the boy's father repeatedly raising the issue with Rochdale Boroughwide Housing (RBH). In response, the then Conservative government pledged to introduce Awaab's Law to hold social landlords to account, with Labour vowing to implement and extend it to the private sector if they won the general election, which they did last July. Setting out the next steps, Deputy Prime Minister and Housing Secretary Angela Rayner said it will come into force in the social rented sector from October this year. It means social landlords will be required to address damp and mould hazards that present a significant risk of harm to tenants within fixed timescales. \n                  Children in B&Bs beyond legal limit as homelessness crisis pushes councils to 'breaking point'\n                 \n                  Calls for rent caps within tenancies as landmark bill returns to Commons\n                 \n                  £1bn funding boost for councils to tackle homelessness\n                 The timescales were not set out in Ms Rayner's statement. A consultation under the Tories had proposed forcing landlords to investigate the problems within 14 days, and fix them within a further seven, but it is not clear if this will still be the case - with more details expected later down the line. Ms Rayner said that from October 2025, social landlords will also have to address all emergency repairs, whether they relate to damp and mould or any other hazard, as soon as possible and within no longer than 24 hours. What happens after 2025? From 2026, the requirements will apply to a wider range of non-emergency hazards beyond damp and mould, including excess cold and excess heat, falls, structural collapse and fire, electrical and hygiene hazards. Then in 2027, the requirements of Awaab's Law will expand to the remaining hazards as defined by the Housing Health and Safety Rating System (excluding overcrowding). This includes issues like keeping a property secure against intruders, inadequate lighting and exposure to noise. 'Delays put people at risk' Ms Rayner said the phased approach \"in no way means that social landlords have any leeway\" when it comes to meeting their existing duties to keep tenants safe, amid criticism from housing campaigners. She said the sequencing is required so protections to damp and mould can be introduced earlier than would be the case if the government sought to apply Awaab's Law to all hazards from the outset. But Polly Neate, chief executive of Shelter, said: \"Four years after Awaab's death, and nearly two years after the Social Housing Regulation Act received Royal Assent, today's announcement means social housing tenants will have to wait years longer for this vital protection. \"These delays to implementation represent a real risk to the health and safety of tenants, and puts lives at risk.\"  Awwab's Law follows campaigning from his parents, who said they hoped it would stop other families going through what they did. There are widespread issues with damp, mould and disrepair across homes in England, which are in the worst condition of all European countries while being more expensive to buy, according to analysis by the Home Builders Federation. Complaints over social housing increased by over 300% in 2024, while almost half of private renters are said to be living with damp or mould, Sky News has previously reported. Read More:Children living in temporary accommodation for more than five years'Raise funding for social homes or fail to meet building targets' It is not clear when Awaab's Law could be extended to the private sector, as promised in Labour's manifesto. The government said this will be done through its Renters' Rights Bill, which is currently going through parliament. Ministers are also consulting on a new Decent Homes Standard, which sets minimum standards for the condition of social homes, and will separately legislate to require social landlords to carry out electrical safety checks and appliance inspections."
    },
    {
        "title": "Orebro attack: Victim of Sweden shooting rang fiancee one last time to tell her he loved her",
        "description": "One of the victims of the attack on an adult education centre in Sweden rang his fiancee one last time after being shot to tell her he loved her.",
        "url": "https://news.sky.com/story/orebro-attack-victim-of-sweden-shooting-rang-fiancee-one-last-time-to-tell-her-he-loved-her-13304256",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sweden-orebro-shooting_6821516.jpg?20250206171412",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 17:06:00",
        "Headline": "Salim Iskef, 29, is thought to be one of the 10 people killed in Tuesday's massacre at an adult education centre. Swedish media has named the gunman as Rickard Andersson.",
        "Content": "One of the victims of the attack on an adult education centre in Sweden rang his fiancee one last time after being shot to tell her he loved her. Salim Iskef, 29, is thought to be one of the 10 people killed in Orebro on Tuesday. Local media has named Rickard Andersson as the perpetrator behind the attack, which the Swedish prime minister described as the worst mass shooting in the country's history. After being shot, Mr Iskef, a newly engaged nursing assistant, managed to call his fiancee one final time. \"He said he loved me so much\", Kareen Elia, his fiancee, told Sky News' Swedish partner TV4. \"You have no words. I can't describe the feelings. We were supposed to get married on July 25,\" she said. She added that, after he called her lying on the floor, she could not understand what she was seeing on FaceTime and was in shock. Then he said: \"Take care of my mother, yourself,\" Ms Elia told the Swedish outlet. She added: \"He said he had been shot. That they had shot us. I asked where. He hung up. I called again and again but he didn't answer.\" Ms Elia was critical of the police's handling of the situation, saying officers could have saved him if they had acted faster. She also said she was still waiting for confirmation of her fiancee's death. \"We haven't seen him yet,\" she added. 'We heard him walking around' It comes as one of the survivors told Sky News correspondent Ashna Hurynag how, as she hid fearing for her life, she heard the footsteps of Andersson close by. Meracil Kallkvist said: \"I was really shaking. It was scary. I was thinking, I was going to panic. \"I wanted to run to save my life because I was thinking I don't want to get... [hurt] here sitting down and hiding.\"  She recounted how she panicked as the first shots rang out, fearing something might have exploded, while some of the other students went to investigate the noises. Ms Kallkvist said: \"They wanted to know, then after like two seconds because [of the] other shots, one person ran back, someone was shooting, so I ran.\" While looking for somewhere to hide, she described how she met her teacher and, unable to lock the door of the room they were in, they pushed tables and chairs against it to try to block it. It was then they heard Andersson walking around. Read more from Sky News:Germany's race to be ready for warHottest January on record shocks scientistsBritish woman, 24, dies in Sri Lanka Ms Kallkvist added: \"After, we heard him walking around. Yes... it was really scary, if he'd just turned to the room where we were hiding... \"He [was] just walking around and talking and after we heard banging on the doors, I think it was the other room, then suddenly shots again.\" Police previously said they were yet to establish a motive and that the gunman was believed to have shot himself dead."
    },
    {
        "title": "Greece declares state of emergency on Santorini after earthquakes",
        "description": "Greece's authorities have declared a state of emergency on Santorini after a series of earthquakes shook the popular tourist destination.",
        "url": "https://news.sky.com/story/greece-declares-state-of-emergency-on-santorini-after-earthquakes-13304315",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-santorini-greece-earthquake_6821768.jpg?20250206235938",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 19:32:00",
        "Headline": "More than 10,000 residents and workers fled the popular tourist island this week after near-constant tremors, including a 5.2 magnitude earthquake on Wednesday night.",
        "Content": " Greece's authorities have declared a state of emergency on Santorini after a series of earthquakes shook the popular tourist destination. More than 10,000 residents and workers fled the island this week as near-constant tremors and undersea earthquakes have been recorded between Santorini and the islands of Amorgos, Anafi and Ios. A 5.2 magnitude quake struck on Wednesday night - the most powerful recorded since activity started on 31 January. Authorities warned of a high landslide risk, and have shut schools, dispatched rescuers, and advised residents to avoid ports and indoor gatherings. Some of the island's famous cliff-top towns have been cordoned off. Army, fire service and police units have also been deployed to the island. The state of emergency is set to be in place until 3 March to allow Greece's climate crisis and civil protection ministry to respond to the consequences of the seismic activity. \n                  Buildings in Vanuatu damaged and casualties reported as magnitude 7.3 earthquake hits South Pacific island nation\n                 \n                  Tsunami warning lifted after powerful earthquake off California coast\n                 \n                  7.0-magnitude earthquake triggers Russian volcano eruption and ash cloud warning for aircraft\n                 Greece is one of Europe's most earthquake-prone countries but seismologists have said the high level of activity is unprecedented and may last weeks or months. The experts say the tremors are unrelated to volcanic activity in the Aegean Sea, but are unable to say whether they could lead up to a more powerful earthquake. Read more: What is causing the 'unusual seismic activity'? \"We are not yet in a position to say that we are seeing any evidence that would lead to the sequence slowly coming to a conclusion,\" said Vassilis K Karastathis, a seismologist and director of research at National Observatory of Athens. \"We are still in the middle of the road, we haven't seen any easing, any sign that it's heading towards a regression.\" But the fact the tremors are underwater significantly reduces the potential for widespread damage compared to land-based seismic events. Santorini was formed in its current shape following one of the largest volcanic eruptions in history in around 1600 BC."
    },
    {
        "title": "Sri Lanka: British woman Ebony McIntosh, 24, dies after hostel fumigated for bed bugs, police say",
        "description": "A British woman has died on holiday in Sri Lanka after a room in her hostel was fumigated for bed bugs, local police said.",
        "url": "https://news.sky.com/story/sri-lanka-british-woman-ebony-mcintosh-24-dies-after-hostel-fumigated-for-bed-bugs-police-say-13304178",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ebony-mcintosh-derby_6821342.jpg?20250206143827",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 14:29:00",
        "Headline": "Ebony McIntosh, 24, from Derby, was taken to hospital in Colombo after falling ill with vomiting and breathing difficulties on Saturday - but died there hours later.",
        "Content": "A British woman has died on holiday in Sri Lanka after a room in her hostel was fumigated for bed bugs, local police said. Ebony McIntosh, 24, from Derby, was taken to hospital in the capital Colombo on Saturday after becoming ill. She had reportedly suffered vomiting, nausea and breathing difficulties - but died there hours later. Another woman Nadie Raguse, 26, from Germany, who was also staying at the Miracle Colombo City Hostel died, Sri Lanka police said. The force's spokesperson Buddhika Manatunga said a room in the hostel had been fumigated for bed bugs before the women fell ill - and that they are investigating the possibility of poisoning by noxious pesticides. The hostel is closed until further notice. The digital marketing and social media manager's family has set up a GoFundMe page to help with the cost of returning her body to the UK. 'Absolutely heartbroken' A statement on the page read: \"We are absolutely heartbroken to share that our beautiful baby girl and big sister Ebony has passed away unexpectedly on Saturday 1st February 2025, thousands of miles away from home. \"Words cannot begin to express how broken we are, it's been like a nightmare since we found out on Sunday morning, we have prayed and prayed that this can't be true. It couldn't possibly happen to our lovely Ebs.\" The statement added: \"We cannot even begin to imagine how scared she must have felt at the time and it hurts us so badly to think of the pain she was in. We need to be with her and bring her home safely. \"She passed away with someone from the hostel beside her. We are endlessly grateful to this man for staying with her during her last moments.\" The family said Ms McIntosh had started her holiday on 28 January when she flew from Heathrow to \"follow her dreams of travelling all over South Asia, starting in Sri Lanka\". They said she was \"full of excitement for her adventures ahead, in typical Ebony style she had spent months researching and planning and drawing up schedules for the coming months\". \"Her trip was cruelly cut short on Saturday 1st February, when she [was taken] very ill in the hostel she was staying in.\" Read more from Sky News:Decision to demolish Grenfell criticisedSteve Coogan avoids driving banEmaciated dog and tarantulas abandoned A cause of death has not been established - and a post-mortem examination cannot take place until the family arrives on 10 February, the police said. A Foreign, Commonwealth & Development Office (FCDO) spokesperson confirmed: \"We are supporting the family of a British woman who died in Sri Lanka, and are in contact with the local authorities.\""
    },
    {
        "title": "'Dangerous climate breakdown' warning as hottest January on record shocks scientists",
        "description": "Last month was the warmest January on record, according to new data.",
        "url": "https://news.sky.com/story/dangerous-climate-breakdown-warning-as-hottest-january-on-record-shocks-scientists-13303929",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-castaic-lake-wildfire_6808091.jpg?20250123074242",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-02-06 08:52:00",
        "Headline": "Temperatures last month were 0.1C above the record set in January 2024. And it comes after a year in which temperatures topped 1.5C, the target for climate negotiations, for the first time.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Last month was the warmest January on record, according to new data. The finding has baffled scientists, who had expected changes in ocean currents in the Pacific to take the edge off rising global temperatures. Figures released by the European Copernicus climate service show average temperatures around the world in January were 1.75C warmer than before greenhouse gas emissions started to rise significantly in the industrial revolution around 150 years ago. That's 0.1C above the record set last January. And it comes after a year in which temperatures topped 1.5C, the target for climate negotiations, for the first time.  Dr Friederike Otto, a climate scientist at Imperial College London, warned that the rising pace of climate change would increase the risk of extreme weather and its consequences. \"This January is the hottest on record because countries are still burning huge amounts of oil, gas and coal,\" she said. \"The Los Angeles wildfires were a stark reminder that we have already reached an incredibly dangerous level of warming. We'll see many more unprecedented extreme weather events in 2025.\" Read more:Role climate change did - and did not - play in California wildfires  January had been expected to be slightly cooler than last year because of a natural shift in weather patterns and ocean currents in the Pacific, called La Nina. But that hasn't been enough to slow the upward trend in temperatures. 'Frankly terrifying'  Bill McGuire, emeritus professor of geophysical & climate hazards at UCL, said: \"The fact that the latest robust Copernicus data reveals the January just gone was the hottest on record - despite an emerging La Nina, which typically has a cooling effect - is both astonishing and, frankly terrifying. \"Having crashed through the 1.5C limit in 2024, the climate is showing no signs of wanting to dip under it again, reflected by the fact that this is the 18th of the last 19 months to see the global temperature rise since pre-industrial times top 1.5C. \"On the basis of the Valencia floods and apocalyptic LA wildfires, I don't think there can be any doubt that dangerous, all-pervasive, climate breakdown has arrived.\" Read more from Sky News:Lab-grown meat for dogs goes on sale'Self-healing roads' could help fix pothole problem The consequences of a warming atmosphere are also being directly felt in the UK, with more intense rainfall increasing the risk of surface flooding. The Environment Agency released figures in December showing 4.6 million properties in England are at risk from flooding as drainage systems are overwhelmed by rainfall. That's a 43% increase on previous estimates. But adapting to a climate change is hugely expensive. The government on Wednesday announced it would spend £2.65bn over two years to shore up existing flood defences and protect an extra 52,000 homes and businesses - a tiny fraction of the number at risk."
    },
    {
        "title": "Ancient scrolls near Pompeii were preserved but unreadable - are they now revealing their secrets?",
        "description": "Ancient scrolls charred by a volcanic eruption 2,000 years ago may finally be starting to reveal their secrets.",
        "url": "https://news.sky.com/story/these-ancient-scrolls-were-charred-by-a-volcano-are-they-now-revealing-their-secrets-13303892",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-herculaneum-ancient_6820895.jpg?20250206071908",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 06:41:00",
        "Headline": "UK scientists say they have made a historic breakthrough in their efforts to decipher 2000-year-old papyrus scrolls that were burned when Mount Vesuvius erupted.",
        "Content": "Ancient scrolls charred by a volcanic eruption 2,000 years ago may finally be starting to reveal their secrets. UK scientists say they have made a historic breakthrough in their efforts to decipher the artefacts - with the assistance of AI. Hundreds of papyrus scrolls were found in the 1750s in the remains of a lavish villa at the Roman town of Herculaneum, which along with nearby Pompeii was destroyed when Mount Vesuvius erupted in 79AD. While the heat and ash from the volcano was catastrophic for the town, it preserved the scrolls - though in an unreadable state. Scholars and scientists have been working for more than 250 years on ways to decipher the scrolls, which are too fragile to be unrolled physically. In 2023, several tech executives sponsored the \"Vesuvius Challenge\" competition, offering cash prizes for efforts to decipher the scrolls with technology. On Wednesday, the challenge announced a \"historic breakthrough,\" saying researchers had managed to generate the first image of the inside of one of the three scrolls held at Oxford University's Bodleian Library. University of Kentucky computer scientist Brent Seales, co-founder of the challenge, said the organisers were \"thrilled with the successful imaging of this scroll\", saying it \"contains more recoverable text than we have ever seen in a scanned Herculaneum scroll\". Read more from Sky News:'We are no longer living in peacetime': Germany's race to be ready for warOzzy Osbourne to reunite with Black Sabbath The scroll was scanned by Diamond Light Source, a lab in Harwell, near Oxford, by using a particle accelerator known as a synchrotron to create an intensely powerful X-ray. AI was then used to piece together the images, searching for ink that reveals where writing is located. A 3D image of the scroll can then be formulated that allows experts to unroll it virtually. Little of the text has been deciphered so far. One of the few words that has been made out is the ancient Greek for \"disgust\". Peter Toth, a curator at the Bodleian Library, said: \"We need better images, and they are very positive and very, very confident that they can still improve the image quality and the legibility of the text. \"And then don't forget that there is like 1,000 more scrolls in Naples.\""
    },
    {
        "title": "Why are South African HIV clinics closing because of Trump? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/why-are-south-african-hiv-clinics-closing-because-of-trump-13304238",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/2372502060269325507_6821457.jpg?20250206162236",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 16:21:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Elon Musk and the Trump administration have agreed to shut down USAID, the world's largest single donor to international aid programmes, with thousands of staff being withdrawn as Mr Musk says it is \"beyond repair\". The decision follows a wave of government cuts since Mr Trump's return to office last month.  On the Sky News Daily, Tom Cheshire speaks to Sky's Africa correspondent Yousra Elbagir - reporting from Johannesburg - where the effects are already being felt, as sexual health clinics are closing and life-saving HIV drugs are no longer available. Producer: Alex BishopEditor: Philly Beaumont"
    },
    {
        "title": "Tokyo man arrested on suspicion of capturing, abusing and killing pigeon",
        "description": "A man has been arrested in Tokyo on suspicion of killing a pigeon that he reportedly filmed himself abusing.",
        "url": "https://news.sky.com/story/tokyo-man-arrested-on-suspicion-of-capturing-abusing-and-killing-pigeon-13303956",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-japan-police_6821026.jpg?20250206100847",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 09:44:00",
        "Headline": "Hiroshi Tsuji is reportedly accused of beating and whipping the animal before killing it at some point between June and August last year.",
        "Content": "A man has been arrested in Tokyo on suspicion of killing a pigeon that he reportedly filmed himself abusing. Hiroshi Tsuji, a 49-year-old taxi driver from Kawasaki, Kanagawa Prefecture, allegedly captured the bird on the side of a river in the Japanese capital sometime between April and June 2024, local media outlets reported. He is accused of beating and whipping the animal before killing it at some point between June and August, Japanese news agency Kyodo reported. It is alleged he killed the pigeon by decapitating it using scissors. Tsuji was quoted telling police before his arrest that he had \"purged the pigeon\" because it was \"unfriendly to him\", Kyodo reported, citing Japanese authorities. Read more from Sky News:Are ancient scrolls revealing their secrets?Liam Payne's girlfriend says death 'still doesn't feel real' The suspect is believed to have posted multiple videos of animal abuse on social media platform X since May 2023. Police had received more than 100 reports about his behaviour and several animal welfare groups filed complaints. He was previously arrested on 26 January for allegedly using a false name when purchasing a small bird at a pet shop in November 2024, according to Kyodo."
    },
    {
        "title": "Orebro shooting: Gunman had links with education centre where he killed 10 people, Swedish police say",
        "description": "The gunman who killed 10 people and wounded several others in Sweden may have been connected with the adult education centre where he opened fire, police have said.",
        "url": "https://news.sky.com/story/orebro-shooting-gunman-had-links-with-education-centre-where-he-killed-10-people-swedish-police-say-13303940",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-shooter-andersson_6820557.png?20250206105243",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-06 09:08:00",
        "Headline": "Detectives are still trying to establish a motive for Tuesday's attack. The killer, who was found dead at the scene,  has been named in local media as Rickard Andersson.",
        "Content": " The gunman who killed 10 people and wounded several others in Sweden may have been connected with the adult education centre where he opened fire, police have said. Detectives are still trying to establish a motive for Tuesday's attack in Orebro, the worst mass shooting in the country's history. Sweden has been left reeling as more details emerge, with the names of victims yet to be confirmed by police. In an update on Thursday, police said the gunman - who has been named in local media as Rickard Andersson - may have attended the education centre as a student. Officers said the 35-year-old was found dead after the attack with a large amount of unused ammunition nearby. They added that the shooter had licences for four weapons, three of which were found next to his body. \"We have found several weapons in the school. They are so-called long guns, rifles,\" a police spokesperson said. Andersson is said to have been unemployed for more than 10 years and is reported to have attended a special class for people with Asperger's and high-functioning autism. However, it is unclear whether this was at the same education centre.  Read more:What we know about shootingSweden's deadly gang war The head of the local police, Roberto Eid Forest, said the centre's large premises meant it took a long time for officers to search the campus and ensure there were not any more victims. Police heard gunshots when they arrived and initially thought they were being fired at, he added. While police have yet to disclose the identities of the victims, a local church named Salim Karim Iskef as one of the dead, saying: \"Salim Karim Iskef's life ended tragically after the terrible attack on the school yesterday. Condolences (Aza) will be received tomorrow.\" Syria's embassy in Stockholm wrote on Facebook that Syrian citizens were among the dead. Bosnia's foreign ministry said its embassy had been told by relatives that one Bosnian citizen had beenkilled and another wounded in the attack. Meanwhile, mourners have continued to leave tributes to those who died at a makeshift memorial near the scene. One of them, Malin Hilmberg, 37, said: \"We heard about it [mass shootings] in different parts of the world, but of course, it's a shock. It's your hometown and so many lives destroyed. It's hard to find words.\""
    },
    {
        "title": "Donald Trump sanctions International Criminal Court as he accuses it of 'abusing its power'",
        "description": "Donald Trump has sanctioned the International Criminal Court (ICC), accusing it of \"illegitimate and baseless actions targeting America and our close ally Israel\".",
        "url": "https://news.sky.com/story/judge-halts-donald-trumps-plan-to-get-rid-of-federal-employees-with-payout-13304316",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-us_6821783.jpg?20250206220923",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-06 19:34:00",
        "Headline": "In his first days and weeks in office, Donald Trump has signed a flurry of executive orders but some of the most high-profile ones have been blocked by judges over concerns about their legality.",
        "Content": "Donald Trump has sanctioned the International Criminal Court (ICC), accusing it of \"illegitimate and baseless actions targeting America and our close ally Israel\". In his latest round of executive orders, the US president has taken aim at the ICC and rallied against what he called anti-Christian bias in the US. It comes as a US federal judge temporarily blocked Mr Trump's plan to reduce the number of government employees. Follow live: Donald Trump latest The ICC order includes financial and travel sanctions against the organisation and its officials, and family members, who are found to have assisted in investigations into US citizens and allies, Sky News' US partner NBC News reported. The move coincides with a visit to Washington by Israeli Prime Minister Benjamin Netanyahu who, along with his former defence minister Yoav Gallant, is wanted by the ICC over the war in Gaza. The executive order says that by issuing those warrants, the ICC \"further abused its power\". \n                  Why are South African HIV clinics closing because of Trump? \n                 \n                  Israel leans hard into Trump plan for Gaza - but has anyone asked its people?\n                 \n                  UK government says it would 'oppose' Trump Gaza proposal\n                 It was unclear how quickly the US would announce the names of those sanctioned. In Mr Trump's first term, he imposed sanctions on then-prosecutor Fatou Bensouda and one of her top aides over the ICC's investigation into alleged war crimes by American troops in Afghanistan. 'Anti-Christian bias' A second executive order signed on Thursday night by Mr Trump targeted \"eradicating anti-Christian bias\" in the US federal government. The order will aim to \"work tirelessly to uphold\" religious freedom and attorney general Pam Bondi will lead a specific task force to achieve its aims. \"The mission of this task force will be to immediately halt all forms of anti-Christian targeting and discrimination withinthe federal government, including at the DOJ, which was absolutely terrible, the IRS, the FBI and other agencies,\" Mr Trump said.  'Fork in the road' Meanwhile, a judge ruled just hours before the midnight deadline for workers to apply for the \"fork in the road\" deferred resignation programme - which has been orchestrated by close Trump ally Elon Musk - that it should be temporarily halted. US district judge George O'Toole Jr, in Boston, did not express an opinion on the legality of the programme but scheduled a hearing for Monday. He also directed administration officials to extend the deadline for the programme until after the hearing. Mr O'Toole could opt to delay the scheme further or block it on a more permanent basis when he considers the legal challenge from unions on Monday. 👉 Listen to Sky News Daily on your podcast app 👈 The offer promises to pay employees their salaries until 30 September - but current spending laws expire on 14 March and it isn't clear whether salaries will be funded beyond this point. The worker buyout scheme is part of a broader move from Mr Trump's administration to shrink and reshape the federal government. An important aspect of that has been Mr Musk's Department of Government Efficiency. White House reaction to judge's ruling Responding to the development, press secretary Karoline Leavitt told NBC News: \"We are grateful to the judge for extending the deadline so more federal workers who refuse to show up to the office can take the administration up on this very generous, once-in-a-lifetime offer.\" She also said that more than 40,000 people had accepted the buyout so far - this figure corresponds to around 2% of the federal government's 2.3 million civilian workforce. NBC News reported this figure to be higher, at 60,000, citing a senior administration official. Around 6% of federal workers retire or resign in a normal year, according to the Partnership for Public Service. 'Offer not trustworthy' Labour unions and opposing Democrats have said the offer is not trustworthy. The buyout covers not just employees at domestic agencies, like the Environmental Protection Agency, but intelligence agencies like the CIA as well. Read more:Guantanamo Bay readied in response to Trump plansTrump's trans athletes rhetoric resonated with votersWhat's going on with Trump and tariffs? The administration also warned those who do not accept the buyout could still lose their jobs. This is the latest of Mr Trump's efforts to be blocked by a judge over concerns of legality. Mr Trump's plan to block birthright US citizenship has been blocked by a second federal judge in two days."
    },
    {
        "title": "Human remains found inside suitcase in New York river",
        "description": "Human remains have been recovered from a suitcase found in a New York river, police have said.",
        "url": "https://news.sky.com/story/human-remains-found-inside-suitcase-in-new-york-river-13303934",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-governors-island-new-york_6820980.jpg?20250206091955",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-06 09:03:00",
        "Headline": "The identity of the person is yet to be confirmed, but police said it is the body of an adult. ",
        "Content": "Human remains have been recovered from a suitcase found in a New York river, police have said. The suitcase was found at around 5.30pm local time on Wednesday near Governors Island in the East River, Sky News' US partner network NBC reported, citing its affiliate NBC New York. The New York City police force's harbour unit retrieved the suitcase and took it to Pier 16, where the person inside was pronounced dead. The deceased's identity is yet to be confirmed. Read more from Sky News:Bodies of Washington DC plane crash victims recoveredCan Trump take over the Gaza Strip? Police were unsure of the person's age and gender but confirmed the remains were those of an adult, NBC reported. The chief medical examiner's office said it will work to determine the cause of death."
    },
    {
        "title": "Blake Lively and Justin Baldoni's legal battle: What have they accused each other of in rival It Ends With Us lawsuits?",
        "description": "Another lawsuit has been filed in connection with the ongoing legal battle between actress Blake Lively and her co-star&#160;Justin Baldoni.",
        "url": "https://news.sky.com/story/blake-lively-and-justin-baldonis-legal-battle-what-have-they-accused-each-other-of-in-rival-it-ends-with-us-lawsuits-13303947",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-blake-lively-justin-baldoni_6812611.jpg?20250128134249",
        "type": "US",
        "Author": "Lauren Russell",
        "Date Published": "2025-02-06 14:00:00",
        "Headline": "Both actors filed lawsuits against each other after appearing together in the film It Ends With Us. Since then, even more lawsuits have been filed and a judge has set a date for it all to play out in court at trial. Here, we explain the row so far.",
        "Content": "\n          News reporter\n              @laurenvrussell\n  Another lawsuit has been filed in connection with the ongoing legal battle between actress Blake Lively and her co-star Justin Baldoni. Crisis communications specialist Jed Wallace filed a $7m (£5.6m) defamation suit against Lively after he was named in court papers, as part of her legal fight against an alleged smear campaign to harm her reputation. It is the latest in a series of developments after both actors filed lawsuits against each other following an initial legal complaint from Lively, after the pair worked together on the film It Ends With Us. The dispute between them has been ongoing since December last year - and is pretty complicated. So here is everything you need to know about Hollywood's latest legal off-screen drama, and how it has unfolded so far. Film's release overshadowed by speculation The release of It Ends With Us in August 2024 was somewhat overshadowed by speculation about discord between its two main actors. The film is an adaptation of Colleen Hoover's bestselling 2016 novel and follows Lively's character, Lily Bloom, as she navigates an abusive relationship with Baldoni's character, Ryle Kincaid. Baldoni took a backseat in promoting the film, even though he also directed and produced the project, while Lively took centre stage along with husband Ryan Reynolds, who was on the press circuit for Deadpool & Wolverine at the same time. Baldoni also did not pose for photos with other actors at the premiere and fans noticed that he was not followed by Lively or co-star Jenny Slate on Instagram. Lively appeared to take the brunt of negative media attention around the same time the film was released, with some also criticising her for promoting her own businesses - beverage company Betty Buzz and hair care brand Blake Brown - at the same time. In an interview with NBC News' Today programme, Baldoni touched on the online speculation by broadly saying making a movie involves \"navigating complex personalities\" to get on the same page. He added at the time: \"And mistakes are always made, and then you figure out how to move past them.\" Lively's legal complaint On 21 December, The New York Times published an article called 'We Can Bury Anyone': Inside a Hollywood Smear Machine, which revealed Lively had filed a legal complaint against Baldoni with the California Civil Rights Department. In the complaint, Lively, 37, accused Baldoni, 41, of sexual harassment and alleged that he, along with the studio behind It Ends With Us, embarked on a subsequent \"multi-tiered plan\" to damage her reputation. Concerns raised in the filing included Baldoni showing pictures of nude women to Lively, mentioning his previous porn addiction, and making comments about Lively's weight. Baldoni has denied all the allegations. Tension between the two actors was addressed in a meeting in January 2024, where a new code of conduct for the set of the film was put in place, according to the complaint. Alleged smear campaign As part of the sexual harassment complaint, lawyers representing Lively demanded the release of any messages relating to what they referred to as an attempt to damage the actor's reputation. The complaint claims Baldoni and Wayfarer Studios - the production company behind It Ends With Us - hired a crisis communications firm in order to carry out a \"sophisticated, coordinated, and well-financed retaliation plan\" meant to \"bury\" and \"destroy\" Lively, if she went public with her on-set concerns. She alleges the plan included a proposal to plant theories on online message boards, engineer a social media campaign and place news stories critical of her. It also claimed Baldoni \"abruptly pivoted away from\" the film's marketing plan and \"used domestic violence 'survivor content' to protect his public image\". In messages that were later made public, exchanges between Jennifer Abel, of PR firm RWA Communications, Melissa Nathan, of The Agency Group PR, and Baldoni, appear to discuss the plan. In one exchange Ms Nathan apparently tells Ms Abel: \"We can't write it down to him… We can't write 'we will destroy her'... You know we can bury anyone. But I can't write that to him.\" Lively told The New York Times that she hoped the complaint would help to \"pull back the curtain on these sinister retaliatory tactics to harm people who speak up about misconduct and helps protect others who may be targeted\". These allegations were also strenuously denied by Baldoni, Wayfarer Studios and its representatives. Bryan Freedman, a lawyer representing all three, called the claims by Lively \"completely false, outrageous and intentionally salacious with an intent to publicly hurt and rehash a narrative in the media\". He said the studio had \"proactively\" hired a crisis manager \"due to the multiple demands and threats made by Lively during production\". Baldoni was dropped by his agency, WME, immediately after Lively filed her complaint and The New York Times published its story. The agency also represents both Lively and Reynolds. Baldoni's $250m lawsuit against The New York Times Just before the start of the year, Baldoni sued The New York Times for libel. The lawsuit seeks at least $250m (£199m) in damages and was filed in the Los Angeles Superior Court on the exact same day Lively filed a federal lawsuit against Baldoni, Wayfarer Studios and others - going further than her previous legal complaint. Baldoni, along with others that are named in Lively's lawsuit, accused The New York Times of accepting a \"self-serving narrative\" from the actor in order to write its article 'We Can Bury Anyone': Inside a Hollywood Smear Machine. The lawsuit said the article \"disregard[s] an abundance of evidence\" that contradicts Lively's accusations. The paper responded to the lawsuit by saying it plans to \"vigorously defend\" its reporting. In a statement, it said: \"The role of an independent news organisation is to follow the facts where they lead. \"Our story was meticulously and responsibly reported. It was based on a review of thousands of pages of original documents, including the text messages and emails that we quote accurately and at length in the article.\" Lively was not named as a defendant in the libel lawsuit against the paper. In a statement, lawyers representing the actor said: \"Nothing in this lawsuit changes anything about the claims advanced in Ms Lively's California Civil Rights Department Complaint, nor her federal complaint, filed earlier today.\"  Baldoni sues Lively and Reynolds In a separate lawsuit, filed on 16 January, Baldoni and Wayfarer Studios sued Lively and Reynolds for damages, including lost future income. The suit is seeking at least $400m (£326m) and was filed to a New York court. It alleges Lively and Reynolds hijacked both the production and marketing of It Ends With Us, and manipulated media to smear Baldoni and others on the production with false allegations of harassment. The lawsuit also claims Lively used Baldoni as a scapegoat for her \"publicly tainted image\" and leveraged \"her power as a wealthy celebrity to take creative control of the film\". Baldoni and the studio did not want to take legal action, his lawsuit also says. But it adds that Lively \"has unequivocally left them with no choice, not only to set the record straight […] but also to put the spotlight on the parts of Hollywood that they have dedicated their careers to being the antithesis of\". Responding to the filing, Lively's lawyers, Manatt, Phelps & Phillips and Willkie Farr & Gallagher, accused Baldoni and his team of using a DARVO tactic, which stands for \"deny, attack, reverse victim and offender\". Their statement said: \"This is an age-old story: A woman speaks up with concrete evidence of sexual harassment and retaliation and the abuser attempts to turn the tables on the victim. This is what experts call DARVO. Deny. Attack. Reverse Victim Offender.\" Prospective trial date set Towards the end of January, New York federal judge Lewis J Liman set a trial date of March 2026 for Lively and Baldoni's legal battle. It followed a claim by Lively's legal team that Mr Freedman, the lawyer for Baldoni, was trying to influence potential jurors by creating a website to release selected documents and communications between the pair. Lively's lawyers called for an end to a \"stream of defamatory and extrajudicial media statements\" while Mr Freedman said he and Baldoni would \"respect the court\". \"All we want is for people to see the actual text messages that directly contradict her allegations, video footage that clearly shows there was no sexual harassment and all the other powerful evidence that directly contradicts any false allegations,\" Baldoni's lawyer said. Judge Liman later warned both parties that their comments to the media could impact their cases. The warning was in response to a complaint by Lively's team that Mr Freedman violated professional ethics rules for lawyers by accusing the actress of \"bullying\" in People magazine. Mr Freedman hit back to say his comments to the magazine and on a podcast were a response to The New York Times article back in December, which he said \"completely devastated\" Baldoni. A state ruling that bars most out-of-court statements that could affect a case's outcome - with some exceptions - has now been adopted by Judge Liman. Communications specialist sues Lively  In the latest lawsuit, crisis communications expert Jed Wallace is suing Lively for defamation. Mr Wallace and his company, Street Relations, filed the $7m (£5.6m) case in federal court in Texas on 4 February after Lively accused him of being behind much of the alleged social media manipulation that turned public sentiment against her in the build-up to the release of It Ends With Us. Lively sought to get an order for a deposition - a sworn statement taken from a witness outside of court - from Mr Wallace. But Mr Wallace has now claimed neither he nor his company \"had anything to do with the alleged sexual harassment, retaliation, failure to investigate or aiding and abetting the alleged harassment or alleged retaliation\". Read more from Sky News:Steve Coogan avoids driving banOzzy Osbourne to reunite with Black SabbathHollywood stars set to light up Glasgow Film Festival Mr Wallace is not named in Lively's federal lawsuit but is mentioned in court papers and The New York Times story that started the legal battle between the two actors. Lively's lawyers said in response that Mr Wallace's lawsuit \"is not just a publicity stunt\". \"It is transparent retaliation in response to allegations contained within a sexual harassment and retaliation complaint that Ms Lively filed with the California Civil Rights Department,\" the statement said. \"While this lawsuit will be dismissed, we are pleased that Mr Wallace has finally emerged from the shadows, and that he too will be held accountable in federal court.\""
    },
    {
        "title": "Irv Gotti, the founder of Murder Inc Records behind hits with Ashanti and Ja Rule, dies aged 54",
        "description": "American music producer Irv Gotti has died at the age of 54.&#160;",
        "url": "https://news.sky.com/story/irv-gotti-the-founder-of-murder-inc-records-behind-hits-with-ashanti-and-ja-rule-dies-aged-54-13304210",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-irv-gotti-2022_6821377.jpg?20250206152533",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-06 15:25:00",
        "Headline": "Gotti produced nearly 30 Hot 100 chart hits in the US for artists including Ashanti, Ja Rule, Ye, DMX, Fat Joe, Mary J Blige and Jay-Z.",
        "Content": "American music producer Irv Gotti has died at the age of 54.  The producer, who founded the hip-hop label Murder Inc Records, produced nearly 30 Hot 100 hits in the US charts for artists including Ashanti, Ja Rule, Ye, DMX, Fat Joe, Mary J Blige and Jay-Z. His death was confirmed by his children - Angie, Sonny and JJ - who posted on his official Instagram page to say that he died on 5 February \"surrounded by his family and friends\". Describing their father as an \"incredible man\" and \"true visionary\", they said he will \"leave behind a legacy that will forever resonate in the hearts of those who knew him and the countless lives he touched\". \"As we navigate this difficult time, we kindly ask for privacy while we grieve the loss of our dad, son, brother, uncle, and friend. We take comfort in knowing that his spirit will live on through his music and the love he shared with all of us,\" the family statement added. Gotti's cause of death has not been revealed. After founding Murder Inc in 1998, Gotti signed Ashanti and Ja Rule as the record label's first artists. Ja Rule landed his first top 40 Billboard Hot 100 hit with Holla Holla from his 1999 debut album Venni Vetti Vecci, while the song Always On Time, which featured both him and Ashanti, became his highest-charting single. Meanwhile, Ashanti's 2002 debut single, Foolish, made her only the second artist to simultaneously occupy spots in the top 10 of the Billboard Hot 100 with her first three charting singles. The label's success skyrocketed, and between 1999 and 2005 Ja Rule had a total of 17 Hot 100 hits. Leading tributes to the producer, Def Jam Recordings - another record label owned by Universal Music Group - posted on social media, writing that Gotti's work \"reshaped the soundscape of hip-hop and R&B\". \"Def Jam Recordings and the extended Def Jam family of artists, executives and employees, are deeply saddened at the loss of Irv Gotti,\" Def Jam said. \"His contributions at Def Jam, as both an A&R executive and in partnership with Murder Inc, helped pave the way for the next generation of artists and producers, a force that reshaped the soundscape of hip-hop and R&B. \"His creative genius and unwavering dedication to the culture behind countless hits, defined an era of music that continues to resonate with fans worldwide.\" Read more from Sky News:Blake Lively and Justin Baldoni's legal battle explainedSteve Coogan avoids driving ban  Ja Rule also posted, sharing two images, one featuring them together, with the caption: \"Love you.\" 50 Cent, who appeared to reference his long-running feud with Gotti, also paid tribute, posting a picture of himself smoking next to a gravestone that read RIP."
    },
    {
        "title": "Interest rate cut - but economic growth forecast slashed in blow to chancellor",
        "description": "The Bank of England has cut interest rates by another quarter percentage point, bringing down the cost of borrowing to 4.5%.",
        "url": "https://news.sky.com/story/interest-rate-cut-but-economic-growth-forecast-slashed-in-blow-to-chancellor-13304038",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-pound-gbp-currency_6243464.png?20250206124225",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-02-06 11:21:00",
        "Headline": "Comments from the Bank of England seem to indicate two further interest rate cuts this year, though investors are betting on more. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n The Bank of England has cut interest rates by another quarter percentage point, bringing down the cost of borrowing to 4.5%. And in a sign that households can expect more cuts in the months to come, two members of the Bank's Monetary Policy Committee said they would have preferred to reduce rates even more, by a full half percentage point. Follow live reaction to interest rate cut in the Money blog However, the Bank slashed its forecast for economic growth, forecasting that the economy will skirt clear of a formal recession only by the narrowest margin in the coming months, and downgraded its estimate of the economy's ability to generate income. And in a further blow to the chancellor, it said her latest growth plans, unveiled in a speech last week, will add nothing to gross domestic product growth in its forecast horizon. The Bank's governor, Andrew Bailey, said: \"It will be welcome news that we have been able to cut interest rates again today. We'll be monitoring the UK economy and global developments very closely and taking a gradual and careful approach to reducing rates further. \"Low and stable inflation is the foundation of a healthy economy and it's the Bank of England's job to ensure that.\"  Financial market data later showed that investors were expecting a total of four rate cuts this year, largely as a result of the weaker growth outlook. Mr Bailey told Sky News: \"Look, we don't endorse a path of interest rates. We've used the words gradual and careful to describe our future policy, sort of in a sense 'stance,' if you like, for very good reasons. \"One is because we've got to see the evidence that this path of disinflation continues, the underlying path. And secondly, I'm afraid there's just a greater amount of uncertainty in the world around us.\" The Monetary Policy Report and Bank forecasts released alongside the decision today signal that the economy is due to have another few years of weakness. They cut the forecast for economic growth this year, next year and the following year, as well as raising the inflation forecast. The Bank also said that the economy's potential growth rate had dropped, down from 1.5% this time last year to 0.75% at the moment. It said that while it expected last October's budget to boost economic growth by 0.75%, thanks largely to greater public investment, it also expected the National Insurance rise to weigh down on activity, in particular by pulling down employment. Analysis: Where do interest rates go from here? It also warned that the tariffs threatened by Donald Trump on various economies posed a risk for economic growth in the coming years, though it has yet to incorporate them into its models."
    },
    {
        "title": "Interest rate path is tricky to navigate in tougher economy",
        "description": "Let's start with the simple bit: interest rates have been cut - down by another quarter percentage point to 4.5%. But what happens next?",
        "url": "https://news.sky.com/story/interest-rate-path-is-tricky-to-navigate-in-tougher-economy-13304057",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-biz-graphic-bank-bailey_6643991.png?20240731155213",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-02-06 11:35:00",
        "Headline": "Big cuts to the growth forecast and hikes to inflation expectations mean the Bank of England has a tougher job on its hands when deciding on rates ahead.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Let's start with the simple bit: interest rates have been cut - down by another quarter percentage point to 4.5%. But what happens next? Not long ago, the answer was quite simple: the Bank of England would carry on cutting borrowing costs, one quarter point cut every three months, until they reached, say, 3.5%. That, at least, was the expectation this time last year. Money latest: First-time buyers warned over auctions  But things have become more complex, more unpredictable in recent months. Instead there are two paths ahead of us. One of them, let's call it the high road, sees those borrowing costs being cut only gradually, down to 4% in a couple of years' time. Down the other road, the low road, the outlook is quite different: rates will be cut faster and more. They go down below 4%, perhaps as low as 3.5%, perhaps even lower. \n                  Bank of England governor to join Reeves on key China visit\n                 \n                  Bank of England governor frets over impact of budget and Trump's return\n                 \n                  Bank of England issues mortgage rate warning to 4.4 million homes and sounds Trump trade alarm\n                 The funny thing about today's splurge of information and forecasts from the Bank of England is that it's not entirely clear whether we're on the high road or the low road anymore. Now, strictly speaking, the forecasts and fan charts produced by the Bank's staff tend towards the former, more conservative view - the two cuts. But then look at the voting patterns on the monetary policy committee (MPC), where two members, Swati Dhingra and Catherine Mann just voted for a full half percentage point cut, and you're left with a different impression. That rates will go lower, and quickly.  And in truth, that's what often happens when the economy is weakening. When gross domestic product, the best measure of economic output, is flatlining or shrinking, when inflation is low (especially when you look beyond the temporary bump caused by energy prices) - that's usually precisely the time the Bank slashes rates with abandon. And that's precisely the situation the UK finds itself in at the moment. Read more from Sky News:Tesco eyes delivery of Crown Post Office branchesStarmer to slash red tape to build nuclear reactorsRace to avoid Trump tariffs as US imports hit record high But the problem is that a few things have complicated matters. One is that the government decided to splurge more money in last October's budget. That extra money sloshing around in the economy makes the Bank somewhat less willing to cut rates. Another is that although the economy is weak, inflation is still high - indeed, the Bank actually raised its forecast for the consumer price index in today's forecasts. Another is that the world economy has become a significantly more unstable place in recent months. Germany is in recession. The US, under Donald Trump, is threatening tariffs on its nearest allies. It's not altogether clear whether the response to all this is lower interest rates. Added to this, despite the chancellor's best efforts, there is little evidence that her pro-growth policies are boosting economic growth - at least according to the Bank's own forecasts.  These are tricky waters to navigate. All of which helps explains why it's no longer quite as clear as it once was what happens next. My suspicion is that the Bank will end up cutting rates, probably more than those two cuts baked into its forecasts. But such forecasts are even more fraught than usual."
    },
    {
        "title": "Financial Ombudsman Service chief exits after board clashes",
        "description": "The head of the Financial Ombudsman Service (FOS) has effectively been forced out of the role after losing the confidence of its board amid growing government pressure on economic watchdogs.",
        "url": "https://news.sky.com/story/financial-ombudsman-service-chief-exits-after-board-clashes-13304232",
        "image_url": "https://e3.365dm.com/21/11/1920x1080/skynews-aerial-london-canary-wharf_5570182.jpg?20211103121748",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-06 16:15:00",
        "Headline": "Abby Thomas, who only joined the FOS in October 2022, is said to have clashed with fellow directors over the size of a fee levied on claims management companies, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The head of the Financial Ombudsman Service (FOS) has effectively been forced out of the role after losing the confidence of its board amid growing government pressure on economic watchdogs. Sky News understands that Abby Thomas, whose departure was announced earlier on Thursday, was at the centre of several disputes with fellow directors over issues including the introduction of a fee for claims management companies (CMCs). Britain's banks and insurers have long argued for a fee to be imposed on CMCs that would deter spurious ambulance-chasing, with the FOS proposing last May to establish a £250 charge. Money latest: Pound falls as Bank of England deals growth blow to chancellor Industry executives said that Ms Thomas had argued for a much lower fee - said to be as low as £25. Ms Thomas, who joined the FOS less than two-and-a-half years ago as chief executive and chief ombudsman, is said by insiders to have lost the confidence of the organisation's chair Baroness Manzoor. The prime minister, chancellor and business secretary have been intensifying pressure on regulators in recent weeks as they search desperately for ways to kickstart growth in the economy. \n                  Money blog: Pound falls as Bank of England deals major growth blow to chancellor\n                 \n                  Interest rate cut - but economic growth forecast slashed in blow to chancellor\n                 \n                  Interest rate path is tricky to navigate in tougher economy\n                 That pressure resulted in the ousting of the Competition and Markets Authority chairman last month, and one bank executive said that Ms Thomas's exit - while not directly instigated by ministers - was a reflection of the same mood. Rachel Reeves, the chancellor, recently moved to intervene in the car loan providers legal action which threatens to saddle lenders with compensation bills running to many billions of pounds. In its statement on Thursday, the FOS - which is operationally independent but handles complaints according to rules published by the Financial Conduct Authority (FCA) - noted simply that Ms Thomas was \"stepping down\". The FCA also appoints FOS board members, and its chair with the approval of the Treasury. \"Interim arrangements will apply with the Deputy Chief Ombudsman, James Dipple-Johnstone, covering the Chief Ombudsman role and the Chief Finance and Risk Officer, Jenny Simmonds, covering the Chief Executive role,\" the FOS said. Baroness Manzoor added: \"On behalf of the board and the executive, I would like to record our thanks and wish Abby every success in her future career.\" Ms Thomas said: \"It has been an absolute privilege to lead the Financial Ombudsman Service through this period of rapid transformation and innovation. \"I am immensely grateful to the entire Ombudsman team for everything that they do to support our customers and build confidence in the financial services industry.\" A spokesperson for the FOS said it would not comment beyond the statement on its website. Ms Thomas could not be reached for comment."
    },
    {
        "title": "Vertu Motors cuts jobs and closes showrooms on Sundays after budget blow",
        "description": "The country's third largest car retailer says it is cutting jobs and closing its dealerships on a Sunday as part of efforts to reduce costs amid tough trading and looming budget tax hikes.",
        "url": "https://news.sky.com/story/vertu-motors-cuts-jobs-and-sunday-opening-after-budget-and-electric-car-target-hits-13304213",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-electric-car-tesla-vehicle_5911044.jpg?20220926033352",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-02-06 15:25:00",
        "Headline": "Vertu moves to save cash ahead of a looming £10m budget tax hit, saying that government target-driven industry discounting has, and will continue to, hit its bottom line.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The country's third largest car retailer says it is cutting jobs and closing its dealerships on a Sunday as part of efforts to reduce costs amid tough trading and looming budget tax hikes. Vertu Motors, which has almost 200 sites operating predominantly under the Bristol Street Motors, Vertu and Macklin Motors brands, made the announcement while revealing an unscheduled profit warning. Money latest: Pound falls as Bank of England deals growth blow to chancellor The company said its bottom line had taken a big hit amid steep discounting industry-wide in a bid to meet a government target for sales of new electric vehicles - the so-called ZEV mandate. '£10m hit from budget' Vertu, which employs 8,000 staff, also pointed to a £10m rise in costs from budget tax rises due to take effect in April. The ZEV mandate is the main gripe for the new car industry. \n                  Money blog: Pound falls as Bank of England deals major growth blow to chancellor\n                 \n                  Interest rate cut - but economic growth forecast slashed in blow to chancellor\n                 \n                  Interest rate path is tricky to navigate in tougher economy\n                 It demands a rising proportion of total sales come from zero-emission vehicles each year. It was 22% in 2024 and rises to 28% this year. There are currently stiff penalties for missing that target.  It was missed last year amid the tough economy and industry pressure has forced a review. The government has been looking at what help it can give to aid the transition since Vauxhall's owner, Stellantis, moved to cut costs by announcing plans to close its Luton plant in April. Vertu warned on Thursday that because price cuts to attract sceptical electric buyers were likely to continue this year, it expected further pressure on margins and for sales volumes to remain depressed given the continuing squeeze on household budgets.  Read more:Electric car demand hits record high but misses targetVauxhall parent very clear on why Luton plant is closing The exact number of jobs affected by the company's spending cuts was unclear. It is understood that while a small number of roles have already been axed, Vertu would not seek to fill jobs vacated through natural churn in the months ahead. Vertu said it expected £4m in one-off costs to aid its long-term savings. Those costs also included a move to bring all its brands under the Vertu name. The company said in its statement that adjusted profit before tax for the year ending 28 February 2025 would be \"significantly below current market expectations\". That consensus figure stood at £34.5m in December. Shares fell by more than 7%. Robert Forrester, Vertu's chief executive, told investors: \"The group's high margin aftersales business is performing strongly. \"However, the government's ZEV Mandate is causing severe disruption to the UK new car market, and the consumer environment is subdued.\" \"The government and the industry need to get together to address the root cause of the issues to allow the automotive sector in the UK to return to its traditional role of stimulating economic growth, which is a catalyst for employment.\""
    },
    {
        "title": "HSBC to hand new chief Elhedery £15m maximum pay deal",
        "description": "HSBC Holdings is to hand its new chief executive a pay package potentially worth more than &#163;15m as part of an overhaul of its bosses' remuneration triggered by the government's scrapping of the EU bonus cap.",
        "url": "https://news.sky.com/story/hsbc-to-hand-new-chief-elhedery-16315m-maximum-pay-deal-13304023",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-hsbc-georges-elhedery_6643730.jpg?20240731114228",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-06 11:14:00",
        "Headline": "Georges Elhedery will be eligible for a total remuneration package worth just over £15m as part of plans to be unveiled by Europe's biggest lender later this month, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n HSBC Holdings is to hand its new chief executive a pay package potentially worth more than £15m as part of an overhaul of its bosses' remuneration triggered by the government's scrapping of the EU bonus cap. Sky News has learnt that Europe's biggest lender, which has a market capitalisation of more than £147bn, is putting the finishing touches to an overhaul of CEO Georges Elhedery's pay deal ahead of its annual results this month. HSBC is understood to have been consulting leading shareholders on the plans, which will involve increasing his maximum pay to just over £15m, in recent weeks. City sources said the proposals would see Mr Elhedery's fixed pay roughly halved, but with significantly more generous maximum variable pay awards. Money blog: Is UK now on new interest rate path? When he was named as Noel Quinn's successor last July, HSBC said he would receive a base salary of £1.38m, a £1.7m fixed pay allowance, a maximum annual bonus opportunity of roughly £3m and a maximum long-term share award of close to £4.5m. That amounts to a total of approximately £10.5m. \n                  Former City minister Afolami to return to HSBC in board role\n                 \n                  Bank exodus sparks row with UK lending standards body\n                 \n                  HSBC Holdings to kick off search for next chairman\n                 Investors said they have been briefed that Mr Elhedery's new package would scrap the fixed pay allowance altogether but incorporate higher multiples of bonus and long-term share awards. The bank's new finance chief, Pam Kaur, will also see her remuneration package amended along similar lines. The changes have been drawn up by Dame Carolyn Fairbairn, the former CBI director-general, who chairs HSBC's boardroom pay committee. HSBC's move to overhaul its directors' remuneration policy, which is expected to be put to a vote of shareholders in the spring, follows that of its UK banking peer, Barclays. Sky News revealed last month that Barclays was increasing CEO CS Venkatakrishnan's maximum pay package to just over £14m. Read more from Sky News:Tesco eyes delivery of Crown Post Office branchesStarmer to slash red tape to build nuclear reactorsRace to avoid Trump tariffs as US imports hit record high By comparison, HSBC's market capitalisation is about three-and-a-half times that of Barclays, making it the London stock market's third-largest company. The decision by leading UK banks to increase their CEOs' pay suggests that the industry is entering a more permissive climate as far as investors are concerned. One person close to HSBC pointed out that Mr Elhedery now ran Europe's biggest bank, but would continue to be paid less than many of his continental peers. By comparison, the major US banks also pay their chiefs significantly higher sums. Brian Moynihan, the boss of Charlotte, North Carolina-based Bank of America, earned $29m in 2023, while Goldman Sachs, JP Morgan and Morgan Stanley all pay their CEOs substantially more than Mr Elhedery will earn even as a maximum payout. It comes as searching questions continue about the attractiveness of London's stock market for international companies, with executive pay at the forefront of that debate. Mr Elhedery took up the role of HSBC CEO in September, since when he has announced a sweeping overhaul of the bank's operations, reorganising it along geographically distinct lines, a move which raised questions about the future of parts of its sprawling international empire. Last month, he announced surprise cuts to parts of HSBC's investment banking operations which will affect a significant number of its UK-based dealmakers. In a statement issued to Sky News, an HSBC spokesman said: \"The Remuneration Committee's objective is for the pay outcomes for our executive directors to be strongly aligned with performance and shareholders' interests. \"We will publish details with our YE results on 19 February.\" This year's annual report will not provide an accurate comparison with Mr Elhedery's likely pay from this year because he spent much of 2024 in the role of chief financial officer."
    },
    {
        "title": "Starmer to slash red tape to build nuclear reactors",
        "description": "Planning rules will be ripped up to make it easier to build new nuclear reactors and create thousands of highly skilled jobs, the government has announced.",
        "url": "https://news.sky.com/story/starmer-to-slash-red-tape-to-build-nuclear-reactors-13303699",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-combwich-wharf-nuclear_6071586.jpg?20230227094751",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-02-06 00:01:00",
        "Headline": "Ministers and unions say the plan could create jobs and deliver clean and affordable energy - but environmentalists question nuclear power's green credentials. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Planning rules will be ripped up to make it easier to build new nuclear reactors and create thousands of highly skilled jobs, the government has announced. The reforms are the latest in a series of proposals designed to \"get Britain building\" to help grow the economy, after powers for environmental quangos to delay infrastructure projects were removed. The UK was the first country in the world to develop a nuclear reactor but the last time a power station was built was in 1995. Ministers have blamed this on \"suffocating\" red tape, leaving the UK lagging behind in the global race for cleaner more affordable energy.  Under moves announced today, mini-nuclear power stations known as small modular reactors (SMRs) will be included in the national planning guidance, allowing them to be built in the UK for the first time. SMRs are considered to be cheaper, quicker to manufacture and safer than conventional nuclear power plants, so industry experts see them as having an important role in efforts to decarbonise. \n                  Nuclear weapon could be used to defend Earth from asteroid 2024 YR4, astronomer says\n                 \n                  Japanese Yakuza leader pleads guilty to conspiring to traffic nuclear materials from Myanmar\n                 \n                  West still relies on Russian nuclear power sector, shielding Moscow from further sanctions, report warns\n                 Other reforms include: • Scrapping a list which currently limits nuclear development to eight specific sites • Removing the expiry date on nuclear planning rules so projects don't get timed out • Establishing a new Nuclear Regulatory Taskforce to look at further ways to build nuclear plants quicker and cheaper, which will report directly to the prime minister Unions and business groups have welcomed the announcement, but environmentalists were critical. The changes come amid long-term struggles to get two existing nuclear projects over the line. Only one nuclear power plant, Hinkley Point C in Somerset, is under construction in the UK - but its completion date has been delayed by years with the French company developing it blaming this on inflation, labour shortages and Brexit disruption. The government also pointed to the need for a 30,000-page environmental assessment required to get planning permission, saying in its announcement today that Britain \"has been suffocated by regulations\", which is harming investment. A separate project, Sizewell C in Suffolk, has also been hit by delays and rising costs before a spade has even hit the ground. By comparison China is constructing 29 reactors, and the EU has 12 at planning stage. UK 'let down and left behind' Sir Keir Starmer said: \"This country hasn't built a nuclear power station in decades. We've been let down and left behind. \"I'm putting an end to it - changing the rules to back the builders of this nation, and saying no to the blockers who have who have strangled our chances of cheaper energy, growth and jobs for far too long.\" The announcement builds on a Labour manifesto commitment to \"end a decade of dithering\" on nuclear power as part of broader plans to make Britain a clean energy superpower by 2030 - with cheaper bills and better energy security. Energy Secretary Ed Miliband said that nuclear power will create \"thousands of skilled jobs\" and prevent the UK being vulnerable to global energy markets in the future. \"Build, build, build - that is what Britain's clean energy mission is all about,\" he said.  Some environmentalist groups dispute nuclear power's green credentials though, saying that while it doesn't produce carbon dioxide or other greenhouse gases, it isn't a plausible alternative to renewable energy sources - like wind and solar. Dr Doug Parr, policy director for Greenpeace UK, said: \"The Labour government has swallowed nuclear industry spin whole, seemingly without applying so much as a pinch of critical scrutiny or asking for a sprinkling of evidence.\" Unions were welcoming of the announcement's potential to create jobs and deliver net zero, but said it should go alongside the complete go-ahead for Sizewall C. And Tom Greatrex, chief executive of the Nuclear Industry Association, said: \"This is the prime minister's strongest signal yet that new nuclear is critical to the growth and clean power mission. \"A more streamlined planning system will give certainty to investors, the supply chain and communities, and will enable us to get on with building new nuclear plants on more sites and at pace for a cleaner, more secure power system.\""
    },
    {
        "title": "Starmer has a battle on his hands - but when it's green v growth, there's only one winner",
        "description": "Keir Starmer was touring the UK National Nuclear Laboratory in Preston when the Bank of England halved its 2025 growth forecast, cut interest rates for the third time in six months, warned of an uptick in inflation and said the national insurance hike on employers would hit prices and jobs more than expected.&#160;",
        "url": "https://news.sky.com/story/starmer-has-a-battle-on-his-hands-but-when-its-green-v-growth-theres-only-one-winner-13304301",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-beth-nuclear_6821616.jpg?20250206192721",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-06 19:02:00",
        "Headline": "After backing a Heathrow runway, a North Sea drilling licence could push Labour supporters into the arms of other progressive parties, prompt cabinet splits and public rows. But if this government doesn't get economic growth, the Starmer project collapses.",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer was touring the UK National Nuclear Laboratory in Preston when the Bank of England halved its 2025 growth forecast, cut interest rates for the third time in six months, warned of an uptick in inflation and said the national insurance hike on employers would hit prices and jobs more than expected.  It was a blow to a prime minister and chancellor who have placed all their chips on growth, made all the more painful because of those budget decisions that - in the short term at least - have made matters worse. Rachel Reeves said soon after: \"I am still not satisfied with the growth rate.\" Keir Starmer, in Preston to talk up nuclear power generation, said \"there's more to do\" as he extolled the virtues of small modular reactors - faster to build than existing larger power stations - as a way of speeding up the delivery of new nuclear power stations in England and Wales. The government hopes the first one will be up and running by 2032. He wants to do it by shaking up the planning system to \"clear the path\" for smaller reactors (there are currently just eight favoured sites for nuclear power plants in the UK). This was a prime minister determined to channel his inner Donald Trump and - hat tip to Chris Mason at the BBC - \"build baby build\". \n                  Starmer contradicts Trump on president's calls for Middle East 'Riviera' in Gaza\n                 \n                  How does Starmer keep Trump's US and the EU sweet? \n                 \n                  Sir Keir Starmer to urge EU nations to 'shoulder more of the burden' on defence spending\n                 This is a PM determined to take on the \"blockers\" and get Britain building again. But what is fast emerging, as growth flatlines, is that he and Rachel Reeves - who once said she'd be the UK's \"first green chancellor\" - will also take on the blockers in the cabinet and party if that is what it takes to get growth.  When it comes to green versus growth, the latter is going to win. This is a prime minister who, for my money, is also prepared to \"drill baby drill\" in that hunt for growth. Having signalled last month that the government is going to press ahead with a third runway at Heathrow in the face of fierce opposition from environmentalists, the prime minister all but confirmed to me on Thursday that he's also minded to back the approval of a giant new oilfield in the North Sea. At stake is a licence for the Rosebank development - approved by the last government, but now blocked by the courts on environmental concerns over huge carbon emissions. Read more:Cut taxes to get people buying electric cars - motor industryDetails on plan for Great British Energy When I asked the prime minister if he was minded to grant new permissions, he all but said yes: \"The mindset is we know that oil and gas is going to be a big part of the future for many decades to come. \"We do need to transition to clean power, but in relation to this particular licence, it was granted in the first place, it is going back through a process. \"I can't pre-empt the decision but, you know, we did say that where licences have already been granted, we wouldn't interfere with them. \"But I'll be open with you, oil and gas is part of the future mix for decades to come.\"  The reality is that as growth comes hard to find, the prime minister and his chancellor are going to have to face down the environmentalists in the cabinet and the party. Nuclear might be an example where green and growth can go hand in hand, but the third runway at Heathrow or the approval of controversial licences for two major oil and gas sites in the North Sea are not. This could get difficult. The PM is intensely relaxed about taking on environmental \"zealots\" outside his party, but what about the fight within? Just a couple of days ago on the Labour List website for activists and members, there was an article that said the PM must reject a proposal to develop this giant oil field or \"risk imploding the party\". Ed Miliband, the climate secretary, described Rosebank as \"climate vandalism\" when it was issued a licence by the last government. Meanwhile, the Labour manifesto committed to no further oil and gas licences, so some will see allowing this development as a betrayal. Note, in the response to my question, the PM was at pains to stress this was not a new licence and the government had said it \"wouldn't interfere\" with licences already granted. It is going to be hugely controversial. It could push Labour supporters into the arms of other progressive parties, prompt cabinet splits and public rows. But if this government doesn't get economic growth, the Starmer project collapses. When it comes to decisions that pit growth versus green, it seems that Starmer has decided he doesn't have much choice."
    },
    {
        "title": "'Disgraceful and unforgiveable': Decision to demolish Grenfell Tower attacked",
        "description": "The government has been accused of \"ignoring\" the voices of people who lost family in the Grenfell Tower tragedy in its decision to demolish the building.",
        "url": "https://news.sky.com/story/disgraceful-and-unforgiveable-decision-to-demolish-grenfell-tower-attacked-13303909",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-grenfell-inquiry-report_6677481.jpg?20240905143501",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-06 07:37:00",
        "Headline": "It has been almost eight years since 72 people died in the Grenfell Tower disaster, the UK's deadliest residential fire since the Second World War.",
        "Content": " The government has been accused of \"ignoring\" the voices of people who lost family in the Grenfell Tower tragedy in its decision to demolish the building. Grenfell United, which represents some bereaved and survivors, criticised the government's conduct as \"disgraceful and unforgiveable\". The news was announced in a meeting attended by deputy prime minister Angela Rayner on Wednesday night. Grenfell United said: \"Angela Rayner could not give a reason for her decision to demolish the tower. \"She refused to confirm how many bereaved and survivors had been spoken to in the recent, short four-week consultation. \"But judging from the room alone - the vast majority of whom were bereaved - no one supported her decision. But she claims her decision is based on our views.\" \"(The) meeting showed just how upset bereaved and survivors are about not having their views heard or considered in this decision. \"Ignoring the voices of bereaved on the future of our loved ones' gravesite is disgraceful and unforgiveable.\" The government said the decision is a \"deeply personal matter\" for people affected by the tragedy and that Ms Rayner is \"committed to keeping their voice at the heart of this\". It has been almost eight years since 72 people died in the Grenfell Tower disaster, the UK's deadliest residential fire since the Second World War. There have been discussions over the years about how best to commemorate the tragedy for the decades to come. Engineering experts have said that while the tower remains stable, and it is safe for people to live, work and study nearby, its condition will worsen over time and there is no realistic prospect of bringing it back into use. Read more:Grenfell fire families sent letter about unidentified remainsMinister loses brief after complaint by Grenfell survivors Grenfell Next of Kin, which represents some of the bereaved families, described the move to demolish the building as a \"deeply sensitive decision... after a thorough engagement process in person\" following an \"uncomfortable conversation with uncomfortable truths\". In a statement on X the group said: \"The lack of closure, the continuous discussions and consultations, the retraumatisation of a divisive and painful debate brings nothing to the table except pain and further division. \"We want a discussion about what will go in the Tower's place so it can be seen and remembered forever. We need to reimagine a future and rebuild our broken shattered lives and our families.\" Councillor Elizabeth Campbell, leader of Kensington and Chelsea Council, said the future of Grenfell Tower is a decision for the government. \"We know this will be a difficult moment for bereaved family members, survivors and the immediate local community. It's vital that the government works closely with those affected to understand their concerns and move forward with the decision. A spokesperson for the Ministry of Housing, Communities and Local Government said: \"The priority for the deputy prime minister is to meet with and write to the bereaved, survivors and the immediate community to let them know her decision on the future of the Grenfell Tower. \"This is a deeply personal matter for all those affected, and the deputy prime minister is committed to keeping their voice at the heart of this.\" In September last year, the public inquiry into Grenfell found \"systematic dishonesty\" contributed to the horrific fire. Inquiry chairman Sir Martin Moore-Bick said the \"simple truth\" was all the deaths were avoidable and that those who lived in the tower were \"badly failed\" by authorities \"in most cases through incompetence but, in some cases, through dishonesty and greed\". The report laid bare years of missed opportunities to prevent the catastrophe and how those responsible for fire safety were at risk of being compromised by commercial interests. The Metropolitan Police said last year decisions on criminal charges for the blaze are not expected until the end of 2026."
    },
    {
        "title": "Foreign Office expels Russian diplomat in tit-for-tat move after 'spying' row",
        "description": "The Foreign Office has revoked the accreditation of a Russian diplomat after a British official was expelled from Moscow last year.",
        "url": "https://news.sky.com/story/foreign-office-expels-russian-diplomat-in-tit-for-tat-move-after-spying-row-13304105",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-russian-embassy-london_6821300.jpg?20250206135559",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-06 12:43:00",
        "Headline": "Foreign Secretary David Lammy said the UK was \"unapologetic about protecting our national interests\" and warned Russia: \"If you take action against us, we will respond.\"",
        "Content": "The Foreign Office has revoked the accreditation of a Russian diplomat after a British official was expelled from Moscow last year. A Foreign Office spokesperson said the Russian ambassador to the UK, Andrei Kelin, had been summoned to a meeting with a senior British official to revoke the accreditation of the diplomat. \"This is in response to Russia's unprovoked and baseless decision to strip the accreditation of a British diplomat in Moscow in November,\" they said. The spokesperson added: \"The UK will not stand for intimidation of our staff in this way, and so we are taking reciprocal action. \"Any further action taken by Russia will be considered an escalation and responded to accordingly.\" Politics latest: PM unveils plans to 'get back' to nuclear power Shortly after the announcement, Foreign Secretary David Lammy posted on X: \"We've stripped a Russian diplomat's accreditation, following Russia's recent expulsion of a British diplomat. \"We are unapologetic about protecting our national interests. \"My message to Russia is clear - if you take action against us, we will respond.\" It comes after an employee of the British Embassy in Moscow was stripped of his accreditation and ordered to leave the country last year after being accused of being a spy. TASS, the Russian state news agency, said in November that he had been expelled for \"intentionally providing false information when entering the Russian Federation\". It said evidence had been found that the diplomat was involved in \"reconnaissance and subversive work that threatens the security of the Russian Federation\". The British diplomat who was removed from Russia had replaced one of six British intelligence officers who were expelled in August, according to TASS. The Foreign Office rejected Russia's accusations as \"baseless\". Read more from Sky News:Grenfell Tower decision criticisedInterest rates cutSteve Coogan avoids driving ban In May last year, the UK expelled Russia's defence attache in London, Colonel Maxim Elovik, claiming he was an \"undeclared military intelligence officer\". The government also removed diplomatic status from several Russian-owned premises and placed restrictions on Russian diplomatic visas. In response, Russia expelled Britain's defence attache in Moscow, Captain Adrian Coghill."
    },
    {
        "title": "Starmer reinforces pledge to cut household energy bills by £300 a year",
        "description": "Sir Keir Starmer has reinforced his commitment to reducing household energy bills by &#163;300 a year by 2030.",
        "url": "https://news.sky.com/story/starmer-reinforces-pledge-to-cut-household-energy-bills-by-163300-13304139",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-preston-nuclear-keir-starmer_6821328.jpg?20250206142031",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-06 13:38:00",
        "Headline": "The prime minister told Sky's political editor Beth Rigby that his decision to slash red tape to build more nuclear reactors will help with his pledge to cut bills by hundreds of pounds a year.",
        "Content": "Sir Keir Starmer has reinforced his commitment to reducing household energy bills by £300 a year by 2030. The prime minister told Sky News's political editor Beth Rigby that the figure is \"what we are driving towards\" and his plan to build more nuclear reactors will help.  Politics live: Chancellor reacts to grim growth figures The pledge, made repeatedly during the general election campaign, has been called into question after the boss of Labour's GB Energy, Juergen Maier, called the green initiative a \"long-term project\" and refused to say when household prices would be slashed. Asked if he stuck by the commitment, Sir Keir said: \"Yeah, that is our aim. That's what we're driving towards.\" He said the plan would be \"pushed forward\" by his announcement on Thursday to slash red tape so more nuclear energy projects can be built. Speaking at the UK National Nuclear Laboratory near Preston, he said this would stop the UK being \"exposed to the international market\" and give us more control over prices. \n                  Keir Starmer's 1,000 jobs pledge could take 20 years, GB Energy boss admits\n                 \n                  Shell to install Jackdaw gas platform in North Sea despite being blocked from drilling, Sky News understands\n                 \n                  Ovo Energy buys brand from founder as capital-raise looms\n                 \"We said we'd aim for £300, up to £300. That's what I want to achieve,\" the prime minister reiterated. \"I also want stability. I want those bills to be low for a prolonged period of time. I think many businesses, many families have suffered their bills going up and down and we can't have that volatility anymore,\" he added 👉Listen to Politics At Jack And Sam's on your podcast app👈. The nuclear power announcement forms part of broader plans to make Britain a clean energy superpower by 2030 - with cheaper bills and better energy security. Read more:Cut taxes to get people buying electric cars - motor industryDetails on plan for Great British Energy  Central to this pledge is the establishment of state-owned energy firm GB Energy, which will be headquartered in the northeast of Scotland and will develop and co-invest in new low-carbon energy. But earlier this week, the firm's start-up chairman said it could take 20 years to deliver the promised 1,000 jobs in Aberdeen, while refusing to say when bills could be slashed. In his first broadcast interview, Mr Maier told Sky News: \"I know that you are asking me for a date as to when I can bring that, but GB Energy has only just been brought into creation and we will bring energy bills down.\""
    },
    {
        "title": "Social landlords forced to fix dangerous mould from October under Awaab's Law - as charity criticises 'delay'",
        "description": "A law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October, the government has announced.",
        "url": "https://news.sky.com/story/social-landlords-forced-to-fix-dangerous-mould-from-october-under-awaabs-law-as-charity-criticises-delay-13304222",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-awaab-ishak-rochdale_5970469.jpg?20221118162247",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-06 15:44:00",
        "Headline": "Awaab's Law is in memory of a two-year-old boy who died from a respiratory condition caused by prolonged exposure to mould.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n A law to force social landlords to investigate and fix hazards within a set timescale will be phased in from October, the government has announced. The legislation is named after two-year-old Awaab Ishak, who died in December 2020 from a respiratory condition caused by prolonged exposure to mould in the social home his family rented in Rochdale, Greater Manchester. Politics latest: No 10 defends new US ambassador The tragedy sparked widespread calls for change after an inquest heard how action to treat and prevent the mould was not taken - despite the boy's father repeatedly raising the issue with Rochdale Boroughwide Housing (RBH). In response, the then Conservative government pledged to introduce Awaab's Law to hold social landlords to account, with Labour vowing to implement and extend it to the private sector if they won the general election, which they did last July. Setting out the next steps, Deputy Prime Minister and Housing Secretary Angela Rayner said it will come into force in the social rented sector from October this year. It means social landlords will be required to address damp and mould hazards that present a significant risk of harm to tenants within fixed timescales. \n                  Children in B&Bs beyond legal limit as homelessness crisis pushes councils to 'breaking point'\n                 \n                  Calls for rent caps within tenancies as landmark bill returns to Commons\n                 \n                  £1bn funding boost for councils to tackle homelessness\n                 The timescales were not set out in Ms Rayner's statement. A consultation under the Tories had proposed forcing landlords to investigate the problems within 14 days, and fix them within a further seven, but it is not clear if this will still be the case - with more details expected later down the line. Ms Rayner said that from October 2025, social landlords will also have to address all emergency repairs, whether they relate to damp and mould or any other hazard, as soon as possible and within no longer than 24 hours. What happens after 2025? From 2026, the requirements will apply to a wider range of non-emergency hazards beyond damp and mould, including excess cold and excess heat, falls, structural collapse and fire, electrical and hygiene hazards. Then in 2027, the requirements of Awaab's Law will expand to the remaining hazards as defined by the Housing Health and Safety Rating System (excluding overcrowding). This includes issues like keeping a property secure against intruders, inadequate lighting and exposure to noise. 'Delays put people at risk' Ms Rayner said the phased approach \"in no way means that social landlords have any leeway\" when it comes to meeting their existing duties to keep tenants safe, amid criticism from housing campaigners. She said the sequencing is required so protections to damp and mould can be introduced earlier than would be the case if the government sought to apply Awaab's Law to all hazards from the outset. But Polly Neate, chief executive of Shelter, said: \"Four years after Awaab's death, and nearly two years after the Social Housing Regulation Act received Royal Assent, today's announcement means social housing tenants will have to wait years longer for this vital protection. \"These delays to implementation represent a real risk to the health and safety of tenants, and puts lives at risk.\"  Awwab's Law follows campaigning from his parents, who said they hoped it would stop other families going through what they did. There are widespread issues with damp, mould and disrepair across homes in England, which are in the worst condition of all European countries while being more expensive to buy, according to analysis by the Home Builders Federation. Complaints over social housing increased by over 300% in 2024, while almost half of private renters are said to be living with damp or mould, Sky News has previously reported. Read More:Children living in temporary accommodation for more than five years'Raise funding for social homes or fail to meet building targets' It is not clear when Awaab's Law could be extended to the private sector, as promised in Labour's manifesto. The government said this will be done through its Renters' Rights Bill, which is currently going through parliament. Ministers are also consulting on a new Decent Homes Standard, which sets minimum standards for the condition of social homes, and will separately legislate to require social landlords to carry out electrical safety checks and appliance inspections."
    },
    {
        "title": "Starmer to slash red tape to build nuclear reactors",
        "description": "Planning rules will be ripped up to make it easier to build new nuclear reactors and create thousands of highly skilled jobs, the government has announced.",
        "url": "https://news.sky.com/story/starmer-to-slash-red-tape-to-build-nuclear-reactors-13303699",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-combwich-wharf-nuclear_6071586.jpg?20230227094751",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-06 00:01:00",
        "Headline": "Ministers and unions say the plan could create jobs and deliver clean and affordable energy - but environmentalists question nuclear power's green credentials. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Planning rules will be ripped up to make it easier to build new nuclear reactors and create thousands of highly skilled jobs, the government has announced. The reforms are the latest in a series of proposals designed to \"get Britain building\" to help grow the economy, after powers for environmental quangos to delay infrastructure projects were removed. The UK was the first country in the world to develop a nuclear reactor but the last time a power station was built was in 1995. Ministers have blamed this on \"suffocating\" red tape, leaving the UK lagging behind in the global race for cleaner more affordable energy.  Under moves announced today, mini-nuclear power stations known as small modular reactors (SMRs) will be included in the national planning guidance, allowing them to be built in the UK for the first time. SMRs are considered to be cheaper, quicker to manufacture and safer than conventional nuclear power plants, so industry experts see them as having an important role in efforts to decarbonise. \n                  Nuclear weapon could be used to defend Earth from asteroid 2024 YR4, astronomer says\n                 \n                  Japanese Yakuza leader pleads guilty to conspiring to traffic nuclear materials from Myanmar\n                 \n                  West still relies on Russian nuclear power sector, shielding Moscow from further sanctions, report warns\n                 Other reforms include: • Scrapping a list which currently limits nuclear development to eight specific sites • Removing the expiry date on nuclear planning rules so projects don't get timed out • Establishing a new Nuclear Regulatory Taskforce to look at further ways to build nuclear plants quicker and cheaper, which will report directly to the prime minister Unions and business groups have welcomed the announcement, but environmentalists were critical. The changes come amid long-term struggles to get two existing nuclear projects over the line. Only one nuclear power plant, Hinkley Point C in Somerset, is under construction in the UK - but its completion date has been delayed by years with the French company developing it blaming this on inflation, labour shortages and Brexit disruption. The government also pointed to the need for a 30,000-page environmental assessment required to get planning permission, saying in its announcement today that Britain \"has been suffocated by regulations\", which is harming investment. A separate project, Sizewell C in Suffolk, has also been hit by delays and rising costs before a spade has even hit the ground. By comparison China is constructing 29 reactors, and the EU has 12 at planning stage. UK 'let down and left behind' Sir Keir Starmer said: \"This country hasn't built a nuclear power station in decades. We've been let down and left behind. \"I'm putting an end to it - changing the rules to back the builders of this nation, and saying no to the blockers who have who have strangled our chances of cheaper energy, growth and jobs for far too long.\" The announcement builds on a Labour manifesto commitment to \"end a decade of dithering\" on nuclear power as part of broader plans to make Britain a clean energy superpower by 2030 - with cheaper bills and better energy security. Energy Secretary Ed Miliband said that nuclear power will create \"thousands of skilled jobs\" and prevent the UK being vulnerable to global energy markets in the future. \"Build, build, build - that is what Britain's clean energy mission is all about,\" he said.  Some environmentalist groups dispute nuclear power's green credentials though, saying that while it doesn't produce carbon dioxide or other greenhouse gases, it isn't a plausible alternative to renewable energy sources - like wind and solar. Dr Doug Parr, policy director for Greenpeace UK, said: \"The Labour government has swallowed nuclear industry spin whole, seemingly without applying so much as a pinch of critical scrutiny or asking for a sprinkling of evidence.\" Unions were welcoming of the announcement's potential to create jobs and deliver net zero, but said it should go alongside the complete go-ahead for Sizewall C. And Tom Greatrex, chief executive of the Nuclear Industry Association, said: \"This is the prime minister's strongest signal yet that new nuclear is critical to the growth and clean power mission. \"A more streamlined planning system will give certainty to investors, the supply chain and communities, and will enable us to get on with building new nuclear plants on more sites and at pace for a cleaner, more secure power system.\""
    },
    {
        "title": "UK government says it would 'oppose' Trump Gaza proposal",
        "description": "The UK government has offered fresh opposition to US President Donald Trump's proposal for Palestinians to leave Gaza.",
        "url": "https://news.sky.com/story/uk-government-says-it-would-oppose-trump-gaza-proposal-13304020",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-anneliese-dodds-downing-street_6806126.jpg?20250121102717",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-02-06 10:59:00",
        "Headline": "Foreign Office minister Anneliese Dodds told MPs that ministers were against any \"forced displacement of Palestinians\" following comments by the US president earlier this week to \"resettle\" people in the territory \"permanently\".",
        "Content": "\n          Political reporter\n       The UK government has offered fresh opposition to US President Donald Trump's proposal for Palestinians to leave Gaza. Foreign Office minister Anneliese Dodds told MPs on Thursday morning: \"We would oppose any effort to move Palestinians in Gaza to neighbouring Arab states against their will. \"There must be no forced displacement of Palestinians, nor any reduction in the territory of the Gaza Strip.\" It comes after Prime Minister Sir Keir Starmer and Foreign Secretary David Lammy distanced themselves from the idea earlier this week, reiterating that ministers supported a two-state solution for the region. Politics latest: Badenoch unveils first policy Mr Trump said on Tuesday that he wanted Palestinians to be relocated to countries like Egypt and Jordan and turn Gaza into a \"Riviera\" of the Middle East. The president said: \"If we can get a beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what's happening in Gaza.\" He added that the US would \"take over the Gaza Strip\" and \"own it\". The White House later tried to backtrack on some of what Mr Trump said. On Thursday, Israel's defence minister Israel Katz said he had ordered the Israel Defence Forces to \"prepare a plan that will allow any resident of Gaza who wishes to leave to do so, to any country willing to receive them\". Mr Trump made his announcement during a White House press conference alongside Israeli Prime Minister Benjamin Netanyahu.  Mr Netanyahu has since said he supported the idea of \"allowing Gazans who want to leave, to leave\". He added in an interview with Fox News: \"I mean, what's wrong with that? They can leave, they can then come back, they can relocate and come back. But you have to rebuild Gaza.\" Read more:Everything you need to know about Trump Gaza planProposal could make conflict worse Mr Trump's comments have been criticised around the world. Saudi Arabia, the United Arab Emirates, Egypt and Jordan also rejected Mr Trump's suggestion. In a statement on social media, Mr Katz claimed that countries like \"Spain, Ireland, Norway and others\" who have \"falsely accused Israel over its actions in Gaza\" are \"legally obligated\" to accept Gazans. The Irish government dismissed the claim as \"unhelpful\". 👉 Listen to Sky News Daily on your podcast app 👈 In the Commons, Ms Dodds resisted calls from multiple MPs, including from Labour, the SNP and the Greens, to label any forced removal of Palestinians from Gaza as ethnic cleansing. She said: \"We have been very clear... about the fact that any, attempt to prevent Gazans from returning home, to prevent them from returning to their communities, to suggest that - for example - they must be housed and remained in other Arab states, any attempt to do that would be contrary to international law.\""
    },
    {
        "title": "'Dangerous climate breakdown' warning as hottest January on record shocks scientists",
        "description": "Last month was the warmest January on record, according to new data.",
        "url": "https://news.sky.com/story/dangerous-climate-breakdown-warning-as-hottest-january-on-record-shocks-scientists-13303929",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-castaic-lake-wildfire_6808091.jpg?20250123074242",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-02-06 08:52:00",
        "Headline": "Temperatures last month were 0.1C above the record set in January 2024. And it comes after a year in which temperatures topped 1.5C, the target for climate negotiations, for the first time.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Last month was the warmest January on record, according to new data. The finding has baffled scientists, who had expected changes in ocean currents in the Pacific to take the edge off rising global temperatures. Figures released by the European Copernicus climate service show average temperatures around the world in January were 1.75C warmer than before greenhouse gas emissions started to rise significantly in the industrial revolution around 150 years ago. That's 0.1C above the record set last January. And it comes after a year in which temperatures topped 1.5C, the target for climate negotiations, for the first time.  Dr Friederike Otto, a climate scientist at Imperial College London, warned that the rising pace of climate change would increase the risk of extreme weather and its consequences. \"This January is the hottest on record because countries are still burning huge amounts of oil, gas and coal,\" she said. \"The Los Angeles wildfires were a stark reminder that we have already reached an incredibly dangerous level of warming. We'll see many more unprecedented extreme weather events in 2025.\" Read more:Role climate change did - and did not - play in California wildfires  January had been expected to be slightly cooler than last year because of a natural shift in weather patterns and ocean currents in the Pacific, called La Nina. But that hasn't been enough to slow the upward trend in temperatures. 'Frankly terrifying'  Bill McGuire, emeritus professor of geophysical & climate hazards at UCL, said: \"The fact that the latest robust Copernicus data reveals the January just gone was the hottest on record - despite an emerging La Nina, which typically has a cooling effect - is both astonishing and, frankly terrifying. \"Having crashed through the 1.5C limit in 2024, the climate is showing no signs of wanting to dip under it again, reflected by the fact that this is the 18th of the last 19 months to see the global temperature rise since pre-industrial times top 1.5C. \"On the basis of the Valencia floods and apocalyptic LA wildfires, I don't think there can be any doubt that dangerous, all-pervasive, climate breakdown has arrived.\" Read more from Sky News:Lab-grown meat for dogs goes on sale'Self-healing roads' could help fix pothole problem The consequences of a warming atmosphere are also being directly felt in the UK, with more intense rainfall increasing the risk of surface flooding. The Environment Agency released figures in December showing 4.6 million properties in England are at risk from flooding as drainage systems are overwhelmed by rainfall. That's a 43% increase on previous estimates. But adapting to a climate change is hugely expensive. The government on Wednesday announced it would spend £2.65bn over two years to shore up existing flood defences and protect an extra 52,000 homes and businesses - a tiny fraction of the number at risk."
    },
    {
        "title": "Nuclear weapon could be used to defend Earth from asteroid 2024 YR4, astronomer says",
        "description": "A nuclear weapon could potentially be sent into space to deflect an asteroid heading Earth's way, an astronomer has told Sky News.",
        "url": "https://news.sky.com/story/nuclear-weapon-could-be-used-to-defend-earth-from-asteroid-2024-yr4-astronomer-says-13304064",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-asteroid-2024-yr4_6814006.jpg?20250206115639",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-06 11:50:00",
        "Headline": "The measure could be taken to divert a space rock being monitored by the European Space Agency, which is expected to cross the planet's orbit in December 2032.",
        "Content": " A nuclear weapon could potentially be sent into space to deflect an asteroid heading Earth's way, an astronomer has told Sky News. Dr David Whitehouse said the measure could be taken against a space rock the size of a football pitch which is being monitored by the European Space Agency (ESA) and could strike the planet in a little over seven years. The asteroid, called 2024 YR4 and measuring 100m by 40m, is currently at a distance of around 27 million miles and is edging away. However, its path will cross our orbit on 22 December 2032 and was initially estimated to have a one in 83 chance of a direct hit. Speaking to Sky News' Kay Burley, Dr Whitehouse said that had now dropped to a one in 67 chance, which he said was \"unacceptable to ignore\". He added: \"I think this has the potential to be very serious indeed.\" In comparison, the astronomer said the chance of winning the lottery was one in 14 million. \"So, we have to keep a close eye on this object because it could turn out to be the most dangerous thing in space,\" he added. Dr Whitehouse explained the \"orbit will be refined\" which will most likely lead to a lower possibility, but experts only have a \"couple of months\" to observe the asteroid before it disappears out of sight until 2028. He said: \"And that's the time we will have to take measures to deflect it. So, we've got some very serious decisions to make. We cannot ignore this rock. \"It's the highest probability of an impact I can recall. And it has the potential, the possibility for being an emergency for planet Earth.\" The Space Mission Planning Advisory Group, which is chaired by the ESA, will discuss the latest observations of the asteroid at a meeting in Vienna next week. If the impact risk is confirmed it will make official recommendations to the United Nations and work may begin on options for a \"spacecraft-based response to the potential hazard\", the agency said in a statement. Dr Whitehouse said emergency deflection measures may need to be considered, including reaching the rock in 2028 in an attempt to nudge it \"slightly out of its orbit\" so that four years later it misses Earth. Just over two years ago, NASA smashed a spacecraft into the 160m-wide asteroid Dimorphos and successfully changed its orbit. Dr Whitehouse said: \"We might even have to consider the severe measures of sending up a nuclear weapon to the surface of this asteroid in order to deflect it further.\" Read more from Sky News:Hottest January on record shocks scientists'Godfather' of AI issues warning over 'superhuman' systems On average, the Earth takes a direct hit from an asteroid of a similar size once every few thousand years. In 1908, a slightly smaller asteroid - thought to have measured 60m across - exploded over Siberia. It flattened 80 million trees over an area of 830 square miles. Dr Whitehouse said: \"I can't stress strongly enough that this is a threat that's not a bit of astro fun, that's not a bit of 'gosh, isn't it amazing?' \"This actually could turn out to be a serious threat to our planet.\""
    },
    {
        "title": "Would your dog eat lab-grown food? Pet treats made from cultivated meat go on sale",
        "description": "Dog treats made from lab-grown chicken have gone on sale at a UK pet retailer in what is being claimed as a world first.",
        "url": "https://news.sky.com/story/would-your-dog-eat-lab-grown-food-pet-treats-made-from-cultivated-meat-go-on-sale-13303862",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-puppy-dog-eating-bowl_6820847.jpg?20250206131608",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-06 01:09:00",
        "Headline": "Manufacturer Meatly has described the treats as a \"giant leap forward\" but there is also competition from rivals keen to exploit a demand from pet owners for more sustainable ingredients.",
        "Content": "Dog treats made from lab-grown chicken have gone on sale at a UK pet retailer in what is being claimed as a world first. The food, developed by Meatly, combines plant-based ingredients with cultivated meat - made by growing a single sample of cells from a chicken egg. The firm says the treat, called Chick Bites, contains all the essential amino acids, critical fatty acids, minerals and vitamins needed for pet health and claims it is \"just as tasty and nutritious as traditional chicken breast\". Pets at Home believes it is the first company in the world to sell cultivated meat for pet food which is produced by growing cells, and does not require the raising or slaughter of animals. Meatly founding chief executive Owen Ensor said: \"It's a giant leap forward, toward a significant market for meat which is healthy, sustainable and kind to our planet and other animals.\" But the company, whose largest investor includes Pets at Home, has competition from rivals keen to exploit a demand from pet owners for more sustainable ingredients. Austrian-American start-up BioCraft has been developing cultivated mouse meat for dogs and cats. \n                  Badger admiring a Banksy scoops wildlife photographer people's choice award\n                 \n                  Scottish government gives update on reports cats could be banned\n                 \n                  Endangered froglets born after dramatic 7,000-mile rescue mission\n                 Part of the challenge for these companies has been that the process is expensive and complex, delaying getting products to market. In May 2024, BioCraft claimed it had managed to slash costs and plans to release its pet food by early 2026. Meanwhile, in February 2024, US firm Hill's Pet Nutrition said it had been collaborating with manufacturer Bond Pet Foods to \"formulate test products\".  Researchers have spent years developing alternatives to animal proteins from traditional livestock farming, which is linked to climate change, biodiversity loss, and water pollution. In August 2024, the UK's innovation agency, UKRI, provided £15m to the National Alternative Protein Innovation Centre (NAPIC) to investigate the health benefits and risks, and what the British public will stomach. Read more from Sky News:Grenfell Tower to be demolishedMet crackdown on phone thievesUK to escalate roll out of nuclear reactors A 2022 survey by UK researchers, published in the PLOS ONE journal, showed the attitudes of consumers towards cultivated meat are complex. The study involving 729 people revealed only 32.5% would eat cultivated meat themselves, but 47.3% would feed it to their pets. In July, UK regulators became the first in Europe to give Meatly approval to produce cultivated meat for use in pet food. Treats are 'game-changer for the industry' Meatly says its products have been through safety testing to ensure its \"cultivated chicken is free from bacteria and viruses\" and the \"product is safe, nutritious, and free from GMOs, antibiotics, harmful pathogens, heavy metals, and other impurities\". A limited release of the Chick Bites dog treats is being sold under the plant-based dog food brand, THE PACK. It will be available at a branch of Pets at Home in Brentford, London from 7 February. Pets at Home CEO Anja Madsen said: \"This innovation has the potential to significantly reduce the environmental impact of pet food and will be a game-changer for the industry\"."
    },
    {
        "title": "TV chef Gino D'Acampo denies dozens of allegations of inappropriate behaviour",
        "description": "TV chef Gino D'Acampo has denied dozens of allegations of inappropriate and intimidating behaviour on the sets of TV shows he has appeared on.",
        "url": "https://news.sky.com/story/tv-chef-gino-dacampo-denies-dozens-of-allegations-of-inappropriate-behaviour-13304383",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gino-dacampo_6821740.jpg?20250206213512",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-06 21:30:00",
        "Headline": "D'Acampo has said he would never do anything to \"distress anyone\" after multiple women accused him of aggressive behaviour and making highly sexualised remarks.",
        "Content": "TV chef Gino D'Acampo has denied dozens of allegations of inappropriate and intimidating behaviour on the sets of TV shows he has appeared on. D'Acampo actions were described as being \"unacceptable\", \"distressing\" and \"horrendous\", according to an ITV News investigation. Anonymous women who spoke to the news broadcaster also accused D'Acampo of aggressive behaviour and making highly sexualised remarks. In a statement to ITV News, D'Acampo has said he \"firmly\" denies the allegations and \"would not do anything that I thought would upset or distress anyone\". He adds: \"I am a father, husband... the suggestion that I have acted in an improper way against is deeply upsetting.\" Sky News has contacted D'Acampo for comment. ITV also reported that bosses at Objective Media Group, the production company behind Gordon, Gino And Fred's Roadtrip in 2018, appear to have been aware of concerns about D'Acampo's behaviour. \n                  Irv Gotti, the founder of Murder Inc Records behind hits with Ashanti and Ja Rule, dies aged 54\n                 \n                  Liam Payne's girlfriend Kate Cassidy says death 'still doesn't feel real' - and reveals why she left him in Argentina\n                 \n                  Steve Coogan avoids driving ban after plea to save new TV show The Trip with Rob Brydon\n                 Objective Media Group said: \"We have robust protocols and procedures in place for all cast and crew, including on-screen talent, that we review regularly whilst also ensuring that we take into account developments regarding industry wide 'Duty of Care' guidelines.\" The production company continued: \"Across all productions we encourage people to raise any concerns at the earliest opportunity... If there are incidents or complaints reported, we implement our Escalation Procedure and ensure that a full and thorough process is followed in close collaboration with the broadcaster.\" Read more from Sky News:Blake Lively and Justin Baldoni's legal battle explainedSteve Coogan avoids driving ban Other production companies that have worked with D'Acampo have also issued statements following the allegations. Studio Ramsay said: \"Whilst we do not disclose or discuss personnel matters publicly, Studio Ramsay is committed, in conjunction with our broadcast partners, to a safe and professional work environment. We take all allegations of inappropriate behaviour and workplace misconduct seriously, promptly investigate, and take appropriate remedial action when warranted.\" MultiStory Media said: \"It would be inappropriate to go into the detail of individual concerns but we give our assurance that we are reviewing the concerns which have been raised, what was known at the time and what action was taken. We will also look at any new concerns that have come to light.\""
    },
    {
        "title": "Irv Gotti, the founder of Murder Inc Records behind hits with Ashanti and Ja Rule, dies aged 54",
        "description": "American music producer Irv Gotti has died at the age of 54.&#160;",
        "url": "https://news.sky.com/story/irv-gotti-the-founder-of-murder-inc-records-behind-hits-with-ashanti-and-ja-rule-dies-aged-54-13304210",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-irv-gotti-2022_6821377.jpg?20250206152533",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-06 15:25:00",
        "Headline": "Gotti produced nearly 30 Hot 100 chart hits in the US for artists including Ashanti, Ja Rule, Ye, DMX, Fat Joe, Mary J Blige and Jay-Z.",
        "Content": "American music producer Irv Gotti has died at the age of 54.  The producer, who founded the hip-hop label Murder Inc Records, produced nearly 30 Hot 100 hits in the US charts for artists including Ashanti, Ja Rule, Ye, DMX, Fat Joe, Mary J Blige and Jay-Z. His death was confirmed by his children - Angie, Sonny and JJ - who posted on his official Instagram page to say that he died on 5 February \"surrounded by his family and friends\". Describing their father as an \"incredible man\" and \"true visionary\", they said he will \"leave behind a legacy that will forever resonate in the hearts of those who knew him and the countless lives he touched\". \"As we navigate this difficult time, we kindly ask for privacy while we grieve the loss of our dad, son, brother, uncle, and friend. We take comfort in knowing that his spirit will live on through his music and the love he shared with all of us,\" the family statement added. Gotti's cause of death has not been revealed. After founding Murder Inc in 1998, Gotti signed Ashanti and Ja Rule as the record label's first artists. Ja Rule landed his first top 40 Billboard Hot 100 hit with Holla Holla from his 1999 debut album Venni Vetti Vecci, while the song Always On Time, which featured both him and Ashanti, became his highest-charting single. Meanwhile, Ashanti's 2002 debut single, Foolish, made her only the second artist to simultaneously occupy spots in the top 10 of the Billboard Hot 100 with her first three charting singles. The label's success skyrocketed, and between 1999 and 2005 Ja Rule had a total of 17 Hot 100 hits. Leading tributes to the producer, Def Jam Recordings - another record label owned by Universal Music Group - posted on social media, writing that Gotti's work \"reshaped the soundscape of hip-hop and R&B\". \"Def Jam Recordings and the extended Def Jam family of artists, executives and employees, are deeply saddened at the loss of Irv Gotti,\" Def Jam said. \"His contributions at Def Jam, as both an A&R executive and in partnership with Murder Inc, helped pave the way for the next generation of artists and producers, a force that reshaped the soundscape of hip-hop and R&B. \"His creative genius and unwavering dedication to the culture behind countless hits, defined an era of music that continues to resonate with fans worldwide.\" Read more from Sky News:Blake Lively and Justin Baldoni's legal battle explainedSteve Coogan avoids driving ban  Ja Rule also posted, sharing two images, one featuring them together, with the caption: \"Love you.\" 50 Cent, who appeared to reference his long-running feud with Gotti, also paid tribute, posting a picture of himself smoking next to a gravestone that read RIP."
    },
    {
        "title": "Liam Payne's girlfriend Kate Cassidy says death 'still doesn't feel real' - and reveals why she left him in Argentina",
        "description": "Liam Payne's girlfriend has said his death was a \"tragic accident\" and he was in \"such a good headspace\" when she left him in Argentina.",
        "url": "https://news.sky.com/story/liam-paynes-girlfriend-kate-cassidy-says-death-still-doesnt-feel-real-and-reveals-why-she-left-him-in-argentina-13303918",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-cassidy-liam_6725512.jpg?20241023171032",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-06 08:23:00",
        "Headline": "The American influencer says the fact Payne has gone still doesn't seem real and that the pair were \"soulmates\".",
        "Content": "Liam Payne's girlfriend has said his death was a \"tragic accident\" and he was in \"such a good headspace\" when she left him in Argentina. Kate Cassidy was with Payne in Buenos Aires but flew back to the US days before the One Direction star was killed in a fall from a hotel balcony. She told The Sun: \"Love is so optimistic, and you just hope that everything will work out at the end. \"Obviously if I knew, if I could see into the future, I would never have left Argentina.\" The American influencer said she had to get back to look after the couple's dog, Nala. \"I had a responsibility, we had a responsibility. We had our dog and obviously I never, ever thought this event would occur,\" she said. Cassidy added: \"It was a tragic accident and no, I never did think [he might die young]. But, you know, we did have our own separate lives - this wasn't the first time we have travelled separately. \"I just never thought this would have happened, that it would turn out the way it did.\" Payne died aged 31 on 16 October from multiple injuries after falling from the third floor of a hotel in the Argentine capital. Three people have been charged with manslaughter over his death, and two with supplying cocaine. Cassidy, 25, said she thinks about Payne \"every second of every day\" and that she'd had a \"childhood crush\" on him since she was 10. The pair got together in 2022 and she told The Sun it still doesn't seem \"fully real for me that he's not here\". \"From the moment I met Liam, I genuinely believed we were soulmates,\" said Cassidy. \"He was the most humble, charming, normal person you could ever hope to come across, and genuinely one of the best people I've ever met in my life.\" She said the Wolverhampton-born singer \"was in such a good headspace\" when she left Argentina. \"We were in such a great place, just full of love; he was so happy and positive. And I just can't even believe the way things truly ended,\" she said. Read more from Sky News:Ozzy Osbourne to reunite with Black SabbathLively and Baldoni's lawyers told to stop discussing cases Cassidy said she was glad she didn't discover he'd died via social media, revealing one of Payne's friends had called her to break the news. \"That moment, it's like blank; it's blacked out in my head,\" she added. \"I didn't believe it at first. I thought it was just a rumour. Or something that somebody made up just to get views.\" Payne's funeral took place in November in Buckinghamshire, with his former bandmates and ex-partner Cheryl among the mourners."
    },
    {
        "title": "Steve Coogan avoids driving ban after plea to save new TV show The Trip with Rob Brydon",
        "description": "Steve Coogan has avoided a driving ban after pleading with the judge that it would impact his upcoming TV show - something he has successfully argued before.",
        "url": "https://news.sky.com/story/steve-coogan-avoids-driving-ban-after-plea-to-save-new-tv-show-the-trip-with-rob-brydon-13303955",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-steve-coogan-the-lost-king_5893721.jpg?20220910025737",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-06 09:42:00",
        "Headline": "Coogan, 59, was caught doing 97mph on the M6 near Telford last summer.",
        "Content": "Steve Coogan has avoided a driving ban after pleading with the judge that it would impact his upcoming TV show - something he has successfully argued before. The Alan Partridge actor, 59, was caught doing 97mph on the M6 near Telford on 29 July last year. Coogan already had six points on his licence - so a further six would have seen him disqualified. But in a letter to Birmingham Magistrates Court, he stressed that a ban would result in the next series of his sitcom The Trip being \"severely impacted\", according to the Evening Standard. \"I am due to appear in a well-established TV series called The Trip (with Rob Brydon) which as the title suggests requires me to drive,\" his letter read. He added that other \"important film commitments\" this year also require him to drive. \"These projects would be severely impacted, not only affecting my own livelihood but also the many individuals dependent on these productions for work,\" he wrote. \"These include camera, sound, and lighting technicians, riggers, and others on modest wages who would face cancellations and financial hardship, as rescheduling such projects is often highly complicated.\" Coogan implored the judge to impose five points instead of six - which after he pleaded guilty - was eventually agreed upon on 30 January. He was also fined £2,500, given a £1,000 surcharge, and forced to pay £90 in costs. He wrote a similar letter in 2019 after he was caught speeding, telling the judge the new series of Alan Partridge would be disrupted if he was disqualified. Ultimately he was banned - but for only two months instead of the usual six - meaning the show could go ahead. Read moreLiam Payne's girlfriend on his deathChelsea striker in courtSpelling error on Southport killer's file He was previously banned for 28 days in 2016 for driving almost twice the 30mph speed limit in Brighton. The Trip's director Michael Winterbottom has previously said there would not be a fifth series - but Coogan's court correspondence suggests otherwise. The series sees Coogan and Brydon playing caricatures of themselves - travelling around the likes of Italy, Spain and the UK."
    },
    {
        "title": "Naomi Campbell says 'shocking facts unearthed' as she fights charity trustee ban - with claim fake email impersonated her",
        "description": "British supermodel Naomi Campbell claims to have uncovered \"shocking\" facts as she fights against her ban on being a charity trustee - including that an email address was used to impersonate her in conversations with lawyers.",
        "url": "https://news.sky.com/story/naomi-campbell-says-shocking-facts-unearthed-as-she-fights-charity-trustee-ban-with-claim-fake-email-impersonated-her-13304165",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-naomi-campbell-fashion-for-relief_6704210.jpg?20241002144401",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-06 14:08:00",
        "Headline": "The supermodel is appealing after she was disqualified from being a trustee of charity Fashion For Relief - after a probe found just a small proportion of the charity's money went to actual good causes.",
        "Content": "British supermodel Naomi Campbell claims to have uncovered \"shocking\" facts as she fights against her ban on being a charity trustee - including that an email address was used to impersonate her in conversations with lawyers. The 54-year-old was one of three people disqualified from being a trustee of Fashion For Relief - a charity she founded in 2005 to help raise money for humanitarian causes - last year. Her removal came as a result of a probe carried out by the Charity Commission that found just a small proportion of the charity's money went to actual good causes. The misconduct included the use of charity funds to pay for Campbell's stay at a five-star hotel in Cannes, France, as well as spa treatments, room service and cigarettes. Fashion For Relief was dissolved and removed from the register of charities last year. Trustees said at the time that hotel costs were typically covered by a donor to the charity, therefore not costing the charity itself, but failed to provide any evidence to support this. Campbell said she was \"extremely concerned\" by the regulator's findings, adding that she was \"not in control\" having \"put the control in the hands of a lawyer\". 'I have fought to uncover the facts' Her case is now due before a tribunal, after Campbell's representatives claim documents that were submitted to the commission gave a false impression of her involvement in running the UK charity. The model also submitted evidence of a fake email account, which she said was used to impersonate her in communications with lawyers. She said she was therefore not made aware of the allegations being made in the Charity Commission's inquiry and did not have the opportunity to answer them. \"I am grateful to the tribunal for allowing me to appeal the Charity Commission's findings after considering the evidence I have submitted,\" Campbell said in a statement. \"Ever since the commission's report, I have fought to uncover the facts. What has been unearthed so far is shocking. \"I want to shine a light on how easy it is to fake identities online and prevent anybody else going through what I have been through. \"I want to ensure that those responsible are held accountable and justice is done.\" The model also said that she will have more to say in due course, adding: \"I have never undertaken philanthropic work for personal gain, nor will I ever do so.\" She also posted a statement on her Instagram page, in which she said the personal toll of the case has been \"immense\". Read more from Sky News:New AC/DC stamps to be releasedLiam Payne's girlfriend says death 'still doesn't feel real' Charity Commission's findings on where money was going The Charity Commission said back in September it had recovered £344,000 and a further £98,000 of charitable funds had been protected. The regulator's inquiry found that, between April 2016 and July 2022, just 8.5% of the charity's overall expenditure was on charitable grants. It also found no evidence that trustees took action to ensure fundraising methods were in the charity's best interests, or that the money it spent was reasonably relative to the income it generated. A Charity Commission spokesman said: \"These are significant allegations for the courts to consider, and we will continue to cooperate fully with the tribunal as it does so.\""
    },
    {
        "title": "Blake Lively and Justin Baldoni's legal battle: What have they accused each other of in rival It Ends With Us lawsuits?",
        "description": "Another lawsuit has been filed in connection with the ongoing legal battle between actress Blake Lively and her co-star&#160;Justin Baldoni.",
        "url": "https://news.sky.com/story/blake-lively-and-justin-baldonis-legal-battle-what-have-they-accused-each-other-of-in-rival-it-ends-with-us-lawsuits-13303947",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-blake-lively-justin-baldoni_6812611.jpg?20250128134249",
        "type": "Entertainment",
        "Author": "Lauren Russell",
        "Date Published": "2025-02-06 14:00:00",
        "Headline": "Both actors filed lawsuits against each other after appearing together in the film It Ends With Us. Since then, even more lawsuits have been filed and a judge has set a date for it all to play out in court at trial. Here, we explain the row so far.",
        "Content": "\n          News reporter\n              @laurenvrussell\n  Another lawsuit has been filed in connection with the ongoing legal battle between actress Blake Lively and her co-star Justin Baldoni. Crisis communications specialist Jed Wallace filed a $7m (£5.6m) defamation suit against Lively after he was named in court papers, as part of her legal fight against an alleged smear campaign to harm her reputation. It is the latest in a series of developments after both actors filed lawsuits against each other following an initial legal complaint from Lively, after the pair worked together on the film It Ends With Us. The dispute between them has been ongoing since December last year - and is pretty complicated. So here is everything you need to know about Hollywood's latest legal off-screen drama, and how it has unfolded so far. Film's release overshadowed by speculation The release of It Ends With Us in August 2024 was somewhat overshadowed by speculation about discord between its two main actors. The film is an adaptation of Colleen Hoover's bestselling 2016 novel and follows Lively's character, Lily Bloom, as she navigates an abusive relationship with Baldoni's character, Ryle Kincaid. Baldoni took a backseat in promoting the film, even though he also directed and produced the project, while Lively took centre stage along with husband Ryan Reynolds, who was on the press circuit for Deadpool & Wolverine at the same time. Baldoni also did not pose for photos with other actors at the premiere and fans noticed that he was not followed by Lively or co-star Jenny Slate on Instagram. Lively appeared to take the brunt of negative media attention around the same time the film was released, with some also criticising her for promoting her own businesses - beverage company Betty Buzz and hair care brand Blake Brown - at the same time. In an interview with NBC News' Today programme, Baldoni touched on the online speculation by broadly saying making a movie involves \"navigating complex personalities\" to get on the same page. He added at the time: \"And mistakes are always made, and then you figure out how to move past them.\" Lively's legal complaint On 21 December, The New York Times published an article called 'We Can Bury Anyone': Inside a Hollywood Smear Machine, which revealed Lively had filed a legal complaint against Baldoni with the California Civil Rights Department. In the complaint, Lively, 37, accused Baldoni, 41, of sexual harassment and alleged that he, along with the studio behind It Ends With Us, embarked on a subsequent \"multi-tiered plan\" to damage her reputation. Concerns raised in the filing included Baldoni showing pictures of nude women to Lively, mentioning his previous porn addiction, and making comments about Lively's weight. Baldoni has denied all the allegations. Tension between the two actors was addressed in a meeting in January 2024, where a new code of conduct for the set of the film was put in place, according to the complaint. Alleged smear campaign As part of the sexual harassment complaint, lawyers representing Lively demanded the release of any messages relating to what they referred to as an attempt to damage the actor's reputation. The complaint claims Baldoni and Wayfarer Studios - the production company behind It Ends With Us - hired a crisis communications firm in order to carry out a \"sophisticated, coordinated, and well-financed retaliation plan\" meant to \"bury\" and \"destroy\" Lively, if she went public with her on-set concerns. She alleges the plan included a proposal to plant theories on online message boards, engineer a social media campaign and place news stories critical of her. It also claimed Baldoni \"abruptly pivoted away from\" the film's marketing plan and \"used domestic violence 'survivor content' to protect his public image\". In messages that were later made public, exchanges between Jennifer Abel, of PR firm RWA Communications, Melissa Nathan, of The Agency Group PR, and Baldoni, appear to discuss the plan. In one exchange Ms Nathan apparently tells Ms Abel: \"We can't write it down to him… We can't write 'we will destroy her'... You know we can bury anyone. But I can't write that to him.\" Lively told The New York Times that she hoped the complaint would help to \"pull back the curtain on these sinister retaliatory tactics to harm people who speak up about misconduct and helps protect others who may be targeted\". These allegations were also strenuously denied by Baldoni, Wayfarer Studios and its representatives. Bryan Freedman, a lawyer representing all three, called the claims by Lively \"completely false, outrageous and intentionally salacious with an intent to publicly hurt and rehash a narrative in the media\". He said the studio had \"proactively\" hired a crisis manager \"due to the multiple demands and threats made by Lively during production\". Baldoni was dropped by his agency, WME, immediately after Lively filed her complaint and The New York Times published its story. The agency also represents both Lively and Reynolds. Baldoni's $250m lawsuit against The New York Times Just before the start of the year, Baldoni sued The New York Times for libel. The lawsuit seeks at least $250m (£199m) in damages and was filed in the Los Angeles Superior Court on the exact same day Lively filed a federal lawsuit against Baldoni, Wayfarer Studios and others - going further than her previous legal complaint. Baldoni, along with others that are named in Lively's lawsuit, accused The New York Times of accepting a \"self-serving narrative\" from the actor in order to write its article 'We Can Bury Anyone': Inside a Hollywood Smear Machine. The lawsuit said the article \"disregard[s] an abundance of evidence\" that contradicts Lively's accusations. The paper responded to the lawsuit by saying it plans to \"vigorously defend\" its reporting. In a statement, it said: \"The role of an independent news organisation is to follow the facts where they lead. \"Our story was meticulously and responsibly reported. It was based on a review of thousands of pages of original documents, including the text messages and emails that we quote accurately and at length in the article.\" Lively was not named as a defendant in the libel lawsuit against the paper. In a statement, lawyers representing the actor said: \"Nothing in this lawsuit changes anything about the claims advanced in Ms Lively's California Civil Rights Department Complaint, nor her federal complaint, filed earlier today.\"  Baldoni sues Lively and Reynolds In a separate lawsuit, filed on 16 January, Baldoni and Wayfarer Studios sued Lively and Reynolds for damages, including lost future income. The suit is seeking at least $400m (£326m) and was filed to a New York court. It alleges Lively and Reynolds hijacked both the production and marketing of It Ends With Us, and manipulated media to smear Baldoni and others on the production with false allegations of harassment. The lawsuit also claims Lively used Baldoni as a scapegoat for her \"publicly tainted image\" and leveraged \"her power as a wealthy celebrity to take creative control of the film\". Baldoni and the studio did not want to take legal action, his lawsuit also says. But it adds that Lively \"has unequivocally left them with no choice, not only to set the record straight […] but also to put the spotlight on the parts of Hollywood that they have dedicated their careers to being the antithesis of\". Responding to the filing, Lively's lawyers, Manatt, Phelps & Phillips and Willkie Farr & Gallagher, accused Baldoni and his team of using a DARVO tactic, which stands for \"deny, attack, reverse victim and offender\". Their statement said: \"This is an age-old story: A woman speaks up with concrete evidence of sexual harassment and retaliation and the abuser attempts to turn the tables on the victim. This is what experts call DARVO. Deny. Attack. Reverse Victim Offender.\" Prospective trial date set Towards the end of January, New York federal judge Lewis J Liman set a trial date of March 2026 for Lively and Baldoni's legal battle. It followed a claim by Lively's legal team that Mr Freedman, the lawyer for Baldoni, was trying to influence potential jurors by creating a website to release selected documents and communications between the pair. Lively's lawyers called for an end to a \"stream of defamatory and extrajudicial media statements\" while Mr Freedman said he and Baldoni would \"respect the court\". \"All we want is for people to see the actual text messages that directly contradict her allegations, video footage that clearly shows there was no sexual harassment and all the other powerful evidence that directly contradicts any false allegations,\" Baldoni's lawyer said. Judge Liman later warned both parties that their comments to the media could impact their cases. The warning was in response to a complaint by Lively's team that Mr Freedman violated professional ethics rules for lawyers by accusing the actress of \"bullying\" in People magazine. Mr Freedman hit back to say his comments to the magazine and on a podcast were a response to The New York Times article back in December, which he said \"completely devastated\" Baldoni. A state ruling that bars most out-of-court statements that could affect a case's outcome - with some exceptions - has now been adopted by Judge Liman. Communications specialist sues Lively  In the latest lawsuit, crisis communications expert Jed Wallace is suing Lively for defamation. Mr Wallace and his company, Street Relations, filed the $7m (£5.6m) case in federal court in Texas on 4 February after Lively accused him of being behind much of the alleged social media manipulation that turned public sentiment against her in the build-up to the release of It Ends With Us. Lively sought to get an order for a deposition - a sworn statement taken from a witness outside of court - from Mr Wallace. But Mr Wallace has now claimed neither he nor his company \"had anything to do with the alleged sexual harassment, retaliation, failure to investigate or aiding and abetting the alleged harassment or alleged retaliation\". Read more from Sky News:Steve Coogan avoids driving banOzzy Osbourne to reunite with Black SabbathHollywood stars set to light up Glasgow Film Festival Mr Wallace is not named in Lively's federal lawsuit but is mentioned in court papers and The New York Times story that started the legal battle between the two actors. Lively's lawyers said in response that Mr Wallace's lawsuit \"is not just a publicity stunt\". \"It is transparent retaliation in response to allegations contained within a sexual harassment and retaliation complaint that Ms Lively filed with the California Civil Rights Department,\" the statement said. \"While this lawsuit will be dismissed, we are pleased that Mr Wallace has finally emerged from the shadows, and that he too will be held accountable in federal court.\""
    },
    {
        "title": "Ancient scrolls near Pompeii were preserved but unreadable - are they now revealing their secrets?",
        "description": "Ancient scrolls charred by a volcanic eruption 2,000 years ago may finally be starting to reveal their secrets.",
        "url": "https://news.sky.com/story/these-ancient-scrolls-were-charred-by-a-volcano-are-they-now-revealing-their-secrets-13303892",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-herculaneum-ancient_6820895.jpg?20250206071908",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-06 06:41:00",
        "Headline": "UK scientists say they have made a historic breakthrough in their efforts to decipher 2000-year-old papyrus scrolls that were burned when Mount Vesuvius erupted.",
        "Content": "Ancient scrolls charred by a volcanic eruption 2,000 years ago may finally be starting to reveal their secrets. UK scientists say they have made a historic breakthrough in their efforts to decipher the artefacts - with the assistance of AI. Hundreds of papyrus scrolls were found in the 1750s in the remains of a lavish villa at the Roman town of Herculaneum, which along with nearby Pompeii was destroyed when Mount Vesuvius erupted in 79AD. While the heat and ash from the volcano was catastrophic for the town, it preserved the scrolls - though in an unreadable state. Scholars and scientists have been working for more than 250 years on ways to decipher the scrolls, which are too fragile to be unrolled physically. In 2023, several tech executives sponsored the \"Vesuvius Challenge\" competition, offering cash prizes for efforts to decipher the scrolls with technology. On Wednesday, the challenge announced a \"historic breakthrough,\" saying researchers had managed to generate the first image of the inside of one of the three scrolls held at Oxford University's Bodleian Library. University of Kentucky computer scientist Brent Seales, co-founder of the challenge, said the organisers were \"thrilled with the successful imaging of this scroll\", saying it \"contains more recoverable text than we have ever seen in a scanned Herculaneum scroll\". Read more from Sky News:'We are no longer living in peacetime': Germany's race to be ready for warOzzy Osbourne to reunite with Black Sabbath The scroll was scanned by Diamond Light Source, a lab in Harwell, near Oxford, by using a particle accelerator known as a synchrotron to create an intensely powerful X-ray. AI was then used to piece together the images, searching for ink that reveals where writing is located. A 3D image of the scroll can then be formulated that allows experts to unroll it virtually. Little of the text has been deciphered so far. One of the few words that has been made out is the ancient Greek for \"disgust\". Peter Toth, a curator at the Bodleian Library, said: \"We need better images, and they are very positive and very, very confident that they can still improve the image quality and the legibility of the text. \"And then don't forget that there is like 1,000 more scrolls in Naples.\""
    }
]