[
    {
        "title": "Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%",
        "description": "Asian markets have reacted positively after Donald Trump paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days, despite the US president increasing those on China to 125%.",
        "url": "https://news.sky.com/story/trump-pauses-higher-tariffs-for-most-countries-for-90-days-but-increases-those-on-china-to-125-13345402",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald-trump_6881341.jpg?20250409224259",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-09 19:00:00",
        "Headline": "Global markets bounced back following the US president's announcement, which he said came after people \"were getting a little bit yippy, a little bit afraid\".",
        "Content": " Donald Trump has paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days - while increasing those on China to 125%. There have been fears of a global recession and stock markets around the world had plummeted after Mr Trump announced his \"Liberation Day\" tariffs on Wednesday 2 April. However, the S&P 500 stock index jumped 9.5% and global markets bounced back following Mr Trump's announcement on Wednesday that the increased tariffs on nearly all trading partners would now be paused. Tariffs latest: Trump gives reasons for pausing some tariffs In a post on his Truth Social platform, Mr Trump said the \"90-day pause\" was for the \"more than 75 countries\" who had not retaliated against his tariffs \"in any way\". He added that during this period they would still have to pay a \"substantially lowered\" 10% tariff, which is \"effective immediately\". It is lower than the 20% tariff that Mr Trump had set for goods from the European Union, 24% on imports from Japan and 25% on products from South Korea. The UK was already going to face a blanket 10% tariff under the new system. Mr Trump said the increased 125% tariff on imported goods from China was \"effective immediately\". He added: \"At some point, hopefully in the near future, China will realise that the days of ripping off the USA, and other countries, is no longer sustainable or acceptable.\" Here's what Donald Trump's tariff pause entails: 'Reciprocal' tariffs on hold  • Higher tariffs that took effect today on 57 trading partners will be paused for 90 days  • These include the EU, Japan and South Korea, all of which will face a baseline 10% duty instead  • Countries that already had a 10% levy imposed since last week - such as the UK - aren't affected by the pause\n China tariffs increased \n • Trump imposed a higher 125% tariff on China \n • That's in addition to levies he imposed during his first term \n • China had hit the US with 84% tariff earlier today, following tit-for-tat escalations\n No change for Canada or Mexico \n • Canadian and Mexican goods will remain subject to 25% fentanyl-related tariffs if they don't comply with the US-Mexico-Canada trade agreement's rules of origin\n • Compliant goods are exempt\n Car and metal tariffs remain \n • Trump's pause doesn't apply to the 25% tariffs he levied on steel and aluminium in March and on cars (autos) on 3 April \n • This 25% tariff on car parts does not come into effect until 3 May\n Sectors at risk \n • Copper, lumber, semiconductors, pharmaceuticals and critical minerals are expected to be subject to separate tariffs, in the same way autos are Hours after Mr Trump announced the pause on tariffs for most countries, a White House official clarified that this did not apply to the 25% duties imposed on some US imports from Mexico and Canada. The tariffs were first announced in February and Mexico and Canada were not included in the \"Liberation Day\" announcements.  Hours before the 125% tariff on China was revealed, Beijing said it was increasing tariffs on US goods by 50%. It meant tariffs of 84% would be enforced on US goods - up from the 34% China had previously planned. China 'want to make a deal' Asked why he posted \"BE COOL\" on Truth Social hours before announcing his tariff pause, Mr Trump told reporters at the White House: \"I thought that people were jumping a little bit out of line.\" \"They were getting yippy, you know, were getting a little bit yippy, a little bit afraid,\" he added. Mr Trump continued: \"China wants to make a deal, they just don't know how to go about it. \"[They're] quite the proud people, and President Xi is a proud man. I know him very well, and they don't know quite how to go about it, but they'll figure it out. \"They're in the process of figuring out, but they want to make a deal.\" Read more:Why Trump finally blinkedIs there method to madness amid market chaos?Who's most likely to see pensions hurt White House press secretary Karoline Leavitt said the walk back was part of a grand negotiating strategy by Mr Trump. \"President Trump created maximum negotiating leverage for himself,\" she said, adding that the news media \"clearly failed to see what President Trump is doing here\". US Treasury Secretary Scott Bessent also insisted Mr Trump had strengthened his hand through his tariffs. \"President Trump created maximum negotiating leverage for himself,\" he said. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Bessent said Mr Trump decided to raise tariffs on China because Beijing hadn't reached out to the US and instead increased its own levies on US goods. Downing Street said that the UK will \"coolly and calmly\" continue its negotiations with the US. A Number 10 spokeswoman said: \"A trade war is in nobody's interests. We don't want any tariffs at all, so for jobs and livelihoods across the UK, we will coolly and calmly continue to negotiate in Britain's interests.\""
    },
    {
        "title": "'We're living a life sentence': Family of man killed by psychiatric patient demand answers",
        "description": "A grief-stricken family has told Sky News they want \"someone to take accountability\" for the death of Lewis Stone, a retired butcher who was killed by a secure psychiatric unit patient released 10 days earlier.",
        "url": "https://news.sky.com/story/were-living-a-life-sentence-family-of-man-killed-by-psychiatric-patient-demand-answers-13345081",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lewis-stone-david-fleet_6880774.jpg?20250409125744",
        "type": "Home",
        "Author": "Mark Thompson, health producer",
        "Date Published": "2025-04-09 11:18:00",
        "Headline": "The family of Lewis Stone is fighting Hywel Dda health board in west Wales, which is refusing to release an internal report into his killer's psychiatric care. ",
        "Content": "By Mark Thompson, health producer   A grief-stricken family has told Sky News they want \"someone to take accountability\" for the death of Lewis Stone, a retired butcher who was killed by a secure psychiatric unit patient released 10 days earlier. In her first TV interview, Mr Stone's step-daughter Vicki Lindsay said they were calling for an internal NHS Trust report to be made public so that lessons can be learned. \"The thought of anybody going through what we've gone through for the last six years… We're living a life sentence,\" she said. On 28 February 2019, Lewis Stone was where he loved being most - the remote town of Borth on the west coast of Wales near Aberystwyth. It's where he and his wife, Elizabeth, had a holiday home and planned to retire. That morning, Lewis left for his daily pre-breakfast walk with his beloved dog Jock along the River Leri and never came home. He had been stabbed multiple times, and despite repeated attempts to save his life, he died in hospital three months later. Lewis's killer, David Fleet, was sectioned under the Mental Health Act after admitting manslaughter with diminished responsibility. \n                  Parents of boy whose outbursts left them fearing for their lives say Adolescence 'touched a nerve'\n                 \n                  Happiest country in the world revealed - and one where a stranger's most likely to return a lost wallet\n                 \n                  Nottingham attacks wouldn't have happened if authorities had listened, says family of man killed months earlier\n                 Sentencing, Judge Paul Thomas QC said Lewis had been in the wrong place at the wrong time. Lewis's family disagrees: \"I just want somebody to say, 'Yes, we messed up, we're sorry. It doesn't change things but we're sorry'. \"We've had none of that. Mum's had nothing, no support, she's had nothing. That's all we want, an admission.\" Fleet was suffering from paranoid schizophrenia at the time of the attack and told psychiatrists if he had not stabbed Mr Stone, the voices in his head \"were going to kill him\". Four months earlier, he had been detained under the Mental Health Act, but despite concerns raised by his own family, it was decided he should be treated at home. The Hywel Dda health board told Sky News they don't intend to release the internal report into Fleet's care. Read more from Sky News:Why Netflix's Adolescence 'touched a nerve'Mental health services under pressureNHS trust accused of mental health failings Sharon Daniel, the Interim Executive Director for Nursing, Quality and Patient Experience, said: \"The Duty of Candour for patients came into force in Wales in April 2023. At the time of this incident and concern, we fulfilled our duties to be open.\" When asked if they would be willing to apologise to both affected families, Ms Daniel said: \"In the event of serious incidents, we have robust processes in place for reviewing internally, identifying any issues, and where appropriate preparing an improvement plan to prevent such an occurrence in the future. We regret such incidents and always seek to learn from them.\" In February, victims' families in Nottingham won their fight for an NHS review into the care of paranoid schizophrenic Valdo Calocane, who killed three people, to be made public. It exposed a catalogue of errors and systemic failings.  The family's adviser and former NHS lawyer Radd Seiger, who also advised the Nottingham families, told Sky News the two cases have striking similarities: \"Sunlight is the best disinfectant when there are problems in the NHS. \"Let's have these things out in the open. Yes, they're uncomfortable, but that's the only way the NHS is going to learn from its mistakes. \"It's no good them marking their own homework in private where journalists, or lawyers, or families don't get to scrutinise these things because we see that these things keep happening over and over and over.\" David Fleet's family declined an opportunity to speak to Sky News for this report. The Welsh government said: \"We are fully committed to openness and transparency in line with the Duty of Candour to ensure lessons are learned. We have also invested in improving both the quality and safety of mental health care in Wales.\""
    },
    {
        "title": "Inside a NATO base in Poland - as residents bordering Russia say 'scare tactic' is needed",
        "description": "Along the thin strip of beach and woodland known as the Vistula Spit which marks the northernmost demarcation between Poland and the Russian exclave of Kaliningrad, there is not much in the way of a border.",
        "url": "https://news.sky.com/story/inside-a-nato-base-in-poland-as-residents-bordering-russia-say-scare-tactic-is-needed-13345509",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-control-room_6881378.jpg?20250409230534",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-04-09 21:42:00",
        "Headline": "We've been granted access to one of the cornerstones of Polish, and European defence, which is a couple of hours drive from the Vistula spit at the Redowicze military base.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Along the thin strip of beach and woodland known as the Vistula Spit which marks the northernmost demarcation between Poland and the Russian exclave of Kaliningrad, there is not much in the way of a border. Just some torn wire fencing and a few rotten posts which seem to stagger drunkenly into the shallows of the Baltic Sea. Beneath a sign barring entry, we find a couple of empty bottles of Russian cognac and vodka. It doesn't feel like the edge of NATO territory. \"I don't see much protection. It's not good,\" says Krzysztof from Katowice, who has come to inspect the border himself. \"We have to have some kind of scare tactic, something to show that we are trying to strengthen our army,\" says Grzegorz, who lives nearby. \"At the same time I think I would not base the defence of our country solely on our army. I am convinced that Europe or America, if anything were to happen, will help us 100%.\" \n                  Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US\n                 \n                  Watch as Donald Trump meets NATO chief at White House\n                 \n                  US 'destroying' international rules-based order by trying to meet Russia 'halfway', Ukraine's UK ambassador warns\n                 Poland is investing massively in its defence, with military spending set to hit 4.7% of GDP in 2025, more than any other NATO country. Polish Prime Minister Donald Tusk has said he will introduce voluntary military training for men of any age, and women too should they wish, so the army has a competent reserve force in the event of war. He is investing $2.5bn in stronger border fortifications between Russia and Belarus, a project called East Shield which will include anti-tank obstacles, bunkers and potentially minefields too. Along with its Baltic neighbours, Poland is withdrawing from the Ottawa convention against the use of land mines. It hasn't committed to using them, but it wants to have that option. We've been granted access to one of the cornerstones of Polish, and European defence, which is a couple of hours drive from the Vistula spit at the Redowicze military base. Aegis Ashore Poland, together with its sister site in Romania, are the land-based arms of NATO's missile defence shield over Europe, which is run by the US navy. They are symbols of the US commitment to NATO and to the protection of Europe. And despite changes at the top of the Pentagon it is \"business as usual\", says Captain Michael Dwan who oversees air and missile defence within the US Sixth Fleet. \"Our mission to work with NATO forces has been unchanged. And so our commitment from the United States perspective and what capability we bring to ballistic missile defence and the defence of NATO is championed here in Poland.\" As far as Russia is concerned, NATO's two missile defence bases in Romania and Poland represent a NATO threat on their doorstep and are therefore a \"priority target for potential neutralisation\", per Russia's foreign ministry. NATO says the installations are purely defensive and their SM-3 interceptor missiles are not armed and are not intended to carry warheads. Russia counters they could easily be adapted to threaten Russia. Not the case, Captain Dwan says. Read more from Sky News:King and Queen meet Pope at the VaticanBritish passports are about to get more expensive \"It's not a matter of moving offensive weapons here into the facility, the hardware and the infrastructure is simply not installed. \"It would take months or years to change the mission of this site and a significant amount of money and capability and design.\" With so much marked \"secret\" on the site, it seems amazing to be granted the access. But for NATO, transparency is part of deterrence. They want potential adversaries to know how sophisticated their radar and interception systems are. They know that if they carried warheads on site, that would make them a target so they don't. Deterrence also depends on whether potential adversaries believe in the US's commitment to NATO and to Europe's defence. On an operational level, as far as the troops are concerned, that commitment may still be iron-clad. But as far as its commander-in-chief goes, there is still - as with so much around Donald Trump's presidency - a great deal of uncertainty. In the Oval Office on Wednesday afternoon President Trump suggested he might bundle a potential US troop drawdown in Europe together with the issue of EU trade and tariffs. \"Nice to wrap it up in one package,\" he said, \"it's nice and clean\". Probably not the way Europe sees it, not with a resurgent Russia on their doorstep, economic tailwinds breeding animosity and the notion of Pax Americana crumbling at their feet."
    },
    {
        "title": "New at-home spit test for prostate cancer could be better than blood test, study suggests",
        "description": "A new spit test for prostate cancer which can be done at home may be better than current testing methods, a study suggests.",
        "url": "https://news.sky.com/story/new-at-home-spit-test-for-prostate-cancer-could-be-better-than-blood-test-study-suggests-13345537",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prostate-cancer-brothers_6881406.jpg?20250410020108",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-09 23:31:00",
        "Headline": "Experts have developed a simple saliva test which analyses genetic variants in a man's DNA which appears to perform better than the current method for assessing prostate cancer risk.",
        "Content": "A new spit test for prostate cancer which can be done at home may be better than current testing methods, a study suggests. Experts have developed a simple saliva test which analyses genetic variants in a man's DNA, which appears to perform better than the current method for assessing prostate cancer risk. Currently, the prostate-specific antigen (PSA) blood test is used to check for prostate conditions, including prostate cancer or an enlarged prostate. Routine testing is not currently available on the NHS, but patients may be offered a PSA test if a GP suspects they have prostate cancer. Men over 50 can ask their GP for a PSA test even if they do not have symptoms. But experts have said the new saliva test could be used as an additional screening tool, as it reduced the number of false positive results and detected a higher proportion of aggressive cancers than the PSA test. It could lead to fewer men being sent for unnecessary testing, according to researchers at The Institute of Cancer Research, London, and The Royal Marsden NHS Foundation Trust. They tested the effectiveness of a new tool they had developed called a polygenic risk score, which uses spit to assess 130 genetic variants known to be associated with an increased risk of prostate cancer, which can then determine whether or not a person is at high risk of the disease. Test saved lives of two brothers Taking part in the trial saved the lives of two brothers. Dheeresh Turnbull said traditional methods to assess prostate cancer deemed he had a low risk of disease, but the new spit test helped the 71-year-old discover he actually had a life-threatening tumour in his prostate. After finding out the news, his brother Joel Turnbull also took part in the study and discovered he had an aggressive prostate tumour. \"It's incredible to think that because of this study two lives have now been saved in my family,\" Dheeresh said. Read more science and tech news:'Concerning' levels of E.coli found in ThamesWatchdog to investigate 'suicide forum'Wolf extinct for 10,000 years brought back to life How the tool was assessed The brothers were among 6,300 men aged 55 to 69 in the UK who were assessed by the tool as part of the study. Of those, 745 (12%) were deemed to have a high risk score and were invited to have prostate cancer screening, including an MRI scan and a biopsy. Prostate cancer was detected in 187 of the 468 who took up the offer, and of those, 103 had cancer that was deemed to be \"higher risk\", so treatment was offered. Of the 187 men, 118 had a PSA level below 3.0ug/L - which is considered \"normal\" and would typically indicate no further screening is required. Test could 'turn the tide on prostate cancer' Writing in the New England Journal of Medicine, the researchers said cancer \"would not have been detected\" in 74 of the men using the \"diagnostics pathway\" currently in use in the UK - which includes a high PSA level and an MRI. They concluded that for the men with the highest genetic risk, the test falsely identified fewer people with prostate cancer than the PSA test and picked up people with cancer who would have been missed by the PSA test alone. It detected a higher proportion of aggressive cancers than the PSA test and also accurately identified men with prostate cancer who were missed by an MRI scan. Professor Ros Eeles, from the Institute of Cancer Research, London, and The Royal Marsden NHS Foundation Trust, said: \"With this test, it could be possible to turn the tide on prostate cancer. \"We have shown that a relatively simple, inexpensive spit test to identify men of European heritage at higher risk due to their genetic make-up is an effective tool to catch prostate cancer early. Some 55,000 cases of prostate cancer are diagnosed each year in the UK, with around 12,000 men in the UK dying from the disease annually, according to Cancer Research UK. It comes after Health Secretary Wes Streeting suggested he would support a national prostate cancer screening programme for men at higher risk of disease if it is backed by the evidence. The UK's National Screening Committee is currently assessing whether or not such a programme should be rolled out."
    },
    {
        "title": "Local elections: From where they are to what they're all for - your ultimate guide",
        "description": "A host of local and mayoral elections will be taking place across England on Thursday 1 May - the first voting day since the general election last year.",
        "url": "https://news.sky.com/story/local-elections-from-where-they-are-to-what-theyre-all-for-your-ultimate-guide-13344978",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-kemi-b_6880711.jpg?20250409111716",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-09 08:39:00",
        "Headline": "Votes for a new MP, several mayors and almost two dozen local authorities are all coming at the start of next month. Here's everything you need to know.",
        "Content": "A host of local and mayoral elections will be taking place across England on Thursday 1 May - the first voting day since the general election last year. There will also be a new Member of Parliament. Here is everything you need to know - from what's at stake to how you can vote. There will be local elections in 23 of England's 317 local authorities on 1 May. Some are slightly different to others, depending on the type of authority. Here is the full list: County councils • Cambridgeshire• Derbyshire• Devon• Gloucestershire• Hertfordshire• Kent• Lancashire• Leicestershire• Lincolnshire• Nottinghamshire• Oxfordshire• Staffordshire• Warwickshire• Worcestershire Unitary authorities  • Buckinghamshire• Cornwall• County Durham• North Northamptonshire• Northumberland• Shropshire• West Northamptonshire• Wiltshire Metropolitan district • Doncaster The Isles of Scilly, which has a unique governance structure, is also holding a local election of its own. Additionally, about 1,270 parish councils will be holding elections. A county council is part of a two-tier local government system, taking care of things that affect the whole county, such as: • Education• Transport• Planning• Fire and public safety• Social care• Libraries• Waste management• Trading standards They work alongside the other, lower-tier councils - district, borough or city - that take care of things on a smaller scale, such as: • Rubbish collection• Recycling• Council tax collections• Housing• Planning applications A unitary authority is a one-tier local government, where the services of a county council and the other smaller councils listed above are combined. A metropolitan district has a council that oversees all services, similar to a unitary authority - but has a mayor with a role similar to that of local councils. The mayors for Doncaster and North Tyneside are single authority, making them the political leader of the council and leaving them responsible for delivering local council services. Metro mayors chair combined authorities made up of several local councils. There are six mayoral elections taking place on 1 May, two of which are the first ever in their areas. One of them is for the West of England, where the current mayor is Dan Norris, who was elected as a Labour MP when he defeated Jacob Rees-Mogg to win the seat of North East Somerset and Hanham in last year's general election. Mr Norris, who has been mayor since 2021, has to vacate the role because the Labour Party introduced rules to prevent serving MPs from standing as mayoral candidates. There is another mayoral election in Cambridgeshire and Peterborough, while the first mayors for Hull and East Yorkshire and Greater Lincolnshire will be chosen after devolution deals were agreed in 2023, bringing together local councils in both areas to create larger authorities. There will also be elections for the next mayor of Doncaster and North Tyneside. A by-election is also being held in Runcorn and Helsby after Labour's Mike Amesbury agreed to stand down following his conviction for punching a man in the street. Amesbury, who was suspended from the Labour Party, was jailed on 24 February for 10 weeks after he pleaded guilty to assault by beating of 45-year-old Paul Fellows in Main Street, Frodsham, Cheshire, in the early hours of 26 October. However, following an appeal, his sentence was suspended for two years.  His resignation means Karen Shore, the deputy leader of Cheshire West and Chester Council, will run for Labour in the by-election, while the Conservatives are putting forward Sean Houlston, a membership services manager for the National Federation of Builders, and Sarah Pochin, a former Cheshire East councillor, is Reform's candidate. Amesbury came first in Runcorn and Helsby with 22,358 votes at the 2024 general election - equating to 52.9% of the electorate. Reform UK came in second with 7,662 votes (18.1%) and the Tories in third with 6,756 votes (16%). The elections will be the first big test of all the parties since the general election, which fundamentally redrew the UK's political landscape with a new world of multiparty politics. The Tories have the most to lose as they hold 20 of the 23 local authorities up for grabs on 1 May. And for the first time in a long time, Labour and the Conservatives are facing a genuine threat from other parties. YouGov conducted exclusive polling for Sky News to get a sense of how the country was feeling ahead of the elections, surveying 2,178 adults in the UK on 6 and 7 April. Here is the voting intention poll: • Labour: 24% (no change)• Reform UK: 23% (no change)• Conservatives: 22% (+1)• Liberal Democrats: 17% (+3)• Green Party: 9% (-2) It suggests that Nigel Farage's Reform UK could be Labour's closest competitor, with Kemi Badenoch trailing as she leads the Conservatives through elections for the first time, while the Lib Dems have closed the gap on the three top parties. Read more:Why is assisted dying so controversial - and where is it legal?Highs and lows of Five-Year Keir You have until 11.59pm on Friday to register to vote if you haven't already. You must be aged 16 or over (or 14 or over in Scotland and Wales) to register to vote - but to vote for a new MP you must be at least 18. You can register if you are: • A British citizen• An Irish or EU citizen living in the UK• A Commonwealth citizen who has permission to enter or stay in the UK, or who does not need permission• A citizen of another country living in Scotland or Wales who has permission to enter or stay in the UK, or who does not need permission• You can be an overseas voter if you previously lived in the UK and are a British citizen. The easiest and quickest way to register is online. Alternatively, you can use a paper form - though it may be too close to the deadline for you to complete this by the deadline. You can do it by contacting your local Electoral Registration Office and asking them to post a form to you. Or you can print your own form off. You'll then need to return the completed form to your local Electoral Registration Office. There are three ways to vote: In person at your local polling station You'll be sent a poll card just before an election or referendum telling you when to vote and at which polling station. It will usually be in a public building, such as a school or local hall, near your home. You can only vote at the polling station allocated to your address. This will be shown on your poll card. You can also enter your postcode on this website to find out where your polling station is. You will be able to cast your vote any time between 7am and 10pm You must bring a form of photo ID with you in order to vote. There are 22 accepted types of ID. At the polling station, you will need to give your name and address to staff and show them your photo ID. There will be instructions in the polling booth telling you exactly how to cast your vote. Postal vote You can register to vote by post for any reason, including that you simply don't want to go to a polling station on the day. You need to apply for this by 5pm on 14 April and can do so by clicking here. Postal votes now expire every three years, so if you registered to do so more than three years ago, you will need to re-apply. By proxy This is where you apply for someone to vote on your behalf if you cannot go to the polling station in person and do not want to or can't vote by post. You and your proxy must both be registered to vote in the UK before you can apply. The deadline to apply for proxy voting in the May 1 elections is 5pm on 23 April, and you can apply here. Elections for county councils in the following areas have been postponed until May 2026: • Norfolk• Suffolk• Essex• Thurrock• Surrey• East and West Sussex• Hampshire• Isle of Wight Most areas of the UK are now covered by one-tier systems such as unitary authorities, but there are still 21 county councils. The government is pushing for a \"devolution revolution\", meaning the remaining county councils are being encouraged to merge with other local authorities to become unitary authorities. So in December last year, the government told county councils they could request to postpone their elections set for 1 May if they were trying to reorganise into one-tier systems. While 16 county councils requested to postpone, only the eight listed above were successful."
    },
    {
        "title": "Daughter's plea for help to solve mother's murder 30 years ago",
        "description": "A woman whose mother's murder has been unsolved for 30 years has issued a plea for help in finding her killer.",
        "url": "https://news.sky.com/story/daughters-plea-for-help-to-solve-mothers-murder-30-years-ago-13345302",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-janet-brown-radnage_6881122.jpg?20250409180537",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-09 16:47:00",
        "Headline": "Police believe DNA evidence could help trace Janet Brown's killer after she was gagged, handcuffed and beaten to death at the family home in the village of Radnage, Buckinghamshire in 1995.",
        "Content": "A woman whose mother's murder has been unsolved for 30 years has issued a plea for help in finding her killer. Mother-of-three Janet Brown, 51, was bludgeoned to death at her home in Radnage, Buckinghamshire, on 10 April 1995. Thames Valley Police (TVP) has a DNA sample from the scene that they believe belongs to the murderer but does not match anyone on the police database. More than 1,000 men have been screened and eliminated from the inquiry by the investigation team. A reward of £20,000 is on offer for information given to Crimestoppers that leads to the arrest and conviction of the killer. Mrs Brown, a medical researcher at the John Radcliffe Hospital in Oxford, was found dead at the foot of the stairs naked, gagged and handcuffed. But detectives believe there was no sexual motive to the killing, and while the house was searched, nothing was stolen. Mrs Brown's oldest daughter, Zara Harden, said it was \"baffling\" why anyone would target her mother, but is convinced \"somebody must know something because there would have been a lot of blood\". \n                  Man with knife who 'moved at speed' towards police officers before he was shot dead in Milton Keynes named\n                 \n                  Mantas Vanagas: 'Dangerous' predator jailed for abusing four men - including raping sleeping victim\n                 \n                  Man shot dead by armed police at Milton Keynes railway station\n                 \"She was handcuffed and beaten badly, literally bludgeoned to death. It doesn't matter if a person didn't come forward at the time. It's not too late,\" she added. On the night she was murdered, Mrs Brown's three children Zara, Benedict and Roxanne were not at home while her husband Dr Grahaem Brown was in Switzerland working. The killer initially tried to cut a hole in the glass of a double-glazed patio door before smashing his way in. It is believed Mrs Brown was killed between 8.15pm and 10.15pm that night. Her body was found the following morning by a builder and his son who were due to carry out work at the house. Mrs Harden said: \"Ultimately her killer, or killers, have so far gotten away with it. \"We want to see them prosecuted, and not to have somebody who is extremely dangerous still be out there on the loose... we just want to stop it happening again.\" The head of Thames Valley Police's Major Crime Investigation Review Team, Peter Beirne, said: \"I still believe there are people who have information or suspicions about this vicious murder. \"We have a DNA profile that was left at the scene. It does not belong to the family, and we believe it could be a vital piece of evidence linking the killer to the scene. \"If you have suspicions, it is very easy for our team to trace and request a DNA sample from the person you suspect, or a relative of theirs if they have perhaps passed away or have emigrated.\""
    },
    {
        "title": "Prince William brings son George to Aston Villa's Champions League quarter-final clash with PSG - and chats to pundits",
        "description": "Prince William has said bringing his son George to Aston Villa's Champions League quarter-final match in Paris was a \"big deal\" - before seeing their side lose 3-1 in the first leg of the tie.",
        "url": "https://news.sky.com/story/prince-william-brings-son-george-to-aston-villas-champions-league-quarter-final-clash-with-psg-and-chats-to-pundits-13345466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-william-villa_6881319.jpg?20250409221456",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-09 20:46:00",
        "Headline": "The future king says he was wearing his \"lucky clothes\" for the match - but Villa ended up losing 3-1 in the first leg of the quarter-final tie in Paris.",
        "Content": "Prince William has said bringing his son George to Aston Villa's Champions League quarter-final match in Paris was a \"big deal\" - before seeing their side lose 3-1 in the first leg of the tie. Speaking to pundits Ally McCoist and Rio Ferdinand ahead of Villa's match against Paris Saint-Germain, William said he was \"pretty terrified\" and \"nervous\". He said he was \"wearing all my lucky clothes\", before being pictured punching the air and hugging his 11-year-old son as he celebrated Morgan Rogers giving Villa a first-half lead. The Premier League club, however, ended up losing to PSG as the two teams faced off in Parc des Princes. William said he had predicted a 2-1 victory for Villa. Asked by former England defender Ferdinand if he was on a \"lads tour\" to the match with friends, William replied: \"Well, I've got my son here as well, so I'm on best behaviour as well. \"But I thought: You know what, it's been 43 years since anything like this has happened in my generation as a Villa fan, and I want George to experience a night out away from home in a big European competition. \"I hope it's not 43 years until the next one happens, but I think those memories are really important to create and bringing him along tonight is a big deal for me.\" \n                  Prince William meets Clarkson's Farm star to discuss challenges the industry is facing\n                 \n                  Why increasing number of farmers are at crisis point - and Prince William is being urged to 'speak up'\n                 \n                  Prince William joins British troops in Challenger 2 tank on visit to Estonia\n                  Read more from Sky News:Meghan reveals 'rare' medical condition after childbirthHarry's 'life at stake' in security case, court hears The TNT Sports pundits went on to ask William if he would make his children, who besides George include Charlotte, nine, and Louis, aged six, support Villa. \"I'm generally very open to whoever they support, but obviously I'm a bit biased,\" the prince said. \"But also they come to games with Villa. They're going to probably support Villa, but I've left the other two at home, probably watching tonight, so we'll wait and see who they support,\" he added. The royal hugged some of Villa's players, including Marco Asensio and England international Marcus Rashford as they came out of the dressing room. After William discussed Villa's tactics and the \"intensity\" of PSG's press, former Manchester United defender Ferdinand joked: \"Do not go for a punditry job, please, because I could be out of the game. \"The way he just dissected that there, I'm going to nick that for later on.\""
    },
    {
        "title": "Fewer criminals set to be jailed, say reports as prisons in England and Wales struggle with overcrowding",
        "description": "Ministers want reforms to sentencing policy that will reduce the prison population by more than ten percent, Sky News has learnt.",
        "url": "https://news.sky.com/story/fewer-criminals-set-to-be-jailed-say-reports-as-prisons-in-england-and-wales-struggle-with-overcrowding-13345162",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-prisons-overcrowding_6553274.jpg?20240513215025",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-09 13:14:00",
        "Headline": "Sky News understands an independent policy review will suggest restricting the use of short sentences, deploying alternatives to custody and imprisoning fewer women.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Ministers want reforms to sentencing policy that will reduce the prison population by more than ten percent, Sky News has learnt. The sentencing review is under pressure to deliver recommendations that will send 9,500 fewer people to jail by 2028. The independent review of sentencing policy, being led by former Justice Secretary David Gauke, will submit its findings to the government next month. There are currently 87,938 people in prison in England and Wales. The male estate is almost full again, operating at more than 99% capacity, with emergency measures triggered to hold offenders in police cells as jails run out of space. Government projections suggest the prison population will increase to more than 100,000 inmates by 2029. In an indication of how serious the current situation has become, Sky News has been told of prison governors getting messages directly from court officials outside of working hours, asking them to free up space in order to send new prisoners to jail.  The sentencing review panel is expected to make suggestions around the impact of short sentences, greater use of alternatives to prison custody and possible steps to reduce the number of women behind bars. \n                  Daughter's plea for help to solve mother's murder 30 years ago\n                 \n                  Parents of boy whose outbursts left them fearing for their lives say Adolescence 'touched a nerve'\n                 \n                  Man charged with murder of 16-year-old boy in Huddersfield - as victim named\n                 But sources close to the review process suggest that the scrapping of short sentences will only deliver \"hundreds\" of free spaces, with more radical changes to sentencing practises needed to ease overcrowding. Certain crimes are outside the scope of the review - such as murder - but reforms being considered could see other serious offenders serve less time in prison. It's understood the sentencing review panel has met with relevant authorities for feedback, and there is nervousness amongst the police about the additional number of people that will need to be managed in the community. Authorities support the need for a review of sentencing, with shifts away from custodial terms for some offenders to solve the prisons crisis, but changes will increase policing pressures. The review will also consider other examples of policy and penal systems from around the world. Read more from Sky News:Jenrick: Sentencing 'two-tier' justiceRising prison numbers overwhelming jails On a recent trip to Texas, the justice secretary saw how offenders earned 'good behaviour' credits, giving inmates the ability to serve less time behind bars by participating in work or courses. David Gauke had also previously pointed to the use of open prisons in Spain, where 25% of offenders are housed in lower security jails, with inmates able to leave prison for study and work during the day. The capacity problems in England and Wales are more acute in the higher security, or 'closed', estates, so greater use of open prisons would help ease overcrowding. But there are concerns among open prison governors that high-risk offenders are being sent to open prisons when they shouldn't be, for capacity reasons. A Ministry of Justice spokesperson said: \"The government inherited overcrowded prisons on the point of collapse - we introduced emergency measures and were clear that longer term action was required. \"Alongside our commitment to build 14,000 prison places, we will carefully consider all recommendations by the independent Sentencing Review to ensure we never run out of space again.\""
    },
    {
        "title": "Amount of electricity needed to power world's data centres expected to double in five years",
        "description": "The amount of electricity needed to power the world's data centres is expected to double in the next five years, according to the International Energy Agency (IEA). ",
        "url": "https://news.sky.com/story/amount-of-electricity-needed-to-power-worlds-data-centres-expected-to-double-in-five-years-13345515",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-data-centre-london_6881401.jpg?20250409233806",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-09 21:44:00",
        "Headline": "The rise in demand, predicted to be highly concentrated around the world's tech and population hubs, will put pressure on utility companies, grid infrastructure and the planet.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n The amount of electricity needed to power the world's data centres is expected to double in the next five years, according to the International Energy Agency (IEA).  It will come as racks of servers hosting the latest AI models and cloud computing services use three times more electricity than the UK each year, the agency added. The rise in demand, predicted to be highly concentrated around the world's tech and population hubs, will put pressure on utility companies, grid infrastructure and the planet. \"AI is one of the biggest stories in the energy world today,\" says Fatih Birol, executive director of the IEA. \"In the United States, data centres are on course to account for almost half of the growth in electricity demand; in Japan, more than half; and in Malaysia, as much as one-fifth.\" In the US, data centres, largely being built to train and operate AI, are expected to consume more electricity by 2030 than the manufacturing of all the nation's energy-intensive goods including aluminium, steel, cement and chemicals, a report from the IEA found. But the agency also predicts that AI will be an essential tool in informing how to manage future energy demand, engineer more efficient data centres and accelerate the development of new, cleaner sources of electricity generation. Two main shifts have driven the AI revolution and its incredible demand for power. The cost of \"compute\" - the processors and associated servers to build data centres - has fallen by 99% since 2006. Whereas the amount of compute being used to train and run state-of-the-art AI models has increased by a mind-boggling 350,000-fold in just a decade. Read more science and tech news:'Concerning' levels of E.coli found in ThamesWatchdog to investigate 'suicide forum'Wolf extinct for 10,000 years brought back to life Energy demand could outstrip supply Depending on the energy sources used, AI development could drive up carbon emissions and water consumption needed for cooling servers. American tech firms are already struggling to find enough power to run their growing data centre needs, as well as the computing hardware needed to run them. A survey by Reuters of 13 major US power providers found nearly half have received requests from data companies for power that would exceed their current peak demand. It's one of the key uncertainties in the IEA report. Unlikely to risk blackouts to meet AI energy demand, countries aggressively pursuing AI development will need to build far more electricity generation. It's not clear how quickly that might happen and also how quickly the energy efficiency of data centres and the AI models they are running improves. One of the greatest uncertainties are Donald Trump's tariffs, introduced after the report was completed. Yet the US president's attack on the global trade status quo could directly and significantly impact data centre and AI development in the US and beyond. High tariffs on China are predicted to choke off supplies of raw materials needed to build new energy infrastructure. In particular, those for low-carbon energy sources like solar panels, wind turbine motors and batteries to store renewable electricity. Demand for low-carbon generation was surging in the US before Mr Trump's election - a large chunk of that coming from tech companies wanting to power data centres. The US president has promised to boost US coal production to power AI, but it's far from certain if power companies will choose to build new plants given their high cost relative to some low-carbon alternatives. The time they take to build could also mean electricity supply will lag well behind the IEA's forecast for data centre electricity demand. China, on the other hand, already gaining fast on the US in terms of AI development, may find low-carbon electricity gets cheaper and quicker to build if its clean energy exports to the US dry up due to tariffs."
    },
    {
        "title": "Defence secretary to urge coalition of the willing to increase pressure on Russia to end war",
        "description": "The defence secretary will urge \"coalition of the willing\" nations to increase pressure on Russia to end its war in Ukraine as plans to support peace ramp up.",
        "url": "https://news.sky.com/story/defence-secretary-to-urge-coalition-of-the-willing-to-increase-pressure-on-russia-to-end-war-13345346",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-john-healey-zelenskyy_6620779.jpg?20240707191040",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-09 18:03:00",
        "Headline": "Defence ministers will discuss operational plans for a peacekeeping force before they meet again, where the UK and Germany will push other countries to provide more equipment for current fighting.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The defence secretary will urge \"coalition of the willing\" nations to increase pressure on Russia to end its war in Ukraine as plans to support peace ramp up. John Healey and French defence minister Sebastien Lecornu will lead about 30 defence ministers in Brussels on Thursday as they discuss operational plans for a multinational peacekeeping force in Ukraine as part of the \"coalition of the willing\". They will look at each nation's capabilities and how they could be best used to support Ukraine's long-term defence and security as part of what the Ministry of Defence called a \"reassurance force\". UK and French military chiefs discussed planning with Ukrainian President Volodymyr Zelenskyy and his military chiefs in Kyiv last weekend. Peace negotiations are ongoing between the US and Russia, however, US officials appear to be growing increasingly impatient with the lack of progress after Donald Trump publicly suggested a month ago Vladimir Putin wants to end the war. Read more: Who's in and who's out of the coalition of the willing? Last Tuesday, the Kremlin described the latest US peace proposal as unacceptable in its current form because it does not solve the \"root causes\" of the conflict. \n                  Fewer criminals set to be jailed, say reports as prisons in England and Wales struggle with overcrowding\n                 \n                  Local elections: From where they are to what they're all for - your ultimate guide\n                 \n                  Politics latest: UK will 'coolly and calmly' engage with Trump after tariff pause, says Number 10\n                 Mr Putin wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas and pull its forces out, as well as a pledge for Ukraine to never join NATO and to demilitarise. Secretary of State Marco Rubio said on Friday Mr Trump is not \"going to fall into the trap of endless negotiations\" with Moscow. Read more:Two Chinese citizens 'fighting for Russia' captured in UkraineZelenskyy makes dig at US over response to Russian attack  Despite the apparent impasse in talks, the coalition of the willing - which does not include the US - is continuing with its plans for when peace is agreed. Mr Healey is expected to tell his fellow defence ministers: \"We cannot jeopardise the peace by forgetting about the war, so we must put even more pressure on Putin and step up our support for Ukraine - both in today's fight and the push for peace. \"Our commitment is to put Ukraine in the strongest position to protect Ukraine's sovereignty and deter future Russian aggression.\" On Friday, the defence secretary and his German counterpart, Boris Pistorius, will chair the 27th meeting of the Ukraine Defence Contact Group at NATO's headquarters in Brussels. The group is an alliance of about 50 countries - all 32 NATO member states, including the US, and about 20 other countries - that has been supporting Ukraine by sending military equipment since Russia invaded in April 2022. Mr Healey and Mr Pistorius will \"drive forward additional military support\" as Russia continues to attack Ukraine. The latest development in the war has seen Mr Zelenskyy say Ukraine has intelligence there are at least 155 Chinese citizens fighting for the Russian military. On Tuesday, Mr Zelenskyy released a video of a Chinese soldier taken by Ukrainian forces, with another captured by Ukrainian forces, he said. Chinese foreign ministry spokesperson Lin Jian denied claims there were \"many more\" Chinese citizens fighting alongside Russians in Ukraine."
    },
    {
        "title": "'We're living a life sentence': Family of man killed by psychiatric patient demand answers",
        "description": "A grief-stricken family has told Sky News they want \"someone to take accountability\" for the death of Lewis Stone, a retired butcher who was killed by a secure psychiatric unit patient released 10 days earlier.",
        "url": "https://news.sky.com/story/were-living-a-life-sentence-family-of-man-killed-by-psychiatric-patient-demand-answers-13345081",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lewis-stone-david-fleet_6880774.jpg?20250409125744",
        "type": "UK",
        "Author": "Mark Thompson, health producer",
        "Date Published": "2025-04-09 11:18:00",
        "Headline": "The family of Lewis Stone is fighting Hywel Dda health board in west Wales, which is refusing to release an internal report into his killer's psychiatric care. ",
        "Content": "By Mark Thompson, health producer   A grief-stricken family has told Sky News they want \"someone to take accountability\" for the death of Lewis Stone, a retired butcher who was killed by a secure psychiatric unit patient released 10 days earlier. In her first TV interview, Mr Stone's step-daughter Vicki Lindsay said they were calling for an internal NHS Trust report to be made public so that lessons can be learned. \"The thought of anybody going through what we've gone through for the last six years… We're living a life sentence,\" she said. On 28 February 2019, Lewis Stone was where he loved being most - the remote town of Borth on the west coast of Wales near Aberystwyth. It's where he and his wife, Elizabeth, had a holiday home and planned to retire. That morning, Lewis left for his daily pre-breakfast walk with his beloved dog Jock along the River Leri and never came home. He had been stabbed multiple times, and despite repeated attempts to save his life, he died in hospital three months later. Lewis's killer, David Fleet, was sectioned under the Mental Health Act after admitting manslaughter with diminished responsibility. \n                  Parents of boy whose outbursts left them fearing for their lives say Adolescence 'touched a nerve'\n                 \n                  Happiest country in the world revealed - and one where a stranger's most likely to return a lost wallet\n                 \n                  Nottingham attacks wouldn't have happened if authorities had listened, says family of man killed months earlier\n                 Sentencing, Judge Paul Thomas QC said Lewis had been in the wrong place at the wrong time. Lewis's family disagrees: \"I just want somebody to say, 'Yes, we messed up, we're sorry. It doesn't change things but we're sorry'. \"We've had none of that. Mum's had nothing, no support, she's had nothing. That's all we want, an admission.\" Fleet was suffering from paranoid schizophrenia at the time of the attack and told psychiatrists if he had not stabbed Mr Stone, the voices in his head \"were going to kill him\". Four months earlier, he had been detained under the Mental Health Act, but despite concerns raised by his own family, it was decided he should be treated at home. The Hywel Dda health board told Sky News they don't intend to release the internal report into Fleet's care. Read more from Sky News:Why Netflix's Adolescence 'touched a nerve'Mental health services under pressureNHS trust accused of mental health failings Sharon Daniel, the Interim Executive Director for Nursing, Quality and Patient Experience, said: \"The Duty of Candour for patients came into force in Wales in April 2023. At the time of this incident and concern, we fulfilled our duties to be open.\" When asked if they would be willing to apologise to both affected families, Ms Daniel said: \"In the event of serious incidents, we have robust processes in place for reviewing internally, identifying any issues, and where appropriate preparing an improvement plan to prevent such an occurrence in the future. We regret such incidents and always seek to learn from them.\" In February, victims' families in Nottingham won their fight for an NHS review into the care of paranoid schizophrenic Valdo Calocane, who killed three people, to be made public. It exposed a catalogue of errors and systemic failings.  The family's adviser and former NHS lawyer Radd Seiger, who also advised the Nottingham families, told Sky News the two cases have striking similarities: \"Sunlight is the best disinfectant when there are problems in the NHS. \"Let's have these things out in the open. Yes, they're uncomfortable, but that's the only way the NHS is going to learn from its mistakes. \"It's no good them marking their own homework in private where journalists, or lawyers, or families don't get to scrutinise these things because we see that these things keep happening over and over and over.\" David Fleet's family declined an opportunity to speak to Sky News for this report. The Welsh government said: \"We are fully committed to openness and transparency in line with the Duty of Candour to ensure lessons are learned. We have also invested in improving both the quality and safety of mental health care in Wales.\""
    },
    {
        "title": "New at-home spit test for prostate cancer could be better than blood test, study suggests",
        "description": "A new spit test for prostate cancer which can be done at home may be better than current testing methods, a study suggests.",
        "url": "https://news.sky.com/story/new-at-home-spit-test-for-prostate-cancer-could-be-better-than-blood-test-study-suggests-13345537",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prostate-cancer-brothers_6881406.jpg?20250410020108",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 23:31:00",
        "Headline": "Experts have developed a simple saliva test which analyses genetic variants in a man's DNA which appears to perform better than the current method for assessing prostate cancer risk.",
        "Content": "A new spit test for prostate cancer which can be done at home may be better than current testing methods, a study suggests. Experts have developed a simple saliva test which analyses genetic variants in a man's DNA, which appears to perform better than the current method for assessing prostate cancer risk. Currently, the prostate-specific antigen (PSA) blood test is used to check for prostate conditions, including prostate cancer or an enlarged prostate. Routine testing is not currently available on the NHS, but patients may be offered a PSA test if a GP suspects they have prostate cancer. Men over 50 can ask their GP for a PSA test even if they do not have symptoms. But experts have said the new saliva test could be used as an additional screening tool, as it reduced the number of false positive results and detected a higher proportion of aggressive cancers than the PSA test. It could lead to fewer men being sent for unnecessary testing, according to researchers at The Institute of Cancer Research, London, and The Royal Marsden NHS Foundation Trust. They tested the effectiveness of a new tool they had developed called a polygenic risk score, which uses spit to assess 130 genetic variants known to be associated with an increased risk of prostate cancer, which can then determine whether or not a person is at high risk of the disease. Test saved lives of two brothers Taking part in the trial saved the lives of two brothers. Dheeresh Turnbull said traditional methods to assess prostate cancer deemed he had a low risk of disease, but the new spit test helped the 71-year-old discover he actually had a life-threatening tumour in his prostate. After finding out the news, his brother Joel Turnbull also took part in the study and discovered he had an aggressive prostate tumour. \"It's incredible to think that because of this study two lives have now been saved in my family,\" Dheeresh said. Read more science and tech news:'Concerning' levels of E.coli found in ThamesWatchdog to investigate 'suicide forum'Wolf extinct for 10,000 years brought back to life How the tool was assessed The brothers were among 6,300 men aged 55 to 69 in the UK who were assessed by the tool as part of the study. Of those, 745 (12%) were deemed to have a high risk score and were invited to have prostate cancer screening, including an MRI scan and a biopsy. Prostate cancer was detected in 187 of the 468 who took up the offer, and of those, 103 had cancer that was deemed to be \"higher risk\", so treatment was offered. Of the 187 men, 118 had a PSA level below 3.0ug/L - which is considered \"normal\" and would typically indicate no further screening is required. Test could 'turn the tide on prostate cancer' Writing in the New England Journal of Medicine, the researchers said cancer \"would not have been detected\" in 74 of the men using the \"diagnostics pathway\" currently in use in the UK - which includes a high PSA level and an MRI. They concluded that for the men with the highest genetic risk, the test falsely identified fewer people with prostate cancer than the PSA test and picked up people with cancer who would have been missed by the PSA test alone. It detected a higher proportion of aggressive cancers than the PSA test and also accurately identified men with prostate cancer who were missed by an MRI scan. Professor Ros Eeles, from the Institute of Cancer Research, London, and The Royal Marsden NHS Foundation Trust, said: \"With this test, it could be possible to turn the tide on prostate cancer. \"We have shown that a relatively simple, inexpensive spit test to identify men of European heritage at higher risk due to their genetic make-up is an effective tool to catch prostate cancer early. Some 55,000 cases of prostate cancer are diagnosed each year in the UK, with around 12,000 men in the UK dying from the disease annually, according to Cancer Research UK. It comes after Health Secretary Wes Streeting suggested he would support a national prostate cancer screening programme for men at higher risk of disease if it is backed by the evidence. The UK's National Screening Committee is currently assessing whether or not such a programme should be rolled out."
    },
    {
        "title": "Local elections: From where they are to what they're all for - your ultimate guide",
        "description": "A host of local and mayoral elections will be taking place across England on Thursday 1 May - the first voting day since the general election last year.",
        "url": "https://news.sky.com/story/local-elections-from-where-they-are-to-what-theyre-all-for-your-ultimate-guide-13344978",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-kemi-b_6880711.jpg?20250409111716",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 08:39:00",
        "Headline": "Votes for a new MP, several mayors and almost two dozen local authorities are all coming at the start of next month. Here's everything you need to know.",
        "Content": "A host of local and mayoral elections will be taking place across England on Thursday 1 May - the first voting day since the general election last year. There will also be a new Member of Parliament. Here is everything you need to know - from what's at stake to how you can vote. There will be local elections in 23 of England's 317 local authorities on 1 May. Some are slightly different to others, depending on the type of authority. Here is the full list: County councils • Cambridgeshire• Derbyshire• Devon• Gloucestershire• Hertfordshire• Kent• Lancashire• Leicestershire• Lincolnshire• Nottinghamshire• Oxfordshire• Staffordshire• Warwickshire• Worcestershire Unitary authorities  • Buckinghamshire• Cornwall• County Durham• North Northamptonshire• Northumberland• Shropshire• West Northamptonshire• Wiltshire Metropolitan district • Doncaster The Isles of Scilly, which has a unique governance structure, is also holding a local election of its own. Additionally, about 1,270 parish councils will be holding elections. A county council is part of a two-tier local government system, taking care of things that affect the whole county, such as: • Education• Transport• Planning• Fire and public safety• Social care• Libraries• Waste management• Trading standards They work alongside the other, lower-tier councils - district, borough or city - that take care of things on a smaller scale, such as: • Rubbish collection• Recycling• Council tax collections• Housing• Planning applications A unitary authority is a one-tier local government, where the services of a county council and the other smaller councils listed above are combined. A metropolitan district has a council that oversees all services, similar to a unitary authority - but has a mayor with a role similar to that of local councils. The mayors for Doncaster and North Tyneside are single authority, making them the political leader of the council and leaving them responsible for delivering local council services. Metro mayors chair combined authorities made up of several local councils. There are six mayoral elections taking place on 1 May, two of which are the first ever in their areas. One of them is for the West of England, where the current mayor is Dan Norris, who was elected as a Labour MP when he defeated Jacob Rees-Mogg to win the seat of North East Somerset and Hanham in last year's general election. Mr Norris, who has been mayor since 2021, has to vacate the role because the Labour Party introduced rules to prevent serving MPs from standing as mayoral candidates. There is another mayoral election in Cambridgeshire and Peterborough, while the first mayors for Hull and East Yorkshire and Greater Lincolnshire will be chosen after devolution deals were agreed in 2023, bringing together local councils in both areas to create larger authorities. There will also be elections for the next mayor of Doncaster and North Tyneside. A by-election is also being held in Runcorn and Helsby after Labour's Mike Amesbury agreed to stand down following his conviction for punching a man in the street. Amesbury, who was suspended from the Labour Party, was jailed on 24 February for 10 weeks after he pleaded guilty to assault by beating of 45-year-old Paul Fellows in Main Street, Frodsham, Cheshire, in the early hours of 26 October. However, following an appeal, his sentence was suspended for two years.  His resignation means Karen Shore, the deputy leader of Cheshire West and Chester Council, will run for Labour in the by-election, while the Conservatives are putting forward Sean Houlston, a membership services manager for the National Federation of Builders, and Sarah Pochin, a former Cheshire East councillor, is Reform's candidate. Amesbury came first in Runcorn and Helsby with 22,358 votes at the 2024 general election - equating to 52.9% of the electorate. Reform UK came in second with 7,662 votes (18.1%) and the Tories in third with 6,756 votes (16%). The elections will be the first big test of all the parties since the general election, which fundamentally redrew the UK's political landscape with a new world of multiparty politics. The Tories have the most to lose as they hold 20 of the 23 local authorities up for grabs on 1 May. And for the first time in a long time, Labour and the Conservatives are facing a genuine threat from other parties. YouGov conducted exclusive polling for Sky News to get a sense of how the country was feeling ahead of the elections, surveying 2,178 adults in the UK on 6 and 7 April. Here is the voting intention poll: • Labour: 24% (no change)• Reform UK: 23% (no change)• Conservatives: 22% (+1)• Liberal Democrats: 17% (+3)• Green Party: 9% (-2) It suggests that Nigel Farage's Reform UK could be Labour's closest competitor, with Kemi Badenoch trailing as she leads the Conservatives through elections for the first time, while the Lib Dems have closed the gap on the three top parties. Read more:Why is assisted dying so controversial - and where is it legal?Highs and lows of Five-Year Keir You have until 11.59pm on Friday to register to vote if you haven't already. You must be aged 16 or over (or 14 or over in Scotland and Wales) to register to vote - but to vote for a new MP you must be at least 18. You can register if you are: • A British citizen• An Irish or EU citizen living in the UK• A Commonwealth citizen who has permission to enter or stay in the UK, or who does not need permission• A citizen of another country living in Scotland or Wales who has permission to enter or stay in the UK, or who does not need permission• You can be an overseas voter if you previously lived in the UK and are a British citizen. The easiest and quickest way to register is online. Alternatively, you can use a paper form - though it may be too close to the deadline for you to complete this by the deadline. You can do it by contacting your local Electoral Registration Office and asking them to post a form to you. Or you can print your own form off. You'll then need to return the completed form to your local Electoral Registration Office. There are three ways to vote: In person at your local polling station You'll be sent a poll card just before an election or referendum telling you when to vote and at which polling station. It will usually be in a public building, such as a school or local hall, near your home. You can only vote at the polling station allocated to your address. This will be shown on your poll card. You can also enter your postcode on this website to find out where your polling station is. You will be able to cast your vote any time between 7am and 10pm You must bring a form of photo ID with you in order to vote. There are 22 accepted types of ID. At the polling station, you will need to give your name and address to staff and show them your photo ID. There will be instructions in the polling booth telling you exactly how to cast your vote. Postal vote You can register to vote by post for any reason, including that you simply don't want to go to a polling station on the day. You need to apply for this by 5pm on 14 April and can do so by clicking here. Postal votes now expire every three years, so if you registered to do so more than three years ago, you will need to re-apply. By proxy This is where you apply for someone to vote on your behalf if you cannot go to the polling station in person and do not want to or can't vote by post. You and your proxy must both be registered to vote in the UK before you can apply. The deadline to apply for proxy voting in the May 1 elections is 5pm on 23 April, and you can apply here. Elections for county councils in the following areas have been postponed until May 2026: • Norfolk• Suffolk• Essex• Thurrock• Surrey• East and West Sussex• Hampshire• Isle of Wight Most areas of the UK are now covered by one-tier systems such as unitary authorities, but there are still 21 county councils. The government is pushing for a \"devolution revolution\", meaning the remaining county councils are being encouraged to merge with other local authorities to become unitary authorities. So in December last year, the government told county councils they could request to postpone their elections set for 1 May if they were trying to reorganise into one-tier systems. While 16 county councils requested to postpone, only the eight listed above were successful."
    },
    {
        "title": "Daughter's plea for help to solve mother's murder 30 years ago",
        "description": "A woman whose mother's murder has been unsolved for 30 years has issued a plea for help in finding her killer.",
        "url": "https://news.sky.com/story/daughters-plea-for-help-to-solve-mothers-murder-30-years-ago-13345302",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-janet-brown-radnage_6881122.jpg?20250409180537",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 16:47:00",
        "Headline": "Police believe DNA evidence could help trace Janet Brown's killer after she was gagged, handcuffed and beaten to death at the family home in the village of Radnage, Buckinghamshire in 1995.",
        "Content": "A woman whose mother's murder has been unsolved for 30 years has issued a plea for help in finding her killer. Mother-of-three Janet Brown, 51, was bludgeoned to death at her home in Radnage, Buckinghamshire, on 10 April 1995. Thames Valley Police (TVP) has a DNA sample from the scene that they believe belongs to the murderer but does not match anyone on the police database. More than 1,000 men have been screened and eliminated from the inquiry by the investigation team. A reward of £20,000 is on offer for information given to Crimestoppers that leads to the arrest and conviction of the killer. Mrs Brown, a medical researcher at the John Radcliffe Hospital in Oxford, was found dead at the foot of the stairs naked, gagged and handcuffed. But detectives believe there was no sexual motive to the killing, and while the house was searched, nothing was stolen. Mrs Brown's oldest daughter, Zara Harden, said it was \"baffling\" why anyone would target her mother, but is convinced \"somebody must know something because there would have been a lot of blood\". \n                  Man with knife who 'moved at speed' towards police officers before he was shot dead in Milton Keynes named\n                 \n                  Mantas Vanagas: 'Dangerous' predator jailed for abusing four men - including raping sleeping victim\n                 \n                  Man shot dead by armed police at Milton Keynes railway station\n                 \"She was handcuffed and beaten badly, literally bludgeoned to death. It doesn't matter if a person didn't come forward at the time. It's not too late,\" she added. On the night she was murdered, Mrs Brown's three children Zara, Benedict and Roxanne were not at home while her husband Dr Grahaem Brown was in Switzerland working. The killer initially tried to cut a hole in the glass of a double-glazed patio door before smashing his way in. It is believed Mrs Brown was killed between 8.15pm and 10.15pm that night. Her body was found the following morning by a builder and his son who were due to carry out work at the house. Mrs Harden said: \"Ultimately her killer, or killers, have so far gotten away with it. \"We want to see them prosecuted, and not to have somebody who is extremely dangerous still be out there on the loose... we just want to stop it happening again.\" The head of Thames Valley Police's Major Crime Investigation Review Team, Peter Beirne, said: \"I still believe there are people who have information or suspicions about this vicious murder. \"We have a DNA profile that was left at the scene. It does not belong to the family, and we believe it could be a vital piece of evidence linking the killer to the scene. \"If you have suspicions, it is very easy for our team to trace and request a DNA sample from the person you suspect, or a relative of theirs if they have perhaps passed away or have emigrated.\""
    },
    {
        "title": "Fewer criminals set to be jailed, say reports as prisons in England and Wales struggle with overcrowding",
        "description": "Ministers want reforms to sentencing policy that will reduce the prison population by more than ten percent, Sky News has learnt.",
        "url": "https://news.sky.com/story/fewer-criminals-set-to-be-jailed-say-reports-as-prisons-in-england-and-wales-struggle-with-overcrowding-13345162",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-prisons-overcrowding_6553274.jpg?20240513215025",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-09 13:14:00",
        "Headline": "Sky News understands an independent policy review will suggest restricting the use of short sentences, deploying alternatives to custody and imprisoning fewer women.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Ministers want reforms to sentencing policy that will reduce the prison population by more than ten percent, Sky News has learnt. The sentencing review is under pressure to deliver recommendations that will send 9,500 fewer people to jail by 2028. The independent review of sentencing policy, being led by former Justice Secretary David Gauke, will submit its findings to the government next month. There are currently 87,938 people in prison in England and Wales. The male estate is almost full again, operating at more than 99% capacity, with emergency measures triggered to hold offenders in police cells as jails run out of space. Government projections suggest the prison population will increase to more than 100,000 inmates by 2029. In an indication of how serious the current situation has become, Sky News has been told of prison governors getting messages directly from court officials outside of working hours, asking them to free up space in order to send new prisoners to jail.  The sentencing review panel is expected to make suggestions around the impact of short sentences, greater use of alternatives to prison custody and possible steps to reduce the number of women behind bars. \n                  Daughter's plea for help to solve mother's murder 30 years ago\n                 \n                  Parents of boy whose outbursts left them fearing for their lives say Adolescence 'touched a nerve'\n                 \n                  Man charged with murder of 16-year-old boy in Huddersfield - as victim named\n                 But sources close to the review process suggest that the scrapping of short sentences will only deliver \"hundreds\" of free spaces, with more radical changes to sentencing practises needed to ease overcrowding. Certain crimes are outside the scope of the review - such as murder - but reforms being considered could see other serious offenders serve less time in prison. It's understood the sentencing review panel has met with relevant authorities for feedback, and there is nervousness amongst the police about the additional number of people that will need to be managed in the community. Authorities support the need for a review of sentencing, with shifts away from custodial terms for some offenders to solve the prisons crisis, but changes will increase policing pressures. The review will also consider other examples of policy and penal systems from around the world. Read more from Sky News:Jenrick: Sentencing 'two-tier' justiceRising prison numbers overwhelming jails On a recent trip to Texas, the justice secretary saw how offenders earned 'good behaviour' credits, giving inmates the ability to serve less time behind bars by participating in work or courses. David Gauke had also previously pointed to the use of open prisons in Spain, where 25% of offenders are housed in lower security jails, with inmates able to leave prison for study and work during the day. The capacity problems in England and Wales are more acute in the higher security, or 'closed', estates, so greater use of open prisons would help ease overcrowding. But there are concerns among open prison governors that high-risk offenders are being sent to open prisons when they shouldn't be, for capacity reasons. A Ministry of Justice spokesperson said: \"The government inherited overcrowded prisons on the point of collapse - we introduced emergency measures and were clear that longer term action was required. \"Alongside our commitment to build 14,000 prison places, we will carefully consider all recommendations by the independent Sentencing Review to ensure we never run out of space again.\""
    },
    {
        "title": "Prince William brings son George to Aston Villa's Champions League quarter-final clash with PSG - and chats to pundits",
        "description": "Prince William has said bringing his son George to Aston Villa's Champions League quarter-final match in Paris was a \"big deal\" - before seeing their side lose 3-1 in the first leg of the tie.",
        "url": "https://news.sky.com/story/prince-william-brings-son-george-to-aston-villas-champions-league-quarter-final-clash-with-psg-and-chats-to-pundits-13345466",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-william-villa_6881319.jpg?20250409221456",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 20:46:00",
        "Headline": "The future king says he was wearing his \"lucky clothes\" for the match - but Villa ended up losing 3-1 in the first leg of the quarter-final tie in Paris.",
        "Content": "Prince William has said bringing his son George to Aston Villa's Champions League quarter-final match in Paris was a \"big deal\" - before seeing their side lose 3-1 in the first leg of the tie. Speaking to pundits Ally McCoist and Rio Ferdinand ahead of Villa's match against Paris Saint-Germain, William said he was \"pretty terrified\" and \"nervous\". He said he was \"wearing all my lucky clothes\", before being pictured punching the air and hugging his 11-year-old son as he celebrated Morgan Rogers giving Villa a first-half lead. The Premier League club, however, ended up losing to PSG as the two teams faced off in Parc des Princes. William said he had predicted a 2-1 victory for Villa. Asked by former England defender Ferdinand if he was on a \"lads tour\" to the match with friends, William replied: \"Well, I've got my son here as well, so I'm on best behaviour as well. \"But I thought: You know what, it's been 43 years since anything like this has happened in my generation as a Villa fan, and I want George to experience a night out away from home in a big European competition. \"I hope it's not 43 years until the next one happens, but I think those memories are really important to create and bringing him along tonight is a big deal for me.\" \n                  Prince William meets Clarkson's Farm star to discuss challenges the industry is facing\n                 \n                  Why increasing number of farmers are at crisis point - and Prince William is being urged to 'speak up'\n                 \n                  Prince William joins British troops in Challenger 2 tank on visit to Estonia\n                  Read more from Sky News:Meghan reveals 'rare' medical condition after childbirthHarry's 'life at stake' in security case, court hears The TNT Sports pundits went on to ask William if he would make his children, who besides George include Charlotte, nine, and Louis, aged six, support Villa. \"I'm generally very open to whoever they support, but obviously I'm a bit biased,\" the prince said. \"But also they come to games with Villa. They're going to probably support Villa, but I've left the other two at home, probably watching tonight, so we'll wait and see who they support,\" he added. The royal hugged some of Villa's players, including Marco Asensio and England international Marcus Rashford as they came out of the dressing room. After William discussed Villa's tactics and the \"intensity\" of PSG's press, former Manchester United defender Ferdinand joked: \"Do not go for a punditry job, please, because I could be out of the game. \"The way he just dissected that there, I'm going to nick that for later on.\""
    },
    {
        "title": "Abuser who murdered husband and buried him in Canterbury garden jailed for 22 years",
        "description": "A domestic abuser who murdered her \"frail\" husband and buried him in the garden has been jailed for life.",
        "url": "https://news.sky.com/story/abuser-who-murdered-husband-and-buried-him-in-garden-jailed-for-minimum-of-22-years-13344967",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jeremy-rickards-maureen-rickards_6880994.jpg?20250409152857",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 13:41:00",
        "Headline": "Videos on the killer's phone showed her \"abusing him, using violence on him, and expressing an intention to kill him\", a judge says.",
        "Content": " A domestic abuser who murdered her \"frail\" husband and buried him in the garden has been jailed for life. Maureen Rickards caused her husband \"unimaginable pain and suffering\", said the Crown Prosecution Service (CPS). She was found guilty last month and today got a life sentence with a minimum of 22 years. Jeremy Rickards, 65, was found wrapped in bin bags inside a holdall at the couple's property in St Martin's Road, Canterbury, on 11 July last year. He had five stab wounds to his chest - two of which pierced his heart. There were also non-fatal injuries sustained about 10 days before his death, as well as wounds thought to have been weeks old. Grass cuttings were put over the body in an attempt to hide it, but the judge said police were alerted by an \"overpowering odour\" that \"made them feel ill\". Kent Police believe he was killed a month earlier and his corpse stored in an attic room cupboard before being moved. Rickards, 50, told their daughter he had gone to Saudi Arabia for work, but police had no record of him leaving the UK. The daughter became concerned by the style of messages she received and asked her mother if she had taken over his phone. She eventually reported him missing. The last record of Mr Rickards being alive was when he topped up his phone on 8 June. CCTV showed his wife of 27 years using his bank card a few weeks later, with the judge saying the cleaning products she bought were probably to clean up the killing. 'Bruised victim said he'd been in crash' Rickards was initially arrested for fraud - but officers searched the property and found the body. The murder weapon has never been found. Police said the victim was also seen with bruising on his face a few weeks before his death, telling a pub staff member he had been in a car accident. But video found on his wife's phone showed her shouting at him and the sounds of her beating him. Read more from Sky News:Crash involving five police cars shuts A1Man guilty of murdering woman at Carnival Mr Rickards briefly moved out of his home in early June and was seen with numerous injuries at the property he stayed in. His wife did not attend sentencing at Canterbury Crown Court, but judge Mr Justice Kerr directed his comments towards her. \"Your videos also clearly show you threatening Jeremy, abusing him, using violence on him, and expressing an intention to kill him,\" he said. \"He was in frail health and largely defenceless against you.\" Detectives said Rickards has never expressed remorse for the killing and tried to blame others. \"This was a horrific murder of a man who we believe had been a supportive husband to his wife, despite her violence towards him,\" said Detective Inspector Colin McKeen."
    },
    {
        "title": "King and Queen meet Pope at the Vatican - as he wishes them happy anniversary",
        "description": "The King and Queen have had a private meeting with the Pope at the Vatican.",
        "url": "https://news.sky.com/story/king-and-queen-meet-pope-at-the-vatican-as-he-wishes-them-happy-anniversary-13345157",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-charles-camilla-queen_6881207.jpg?20250409195922",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 13:07:00",
        "Headline": "It is understood today's private audience - which included an exchange of gifts - was subject to the Pope's health and only confirmed this morning. ",
        "Content": "The King and Queen have had a private meeting with the Pope at the Vatican. Buckingham Palace said Charles and Camilla were \"delighted\" that the pontiff was \"well enough to host them - and to have had the opportunity to share their best wishes in person\". A statement from the Vatican said Francis shared \"his best wishes\" with the couple as they celebrate 20 years of marriage today. It added he also \"reciprocated his wishes to His Majesty for a speedy recovery of his health\". The King and Queen's state visit to Italy had been due to include an official stop at the Vatican, but this was postponed after the Pope's recent five-week stay in hospital, where he battled a life-threatening bout of double pneumonia.  It is understood today's private audience - which included an exchange of gifts - was subject to the Pope's health and only confirmed this morning. The 20-minute meeting is said to have taken place after the King and Queen returned from parliament, where Charles delivered a historic speech - partially in Italian. Discussions about Charles and Camilla making their official state visit to the Holy See are ongoing, it is understood. The Pope, 88, appeared before cheering crowds at the Vatican over the weekend - his first official appearance since he was released from hospital a fortnight ago. Francis, in a wheelchair, entered St Peter's Square on Sunday at the end of the celebration of a mass for the Catholic Church's Jubilee year. He waved to the crowds before wishing them a \"happy Sunday\", speaking in a frail voice while receiving oxygen via a nasal cannula. The King and Queen are on the penultimate day of their four-day trip to Italy, seen as part of an ongoing effort for the UK to strengthen ties with European allies. In his 22-minute address to both houses of the Italian parliament, Charles said he was there \"to reaffirm the deep friendship between the United Kingdom and Italy, and to pledge to do all in my power to strengthen that friendship even further in the time that is granted to me as King\". Read more:How this Italy tour is having an impactKing and Queen visit famous landmarks  Today also saw Charles hold a private meeting with Italy's Prime Minister Giorgia Meloni and watch a Shakespeare performance delivered in Italian. Meanwhile, the Queen squeezed in a stop at an ice cream shop and met with students at a local school, who presented her with cards to mark her 20th wedding anniversary. Charles and Camilla are this evening attending a state banquet at the Palazzo Quirinale in Rome."
    },
    {
        "title": "Family reveal daughter's 'painful' last memory of mother stabbed at Notting Hill Carnival",
        "description": "The family of a mother who was fatally stabbed as she attended Notting Hill Carnival with her three-year-old daughter has said \"the feeling of loss is overwhelming, but so is the feeling of rage\".",
        "url": "https://news.sky.com/story/cher-maximen-familys-rage-after-mother-stabbed-to-death-in-front-of-daughter-at-notting-hill-carnival-13336034",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-cher-maximen-death_6674459.jpg?20240901225905",
        "type": "UK",
        "Author": "Ashna Hurynag",
        "Date Published": "2025-04-09 13:50:00",
        "Headline": "Cher Maximen, 32, was stabbed at the event's \"Family Day\" in August last year. Shakeil Thibou, 20, has been found guilty of her murder after a trial at the Old Bailey.",
        "Content": "\n          News correspondent\n              @ashnahurynag\n  The family of a mother who was fatally stabbed as she attended Notting Hill Carnival with her three-year-old daughter has said \"the feeling of loss is overwhelming, but so is the feeling of rage\". Cher Maximen, 32, was stabbed at the west London carnival's \"Family Day\" on 25 August last year. Shakeil Thibou, 20, has been found guilty of her murder following a trial at the Old Bailey. \"I've lost my parents. I've lost my brother. Nothing has felt like this ever,\" Ms Maximen's cousin Lawrence Hoo told Sky News. \"It is the cruellest thing, it truly is.\" Ms Maximen died at a carnival she had been to so many times - she barely missed one. On the day, Ms Maximen and her three-year-old daughter arrived at Europe's biggest street party with a group of friends and their children. They'd been sitting and chatting when she was knocked over by some men who had started fighting. News of her stabbing came almost immediately. Mr Hoo remembers receiving the call. \"When I first heard that she'd been stabbed, I know it sounds silly, but I thought Cher will be alright. Cher's strong, she'll get through this.\" Ms Maximen was taken to hospital and underwent a number of emergency procedures before being put on life support. Mr Hoo immediately headed to London to be at her bedside. \"I can remember being in the hospital being sat there with her, with other family members and that's the last time I saw her. It still doesn't feel real. There's still disbelief,\" he said. \"It's the most senseless act to someone who had so much life and so much to give.\" Ms Maximen died from her injuries six days after the incident. Relatives say she was a vivacious young woman who grew up in Bristol and then London, finding her feet working with people in music and entertainment. 'She lit up the room' Ms Maximen was described as a \"people person\", which for Mr Hoo manifested in her being \"a bright light\" in the lives of her loved ones. He said: \"It's just this energy she had, she lit up the room. If you walked into a space, you'd know that Cher was there. Her energy itself would fill the room. She was a very bright light.\" Her life changed three years before her death when she became a mother in her late 20s. Her daughter became her life's work, she poured her love and energy into creating a person her family describe as her mini-me. \"She's Cher 2.0,\" Mr Hoo said. Ms Maximen was stabbed just metres from her daughter on that day. Mr Hoo said the idea of the toddler witnessing her mother on the ground punctuates the sadness the family feel with anger. \"The feeling of loss is overwhelming, but so is the feeling of rage,\" he said. \"She [Ms Maximen's daughter] is aware that on that day, something happened to her mother. \"She saw her mother drop to the floor, and then she saw her mother bleed. That's the daughter's last living memory of her mother. And to live with that, knowing that that's happened, that somebody did that. That's why it's so hard and that's where the rage comes from.\" The family is now rallying around the little girl who is growing up without her mother. Mr Hoo said the attack \"will be a memory that will recur\" for Ms Maximen's daughter, adding \"that is why it is so painful and hard to try to live with\". \"I think the trauma is going to be there, and trauma will raise its head when it chooses to come up. But we'll be there for her,\" he said. The family held Ms Maximen's funeral in October, and dozens came to remember a woman who loved to spread joy. Mr Hoo said their focus is now Cher's daughter: \"It's difficult to say how do we celebrate this life that was taken so prematurely. But I think it goes into her daughter, and it's to give her daughter the best life and love, and tell her who her mother was. \"I just wish that we had so much more time.\""
    },
    {
        "title": "Man guilty of murdering woman who was stabbed in front of daughter at Notting Hill Carnival",
        "description": "A man has been found guilty of murdering a mother who was stabbed in front of her three-year-old daughter at Notting Hill Carnival.",
        "url": "https://news.sky.com/story/man-guilty-of-murder-of-cher-maximen-at-notting-hill-carnival-13334865",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-cher-maximen-notting-hill-carnival_6867366.jpg?20250409151501",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-09 13:55:00",
        "Headline": "Cher Maximen, 32, was at the event's family day in west London in August last year when she was stabbed in the groin. Shakeil Thibou, 20, has been convicted of her murder.",
        "Content": " A man has been found guilty of murdering a mother who was stabbed in front of her three-year-old daughter at Notting Hill Carnival. Cher Maximen, 32, was at the event's family day in west London on 25 August last year when she was stabbed in the groin. She died in hospital on 31 August. Following a trial at the Old Bailey, 20-year-old Shakeil Thibou was found guilty of murder. Read more:Mother killed in Notting Hill Carnival attack was 'beautiful soul Thibou was also convicted of attempting to cause grievous bodily to 20-year-old Adjei Isaac with intent, and having an offensive weapon. His brother Sheldon Thibou, 25, was found guilty of violent disorder and assaulting PC Oliver Mort, who tried to intervene. A third brother, Shaeim Thibou, 22, was cleared of violent disorder but convicted of assaulting PC Mort after the jury deliberated for 50 hours and 33 minutes. There was a shout of \"yes\" from Ms Maximen's family in court as the verdicts were delivered. The Old Bailey heard a disturbance broke out at about 5.48pm between the defendants and at least two other males close to where Ms Maximen was standing with her group. The crowd parted as Sheldon Thibou got into a physical confrontation with the males, prompting PC Mort to step in to break it up, jurors were told. Sheldon Thibou was holding a stun gun as he and Shaeim hit out at the officer, the court heard. Meanwhile, Shakeil Thibou thrust a \"huge\" knife repeatedly towards Mr Isaac's stomach, only missing him because the victim drew back. Ms Maximen was knocked to the ground after Mr Isaac came into contact with her, then managed to partially get to her feet, the prosecutor said. Shakeil Thibou raised the knife directly towards her and deliberately stabbed her in her groin, jurors heard. 'Truly shocking attack' Ms Maximen suffered a 12cm deep knife wound, which caused severe internal bleeding in her groin. Mr Brown said: \"The injuries inflicted on Ms Maximen were fatal - the defendant had killed her. It was a truly shocking attack, and regarded as such by those around it.\" The defendants, of Hammersmith, west London, had denied the charges against them although Sheldon Thibou admitted having the stun gun. In his defence, Shakeil Thibou claimed he picked up the knife at the carnival and acted in self-defence against Mr Isaac. He claimed the death of Ms Maximen was an accident. However, the prosecution case was that the knife was brought to the scene by the defendant, and that another blade was found during a search of his room. The judge just set sentencing for Shakeil Thibou on May 16."
    },
    {
        "title": "Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%",
        "description": "Asian markets have reacted positively after Donald Trump paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days, despite the US president increasing those on China to 125%.",
        "url": "https://news.sky.com/story/trump-pauses-higher-tariffs-for-most-countries-for-90-days-but-increases-those-on-china-to-125-13345402",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald-trump_6881341.jpg?20250409224259",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-09 19:00:00",
        "Headline": "Global markets bounced back following the US president's announcement, which he said came after people \"were getting a little bit yippy, a little bit afraid\".",
        "Content": " Donald Trump has paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days - while increasing those on China to 125%. There have been fears of a global recession and stock markets around the world had plummeted after Mr Trump announced his \"Liberation Day\" tariffs on Wednesday 2 April. However, the S&P 500 stock index jumped 9.5% and global markets bounced back following Mr Trump's announcement on Wednesday that the increased tariffs on nearly all trading partners would now be paused. Tariffs latest: Trump gives reasons for pausing some tariffs In a post on his Truth Social platform, Mr Trump said the \"90-day pause\" was for the \"more than 75 countries\" who had not retaliated against his tariffs \"in any way\". He added that during this period they would still have to pay a \"substantially lowered\" 10% tariff, which is \"effective immediately\". It is lower than the 20% tariff that Mr Trump had set for goods from the European Union, 24% on imports from Japan and 25% on products from South Korea. The UK was already going to face a blanket 10% tariff under the new system. Mr Trump said the increased 125% tariff on imported goods from China was \"effective immediately\". He added: \"At some point, hopefully in the near future, China will realise that the days of ripping off the USA, and other countries, is no longer sustainable or acceptable.\" Here's what Donald Trump's tariff pause entails: 'Reciprocal' tariffs on hold  • Higher tariffs that took effect today on 57 trading partners will be paused for 90 days  • These include the EU, Japan and South Korea, all of which will face a baseline 10% duty instead  • Countries that already had a 10% levy imposed since last week - such as the UK - aren't affected by the pause\n China tariffs increased \n • Trump imposed a higher 125% tariff on China \n • That's in addition to levies he imposed during his first term \n • China had hit the US with 84% tariff earlier today, following tit-for-tat escalations\n No change for Canada or Mexico \n • Canadian and Mexican goods will remain subject to 25% fentanyl-related tariffs if they don't comply with the US-Mexico-Canada trade agreement's rules of origin\n • Compliant goods are exempt\n Car and metal tariffs remain \n • Trump's pause doesn't apply to the 25% tariffs he levied on steel and aluminium in March and on cars (autos) on 3 April \n • This 25% tariff on car parts does not come into effect until 3 May\n Sectors at risk \n • Copper, lumber, semiconductors, pharmaceuticals and critical minerals are expected to be subject to separate tariffs, in the same way autos are Hours after Mr Trump announced the pause on tariffs for most countries, a White House official clarified that this did not apply to the 25% duties imposed on some US imports from Mexico and Canada. The tariffs were first announced in February and Mexico and Canada were not included in the \"Liberation Day\" announcements.  Hours before the 125% tariff on China was revealed, Beijing said it was increasing tariffs on US goods by 50%. It meant tariffs of 84% would be enforced on US goods - up from the 34% China had previously planned. China 'want to make a deal' Asked why he posted \"BE COOL\" on Truth Social hours before announcing his tariff pause, Mr Trump told reporters at the White House: \"I thought that people were jumping a little bit out of line.\" \"They were getting yippy, you know, were getting a little bit yippy, a little bit afraid,\" he added. Mr Trump continued: \"China wants to make a deal, they just don't know how to go about it. \"[They're] quite the proud people, and President Xi is a proud man. I know him very well, and they don't know quite how to go about it, but they'll figure it out. \"They're in the process of figuring out, but they want to make a deal.\" Read more:Why Trump finally blinkedIs there method to madness amid market chaos?Who's most likely to see pensions hurt White House press secretary Karoline Leavitt said the walk back was part of a grand negotiating strategy by Mr Trump. \"President Trump created maximum negotiating leverage for himself,\" she said, adding that the news media \"clearly failed to see what President Trump is doing here\". US Treasury Secretary Scott Bessent also insisted Mr Trump had strengthened his hand through his tariffs. \"President Trump created maximum negotiating leverage for himself,\" he said. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Bessent said Mr Trump decided to raise tariffs on China because Beijing hadn't reached out to the US and instead increased its own levies on US goods. Downing Street said that the UK will \"coolly and calmly\" continue its negotiations with the US. A Number 10 spokeswoman said: \"A trade war is in nobody's interests. We don't want any tariffs at all, so for jobs and livelihoods across the UK, we will coolly and calmly continue to negotiate in Britain's interests.\""
    },
    {
        "title": "Inside a NATO base in Poland - as residents bordering Russia say 'scare tactic' is needed",
        "description": "Along the thin strip of beach and woodland known as the Vistula Spit which marks the northernmost demarcation between Poland and the Russian exclave of Kaliningrad, there is not much in the way of a border.",
        "url": "https://news.sky.com/story/inside-a-nato-base-in-poland-as-residents-bordering-russia-say-scare-tactic-is-needed-13345509",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-control-room_6881378.jpg?20250409230534",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-04-09 21:42:00",
        "Headline": "We've been granted access to one of the cornerstones of Polish, and European defence, which is a couple of hours drive from the Vistula spit at the Redowicze military base.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  Along the thin strip of beach and woodland known as the Vistula Spit which marks the northernmost demarcation between Poland and the Russian exclave of Kaliningrad, there is not much in the way of a border. Just some torn wire fencing and a few rotten posts which seem to stagger drunkenly into the shallows of the Baltic Sea. Beneath a sign barring entry, we find a couple of empty bottles of Russian cognac and vodka. It doesn't feel like the edge of NATO territory. \"I don't see much protection. It's not good,\" says Krzysztof from Katowice, who has come to inspect the border himself. \"We have to have some kind of scare tactic, something to show that we are trying to strengthen our army,\" says Grzegorz, who lives nearby. \"At the same time I think I would not base the defence of our country solely on our army. I am convinced that Europe or America, if anything were to happen, will help us 100%.\" \n                  Trump announces 'most lethal aircraft ever built' and says Russia 'wouldn't be worried' about NATO without US\n                 \n                  Watch as Donald Trump meets NATO chief at White House\n                 \n                  US 'destroying' international rules-based order by trying to meet Russia 'halfway', Ukraine's UK ambassador warns\n                 Poland is investing massively in its defence, with military spending set to hit 4.7% of GDP in 2025, more than any other NATO country. Polish Prime Minister Donald Tusk has said he will introduce voluntary military training for men of any age, and women too should they wish, so the army has a competent reserve force in the event of war. He is investing $2.5bn in stronger border fortifications between Russia and Belarus, a project called East Shield which will include anti-tank obstacles, bunkers and potentially minefields too. Along with its Baltic neighbours, Poland is withdrawing from the Ottawa convention against the use of land mines. It hasn't committed to using them, but it wants to have that option. We've been granted access to one of the cornerstones of Polish, and European defence, which is a couple of hours drive from the Vistula spit at the Redowicze military base. Aegis Ashore Poland, together with its sister site in Romania, are the land-based arms of NATO's missile defence shield over Europe, which is run by the US navy. They are symbols of the US commitment to NATO and to the protection of Europe. And despite changes at the top of the Pentagon it is \"business as usual\", says Captain Michael Dwan who oversees air and missile defence within the US Sixth Fleet. \"Our mission to work with NATO forces has been unchanged. And so our commitment from the United States perspective and what capability we bring to ballistic missile defence and the defence of NATO is championed here in Poland.\" As far as Russia is concerned, NATO's two missile defence bases in Romania and Poland represent a NATO threat on their doorstep and are therefore a \"priority target for potential neutralisation\", per Russia's foreign ministry. NATO says the installations are purely defensive and their SM-3 interceptor missiles are not armed and are not intended to carry warheads. Russia counters they could easily be adapted to threaten Russia. Not the case, Captain Dwan says. Read more from Sky News:King and Queen meet Pope at the VaticanBritish passports are about to get more expensive \"It's not a matter of moving offensive weapons here into the facility, the hardware and the infrastructure is simply not installed. \"It would take months or years to change the mission of this site and a significant amount of money and capability and design.\" With so much marked \"secret\" on the site, it seems amazing to be granted the access. But for NATO, transparency is part of deterrence. They want potential adversaries to know how sophisticated their radar and interception systems are. They know that if they carried warheads on site, that would make them a target so they don't. Deterrence also depends on whether potential adversaries believe in the US's commitment to NATO and to Europe's defence. On an operational level, as far as the troops are concerned, that commitment may still be iron-clad. But as far as its commander-in-chief goes, there is still - as with so much around Donald Trump's presidency - a great deal of uncertainty. In the Oval Office on Wednesday afternoon President Trump suggested he might bundle a potential US troop drawdown in Europe together with the issue of EU trade and tariffs. \"Nice to wrap it up in one package,\" he said, \"it's nice and clean\". Probably not the way Europe sees it, not with a resurgent Russia on their doorstep, economic tailwinds breeding animosity and the notion of Pax Americana crumbling at their feet."
    },
    {
        "title": "Defence secretary to urge coalition of the willing to increase pressure on Russia to end war",
        "description": "The defence secretary will urge \"coalition of the willing\" nations to increase pressure on Russia to end its war in Ukraine as plans to support peace ramp up.",
        "url": "https://news.sky.com/story/defence-secretary-to-urge-coalition-of-the-willing-to-increase-pressure-on-russia-to-end-war-13345346",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-john-healey-zelenskyy_6620779.jpg?20240707191040",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-09 18:03:00",
        "Headline": "Defence ministers will discuss operational plans for a peacekeeping force before they meet again, where the UK and Germany will push other countries to provide more equipment for current fighting.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The defence secretary will urge \"coalition of the willing\" nations to increase pressure on Russia to end its war in Ukraine as plans to support peace ramp up. John Healey and French defence minister Sebastien Lecornu will lead about 30 defence ministers in Brussels on Thursday as they discuss operational plans for a multinational peacekeeping force in Ukraine as part of the \"coalition of the willing\". They will look at each nation's capabilities and how they could be best used to support Ukraine's long-term defence and security as part of what the Ministry of Defence called a \"reassurance force\". UK and French military chiefs discussed planning with Ukrainian President Volodymyr Zelenskyy and his military chiefs in Kyiv last weekend. Peace negotiations are ongoing between the US and Russia, however, US officials appear to be growing increasingly impatient with the lack of progress after Donald Trump publicly suggested a month ago Vladimir Putin wants to end the war. Read more: Who's in and who's out of the coalition of the willing? Last Tuesday, the Kremlin described the latest US peace proposal as unacceptable in its current form because it does not solve the \"root causes\" of the conflict. \n                  Fewer criminals set to be jailed, say reports as prisons in England and Wales struggle with overcrowding\n                 \n                  Local elections: From where they are to what they're all for - your ultimate guide\n                 \n                  Politics latest: UK will 'coolly and calmly' engage with Trump after tariff pause, says Number 10\n                 Mr Putin wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas and pull its forces out, as well as a pledge for Ukraine to never join NATO and to demilitarise. Secretary of State Marco Rubio said on Friday Mr Trump is not \"going to fall into the trap of endless negotiations\" with Moscow. Read more:Two Chinese citizens 'fighting for Russia' captured in UkraineZelenskyy makes dig at US over response to Russian attack  Despite the apparent impasse in talks, the coalition of the willing - which does not include the US - is continuing with its plans for when peace is agreed. Mr Healey is expected to tell his fellow defence ministers: \"We cannot jeopardise the peace by forgetting about the war, so we must put even more pressure on Putin and step up our support for Ukraine - both in today's fight and the push for peace. \"Our commitment is to put Ukraine in the strongest position to protect Ukraine's sovereignty and deter future Russian aggression.\" On Friday, the defence secretary and his German counterpart, Boris Pistorius, will chair the 27th meeting of the Ukraine Defence Contact Group at NATO's headquarters in Brussels. The group is an alliance of about 50 countries - all 32 NATO member states, including the US, and about 20 other countries - that has been supporting Ukraine by sending military equipment since Russia invaded in April 2022. Mr Healey and Mr Pistorius will \"drive forward additional military support\" as Russia continues to attack Ukraine. The latest development in the war has seen Mr Zelenskyy say Ukraine has intelligence there are at least 155 Chinese citizens fighting for the Russian military. On Tuesday, Mr Zelenskyy released a video of a Chinese soldier taken by Ukrainian forces, with another captured by Ukrainian forces, he said. Chinese foreign ministry spokesperson Lin Jian denied claims there were \"many more\" Chinese citizens fighting alongside Russians in Ukraine."
    },
    {
        "title": "Amount of electricity needed to power world's data centres expected to double in five years",
        "description": "The amount of electricity needed to power the world's data centres is expected to double in the next five years, according to the International Energy Agency (IEA). ",
        "url": "https://news.sky.com/story/amount-of-electricity-needed-to-power-worlds-data-centres-expected-to-double-in-five-years-13345515",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-data-centre-london_6881401.jpg?20250409233806",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-09 21:44:00",
        "Headline": "The rise in demand, predicted to be highly concentrated around the world's tech and population hubs, will put pressure on utility companies, grid infrastructure and the planet.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n The amount of electricity needed to power the world's data centres is expected to double in the next five years, according to the International Energy Agency (IEA).  It will come as racks of servers hosting the latest AI models and cloud computing services use three times more electricity than the UK each year, the agency added. The rise in demand, predicted to be highly concentrated around the world's tech and population hubs, will put pressure on utility companies, grid infrastructure and the planet. \"AI is one of the biggest stories in the energy world today,\" says Fatih Birol, executive director of the IEA. \"In the United States, data centres are on course to account for almost half of the growth in electricity demand; in Japan, more than half; and in Malaysia, as much as one-fifth.\" In the US, data centres, largely being built to train and operate AI, are expected to consume more electricity by 2030 than the manufacturing of all the nation's energy-intensive goods including aluminium, steel, cement and chemicals, a report from the IEA found. But the agency also predicts that AI will be an essential tool in informing how to manage future energy demand, engineer more efficient data centres and accelerate the development of new, cleaner sources of electricity generation. Two main shifts have driven the AI revolution and its incredible demand for power. The cost of \"compute\" - the processors and associated servers to build data centres - has fallen by 99% since 2006. Whereas the amount of compute being used to train and run state-of-the-art AI models has increased by a mind-boggling 350,000-fold in just a decade. Read more science and tech news:'Concerning' levels of E.coli found in ThamesWatchdog to investigate 'suicide forum'Wolf extinct for 10,000 years brought back to life Energy demand could outstrip supply Depending on the energy sources used, AI development could drive up carbon emissions and water consumption needed for cooling servers. American tech firms are already struggling to find enough power to run their growing data centre needs, as well as the computing hardware needed to run them. A survey by Reuters of 13 major US power providers found nearly half have received requests from data companies for power that would exceed their current peak demand. It's one of the key uncertainties in the IEA report. Unlikely to risk blackouts to meet AI energy demand, countries aggressively pursuing AI development will need to build far more electricity generation. It's not clear how quickly that might happen and also how quickly the energy efficiency of data centres and the AI models they are running improves. One of the greatest uncertainties are Donald Trump's tariffs, introduced after the report was completed. Yet the US president's attack on the global trade status quo could directly and significantly impact data centre and AI development in the US and beyond. High tariffs on China are predicted to choke off supplies of raw materials needed to build new energy infrastructure. In particular, those for low-carbon energy sources like solar panels, wind turbine motors and batteries to store renewable electricity. Demand for low-carbon generation was surging in the US before Mr Trump's election - a large chunk of that coming from tech companies wanting to power data centres. The US president has promised to boost US coal production to power AI, but it's far from certain if power companies will choose to build new plants given their high cost relative to some low-carbon alternatives. The time they take to build could also mean electricity supply will lag well behind the IEA's forecast for data centre electricity demand. China, on the other hand, already gaining fast on the US in terms of AI development, may find low-carbon electricity gets cheaper and quicker to build if its clean energy exports to the US dry up due to tariffs."
    },
    {
        "title": "King and Queen meet Pope at the Vatican - as he wishes them happy anniversary",
        "description": "The King and Queen have had a private meeting with the Pope at the Vatican.",
        "url": "https://news.sky.com/story/king-and-queen-meet-pope-at-the-vatican-as-he-wishes-them-happy-anniversary-13345157",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-charles-camilla-queen_6881207.jpg?20250409195922",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-09 13:07:00",
        "Headline": "It is understood today's private audience - which included an exchange of gifts - was subject to the Pope's health and only confirmed this morning. ",
        "Content": "The King and Queen have had a private meeting with the Pope at the Vatican. Buckingham Palace said Charles and Camilla were \"delighted\" that the pontiff was \"well enough to host them - and to have had the opportunity to share their best wishes in person\". A statement from the Vatican said Francis shared \"his best wishes\" with the couple as they celebrate 20 years of marriage today. It added he also \"reciprocated his wishes to His Majesty for a speedy recovery of his health\". The King and Queen's state visit to Italy had been due to include an official stop at the Vatican, but this was postponed after the Pope's recent five-week stay in hospital, where he battled a life-threatening bout of double pneumonia.  It is understood today's private audience - which included an exchange of gifts - was subject to the Pope's health and only confirmed this morning. The 20-minute meeting is said to have taken place after the King and Queen returned from parliament, where Charles delivered a historic speech - partially in Italian. Discussions about Charles and Camilla making their official state visit to the Holy See are ongoing, it is understood. The Pope, 88, appeared before cheering crowds at the Vatican over the weekend - his first official appearance since he was released from hospital a fortnight ago. Francis, in a wheelchair, entered St Peter's Square on Sunday at the end of the celebration of a mass for the Catholic Church's Jubilee year. He waved to the crowds before wishing them a \"happy Sunday\", speaking in a frail voice while receiving oxygen via a nasal cannula. The King and Queen are on the penultimate day of their four-day trip to Italy, seen as part of an ongoing effort for the UK to strengthen ties with European allies. In his 22-minute address to both houses of the Italian parliament, Charles said he was there \"to reaffirm the deep friendship between the United Kingdom and Italy, and to pledge to do all in my power to strengthen that friendship even further in the time that is granted to me as King\". Read more:How this Italy tour is having an impactKing and Queen visit famous landmarks  Today also saw Charles hold a private meeting with Italy's Prime Minister Giorgia Meloni and watch a Shakespeare performance delivered in Italian. Meanwhile, the Queen squeezed in a stop at an ice cream shop and met with students at a local school, who presented her with cards to mark her 20th wedding anniversary. Charles and Camilla are this evening attending a state banquet at the Palazzo Quirinale in Rome."
    },
    {
        "title": "Israeli troops shot at medics from as close as 12 metres, audio analysis suggests",
        "description": "Audio analysis of footage of an Israeli attack on an aid worker convoy last month suggests that some of the shots were fired from as little as 12 metres away.",
        "url": "https://news.sky.com/story/israeli-troops-shot-at-medics-from-as-close-as-12-metres-audio-analysis-suggests-13345316",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-israeli-military-prcs_6881137.png?20250409182105",
        "type": "World",
        "Author": "Olive Enokido-Lineham, Ben van der Merwe, Michelle Inez Simon and Adam Parker, Data &amp; Forensics",
        "Date Published": "2025-04-09 18:09:00",
        "Headline": "Analysis shared with Sky News calls into question Israel's claim that there was \"no firing from close distance\" in the IDF attack which killed 15 aid workers last month. ",
        "Content": "By Olive Enokido-Lineham, Ben van der Merwe, Michelle Inez Simon and Adam Parker, Data & Forensics  Audio analysis of footage of an Israeli attack on an aid worker convoy last month suggests that some of the shots were fired from as little as 12 metres away. The Israel Defence Forces (IDF) has admitted killing the unarmed medics, saying that the convoy was acting \"suspiciously\". A spokesman told journalists in a 5 April briefing that an initial investigation had found there was \"no firing from close distance\" during the incident on 23 March. Sky News has spoken to two independent audio forensic experts who analysed a 19-minute video of the attack filmed by Rifaat Radwan, one of the medics who was killed. The expert analysis shared with Sky News suggests that the first gunshots heard in the video are likely 40-50 metres away from the phone recording the footage, but gunshots heard later are closer in distance - around 12-18 metres away. In response to our findings, the IDF said a preliminary inquiry indicated that troops \"opened fire due to a perceived threat following an encounter in the area\". The shooting continues for six and a half minutes  The 19-minute video shows a convoy of marked ambulances and a fire engine travelling south along a road east of Rafah city. A spokesman for the Israeli military initially claimed the emergency vehicles were travelling without any headlights or emergency signals, but the IDF later backtracked after the video disproved this claim. All vehicles visible in the convoy have their emergency lights on. The video below shows the first gunshots fired during the attack. After analysing the video, two audio forensic analysts told Sky News that \"multiple shooters\" were likely involved in the incident and \"over 100 gunshots\" were fired. Audible gunshots are first heard 13 minutes and 35 seconds into the video, shortly after the convoy arrives at the scene of an earlier attack. The shooting continues for six and a half minutes. Professor Rob Maher from Montana State University, an audio forensics expert working as an independent consultant, said: \"The first few audible gunshots are likely 40-50 metres away from the (phone) microphone, based upon the crack-pop acoustic sequence and an assumption about the bullet speed. \"With so many audible gunshots, it seems likely that there were many firearms involved, and that those shooters were at different locations at different times during the many minutes of shooting.\" Most bullets travel faster than the speed of sound, this is called 'supersonic'. When a supersonic bullet is fired, the first sound you hear is the sharp 'crack' made by the bullet's shockwave. After that, you hear the 'bang' from the gun firing, or muzzle blast. This second sound travels more slowly - at the speed of sound. The time between the 'crack' and the 'bang' tells you how far away the gun is from the microphone. If the gun is far away, there's a bigger gap between the two sounds. If it's close, the gap is much shorter. Another expert, Steven Beck of Beck Audio Forensics, estimated the distance of the first few gunshots to \"around 40 metres\". He added that the first audible shots are \"most likely military rifles or carbines firing supersonic bullets that pass close to the recorder - meaning they are being fired at\". Both forensic audio experts told us that as the video continues, the gunshots appear much closer - at a distance ranging between 12 and 18 metres. They explain that the \"crack-bang\" timing reduces in comparison to the start of the gunfire - indicating that the distance shortens. Mr Beck said at the end of the video \"there are more shockwaves followed by muzzle blasts. The shooter(s) at these times is much closer, with distances of 12m - 18m\". Due to the overlapping gunshots heard in the video, from the audio it is not currently possible to rule out whether gunshots were fired back. Prior to the attack, the ambulance from which the video is filmed had been searching for a group of paramedics who reported that they had been attacked by Israeli troops. The ambulance travelled from southern Rafah up to the coast, before performing a U-turn and joining a convoy of other emergency vehicles. The shooting began as the convoy arrived at the scene of the first attack. In a statement to Sky News, the IDF said it is \"conducting an inquiry into the incident, which took place in a combat zone, to uncover the truth. \"All the claims raised regarding the incident will be examined and presented in a detailed and thorough manner for a decision on how to handle the event.\" The IDF also says that six of the individuals killed were later identified as \"Hamas terrorists\", though no evidence has been provided to support this claim. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Donald Trump has finally blinked - but it's not the stock markets that have forced him to act",
        "description": "Chalk this one up to the bond vigilantes. ",
        "url": "https://news.sky.com/story/donald-trump-has-finally-blinked-but-its-not-the-stock-markets-that-have-forced-him-to-act-13345483",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6881329.jpg?20250409222758",
        "type": "World",
        "Author": "Ian King",
        "Date Published": "2025-04-09 21:04:00",
        "Headline": "The US president had brushed off the sour equity market reaction to his tariffs as being akin to \"medicine\" that had to be taken. But, as ever, it is the bond markets that have forced Mr Trump to blink.",
        "Content": "\n          Business presenter\n              @iankingsky\n Chalk this one up to the bond vigilantes.  This is the term used periodically to describe investors who push back against what are perceived to be irresponsible fiscal or monetary policies by selling government bonds, in the process pushing up yields, or implied borrowing costs. Most of the focus on markets in the wake of Donald Trump's imposition of tariffs on the rest of the world has, in the last week, been about the calamitous stock market reaction. This was previously something that was assumed to have been taken seriously by Mr Trump. During his first term in the White House, the president took the strength of US equities - in particular the S&P 500 - as being a barometer of the success, or otherwise, of his administration. He had, over the last week, brushed off the sour equity market reaction to his tariffs as being akin to \"medicine\" that had to be taken to rectify what he perceived as harmful trade imbalances around the world. But, as ever, it is the bond markets that have forced Mr Trump to blink - and, make no mistake, blink is what he has done. \n                  Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%\n                 \n                  Money: London has lost 11,300 millionaires in a single year - here's why\n                 \n                  News Corp to take stake in London-listed marketing group Brave Bison\n                 To begin with, following the imposition of his tariffs - which were justified by some cockamamie mathematics and a spurious equation complete with Greek characters - bond prices rose as equities sold off. That was not unusual: big sell-offs in equities, such as those seen in 1987 and in 2008, tend to be accompanied by rallies in bonds.  However, this week has seen something altogether different, with equities continuing to crater and US government bonds following suit. At the beginning of the week yields on 10-year US Treasury bonds, traditionally seen as the safest of safe haven investments, were at 4.00%. By early yesterday, they had risen to 4.51%, a huge jump by the standards of most investors. This is important. The 10-year yield helps determine the interest rate on a whole clutch of financial products important to ordinary Americans, including mortgages, car loans and credit card borrowing. By pushing up the yield on such a security, the bond investors were doing their stuff. It is not over-egging things to say that this was something akin to what Liz Truss and Kwasi Kwarteng experienced when the latter unveiled his mini-budget in October 2022. And, as with the aftermath to that event, the violent reaction in bonds was caused by forced selling. Now part of the selling appears to have been down to investors concluding, probably rightly, that Mr Trump's tariffs would inject a big dose of inflation into the US economy - and inflation is the enemy of all bond investors. Part of it appears to be due to the fact the US Treasury had on Tuesday suffered the weakest demand in nearly 18 months for $58bn worth of three-year bonds that it was trying to sell. But in this particular case, the selling appears to have been primarily due to investors, chiefly hedge funds, unwinding what are known as 'basis trades' - in simple terms a strategy used to profit from the difference between a bond priced at, say, $100 and a futures contract for that same bond priced at, say, $105. In ordinary circumstances, a hedge fund might buy the bond at $100 and sell the futures contract at $105 and make a profit when the two prices converge, in what is normally a relatively risk-free trade. So risk-free, in fact, that hedge funds will 'leverage' - or borrow heavily - themselves to maximise potential returns. The sudden and violent fall in US Treasuries this week reflected the fact that hedge funds were having to close those trades by selling Treasuries. More from Sky News:What a global recession would meanIs there method to the madness?  Confronted by a potential hike in borrowing costs for millions of American homeowners, consumers and businesses, the White House has decided to rein back its tariffs, rightly so. It was immediately rewarded by a spectacular rally in equity markets - the Nasdaq enjoyed its second-best-ever day, and its best since 2001, while the S&P 500 enjoyed its third-best session since World War Two - and by a rally in US Treasuries. The influential Wall Street investment bank Goldman Sachs immediately trimmed its forecast of the probability of a US recession this year from 65% to 45%. Of course, Mr Trump will not admit he has blinked, claiming last night some investors had got \"a little bit yippy, a little bit afraid\". And it is perfectly possible that markets face more volatile days ahead: the spectre of Mr Trump's tariffs being reinstated 90 days from now still looms and a full-blown trade war between the US and China is now raging. But Mr Trump has blinked. The bond vigilantes have brought him to heel. This president, who by his aggressive use of emergency executive powers had appeared to be more powerful than any of his predecessors, will never seem quite so powerful again."
    },
    {
        "title": "Prince Andrew accuser Virginia Giuffre leaves hospital after saying she had 'four days to live' following car crash",
        "description": "Prince Andrew accuser Virginia Giuffre has reportedly left hospital after recently saying she had \"four days to live\".",
        "url": "https://news.sky.com/story/prince-andrew-accuser-virginia-giuffre-leaves-hospital-after-saying-she-had-four-days-to-live-following-car-crash-13345161",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-09 14:00:00",
        "Headline": "Ms Giuffre said on Instagram that her kidneys were failing after a school bus hit her car at 110km/h (68mph).",
        "Content": "Prince Andrew accuser Virginia Giuffre has reportedly left hospital after recently saying she had \"four days to live\". Her representative said she was discharged on Monday, according to US celebrity website People. Photos in Australian media on Wednesday are said to show Ms Giuffre being driven in a vehicle north of Perth. The 41-year-old appeared with a bruised face last week when she posted an Instagram video saying her car had been hit by a speeding school bus as she slowed for a turn. She said: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time...\" Police said they had received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles from Perth, on 24 March. \n                  Virginia Giuffre: Prince Andrew accuser to face court for 'breaching restraining order' after claiming she had 'days to live'\n                 \n                  Sam Jones: US influencer who snatched baby wombat from its mother leaves Australia amid fears for animal's health\n                 \n                  Australian PM Anthony Albanese hits out at baby wombat-snatching US influencer\n                 \"The collision was reported by the bus driver the following day,\" said a spokeswoman. \"There were no reported injuries as a result of the crash.\" A few days after the Instagram video, it emerged Ms Giuffre had been charged with allegedly breaching a family violence restraining order. Ms Giuffre is reported to have separated from her husband. The case was due back in court today (9 April). Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\"."
    },
    {
        "title": "Alessandro Coatti: Tributes to London scientist after body found dismembered in Colombia",
        "description": "Tributes have been paid to a \"passionate and dedicated\" former Royal Society of Biology (RSB) scientist whose dismembered body parts have been found in Colombia.",
        "url": "https://news.sky.com/story/alessandro-coatti-tributes-to-london-scientist-after-body-found-dismembered-in-colombia-13344953",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-alessandro-coatti-rsb_6880596.jpg?20250409082527",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-09 07:56:00",
        "Headline": "The Royal Society of Biology - of which Alessandro Coatti was a member - says it is \"devastated\" to learn of his death.",
        "Content": "Tributes have been paid to a \"passionate and dedicated\" former Royal Society of Biology (RSB) scientist whose dismembered body parts have been found in Colombia. Some of Alessandro Coatti's remains were found in a black suitcase, said investigators in Santa Marta, a port city on northern Colombia's Caribbean coast. A reward of nearly £9,000 has been offered by the city's mayor for information that leads to the capture of those responsible. Carlos Pinedo Cuello said on X the crime \"will not go unpunished\" and pledged to pursue those responsible \"until they are brought to justice\". Mr Coatti studied a master's course at University College London (UCL) and spent eight years as the RSB's science policy officer before being promoted to senior science policy officer. He left the RSB at the end of 2024 to volunteer in Ecuador and travel in South America. The RSB said it was \"devastated\" by his death. \"He was a passionate and dedicated scientist, leading RSB animal science work, writing numerous submissions, organising events and giving evidence in the House of Commons,\" it said in a statement. \"Ale was funny, warm, intelligent, loved by everyone he worked with, and will be deeply missed by all who knew and worked with him. \"Our thoughts and best wishes go out to his friends and family at this truly awful time.\" Read more on Sky News:98 dead in nightclub fireNew theme park to open in UKCharles & Camilla's 20th anniversary Santa Marta is a gateway to some of Colombia's most popular tourist destinations. These include Tayrona National Park, Minca, and the Sierra Nevada de Santa Marta mountains."
    },
    {
        "title": "Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%",
        "description": "Asian markets have reacted positively after Donald Trump paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days, despite the US president increasing those on China to 125%.",
        "url": "https://news.sky.com/story/trump-pauses-higher-tariffs-for-most-countries-for-90-days-but-increases-those-on-china-to-125-13345402",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald-trump_6881341.jpg?20250409224259",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-09 19:00:00",
        "Headline": "Global markets bounced back following the US president's announcement, which he said came after people \"were getting a little bit yippy, a little bit afraid\".",
        "Content": " Donald Trump has paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days - while increasing those on China to 125%. There have been fears of a global recession and stock markets around the world had plummeted after Mr Trump announced his \"Liberation Day\" tariffs on Wednesday 2 April. However, the S&P 500 stock index jumped 9.5% and global markets bounced back following Mr Trump's announcement on Wednesday that the increased tariffs on nearly all trading partners would now be paused. Tariffs latest: Trump gives reasons for pausing some tariffs In a post on his Truth Social platform, Mr Trump said the \"90-day pause\" was for the \"more than 75 countries\" who had not retaliated against his tariffs \"in any way\". He added that during this period they would still have to pay a \"substantially lowered\" 10% tariff, which is \"effective immediately\". It is lower than the 20% tariff that Mr Trump had set for goods from the European Union, 24% on imports from Japan and 25% on products from South Korea. The UK was already going to face a blanket 10% tariff under the new system. Mr Trump said the increased 125% tariff on imported goods from China was \"effective immediately\". He added: \"At some point, hopefully in the near future, China will realise that the days of ripping off the USA, and other countries, is no longer sustainable or acceptable.\" Here's what Donald Trump's tariff pause entails: 'Reciprocal' tariffs on hold  • Higher tariffs that took effect today on 57 trading partners will be paused for 90 days  • These include the EU, Japan and South Korea, all of which will face a baseline 10% duty instead  • Countries that already had a 10% levy imposed since last week - such as the UK - aren't affected by the pause\n China tariffs increased \n • Trump imposed a higher 125% tariff on China \n • That's in addition to levies he imposed during his first term \n • China had hit the US with 84% tariff earlier today, following tit-for-tat escalations\n No change for Canada or Mexico \n • Canadian and Mexican goods will remain subject to 25% fentanyl-related tariffs if they don't comply with the US-Mexico-Canada trade agreement's rules of origin\n • Compliant goods are exempt\n Car and metal tariffs remain \n • Trump's pause doesn't apply to the 25% tariffs he levied on steel and aluminium in March and on cars (autos) on 3 April \n • This 25% tariff on car parts does not come into effect until 3 May\n Sectors at risk \n • Copper, lumber, semiconductors, pharmaceuticals and critical minerals are expected to be subject to separate tariffs, in the same way autos are Hours after Mr Trump announced the pause on tariffs for most countries, a White House official clarified that this did not apply to the 25% duties imposed on some US imports from Mexico and Canada. The tariffs were first announced in February and Mexico and Canada were not included in the \"Liberation Day\" announcements.  Hours before the 125% tariff on China was revealed, Beijing said it was increasing tariffs on US goods by 50%. It meant tariffs of 84% would be enforced on US goods - up from the 34% China had previously planned. China 'want to make a deal' Asked why he posted \"BE COOL\" on Truth Social hours before announcing his tariff pause, Mr Trump told reporters at the White House: \"I thought that people were jumping a little bit out of line.\" \"They were getting yippy, you know, were getting a little bit yippy, a little bit afraid,\" he added. Mr Trump continued: \"China wants to make a deal, they just don't know how to go about it. \"[They're] quite the proud people, and President Xi is a proud man. I know him very well, and they don't know quite how to go about it, but they'll figure it out. \"They're in the process of figuring out, but they want to make a deal.\" Read more:Why Trump finally blinkedIs there method to madness amid market chaos?Who's most likely to see pensions hurt White House press secretary Karoline Leavitt said the walk back was part of a grand negotiating strategy by Mr Trump. \"President Trump created maximum negotiating leverage for himself,\" she said, adding that the news media \"clearly failed to see what President Trump is doing here\". US Treasury Secretary Scott Bessent also insisted Mr Trump had strengthened his hand through his tariffs. \"President Trump created maximum negotiating leverage for himself,\" he said. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Bessent said Mr Trump decided to raise tariffs on China because Beijing hadn't reached out to the US and instead increased its own levies on US goods. Downing Street said that the UK will \"coolly and calmly\" continue its negotiations with the US. A Number 10 spokeswoman said: \"A trade war is in nobody's interests. We don't want any tariffs at all, so for jobs and livelihoods across the UK, we will coolly and calmly continue to negotiate in Britain's interests.\""
    },
    {
        "title": "Prince Andrew accuser Virginia Giuffre leaves hospital after saying she had 'four days to live' following car crash",
        "description": "Prince Andrew accuser Virginia Giuffre has reportedly left hospital after recently saying she had \"four days to live\".",
        "url": "https://news.sky.com/story/prince-andrew-accuser-virginia-giuffre-leaves-hospital-after-saying-she-had-four-days-to-live-following-car-crash-13345161",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-09 14:00:00",
        "Headline": "Ms Giuffre said on Instagram that her kidneys were failing after a school bus hit her car at 110km/h (68mph).",
        "Content": "Prince Andrew accuser Virginia Giuffre has reportedly left hospital after recently saying she had \"four days to live\". Her representative said she was discharged on Monday, according to US celebrity website People. Photos in Australian media on Wednesday are said to show Ms Giuffre being driven in a vehicle north of Perth. The 41-year-old appeared with a bruised face last week when she posted an Instagram video saying her car had been hit by a speeding school bus as she slowed for a turn. She said: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time...\" Police said they had received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles from Perth, on 24 March. \n                  Virginia Giuffre: Prince Andrew accuser to face court for 'breaching restraining order' after claiming she had 'days to live'\n                 \n                  Sam Jones: US influencer who snatched baby wombat from its mother leaves Australia amid fears for animal's health\n                 \n                  Australian PM Anthony Albanese hits out at baby wombat-snatching US influencer\n                 \"The collision was reported by the bus driver the following day,\" said a spokeswoman. \"There were no reported injuries as a result of the crash.\" A few days after the Instagram video, it emerged Ms Giuffre had been charged with allegedly breaching a family violence restraining order. Ms Giuffre is reported to have separated from her husband. The case was due back in court today (9 April). Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\"."
    },
    {
        "title": "Donald Trump has finally blinked - but it's not the stock markets that have forced him to act",
        "description": "Chalk this one up to the bond vigilantes. ",
        "url": "https://news.sky.com/story/donald-trump-has-finally-blinked-but-its-not-the-stock-markets-that-have-forced-him-to-act-13345483",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6881329.jpg?20250409222758",
        "type": "US",
        "Author": "Ian King",
        "Date Published": "2025-04-09 21:04:00",
        "Headline": "The US president had brushed off the sour equity market reaction to his tariffs as being akin to \"medicine\" that had to be taken. But, as ever, it is the bond markets that have forced Mr Trump to blink.",
        "Content": "\n          Business presenter\n              @iankingsky\n Chalk this one up to the bond vigilantes.  This is the term used periodically to describe investors who push back against what are perceived to be irresponsible fiscal or monetary policies by selling government bonds, in the process pushing up yields, or implied borrowing costs. Most of the focus on markets in the wake of Donald Trump's imposition of tariffs on the rest of the world has, in the last week, been about the calamitous stock market reaction. This was previously something that was assumed to have been taken seriously by Mr Trump. During his first term in the White House, the president took the strength of US equities - in particular the S&P 500 - as being a barometer of the success, or otherwise, of his administration. He had, over the last week, brushed off the sour equity market reaction to his tariffs as being akin to \"medicine\" that had to be taken to rectify what he perceived as harmful trade imbalances around the world. But, as ever, it is the bond markets that have forced Mr Trump to blink - and, make no mistake, blink is what he has done. \n                  Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%\n                 \n                  Money: London has lost 11,300 millionaires in a single year - here's why\n                 \n                  News Corp to take stake in London-listed marketing group Brave Bison\n                 To begin with, following the imposition of his tariffs - which were justified by some cockamamie mathematics and a spurious equation complete with Greek characters - bond prices rose as equities sold off. That was not unusual: big sell-offs in equities, such as those seen in 1987 and in 2008, tend to be accompanied by rallies in bonds.  However, this week has seen something altogether different, with equities continuing to crater and US government bonds following suit. At the beginning of the week yields on 10-year US Treasury bonds, traditionally seen as the safest of safe haven investments, were at 4.00%. By early yesterday, they had risen to 4.51%, a huge jump by the standards of most investors. This is important. The 10-year yield helps determine the interest rate on a whole clutch of financial products important to ordinary Americans, including mortgages, car loans and credit card borrowing. By pushing up the yield on such a security, the bond investors were doing their stuff. It is not over-egging things to say that this was something akin to what Liz Truss and Kwasi Kwarteng experienced when the latter unveiled his mini-budget in October 2022. And, as with the aftermath to that event, the violent reaction in bonds was caused by forced selling. Now part of the selling appears to have been down to investors concluding, probably rightly, that Mr Trump's tariffs would inject a big dose of inflation into the US economy - and inflation is the enemy of all bond investors. Part of it appears to be due to the fact the US Treasury had on Tuesday suffered the weakest demand in nearly 18 months for $58bn worth of three-year bonds that it was trying to sell. But in this particular case, the selling appears to have been primarily due to investors, chiefly hedge funds, unwinding what are known as 'basis trades' - in simple terms a strategy used to profit from the difference between a bond priced at, say, $100 and a futures contract for that same bond priced at, say, $105. In ordinary circumstances, a hedge fund might buy the bond at $100 and sell the futures contract at $105 and make a profit when the two prices converge, in what is normally a relatively risk-free trade. So risk-free, in fact, that hedge funds will 'leverage' - or borrow heavily - themselves to maximise potential returns. The sudden and violent fall in US Treasuries this week reflected the fact that hedge funds were having to close those trades by selling Treasuries. More from Sky News:What a global recession would meanIs there method to the madness?  Confronted by a potential hike in borrowing costs for millions of American homeowners, consumers and businesses, the White House has decided to rein back its tariffs, rightly so. It was immediately rewarded by a spectacular rally in equity markets - the Nasdaq enjoyed its second-best-ever day, and its best since 2001, while the S&P 500 enjoyed its third-best session since World War Two - and by a rally in US Treasuries. The influential Wall Street investment bank Goldman Sachs immediately trimmed its forecast of the probability of a US recession this year from 65% to 45%. Of course, Mr Trump will not admit he has blinked, claiming last night some investors had got \"a little bit yippy, a little bit afraid\". And it is perfectly possible that markets face more volatile days ahead: the spectre of Mr Trump's tariffs being reinstated 90 days from now still looms and a full-blown trade war between the US and China is now raging. But Mr Trump has blinked. The bond vigilantes have brought him to heel. This president, who by his aggressive use of emergency executive powers had appeared to be more powerful than any of his predecessors, will never seem quite so powerful again."
    },
    {
        "title": "Donald Trump has finally blinked - but it's not the stock markets that have forced him to act",
        "description": "Chalk this one up to the bond vigilantes. ",
        "url": "https://news.sky.com/story/donald-trump-has-finally-blinked-but-its-not-the-stock-markets-that-have-forced-him-to-act-13345483",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-new-york-stock-exchange_6881329.jpg?20250409222758",
        "type": "Business",
        "Author": "Ian King",
        "Date Published": "2025-04-09 21:04:00",
        "Headline": "The US president had brushed off the sour equity market reaction to his tariffs as being akin to \"medicine\" that had to be taken. But, as ever, it is the bond markets that have forced Mr Trump to blink.",
        "Content": "\n          Business presenter\n              @iankingsky\n Chalk this one up to the bond vigilantes.  This is the term used periodically to describe investors who push back against what are perceived to be irresponsible fiscal or monetary policies by selling government bonds, in the process pushing up yields, or implied borrowing costs. Most of the focus on markets in the wake of Donald Trump's imposition of tariffs on the rest of the world has, in the last week, been about the calamitous stock market reaction. This was previously something that was assumed to have been taken seriously by Mr Trump. During his first term in the White House, the president took the strength of US equities - in particular the S&P 500 - as being a barometer of the success, or otherwise, of his administration. He had, over the last week, brushed off the sour equity market reaction to his tariffs as being akin to \"medicine\" that had to be taken to rectify what he perceived as harmful trade imbalances around the world. But, as ever, it is the bond markets that have forced Mr Trump to blink - and, make no mistake, blink is what he has done. \n                  Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%\n                 \n                  Money: London has lost 11,300 millionaires in a single year - here's why\n                 \n                  News Corp to take stake in London-listed marketing group Brave Bison\n                 To begin with, following the imposition of his tariffs - which were justified by some cockamamie mathematics and a spurious equation complete with Greek characters - bond prices rose as equities sold off. That was not unusual: big sell-offs in equities, such as those seen in 1987 and in 2008, tend to be accompanied by rallies in bonds.  However, this week has seen something altogether different, with equities continuing to crater and US government bonds following suit. At the beginning of the week yields on 10-year US Treasury bonds, traditionally seen as the safest of safe haven investments, were at 4.00%. By early yesterday, they had risen to 4.51%, a huge jump by the standards of most investors. This is important. The 10-year yield helps determine the interest rate on a whole clutch of financial products important to ordinary Americans, including mortgages, car loans and credit card borrowing. By pushing up the yield on such a security, the bond investors were doing their stuff. It is not over-egging things to say that this was something akin to what Liz Truss and Kwasi Kwarteng experienced when the latter unveiled his mini-budget in October 2022. And, as with the aftermath to that event, the violent reaction in bonds was caused by forced selling. Now part of the selling appears to have been down to investors concluding, probably rightly, that Mr Trump's tariffs would inject a big dose of inflation into the US economy - and inflation is the enemy of all bond investors. Part of it appears to be due to the fact the US Treasury had on Tuesday suffered the weakest demand in nearly 18 months for $58bn worth of three-year bonds that it was trying to sell. But in this particular case, the selling appears to have been primarily due to investors, chiefly hedge funds, unwinding what are known as 'basis trades' - in simple terms a strategy used to profit from the difference between a bond priced at, say, $100 and a futures contract for that same bond priced at, say, $105. In ordinary circumstances, a hedge fund might buy the bond at $100 and sell the futures contract at $105 and make a profit when the two prices converge, in what is normally a relatively risk-free trade. So risk-free, in fact, that hedge funds will 'leverage' - or borrow heavily - themselves to maximise potential returns. The sudden and violent fall in US Treasuries this week reflected the fact that hedge funds were having to close those trades by selling Treasuries. More from Sky News:What a global recession would meanIs there method to the madness?  Confronted by a potential hike in borrowing costs for millions of American homeowners, consumers and businesses, the White House has decided to rein back its tariffs, rightly so. It was immediately rewarded by a spectacular rally in equity markets - the Nasdaq enjoyed its second-best-ever day, and its best since 2001, while the S&P 500 enjoyed its third-best session since World War Two - and by a rally in US Treasuries. The influential Wall Street investment bank Goldman Sachs immediately trimmed its forecast of the probability of a US recession this year from 65% to 45%. Of course, Mr Trump will not admit he has blinked, claiming last night some investors had got \"a little bit yippy, a little bit afraid\". And it is perfectly possible that markets face more volatile days ahead: the spectre of Mr Trump's tariffs being reinstated 90 days from now still looms and a full-blown trade war between the US and China is now raging. But Mr Trump has blinked. The bond vigilantes have brought him to heel. This president, who by his aggressive use of emergency executive powers had appeared to be more powerful than any of his predecessors, will never seem quite so powerful again."
    },
    {
        "title": "Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%",
        "description": "Asian markets have reacted positively after Donald Trump paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days, despite the US president increasing those on China to 125%.",
        "url": "https://news.sky.com/story/trump-pauses-higher-tariffs-for-most-countries-for-90-days-but-increases-those-on-china-to-125-13345402",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-donald-trump_6881341.jpg?20250409224259",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-09 19:00:00",
        "Headline": "Global markets bounced back following the US president's announcement, which he said came after people \"were getting a little bit yippy, a little bit afraid\".",
        "Content": " Donald Trump has paused his so-called \"reciprocal\" tariffs on most of America's trading partners for 90 days - while increasing those on China to 125%. There have been fears of a global recession and stock markets around the world had plummeted after Mr Trump announced his \"Liberation Day\" tariffs on Wednesday 2 April. However, the S&P 500 stock index jumped 9.5% and global markets bounced back following Mr Trump's announcement on Wednesday that the increased tariffs on nearly all trading partners would now be paused. Tariffs latest: Trump gives reasons for pausing some tariffs In a post on his Truth Social platform, Mr Trump said the \"90-day pause\" was for the \"more than 75 countries\" who had not retaliated against his tariffs \"in any way\". He added that during this period they would still have to pay a \"substantially lowered\" 10% tariff, which is \"effective immediately\". It is lower than the 20% tariff that Mr Trump had set for goods from the European Union, 24% on imports from Japan and 25% on products from South Korea. The UK was already going to face a blanket 10% tariff under the new system. Mr Trump said the increased 125% tariff on imported goods from China was \"effective immediately\". He added: \"At some point, hopefully in the near future, China will realise that the days of ripping off the USA, and other countries, is no longer sustainable or acceptable.\" Here's what Donald Trump's tariff pause entails: 'Reciprocal' tariffs on hold  • Higher tariffs that took effect today on 57 trading partners will be paused for 90 days  • These include the EU, Japan and South Korea, all of which will face a baseline 10% duty instead  • Countries that already had a 10% levy imposed since last week - such as the UK - aren't affected by the pause\n China tariffs increased \n • Trump imposed a higher 125% tariff on China \n • That's in addition to levies he imposed during his first term \n • China had hit the US with 84% tariff earlier today, following tit-for-tat escalations\n No change for Canada or Mexico \n • Canadian and Mexican goods will remain subject to 25% fentanyl-related tariffs if they don't comply with the US-Mexico-Canada trade agreement's rules of origin\n • Compliant goods are exempt\n Car and metal tariffs remain \n • Trump's pause doesn't apply to the 25% tariffs he levied on steel and aluminium in March and on cars (autos) on 3 April \n • This 25% tariff on car parts does not come into effect until 3 May\n Sectors at risk \n • Copper, lumber, semiconductors, pharmaceuticals and critical minerals are expected to be subject to separate tariffs, in the same way autos are Hours after Mr Trump announced the pause on tariffs for most countries, a White House official clarified that this did not apply to the 25% duties imposed on some US imports from Mexico and Canada. The tariffs were first announced in February and Mexico and Canada were not included in the \"Liberation Day\" announcements.  Hours before the 125% tariff on China was revealed, Beijing said it was increasing tariffs on US goods by 50%. It meant tariffs of 84% would be enforced on US goods - up from the 34% China had previously planned. China 'want to make a deal' Asked why he posted \"BE COOL\" on Truth Social hours before announcing his tariff pause, Mr Trump told reporters at the White House: \"I thought that people were jumping a little bit out of line.\" \"They were getting yippy, you know, were getting a little bit yippy, a little bit afraid,\" he added. Mr Trump continued: \"China wants to make a deal, they just don't know how to go about it. \"[They're] quite the proud people, and President Xi is a proud man. I know him very well, and they don't know quite how to go about it, but they'll figure it out. \"They're in the process of figuring out, but they want to make a deal.\" Read more:Why Trump finally blinkedIs there method to madness amid market chaos?Who's most likely to see pensions hurt White House press secretary Karoline Leavitt said the walk back was part of a grand negotiating strategy by Mr Trump. \"President Trump created maximum negotiating leverage for himself,\" she said, adding that the news media \"clearly failed to see what President Trump is doing here\". US Treasury Secretary Scott Bessent also insisted Mr Trump had strengthened his hand through his tariffs. \"President Trump created maximum negotiating leverage for himself,\" he said. 👉 Listen to Sky News Daily on your podcast app 👈 Mr Bessent said Mr Trump decided to raise tariffs on China because Beijing hadn't reached out to the US and instead increased its own levies on US goods. Downing Street said that the UK will \"coolly and calmly\" continue its negotiations with the US. A Number 10 spokeswoman said: \"A trade war is in nobody's interests. We don't want any tariffs at all, so for jobs and livelihoods across the UK, we will coolly and calmly continue to negotiate in Britain's interests.\""
    },
    {
        "title": "News Corp to take stake in London-listed marketing group Brave Bison",
        "description": "Rupert Murdoch's News Corporation is in advanced talks to take a stake in a London-listed marketing specialist backed by Lord Ashcroft, the former Conservative Party treasurer.",
        "url": "https://news.sky.com/story/news-corp-to-take-stake-in-london-listed-marketing-group-brave-bison-13345150",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rupert-murdoch-the-sun_6880900.jpg?20250409141319",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-09 12:57:00",
        "Headline": "News UK, the British arm of Rupert Murdoch's media group, will be paid for influencer marketing unit The Fifth with a mixture of cash and stock in Brave Bison, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rupert Murdoch's News Corporation is in advanced talks to take a stake in a London-listed marketing specialist backed by Lord Ashcroft, the former Conservative Party treasurer. Sky News has learnt that the media tycoon's British subsidiary, News UK, is close to agreeing a deal to combine its influencer marketing division - which is called The Fifth - with Brave Bison, an acquisitive group run by brothers Oli and Theo Green. Sources said the deal could be announced as early as Thursday morning. News UK publishes The Sun and The Times, among other media assets. If completed, the transaction would involve Brave Bison acquiring The Fifth with a combination of cash and shares that would result in News UK becoming one of its largest shareholders. The purchase price is said to be in the region of £8m. The Fifth has worked with the television host and model Maya Jama on a campaign for the energy drink Lucozade, and Amelia Dimoldenberg, the YouTube star. \n                  What have Prince Harry and NGN said about their settlement - and what happens next?\n                 \n                  Rupert Murdoch loses legal battle to wrestle control of his media empire\n                 \n                  Murdoch-owned firm ends Rightmove takeover interest\n                 Its other clients include Samsung and Tommee Tippee. Read more business newsCould Trump's tariffs tip the world into recession?Unilever faces investor revolt over new chief's pay package The deal will be the third struck by Brave Bison this year, with the previous transactions including the purchase of Engage Digital, a key digital partner to sporting properties including the Men's T20 Cricket World Cup. The Green brothers took over the Brave Bison in 2020, and have overseen a sharp strategic realignment and improvement in its performance. In 2023, it bought the podcaster and entrepreneur Steven Bartlett's social media and influencer agency, SocialChain. In total, the company has struck six takeover deals since the Greens assumed control. At Wednesday's stock market close, Brave Bison had a market capitalisation of about £31m. News UK and Brave Bison declined to comment."
    },
    {
        "title": "British passports are about to get more expensive - here's who can get an Irish one",
        "description": "Getting your hands on a British passport will cost you 7% more from tomorrow.&#160;",
        "url": "https://news.sky.com/story/british-passports-are-about-to-get-more-expensive-heres-who-can-get-an-irish-one-13344963",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-uk-passport-passport_6796137.jpg?20250110144424",
        "type": "Business",
        "Author": "Ollie Cooper",
        "Date Published": "2025-04-09 08:16:00",
        "Headline": "The cost of getting a British passport is set to jump 7% from Thursday - rising to £94.50. This means over the past two years the price has jumped more than a quarter.",
        "Content": "\n          Live news reporter\n              @OCJourno\n Getting your hands on a British passport will cost you 7% more from tomorrow.  The cost of the online application will jump up by £6 to £94.50. Here, we're going to look at how you can beat the hike... Why is the price going up? Over the past two years the cost of a UK passport application has risen more than 25%. Where is all that money going? The Home Office insists it makes no profits, and is focused on keeping the waiting time for a British passport at around three weeks. \"The new fees will help the Home Office to continue to move towards a system that meets its costs through those who use it, reducing reliance on funding from general taxation,\" the government said when it announced the rise. Part of the cost goes towards funding passport control and border officers, while some of the money supports \"consular support overseas, including lost or stolen passports\", the government says. Can I beat the cost increase if I'm quick? If you put your application in to renew by 9 April (the end of today), you could save yourself six quid. An Irish passport? The Irish passport was recently named the most powerful in the world for perks and entry. Because Ireland is in the EU, you skip long queues in EU countries. You also don't need to get yourself an Electronic Travel Authorisation (ETA) every time you travel to the UK - the only country in the world that doesn't have to. Read more about ETAs in the Money blog. Finally, they're more than £30 cheaper than the British ones at €75/£62. Who is eligible for an Irish passport other than Irish citizens? The Department of Foreign Affairs explains: \"If you or your parent were born on the island of Ireland before 2005, you are an Irish citizen. You can apply for an Irish passport without making an application for citizenship.\" From 2005 onwards, it depends: You can check if you're eligible for an Irish passport here. Read more from Sky News:Chancellor to hold tariff crisis talksCould Trump's tariffs tip the world into recession?New Universal theme park set to open in UK How does the price compare? Before the rise, the UK passport was already among the most expensive in Europe, and it retains its spot with the increase. Italy (£97), Denmark (£100) and Switzerland (£123) cost more, while Norway (£55) and Lithuania (£43) are considerably cheaper."
    },
    {
        "title": "Unilever faces investor revolt over new chief's pay package",
        "description": "Unilever, the FTSE-100 consumer goods giant behind Marmite and Lynx, is facing an investor backlash over its new chief executive's multimillion pound pay package.",
        "url": "https://news.sky.com/story/unilever-faces-investor-revolt-over-new-chiefs-pay-package-13345122",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-unilever-russia-war_6646890.png?20240804071920",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-09 12:06:00",
        "Headline": "The FTSE-100 consumer goods giant is expected to see a significant backlash against Fernando Fernandez's €1.8m salary at its AGM this month, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Unilever, the FTSE-100 consumer goods giant behind Marmite and Lynx, is facing an investor backlash over its new chief executive's multimillion pound pay package. Sky News has learnt that ISS, a leading proxy adviser, has recommended that shareholders vote against Unilever's remuneration report at its annual meeting later this month. Sources familiar with ISS's report on Unilever's AGM resolutions say the agency objects to the discount of just €50,000 that the Ben & Jerry's owner has applied to the base salary of Fernando Fernandez, compared to Hein Schumacher, his predecessor. Tariffs latest: Trump claimed world was 'kissing my a**' for deals Unilever surprised the City in February when it announced Mr Schumacher would leave after just two years in the job, amid frustration in its boardroom about the pace of growth. In an accompanying statement, Unilever said Mr Fernandez - previously the chief financial officer - would be paid a basic salary of €1.8m, modestly lower than Mr Schumacher's €1.85m. In a summary of ISS's report, the proxy adviser said Mr Fernandez's \"base salary as new CEO is significant and represents a small discount to the former CEO Hein Schumacher's base salary\". \n                  Donald Trump has finally blinked - but it's not the stock markets that have forced him to act\n                 \n                  Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%\n                 \n                  Money: London has lost 11,300 millionaires in a single year - here's why\n                 \"The company does not appear to have sufficiently accounted previously raised shareholder concerns on the CEO role's pay arrangement when setting Mr Fernandez's remuneration.\" Unilever had also \"disapplied time pro-rating\" in respect of former executive directors' long-term share awards, meaning that the company could have legitimately decided to award them smaller amounts of stock than it did. On Wednesday afternoon, shares in Unilever were trading at around £44.79, giving the maker of Magnum ice cream and Persil washing-up liquid a valuation of close to £115bn. Unilever did not respond to a request for comment."
    },
    {
        "title": "Aviva joins backers of university spinouts vehicle Northern Gritstone",
        "description": "Aviva, the FTSE-100 insurance group and asset manager, is joining the list of backers ploughing millions of pounds into some of Britain's most promising university spinout companies.",
        "url": "https://news.sky.com/story/aviva-joins-backers-of-university-spinouts-vehicle-northern-gritstone-13345137",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-jim-oneill-neill-lord_6296345.jpg?20230924092525",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-09 12:32:00",
        "Headline": "Chaired by former Treasury minister Lord O'Neill, Northern Gritstone will announce on Thursday that it has raised £50m from a syndicate of asset managers and pension funds, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Aviva, the FTSE-100 insurance group and asset manager, is joining the list of backers ploughing millions of pounds into some of Britain's most promising university spinout companies. Sky News has learnt that Northern Gritstone, which is chaired by the former Treasury minister Lord O'Neill, will announce this week that it has landed £50m in new funding from a syndicate of pension funds and other investors. Sources said £35m of the capital was being provided by Northern LGPS, the collective asset pool of the Greater Manchester, Merseyside and West Yorkshire pension funds, with an additional £15m from Aviva and Fulcrum Asset Management. Tariffs latest: Trump claimed world was 'kissing my a**' for deals The funding injection will take Northern Gritstone's total permanent capital base to just over £360m, according to a statement provided by the company in response to an enquiry from Sky News. Since its launch in 2022, Northern Gritstone has invested in dozens of early-stage companies spun out of universities in Leeds, Sheffield and Manchester. As part of the £50m fundraising, Paddy Dowdall, assistant director of the Greater Manchester Pension Fund, is joining the Northern Gritstone board as a non-executive director. \n                  Donald Trump has finally blinked - but it's not the stock markets that have forced him to act\n                 \n                  Trump pauses higher tariffs for most countries for 90 days - but increases those on China to 125%\n                 \n                  Money: London has lost 11,300 millionaires in a single year - here's why\n                 The vehicle is focused on companies operating in fields such as deeptech and life sciences, including semiconductor design and manufacturing; novel materials; secure computing; AI; healthtech; and gene therapies. \"We are very grateful for this further support from investors in our journey to develop world winning businesses in the North of England originating from our university ecosystem and contributing to the future of higher value added activity and the North's productivity,\" Lord O'Neill said in the statement. Duncan Johnson, Northern Gritstone's chief executive said the fundraising provided evidence of \"our ability to create the world-leading businesses of tomorrow based on world-class innovation that exists in the north of England\". Its latest raise comes as a number of university spinout ventures in other areas of the UK are struggling to raise sufficient funding to get off the ground. Ben Luckett, managing director, venture and strategic capital at Aviva Investors said: \"University spinouts will help power innovation, drive tangible real-world impact, and support the UK to get ready for the future.\""
    },
    {
        "title": "US trade war with China grows more bloody as Trump ups the ante once more",
        "description": "The US has increased tariffs on Chinese goods to 125%, as the tit-for-tat trade war with America's biggest competitor hots up.",
        "url": "https://news.sky.com/story/china-to-impose-additional-tariffs-on-us-goods-as-trade-war-ramps-up-13345062",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-china-taicang-shipment_6879030.jpg?20250407162854",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-09 11:03:00",
        "Headline": "The White House has signalled the US has no intention of backing down, with the US responding by calling China back to the negotiating table.",
        "Content": "The US has increased tariffs on Chinese goods to 125%, as the tit-for-tat trade war with America's biggest competitor hots up. Stock markets will now be braced for more retaliation from China, following Wednesday's announcement of additional tariffs on US goods. Those are due to come into into force on Thursday. It means tariffs of 84% will be enforced on US goods - up from the 34% China had previously planned, but they could still go higher. Tariffs latest: Trump claims world 'kissing my a**' for deals As part of a new complaint to the World Trade Organisation, China said the United States' decision to impose tariffs threatened to further destabilise global trade. \"The situation has dangerously escalated,\" China said in a statement. \"As one of the affected members, China expresses grave concern and firm opposition to this reckless move.\" The White House has signalled the US has no intention of backing down, with the US responding by calling China back to the negotiating table. Treasury Secretary Scott Bessent had described China's retaliatory tariffs as \"unfortunate\" and a \"loser\" for China. Asia correspondent China was always going to retaliate and when it did, it was decisive. Its retaliatory tariffs matched with the US like-for-like and it has imposed restrictions on 18 US companies. When taken in addition to levies that were already in place, import taxes between the US and China are now so high that trade between the two is all but impossible.  The enormity of the world's two biggest economies essentially ceasing to trade has barely sunk in. There is a genuine belief at the top levels of the Chinese system that the US's ultimate goal is to restrain China and undermine its growth, in that context capitulating to Trump serves no purpose and just isn't an option. But there is a sense that there was a degree of restraint behind the rage. In the end, the measures mainly targeted trade and some of the more political options that would have seriously raised the stakes were avoided. Perhaps China really does want to avoid escalation or perhaps it wants to leave some option open for later.  This moment does mark a real low in US-China relations, because throughout the years, despite all the strife and disagreement, trade was always there as a backstop, the one issue which inextricably linked them. Without that, it's unclear what could come next. Mr Bessent said in an interview with Fox Business Network: \"I think it's unfortunate that the Chinese actually don't want to come and negotiate, because they are the worst offenders in the international trading system. \"Their exports to the US are five times our exports to China. They can raise their tariffs, but so what?\" 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The European Union is in discussion about its own retaliatory measures. The European Commission said on Wednesday it had secured backing from EU countries and would press ahead with a first set of countermeasures from 15 April against US President Donald Trump's 25% import tariffs on steel and aluminium. The 27-nation bloc will put in place extra duties mostly of 25% on a range of US imports in response specifically to the US metals tariffs. It is still assessing how to respond to the car and broader levies."
    },
    {
        "title": "Defence secretary to urge coalition of the willing to increase pressure on Russia to end war",
        "description": "The defence secretary will urge \"coalition of the willing\" nations to increase pressure on Russia to end its war in Ukraine as plans to support peace ramp up.",
        "url": "https://news.sky.com/story/defence-secretary-to-urge-coalition-of-the-willing-to-increase-pressure-on-russia-to-end-war-13345346",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-john-healey-zelenskyy_6620779.jpg?20240707191040",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-04-09 18:03:00",
        "Headline": "Defence ministers will discuss operational plans for a peacekeeping force before they meet again, where the UK and Germany will push other countries to provide more equipment for current fighting.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The defence secretary will urge \"coalition of the willing\" nations to increase pressure on Russia to end its war in Ukraine as plans to support peace ramp up. John Healey and French defence minister Sebastien Lecornu will lead about 30 defence ministers in Brussels on Thursday as they discuss operational plans for a multinational peacekeeping force in Ukraine as part of the \"coalition of the willing\". They will look at each nation's capabilities and how they could be best used to support Ukraine's long-term defence and security as part of what the Ministry of Defence called a \"reassurance force\". UK and French military chiefs discussed planning with Ukrainian President Volodymyr Zelenskyy and his military chiefs in Kyiv last weekend. Peace negotiations are ongoing between the US and Russia, however, US officials appear to be growing increasingly impatient with the lack of progress after Donald Trump publicly suggested a month ago Vladimir Putin wants to end the war. Read more: Who's in and who's out of the coalition of the willing? Last Tuesday, the Kremlin described the latest US peace proposal as unacceptable in its current form because it does not solve the \"root causes\" of the conflict. \n                  Fewer criminals set to be jailed, say reports as prisons in England and Wales struggle with overcrowding\n                 \n                  Local elections: From where they are to what they're all for - your ultimate guide\n                 \n                  Politics latest: UK will 'coolly and calmly' engage with Trump after tariff pause, says Number 10\n                 Mr Putin wants to dismantle Ukraine as an independent, functioning state and has demanded Kyiv recognise Moscow's annexation of Crimea and other partly occupied areas and pull its forces out, as well as a pledge for Ukraine to never join NATO and to demilitarise. Secretary of State Marco Rubio said on Friday Mr Trump is not \"going to fall into the trap of endless negotiations\" with Moscow. Read more:Two Chinese citizens 'fighting for Russia' captured in UkraineZelenskyy makes dig at US over response to Russian attack  Despite the apparent impasse in talks, the coalition of the willing - which does not include the US - is continuing with its plans for when peace is agreed. Mr Healey is expected to tell his fellow defence ministers: \"We cannot jeopardise the peace by forgetting about the war, so we must put even more pressure on Putin and step up our support for Ukraine - both in today's fight and the push for peace. \"Our commitment is to put Ukraine in the strongest position to protect Ukraine's sovereignty and deter future Russian aggression.\" On Friday, the defence secretary and his German counterpart, Boris Pistorius, will chair the 27th meeting of the Ukraine Defence Contact Group at NATO's headquarters in Brussels. The group is an alliance of about 50 countries - all 32 NATO member states, including the US, and about 20 other countries - that has been supporting Ukraine by sending military equipment since Russia invaded in April 2022. Mr Healey and Mr Pistorius will \"drive forward additional military support\" as Russia continues to attack Ukraine. The latest development in the war has seen Mr Zelenskyy say Ukraine has intelligence there are at least 155 Chinese citizens fighting for the Russian military. On Tuesday, Mr Zelenskyy released a video of a Chinese soldier taken by Ukrainian forces, with another captured by Ukrainian forces, he said. Chinese foreign ministry spokesperson Lin Jian denied claims there were \"many more\" Chinese citizens fighting alongside Russians in Ukraine."
    },
    {
        "title": "Fewer criminals set to be jailed, say reports as prisons in England and Wales struggle with overcrowding",
        "description": "Ministers want reforms to sentencing policy that will reduce the prison population by more than ten percent, Sky News has learnt.",
        "url": "https://news.sky.com/story/fewer-criminals-set-to-be-jailed-say-reports-as-prisons-in-england-and-wales-struggle-with-overcrowding-13345162",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-prisons-overcrowding_6553274.jpg?20240513215025",
        "type": "Politics",
        "Author": "Mollie Malone",
        "Date Published": "2025-04-09 13:14:00",
        "Headline": "Sky News understands an independent policy review will suggest restricting the use of short sentences, deploying alternatives to custody and imprisoning fewer women.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Ministers want reforms to sentencing policy that will reduce the prison population by more than ten percent, Sky News has learnt. The sentencing review is under pressure to deliver recommendations that will send 9,500 fewer people to jail by 2028. The independent review of sentencing policy, being led by former Justice Secretary David Gauke, will submit its findings to the government next month. There are currently 87,938 people in prison in England and Wales. The male estate is almost full again, operating at more than 99% capacity, with emergency measures triggered to hold offenders in police cells as jails run out of space. Government projections suggest the prison population will increase to more than 100,000 inmates by 2029. In an indication of how serious the current situation has become, Sky News has been told of prison governors getting messages directly from court officials outside of working hours, asking them to free up space in order to send new prisoners to jail.  The sentencing review panel is expected to make suggestions around the impact of short sentences, greater use of alternatives to prison custody and possible steps to reduce the number of women behind bars. \n                  Daughter's plea for help to solve mother's murder 30 years ago\n                 \n                  Parents of boy whose outbursts left them fearing for their lives say Adolescence 'touched a nerve'\n                 \n                  Man charged with murder of 16-year-old boy in Huddersfield - as victim named\n                 But sources close to the review process suggest that the scrapping of short sentences will only deliver \"hundreds\" of free spaces, with more radical changes to sentencing practises needed to ease overcrowding. Certain crimes are outside the scope of the review - such as murder - but reforms being considered could see other serious offenders serve less time in prison. It's understood the sentencing review panel has met with relevant authorities for feedback, and there is nervousness amongst the police about the additional number of people that will need to be managed in the community. Authorities support the need for a review of sentencing, with shifts away from custodial terms for some offenders to solve the prisons crisis, but changes will increase policing pressures. The review will also consider other examples of policy and penal systems from around the world. Read more from Sky News:Jenrick: Sentencing 'two-tier' justiceRising prison numbers overwhelming jails On a recent trip to Texas, the justice secretary saw how offenders earned 'good behaviour' credits, giving inmates the ability to serve less time behind bars by participating in work or courses. David Gauke had also previously pointed to the use of open prisons in Spain, where 25% of offenders are housed in lower security jails, with inmates able to leave prison for study and work during the day. The capacity problems in England and Wales are more acute in the higher security, or 'closed', estates, so greater use of open prisons would help ease overcrowding. But there are concerns among open prison governors that high-risk offenders are being sent to open prisons when they shouldn't be, for capacity reasons. A Ministry of Justice spokesperson said: \"The government inherited overcrowded prisons on the point of collapse - we introduced emergency measures and were clear that longer term action was required. \"Alongside our commitment to build 14,000 prison places, we will carefully consider all recommendations by the independent Sentencing Review to ensure we never run out of space again.\""
    },
    {
        "title": "Local elections: From where they are to what they're all for - your ultimate guide",
        "description": "A host of local and mayoral elections will be taking place across England on Thursday 1 May - the first voting day since the general election last year.",
        "url": "https://news.sky.com/story/local-elections-from-where-they-are-to-what-theyre-all-for-your-ultimate-guide-13344978",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-kemi-b_6880711.jpg?20250409111716",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-09 08:39:00",
        "Headline": "Votes for a new MP, several mayors and almost two dozen local authorities are all coming at the start of next month. Here's everything you need to know.",
        "Content": "A host of local and mayoral elections will be taking place across England on Thursday 1 May - the first voting day since the general election last year. There will also be a new Member of Parliament. Here is everything you need to know - from what's at stake to how you can vote. There will be local elections in 23 of England's 317 local authorities on 1 May. Some are slightly different to others, depending on the type of authority. Here is the full list: County councils • Cambridgeshire• Derbyshire• Devon• Gloucestershire• Hertfordshire• Kent• Lancashire• Leicestershire• Lincolnshire• Nottinghamshire• Oxfordshire• Staffordshire• Warwickshire• Worcestershire Unitary authorities  • Buckinghamshire• Cornwall• County Durham• North Northamptonshire• Northumberland• Shropshire• West Northamptonshire• Wiltshire Metropolitan district • Doncaster The Isles of Scilly, which has a unique governance structure, is also holding a local election of its own. Additionally, about 1,270 parish councils will be holding elections. A county council is part of a two-tier local government system, taking care of things that affect the whole county, such as: • Education• Transport• Planning• Fire and public safety• Social care• Libraries• Waste management• Trading standards They work alongside the other, lower-tier councils - district, borough or city - that take care of things on a smaller scale, such as: • Rubbish collection• Recycling• Council tax collections• Housing• Planning applications A unitary authority is a one-tier local government, where the services of a county council and the other smaller councils listed above are combined. A metropolitan district has a council that oversees all services, similar to a unitary authority - but has a mayor with a role similar to that of local councils. The mayors for Doncaster and North Tyneside are single authority, making them the political leader of the council and leaving them responsible for delivering local council services. Metro mayors chair combined authorities made up of several local councils. There are six mayoral elections taking place on 1 May, two of which are the first ever in their areas. One of them is for the West of England, where the current mayor is Dan Norris, who was elected as a Labour MP when he defeated Jacob Rees-Mogg to win the seat of North East Somerset and Hanham in last year's general election. Mr Norris, who has been mayor since 2021, has to vacate the role because the Labour Party introduced rules to prevent serving MPs from standing as mayoral candidates. There is another mayoral election in Cambridgeshire and Peterborough, while the first mayors for Hull and East Yorkshire and Greater Lincolnshire will be chosen after devolution deals were agreed in 2023, bringing together local councils in both areas to create larger authorities. There will also be elections for the next mayor of Doncaster and North Tyneside. A by-election is also being held in Runcorn and Helsby after Labour's Mike Amesbury agreed to stand down following his conviction for punching a man in the street. Amesbury, who was suspended from the Labour Party, was jailed on 24 February for 10 weeks after he pleaded guilty to assault by beating of 45-year-old Paul Fellows in Main Street, Frodsham, Cheshire, in the early hours of 26 October. However, following an appeal, his sentence was suspended for two years.  His resignation means Karen Shore, the deputy leader of Cheshire West and Chester Council, will run for Labour in the by-election, while the Conservatives are putting forward Sean Houlston, a membership services manager for the National Federation of Builders, and Sarah Pochin, a former Cheshire East councillor, is Reform's candidate. Amesbury came first in Runcorn and Helsby with 22,358 votes at the 2024 general election - equating to 52.9% of the electorate. Reform UK came in second with 7,662 votes (18.1%) and the Tories in third with 6,756 votes (16%). The elections will be the first big test of all the parties since the general election, which fundamentally redrew the UK's political landscape with a new world of multiparty politics. The Tories have the most to lose as they hold 20 of the 23 local authorities up for grabs on 1 May. And for the first time in a long time, Labour and the Conservatives are facing a genuine threat from other parties. YouGov conducted exclusive polling for Sky News to get a sense of how the country was feeling ahead of the elections, surveying 2,178 adults in the UK on 6 and 7 April. Here is the voting intention poll: • Labour: 24% (no change)• Reform UK: 23% (no change)• Conservatives: 22% (+1)• Liberal Democrats: 17% (+3)• Green Party: 9% (-2) It suggests that Nigel Farage's Reform UK could be Labour's closest competitor, with Kemi Badenoch trailing as she leads the Conservatives through elections for the first time, while the Lib Dems have closed the gap on the three top parties. Read more:Why is assisted dying so controversial - and where is it legal?Highs and lows of Five-Year Keir You have until 11.59pm on Friday to register to vote if you haven't already. You must be aged 16 or over (or 14 or over in Scotland and Wales) to register to vote - but to vote for a new MP you must be at least 18. You can register if you are: • A British citizen• An Irish or EU citizen living in the UK• A Commonwealth citizen who has permission to enter or stay in the UK, or who does not need permission• A citizen of another country living in Scotland or Wales who has permission to enter or stay in the UK, or who does not need permission• You can be an overseas voter if you previously lived in the UK and are a British citizen. The easiest and quickest way to register is online. Alternatively, you can use a paper form - though it may be too close to the deadline for you to complete this by the deadline. You can do it by contacting your local Electoral Registration Office and asking them to post a form to you. Or you can print your own form off. You'll then need to return the completed form to your local Electoral Registration Office. There are three ways to vote: In person at your local polling station You'll be sent a poll card just before an election or referendum telling you when to vote and at which polling station. It will usually be in a public building, such as a school or local hall, near your home. You can only vote at the polling station allocated to your address. This will be shown on your poll card. You can also enter your postcode on this website to find out where your polling station is. You will be able to cast your vote any time between 7am and 10pm You must bring a form of photo ID with you in order to vote. There are 22 accepted types of ID. At the polling station, you will need to give your name and address to staff and show them your photo ID. There will be instructions in the polling booth telling you exactly how to cast your vote. Postal vote You can register to vote by post for any reason, including that you simply don't want to go to a polling station on the day. You need to apply for this by 5pm on 14 April and can do so by clicking here. Postal votes now expire every three years, so if you registered to do so more than three years ago, you will need to re-apply. By proxy This is where you apply for someone to vote on your behalf if you cannot go to the polling station in person and do not want to or can't vote by post. You and your proxy must both be registered to vote in the UK before you can apply. The deadline to apply for proxy voting in the May 1 elections is 5pm on 23 April, and you can apply here. Elections for county councils in the following areas have been postponed until May 2026: • Norfolk• Suffolk• Essex• Thurrock• Surrey• East and West Sussex• Hampshire• Isle of Wight Most areas of the UK are now covered by one-tier systems such as unitary authorities, but there are still 21 county councils. The government is pushing for a \"devolution revolution\", meaning the remaining county councils are being encouraged to merge with other local authorities to become unitary authorities. So in December last year, the government told county councils they could request to postpone their elections set for 1 May if they were trying to reorganise into one-tier systems. While 16 county councils requested to postpone, only the eight listed above were successful."
    },
    {
        "title": "'All options' on table regarding British Steel's future, says Rachel Reeves",
        "description": "\"All options\" remain on the table over the future of British Steel, the chancellor has said, as fears mount over the company's plant in Scunthorpe.",
        "url": "https://news.sky.com/story/all-options-on-table-regarding-british-steels-future-says-rachel-reeves-13343706",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-blast-furnace-conway_6875398.jpg?20250404000423",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-09 10:05:00",
        "Headline": "Chancellor does not rule out nationalising the steel plant at Scunthorpe, whose fate is likely to be sealed over the next few days.",
        "Content": "\"All options\" remain on the table over the future of British Steel, the chancellor has said, as fears mount over the company's plant in Scunthorpe. The government is actively considering nationalising British Steel after Jingye, its owner in Scunthorpe, cancelled future orders for the iron ore, coal and other raw materials needed to keep the furnaces running. The decision has led to fears the Scunthorpe plant, the last blast furnaces left operating in Britain, could be forced to close as early as next month. Politics latest: PM hails 'momentous' day Speaking to reporters in Bedfordshire, Rachel Reeves suggested nationalisation could be an option to secure the future of British Steel in Scunthorpe, which was purchased by Jingye out of receivership in 2020. \"All options remain on the table regarding British Steel,\" she said. \"This government recognises the importance of those jobs in Scunthorpe and in the local area, and we're doing everything we can to preserve those jobs and to support those communities. \"We're in conversation both with the owners and with the trade unions to find a deal.\" On the issue of whether the plant could secure access to the raw materials it needed to run the blast furnaces, the chancellor said the government was in \"active discussions now with both the owners and the trade unions\".  Fears over the Scunthorpe plant's future intensified after talks between the government and Jingye broke down last week after the Chinese company rejected a £500m offer of public money to replace the existing furnaces with electric arc furnaces. The government offered the same amount to Tata Steel, the owner of the steelworks in Port Talbot, which shut down both of its blast furnaces last year and is replacing them with electric arc furnace as part of its transition to greener production methods. Conservative leader Kemi Badenoch has urged the government to push for a \"commercial solution\" to save the Scunthorpe plant, to avoid \"pain on the British taxpayer\". She drew comparisons with the Port Talbot steel plant, arguing that she saved it with a £500m rescue package that helped Tata Steel employees facing redundancy as it moved away from blast furnaces to greener steel production. \"It was difficult, but we saved that steel plant,\" she said. \"And it's going to thrive, and it's going to regenerate the area. Yes, some jobs were lost, but worked for a commercial decision that did not put too much pain on the British taxpayer.\" She said she was \"amazed that nine months in, Labour have lost British Steel\". \"And now they're talking about nationalisation - I want to see what the commercial options are,\" she continued. \"They should also be trying to make sure that they reduce tariffs on steel across the board and stop the excessive dumping from China. \"China dumping steel across the world is making steel very cheap from there and more expensive for everyone else. That needs to change. If we're going to be using steel in our country, we need to be competitive.\" Read more:Could Trump's tariffs tip the world into recession?Chancellor to hold tariff crisis talks with top City executives The questions over the steel plant in Scunthorpe come as ministers hailed a deal for a new Universal theme park in Bedfordshire, which Ms Reeves said would bring \"billions\" to the economy and create thousands of jobs. It will be the first Universal-branded theme park and resort in Europe and is set to open in 2031, when it is expected to become the UK's most popular visitor attraction. Reform UK leader Nigel Farage welcomed the investment but said: \"The new Universal theme park should be made with only British steel.\""
    },
    {
        "title": "New at-home spit test for prostate cancer could be better than blood test, study suggests",
        "description": "A new spit test for prostate cancer which can be done at home may be better than current testing methods, a study suggests.",
        "url": "https://news.sky.com/story/new-at-home-spit-test-for-prostate-cancer-could-be-better-than-blood-test-study-suggests-13345537",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prostate-cancer-brothers_6881406.jpg?20250410020108",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-09 23:31:00",
        "Headline": "Experts have developed a simple saliva test which analyses genetic variants in a man's DNA which appears to perform better than the current method for assessing prostate cancer risk.",
        "Content": "A new spit test for prostate cancer which can be done at home may be better than current testing methods, a study suggests. Experts have developed a simple saliva test which analyses genetic variants in a man's DNA, which appears to perform better than the current method for assessing prostate cancer risk. Currently, the prostate-specific antigen (PSA) blood test is used to check for prostate conditions, including prostate cancer or an enlarged prostate. Routine testing is not currently available on the NHS, but patients may be offered a PSA test if a GP suspects they have prostate cancer. Men over 50 can ask their GP for a PSA test even if they do not have symptoms. But experts have said the new saliva test could be used as an additional screening tool, as it reduced the number of false positive results and detected a higher proportion of aggressive cancers than the PSA test. It could lead to fewer men being sent for unnecessary testing, according to researchers at The Institute of Cancer Research, London, and The Royal Marsden NHS Foundation Trust. They tested the effectiveness of a new tool they had developed called a polygenic risk score, which uses spit to assess 130 genetic variants known to be associated with an increased risk of prostate cancer, which can then determine whether or not a person is at high risk of the disease. Test saved lives of two brothers Taking part in the trial saved the lives of two brothers. Dheeresh Turnbull said traditional methods to assess prostate cancer deemed he had a low risk of disease, but the new spit test helped the 71-year-old discover he actually had a life-threatening tumour in his prostate. After finding out the news, his brother Joel Turnbull also took part in the study and discovered he had an aggressive prostate tumour. \"It's incredible to think that because of this study two lives have now been saved in my family,\" Dheeresh said. Read more science and tech news:'Concerning' levels of E.coli found in ThamesWatchdog to investigate 'suicide forum'Wolf extinct for 10,000 years brought back to life How the tool was assessed The brothers were among 6,300 men aged 55 to 69 in the UK who were assessed by the tool as part of the study. Of those, 745 (12%) were deemed to have a high risk score and were invited to have prostate cancer screening, including an MRI scan and a biopsy. Prostate cancer was detected in 187 of the 468 who took up the offer, and of those, 103 had cancer that was deemed to be \"higher risk\", so treatment was offered. Of the 187 men, 118 had a PSA level below 3.0ug/L - which is considered \"normal\" and would typically indicate no further screening is required. Test could 'turn the tide on prostate cancer' Writing in the New England Journal of Medicine, the researchers said cancer \"would not have been detected\" in 74 of the men using the \"diagnostics pathway\" currently in use in the UK - which includes a high PSA level and an MRI. They concluded that for the men with the highest genetic risk, the test falsely identified fewer people with prostate cancer than the PSA test and picked up people with cancer who would have been missed by the PSA test alone. It detected a higher proportion of aggressive cancers than the PSA test and also accurately identified men with prostate cancer who were missed by an MRI scan. Professor Ros Eeles, from the Institute of Cancer Research, London, and The Royal Marsden NHS Foundation Trust, said: \"With this test, it could be possible to turn the tide on prostate cancer. \"We have shown that a relatively simple, inexpensive spit test to identify men of European heritage at higher risk due to their genetic make-up is an effective tool to catch prostate cancer early. Some 55,000 cases of prostate cancer are diagnosed each year in the UK, with around 12,000 men in the UK dying from the disease annually, according to Cancer Research UK. It comes after Health Secretary Wes Streeting suggested he would support a national prostate cancer screening programme for men at higher risk of disease if it is backed by the evidence. The UK's National Screening Committee is currently assessing whether or not such a programme should be rolled out."
    },
    {
        "title": "Amount of electricity needed to power world's data centres expected to double in five years",
        "description": "The amount of electricity needed to power the world's data centres is expected to double in the next five years, according to the International Energy Agency (IEA). ",
        "url": "https://news.sky.com/story/amount-of-electricity-needed-to-power-worlds-data-centres-expected-to-double-in-five-years-13345515",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-data-centre-london_6881401.jpg?20250409233806",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-04-09 21:44:00",
        "Headline": "The rise in demand, predicted to be highly concentrated around the world's tech and population hubs, will put pressure on utility companies, grid infrastructure and the planet.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n The amount of electricity needed to power the world's data centres is expected to double in the next five years, according to the International Energy Agency (IEA).  It will come as racks of servers hosting the latest AI models and cloud computing services use three times more electricity than the UK each year, the agency added. The rise in demand, predicted to be highly concentrated around the world's tech and population hubs, will put pressure on utility companies, grid infrastructure and the planet. \"AI is one of the biggest stories in the energy world today,\" says Fatih Birol, executive director of the IEA. \"In the United States, data centres are on course to account for almost half of the growth in electricity demand; in Japan, more than half; and in Malaysia, as much as one-fifth.\" In the US, data centres, largely being built to train and operate AI, are expected to consume more electricity by 2030 than the manufacturing of all the nation's energy-intensive goods including aluminium, steel, cement and chemicals, a report from the IEA found. But the agency also predicts that AI will be an essential tool in informing how to manage future energy demand, engineer more efficient data centres and accelerate the development of new, cleaner sources of electricity generation. Two main shifts have driven the AI revolution and its incredible demand for power. The cost of \"compute\" - the processors and associated servers to build data centres - has fallen by 99% since 2006. Whereas the amount of compute being used to train and run state-of-the-art AI models has increased by a mind-boggling 350,000-fold in just a decade. Read more science and tech news:'Concerning' levels of E.coli found in ThamesWatchdog to investigate 'suicide forum'Wolf extinct for 10,000 years brought back to life Energy demand could outstrip supply Depending on the energy sources used, AI development could drive up carbon emissions and water consumption needed for cooling servers. American tech firms are already struggling to find enough power to run their growing data centre needs, as well as the computing hardware needed to run them. A survey by Reuters of 13 major US power providers found nearly half have received requests from data companies for power that would exceed their current peak demand. It's one of the key uncertainties in the IEA report. Unlikely to risk blackouts to meet AI energy demand, countries aggressively pursuing AI development will need to build far more electricity generation. It's not clear how quickly that might happen and also how quickly the energy efficiency of data centres and the AI models they are running improves. One of the greatest uncertainties are Donald Trump's tariffs, introduced after the report was completed. Yet the US president's attack on the global trade status quo could directly and significantly impact data centre and AI development in the US and beyond. High tariffs on China are predicted to choke off supplies of raw materials needed to build new energy infrastructure. In particular, those for low-carbon energy sources like solar panels, wind turbine motors and batteries to store renewable electricity. Demand for low-carbon generation was surging in the US before Mr Trump's election - a large chunk of that coming from tech companies wanting to power data centres. The US president has promised to boost US coal production to power AI, but it's far from certain if power companies will choose to build new plants given their high cost relative to some low-carbon alternatives. The time they take to build could also mean electricity supply will lag well behind the IEA's forecast for data centre electricity demand. China, on the other hand, already gaining fast on the US in terms of AI development, may find low-carbon electricity gets cheaper and quicker to build if its clean energy exports to the US dry up due to tariffs."
    },
    {
        "title": "'Concerning' levels of E.coli found in River Thames before Boat Race, campaigners say",
        "description": "E.coli has been traced in multiple water samples from the stretch of the River Thames that will host the famous Boat Race on Sunday, campaigners say.",
        "url": "https://news.sky.com/story/concerning-levels-of-ecoli-found-in-river-thames-before-boat-race-campaigners-say-13344981",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-boat-race-oxford_6880940.jpg?20250409145105",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-09 08:54:00",
        "Headline": "The Boat Race between Oxford and Cambridge Universities traditionally culminates in the winning team throwing their cox in the water, but campaigners have warned them to \"think twice\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n E.coli has been traced in multiple water samples from the stretch of the River Thames that will host the famous Boat Race on Sunday, campaigners say. Campaign group River Action, which started testing for the bacteria in the Thames on 10 March, said almost a third of samples (29.5%) exceeded safe limits for entering the water. Water quality would be classed \"poor\" by official standards if it were a bathing water site, according to the campaigners. In response, Thames Water said rivers were \"very dynamic environments\" and recent tests on E.coli carried out by Fulham Reach Boat Club had shown results \"within the 'excellent' threshold since the start of March\". The Boat Race between Oxford and Cambridge Universities in London traditionally culminates in the winning team throwing their cox in the water, but last year they were warned to avoid the water after \"alarmingly high\" levels of E.coli were found.  Five-time Olympic gold medal-winning rower Sir Steve Redgrave said rowers and others who enjoy the water \"deserve better\". \"It's a real worry that in 2025, unsafe water quality in the Thames is still a concern,\" he added. Last year, an Oxford rower said he had fallen sick from E.coli after training on the Thames and spotting \"poo in the water\". Thames Water said the boat race route was not technically bathing water, meaning it is not funded to routinely disinfect or sterilise the water in the same way. Britain's biggest water supplier has been battling against financial collapse since last year, narrowly avoiding being taken into government ownership last month. How was the testing carried out? The stretch of water on the boat race route is not classed as a bathing water site by the Environment Agency, but the campaigners said they measured it in the same way in a bid to highlight the levels of water pollution. River Action said it sampled water 44 times between 10 March and 7 April, from three different locations along the race route. The group said the percentage of samples which exceeded safe limits for entering the water was almost three times the threshold for bathing waters rated \"poor\". River Action's Erica Popplewell branded it \"a scandal\" and called for Thames Water to be put into government hands. \"We strongly suggest that the winning team on Sunday think twice before throwing their cox in the Thames,\" she added. The levels of E.coli were found in spite of the recent dry weather, the group said. Untreated sewage is only supposed to be released from emergency overflow valves during exceptionally wet conditions, to avoid sewage backing up into people's homes. A Thames Water spokesperson said: \"Rivers are very dynamic environments, and samples can vary hugely within a short period of time. Paradoxically, recent tests on E.coli carried out by Fulham Reach Boat Club have results within the 'excellent' threshold since the start of March.\" The spokesperson added: \"We have and continue to deliver a record amount of investment to address our ageing infrastructure and the health of rivers. This includes £1.8bn to improve river health in London over the next five years. \"We are committed to seeing waterways thrive, but we can't do it alone. E.coli can come from a variety of sources including animal faeces, agricultural waste, road run off and sewage.\""
    },
    {
        "title": "Teenager had part of skull stored in her stomach after rare brain bleed",
        "description": "A girl has relearned how to walk, talk and swallow after undergoing an operation rarely carried out on children, in which doctors stored part of her skull in her stomach.",
        "url": "https://news.sky.com/story/teenager-had-part-of-skull-stored-in-her-stomach-after-rare-brain-bleed-13344914",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-alder-hey-hospital_6880517.jpg?20250409063838",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-09 05:46:00",
        "Headline": "Ellie Morris-Davies had nine operations in 13 weeks and, though at one point she worried she would \"never go home\" from hospital, the teenager has gone from being unable to move the left side of her body to singing on stage.",
        "Content": "A girl has relearned how to walk, talk and swallow after undergoing an operation rarely carried out on children, in which doctors stored part of her skull in her stomach. Ellie Morris-Davies, who is now 16, had nine surgeries in the space of 13 weeks last year after being diagnosed with a cavernoma - a cluster of abnormal blood vessels that looks like a raspberry - which does not often have symptoms. At one point, she worried she would \"never go home\" from hospital, but her mother, Joanne Morris-Davies, said she is now working \"relentlessly\" to get back to her passion of dancing and performing on stage. In May last year, Ellie, who was then 15, began suffering from persistent headaches and nausea and became sensitive to light. She was soon vomiting up to 16 times a day and, following blood tests and an MRI, Ellie was diagnosed with a bleed on her brain caused by a cavernoma. It can cause seizures, headaches, and other neurological problems such as dizziness and slurred speech, but one in 600 people in the UK have symptomless cavernoma, according to the NHS. A cavernoma with symptoms is diagnosed in around one person in every 400,000, usually aged between 20 and 40. Mrs Morris-Davies, 48, from Crewe, said she was hoping it was \"just a bad migraine\", but after being transferred to Alder Hey Children's Hospital in Liverpool, Ellie underwent surgery. The operations included a decompressive craniectomy, where surgeons remove part of the skull to relieve pressure, storing it in the patient's own stomach to keep it sterile before putting it back. Despite the life-saving procedure, Ellie deteriorated further and was rushed to intensive care. She underwent more surgeries - due to the cavernoma, which was causing more swelling to the brain. She also contracted rare and dangerous infections before her path to recovery. Ellie, who has been having daily physiotherapy and one-to-one sessions with her dance teacher, has gone from being unable to talk and move the left side of her body to singing on stage. Her mother said her \"headstrong\" daughter's digits and fingers \"have been the last to get going, but she's relearned to walk, talk and swallow\", and is \"working on physio relentlessly\". The teenager has been performing and dancing since she was three, appearing in pantomimes and in shows on the West End. Read more on Sky News:New theme park to open in UKCharles & Camilla's 20th anniversary Ellie recently returned to the stage to sing in a show with her dance class, which her mum described as an \"emotional night\". The teenager said: \"At one point, I thought I would never go home. But the staff on ward 4A really looked after me and kept my spirits up. \"There are still things I can't do, and it's frustrating, but I know I'll get there. I can't wait to be back on stage, singing and dancing.\""
    },
    {
        "title": "Suicide forum first to be investigated by Ofcom under new online safety laws",
        "description": "Ofcom is investigating whether the provider of a suicide forum has failed to comply with its duties under the Online Safety Act.",
        "url": "https://news.sky.com/story/suicide-forum-first-to-be-investigated-by-ofcom-under-new-online-safety-laws-13344929",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-porn-laptop-hacking_6683411.jpg?20240912184734",
        "type": "Technology",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-04-09 06:36:00",
        "Headline": "The communications watchdog can now fine online firms up to 10% of global revenue and carry out \"business disruption measures\".",
        "Content": "\n          News correspondent\n              @esadiya\n Ofcom is investigating whether the provider of a suicide forum has failed to comply with its duties under the Online Safety Act. It's the first investigation into an individual service provider under the new laws. The act was passed in 2023 and requires firms to reduce illegal and harmful content, but its protections are only just taking effect through Ofcom codes of practice. The watchdog said it was looking at whether the forum failed to have appropriate measures to protect users from illegal content and how it could be used to commit or facilitate \"priority\" offences, including encouraging or assisting suicide. The provider and forum have not been named. Ofcom said it had tried to engage with the provider and issued a legally binding request to submit the record of its illegal harms risk assessment. However, it said it had received a \"limited response\" and \"unsatisfactory information about the steps being taken to protect UK users from illegal content\". David Parfett, whose son Tom used the forum to buy a lethal substance in 2021, welcomed the investigation. He told Sky News: \"It feels like at last we're making a step to ensure there are consequences for people who cause harm on the internet. \"For too long we've allowed people to hide behind internet platforms to cause harm to others and now we're starting to see that change for the better.\" Andy Burrows, chief executive of Molly Rose Foundation, said \"we cannot afford any delay in shutting\" the site. \"Ofcom will be judged not simply by them firing the starting gun, but by whether they act quickly and decisively to get this site closed down once and for all,\" he said. On 17 March, duties came into force meaning providers must protect UK users from illegal content and activity, including proportionate measures to: • Mitigate the risk of their service being used to commit or facilitate a priority offence• Prevent individuals from encountering priority illegal content• Swiftly take down illegal content once they are aware of it Read more:Call to ban children from social media if act watered downPublic may have to wait years to benefit from act, say MPsBill to stop children 'doom scrolling' to get backing Encouraging or assisting a suicide in England and Wales can lead to up to 14 years in prison. If online providers refuse to engage with Ofcom over systemic concerns, it can issue fines of up to 10% of a company's global revenue and carry out \"business disruption measures\". It raises the possibility of huge penalties for the big players in social media, such as Instagram and Facebook owner Meta. :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    }
]