[
    {
        "title": "Britain is buying new air defence missile systems - but can they protect us?",
        "description": "The Ministry of Defence (MoD) has announced it will buy &#163;118m worth of air defence missile systems for the British Army.",
        "url": "https://news.sky.com/story/britain-is-buying-new-air-defence-missile-systems-but-can-they-protect-us-13415831",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ministry-of-defence_6997135.jpg?20250821184244",
        "type": "Home",
        "Author": "Sean Bell",
        "Date Published": "2025-08-21 16:58:00",
        "Headline": "Faced with a variety of new threats, the replacement for the ageing Rapier system includes the 100kg Land Ceptor missile, carrying a 10kg warhead and able to intercept threats out to around 15 miles.",
        "Content": "\n          Military analyst\n              @BellusUK\n The Ministry of Defence (MoD) has announced it will buy £118m worth of air defence missile systems for the British Army. But will this new purchase protect an increasingly vulnerable UK from attack, and why now? For more than 50 years, the British Army relied on the Rapier air defence missile system to protect deployed forces. In 2021, that system was replaced by Sky Sabre. The new system is mobile, ground-based, and designed to counter various aerial threats, including fighter aircraft, attack helicopters, drones, and guided munitions. It's known for its speed, accuracy, and ability to integrate with other military assets, including those of the Royal Navy and Royal Air Force (and NATO). What is the Land Ceptor missile, and why do we need more of them? Sky Sabre includes radar, command, and control capability and - most importantly - a missile to intercept incoming threats. The Land Ceptor missile weighs around 100kg, has a 10kg warhead, and can intercept threats out to around 15 miles (25km), making it around three times more effective than the Rapier system it replaced. When the MoD made the decision to replace the Rapier system, the global threat environment was very different to that experienced today. Since the end of the Cold War, the UK has been involved in expeditionary warfare - wars of choice - and generally against less capable adversaries. So, although the Land Ceptor missile is very capable, defence planning assumptions (DPAs) were that they would not need to be used in a serious way, commensurate with the threat. However, as the Russian invasion of Ukraine has demonstrated (as has the series of Iranian attacks on Israel), significantly larger stockpiles are required against a more capable enemy. Is the UK vulnerable to missile attack? In short, yes. Although the Land Ceptor missile does provide an excellent point-defence capability, it is not an effective counter to ballistic or hypersonic missiles - the Sea Viper mounted on Royal Navy Type 45 Destroyers using the Aster 30 missile has that capability. In the Cold War, the UK had Bloodhound missiles deployed around the UK to provide a missile defence capability, but as the perceived risks to the UK abated following the collapse of the Soviet Union, UK missile defence fell down the priorities for the MoD. Read more from Sky News:Trump's been made to look weakFight to redraw America's political map Although the radar based at RAF Fylingdales forms part of the Ballistic Missile Early Warning System (BMEWS) can detect incoming threats, the UK no longer has an effective interceptor to protect critical national infrastructure. Instead, the UK relies on the layered defences of European allies to act as a deterrence against attack. In the near term, this timely order for Land Ceptor missiles doubles the British Army's tactical capability. However, as the conflicts in Ukraine and the Middle East have demonstrated, ballistic (and increasingly hypersonic) missiles are being produced in increasing quantity - and quality. Without significant (and rapid) investment, this critical gap in national military capability leaves the UK vulnerable to attack."
    },
    {
        "title": "It's been a confusing week - and Trump's been made to look weak",
        "description": "It's been a confusing week.",
        "url": "https://news.sky.com/story/its-been-a-confusing-week-and-trumps-been-made-to-look-weak-13415929",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-washington-dc_6997300.jpg?20250822002205",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-08-21 22:31:00",
        "Headline": "A back and forth on security guarantees from Ukraine, Europe, and Russia all makes the president look rather weak, and it's unclear whether Trump's America would truly sign up to anything that obliges them to do anything.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n It's been a confusing week. The Monday gathering of European leaders and Ukraine's president with Donald Trump at the White House was highly significant. Ukraine latest: Trump changes tack The leaders went home buoyed in the knowledge that they'd finally convinced the American president not to abandon Europe. He had committed to provide American \"security guarantees\" to Ukraine.  The details were sketchy, and sketched out only a little more through the week (we got some noise about American air cover), but regardless, the presidential commitment represented a clear shift from months of isolationist rhetoric on Ukraine - \"it's Europe's problem\" and all the rest of it. Yet it was always the case that, beyond that clear achievement for the Europeans, Russia would have a problem with it. Trump's envoy's language last weekend - claiming that Putin had agreed to Europe providing \"Article 5-like\" guarantees for Ukraine, essentially providing it with a NATO-like collective security blanket - was baffling.  Russia gives two fingers to the president And throughout this week, Russia's foreign minister Sergei Lavrov has repeatedly and predictably undermined the whole thing, pointing out that Russia would never accept any peace plan that involved any European or NATO troops in Ukraine. \"The presence of foreign troops in Ukraine is completely unacceptable for Russia,\" he said yesterday, echoing similar statements stretching back years. Remember that NATO's \"eastern encroachment\" was the justification for Russia's \"special military operation\" - the invasion of Ukraine - in the first place. All this makes Trump look rather weak. It's two fingers to the president, though interestingly, the Russian language has been carefully calibrated not to poke Trump but to mock European leaders instead. That's telling. Read more on Ukraine:Trump risks 'very big mistake'NATO-like promise for Ukraine may be too good to be trueEurope tried to starve Putin's war machine - it didn't go as planned  The bilateral meeting hailed by Trump on Monday as agreed and close - \"within two weeks\" - looks decidedly doubtful. Maybe that's why he went along with Putin's suggestion that there be a bilateral, not including Trump, first. It's easier for the American president to blame someone else if it's not his meeting, and it doesn't happen. NATO defence chiefs met on Wednesday to discuss the details of how the security guarantees - the ones Russia won't accept - will work. European sources at the meeting have told me it was all a great success. And to the comments by Lavrov, a source said: \"It's not up to Lavrov to decide on security guarantees. Not up to the one doing the threatening to decide how to deter that threat!\" The argument goes that it's not realistic for Russia to say from which countries Ukraine can and cannot host troops.  Would Trump threaten force? The problem is that if Europe and the White House want Russia to sign up to some sort of peace deal, then it would require agreement from all sides on the security arrangements. The other way to get Russia to heel would be with an overwhelming threat of force. Something from Trump, like: \"Vladimir - look what I did to Iran...\". But, of course, Iran isn't a nuclear power. Something else bothers me about all this. The core concept of a \"security guarantee\" is an ironclad obligation to defend Ukraine into the future. Future guarantees would require treaties, not just a loose promise. I don't see Trump's America truly signing up to anything that obliges them to do anything. A layered security guarantee which builds over time is an option, but from a Kremlin perspective, would probably only end up being a repeat of history and allow them another \"justification\" to push back. Read more from Sky News:Inside the ISIS resurgence10 years since one of UK's worst air disastersHow Republicans are redrawing maps to stay in power Image and reality don't seem to match Among Trump's stream of social media posts this week was an image of him waving his finger at Putin in Alaska. It was one of the few non-effusive images from the summit. He posted it next to an image of former president Richard Nixon confronting Soviet leader Nikita Khrushchev - an image that came to reflect American dominance over the Soviet Union. That may be the image Trump wants to portray. But the events of the past week suggest image and reality just don't match. The past 24 hours in Ukraine have been among the most violent to date."
    },
    {
        "title": "Government struggling to reduce migrant hotel use as asylum claims hit record level",
        "description": "Government efforts to reduce the use of expensive hotel accommodation for asylum seekers have stalled in the face of local opposition and court bottlenecks.",
        "url": "https://news.sky.com/story/government-struggling-to-reduce-migrant-hotel-use-as-asylum-claims-hit-record-level-13415697",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-teaser-homeless_6997093.jpg?20250821173917",
        "type": "Home",
        "Author": "Ben van der Merwe, Data and Forensics Unit",
        "Date Published": "2025-08-21 13:02:00",
        "Headline": "New data shows that the government is struggling to house asylum seekers, process their claims or reduce small boat arrivals.",
        "Content": "By Ben van der Merwe, Data and Forensics Unit  Government efforts to reduce the use of expensive hotel accommodation for asylum seekers have stalled in the face of local opposition and court bottlenecks. During last year's election, Labour promised to end the use of hotels by 2029. But data released on Thursday by the Home Office shows there are more asylum seekers in hotels than when Sir Keir Starmer took office. As of 30 June this year, there were 32,059 asylum seekers staying in hotels compared with 29,585 in June 2024. The government has been trying to get more asylum seekers into residential housing, which is much cheaper than hotels, by dispersing them to more locations across the country. But the arrival of asylum seekers in new areas, and the use of residential housing to accommodate them, has provoked a backlash from residents and local politicians. This has made it crucial for the government to cut the overall number in need of housing - either by reducing the number of applicants or by processing their claims more quickly. The data, however, shows that the government is struggling on both fronts. Effort to reduce hotel use Both Conservative and Labour governments have sought to decrease reliance on hotel accommodation for asylum seekers due to soaring costs. The Home Office spent £4.76bn on asylum last year, almost four times as much as it spent in 2020-21 (£1.34bn). Of every £1 spent, 76p went on hotel accommodation alone. Housing an asylum seeker in a hotel costs around £170 per night, compared with £27 for other types of accommodation, according to estimates by Oxford University's Migration Observatory. A policy introduced in 2023, under the Conservatives, sought to reduce reliance on hotels by dispersing asylum seekers more evenly across the country. Data shows that the policy started having an impact even before it was formally implemented. In September 2022, 31% of asylum seekers were housed in just ten councils. Three months later, that figure had fallen to 24%. But Sky News analysis shows that areas which have seen more asylum seekers arriving since then are actually more likely to use hotels - undercutting the purpose of the policy. And the arrival of asylum seekers in locations across the country has sparked protests by residents and legal action by councils. You can see how the policy has affected your area using the table below. Residents and politicians have also raised concerns about the main alternative to hotels - the use of residential housing, including houses in multiple occupation (HMOs). In her maiden speech to Parliament in May, Reform MP for Runcorn and Helsby Sarah Pochin described HMOs housing asylum seekers as \"breeding grounds for organised crime gangs\". A huge backlog of claims The fact that the government is being criticised wherever it places asylum seekers suggests that their real problem is the overall number of asylum seekers requiring accommodation. As of June, that number stood at 102,866, more than twice as high as March 2020 (48,042) and only 14% below the record levels reached in September 2023 (119,010). The government is required under international law to provide asylum seekers with housing while their claims are being assessed if they would otherwise be \"destitute\". And because the government also forbids asylum seekers from working until their claims are approved, that means they have to provide accommodation for almost all of them. Since 2020, the number of asylum seekers awaiting a final decision on their claim has more than doubled. That is partly due to a slowdown in processing asylum claims. In May 2019, the Conservative government abandoned a target of processing most claims within six months. By March 2020, the share processed within six months fell from 52% to 39%. \"By delaying or not taking decisions, they produced this huge backlog that also put a lot of pressure on the provision of accommodation,\" says Professor Nando Sigona of the University of Birmingham. A rise in asylum applications The issue was exacerbated by a surge in asylum claims after pandemic restrictions were eased in 2021. Home Office data shows that the number of decisions made on asylum applications fell during this period and only began to increase significantly in 2023. That increase in decisions has helped to cut the number of cases awaiting an initial decision over the past year from 85,839 to 70,532. On Thursday, as the statistics were released, Home Secretary Yvette Cooper said the government was making progress on the backlog and had reduced it by 18%. But appeals to these initial decisions are common, and the government is required to house asylum seekers until their appeals are over. Data from the Ministry of Justice shows that, as of March this year, 50,976 claims were awaiting appeal decisions. That puts the total backlog at 129,721 cases, up from 119,066 in June last year. Professor Sigona says that the number of people applying for asylum has risen across Europe in recent years, but that other countries have avoided being obliged to house so many of them by relaxing work requirements. \"In Europe asylum seekers are allowed to work much more rapidly,\" says Eleonore Kofman, professor of gender, migration and citizenship at Middlesex University. Without the right to work, she says, \"you kind of lock them into destitution and you have to provide housing for them\". The government has struggled to reduce small boat arrivals As well as increasing the processing of asylum claims, the government has sought to reduce the number of claims by reducing small boat crossings. However, a total of 43,309 people arrived in the UK by small boat during Labour's first year in office, a 38% increase on the year before. Almost all of them (99%) claimed asylum. In the year to June, people crossing on small boats accounted for 38% of asylum claims. The UK requires people to apply for asylum from within the country but does not offer a visa for those wishing to make an application. This means that most people who want to flee to the UK must come illegally - either by using another type of visa, or by entering irregularly. On 6 August, a deal between the UK and France took effect, opening up a new route for asylum seekers and a possible way for the government to deter small boat crossings. Under the agreement, France will accept the return of migrants who arrive in the UK by small boat in exchange for the UK accepting an equivalent number of asylum seekers currently in France. Home Secretary Yvette Cooper said that the new policy \"sends a message to every migrant currently thinking of paying organised crime gangs to go to the UK that they will be risking their lives and throwing away their money if they get into a small boat.\" Speaking to Sky News on Thursday, director of the Migration Observatory think tank Madeleine Sumption said it remains unclear how many people France will agree to take back. \"If it's a relatively small, symbolic number... then asylum seekers may just see that there's one more risk... at the end of an already risky journey and [it's] something that they're willing to accept.\" As of Wednesday, 2,561 migrants had arrived in the UK by small boat since the policy took effect. Additional reporting by Sophia Massam. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Shoreham air crash: Families mark 10 years since one of UK's worst airshow disasters",
        "description": "On the 10th anniversary of the Shoreham air disaster, the families of some of those killed have criticised the regulator for what they describe as a \"shocking\" ongoing attitude towards safety.",
        "url": "https://news.sky.com/story/shoreham-air-crash-families-mark-10-years-since-one-of-uks-worst-airshow-disasters-13415866",
        "image_url": "https://e3.365dm.com/19/01/1920x1080/skynews-shoreham-air-crash_4548483.jpg?20250821200118",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-21 18:51:00",
        "Headline": "The Shoreham Airshow disaster of 2015 was the deadliest the UK had seen in more than 60 years. Eleven people were killed and more were injured.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  On the 10th anniversary of the Shoreham air disaster, the families of some of those killed have criticised the regulator for what they describe as a \"shocking\" ongoing attitude towards safety. On 22 August 2015, a vintage fighter jet plummeted out of the sky and crashed into one of the busiest roads in Sussex, killing 11 men. Most of them weren't even watching the aerobatic display overhead when they were engulfed in a fireball that swept down the dual carriageway. Jacob Schilt, 23, and his friend Matthew Grimstone, also 23, were driving to play in a match for their football team, Worthing United FC. Both sets of parents are deeply angry that their beloved sons have lost their lives in this way. \"It obviously changed our lives forever, and it's a huge reminder every 22nd of August, because it's such a public anniversary. It's destroyed our lives really,\" his mum, Caroline Shilt, said. \"It was catastrophic for all of us,\" Jacob's father, Bob, added. 'They had no protection' Sue and Phil Grimstone argue that the regulator, the Civil Aviation Authority (CAA), has not been held accountable for allowing the airshow to take place where it did. \"At Shoreham, the permission given by the CAA did not allow displaying aircraft to perform over paying spectators or their parked cars,\" they said. \"But aircraft were permitted to fly aerobatics directly over the A27, which was in the display area, a known busy road. \"This was about ignoring the safety of people travelling on a major road in favour of having an air show. They had no protection.\" A series of catastrophic errors The crash happened while the experienced pilot, Andy Hill, a former RAF instructor, was attempting to fly a loop in a 1950s Hawker Hunter jet. But he made a series of catastrophic errors. His speed as the plane pitched up into the manoeuvre was far too slow, and therefore, he failed to get enough height to be able to pull out of the dive safely. The jet needed to be at least 1,500ft higher. Mr Hill survived the crash but says he does not remember what happened, and a jury at the Old Bailey found him not guilty of gross negligence manslaughter in 2019. When the inquest finally concluded in 2022, the coroner ruled the men had been unlawfully killed because of a series of \"gross errors\" committed by the pilot. The rules around air shows have been tightened up since the crash, with stricter risk assessments, minimum height requirements, crowd protection distances, and checks on pilots. But Jacob and Matt's families believe the CAA still isn't doing enough to protect people using roads near airshows, or other bystanders not attending the events themselves. The families recently raised concerns about the Duxford airshow in a meeting with the CAA. While aircraft are no longer allowed to fly aerobatics over the M11, they do so nearby - and can fly over the road at 200ft to reconfigure and return. If the M11 has queuing traffic in the area, the display must be stopped or curtailed. The Grimstones believe this demonstrates accepting \"an element of risk\" and are frustrated that the CAA only commissioned an independent review looking at congested roads and third-party protection earlier this year. \"We feel the CAA are still dragging their feet when it comes to the safety of third parties on major roads directly near an air show,\" they said. The family have complained about the CAA to the parliamentary ombudsman. 'There are still question marks' Some experts also believe the CAA has questions to answer about a previous incident involving Mr Hill, after organisers of the 2014 Southport Airshow brought his display to an emergency stop because he had flown too close to the crowd, and beneath the minimum height for his display. In its investigation into the Shoreham disaster, the Air Accident Investigation Branch (AAIB) later found that while the CAA inspector present had an informal discussion with the pilot, no further action was taken, and the incident was not reported to the AAIB. Retired pilot Steve Colman has spent many years looking into what happened at Shoreham, and he believes the CAA failed to fulfil their statutory obligation to fully investigate and report the incident at Southport. \"You have to ask the question - if the Southport incident had been investigated, then was Shoreham more likely or less likely to have occurred?\" he said. \"I think there can only be one answer - it's less likely to have occurred.\" Tim Loughton, who was the MP for Shoreham at the time, believes a balance must be struck. \"We don't want to regulate these events out of existence completely. A lot of the smaller air shows no longer happened because they couldn't comply with the new regulations […], but certainly there are still question marks over the way the CAA conducted and continues to conduct itself. I would welcome more parliamentary scrutiny.\" Read more from Sky News:London Underground workers to strikeMan charged with killing ice cream seller Rob Bishton, chief executive at the CAA, said: \"Our thoughts remain with the families and friends of those affected by the Shoreham Airshow crash. \"Following the crash, several investigations and safety reviews were carried out to help prevent similar incidents in the future. This included an immediate review of airshow safety and a full investigation by the Air Accidents Investigation Branch. All recommendations and safety improvements from these reviews were fully implemented. \"Airshows continue to be subject to rigorous oversight to ensure the highest possible safety standards are maintained. \"At a previous airshow in 2014 the pilot involved in the Shoreham accident was instructed to abort a display by the show's flying director. This incident was investigated by the UK Civil Aviation Authority and regulatory action was taken.\" Mr Bishton added: \"As part of the work to review the safety oversight of airshows following the tragic Shoreham crash, the actions taken by the regulator following such a stop call were enhanced.\" But the families of those killed still believe much more could be done."
    },
    {
        "title": "Israel to continue with Gaza City offensive despite talks to free Hamas hostages",
        "description": "Israel will resume negotiations with Hamas for the release of all hostages captured during the October 7 attack, Benjamin Netanyahu has said - but its military will continue its Gaza City offensive despite international outcry.",
        "url": "https://news.sky.com/story/israel-to-continue-with-gaza-city-offensive-despite-talks-to-free-hamas-hostages-13415894",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel_6996596.jpg?20250821161240",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-21 20:26:00",
        "Headline": "Israel's Prime Minister Benjamin Netanyahu says he has \"issued instructions to begin immediate negotiations\" after Hamas agreed to a temporary ceasefire proposal.",
        "Content": " Israel will resume negotiations with Hamas for the release of all hostages captured during the October 7 attack, Benjamin Netanyahu has said - but its military will continue its Gaza City offensive despite international outcry. The remarks from Israel's prime minister are the first since Hamas agreed to a temporary ceasefire proposal. Talks will also be with a view to ending the war, but Mr Netanyahu said it must be on \"terms acceptable to Israel\". In the meantime, the Israel Defence Forces (IDF) have begun calling medics and international organisations in northern Gaza to encourage them to evacuate to the south ahead of the expanded operation in Gaza City. Many of Israel's closest allies have urged the government to reconsider. Some Israelis fear it could doom the remaining 20 or so living hostages taken by Hamas-led militants in the 7 October 2023 attack which ignited the war. Israel plans to call up 60,000 reservists and extend the service of 20,000 more. Speaking to soldiers near Israel's border with Gaza, Mr Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City. \"At the same time I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,\" he said. \"These two things - defeating Hamas and releasing all our hostages - go hand in hand,\" he added. The latest ceasefire proposal drawn up by Egypt and Qatar is almost identical to an earlier one that Israel accepted before the talks stalled last month. The proposal would include the release of some hostages in exchange for Palestinian prisoners, a pullback of Israeli forces and negotiations over a lasting ceasefire. 'Don't tell us where to build' Israeli strikes killed at least 36 Palestinians across Gaza on Thursday, according to local hospitals, including at a tent camp in Deir al-Balah. Meanwhile, Israel's ambassador to the UK, Tzipi Hotovely, was summoned to the Foreign Office in response to a controversial West Bank settlement plan which has been given final approval. The project, known as the E1 settlement, would effectively cut off the occupied West Bank from East Jerusalem and divide the territory in two. The UK and 21 international partners have released a statement to condemn the decision \"in the strongest terms\" calling it \"a flagrant breach of international law\" and \"critically undermining a two-state solution\". Ms Hotovely gave Sky News her response to the meeting: \"I said we wouldn't tell the British where to build in London. Don't tell us where to build in Jerusalem, our capital. We see E1 as part of Greater Jerusalem.\"  UK warns of 'horrifying starvation' The UK has also responded to comments from the head of the UN Palestinian refugee agency UNRWA that famine in Gaza is \"deliberate\" and being used as an \"instrument of war\". Minister for the Middle East, Hamish Falconer, has called for a \"comprehensive [peace] plan to end this misery and get to a long-term settlement\". \"Israel must immediately and permanently lift all barriers preventing aid reaching the people of Gaza to prevent the horrifying starvation in the Strip continuing,\" he added. Read more from Sky News:Is Netanyahu is ready to negotiate?Palestinians flee Israeli advance  Demand for Gaza media access The Media Freedom Coalition, which includes the UK and 50 other countries, has called on Israel to allow foreign media access into Gaza. In a joint statement, the coalition, which is a partnership of countries working to defend media freedom, urged Israel to \"allow immediate independent foreign media access\" and \"afford protection for journalists operating in Gaza\". They said this was in light of the \"unfolding humanitarian catastrophe in Gaza\"."
    },
    {
        "title": "The fight to redraw America's maps ahead of pivotal elections for Trump's presidency",
        "description": "Legislators in Texas have approved new congressional maps designed to boost Donald Trump's Republicans at next year's midterm elections.",
        "url": "https://news.sky.com/story/how-trumps-republicans-are-literally-redrawing-maps-to-help-stay-in-power-13415441",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-newsom-redistricting_6997304.jpg?20250822011246",
        "type": "Home",
        "Author": "Lauren Russell",
        "Date Published": "2025-08-21 00:25:00",
        "Headline": "Texas is within touching distance of gaining approval to re-draw its congressional maps before next year's midterm elections. The move, spearheaded by Donald Trump, is known as redistricting - here's everything you need to know about it.",
        "Content": "\n          News reporter\n              @laurenvrussell\n Legislators in Texas have approved new congressional maps designed to boost Donald Trump's Republicans at next year's midterm elections. Known as redistricting, the state's re-drawn map would shift conservative voters into districts currently held by Democrats, and combine other districts with a Democratic majority into one. The process is not new, and is completely legal - unless it is ruled to be racially motivated - but typically occurs every 10 years after the US Census to account for population changes. The push to redistrict early came from Mr Trump himself, who wants to bolster his chances of preserving the slim Republican majority in the House of Representatives at next year's crucial midterms. But by trying to re-draw the maps in the red state of Texas, Democrats have lined up their own counter redistricting effort in the blue state of California. Governor Gavin Newsom - who has led opposition against Mr Trump - has legislation teeing up a special election on a new congressional map which, if approved by voters later this year, stands to give Democrats five more seats. If more states decide to re-consider their maps, it has the potential to largely determine the outcome of the 2026 midterms, before a single vote is cast. What's happening in Texas? Mr Trump first said he wanted politicians in Texas to redraw the state's congressional district in July. The governor of Texas, Greg Abbott, followed up on the president's demands, calling for a special session to vote on new maps. \"Please pass this map ASAP,\" Mr Trump urged on his Truth Social platform on Monday. \"Thank you, Texas!\" In an effort to try to make passing the vote as difficult as possible, Democrats fled the state for two weeks. Per parliamentary rules, if enough Democrats refuse to take part in the special session, the Texas House can't meet. On their return, each Democratic politician was assigned a police escort to ensure they attended the session. Nicole Collier, who refused the police escort, stayed in the House for two nights, and was pictured with an eye mask and blanket trying to sleep at her desk. Once the debate started, the doors to the chamber were locked and all members wanting to leave had to get a permission slip to do so. After nearly eight hours, the legislation to formally change the map was passed 88-52 on Wednesday. It now needs to be approved by the Texas Senate, where Republicans hold a majority, and then signed off by Mr Abbott, who has already committed to doing just that. Why re-draw maps? Republicans in Texas have openly said the rally to re-draw congressional maps is in the party's interest. Todd Hunter, the Republican who wrote the legislation formally creating the new map, told the House: \"The underlying goal of this plan is straight forward: improve Republican political performance.\" He said the dispute is nothing more than a partisan fight, and made reference to the US Supreme Court having previously allowed politicians to redraw districts for partisan purposes. Read more from Sky News:Trump sets red line on UkraineTrump risks 'very big mistake' with Putin Democrats hit back, arguing the disagreement was about more than partisanship. \"In a democracy, people choose their representatives,\" representative Chris Turner said. \"This bill flips that on its head and lets politicians in Washington, DC, choose their voters.\" Another Democrat, John H Bucy, blamed the president, saying: \"This is Donald Trump's map. \"It clearly and deliberately manufactures five more Republican seats in Congress because Trump himself knows that the voters are rejecting his agenda.\" How have Democrats responded? The move by Republicans triggered a tit-for-tat move by the Democrats in California. On Thursday, a day after the Texas plans were signed off, the state's legislature approved its own redistricting package. Unlike in Texas, though, the change - to give the Democrats five more seats - does need voter approval in a special election later this year, to be held on 4 November. Mr Newsom has said it's time to \"fight fire with fire\" to take on the Republicans. His plan has gained support from former president Barack Obama, who said it was necessary to \"stave off\" the Republicans' move in Texas. Under Mr Newsom's emergency legislation, the proposed California map would last only through 2030, after which the state's commission would draw up a new map for the normal, once-a-decade redistricting. As the bill was signed by the governor, the state's Republican minority leader, assemblyman James Gallagher, cautioned against Mr Newsom's approach. While he said Trump was \"wrong\" to push for new Republican seats elsewhere, he added: \"You move forward fighting fire with fire and what happens? You burn it all down.\" Could this affect the midterms? The midterms in November next year will likely be on a knife edge. Whatever the outcome, it could shape the remainder of Mr Trump's second term in office. A Democrat majority would make it tougher for him to pass laws. Currently, Republicans control the House of Representatives in Washington, 219-212 (excluding four open vacancies). A party needs 218 seats for a majority. In the Senate, the Republicans hold a similarly slim majority of 53 to 45. However, the incumbent president's party typically loses seats in the midterms. In the 2018 midterms, during Mr Trump's first tenure as president, the Democrats took control of the House. Likewise, in 2022, when Joe Biden was president, the House swung back to the Republicans. It's important to note that 27 House seats will remain in states that are unlikely to redraw their maps, according to The New York Times. In a bid to avoid a repeat of history, Mr Trump is pushing for redistricting in states beyond Texas. Top Republicans in states like Indiana, Missouri, and Florida continue to talk about tweaking their maps to create more Republican-controlled congressional seats. While Ohio has to legally redraw, the timing of which could benefit the Republicans, and, by extension, Mr Trump."
    },
    {
        "title": "Why Germany's top football league is turning to this man",
        "description": "The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete.",
        "url": "https://news.sky.com/story/why-germanys-top-football-league-is-turning-to-this-man-13415910",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rob-harris-mark-goldbridge_6997282.jpg?20250821230930",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-08-21 21:19:00",
        "Headline": "Tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube, run by the renowned Manchester United fan Mark Goldbridge.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete. Not only to find an audience, but to find outlets to even show the matches. So German football had to think differently - going to where Gen Z is engaging with football through content creators. And that's why tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube. It's run by Mark Goldbridge, known for passionate but often provocative, punchy commentary about players on streams going viral. His brand was built by being filmed reacting to watching Manchester United matches. \"People need to appreciate that we have a certain content style, and that's very, very popular,\" Goldbridge told Sky News. \"That is an area that needs to be catered [to] and that's why, without the rights, we've had such big, big audiences.\" Goldbridge revealed he isn't paying to show his 20 Friday night matches this season - reinforcing how the Bundesliga struggled to find a buyer in Britain. Sky Sports previously had a four-year rights deal to exclusively show those German matches here, but will now only show the prestige Saturday evening slot live. European leagues are finding it increasingly difficult in this market to sell their rights because domestic football is so dominant and appealing. The focus of football budgets is on domestic games for Sky as well as Discovery-owned TNT Sports, which also focuses its European football coverage on men's continental competitions, including the Champions League. More Premier League matches will be shown live than ever before - with at least 215 on Sky, the parent company of Sky News, and others on TNT. Sky Sports also has live men's rights to the English Football League and Scottish matches, as well as sharing the Women's Super League with the BBC. The Bundesliga is also making the games broadcast by Goldbridge's channel available to the BBC to stream online. They will further be on The Overlap, a YouTube channel part-owned by Gary Neville. 'A progressive step' Bundesliga International CEO Peer Naubert said: \"Our approach is as diverse as our supporters: by combining established broadcasters with digital platforms and content creators, we are taking a progressive step in how top-level football can be experienced. \"This multi-layered strategy allows us to connect with more audiences across the UK and Ireland, giving every supporter the chance to engage … in the way that suits them best.\" While the former England and Manchester United player is a star pundit on Sky, he could also be seen as a rival to the Comcast-owned broadcaster by attracting fans to newer outlets of his channel. Read more from Sky News:Man charged with killing ice cream sellerLondon Underground workers to strike Goldbridge doesn't see himself as a rival yet to long-established broadcasters. \"We're not looking to replace what you can find on Sky or the BBC or anything like that,\" he said. \"This is a community that will be live with us, watching the Bundesliga, learning about it. \"And if I get a pronunciation wrong, or I don't know about a player, then I've got my community there to back me up. I don't profess to know everything.\" 'This is the future' But he can be relatable to audiences, with more than two million subscribing to his The United Stand channel, earning him millions of pounds over the last decade. \"We've been there growing in the background and I think certain media outlets have ignored that, maybe hoping it would go away,\" he said. \"I certainly think synergy and collaboration need to happen more because there are things in the mainstream that I don't like and there will be people out there that really don't like the way we watch football, but a lot of people do. \"And it's about offering that choice to people and there are different ways people listen to football on the radio, people watch it with a commentator, some people turn the audio off completely, some people watch things like this (watch-a-long). \"And I think that is the future, to offer more choice.\""
    },
    {
        "title": "New dinosaur named after record-breaking yachtswoman",
        "description": "A newly-discovered dinosaur with an \"eye-catching sail\" along its back and tail is to be named after record-breaking yachtswoman Dame Ellen MacArthur.",
        "url": "https://news.sky.com/story/new-dinosaur-named-after-record-breaking-yachtswoman-13415762",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istiorachis-macaruthurae_6997031.jpg?20250821160859",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-21 15:09:00",
        "Headline": "The 125 million year-old bones were thought to be from one of the two similar known local species, but after close study, scientists determined it's something new.",
        "Content": "A newly-discovered dinosaur with an \"eye-catching sail\" along its back and tail is to be named after record-breaking yachtswoman Dame Ellen MacArthur. Istiorachis macaruthurae was identified and named by Jeremy Lockwood, a PhD student at the University of Portsmouth and the Natural History Museum. Istiorachis means \"sail spine\" and macaruthurae is taken from the surname of Dame Ellen, who became famous for setting a record for the fastest solo non-stop round-the-world voyage in 2005. Dame Ellen is from the Isle of Wight, where the creature's fossils were found. Before Dr Lockwood analysed them, the fossils, which date back 125 million years, were thought to be from one of the two known iguanodontian dinosaur species from the island. \"But this one had particularly long neural spines, which was very unusual,\" he said. Writing in the scientific journal Papers in Palaeontology, Dr Lockwood said his study showed the dino would have probably had a pronounced sail-like structure along its back. The exact purpose of such features \"has long been debated, with theories ranging from body heat regulation to fat storage\". In this case, researchers think it was most likely to be for \"visual signalling, possibly as part of a sexual display\". Read more from Sky News:Trump's been made to look weakFight to redraw America's political mapCan Britain's new missile systems protect us? For the study, the researchers compared the fossilised bones with a database of similar dinosaur backbones which allowed them to see how these sail-like formations had evolved. Dr Lockwood said his team showed Istiorachis's spines \"weren't just tall, they were more exaggerated than is usual in Iguanodon-like dinosaurs, which is exactly the kind of trait you'd expect to evolve through sexual selection\". Professor Susannah Maidment, of the Natural History Museum, said: \"Jeremy's careful study of fossils that have been in museum collections for several years has brought to life the iguandontian dinosaurs of the Isle of Wight. \"His work highlights the importance of collections like those at [Isle Of Wight museum] Dinosaur Isle, where fossil specimens are preserved in perpetuity and can be studied and revised in the light of new data and new ideas about evolution. \"Over the past five years, Jeremy has single-handedly quadrupled the known diversity of the smaller iguanodontians on the Isle of Wight, and Istiorachis demonstrates we still have much to learn about Early Cretaceous ecosystems in the UK.\""
    },
    {
        "title": "Liberty Steel's Speciality Steels UK pushed into compulsory liquidation",
        "description": "One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control.",
        "url": "https://news.sky.com/story/liberty-steels-speciality-steels-uk-pushed-into-compulsory-liquidation-13415789",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-liberty-steel-rotherham_5317948.jpg?20210325194938",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-08-21 15:49:00",
        "Headline": "Speciality Steel UK has been pushed into compulsory liquidation, despite reported attempts for a deal. The government will take over, but will also try and find a new buyer for the business that employers 1,500 people.",
        "Content": "\n          Political reporter\n              @TimJ_B\n One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control. Speciality Steels UK (SSUK), part of the Liberty Steel empire owned by metals tycoon Sanjeev Gupta, employs nearly 1,500 people at sites in Rotherham and several other locations across South Yorkshire. Behind Tata Steel and British Steel, it is the third-largest steel producer in the country. Politics live: New migrant stats released Sky News reported that negotiations had been underway for a deal to rescue the firm, however, they seem to have been rendered unsuccessful. The government-run Insolvency Service confirmed it will be acting as the liquidator. It added that Teneo Financial Advisory Limited would be assisting in running the company from now on. While the GFG Alliance, the holding company, says it is disappointed by the decision, local politicians and unions are highly critical of the group. Business and economics correspondent The collapse of Speciality Steel UK (SSUK), the UK's third-largest steel producer, did not come as a surprise to government officials, who have in recent days been planning for this outcome. \n After all, the business has been limping on for some time, weighed down by financial mismanagement and a mounting debt pile. Problems began in 2021 for GFG Alliance - the holding company, which is a conglomerate run by the metals magnate Sanjeev Gupta. Its main lender, Greensill Capital, collapsed with £3.7bn of loans to GFG still outstanding. Administrators for Greensill are still trying to recover the money. \n There have been legal claims and probes since then, although GFG denies any wrongdoing. The true scale of SSUK's financial woes are not even known because the company has not filed audited accounts for more than five years. Sanjeev Gupta is being prosecuted for failing to file accounts for many of his other businesses too. SSUK's creditors pushed for the company's liquidation, but the government was braced to step in. However, the development does little to provide certainty for the business's 1,500 workers in South Yorkshire. The government will cover wages and costs for now but, as a letter sent by the Department for Business and Trade made clear earlier this month, the government has no intention to \"own SSUK\". As with British Steel, which collapsed back in April (albeit for different reasons), the government is stepping up, but is hoping a new buyer will be found soon. The government says wages will continue to be paid by the liquidator. A spokesperson adds that the government is still \"committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK\". Financial assistance was not able to be given to SSUK by the government due to its existing financial and corporate challenges, including ownership and management. Read moreWhitehall on alert for collapse of steel empireBlackRock backs Gupta's bid to keep controlWhy did British Steel need saving In a statement today, GFG's chief transformational officer, Jeffrey Kabel said: \"The decision to push Speciality Steel UK into compulsory liquidation, especially when we have support from the world's largest asset manager to resume operations and facilitate creditor recovery, is irrational. \"The plan that GFG presented to the court would have secured new investment in the UK steel industry, protecting jobs and establishing a sustainable operational platform under a new governance structure with independent oversight. \"Instead, liquidation will now impose prolonged uncertainty and significant costs on UK taxpayers for settlements and related expenses, despite the availability of a commercial solution. \"Liberty has pursued all options to make its SSUK viable, including efficiency improvements, reorganisations, customer support, several attempts to find a buyer for the business and intensive negotiations with creditors to restructure debt liabilities. Liberty's shareholder has invested nearly £200m, recognising the vital role steel plays in supplying the UK's strategic defence, aerospace and energy industries. \"GFG will now continue to advance its bid for the business in collaboration with prospective debt and equity partners and will present its plan to the official receiver. GFG continues to believe it has the ideas, management expertise and commitment to lead SSUK into the future and attract major investment. GFG's other significant business interests in the UK remain unaffected. \"Despite many challenges facing the group and the difficult market conditions, GFG has invested over £2bn into the UK economy since 2013, ensuring the survival of many GFG businesses despite operating losses and safeguarding thousands of jobs that would otherwise have been lost.\" Sarah Champion, the Labour MP for Rotherham, said GFG's statement was \"full of hollow promises\". She added: \"We know Liberty is a golden goose, but one they have starved for years. \"The speciality steel we make is unique and in high demand, it makes no financial sense that GFG furloughed the plant for nearly two years. \"Strategically, the government cannot allow Liberty Steel to fail. I am confident they will do all in their power to let it flourish.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈  Charlotte Brumpton-Childs, the national officer for the GMB union, also attacked GFG. She said: \"This is another tragedy for UK steel - and the people of South Yorkshire - this time brought on by years of chronic mismanagement by the owners. \"But this represents an opportunity for the UK government to take decisive action - as it did with British Steel - to protect this vital UK industry.\" A government spokesperson said: \"We know this will be a deeply worrying time for staff and their families, but we remain committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK. \"It is now for the independent Official Receiver to carry out their duties as liquidator, including ensuring employees are paid, while we also make sure staff and local communities are supported.\""
    },
    {
        "title": "Britain is buying new air defence missile systems - but can they protect us?",
        "description": "The Ministry of Defence (MoD) has announced it will buy &#163;118m worth of air defence missile systems for the British Army.",
        "url": "https://news.sky.com/story/britain-is-buying-new-air-defence-missile-systems-but-can-they-protect-us-13415831",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ministry-of-defence_6997135.jpg?20250821184244",
        "type": "UK",
        "Author": "Sean Bell",
        "Date Published": "2025-08-21 16:58:00",
        "Headline": "Faced with a variety of new threats, the replacement for the ageing Rapier system includes the 100kg Land Ceptor missile, carrying a 10kg warhead and able to intercept threats out to around 15 miles.",
        "Content": "\n          Military analyst\n              @BellusUK\n The Ministry of Defence (MoD) has announced it will buy £118m worth of air defence missile systems for the British Army. But will this new purchase protect an increasingly vulnerable UK from attack, and why now? For more than 50 years, the British Army relied on the Rapier air defence missile system to protect deployed forces. In 2021, that system was replaced by Sky Sabre. The new system is mobile, ground-based, and designed to counter various aerial threats, including fighter aircraft, attack helicopters, drones, and guided munitions. It's known for its speed, accuracy, and ability to integrate with other military assets, including those of the Royal Navy and Royal Air Force (and NATO). What is the Land Ceptor missile, and why do we need more of them? Sky Sabre includes radar, command, and control capability and - most importantly - a missile to intercept incoming threats. The Land Ceptor missile weighs around 100kg, has a 10kg warhead, and can intercept threats out to around 15 miles (25km), making it around three times more effective than the Rapier system it replaced. When the MoD made the decision to replace the Rapier system, the global threat environment was very different to that experienced today. Since the end of the Cold War, the UK has been involved in expeditionary warfare - wars of choice - and generally against less capable adversaries. So, although the Land Ceptor missile is very capable, defence planning assumptions (DPAs) were that they would not need to be used in a serious way, commensurate with the threat. However, as the Russian invasion of Ukraine has demonstrated (as has the series of Iranian attacks on Israel), significantly larger stockpiles are required against a more capable enemy. Is the UK vulnerable to missile attack? In short, yes. Although the Land Ceptor missile does provide an excellent point-defence capability, it is not an effective counter to ballistic or hypersonic missiles - the Sea Viper mounted on Royal Navy Type 45 Destroyers using the Aster 30 missile has that capability. In the Cold War, the UK had Bloodhound missiles deployed around the UK to provide a missile defence capability, but as the perceived risks to the UK abated following the collapse of the Soviet Union, UK missile defence fell down the priorities for the MoD. Read more from Sky News:Trump's been made to look weakFight to redraw America's political map Although the radar based at RAF Fylingdales forms part of the Ballistic Missile Early Warning System (BMEWS) can detect incoming threats, the UK no longer has an effective interceptor to protect critical national infrastructure. Instead, the UK relies on the layered defences of European allies to act as a deterrence against attack. In the near term, this timely order for Land Ceptor missiles doubles the British Army's tactical capability. However, as the conflicts in Ukraine and the Middle East have demonstrated, ballistic (and increasingly hypersonic) missiles are being produced in increasing quantity - and quality. Without significant (and rapid) investment, this critical gap in national military capability leaves the UK vulnerable to attack."
    },
    {
        "title": "New dinosaur named after record-breaking yachtswoman",
        "description": "A newly-discovered dinosaur with an \"eye-catching sail\" along its back and tail is to be named after record-breaking yachtswoman Dame Ellen MacArthur.",
        "url": "https://news.sky.com/story/new-dinosaur-named-after-record-breaking-yachtswoman-13415762",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istiorachis-macaruthurae_6997031.jpg?20250821160859",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-21 15:09:00",
        "Headline": "The 125 million year-old bones were thought to be from one of the two similar known local species, but after close study, scientists determined it's something new.",
        "Content": "A newly-discovered dinosaur with an \"eye-catching sail\" along its back and tail is to be named after record-breaking yachtswoman Dame Ellen MacArthur. Istiorachis macaruthurae was identified and named by Jeremy Lockwood, a PhD student at the University of Portsmouth and the Natural History Museum. Istiorachis means \"sail spine\" and macaruthurae is taken from the surname of Dame Ellen, who became famous for setting a record for the fastest solo non-stop round-the-world voyage in 2005. Dame Ellen is from the Isle of Wight, where the creature's fossils were found. Before Dr Lockwood analysed them, the fossils, which date back 125 million years, were thought to be from one of the two known iguanodontian dinosaur species from the island. \"But this one had particularly long neural spines, which was very unusual,\" he said. Writing in the scientific journal Papers in Palaeontology, Dr Lockwood said his study showed the dino would have probably had a pronounced sail-like structure along its back. The exact purpose of such features \"has long been debated, with theories ranging from body heat regulation to fat storage\". In this case, researchers think it was most likely to be for \"visual signalling, possibly as part of a sexual display\". Read more from Sky News:Trump's been made to look weakFight to redraw America's political mapCan Britain's new missile systems protect us? For the study, the researchers compared the fossilised bones with a database of similar dinosaur backbones which allowed them to see how these sail-like formations had evolved. Dr Lockwood said his team showed Istiorachis's spines \"weren't just tall, they were more exaggerated than is usual in Iguanodon-like dinosaurs, which is exactly the kind of trait you'd expect to evolve through sexual selection\". Professor Susannah Maidment, of the Natural History Museum, said: \"Jeremy's careful study of fossils that have been in museum collections for several years has brought to life the iguandontian dinosaurs of the Isle of Wight. \"His work highlights the importance of collections like those at [Isle Of Wight museum] Dinosaur Isle, where fossil specimens are preserved in perpetuity and can be studied and revised in the light of new data and new ideas about evolution. \"Over the past five years, Jeremy has single-handedly quadrupled the known diversity of the smaller iguanodontians on the Isle of Wight, and Istiorachis demonstrates we still have much to learn about Early Cretaceous ecosystems in the UK.\""
    },
    {
        "title": "Shoreham air crash: Families mark 10 years since one of UK's worst airshow disasters",
        "description": "On the 10th anniversary of the Shoreham air disaster, the families of some of those killed have criticised the regulator for what they describe as a \"shocking\" ongoing attitude towards safety.",
        "url": "https://news.sky.com/story/shoreham-air-crash-families-mark-10-years-since-one-of-uks-worst-airshow-disasters-13415866",
        "image_url": "https://e3.365dm.com/19/01/1920x1080/skynews-shoreham-air-crash_4548483.jpg?20250821200118",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-08-21 18:51:00",
        "Headline": "The Shoreham Airshow disaster of 2015 was the deadliest the UK had seen in more than 60 years. Eleven people were killed and more were injured.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  On the 10th anniversary of the Shoreham air disaster, the families of some of those killed have criticised the regulator for what they describe as a \"shocking\" ongoing attitude towards safety. On 22 August 2015, a vintage fighter jet plummeted out of the sky and crashed into one of the busiest roads in Sussex, killing 11 men. Most of them weren't even watching the aerobatic display overhead when they were engulfed in a fireball that swept down the dual carriageway. Jacob Schilt, 23, and his friend Matthew Grimstone, also 23, were driving to play in a match for their football team, Worthing United FC. Both sets of parents are deeply angry that their beloved sons have lost their lives in this way. \"It obviously changed our lives forever, and it's a huge reminder every 22nd of August, because it's such a public anniversary. It's destroyed our lives really,\" his mum, Caroline Shilt, said. \"It was catastrophic for all of us,\" Jacob's father, Bob, added. 'They had no protection' Sue and Phil Grimstone argue that the regulator, the Civil Aviation Authority (CAA), has not been held accountable for allowing the airshow to take place where it did. \"At Shoreham, the permission given by the CAA did not allow displaying aircraft to perform over paying spectators or their parked cars,\" they said. \"But aircraft were permitted to fly aerobatics directly over the A27, which was in the display area, a known busy road. \"This was about ignoring the safety of people travelling on a major road in favour of having an air show. They had no protection.\" A series of catastrophic errors The crash happened while the experienced pilot, Andy Hill, a former RAF instructor, was attempting to fly a loop in a 1950s Hawker Hunter jet. But he made a series of catastrophic errors. His speed as the plane pitched up into the manoeuvre was far too slow, and therefore, he failed to get enough height to be able to pull out of the dive safely. The jet needed to be at least 1,500ft higher. Mr Hill survived the crash but says he does not remember what happened, and a jury at the Old Bailey found him not guilty of gross negligence manslaughter in 2019. When the inquest finally concluded in 2022, the coroner ruled the men had been unlawfully killed because of a series of \"gross errors\" committed by the pilot. The rules around air shows have been tightened up since the crash, with stricter risk assessments, minimum height requirements, crowd protection distances, and checks on pilots. But Jacob and Matt's families believe the CAA still isn't doing enough to protect people using roads near airshows, or other bystanders not attending the events themselves. The families recently raised concerns about the Duxford airshow in a meeting with the CAA. While aircraft are no longer allowed to fly aerobatics over the M11, they do so nearby - and can fly over the road at 200ft to reconfigure and return. If the M11 has queuing traffic in the area, the display must be stopped or curtailed. The Grimstones believe this demonstrates accepting \"an element of risk\" and are frustrated that the CAA only commissioned an independent review looking at congested roads and third-party protection earlier this year. \"We feel the CAA are still dragging their feet when it comes to the safety of third parties on major roads directly near an air show,\" they said. The family have complained about the CAA to the parliamentary ombudsman. 'There are still question marks' Some experts also believe the CAA has questions to answer about a previous incident involving Mr Hill, after organisers of the 2014 Southport Airshow brought his display to an emergency stop because he had flown too close to the crowd, and beneath the minimum height for his display. In its investigation into the Shoreham disaster, the Air Accident Investigation Branch (AAIB) later found that while the CAA inspector present had an informal discussion with the pilot, no further action was taken, and the incident was not reported to the AAIB. Retired pilot Steve Colman has spent many years looking into what happened at Shoreham, and he believes the CAA failed to fulfil their statutory obligation to fully investigate and report the incident at Southport. \"You have to ask the question - if the Southport incident had been investigated, then was Shoreham more likely or less likely to have occurred?\" he said. \"I think there can only be one answer - it's less likely to have occurred.\" Tim Loughton, who was the MP for Shoreham at the time, believes a balance must be struck. \"We don't want to regulate these events out of existence completely. A lot of the smaller air shows no longer happened because they couldn't comply with the new regulations […], but certainly there are still question marks over the way the CAA conducted and continues to conduct itself. I would welcome more parliamentary scrutiny.\" Read more from Sky News:London Underground workers to strikeMan charged with killing ice cream seller Rob Bishton, chief executive at the CAA, said: \"Our thoughts remain with the families and friends of those affected by the Shoreham Airshow crash. \"Following the crash, several investigations and safety reviews were carried out to help prevent similar incidents in the future. This included an immediate review of airshow safety and a full investigation by the Air Accidents Investigation Branch. All recommendations and safety improvements from these reviews were fully implemented. \"Airshows continue to be subject to rigorous oversight to ensure the highest possible safety standards are maintained. \"At a previous airshow in 2014 the pilot involved in the Shoreham accident was instructed to abort a display by the show's flying director. This incident was investigated by the UK Civil Aviation Authority and regulatory action was taken.\" Mr Bishton added: \"As part of the work to review the safety oversight of airshows following the tragic Shoreham crash, the actions taken by the regulator following such a stop call were enhanced.\" But the families of those killed still believe much more could be done."
    },
    {
        "title": "Liberty Steel's Speciality Steels UK pushed into compulsory liquidation",
        "description": "One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control.",
        "url": "https://news.sky.com/story/liberty-steels-speciality-steels-uk-pushed-into-compulsory-liquidation-13415789",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-liberty-steel-rotherham_5317948.jpg?20210325194938",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-08-21 15:49:00",
        "Headline": "Speciality Steel UK has been pushed into compulsory liquidation, despite reported attempts for a deal. The government will take over, but will also try and find a new buyer for the business that employers 1,500 people.",
        "Content": "\n          Political reporter\n              @TimJ_B\n One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control. Speciality Steels UK (SSUK), part of the Liberty Steel empire owned by metals tycoon Sanjeev Gupta, employs nearly 1,500 people at sites in Rotherham and several other locations across South Yorkshire. Behind Tata Steel and British Steel, it is the third-largest steel producer in the country. Politics live: New migrant stats released Sky News reported that negotiations had been underway for a deal to rescue the firm, however, they seem to have been rendered unsuccessful. The government-run Insolvency Service confirmed it will be acting as the liquidator. It added that Teneo Financial Advisory Limited would be assisting in running the company from now on. While the GFG Alliance, the holding company, says it is disappointed by the decision, local politicians and unions are highly critical of the group. Business and economics correspondent The collapse of Speciality Steel UK (SSUK), the UK's third-largest steel producer, did not come as a surprise to government officials, who have in recent days been planning for this outcome. \n After all, the business has been limping on for some time, weighed down by financial mismanagement and a mounting debt pile. Problems began in 2021 for GFG Alliance - the holding company, which is a conglomerate run by the metals magnate Sanjeev Gupta. Its main lender, Greensill Capital, collapsed with £3.7bn of loans to GFG still outstanding. Administrators for Greensill are still trying to recover the money. \n There have been legal claims and probes since then, although GFG denies any wrongdoing. The true scale of SSUK's financial woes are not even known because the company has not filed audited accounts for more than five years. Sanjeev Gupta is being prosecuted for failing to file accounts for many of his other businesses too. SSUK's creditors pushed for the company's liquidation, but the government was braced to step in. However, the development does little to provide certainty for the business's 1,500 workers in South Yorkshire. The government will cover wages and costs for now but, as a letter sent by the Department for Business and Trade made clear earlier this month, the government has no intention to \"own SSUK\". As with British Steel, which collapsed back in April (albeit for different reasons), the government is stepping up, but is hoping a new buyer will be found soon. The government says wages will continue to be paid by the liquidator. A spokesperson adds that the government is still \"committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK\". Financial assistance was not able to be given to SSUK by the government due to its existing financial and corporate challenges, including ownership and management. Read moreWhitehall on alert for collapse of steel empireBlackRock backs Gupta's bid to keep controlWhy did British Steel need saving In a statement today, GFG's chief transformational officer, Jeffrey Kabel said: \"The decision to push Speciality Steel UK into compulsory liquidation, especially when we have support from the world's largest asset manager to resume operations and facilitate creditor recovery, is irrational. \"The plan that GFG presented to the court would have secured new investment in the UK steel industry, protecting jobs and establishing a sustainable operational platform under a new governance structure with independent oversight. \"Instead, liquidation will now impose prolonged uncertainty and significant costs on UK taxpayers for settlements and related expenses, despite the availability of a commercial solution. \"Liberty has pursued all options to make its SSUK viable, including efficiency improvements, reorganisations, customer support, several attempts to find a buyer for the business and intensive negotiations with creditors to restructure debt liabilities. Liberty's shareholder has invested nearly £200m, recognising the vital role steel plays in supplying the UK's strategic defence, aerospace and energy industries. \"GFG will now continue to advance its bid for the business in collaboration with prospective debt and equity partners and will present its plan to the official receiver. GFG continues to believe it has the ideas, management expertise and commitment to lead SSUK into the future and attract major investment. GFG's other significant business interests in the UK remain unaffected. \"Despite many challenges facing the group and the difficult market conditions, GFG has invested over £2bn into the UK economy since 2013, ensuring the survival of many GFG businesses despite operating losses and safeguarding thousands of jobs that would otherwise have been lost.\" Sarah Champion, the Labour MP for Rotherham, said GFG's statement was \"full of hollow promises\". She added: \"We know Liberty is a golden goose, but one they have starved for years. \"The speciality steel we make is unique and in high demand, it makes no financial sense that GFG furloughed the plant for nearly two years. \"Strategically, the government cannot allow Liberty Steel to fail. I am confident they will do all in their power to let it flourish.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈  Charlotte Brumpton-Childs, the national officer for the GMB union, also attacked GFG. She said: \"This is another tragedy for UK steel - and the people of South Yorkshire - this time brought on by years of chronic mismanagement by the owners. \"But this represents an opportunity for the UK government to take decisive action - as it did with British Steel - to protect this vital UK industry.\" A government spokesperson said: \"We know this will be a deeply worrying time for staff and their families, but we remain committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK. \"It is now for the independent Official Receiver to carry out their duties as liquidator, including ensuring employees are paid, while we also make sure staff and local communities are supported.\""
    },
    {
        "title": "Why Germany's top football league is turning to this man",
        "description": "The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete.",
        "url": "https://news.sky.com/story/why-germanys-top-football-league-is-turning-to-this-man-13415910",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rob-harris-mark-goldbridge_6997282.jpg?20250821230930",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-08-21 21:19:00",
        "Headline": "Tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube, run by the renowned Manchester United fan Mark Goldbridge.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete. Not only to find an audience, but to find outlets to even show the matches. So German football had to think differently - going to where Gen Z is engaging with football through content creators. And that's why tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube. It's run by Mark Goldbridge, known for passionate but often provocative, punchy commentary about players on streams going viral. His brand was built by being filmed reacting to watching Manchester United matches. \"People need to appreciate that we have a certain content style, and that's very, very popular,\" Goldbridge told Sky News. \"That is an area that needs to be catered [to] and that's why, without the rights, we've had such big, big audiences.\" Goldbridge revealed he isn't paying to show his 20 Friday night matches this season - reinforcing how the Bundesliga struggled to find a buyer in Britain. Sky Sports previously had a four-year rights deal to exclusively show those German matches here, but will now only show the prestige Saturday evening slot live. European leagues are finding it increasingly difficult in this market to sell their rights because domestic football is so dominant and appealing. The focus of football budgets is on domestic games for Sky as well as Discovery-owned TNT Sports, which also focuses its European football coverage on men's continental competitions, including the Champions League. More Premier League matches will be shown live than ever before - with at least 215 on Sky, the parent company of Sky News, and others on TNT. Sky Sports also has live men's rights to the English Football League and Scottish matches, as well as sharing the Women's Super League with the BBC. The Bundesliga is also making the games broadcast by Goldbridge's channel available to the BBC to stream online. They will further be on The Overlap, a YouTube channel part-owned by Gary Neville. 'A progressive step' Bundesliga International CEO Peer Naubert said: \"Our approach is as diverse as our supporters: by combining established broadcasters with digital platforms and content creators, we are taking a progressive step in how top-level football can be experienced. \"This multi-layered strategy allows us to connect with more audiences across the UK and Ireland, giving every supporter the chance to engage … in the way that suits them best.\" While the former England and Manchester United player is a star pundit on Sky, he could also be seen as a rival to the Comcast-owned broadcaster by attracting fans to newer outlets of his channel. Read more from Sky News:Man charged with killing ice cream sellerLondon Underground workers to strike Goldbridge doesn't see himself as a rival yet to long-established broadcasters. \"We're not looking to replace what you can find on Sky or the BBC or anything like that,\" he said. \"This is a community that will be live with us, watching the Bundesliga, learning about it. \"And if I get a pronunciation wrong, or I don't know about a player, then I've got my community there to back me up. I don't profess to know everything.\" 'This is the future' But he can be relatable to audiences, with more than two million subscribing to his The United Stand channel, earning him millions of pounds over the last decade. \"We've been there growing in the background and I think certain media outlets have ignored that, maybe hoping it would go away,\" he said. \"I certainly think synergy and collaboration need to happen more because there are things in the mainstream that I don't like and there will be people out there that really don't like the way we watch football, but a lot of people do. \"And it's about offering that choice to people and there are different ways people listen to football on the radio, people watch it with a commentator, some people turn the audio off completely, some people watch things like this (watch-a-long). \"And I think that is the future, to offer more choice.\""
    },
    {
        "title": "Chris Brain: Jury discharged in trial of ex-priest who ran rave-inspired 'cult' group",
        "description": "A jury has been discharged in the trial of a former Church of England priest who ran a rave-inspired \"cult\" group.",
        "url": "https://news.sky.com/story/chris-brain-jury-discharged-in-trial-of-ex-priest-who-ran-rave-inspired-cult-group-13415796",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chris-brain-priest_6997062.jpg?20250821183621",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-21 15:57:00",
        "Headline": "The Church of England said it was \"truly sorry\" for what it described as an \"appalling abuse of power in leadership\" while police called Christopher Brain \"a devious and arrogant sexual predator\".",
        "Content": " A jury has been discharged in the trial of a former Church of England priest who ran a rave-inspired \"cult\" group. Christopher Brain, 68, from Wilmslow, Cheshire, was the leader of the Nine O'Clock Service (NOS) in Sheffield between 1986 and 1995. He was charged with one count of rape and 36 counts of indecent assault between 1981 and 1995 against 13 women. Brain, who denied all the charges, was found guilty of 17 counts of indecent assault relating to nine women and acquitted of 15 similar charges. The 11-strong jury, sitting at Inner London Crown Court, was discharged by Judge Freya Newbery on Thursday after failing to reach a verdict on five counts, having started deliberations on 12 August. The judge told the jurors: \"I am going to discharge you now on those counts. For you, it all comes to an end now. I am really grateful for such a lot of time that you have given.\" A further hearing to determine whether prosecutors believe there are grounds for a retrial for the charges was set for 4 September. The prosecution previously told jurors that NOS, which was aimed at younger people, \"presented itself to the outside world as a progressive force for good\". But the court heard Brain \"dominated and abused his position\" to sexually assault a \"staggering number of women from his congregation\", including during massages. He denied brainwashing people to satisfy his sexual desires or ostracising female followers from friends and family. Church of England: 'Truly sorry' Joanne Grenfell, lead bishop for safeguarding in the Church of England, and Alexander Kubeyinje, national safeguarding director, released a joint statement in which they said they were \"truly sorry\". \"Our thoughts and prayers today are with the women who have bravely come forward to share their testimonies. \"The conviction of Chris Brain on 17 counts of indecent assault has resulted in lasting damage to their lives, and they were an appalling abuse of power in leadership that should never have happened. We are truly sorry.\" In a statement, Pete Wilcox, Bishop of Sheffield, echoed that same comment, adding that he was \"deeply sorry\" for the harm suffered. \"Where concerns were raised in the past and were not acted upon properly, that was a failing of the Church. For those institutional failures, I offer an unreserved apology. We are committed to supporting those affected. \"Words will never undo the harm that has been caused. We will, however, continue to work to ensure the Church is a safe place for everyone.\" He added the diocese would continue to cooperate with police, adding that there was a safeguarding team available to offer support and counselling. 'Devious and arrogant sexual predator' Detective Superintendent Eleanor Welsh, senior investigating officer at South Yorkshire Police, said: \"Brain is a devious and arrogant sexual predator who caused these women significant harm through his abuse of power and cruel manipulation of their faith. \"While I am pleased with the guilty verdicts, I know for the victims it can never take away what Brain did to them. However, I hope that it brings some comfort to know they have had a voice, they have been heard, and the jury has accepted that Brain is a serial sex offender.\" Read more from Sky News:Skydiver deliberately fell to deathRMT workers announce strikesSteel firms forced into liquidation 'Lycra Lovelies' looked after Brain At its peak, the weekly Nine O'Clock Service - held at 9pm on a Sunday - attracted up to 600 people. Prosecutors say a \"homebase\" team of \"attractive women\", wearing lingerie or other revealing clothing, known as \"the Lycra Lovelies\" or \"the Lycra Nuns\", was set up to look after Brain, his wife and his daughter at their home. The women said they slept on the floor and were issued with detailed instructions on how to prepare meals, clean, answer the phone, and even how to treat the family dog, the court heard. Some members donated large sums of money, gave up their inheritances or homes to NOS and lived in poverty, the jury was told. Brain's lifestyle was described as \"extravagant\" in comparison, as he had a mobile phone and car, wore designer clothes and ate at nice restaurants. 'Chrisnapping' One woman described Brain as a \"predator hiding in plain sight\" who \"would pick off women who he viewed as vulnerable\". The court heard the term \"Chrisnapped\" was used to describe how Brain would pick up women off the street in his car before he stroked their legs and talked about sex. NOS collapsed in 1994 after women made allegations about Brain and the Church of England set up places for vulnerable alleged victims to get help and therapy. Retired Bishop Stephen Lowe said in pre-recorded evidence that he confronted Brain about claims he had \"abused\" 20 to 40 women, and he replied: \"I thought it was more, maybe perhaps double\". 'Raging narcissism' Jurors were also told Brain's Church of England ordination was \"fast-tracked\" in 1991, and he wore the same cassock worn by actor Robert De Niro in the movie \"The Mission\" at the ceremony. Brain resigned from his holy orders in 1995 amid \"enormous media interest\" but prosecutors suggested he agreed to be interviewed for a BBC Everyman documentary because of his \"raging narcissism\". In the programme, Brain admitted being \"involved in improper sexual conduct with a number of women\", but said this was only after a lengthy development of a friendship. Giving evidence, Brain cut a very different figure from the charismatic cult leader described by witnesses, as he mumbled and was frequently asked to raise his voice. He told the jury that any touching was done with \"100%\" consent and suggested the women had \"to exaggerate these things to make it either sexual or controlling\" in order \"to make a criminal case\"."
    },
    {
        "title": "Government struggling to reduce migrant hotel use as asylum claims hit record level",
        "description": "Government efforts to reduce the use of expensive hotel accommodation for asylum seekers have stalled in the face of local opposition and court bottlenecks.",
        "url": "https://news.sky.com/story/government-struggling-to-reduce-migrant-hotel-use-as-asylum-claims-hit-record-level-13415697",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-teaser-homeless_6997093.jpg?20250821173917",
        "type": "UK",
        "Author": "Ben van der Merwe, Data and Forensics Unit",
        "Date Published": "2025-08-21 13:02:00",
        "Headline": "New data shows that the government is struggling to house asylum seekers, process their claims or reduce small boat arrivals.",
        "Content": "By Ben van der Merwe, Data and Forensics Unit  Government efforts to reduce the use of expensive hotel accommodation for asylum seekers have stalled in the face of local opposition and court bottlenecks. During last year's election, Labour promised to end the use of hotels by 2029. But data released on Thursday by the Home Office shows there are more asylum seekers in hotels than when Sir Keir Starmer took office. As of 30 June this year, there were 32,059 asylum seekers staying in hotels compared with 29,585 in June 2024. The government has been trying to get more asylum seekers into residential housing, which is much cheaper than hotels, by dispersing them to more locations across the country. But the arrival of asylum seekers in new areas, and the use of residential housing to accommodate them, has provoked a backlash from residents and local politicians. This has made it crucial for the government to cut the overall number in need of housing - either by reducing the number of applicants or by processing their claims more quickly. The data, however, shows that the government is struggling on both fronts. Effort to reduce hotel use Both Conservative and Labour governments have sought to decrease reliance on hotel accommodation for asylum seekers due to soaring costs. The Home Office spent £4.76bn on asylum last year, almost four times as much as it spent in 2020-21 (£1.34bn). Of every £1 spent, 76p went on hotel accommodation alone. Housing an asylum seeker in a hotel costs around £170 per night, compared with £27 for other types of accommodation, according to estimates by Oxford University's Migration Observatory. A policy introduced in 2023, under the Conservatives, sought to reduce reliance on hotels by dispersing asylum seekers more evenly across the country. Data shows that the policy started having an impact even before it was formally implemented. In September 2022, 31% of asylum seekers were housed in just ten councils. Three months later, that figure had fallen to 24%. But Sky News analysis shows that areas which have seen more asylum seekers arriving since then are actually more likely to use hotels - undercutting the purpose of the policy. And the arrival of asylum seekers in locations across the country has sparked protests by residents and legal action by councils. You can see how the policy has affected your area using the table below. Residents and politicians have also raised concerns about the main alternative to hotels - the use of residential housing, including houses in multiple occupation (HMOs). In her maiden speech to Parliament in May, Reform MP for Runcorn and Helsby Sarah Pochin described HMOs housing asylum seekers as \"breeding grounds for organised crime gangs\". A huge backlog of claims The fact that the government is being criticised wherever it places asylum seekers suggests that their real problem is the overall number of asylum seekers requiring accommodation. As of June, that number stood at 102,866, more than twice as high as March 2020 (48,042) and only 14% below the record levels reached in September 2023 (119,010). The government is required under international law to provide asylum seekers with housing while their claims are being assessed if they would otherwise be \"destitute\". And because the government also forbids asylum seekers from working until their claims are approved, that means they have to provide accommodation for almost all of them. Since 2020, the number of asylum seekers awaiting a final decision on their claim has more than doubled. That is partly due to a slowdown in processing asylum claims. In May 2019, the Conservative government abandoned a target of processing most claims within six months. By March 2020, the share processed within six months fell from 52% to 39%. \"By delaying or not taking decisions, they produced this huge backlog that also put a lot of pressure on the provision of accommodation,\" says Professor Nando Sigona of the University of Birmingham. A rise in asylum applications The issue was exacerbated by a surge in asylum claims after pandemic restrictions were eased in 2021. Home Office data shows that the number of decisions made on asylum applications fell during this period and only began to increase significantly in 2023. That increase in decisions has helped to cut the number of cases awaiting an initial decision over the past year from 85,839 to 70,532. On Thursday, as the statistics were released, Home Secretary Yvette Cooper said the government was making progress on the backlog and had reduced it by 18%. But appeals to these initial decisions are common, and the government is required to house asylum seekers until their appeals are over. Data from the Ministry of Justice shows that, as of March this year, 50,976 claims were awaiting appeal decisions. That puts the total backlog at 129,721 cases, up from 119,066 in June last year. Professor Sigona says that the number of people applying for asylum has risen across Europe in recent years, but that other countries have avoided being obliged to house so many of them by relaxing work requirements. \"In Europe asylum seekers are allowed to work much more rapidly,\" says Eleonore Kofman, professor of gender, migration and citizenship at Middlesex University. Without the right to work, she says, \"you kind of lock them into destitution and you have to provide housing for them\". The government has struggled to reduce small boat arrivals As well as increasing the processing of asylum claims, the government has sought to reduce the number of claims by reducing small boat crossings. However, a total of 43,309 people arrived in the UK by small boat during Labour's first year in office, a 38% increase on the year before. Almost all of them (99%) claimed asylum. In the year to June, people crossing on small boats accounted for 38% of asylum claims. The UK requires people to apply for asylum from within the country but does not offer a visa for those wishing to make an application. This means that most people who want to flee to the UK must come illegally - either by using another type of visa, or by entering irregularly. On 6 August, a deal between the UK and France took effect, opening up a new route for asylum seekers and a possible way for the government to deter small boat crossings. Under the agreement, France will accept the return of migrants who arrive in the UK by small boat in exchange for the UK accepting an equivalent number of asylum seekers currently in France. Home Secretary Yvette Cooper said that the new policy \"sends a message to every migrant currently thinking of paying organised crime gangs to go to the UK that they will be risking their lives and throwing away their money if they get into a small boat.\" Speaking to Sky News on Thursday, director of the Migration Observatory think tank Madeleine Sumption said it remains unclear how many people France will agree to take back. \"If it's a relatively small, symbolic number... then asylum seekers may just see that there's one more risk... at the end of an already risky journey and [it's] something that they're willing to accept.\" As of Wednesday, 2,561 migrants had arrived in the UK by small boat since the policy took effect. Additional reporting by Sophia Massam. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "The latest migration stats are going in the wrong direction - and the argument might get more vicious",
        "description": "The UK government won't find much in the latest dump of migration data to back up its claim that it is restoring order to a broken asylum system.",
        "url": "https://news.sky.com/story/the-latest-migration-stats-are-going-in-the-wrong-direction-and-the-argument-might-get-more-vicious-13415839",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-immigration_6913891.jpg?20250821201553",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-08-21 17:34:00",
        "Headline": "If you thought the argument around hotels was vicious, just wait for the one that could follow if asylum seekers start to be moved out of hotels and into houses and flats in areas that already have a shortage of homes.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  The UK government won't find much in the latest dump of migration data to back up its claim that it is restoring order to a broken asylum system. In a competitive field, perhaps the most damaging stat is the rising number of small boat crossings - up 38% on 12 months previously and close to the peaks of 2023. That has helped push up asylum applications to record levels, which in turn has led to a rise in the use of hotel accommodation. Politics live: Read about the latest migration stats Deportations are up, but more than half of the total figure is foreign national offenders rather than failed asylum seekers. The backlog for initial decisions is coming down. But the approval rate for those applying for asylum after arriving on a small boat is still hovering around the 65% mark. \n                  Where can asylum seekers go if they can't be housed in hotels?\n                 \n                  Labour smell dirty tricks over asylum hotel court ruling - but the risks are clear\n                 \n                  Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court\n                 Another bottleneck is also forming as more people appeal their initial rejections - and require accommodation while they wait for an outcome. This all helps explain why people are still taking the risk of crossing the channel in the first place. It's still highly likely that if you get to the UK, you'll be able to stay. The row over the use of hotels is a product of this underlying problem. And if you thought that argument was vicious, just wait for the one that could follow if asylum seekers start to be moved out of hotels and into houses and flats in areas that already have a shortage of homes. It's why the only real endgame for the government is to find a way to stop people coming in the first place. Increased numbers of returns, including through the UK-France deal, could provide some deterrent. Read more:Where can asylum seekers go if not hotels?Labour smell dirty tricks over asylum court ruling8% rise in asylum seeker hotel usage  Beefed-up action to dismantle smuggling gangs and reforms to the time it takes for appeals to be heard will help too. So far though, all the figures that count are going in the wrong direction. What's more, there's some evidence that the data is looking particularly painful for Labour in some of its most vulnerable areas. A look down the list of councils with relatively high numbers of asylum seekers reveals several key election battlegrounds in the Midlands and North. These are regions where Reform is already campaigning hard. The stakes are high, and as it stands the government is being found wanting."
    },
    {
        "title": "Inequalities in GCSE results stubbornly persistent - here's what the data tells us",
        "description": "As over one million students receive their GCSE results, Sky News has found gender and factors linked to deprivation remain troubling predictors of students' performance.",
        "url": "https://news.sky.com/story/inequalities-in-gcse-results-stubbornly-persistent-as-education-secretary-acknowledges-8220appalling8221-attainment-gaps-for-white-working-class-children-13415742",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gcse-results-day-education_6997002.png?20250821154543",
        "type": "UK",
        "Author": "Kate Schneider, data journalist",
        "Date Published": "2025-08-21 14:41:00",
        "Headline": "Boys - state school students - less likely to achieve top grades compared with peers, according to a Sky News Data x Forensics unit analysis",
        "Content": "By Kate Schneider, data journalist  As over one million students receive their GCSE results, Sky News has found gender and factors linked to deprivation remain troubling predictors of students' performance. Overall GCSE grades are relatively consistent with last year's results, indicating stability has returned following the end of pandemic grading. The compulsory courses, Level 2 English and Mathematics, continue to be a hurdle for many GCSE students - with Thursday's results showing the highest failure rates for the two subjects in a decade. Yet, while overall grades are stable, so too are key attainment gaps that experts say point to deprivation. Education Secretary Bridget Phillipson denounced attainment gaps for white working-class children in an article for The Telegraph. \"It's appalling, and I won't stand by and watch those numbers continue to grow,\" Ms Phillipson wrote. \"It's not just the life chances of those children that are being damaged - it's also the health of our society as a whole.\" While the data does not share deprivation status or ethnicity of students, other strongly correlated factors such as English region and school type show stark inequalities. \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 \n                  New dinosaur named after record-breaking yachtswoman\n                 \n                  Shoreham air crash: Families mark 10 years since one of UK's worst airshow disasters\n                 Some 48.1% of GCSE exams sat at fee-paying schools in England received grades of 7 or above, compared with 18.2% at non-selective state schools. Fiona Spellman, CEO of education charity SHINE, said, \"The primary difference that drives the attainment gap between those who attend independent schools and those who don't really comes from the circumstances in those children's lives.\" Regional inequalities across England also remain significant. In London, 28.4% of GCSE exams were awarded a grade 7 or higher compared with just 17.8% of exams in the North East of England. But even students in London were outperformed by Northern Ireland, where 31.6% of GCSE students received a 7 or above. \"Deprivation is a major driver of the gap we see between the different regions and in terms of the attainment children achieve in all phases of education,\" said Ms Spellman. This year's cohort had both a disrupted primary and secondary school experience due to the pandemic - a factor that may be influencing some of these inequality gaps. \"We know that the pandemic affected all children, but we know that it didn't affect all children equally,\" added Ms Spellman. \"The legacy of COVID is still very much still alive today and how that had a disproportionate effect on the children who most need support is still working its way through.\" Gender gap stubbornly persistent One of the clearest divides in the results - and not mentioned by the education secretary - is gaps based on gender. Girls continue to receive a greater proportion of the top grades compared with boys. Among students receiving a 7/A or above, 55.8% were girls while 44.2% were boys. In England, the gap is wider when looking just at 16-year-old students taking 7 or more GCSEs. 60.7% of those in this cohort receiving all top grades were girls while 39.3% were boys. But, Jill Duffy, the chair of one of the main qualifications body, the OCR, pointed out the overall gender gap this year is the narrowest since 2000. However, Claire Thomson and Cath Jadhav, both board members of the Joint Council for Qualifications alongside Ms Duffy, cautioned that the decrease in the gender gap was too small to confirm any concrete trend. \"The change is relatively small, at fractions of percentage points, so there will be lots of individual factors which affect that,\" said Ms Jadhav. Certain subjects showed large gender imbalances between boys and girls. Girls were the most overrepresented in home economics, followed by performing/expressive arts, health & social care, hospitality, and social science subjects. In contrast, boys were disproportionately more likely to take other technology, construction, engineering, computing, and economics. Working-class boys facing hurdles So, is Ms Phillipson right to highlight white working-class children as falling behind? And should we be more concerned about white working-class boys in particular? While the data does not include sufficient detail on how these inequalities stack on each other, data published by the Department for Education (DfE) based on last year's results suggest white working-class boys are among the most disadvantaged in education. Among all children eligible for free school meals, White British boys were much less likely to receive a grade of 4 - a pass - or above on their GCSEs. Black Caribbean and mixed white/black Caribbean boys on free school meals had similarly poor pass rates. \"It's not all boys. And it's not all white working-class boys,\" said David Spendlove, professor at the University of Manchester's Institute for Education. But, \"boys top all of those key indicators: likely to be diagnosed with special needs, likely to be excluded from school.\" \"The system is stacked against them and at every single hurdle they are going to face challenges which mount increasingly over time,\" said Prof Spendlove. Beyond A-levels What's next for students receiving results on Thursday? According to DfE's 2024 numbers, just over 40% of 16-year-olds started an A-level course the following year. More than 20% started other Level 3 qualifications, such as T-levels or BTECs. Around 3.5% started apprenticeships. However, 6.2% were classified as not in education, employment, or training (\"NEET\"). Simon Ashworth, deputy CEO and head of policy for the Association of Employment and Learning Providers (AELP), said, \"The number of young people who are not in education, employment or training has got worse, not better.\" \"We're nearly to a million young people who are NEET,\" he said. \"That is a worry.\" Boys between the ages of 16 and 18 are more likely than their female counterparts to have NEET status, DfE data reveals.  Furthermore, individuals from disadvantaged backgrounds \"tend to be the young people who will be closest to the job market or the risk of becoming NEET once they leave education,\" shared Mr Ashworth. Mr Ashworth also added that some young people who pursue apprenticeships fail to complete them because they struggle to pass mandatory Level 2 Mathematics. Students who receive lower-than-desired results on Thursday, however, should stay optimistic that many doors remain open to them. This year saw a 12.1% rise in students 17 or older resitting exams this year. SHINE's Dr Helen Rafferty said that the resit rate is likely due to the pandemic as \"many students have come to the end of their secondary school journey having had the most chaotic and disrupted educational journey that you can imagine.\" Nonetheless, Ms Rafferty said, \"I do think it's encouraging that so many students are choosing to move on to an educational pathway which still provides them with that opportunity to get their English and maths results.\""
    },
    {
        "title": "Man charged with murder after fatal stabbing of ice cream seller in Wembley",
        "description": "A man has been charged with murder after the fatal stabbing of an ice cream seller in Wembley.",
        "url": "https://news.sky.com/story/man-charged-with-murder-after-fatal-stabbing-of-ice-cream-seller-in-wembley-13415848",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-shazad-khan-wembley_6996458.jpg?20250820201051",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-21 17:49:00",
        "Headline": "Zaher Zaarour, 26, is accused of killing ice cream seller Shazad Khan, 41, in Monks Park, Wembley, on Tuesday evening.",
        "Content": "A man has been charged with murder after the fatal stabbing of an ice cream seller in Wembley. Zaher Zaarour, 26, of Brent, has also been charged with possession of a bladed article. He has been remanded into custody and will appear at Willesden Magistrates' Court on Friday. Met Police officers responded to reports of a stabbing in Monks Park, Wembley, on Tuesday evening. Shazad Khan, 41, was treated by London Ambulance Service, but despite the efforts of paramedics, he was pronounced dead at the scene. A 31-year-old woman was arrested at the scene for conspiracy to murder. She has been bailed until September pending further inquiries, police said. On Wednesday, local resident Asim Mahmood Butt, 39, described Khan as a \"famous ice cream guy\" in the area who had been selling ice cream from his van - known locally for featuring a large teddy bear - for \"about a year\". Mr Butt said Mr Khan was married and had a young daughter. Police said Mr Khan's family has been informed and is being supported by specialist officers. Detective Chief Inspector Paul Waller said: \"I would like to thank the community for their help and support during this investigation.\" He added that residents can expect an increased number of officers in the area as the investigation continues. Detective Chief Superintendent Luke Williams, local policing commander for north-west London, said on Wednesday: \"Our thoughts remain with Shazad's family and friends at this unimaginably difficult time.\""
    },
    {
        "title": "Israel to continue with Gaza City offensive despite talks to free Hamas hostages",
        "description": "Israel will resume negotiations with Hamas for the release of all hostages captured during the October 7 attack, Benjamin Netanyahu has said - but its military will continue its Gaza City offensive despite international outcry.",
        "url": "https://news.sky.com/story/israel-to-continue-with-gaza-city-offensive-despite-talks-to-free-hamas-hostages-13415894",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel_6996596.jpg?20250821161240",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-21 20:26:00",
        "Headline": "Israel's Prime Minister Benjamin Netanyahu says he has \"issued instructions to begin immediate negotiations\" after Hamas agreed to a temporary ceasefire proposal.",
        "Content": " Israel will resume negotiations with Hamas for the release of all hostages captured during the October 7 attack, Benjamin Netanyahu has said - but its military will continue its Gaza City offensive despite international outcry. The remarks from Israel's prime minister are the first since Hamas agreed to a temporary ceasefire proposal. Talks will also be with a view to ending the war, but Mr Netanyahu said it must be on \"terms acceptable to Israel\". In the meantime, the Israel Defence Forces (IDF) have begun calling medics and international organisations in northern Gaza to encourage them to evacuate to the south ahead of the expanded operation in Gaza City. Many of Israel's closest allies have urged the government to reconsider. Some Israelis fear it could doom the remaining 20 or so living hostages taken by Hamas-led militants in the 7 October 2023 attack which ignited the war. Israel plans to call up 60,000 reservists and extend the service of 20,000 more. Speaking to soldiers near Israel's border with Gaza, Mr Netanyahu said he was still set on approving plans for defeating Hamas and capturing Gaza City. \"At the same time I have issued instructions to begin immediate negotiations for the release of all our hostages and an end to the war on terms acceptable to Israel,\" he said. \"These two things - defeating Hamas and releasing all our hostages - go hand in hand,\" he added. The latest ceasefire proposal drawn up by Egypt and Qatar is almost identical to an earlier one that Israel accepted before the talks stalled last month. The proposal would include the release of some hostages in exchange for Palestinian prisoners, a pullback of Israeli forces and negotiations over a lasting ceasefire. 'Don't tell us where to build' Israeli strikes killed at least 36 Palestinians across Gaza on Thursday, according to local hospitals, including at a tent camp in Deir al-Balah. Meanwhile, Israel's ambassador to the UK, Tzipi Hotovely, was summoned to the Foreign Office in response to a controversial West Bank settlement plan which has been given final approval. The project, known as the E1 settlement, would effectively cut off the occupied West Bank from East Jerusalem and divide the territory in two. The UK and 21 international partners have released a statement to condemn the decision \"in the strongest terms\" calling it \"a flagrant breach of international law\" and \"critically undermining a two-state solution\". Ms Hotovely gave Sky News her response to the meeting: \"I said we wouldn't tell the British where to build in London. Don't tell us where to build in Jerusalem, our capital. We see E1 as part of Greater Jerusalem.\"  UK warns of 'horrifying starvation' The UK has also responded to comments from the head of the UN Palestinian refugee agency UNRWA that famine in Gaza is \"deliberate\" and being used as an \"instrument of war\". Minister for the Middle East, Hamish Falconer, has called for a \"comprehensive [peace] plan to end this misery and get to a long-term settlement\". \"Israel must immediately and permanently lift all barriers preventing aid reaching the people of Gaza to prevent the horrifying starvation in the Strip continuing,\" he added. Read more from Sky News:Is Netanyahu is ready to negotiate?Palestinians flee Israeli advance  Demand for Gaza media access The Media Freedom Coalition, which includes the UK and 50 other countries, has called on Israel to allow foreign media access into Gaza. In a joint statement, the coalition, which is a partnership of countries working to defend media freedom, urged Israel to \"allow immediate independent foreign media access\" and \"afford protection for journalists operating in Gaza\". They said this was in light of the \"unfolding humanitarian catastrophe in Gaza\"."
    },
    {
        "title": "It's been a confusing week - and Trump's been made to look weak",
        "description": "It's been a confusing week.",
        "url": "https://news.sky.com/story/its-been-a-confusing-week-and-trumps-been-made-to-look-weak-13415929",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-washington-dc_6997300.jpg?20250822002205",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-08-21 22:31:00",
        "Headline": "A back and forth on security guarantees from Ukraine, Europe, and Russia all makes the president look rather weak, and it's unclear whether Trump's America would truly sign up to anything that obliges them to do anything.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n It's been a confusing week. The Monday gathering of European leaders and Ukraine's president with Donald Trump at the White House was highly significant. Ukraine latest: Trump changes tack The leaders went home buoyed in the knowledge that they'd finally convinced the American president not to abandon Europe. He had committed to provide American \"security guarantees\" to Ukraine.  The details were sketchy, and sketched out only a little more through the week (we got some noise about American air cover), but regardless, the presidential commitment represented a clear shift from months of isolationist rhetoric on Ukraine - \"it's Europe's problem\" and all the rest of it. Yet it was always the case that, beyond that clear achievement for the Europeans, Russia would have a problem with it. Trump's envoy's language last weekend - claiming that Putin had agreed to Europe providing \"Article 5-like\" guarantees for Ukraine, essentially providing it with a NATO-like collective security blanket - was baffling.  Russia gives two fingers to the president And throughout this week, Russia's foreign minister Sergei Lavrov has repeatedly and predictably undermined the whole thing, pointing out that Russia would never accept any peace plan that involved any European or NATO troops in Ukraine. \"The presence of foreign troops in Ukraine is completely unacceptable for Russia,\" he said yesterday, echoing similar statements stretching back years. Remember that NATO's \"eastern encroachment\" was the justification for Russia's \"special military operation\" - the invasion of Ukraine - in the first place. All this makes Trump look rather weak. It's two fingers to the president, though interestingly, the Russian language has been carefully calibrated not to poke Trump but to mock European leaders instead. That's telling. Read more on Ukraine:Trump risks 'very big mistake'NATO-like promise for Ukraine may be too good to be trueEurope tried to starve Putin's war machine - it didn't go as planned  The bilateral meeting hailed by Trump on Monday as agreed and close - \"within two weeks\" - looks decidedly doubtful. Maybe that's why he went along with Putin's suggestion that there be a bilateral, not including Trump, first. It's easier for the American president to blame someone else if it's not his meeting, and it doesn't happen. NATO defence chiefs met on Wednesday to discuss the details of how the security guarantees - the ones Russia won't accept - will work. European sources at the meeting have told me it was all a great success. And to the comments by Lavrov, a source said: \"It's not up to Lavrov to decide on security guarantees. Not up to the one doing the threatening to decide how to deter that threat!\" The argument goes that it's not realistic for Russia to say from which countries Ukraine can and cannot host troops.  Would Trump threaten force? The problem is that if Europe and the White House want Russia to sign up to some sort of peace deal, then it would require agreement from all sides on the security arrangements. The other way to get Russia to heel would be with an overwhelming threat of force. Something from Trump, like: \"Vladimir - look what I did to Iran...\". But, of course, Iran isn't a nuclear power. Something else bothers me about all this. The core concept of a \"security guarantee\" is an ironclad obligation to defend Ukraine into the future. Future guarantees would require treaties, not just a loose promise. I don't see Trump's America truly signing up to anything that obliges them to do anything. A layered security guarantee which builds over time is an option, but from a Kremlin perspective, would probably only end up being a repeat of history and allow them another \"justification\" to push back. Read more from Sky News:Inside the ISIS resurgence10 years since one of UK's worst air disastersHow Republicans are redrawing maps to stay in power Image and reality don't seem to match Among Trump's stream of social media posts this week was an image of him waving his finger at Putin in Alaska. It was one of the few non-effusive images from the summit. He posted it next to an image of former president Richard Nixon confronting Soviet leader Nikita Khrushchev - an image that came to reflect American dominance over the Soviet Union. That may be the image Trump wants to portray. But the events of the past week suggest image and reality just don't match. The past 24 hours in Ukraine have been among the most violent to date."
    },
    {
        "title": "Israel maintains pressure on Gaza City as 'first stages of attack begin'",
        "description": "Gaza City residents say Israel carried out intense overnight bombardments as it prepares a controversial offensive to take control of the area.",
        "url": "https://news.sky.com/story/israel-maintains-pressure-on-gaza-city-as-first-stages-of-attack-begin-13415738",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel_6996596.jpg?20250821161240",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-21 14:36:00",
        "Headline": "One Gaza City resident says people there face a decision to \"die at home or leave and die somewhere else\".",
        "Content": " Gaza City residents say Israel carried out intense overnight bombardments as it prepares a controversial offensive to take control of the area. Sixty-thousand reservists are being called up after Benjamin Netanyahu's security cabinet approved the plan earlier this month. UN chief Antonio Guterres has warned of more \"death and destruction\" if Israel tries to seize the city, while France's Emmanuel Macron said it would be a \"disaster\" that would lead to \"permanent war\". Live - UN warns of 'forcible transfer' as forces advance on Gaza City Hundreds of thousands of people could end up being forcibly displaced - a potential war crime, according to the UN's human rights office. Gaza's health ministry said at least 70 people had been killed in Israeli attacks in the past 24 hours, including eight people in a house in the Sabra suburb of Gaza City. Israel currently controls about 75% of the Gaza Strip, but Prime Minister Netanyahu has said Israel must take Gaza City to \"finish the job\" and defeat Hamas. \n                  Israel to continue with Gaza City offensive despite talks to free Hamas hostages\n                 \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 \n                  Gaza latest: Netanyahu says Israel will begin talks to free hostages and end war\n                 Mr Netanyahu and his ministers are due to meet on Thursday to discuss the plans, according to Israeli media. Military spokesperson Effie Defrin said earlier that \"preliminary operations and the first stages of the attack\" had begun - with troops operating on the outskirts of Gaza City. Israel has said it will order evacuation notices before troops move in but satellite images show thousands of people have already left.  Residents said shelling has intensified in the Sabra and Tuffah neighbourhoods and that those fleeing have gone to coastal shelters or to central and southern parts of the Strip. The decision to stay or leave is an agonising choice for many. \"We are facing a bitter-bitter situation, to die at home or leave and die somewhere else, as long as this war continues, survival is uncertain,\" said father of seven Rabah Abu Elias. \"In the news, they speak about a possible truce, on the ground, we only hear explosions and see deaths. To leave Gaza City or not isn't an easy decision to make,\"  Most of the Israeli reservists being summoned are not expected to be in a frontline combat role and the call-up is set to take a while. The window could give mediators more time to convince Israel to accept a temporary ceasefire. Hamas has already agreed to the proposal - envisaging 10 living hostages and 18 bodies being released in return for a 60-day truce and the freedom of about 200 Palestinian prisoners. Israel hasn't officially responded, but insists it wants all 50 remaining hostages released at once. Only 20 of them are still believed to be alive. The war started nearly two years ago when a Hamas terror attack killed about 1,200 people and kidnapped around 250. Read more:Tents abandoned as Palestinians flee Israeli advance  More than 62,000 Palestinians have been killed in the war, according to Gaza's health ministry. The figure doesn't break down how many were Hamas members, but it says women and children make up more than half. Two more people also died of starvation and malnutrition in the past 24 hours, the ministry said on Thursday, taking the total to 271, including 112 children. COGAT, the body controlling aid into Gaza, said 250 aid trucks entered on Wednesday, with 154 pallets air-dropped."
    },
    {
        "title": "Why Germany's top football league is turning to this man",
        "description": "The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete.",
        "url": "https://news.sky.com/story/why-germanys-top-football-league-is-turning-to-this-man-13415910",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rob-harris-mark-goldbridge_6997282.jpg?20250821230930",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-08-21 21:19:00",
        "Headline": "Tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube, run by the renowned Manchester United fan Mark Goldbridge.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete. Not only to find an audience, but to find outlets to even show the matches. So German football had to think differently - going to where Gen Z is engaging with football through content creators. And that's why tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube. It's run by Mark Goldbridge, known for passionate but often provocative, punchy commentary about players on streams going viral. His brand was built by being filmed reacting to watching Manchester United matches. \"People need to appreciate that we have a certain content style, and that's very, very popular,\" Goldbridge told Sky News. \"That is an area that needs to be catered [to] and that's why, without the rights, we've had such big, big audiences.\" Goldbridge revealed he isn't paying to show his 20 Friday night matches this season - reinforcing how the Bundesliga struggled to find a buyer in Britain. Sky Sports previously had a four-year rights deal to exclusively show those German matches here, but will now only show the prestige Saturday evening slot live. European leagues are finding it increasingly difficult in this market to sell their rights because domestic football is so dominant and appealing. The focus of football budgets is on domestic games for Sky as well as Discovery-owned TNT Sports, which also focuses its European football coverage on men's continental competitions, including the Champions League. More Premier League matches will be shown live than ever before - with at least 215 on Sky, the parent company of Sky News, and others on TNT. Sky Sports also has live men's rights to the English Football League and Scottish matches, as well as sharing the Women's Super League with the BBC. The Bundesliga is also making the games broadcast by Goldbridge's channel available to the BBC to stream online. They will further be on The Overlap, a YouTube channel part-owned by Gary Neville. 'A progressive step' Bundesliga International CEO Peer Naubert said: \"Our approach is as diverse as our supporters: by combining established broadcasters with digital platforms and content creators, we are taking a progressive step in how top-level football can be experienced. \"This multi-layered strategy allows us to connect with more audiences across the UK and Ireland, giving every supporter the chance to engage … in the way that suits them best.\" While the former England and Manchester United player is a star pundit on Sky, he could also be seen as a rival to the Comcast-owned broadcaster by attracting fans to newer outlets of his channel. Read more from Sky News:Man charged with killing ice cream sellerLondon Underground workers to strike Goldbridge doesn't see himself as a rival yet to long-established broadcasters. \"We're not looking to replace what you can find on Sky or the BBC or anything like that,\" he said. \"This is a community that will be live with us, watching the Bundesliga, learning about it. \"And if I get a pronunciation wrong, or I don't know about a player, then I've got my community there to back me up. I don't profess to know everything.\" 'This is the future' But he can be relatable to audiences, with more than two million subscribing to his The United Stand channel, earning him millions of pounds over the last decade. \"We've been there growing in the background and I think certain media outlets have ignored that, maybe hoping it would go away,\" he said. \"I certainly think synergy and collaboration need to happen more because there are things in the mainstream that I don't like and there will be people out there that really don't like the way we watch football, but a lot of people do. \"And it's about offering that choice to people and there are different ways people listen to football on the radio, people watch it with a commentator, some people turn the audio off completely, some people watch things like this (watch-a-long). \"And I think that is the future, to offer more choice.\""
    },
    {
        "title": "Police in Kenya begin exhuming shallow graves of suspected cult victims",
        "description": "Police, pathologists and grave diggers have started the exhumation of 27 shallow graves in Kenya's Kilifi County.",
        "url": "https://news.sky.com/story/police-in-kenya-begin-exhuming-shallow-graves-of-suspected-cult-victims-13415858",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-africa-kenya_6997163.jpg?20250821193428",
        "type": "World",
        "Author": "Vauldi Carelse, Africa producer",
        "Date Published": "2025-08-21 18:23:00",
        "Headline": "The remains are believed to be of followers of a religious cult in Chakama Ranch, a part of the Shakahola Forest.",
        "Content": "By Vauldi Carelse, Africa producer  Police, pathologists and grave diggers have started the exhumation of 27 shallow graves in Kenya's Kilifi County. The remains are believed to be of followers of a deadly cult in Chakama Ranch, a part of the Shakahola Forest. In 2023, more than 400 mass graves were discovered in the same forest, all members of controversial preacher Paul Mackenzie's church. They were encouraged to starve themselves to death to get into heaven. It remains one of the world's worst cult-related tragedies. Mackenzie is still in jail and faces numerous charges of terrorism, child torture and murder. The remote forest has again been turned into a crime scene. Morticians were seen carrying out body bag after body bag, some containing the remains of children believed to have been starved to death. State pathologist Dr Richard Njoroge said this is just the beginning, as investigators expect to find many more bodies: \"Today we managed to exhume six. \"Of the six graves, we found five bodies and then also around that area we found ten different scattered body parts, scattered in different places on the surface.\" Eleven suspects have already been arrested in connection with these deaths and will appear in court on Friday. Police are investigating links to Mackenzie and members of his Good News International Church. At the exhumation today, pathologists said they were still working to identify the bodies of those exhumed from Mackenzie's cult. \"We had 453 at the closure of that exercise, I think, we released around 33 or 34 last time. So, from there are 419 remaining,\" Dr Njoroge explained. Read more from Sky News:Captured ISIS fighters speaks from death rowIsrael begins first stages of takeover operation Police have encouraged families in the area with missing loved ones to come forward and provide their DNA samples, as efforts to identify the dead continue. Kenya is grappling with a rise in religious extremism and many churches operating informally. Parliament passed several preliminary bills aimed at regulating religious organisations last year, but implementation has stalled after resistance from church leaders."
    },
    {
        "title": "Promise of NATO-style security guarantees for Ukraine may be too good to be true",
        "description": "It all sounded so promising: A NATO-style mutual defence guarantee for Ukraine, provided by the US, and agreed to by Vladimir Putin.",
        "url": "https://news.sky.com/story/promise-of-nato-style-security-guarantees-for-ukraine-may-be-too-good-to-be-true-13415775",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sergei-lavrov-press-conference_6996902.jpg?20250821134007",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-08-21 15:31:00",
        "Headline": "Russian foreign minister Sergei Lavrov described discussions about future security guarantees for Ukraine as a \"road to nowhere\". Now, he says they're \"hopeless\".",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n It all sounded so promising: A NATO-style mutual defence guarantee for Ukraine, provided by the US, and agreed to by Vladimir Putin. That was supposedly the concession won by Donald Trump during his summit with the Russian president in Alaska. US special envoy Steve Witkoff described the apparent breakthrough as \"game-changing\". But it seems it may be too good to be true. Because judging by the comments from Moscow since then, nothing has changed whatsoever. Russian foreign minister Sergei Lavrov described the current discussions about future security guarantees for Ukraine as a \"road to nowhere\". And now, \"hopeless\". On both occasions, the veteran diplomat made it clear that the only security guarantee Russia is willing to accept is one that involves them, referring each time to a proposal put forward by Moscow at talks with Kyiv in 2022. Under those terms, Russia would be among a group of guarantors, along with China, and would have an effective veto over any efforts to defend Ukraine. It was a non-starter for Kyiv then, and it still is now. But the Kremlin knows this. I think it's a proposal that's designed to be rejected, so that Russia can continue its attempts to portray Ukraine as the barrier to peace, and try to distance Trump from Europe. \"[Ukraine is] not interested in a sustainable, fair, long-term settlement,\" Lavrov said in Moscow, while also accusing Europe of \"undermining\" the \"progress\" made in Alaska. But the only progress appears to be circular - there's plenty of movement, but it's going nowhere, like a hamster stuck in a wheel. The same goes for the potential meeting between Volodymyr Zelenskyy and Putin. At the start of the week, Trump claimed the two sides were \"setting it up\", but Moscow still has its caveats. \"Our president has repeatedly said that he is ready to meet,\" Lavrov said, \"with the understanding that all issues…are worked out\". Moscow claims Zelenskyy is an illegitimate leader, and Russia's foreign minister hinted that he would need to be re-elected before any peace deal is signed, and before a presidential summit is held. Read more from Sky News:Two reasons why Trump is 'frightened' of PutinTrump sets red line on Ukraine peace deal support So, despite the Trump administration's optimism that a peace deal is within reach, it is clear that two of the fundamental stumbling blocks remain. And Russia is in no obvious rush to find a way around them."
    },
    {
        "title": " Italy arrests Ukrainian over Nord Stream attacks, German prosecutors say",
        "description": "Italian police have arrested a Ukrainian man suspected of coordinating attacks on the Nord Stream pipelines, Germany's prosecutor general said on Thursday.",
        "url": "https://news.sky.com/story/italy-arrests-ukrainian-over-nord-stream-attacks-german-prosecutors-say-13415622",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-nord-stream-pipeline_6081538.jpg?20230307223429",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-21 10:32:00",
        "Headline": "Italian police sources close to the investigation told Sky News the suspect was on holiday with his family on the Adriatic coast when he was arrested.",
        "Content": "Italian police have arrested a Ukrainian man suspected of coordinating attacks on the Nord Stream pipelines, Germany's prosecutor general said on Thursday. The suspect, identified only as Serhii K. under German privacy laws, was part of a group of people who planted devices on the pipelines near the Danish island of Bornholm in September 2022, a statement from the prosecutor's office said. Italian police sources close to the investigation confirmed the arrest to Sky News and said the suspect was on holiday with his family at the time. Serhii K. was found in San Clemente in the Rimini province on Italy's Adriatic coast and is currently in jail pending a ruling on his extradition by the appeal court in Bologna, the sources added. Police had acted on a European arrest warrant for the suspect, who faces charges of collusion to cause an explosion, anti-constitutional sabotage and the destruction of structures. Follow latest: Ukraine war live updates Serhii K. and his accomplices had set off from Rostock on Germany's north-eastern coast in a sailing yacht to carry out the attack, according to the German prosecutor's office. \n                  Oasis fan dies in hotel room hours before show in Edinburgh\n                 \n                  Thousands evacuated as deadly wildfires sweep Europe\n                 \n                  Italy approves 'world's longest suspension bridge' \n                 It added that the vessel had been rented from a German company with the help of forged identity documents via middlemen. Germany's justice minister Stefanie Hubig said the arrest of the suspect was an \"impressive success\" for Germany's state prosecutors. She added: \"The bombing of the pipelines must be investigated, including through criminal prosecution. Therefore, it is good that we are making progress in this regard.\" No group has claimed responsibility for the explosions that severely damaged three pipelines transporting gas from Russia to Europe. It represented a significant escalation in the Ukraine conflict and worsening of the continent's energy supply crisis. Russia and the West have both said they see the damage to the pipelines as an act of sabotage. Both the US and Ukraine previously denied any involvement as Moscow blamed the West. The New York Times reported in 2023 that intelligence reviewed by US officials indicated a pro-Ukraine group was behind the attack. There was no evidence that Ukrainian President Volodymyr Zelenskyy or any other Kyiv official was behind the attacks, the US newspaper added. Denmark and Sweden closed their Nord Stream pipeline investigations in February 2024, leaving Germany as the only country continuing to pursue the case. Read more from Sky News:Michael Clarke answers your Ukraine war questionsKey moments revealing Putin's hold on TrumpTrump sets red line on Ukraine peace deal support Danish authorities concluded there was \"deliberate sabotage of the gas pipelines\" but found \"insufficient grounds to pursue a criminal case\", while Sweden closed its investigation citing a lack of jurisdiction. The leaks occurred in international waters but within the exclusive economic zone of Denmark and Sweden. The explosions ruptured the Nord Stream 1 pipeline, which was Russia's main natural gas supply route to Germany until Moscow cut off supplies at the end of August 2022. They also damaged the 764-mile Nord Stream 2 pipeline, which never entered service because Germany suspended its certification process shortly before Russia invaded Ukraine in February of that year. The damaged Nord Stream pipelines, which were built by Russia's state-controlled energy company Gazprom, discharged huge amounts of methane, a potent greenhouse gas, into the air for several days."
    },
    {
        "title": "Blue dragon: Beaches closed in southern Spain over poisonous sea creature",
        "description": "Tourists have been warned not to enter the sea on the Costa Blanca in southern Spain after a poisonous sea creature was spotted.",
        "url": "https://news.sky.com/story/blue-dragon-beaches-closed-in-southern-spain-over-poisonous-sea-creature-13415606",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-blue-dragon-sea-slug_6996747.jpg?20250821103839",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-21 10:04:00",
        "Headline": "A sting from the sea slug, which feeds on the deadly Portuguese man o' war and other venomous creatures, can cause \"nausea, pain, vomiting and acute allergic contact dermatitis\".",
        "Content": "Tourists have been warned not to enter the sea on the Costa Blanca in southern Spain after a poisonous sea creature was spotted. Swimming was banned along a seven-mile stretch of coast around Guardamar del Segura area just north of Torrevieja following the appearance of so-called blue dragons. Jose Luis Saez, the mayor of Guardamar del Segura, said in a post on X on Wednesday: \"Bathing is prohibited following the appearance on Vivers Beach of two specimens of Glaucus atlanticus, known as the Blue Dragon\", adding that people \"should stay away from this animal because of its sting\". However, on Thursday, in another post, he said the warning was now yellow after the ending of what he called a \"special surveillance operation\". Sky News has contacted Mr Saez to ask if local beaches have reopened. Otherwise known as Glaucus atlanticus, it's a type of sea slug, or nudibranch, that feeds on the deadly Portuguese man o' war and other venomous creatures. Australian Geographic said the \"dazzling blue creature absorbs the stinging cells from its food and stores them in concentrated doses, giving it a far more potent sting than its prey. \n                  Spain deploys another 500 soldiers to tackle wildfires - as part of Camino de Santiago pilgrimage route closed\n                 \n                  Why wildfires in Spain and Portugal are having an impact on weather in the UK\n                 \n                  European wildfires kill at least three as British bar worker joins emergency efforts on Greek island\n                 \"Typical symptoms of the blue dragon's sting include nausea, pain, vomiting and acute allergic contact dermatitis\". Sea slugs normally live on the sea floor, but blue dragons \"swallow a little air bubble, which allows them to float on the ocean surface but means they're at the mercy of the weather\" and often get blown ashore by strong winds. Read more on Sky News:Condemned ISIS fighter 'regrets nothing'Jailed councillor's wife releasedHitwoman jailed over failed plot Measuring typically \"3cm or just over one inch in length,\" according to One Earth, the \"ornate\" creatures are found on the surface of the Atlantic, Pacific and Indian oceans in temperate and tropical waters throughout the world. \"The blue dragon stores the man o' war's stinging nematocysts within its finger-like appendages, making itself equally venomous to predators,\" One Earth said."
    },
    {
        "title": "It's been a confusing week - and Trump's been made to look weak",
        "description": "It's been a confusing week.",
        "url": "https://news.sky.com/story/its-been-a-confusing-week-and-trumps-been-made-to-look-weak-13415929",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-washington-dc_6997300.jpg?20250822002205",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-08-21 22:31:00",
        "Headline": "A back and forth on security guarantees from Ukraine, Europe, and Russia all makes the president look rather weak, and it's unclear whether Trump's America would truly sign up to anything that obliges them to do anything.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n It's been a confusing week. The Monday gathering of European leaders and Ukraine's president with Donald Trump at the White House was highly significant. Ukraine latest: Trump changes tack The leaders went home buoyed in the knowledge that they'd finally convinced the American president not to abandon Europe. He had committed to provide American \"security guarantees\" to Ukraine.  The details were sketchy, and sketched out only a little more through the week (we got some noise about American air cover), but regardless, the presidential commitment represented a clear shift from months of isolationist rhetoric on Ukraine - \"it's Europe's problem\" and all the rest of it. Yet it was always the case that, beyond that clear achievement for the Europeans, Russia would have a problem with it. Trump's envoy's language last weekend - claiming that Putin had agreed to Europe providing \"Article 5-like\" guarantees for Ukraine, essentially providing it with a NATO-like collective security blanket - was baffling.  Russia gives two fingers to the president And throughout this week, Russia's foreign minister Sergei Lavrov has repeatedly and predictably undermined the whole thing, pointing out that Russia would never accept any peace plan that involved any European or NATO troops in Ukraine. \"The presence of foreign troops in Ukraine is completely unacceptable for Russia,\" he said yesterday, echoing similar statements stretching back years. Remember that NATO's \"eastern encroachment\" was the justification for Russia's \"special military operation\" - the invasion of Ukraine - in the first place. All this makes Trump look rather weak. It's two fingers to the president, though interestingly, the Russian language has been carefully calibrated not to poke Trump but to mock European leaders instead. That's telling. Read more on Ukraine:Trump risks 'very big mistake'NATO-like promise for Ukraine may be too good to be trueEurope tried to starve Putin's war machine - it didn't go as planned  The bilateral meeting hailed by Trump on Monday as agreed and close - \"within two weeks\" - looks decidedly doubtful. Maybe that's why he went along with Putin's suggestion that there be a bilateral, not including Trump, first. It's easier for the American president to blame someone else if it's not his meeting, and it doesn't happen. NATO defence chiefs met on Wednesday to discuss the details of how the security guarantees - the ones Russia won't accept - will work. European sources at the meeting have told me it was all a great success. And to the comments by Lavrov, a source said: \"It's not up to Lavrov to decide on security guarantees. Not up to the one doing the threatening to decide how to deter that threat!\" The argument goes that it's not realistic for Russia to say from which countries Ukraine can and cannot host troops.  Would Trump threaten force? The problem is that if Europe and the White House want Russia to sign up to some sort of peace deal, then it would require agreement from all sides on the security arrangements. The other way to get Russia to heel would be with an overwhelming threat of force. Something from Trump, like: \"Vladimir - look what I did to Iran...\". But, of course, Iran isn't a nuclear power. Something else bothers me about all this. The core concept of a \"security guarantee\" is an ironclad obligation to defend Ukraine into the future. Future guarantees would require treaties, not just a loose promise. I don't see Trump's America truly signing up to anything that obliges them to do anything. A layered security guarantee which builds over time is an option, but from a Kremlin perspective, would probably only end up being a repeat of history and allow them another \"justification\" to push back. Read more from Sky News:Inside the ISIS resurgence10 years since one of UK's worst air disastersHow Republicans are redrawing maps to stay in power Image and reality don't seem to match Among Trump's stream of social media posts this week was an image of him waving his finger at Putin in Alaska. It was one of the few non-effusive images from the summit. He posted it next to an image of former president Richard Nixon confronting Soviet leader Nikita Khrushchev - an image that came to reflect American dominance over the Soviet Union. That may be the image Trump wants to portray. But the events of the past week suggest image and reality just don't match. The past 24 hours in Ukraine have been among the most violent to date."
    },
    {
        "title": "The fight to redraw America's maps ahead of pivotal elections for Trump's presidency",
        "description": "Legislators in Texas have approved new congressional maps designed to boost Donald Trump's Republicans at next year's midterm elections.",
        "url": "https://news.sky.com/story/how-trumps-republicans-are-literally-redrawing-maps-to-help-stay-in-power-13415441",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-newsom-redistricting_6997304.jpg?20250822011246",
        "type": "US",
        "Author": "Lauren Russell",
        "Date Published": "2025-08-21 00:25:00",
        "Headline": "Texas is within touching distance of gaining approval to re-draw its congressional maps before next year's midterm elections. The move, spearheaded by Donald Trump, is known as redistricting - here's everything you need to know about it.",
        "Content": "\n          News reporter\n              @laurenvrussell\n Legislators in Texas have approved new congressional maps designed to boost Donald Trump's Republicans at next year's midterm elections. Known as redistricting, the state's re-drawn map would shift conservative voters into districts currently held by Democrats, and combine other districts with a Democratic majority into one. The process is not new, and is completely legal - unless it is ruled to be racially motivated - but typically occurs every 10 years after the US Census to account for population changes. The push to redistrict early came from Mr Trump himself, who wants to bolster his chances of preserving the slim Republican majority in the House of Representatives at next year's crucial midterms. But by trying to re-draw the maps in the red state of Texas, Democrats have lined up their own counter redistricting effort in the blue state of California. Governor Gavin Newsom - who has led opposition against Mr Trump - has legislation teeing up a special election on a new congressional map which, if approved by voters later this year, stands to give Democrats five more seats. If more states decide to re-consider their maps, it has the potential to largely determine the outcome of the 2026 midterms, before a single vote is cast. What's happening in Texas? Mr Trump first said he wanted politicians in Texas to redraw the state's congressional district in July. The governor of Texas, Greg Abbott, followed up on the president's demands, calling for a special session to vote on new maps. \"Please pass this map ASAP,\" Mr Trump urged on his Truth Social platform on Monday. \"Thank you, Texas!\" In an effort to try to make passing the vote as difficult as possible, Democrats fled the state for two weeks. Per parliamentary rules, if enough Democrats refuse to take part in the special session, the Texas House can't meet. On their return, each Democratic politician was assigned a police escort to ensure they attended the session. Nicole Collier, who refused the police escort, stayed in the House for two nights, and was pictured with an eye mask and blanket trying to sleep at her desk. Once the debate started, the doors to the chamber were locked and all members wanting to leave had to get a permission slip to do so. After nearly eight hours, the legislation to formally change the map was passed 88-52 on Wednesday. It now needs to be approved by the Texas Senate, where Republicans hold a majority, and then signed off by Mr Abbott, who has already committed to doing just that. Why re-draw maps? Republicans in Texas have openly said the rally to re-draw congressional maps is in the party's interest. Todd Hunter, the Republican who wrote the legislation formally creating the new map, told the House: \"The underlying goal of this plan is straight forward: improve Republican political performance.\" He said the dispute is nothing more than a partisan fight, and made reference to the US Supreme Court having previously allowed politicians to redraw districts for partisan purposes. Read more from Sky News:Trump sets red line on UkraineTrump risks 'very big mistake' with Putin Democrats hit back, arguing the disagreement was about more than partisanship. \"In a democracy, people choose their representatives,\" representative Chris Turner said. \"This bill flips that on its head and lets politicians in Washington, DC, choose their voters.\" Another Democrat, John H Bucy, blamed the president, saying: \"This is Donald Trump's map. \"It clearly and deliberately manufactures five more Republican seats in Congress because Trump himself knows that the voters are rejecting his agenda.\" How have Democrats responded? The move by Republicans triggered a tit-for-tat move by the Democrats in California. On Thursday, a day after the Texas plans were signed off, the state's legislature approved its own redistricting package. Unlike in Texas, though, the change - to give the Democrats five more seats - does need voter approval in a special election later this year, to be held on 4 November. Mr Newsom has said it's time to \"fight fire with fire\" to take on the Republicans. His plan has gained support from former president Barack Obama, who said it was necessary to \"stave off\" the Republicans' move in Texas. Under Mr Newsom's emergency legislation, the proposed California map would last only through 2030, after which the state's commission would draw up a new map for the normal, once-a-decade redistricting. As the bill was signed by the governor, the state's Republican minority leader, assemblyman James Gallagher, cautioned against Mr Newsom's approach. While he said Trump was \"wrong\" to push for new Republican seats elsewhere, he added: \"You move forward fighting fire with fire and what happens? You burn it all down.\" Could this affect the midterms? The midterms in November next year will likely be on a knife edge. Whatever the outcome, it could shape the remainder of Mr Trump's second term in office. A Democrat majority would make it tougher for him to pass laws. Currently, Republicans control the House of Representatives in Washington, 219-212 (excluding four open vacancies). A party needs 218 seats for a majority. In the Senate, the Republicans hold a similarly slim majority of 53 to 45. However, the incumbent president's party typically loses seats in the midterms. In the 2018 midterms, during Mr Trump's first tenure as president, the Democrats took control of the House. Likewise, in 2022, when Joe Biden was president, the House swung back to the Republicans. It's important to note that 27 House seats will remain in states that are unlikely to redraw their maps, according to The New York Times. In a bid to avoid a repeat of history, Mr Trump is pushing for redistricting in states beyond Texas. Top Republicans in states like Indiana, Missouri, and Florida continue to talk about tweaking their maps to create more Republican-controlled congressional seats. While Ohio has to legally redraw, the timing of which could benefit the Republicans, and, by extension, Mr Trump."
    },
    {
        "title": "Sean 'Diddy' Combs judge urged by prosecutors to reject request for acquittal or retrial",
        "description": "Prosecutors in the Sean \"Diddy\" Combs case have urged the judge to reject a request by the hip-hop mogul for acquittal or retrial on prostitution-related charges.",
        "url": "https://news.sky.com/story/sean-diddy-combs-judge-urged-by-prosecutors-to-reject-request-for-acquittal-or-retrial-13415542",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2015_6996681.jpg?20250821093706",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-21 08:21:00",
        "Headline": "Lawyers for Sean \"Diddy\" Combs filed a request for an acquittal or retrial in July. Now prosecutors have issued their response to the judge, saying he \"masterminded every aspect\" of \"freak off\" sex sessions detailed during the trial.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Prosecutors in the Sean \"Diddy\" Combs case have urged the judge to reject a request by the hip-hop mogul for acquittal or retrial on prostitution-related charges. Lawyers for Combs filed the request after he was found guilty of two counts of transportation for engagement in prostitution - for flying girlfriends and male sex workers around the US and abroad for sexual encounters referred to as \"freak offs\" - at the end of his high-profile trial in New York. He was cleared of more serious charges of racketeering conspiracy and sex-trafficking. The trial would have been \"totally different\" if these charges had not been included, his defence team argued, saying they lacked credibility.   Now, prosecutors have responded to the request for the conviction to be thrown out, or for a retrial, saying in a court document that there was \"ample evidence\" presented during the trial that supported the jury's convictions. \"[Combs] masterminded every aspect of freak offs,\" the document says. \"He transported escorts across state lines to engage in freak offs for pay. He directed the sexual activity of escorts... for his own sexual gratification. And he personally engaged in sexual activity during freak offs.\" The two transportation for prostitution charges Combs was convicted of fall under America's Mann Act, which prohibits interstate commerce related to prostitution. The rapper's lawyers have argued that, to their knowledge, he is \"the only person\" ever convicted of these charges for the conduct he was accused of in court. \"The men chose to travel and engage in the activity voluntarily,\" the defence team said in their submission to the judge for acquittal. \"The verdict confirms the women were not vulnerable or exploited or trafficked or sexually assaulted during the freak offs or hotel nights.\" In their response, prosecutors said \"evidence of the defendant's guilt on the Mann Act counts was overwhelming\". Combs, one of the most influential hip-hop producers of all time, is due to be sentenced in October. Each charge carries a potential jail sentence of 10 years. He would have been facing a mandatory 15 years - and up to life - in prison had he been convicted of the charges of racketeering conspiracy and sex trafficking, of which he was exonerated. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs Combs fell to his knees when the verdicts were read out, and his team later hailed it a \"victory\". The rapper has already served nearly a year at a federal jail in Brooklyn, where he has been since his arrest in September 2024. He has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team told Sky News' US partner network NBC News earlier this month, but the president has cast doubt on this actually happening. Combs has been denied bail despite arguments by his lawyers that he should face little to no additional jail time for his convictions. Judge Arun Subramanian, who heard the trial, said Combs has not met the burden of showing by clear and convincing evidence a \"lack of danger to any person or the community\"."
    },
    {
        "title": "Frank Caprio: 'Nicest judge in the world' dies after cancer diagnosis",
        "description": "A US judge who amassed a huge online fan base via clips of his compassion in the courtroom has died.",
        "url": "https://news.sky.com/story/frank-caprio-nicest-judge-in-the-world-dies-after-cancer-diagnosis-13415443",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-frank-caprio-judge_6996538.jpg?20250821025035",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-21 01:40:00",
        "Headline": "Frank Caprio became a social media sensation after videos of him handing out justice with kindness went viral. The latter years of his career, which ended when he retired in 2023, were documented in the TV show Caught In Providence.",
        "Content": " A US judge who amassed a huge online fan base via clips of his compassion in the courtroom has died. Frank Caprio was on the bench at a court in Providence, Rhode Island, for almost four decades. He became affectionately known as the \"nicest judge in the world\", NBC Boston reported, after viral videos of him handing out justice with a smile were viewed more than a billion times on social media. The latter years of his career, which ended in 2023, were documented in the TV show Caught In Providence. A statement on Wednesday on his Instagram page, which had 3.2 million followers, said he had died aged 88 \"after a long and courageous battle with pancreatic cancer\". It said he was \"beloved for his compassion, humility, and unwavering belief in the goodness of people\". He had posted a message from his hospital bed the day before, saying: \"Unfortunately I've had a setback, I'm back in the hospital now, and I'm coming to you again asking you to remember me in your prayers once more.\" Caprio's persona was at odds with fellow TV judges, who were less sympathetic and more confrontational. In one popular clip, he dismissed a traffic ticket handed to a bartender who skipped a red light, as they were only earning less than $4 (£2.97) an hour. Another saw him listening sympathetically to a woman whose son had been killed, before dismissing her tickets and fines which had totalled $400 (£297). Read more from Sky News:Labour councils threaten revoltIsrael begins Gaza City takeover plan Caprio also used his fame to speak out about inequality in the justice system. \"Almost 90% of low-income Americans are forced to battle civil issues like health care, unjust evictions, veterans benefits and, yes, even traffic violations, alone,\" he said in one video. After his death was announced, Rhode Island Governor Dan McKee paid tribute to his \"warmth and compassion\". \"He was more than a jurist - he was a symbol of empathy on the bench, showing us what is possible when justice is tempered with humanity,\" he said."
    },
    {
        "title": "Liberty Steel's Speciality Steels UK pushed into compulsory liquidation",
        "description": "One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control.",
        "url": "https://news.sky.com/story/liberty-steels-speciality-steels-uk-pushed-into-compulsory-liquidation-13415789",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-liberty-steel-rotherham_5317948.jpg?20210325194938",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-08-21 15:49:00",
        "Headline": "Speciality Steel UK has been pushed into compulsory liquidation, despite reported attempts for a deal. The government will take over, but will also try and find a new buyer for the business that employers 1,500 people.",
        "Content": "\n          Political reporter\n              @TimJ_B\n One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control. Speciality Steels UK (SSUK), part of the Liberty Steel empire owned by metals tycoon Sanjeev Gupta, employs nearly 1,500 people at sites in Rotherham and several other locations across South Yorkshire. Behind Tata Steel and British Steel, it is the third-largest steel producer in the country. Politics live: New migrant stats released Sky News reported that negotiations had been underway for a deal to rescue the firm, however, they seem to have been rendered unsuccessful. The government-run Insolvency Service confirmed it will be acting as the liquidator. It added that Teneo Financial Advisory Limited would be assisting in running the company from now on. While the GFG Alliance, the holding company, says it is disappointed by the decision, local politicians and unions are highly critical of the group. Business and economics correspondent The collapse of Speciality Steel UK (SSUK), the UK's third-largest steel producer, did not come as a surprise to government officials, who have in recent days been planning for this outcome. \n After all, the business has been limping on for some time, weighed down by financial mismanagement and a mounting debt pile. Problems began in 2021 for GFG Alliance - the holding company, which is a conglomerate run by the metals magnate Sanjeev Gupta. Its main lender, Greensill Capital, collapsed with £3.7bn of loans to GFG still outstanding. Administrators for Greensill are still trying to recover the money. \n There have been legal claims and probes since then, although GFG denies any wrongdoing. The true scale of SSUK's financial woes are not even known because the company has not filed audited accounts for more than five years. Sanjeev Gupta is being prosecuted for failing to file accounts for many of his other businesses too. SSUK's creditors pushed for the company's liquidation, but the government was braced to step in. However, the development does little to provide certainty for the business's 1,500 workers in South Yorkshire. The government will cover wages and costs for now but, as a letter sent by the Department for Business and Trade made clear earlier this month, the government has no intention to \"own SSUK\". As with British Steel, which collapsed back in April (albeit for different reasons), the government is stepping up, but is hoping a new buyer will be found soon. The government says wages will continue to be paid by the liquidator. A spokesperson adds that the government is still \"committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK\". Financial assistance was not able to be given to SSUK by the government due to its existing financial and corporate challenges, including ownership and management. Read moreWhitehall on alert for collapse of steel empireBlackRock backs Gupta's bid to keep controlWhy did British Steel need saving In a statement today, GFG's chief transformational officer, Jeffrey Kabel said: \"The decision to push Speciality Steel UK into compulsory liquidation, especially when we have support from the world's largest asset manager to resume operations and facilitate creditor recovery, is irrational. \"The plan that GFG presented to the court would have secured new investment in the UK steel industry, protecting jobs and establishing a sustainable operational platform under a new governance structure with independent oversight. \"Instead, liquidation will now impose prolonged uncertainty and significant costs on UK taxpayers for settlements and related expenses, despite the availability of a commercial solution. \"Liberty has pursued all options to make its SSUK viable, including efficiency improvements, reorganisations, customer support, several attempts to find a buyer for the business and intensive negotiations with creditors to restructure debt liabilities. Liberty's shareholder has invested nearly £200m, recognising the vital role steel plays in supplying the UK's strategic defence, aerospace and energy industries. \"GFG will now continue to advance its bid for the business in collaboration with prospective debt and equity partners and will present its plan to the official receiver. GFG continues to believe it has the ideas, management expertise and commitment to lead SSUK into the future and attract major investment. GFG's other significant business interests in the UK remain unaffected. \"Despite many challenges facing the group and the difficult market conditions, GFG has invested over £2bn into the UK economy since 2013, ensuring the survival of many GFG businesses despite operating losses and safeguarding thousands of jobs that would otherwise have been lost.\" Sarah Champion, the Labour MP for Rotherham, said GFG's statement was \"full of hollow promises\". She added: \"We know Liberty is a golden goose, but one they have starved for years. \"The speciality steel we make is unique and in high demand, it makes no financial sense that GFG furloughed the plant for nearly two years. \"Strategically, the government cannot allow Liberty Steel to fail. I am confident they will do all in their power to let it flourish.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈  Charlotte Brumpton-Childs, the national officer for the GMB union, also attacked GFG. She said: \"This is another tragedy for UK steel - and the people of South Yorkshire - this time brought on by years of chronic mismanagement by the owners. \"But this represents an opportunity for the UK government to take decisive action - as it did with British Steel - to protect this vital UK industry.\" A government spokesperson said: \"We know this will be a deeply worrying time for staff and their families, but we remain committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK. \"It is now for the independent Official Receiver to carry out their duties as liquidator, including ensuring employees are paid, while we also make sure staff and local communities are supported.\""
    },
    {
        "title": "Surprise good news as government borrowing less than forecast",
        "description": "The government borrowed the least amount of money in three years last month, official figures showed, in a surprise bout of good news for Chancellor Rachel Reeves.",
        "url": "https://news.sky.com/story/surprise-good-news-as-government-borrowing-less-than-half-forecast-13415470",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-treasury-spending_6530389.jpg?20240423071047",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-21 05:25:00",
        "Headline": "High tax income and national insurance contributions meant the state had to borrow less.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The government borrowed the least amount of money in three years last month, official figures showed, in a surprise bout of good news for Chancellor Rachel Reeves. Not since July 2021, in the midst of the COVID-19 pandemic, was state borrowing so low, according to data from the Office for National Statistics (ONS). Increases in tax and national insurance receipts meant public sector net borrowing was £1.1bn in July, meaning there was a £1.1bn gap between government spending and income. Money latest: Top chef raves about supermarket sandwich and reveals customer behaviour he can't stand  That borrowing is less than half the figure (£2.6bn) expected by economists polled by the Reuters news agency, as self-assessed income tax was £600m higher than expected. But borrowing was still £6bn higher in the first four months of the financial year, which started in April, than the same period in 2024. Despite a £2.3bn drop in monthly borrowing when July 2025 is compared with July 2024, the state still spent more on the cost of that lending. The amount of interest paid on government debt was £7.1bn, £200m more than a year earlier. Read more:Europe tried to starve Putin's war machine with sanctions - but something else happenedWomen effectively without a pension for four months a year due to gender gap, research finds The cost of government borrowing has increased in recent months as the interest rate investors demand on loans issued to the UK (bonds) rose. At the start of the week, the government's long-term borrowing cost, as measured by the interest rate on 30-year bonds (known as the gilt yield), closed at the highest level since 1998. What does it mean for the chancellor? The monthly borrowing data is in line with the predictions made by independent forecasters, the Office for Budget Responsibility (OBR). It may not be as rosy a picture, however, as research firm Capital Economics point out the cumulative budget deficit, rather than a monthly figure, is £5.7bn above the OBR's forecast.  This matters for the chancellor's self-imposed fiscal rules, to bring down government debt and balance the budget by 2030, the firm said. \"The chancellor will probably need to raise taxes by £17bn to £27bn at the budget later this year,\" Capital Economics' UK economist Alex Kerr said. Elevated self-assessment income tax receipts \"may just reflect the timing of tax returns being recorded, and receipts in August may be weaker than expected\", he added. Responding to the figures, Ms Reeves's deputy, chief secretary to the Treasury, Darren Jones, said: \"Far too much taxpayer money is spent on interest payments for the longstanding national debt. \"That's why we're driving down government borrowing over the course of the parliament - so working people don't have to foot the bill and we can invest in better schools, hospitals, and services for working families.\""
    },
    {
        "title": "Average two and five year mortgages below 5% for first time since 2023",
        "description": "The average five year mortgage rate has fallen below 5% for the first time in more than two years.",
        "url": "https://news.sky.com/story/average-two-and-five-year-mortgages-below-5-for-first-time-since-2023-13415652",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-houses-homes-house-prices_6901379.jpg?20250430102234",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-21 11:29:00",
        "Headline": "While the path for future interest rate cuts has been complicated by surprisingly high inflation data, mortgage lending has become cheaper.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The average five year mortgage rate has fallen below 5% for the first time in more than two years. The interest rate charged on a typical five-year fixed mortgage deal is now 4.99%, according to financial information company Moneyfacts. This is a low not seen since 3 May 2023, just a week before the interest-rate setters at the Bank of England raised their base rate to 4.5%. The current rate has been lowered to 4% in recent weeks. The base reduction made borrowing less expensive, as signs of a struggling economy were evident to the rate-setting central bankers, and despite inflation forecast to rise further. Money latest: WHSmith shares drop 40% after 'embarrassing error' The mortgage drop on Thursday came despite the high inflation reading for July, which muddied the path for further interest rate cuts. Economists are divided about whether a final reduction will be made this year, while traders anticipate no further cuts after the surprisingly high pace of inflation last month, according to London Stock Exchange Group (LSEG) data.  A reduction is not expected by those traders until February, meaning mortgage rates could remain at this level. Interest rate expectations can influence the terms that mortgage lenders offer. Last week, the average two-year mortgage rate also fell below 5%, for the first time since the Liz Truss mini-budget. The mini-budget's programme of unfunded spending and tax cuts, done without the commentary of independent watchdog the Office for Budget Responsibility (OBR), led to a steep rise in the cost of government borrowing and necessitated an intervention by monetary regulator the Bank of England to prevent a collapse of pension funds. It was also a key reason mortgage costs rose as high as they did - up to 6% for a typical two-year deal, in the weeks after the fiscal announcement. A typical two-year deal is now 4.97%."
    },
    {
        "title": "London Underground workers to strike for seven days in September",
        "description": "London Underground workers will stage a series of strikes for seven days next month in a dispute over pay and conditions.",
        "url": "https://news.sky.com/story/london-underground-workers-to-strike-for-seven-days-in-september-13415732",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-london-underground_6580854.jpg?20240613175539",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-21 14:24:00",
        "Headline": "Members of the Rail, Maritime and Transport union (RMT) said management has refused to engage seriously with its demands on pay and shift patterns.",
        "Content": "London Underground workers will stage a series of strikes for seven days next month in a dispute over pay and conditions. The Rail, Maritime and Transport union (RMT) said its Tube members will take industrial action at different times from 5 September. The union claimed management had refused to engage seriously with its demands on pay, fatigue management, shift patterns and a reduction in the working week. In a separate dispute over pay and conditions, RMT members on London's Docklands Light Railway will also be striking in the week beginning 7 September. RMT general secretary Eddie Dempsey said: \"Our members are doing a fantastic job to keep our capital moving and work strenuous shift patterns to make sure Londoners get to their destinations around the clock. \"They are not after a King's ransom, but fatigue and extreme shift rotations are serious issues impacting on our members' health and wellbeing - all of which have not been adequately addressed for years by LU management. \"Coupled with the fact there are outstanding issues around staff travel arrangements, an atmosphere of distrust has been created, where our members feel like no-one is listening to them. \n                  Britain is buying new air defence missile systems - but can they protect us?\n                 \n                  New dinosaur named after record-breaking yachtswoman\n                 \n                  Shoreham air crash: Families mark 10 years since one of UK's worst airshow disasters\n                 \"RMT will continue to engage LU management with a view to seeking a revised offer in order to reach a negotiated settlement.\" Read more on Sky News:Condemned ISIS fighter 'regrets nothing'Jailed councillor's wife releasedHitwoman jailed over failed plot A Transport for London spokesperson said: \"We regularly meet with our trade unions to discuss any concerns that they may have, and we recently met with the RMT to discuss some specific points. \"We are committed to ensuring our colleagues are treated fairly and, as well as offering a 3.4% pay increase in our ongoing pay discussions, we have made progress on a number of commitments we have made previously. \"We welcome further engagement with our unions about fatigue and rostering across London Underground, but a reduction in the contractual 35-hour working week is neither practical nor affordable. \"Given the improvements we have recently put in place in response to concerns raised by our unions, we urge the RMT to put our fair, affordable pay offer to their members and to continue to engage with us rather than threaten strike action, which will only disrupt Londoners.\""
    },
    {
        "title": "Delta and United airlines being sued over 'window' seats with no view",
        "description": "Two major US airlines are being sued by passengers who say they paid extra for \"window\" seats, only to find themselves given seats next to a blank wall.",
        "url": "https://news.sky.com/story/delta-and-united-airlines-being-sued-over-window-seats-with-no-view-13415546",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-delta-airplane-flight_6764321.jpg?20241202130441",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-21 08:26:00",
        "Headline": "Delta Air Lines and United Airlines each face proposed class action lawsuits representing more than a million passengers each.",
        "Content": "Two major US airlines are being sued by passengers who say they paid extra for \"window\" seats, only to find themselves given seats next to a blank wall. Delta Air Lines and United Airlines each face proposed class action lawsuits representing more than a million passengers each. The damages being sought number in the millions of dollars. Passengers said Delta and United do not flag these non-window seats during the booking process, unlike rivals such as Alaska Airlines and American Airlines, even when charging tens or occasionally hundreds of dollars for them. The lawsuits say people buy window seats for several reasons including to address fear of flying, keeping children occupied or just to enjoy the view. \"Had plaintiffs and the class members known that the seats they were purchasing (were) windowless, they would not have selected them - much less have paid extra,\" the complaint against United said. The Delta complaint contained similar language. Neither Delta or United immediately responded to requests for comment by the Reuters news agency. Read more from Sky News:US-Mexico border wall to be painted black'Nicest judge in the world' dies after cancer diagnosis Passengers can use websites such as SeatGuru to find advantages and disadvantages of specific seats, including those that don't have windows. But Carter Greenbaum, a lawyer whose firm filed the two lawsuits, said this doesn't excuse Delta's and United's conduct. He said: \"A company can't misrepresent the nature of the products it sells and then rely on third party reviews to say a customer should have known that it was lying.\""
    },
    {
        "title": "Retired women effectively without a pension for four months a year due to gender gap, research finds",
        "description": "Retired women effectively go more than four months every year without getting a pension when their income is compared with that of men, new research finds.",
        "url": "https://news.sky.com/story/retired-women-effectively-without-a-pension-for-four-months-a-year-due-to-gender-gap-research-finds-13415482",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pensions-pensioners_6879679.jpg?20250408112335",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-21 06:19:00",
        "Headline": "Retired women are in effect losing the equivalent of £7,600 a year on average due to gender inequality, study suggests.",
        "Content": "Retired women effectively go more than four months every year without getting a pension when their income is compared with that of men, new research finds. The Trades Union Congress (TUC) estimated women were losing the equivalent of £7,600 a year on average due to the gender gap. The union organisation said that compared to men, retired women effectively stop receiving a pension income from today. The income gap between men and women in retirement is now 36.5%, according to research from the Prospect union. The government has revived the Pension Commission to examine the causes of the gap, bringing together trade unions, employers, and independent experts. TUC general secretary Paul Nowak said: \"Everyone deserves dignity and security in retirement, but too many retired women have been left without enough to get by. \"We must make sure that these inequalities are addressed for future generations. \n                  Ethnic minority workers almost twice as likely to do night shifts as white counterparts, new research finds\n                 \n                  Rachel Reeves v the rebels\n                 \n                  PM preparing for war with union leaders ahead of TUC conference\n                 Mr Nowak said reviving the commission is \"a vital step forward\". He added: \"We now have a chance to make sure everyone, including women, receive the decent retirement income that all workers need.\"  Read more from Sky News:Consumers could be allowed to attend water company meetingsFresh call for UK-wide smacking ban A government spokesperson said: \"We're determined to close the gender pensions gap, and the new state pension has already reduced historic inequalities faced by women and low earners. \"Alongside this, the Pensions Commission will tackle barriers to close the gender pensions gap in private pensions to ensure women have the dignity and security they deserve in retirement.\""
    },
    {
        "title": "Motorsport body gives green light to £500m World Rally auction",
        "description": "World motorsport's governing body will this week give its public backing to an auction of the commercial rights to the World Rally Championship (WRC).",
        "url": "https://news.sky.com/story/motorsport-body-gives-green-light-to-163500m-world-rally-auction-13415575",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hankook-world-rally-championship_6996735.jpg?20250821102357",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-21 09:17:00",
        "Headline": "The FIA president Mohammed Ben Sulayem will this week publicly endorse a tender process for the WRC commercial rights currently owned by Red Bull and a German investor, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n World motorsport's governing body will this week give its public backing to an auction of the commercial rights to the World Rally Championship (WRC). Sky News understands that the Fédération Internationale de l'Automobile (FIA) will endorse a tender process as Red Bull and KW25, the existing rights-holders, seek an exit with seven years remaining on their deal. Red Bull and German investment company KW25 have been exploring a sale of the asset for close to a year, and have held talks with interested parties, including the private equity firm EQT, Sky News revealed in June. The impending exit of Red Bull may fuel speculation about the future of its other motorsport interests, and comes in the wake of Christian Horner's tumultuous departure as the team principal of F1's Red Bull Racing. Money latest: Chef's top supermarket sandwich A sale could value the WRC commercial rights entity, which is called WRC Promoter, and also owns rights to the European Rally Championship, at close to £500m. The WRC has seen broadcast and in-person audiences grow in recent years, with a 1.3bn cumulative television audience and more than four million attendees at races last year. \n                  Liberty Steel's Speciality Steels UK pushed into compulsory liquidation\n                 \n                  Surprise good news as government borrowing less than forecast\n                 \n                  Average two and five year mortgages below 5% for first time since 2023\n                 The next round of this year's Championship takes place next week in Paraguay. The tender process comes amid a strengthening of the FIA's operational and financial performance under president Mohammed Ben Sulayem. It recently struck a €20m decade-long extension to Liberty Global's deal to run the Formula E electric car-racing series. Talks with Formula One's management about a new commercial rights deal are expected to result in a revised version of the sport's Concorde Agreement before the end of the year. Read more:Christian Horner says Red Bull sacking 'a shock'Christian Horner sacked by F1 team Red Bull Structured as a not-for-profit body, the FIA has turned a deficit of €24m in 2021, the year that Mr Ben Sulayem was elected, into a surplus of close to €5m last year. \"The FIA World Rally Championship is at an exciting moment in its history\", Mr Ben Sulayem said in a statement issued to Sky News. \"Millions of fans around the world are following the action, and new, younger audiences are driving its global growth. \"This Championship has enormous potential, and it is our responsibility as a governing body to ensure it continues to grow and reaches new heights.\"This process is an important step and will shape the long-term vision for the WRC, and I am confident that, together with the right partner, we can take the championship to the next level, preserve its proud heritage, and grow its global reach for generations of fans to come.\" After nine rounds of the 2025 WRC series, the championship standings are headed by British driver Elfyn Evans. There are five remaining races this year.As well as private equity firms such as EQT, other bidders for the WRC rights are likely to include specialist sports investors and media companies, according to banking sources."
    },
    {
        "title": "'Genuinely elite': Top chef raves about supermarket sandwich - but has very different view of QR codes",
        "description": "Every week, we interview top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. Today, we speak to Tim Brindley, head chef at Toum off Regent Street in London...",
        "url": "https://news.sky.com/story/genuinely-elite-top-chef-raves-about-supermarket-sandwich-but-has-very-different-view-of-qr-codes-13415612",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chef-tim-brindley_6996786.png?20250821112432",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-21 10:16:00",
        "Headline": "The Money blog team interviews chefs every week for our  Cheap Eats feature. Today, Tim Brindley, head chef at Toum, shares his thoughts on his favourite chain, British cuisine and cheap recipes.",
        "Content": "Every week, we interview top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. Today, we speak to Tim Brindley, head chef at Toum off Regent Street in London... The best budget bite in London is... Padella in Borough Market - famous for fresh, handmade pasta at unbeatable prices. A plate of their pici cacio e pepe or beef shin ragu clocks in at around £10-£12. Quick service, great buzz and arguably the best pasta in London without breaking the bank. If I were prime minister for a day, I would pass... zero VAT on hospitality for independent venues earning under £1m. A targeted, meaningful relief that would help hundreds of small businesses stay open. My supermarket guilty pleasure... M&S's \"Our Best Ever\" prawn mayo sandwich. Genuinely elite - soft bread, quality prawns, generous filling. Designed-for-sharing? Absolutely. Tap water? Of course, but... if six people nurse one starter for two hours and pull out their own bottle of wine - that's not hospitality, that's freeloading. My favourite restaurant chain is... Dishoom. Give me the house black daal, lamb chops and a hot chai any day. The consistency, service, and value are spot-on. A minimum spend policy is acceptable... if disclosed upfront. Especially in small, high-demand venues. But surprising guests with it? Never okay. \n                  Cheap Eats: Fortnum and Mason's pastry guru reveals supermarket dessert he loves\n                 \n                  Cheap Eats: Top chef on why Rick Stein is the 'real deal' and how you should complain\n                 \n                  'The laziest ingredient of all': Renowned chef thinks luxury item should be wiped off menus\n                 To me, British cuisine... is deeper than fish and chips. Think Dorset crab, Kentish strawberries, Yorkshire rhubarb. When it's seasonal and regional, it's brilliant. The critics just aren't looking hard enough. Dinner party guests should bring... a bottle of chilled Muscadet Sevre et Maine - crisp, light, and brilliant with food, especially if there's seafood or lighter dishes on the table. It's affordable, French and just left-of-centre enough to feel considered. Or bring a proper loaf of sourdough from a good bakery. Just please, no supermarket hummus in plastic tubs. The customer behaviour I find most annoying is... clicking fingers to get attention. It's dismissive and unnecessary. A bit of eye contact or a raised hand goes a long way. One thing I'd never want to see in a restaurant again is... QR-only menus without human interaction. Tech should support hospitality, not replace it. More Cheap Eats:Top chef on how you should complain'Celebrity chefs are worst thing in industry''We charge diners £225 for our tasting menu' My cheap recipe is... the ultimate Eton Mess. This isn't your average summer dessert - it's indulgent, layered and balanced with just the right amount of sweetness. Our take on Eton Mess keeps things classic, but with a focus on texture and the freshest fruit. Meringue(Makes 8 large portions - use 1/4 meringue per serving) Ingredients: Method: Whisk egg whites until thick, then gradually add sugar to form stiff peaks. Gently fold in vanilla seeds, vinegar, salt, vanilla essence, and corn starch. Spoon onto parchment-lined trays and bake at 100°C (fan) for 2.5 hours until dry and crisp. Cool before serving. Vanilla chantilly cream(Makes 11 portions - use 80g per serving) Ingredients: Method: Whip all ingredients together until softly thickened. Chill. Strawberry coulis(Makes 2.5kg - approx 40 portions) Ingredients: Method: Toss fruit with sugar and lemon juice, leave to sit for 1 hour. Blend for 30 seconds max to avoid breaking up seeds, then pass through a sieve. Chill. To assemble (per portion): Layer cream, fruit, meringue and coulis - repeat twice. Finish with coulis and a few fresh berries."
    },
    {
        "title": "The latest migration stats are going in the wrong direction - and the argument might get more vicious",
        "description": "The UK government won't find much in the latest dump of migration data to back up its claim that it is restoring order to a broken asylum system.",
        "url": "https://news.sky.com/story/the-latest-migration-stats-are-going-in-the-wrong-direction-and-the-argument-might-get-more-vicious-13415839",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-immigration_6913891.jpg?20250821201553",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-08-21 17:34:00",
        "Headline": "If you thought the argument around hotels was vicious, just wait for the one that could follow if asylum seekers start to be moved out of hotels and into houses and flats in areas that already have a shortage of homes.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  The UK government won't find much in the latest dump of migration data to back up its claim that it is restoring order to a broken asylum system. In a competitive field, perhaps the most damaging stat is the rising number of small boat crossings - up 38% on 12 months previously and close to the peaks of 2023. That has helped push up asylum applications to record levels, which in turn has led to a rise in the use of hotel accommodation. Politics live: Read about the latest migration stats Deportations are up, but more than half of the total figure is foreign national offenders rather than failed asylum seekers. The backlog for initial decisions is coming down. But the approval rate for those applying for asylum after arriving on a small boat is still hovering around the 65% mark. \n                  Where can asylum seekers go if they can't be housed in hotels?\n                 \n                  Labour smell dirty tricks over asylum hotel court ruling - but the risks are clear\n                 \n                  Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court\n                 Another bottleneck is also forming as more people appeal their initial rejections - and require accommodation while they wait for an outcome. This all helps explain why people are still taking the risk of crossing the channel in the first place. It's still highly likely that if you get to the UK, you'll be able to stay. The row over the use of hotels is a product of this underlying problem. And if you thought that argument was vicious, just wait for the one that could follow if asylum seekers start to be moved out of hotels and into houses and flats in areas that already have a shortage of homes. It's why the only real endgame for the government is to find a way to stop people coming in the first place. Increased numbers of returns, including through the UK-France deal, could provide some deterrent. Read more:Where can asylum seekers go if not hotels?Labour smell dirty tricks over asylum court ruling8% rise in asylum seeker hotel usage  Beefed-up action to dismantle smuggling gangs and reforms to the time it takes for appeals to be heard will help too. So far though, all the figures that count are going in the wrong direction. What's more, there's some evidence that the data is looking particularly painful for Labour in some of its most vulnerable areas. A look down the list of councils with relatively high numbers of asylum seekers reveals several key election battlegrounds in the Midlands and North. These are regions where Reform is already campaigning hard. The stakes are high, and as it stands the government is being found wanting."
    },
    {
        "title": "Surprise good news as government borrowing less than forecast",
        "description": "The government borrowed the least amount of money in three years last month, official figures showed, in a surprise bout of good news for Chancellor Rachel Reeves.",
        "url": "https://news.sky.com/story/surprise-good-news-as-government-borrowing-less-than-half-forecast-13415470",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-treasury-spending_6530389.jpg?20240423071047",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-21 05:25:00",
        "Headline": "High tax income and national insurance contributions meant the state had to borrow less.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The government borrowed the least amount of money in three years last month, official figures showed, in a surprise bout of good news for Chancellor Rachel Reeves. Not since July 2021, in the midst of the COVID-19 pandemic, was state borrowing so low, according to data from the Office for National Statistics (ONS). Increases in tax and national insurance receipts meant public sector net borrowing was £1.1bn in July, meaning there was a £1.1bn gap between government spending and income. Money latest: Top chef raves about supermarket sandwich and reveals customer behaviour he can't stand  That borrowing is less than half the figure (£2.6bn) expected by economists polled by the Reuters news agency, as self-assessed income tax was £600m higher than expected. But borrowing was still £6bn higher in the first four months of the financial year, which started in April, than the same period in 2024. Despite a £2.3bn drop in monthly borrowing when July 2025 is compared with July 2024, the state still spent more on the cost of that lending. The amount of interest paid on government debt was £7.1bn, £200m more than a year earlier. Read more:Europe tried to starve Putin's war machine with sanctions - but something else happenedWomen effectively without a pension for four months a year due to gender gap, research finds The cost of government borrowing has increased in recent months as the interest rate investors demand on loans issued to the UK (bonds) rose. At the start of the week, the government's long-term borrowing cost, as measured by the interest rate on 30-year bonds (known as the gilt yield), closed at the highest level since 1998. What does it mean for the chancellor? The monthly borrowing data is in line with the predictions made by independent forecasters, the Office for Budget Responsibility (OBR). It may not be as rosy a picture, however, as research firm Capital Economics point out the cumulative budget deficit, rather than a monthly figure, is £5.7bn above the OBR's forecast.  This matters for the chancellor's self-imposed fiscal rules, to bring down government debt and balance the budget by 2030, the firm said. \"The chancellor will probably need to raise taxes by £17bn to £27bn at the budget later this year,\" Capital Economics' UK economist Alex Kerr said. Elevated self-assessment income tax receipts \"may just reflect the timing of tax returns being recorded, and receipts in August may be weaker than expected\", he added. Responding to the figures, Ms Reeves's deputy, chief secretary to the Treasury, Darren Jones, said: \"Far too much taxpayer money is spent on interest payments for the longstanding national debt. \"That's why we're driving down government borrowing over the course of the parliament - so working people don't have to foot the bill and we can invest in better schools, hospitals, and services for working families.\""
    },
    {
        "title": "SNP membership falls, deficit soars and £100,000 campervan now only worth £41,000, accounts reveal",
        "description": "The SNP spent more than &#163;100,000 on the campervan that was seized from the driveway of Nicola Sturgeon's mother-in-law, the party's financial accounts have revealed.",
        "url": "https://news.sky.com/story/snp-membership-falls-deficit-soars-and-163100000-campervan-now-only-worth-16341000-accounts-reveal-13415729",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-john-swinney-snp-first-minister_6997055.jpg?20250821165957",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-21 14:22:00",
        "Headline": "The party's 2024 accounts, published by the Electoral Commission this week, show a £455,254 deficit - compared to a surplus of £661,568 the year before.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The SNP spent more than £100,000 on the campervan that was seized from the driveway of Nicola Sturgeon's mother-in-law, the party's financial accounts have revealed. The luxury vehicle, which was confiscated two years ago by Police Scotland as part of Operation Branchform, remains impounded and is now worth less than half of its original cost. Financial accounts for last year show the party spent £100,790 on the motorhome, but that has since depreciated to £41,284 as of 31 December 2024. Treasurer Stuart McDonald said: \"This asset has been impounded by authorities since April 2023 and has not been available for the party's use since that time. \"The party retains ownership of the motorhome and expects its future release.\" The SNP said the cost is based on the assumption that there has been \"no additional impairment beyond normal depreciation\" while in the custody of the national force. The 2024 accounts, published by the Electoral Commission this week, show a £455,254 deficit - compared to a surplus of £661,568 the year before. \n                  Scotland, Wales and N Ireland party leaders unite to criticise Starmer over Israel-Gaza stance\n                 \n                  Former Scottish parliament presiding officer Sir George Reid dies aged 86\n                 \n                  Why next year's Scottish elections could get messy\n                 Mr McDonald explained: \"It is important to point out that a deficit of this nature is not unusual during a parliamentary election year - for example 2021, 2017 and 2016 all saw similar or greater deficits incurred. \"It is also important to point out that significant steps have been taken to improve financial performance, and the one-off costs of some of these steps account for much of that deficit, but have already delivered significant savings since.\" Decreasing membership numbers, staff redundancies, and the loss of MPs at last year's general election were said to have impacted the party's finances. Membership has fallen to 56,011 as of 1 June 2025, down from 64,525 the same time last year and less than half of its peak of around 125,000 in 2019. Membership fees stood at £1,833,039 in 2024, down from £2,093,967 the previous year. However, donations surged from £369,308 in 2023 to £937,167 in 2024 - the highest level since 2017. The accounts show the party still owes former chief executive Peter Murrell £60,000 following a loan of £107,620 in 2021. The party repaid £47,620 the same year. Mr Murrell, the estranged husband of former first minister Ms Sturgeon, has been charged with embezzlement, with a further court date to be set. Ms Sturgeon was also arrested as part of the police probe into the SNP's funding and finances, however the investigation was later dropped with no further action to be taken. The campervan was seized from the driveway of the Dunfermline home of Mr Murrell's mother. In regards to the loan, Mr McDonald said: \"There is no formal loan agreement in place, no interest is charged on the outstanding balance, and no specific repayment terms have been agreed. \"The former chief executive has not formally requested repayment of the outstanding balance. \"Due to the absence of agreed repayment terms and the lack of recent communication regarding settlement, there is uncertainty as to when, or if, this loan will be repaid to the former chief executive, and whether it may ultimately be waived or written off.\" Read more from Sky News:Surprise good news as government borrowing less than forecastWhere can asylum seekers go if they can't be housed in hotels? The annual accounts of the SNP Westminster group of MPs were also published, showing a deficit of £155,803. The accounts were independently audited by MMG Chartered Accountants, which identified no \"material uncertainties\". Craig Hoy MSP, the Scottish Conservative shadow finance secretary, said the deficit in the SNP's accounts showed the party \"cannot be trusted to even run their own finances, never mind the ever-growing blackhole they are presiding over in Scotland's finances\". An SNP spokesperson said: \"The SNP is the largest political party in Scotland by far and it is very encouraging to see extraordinary levels of donations over the course of last year - the highest since 2017. \"Our success relies on all of our members and supporters who contribute in whatever way they can. \"We are approaching the 2026 election ahead in the polls and ready to take our positive vision of Scotland's future as an independent country to the people.\""
    },
    {
        "title": "Liberty Steel's Speciality Steels UK pushed into compulsory liquidation",
        "description": "One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control.",
        "url": "https://news.sky.com/story/liberty-steels-speciality-steels-uk-pushed-into-compulsory-liquidation-13415789",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-liberty-steel-rotherham_5317948.jpg?20210325194938",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-08-21 15:49:00",
        "Headline": "Speciality Steel UK has been pushed into compulsory liquidation, despite reported attempts for a deal. The government will take over, but will also try and find a new buyer for the business that employers 1,500 people.",
        "Content": "\n          Political reporter\n              @TimJ_B\n One of the UK's last remaining steel companies has been pushed into compulsory liquidation - and will fall into government control. Speciality Steels UK (SSUK), part of the Liberty Steel empire owned by metals tycoon Sanjeev Gupta, employs nearly 1,500 people at sites in Rotherham and several other locations across South Yorkshire. Behind Tata Steel and British Steel, it is the third-largest steel producer in the country. Politics live: New migrant stats released Sky News reported that negotiations had been underway for a deal to rescue the firm, however, they seem to have been rendered unsuccessful. The government-run Insolvency Service confirmed it will be acting as the liquidator. It added that Teneo Financial Advisory Limited would be assisting in running the company from now on. While the GFG Alliance, the holding company, says it is disappointed by the decision, local politicians and unions are highly critical of the group. Business and economics correspondent The collapse of Speciality Steel UK (SSUK), the UK's third-largest steel producer, did not come as a surprise to government officials, who have in recent days been planning for this outcome. \n After all, the business has been limping on for some time, weighed down by financial mismanagement and a mounting debt pile. Problems began in 2021 for GFG Alliance - the holding company, which is a conglomerate run by the metals magnate Sanjeev Gupta. Its main lender, Greensill Capital, collapsed with £3.7bn of loans to GFG still outstanding. Administrators for Greensill are still trying to recover the money. \n There have been legal claims and probes since then, although GFG denies any wrongdoing. The true scale of SSUK's financial woes are not even known because the company has not filed audited accounts for more than five years. Sanjeev Gupta is being prosecuted for failing to file accounts for many of his other businesses too. SSUK's creditors pushed for the company's liquidation, but the government was braced to step in. However, the development does little to provide certainty for the business's 1,500 workers in South Yorkshire. The government will cover wages and costs for now but, as a letter sent by the Department for Business and Trade made clear earlier this month, the government has no intention to \"own SSUK\". As with British Steel, which collapsed back in April (albeit for different reasons), the government is stepping up, but is hoping a new buyer will be found soon. The government says wages will continue to be paid by the liquidator. A spokesperson adds that the government is still \"committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK\". Financial assistance was not able to be given to SSUK by the government due to its existing financial and corporate challenges, including ownership and management. Read moreWhitehall on alert for collapse of steel empireBlackRock backs Gupta's bid to keep controlWhy did British Steel need saving In a statement today, GFG's chief transformational officer, Jeffrey Kabel said: \"The decision to push Speciality Steel UK into compulsory liquidation, especially when we have support from the world's largest asset manager to resume operations and facilitate creditor recovery, is irrational. \"The plan that GFG presented to the court would have secured new investment in the UK steel industry, protecting jobs and establishing a sustainable operational platform under a new governance structure with independent oversight. \"Instead, liquidation will now impose prolonged uncertainty and significant costs on UK taxpayers for settlements and related expenses, despite the availability of a commercial solution. \"Liberty has pursued all options to make its SSUK viable, including efficiency improvements, reorganisations, customer support, several attempts to find a buyer for the business and intensive negotiations with creditors to restructure debt liabilities. Liberty's shareholder has invested nearly £200m, recognising the vital role steel plays in supplying the UK's strategic defence, aerospace and energy industries. \"GFG will now continue to advance its bid for the business in collaboration with prospective debt and equity partners and will present its plan to the official receiver. GFG continues to believe it has the ideas, management expertise and commitment to lead SSUK into the future and attract major investment. GFG's other significant business interests in the UK remain unaffected. \"Despite many challenges facing the group and the difficult market conditions, GFG has invested over £2bn into the UK economy since 2013, ensuring the survival of many GFG businesses despite operating losses and safeguarding thousands of jobs that would otherwise have been lost.\" Sarah Champion, the Labour MP for Rotherham, said GFG's statement was \"full of hollow promises\". She added: \"We know Liberty is a golden goose, but one they have starved for years. \"The speciality steel we make is unique and in high demand, it makes no financial sense that GFG furloughed the plant for nearly two years. \"Strategically, the government cannot allow Liberty Steel to fail. I am confident they will do all in their power to let it flourish.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈  Charlotte Brumpton-Childs, the national officer for the GMB union, also attacked GFG. She said: \"This is another tragedy for UK steel - and the people of South Yorkshire - this time brought on by years of chronic mismanagement by the owners. \"But this represents an opportunity for the UK government to take decisive action - as it did with British Steel - to protect this vital UK industry.\" A government spokesperson said: \"We know this will be a deeply worrying time for staff and their families, but we remain committed to a bright and sustainable future for steelmaking and steel-making jobs in the UK. \"It is now for the independent Official Receiver to carry out their duties as liquidator, including ensuring employees are paid, while we also make sure staff and local communities are supported.\""
    },
    {
        "title": "New dinosaur named after record-breaking yachtswoman",
        "description": "A newly-discovered dinosaur with an \"eye-catching sail\" along its back and tail is to be named after record-breaking yachtswoman Dame Ellen MacArthur.",
        "url": "https://news.sky.com/story/new-dinosaur-named-after-record-breaking-yachtswoman-13415762",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-istiorachis-macaruthurae_6997031.jpg?20250821160859",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-21 15:09:00",
        "Headline": "The 125 million year-old bones were thought to be from one of the two similar known local species, but after close study, scientists determined it's something new.",
        "Content": "A newly-discovered dinosaur with an \"eye-catching sail\" along its back and tail is to be named after record-breaking yachtswoman Dame Ellen MacArthur. Istiorachis macaruthurae was identified and named by Jeremy Lockwood, a PhD student at the University of Portsmouth and the Natural History Museum. Istiorachis means \"sail spine\" and macaruthurae is taken from the surname of Dame Ellen, who became famous for setting a record for the fastest solo non-stop round-the-world voyage in 2005. Dame Ellen is from the Isle of Wight, where the creature's fossils were found. Before Dr Lockwood analysed them, the fossils, which date back 125 million years, were thought to be from one of the two known iguanodontian dinosaur species from the island. \"But this one had particularly long neural spines, which was very unusual,\" he said. Writing in the scientific journal Papers in Palaeontology, Dr Lockwood said his study showed the dino would have probably had a pronounced sail-like structure along its back. The exact purpose of such features \"has long been debated, with theories ranging from body heat regulation to fat storage\". In this case, researchers think it was most likely to be for \"visual signalling, possibly as part of a sexual display\". Read more from Sky News:Trump's been made to look weakFight to redraw America's political mapCan Britain's new missile systems protect us? For the study, the researchers compared the fossilised bones with a database of similar dinosaur backbones which allowed them to see how these sail-like formations had evolved. Dr Lockwood said his team showed Istiorachis's spines \"weren't just tall, they were more exaggerated than is usual in Iguanodon-like dinosaurs, which is exactly the kind of trait you'd expect to evolve through sexual selection\". Professor Susannah Maidment, of the Natural History Museum, said: \"Jeremy's careful study of fossils that have been in museum collections for several years has brought to life the iguandontian dinosaurs of the Isle of Wight. \"His work highlights the importance of collections like those at [Isle Of Wight museum] Dinosaur Isle, where fossil specimens are preserved in perpetuity and can be studied and revised in the light of new data and new ideas about evolution. \"Over the past five years, Jeremy has single-handedly quadrupled the known diversity of the smaller iguanodontians on the Isle of Wight, and Istiorachis demonstrates we still have much to learn about Early Cretaceous ecosystems in the UK.\""
    },
    {
        "title": "New NHS bladder cancer treatment doubles survival time",
        "description": "The NHS will roll out a new treatment for advanced bladder cancer which doubles survival time.",
        "url": "https://news.sky.com/story/new-nhs-bladder-cancer-treatment-doubles-survival-time-13415445",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nhs-martyn-hewett_6996539.jpg?20250821035350",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-21 02:34:00",
        "Headline": "Around 18,000 people in England are diagnosed with bladder cancer each year, and experts hope the new treatment - a combination of two drugs - will help patients spend far more time with their loved ones.",
        "Content": "The NHS will roll out a new treatment for advanced bladder cancer which doubles survival time. It's estimated that 1,250 people a year could benefit from a combination of drugs called enfortumab vedotin and pembrolizumab. The first is an antibody-drug also known as Padcev, made by Astellas and Pfizer, while the latter is a PD-L1 inhibitor, also known as Keytruda, which is made by Merck. Clinical trials suggest the combo leads to improved survival compared to platinum-based chemotherapy - increasing from an average of around 16 months to almost 34. Researchers also found people survive for longer without their disease worsening, also known as progression-free survival - going up from six months to more than a year. It will mark the first significant change to treatment of advanced bladder cancer since the 1980s, according to expert Professor Thomas Powels, director of Barts Cancer Institute Biomedical Research Centre (QMUL). Around 18,000 people in England are diagnosed with bladder cancer each year. Read more from Sky News:Labour councils threaten revoltIsrael begins Gaza City takeover plan'Nicest judge in the world' dies after cancer diagnosis The new treatment was approved for NHS use by the National Institute for Health and Care Excellence, which said it was \"highly promising\" and could make a \"tremendous difference\" to people. One patient who took part in the trial said it had given him more time with his grandson. Martyn Hewett, 75, from Stratford, east London, said: \"I feel very, very lucky, because if I hadn't been on this trial, I imagine I would be dead by now. \"I am going to have an extra few years to see my grandson grow up - and maybe even be around to see him get married.\""
    },
    {
        "title": "Millions of people threatened by wildfires near their homes, research finds",
        "description": "The number of people whose lives or property are at risk from wildfires has surged by almost 40% in just two decades, according to new research.",
        "url": "https://news.sky.com/story/millions-of-people-threatened-by-wildfires-near-their-homes-research-finds-13415816",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-spain-wildfires-soldiers_6994223.jpg?20250818083108",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-08-21 16:34:00",
        "Headline": "Analysis by an international team of scientists showed 440 million people were threatened by fire encroaching on their homes between 2002 and 2021.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  The number of people whose lives or property are at risk from wildfires has surged by almost 40% in just two decades, according to new research. Analysis by an international team of scientists showed that 440 million people were threatened by fire encroaching on their homes between 2002 and 2021. And while the area affected decreased over the study period, the number of people affected each year rose by 7.7 million. Dr Matthew Jones, from the University of East Anglia, told Sky News that a combination of climate change and population movements is driving the increase. \"We're seeing hotter, drier conditions, and that's leading to more fire-prone weather,\" he said. \"We're also seeing people migrating more and more into areas that are historically fire-prone. In the western US, we see this idyllic, romantic image of living closer to nature. \"And that's a trend which is putting people closer to fire-prone landscapes than in the past.\" \n                  Hurricane Erin reaches wind speeds of up to 160mph near Caribbean\n                 \n                  UK weather: Amber heat health alert issued for large parts of England\n                 \n                  UK weather: Hottest day of heatwave revealed - with 10% chance temperatures will hit 35C\n                 The researchers analysed 18.6 million records of wildfires over 20 years. High-profile disasters in the US, Europe and Australia grab public attention, but they only account for 2.5% of the global burned area, according to results published in the journal Science. The vast majority of affected land - 85% - is in Africa. But that is falling as more savannah scrub and grassland is taken over by agriculture - a change so significant that it shows up in global totals, with a 26% fall in land burned over the study period. \"The apparent increase in damaging and destructive wildfire impacts on society has until now seemed perplexing because the area burned by fires globally has been falling,\" said Dr Jones. Read more from Sky News:Hurricane Erin makes for uncertain forecastNew moon discovered orbiting icy planet He added: \"By closely analysing the shifting geography of both fire and population, this study brings vital clarity - our work shows that wildfires really are becoming more frequent and intense in populated areas. \"These changes bring danger to life, damage to property, and threat to livelihood.\" The researchers say the increasing vulnerability of human populations to wildfire underlines the urgent need for proactive measures to protect communities. That could include deliberately starting small, controlled fires to burn off vegetation, so it doesn't build up. More public education and engineering solutions are also needed to reduce the number of fires started by people, either accidentally or on purpose."
    },
    {
        "title": "Why Germany's top football league is turning to this man",
        "description": "The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete.",
        "url": "https://news.sky.com/story/why-germanys-top-football-league-is-turning-to-this-man-13415910",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rob-harris-mark-goldbridge_6997282.jpg?20250821230930",
        "type": "Entertainment",
        "Author": "Rob Harris",
        "Date Published": "2025-08-21 21:19:00",
        "Headline": "Tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube, run by the renowned Manchester United fan Mark Goldbridge.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The growing popularity and reach of the Premier League globally is leaving rival European football competitions struggling to compete. Not only to find an audience, but to find outlets to even show the matches. So German football had to think differently - going to where Gen Z is engaging with football through content creators. And that's why tonight, Harry Kane's Bayern Munich will begin their defence of the Bundesliga title live to 1.4 million subscribers on the That's Football channel on YouTube. It's run by Mark Goldbridge, known for passionate but often provocative, punchy commentary about players on streams going viral. His brand was built by being filmed reacting to watching Manchester United matches. \"People need to appreciate that we have a certain content style, and that's very, very popular,\" Goldbridge told Sky News. \"That is an area that needs to be catered [to] and that's why, without the rights, we've had such big, big audiences.\" Goldbridge revealed he isn't paying to show his 20 Friday night matches this season - reinforcing how the Bundesliga struggled to find a buyer in Britain. Sky Sports previously had a four-year rights deal to exclusively show those German matches here, but will now only show the prestige Saturday evening slot live. European leagues are finding it increasingly difficult in this market to sell their rights because domestic football is so dominant and appealing. The focus of football budgets is on domestic games for Sky as well as Discovery-owned TNT Sports, which also focuses its European football coverage on men's continental competitions, including the Champions League. More Premier League matches will be shown live than ever before - with at least 215 on Sky, the parent company of Sky News, and others on TNT. Sky Sports also has live men's rights to the English Football League and Scottish matches, as well as sharing the Women's Super League with the BBC. The Bundesliga is also making the games broadcast by Goldbridge's channel available to the BBC to stream online. They will further be on The Overlap, a YouTube channel part-owned by Gary Neville. 'A progressive step' Bundesliga International CEO Peer Naubert said: \"Our approach is as diverse as our supporters: by combining established broadcasters with digital platforms and content creators, we are taking a progressive step in how top-level football can be experienced. \"This multi-layered strategy allows us to connect with more audiences across the UK and Ireland, giving every supporter the chance to engage … in the way that suits them best.\" While the former England and Manchester United player is a star pundit on Sky, he could also be seen as a rival to the Comcast-owned broadcaster by attracting fans to newer outlets of his channel. Read more from Sky News:Man charged with killing ice cream sellerLondon Underground workers to strike Goldbridge doesn't see himself as a rival yet to long-established broadcasters. \"We're not looking to replace what you can find on Sky or the BBC or anything like that,\" he said. \"This is a community that will be live with us, watching the Bundesliga, learning about it. \"And if I get a pronunciation wrong, or I don't know about a player, then I've got my community there to back me up. I don't profess to know everything.\" 'This is the future' But he can be relatable to audiences, with more than two million subscribing to his The United Stand channel, earning him millions of pounds over the last decade. \"We've been there growing in the background and I think certain media outlets have ignored that, maybe hoping it would go away,\" he said. \"I certainly think synergy and collaboration need to happen more because there are things in the mainstream that I don't like and there will be people out there that really don't like the way we watch football, but a lot of people do. \"And it's about offering that choice to people and there are different ways people listen to football on the radio, people watch it with a commentator, some people turn the audio off completely, some people watch things like this (watch-a-long). \"And I think that is the future, to offer more choice.\""
    },
    {
        "title": "Previously unreleased Beatles tracks to feature on new Anthology collection",
        "description": "Thirteen unreleased Beatles tracks are set to feature on a new Anthology compilation - almost 30 years since the last.",
        "url": "https://news.sky.com/story/previously-unreleased-beatles-tracks-to-feature-on-new-anthology-collection-13415699",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-beatles-cover_6996909.jpg?20250821135831",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-21 13:06:00",
        "Headline": "The announcement comes after a big hint from Sir Paul McCartney, who shared a carousel of images containing the numbers one to four on Instagram.",
        "Content": "Thirteen unreleased Beatles tracks are set to feature on a new Anthology compilation - almost 30 years since the last. The announcement comes following a big hint from Sir Paul McCartney and the other official Beatles social media channels, which all shared a carousel of images containing the numbers one to four on Instagram the day before the announcement. Anthology 4 will feature 13 demos, session recordings and other rare tracks that have never been released before, similar to the first three Anthology compilations, which were released between 1995 and 1996. Details of a full track listing are yet to be revealed. There is no indication the release will feature any completely previously unheard songs. A book and documentary series, The Beatles Anthology, is also being remastered and streamed on Disney+, billed as \"The Beatles' story, in their own words\". The series will include a new ninth episode featuring previously unseen behind-the-scenes footage of Sir Paul, George Harrison and Ringo Starr, filmed as they made the collections. Arts and entertainment correspondent Let it Be? It would seem they just can't. The emergence of 13 previously unreleased Beatles tracks has got fans of the Fab Four sitting up in their seats. The best-selling music act of all time, The Beatles are one of the most influential groups in the world - having achieved 18 number one singles in the UK and 15 number one albums. So why haven't we heard of this new music before? Well, it's not exactly a case of Sir Paul or Sir Ringo having quietly sat on new songs for years. Instead, it's different versions of old songs - including remixes of Free As A Bird and Real Love.\nThe new anthology boasts a whopping 191 tracks – so fans may need a little Help! (sorry) finding time to listen to them all - but those hoping for something brand new may be disappointed to find they've heard it before. Beatles producer George Martin's son Giles has remastered versions of Anthology 1, 2 and 3, and all four will be released in a new box set in November. The 191-track set will also feature new mixes of Free As A Bird and Real Love - the singles from Anthology 1 and 2 - using the late John Lennon's vocals. These have been mixed by the songs' original producer, Electric Light Orchestra frontman Jeff Lynne. It comes after The Beatles topped the charts with their \"last song\" Now And Then, on which AI was used to extract Lennon's vocals from an old demo, in 2023. The box set will also include the original liner notes for the first three anthologies as well as a new set of notes on Anthology 4 by Beatles author Kevin Howlett, and an introduction compiled from 1996 interviews recorded with The Beatles' close friend and adviser Derek Taylor. The Beatles are the best-selling musical act of all time, having achieved 18 number one singles and 15 number one albums in the UK alone since they formed in 1960. Four biopics are currently in the works - with each star getting his own film to share their side of the story of the band that changed the world."
    },
    {
        "title": "Sean 'Diddy' Combs judge urged by prosecutors to reject request for acquittal or retrial",
        "description": "Prosecutors in the Sean \"Diddy\" Combs case have urged the judge to reject a request by the hip-hop mogul for acquittal or retrial on prostitution-related charges.",
        "url": "https://news.sky.com/story/sean-diddy-combs-judge-urged-by-prosecutors-to-reject-request-for-acquittal-or-retrial-13415542",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2015_6996681.jpg?20250821093706",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-21 08:21:00",
        "Headline": "Lawyers for Sean \"Diddy\" Combs filed a request for an acquittal or retrial in July. Now prosecutors have issued their response to the judge, saying he \"masterminded every aspect\" of \"freak off\" sex sessions detailed during the trial.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Prosecutors in the Sean \"Diddy\" Combs case have urged the judge to reject a request by the hip-hop mogul for acquittal or retrial on prostitution-related charges. Lawyers for Combs filed the request after he was found guilty of two counts of transportation for engagement in prostitution - for flying girlfriends and male sex workers around the US and abroad for sexual encounters referred to as \"freak offs\" - at the end of his high-profile trial in New York. He was cleared of more serious charges of racketeering conspiracy and sex-trafficking. The trial would have been \"totally different\" if these charges had not been included, his defence team argued, saying they lacked credibility.   Now, prosecutors have responded to the request for the conviction to be thrown out, or for a retrial, saying in a court document that there was \"ample evidence\" presented during the trial that supported the jury's convictions. \"[Combs] masterminded every aspect of freak offs,\" the document says. \"He transported escorts across state lines to engage in freak offs for pay. He directed the sexual activity of escorts... for his own sexual gratification. And he personally engaged in sexual activity during freak offs.\" The two transportation for prostitution charges Combs was convicted of fall under America's Mann Act, which prohibits interstate commerce related to prostitution. The rapper's lawyers have argued that, to their knowledge, he is \"the only person\" ever convicted of these charges for the conduct he was accused of in court. \"The men chose to travel and engage in the activity voluntarily,\" the defence team said in their submission to the judge for acquittal. \"The verdict confirms the women were not vulnerable or exploited or trafficked or sexually assaulted during the freak offs or hotel nights.\" In their response, prosecutors said \"evidence of the defendant's guilt on the Mann Act counts was overwhelming\". Combs, one of the most influential hip-hop producers of all time, is due to be sentenced in October. Each charge carries a potential jail sentence of 10 years. He would have been facing a mandatory 15 years - and up to life - in prison had he been convicted of the charges of racketeering conspiracy and sex trafficking, of which he was exonerated. Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs Combs fell to his knees when the verdicts were read out, and his team later hailed it a \"victory\". The rapper has already served nearly a year at a federal jail in Brooklyn, where he has been since his arrest in September 2024. He has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team told Sky News' US partner network NBC News earlier this month, but the president has cast doubt on this actually happening. Combs has been denied bail despite arguments by his lawyers that he should face little to no additional jail time for his convictions. Judge Arun Subramanian, who heard the trial, said Combs has not met the burden of showing by clear and convincing evidence a \"lack of danger to any person or the community\"."
    },
    {
        "title": "Vienna chosen to host Eurovision Song Contest 2026",
        "description": "Vienna has been chosen to host the 2026 Eurovision Song Contest.",
        "url": "https://news.sky.com/story/vienna-chosen-to-host-eurovision-song-contest-2026-13415547",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jj-eurovision_6919970.jpg?20250518002319",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-21 08:28:00",
        "Headline": "The 70th Eurovision final will take place on 16 May at Wiener Stadthalle arena in the Austrian capital.",
        "Content": "Vienna has been chosen to host the 2026 Eurovision Song Contest. The capital was selected as Austria's host city following its Eurovision victory in 2025, where artist JJ won with his song Wasted Love in Basel, Switzerland. The decision followed a bidding process in which officials evaluated different facilities and their capacity to host delegations, fans, and media. It will be the third time Vienna has hosted the contest, putting it in joint fourth place among the song contest's most frequent hosts - alongside Copenhagen, Malmo, and Stockholm. Only Dublin, London and Luxembourg City have hosted more of the events. The 70th Eurovision final will take place at Vienna's Wiener Stadthalle arena on 16 May. Austrian broadcaster ORF will host the event. \n                  Austria wins Eurovision - as paint thrown during Israel's performance\n                 \n                  Eurovision Song Contest 2025 in pictures\n                 \n                  Eurovision 2025: Sex, survival and saunas - all the songs to look out for\n                 The director of the Eurovision Song Contest, Martin Green, said: \"The EBU (European Broadcasting Union) is thrilled that Vienna has been selected as the host city for the Eurovision Song Contest 2026. \"Vienna's reputation as one of the most musical cities in the world, and its location in the heart of Europe, makes it the perfect host city for the 70th Eurovision Song Contest.\" Mr Green said the city's \"exceptional\" Stadthalle was a great venue for the 60th contest in 2015, and organisers are looking forward to welcoming delegations, artists, and fans next May, \"as the world's largest live music event celebrates 70 glorious years of being united by music\". \"Together with host broadcaster ORF and the city of Vienna we will create a spectacular celebration of music that will reverberate across the world.\" Vienna's City Hall will host the event's opening ceremony on 10 May, as well as EuroClub, the contest's pop-up, nightlife spot. The square outside City Hall will serve as the Eurovision Village, an open-air screening area for the public. The mayor of Vienna, Michael Ludwig, said: \"In Vienna, we can be proud that our city has been selected by the EBU and ORF as the most suitable host city for one of the world's largest events. \"We placed great emphasis on offering numerous Eurovision Song Contest events in public spaces that can be visited free of charge. \"As the mayor of Vienna, it is very important to me that cultural events are accessible to everyone, regardless of the size of their wallet.\" Further details, including information about tickets, will be released later this year. At the 2025 Eurovision final, Israeli singer Yuval Raphael finished in second place after her team reported that she was left \"shaken and upset\" when pro-Palestinian protesters surged toward a barrier during her performance. In response to the incident, Swiss police confirmed that two individuals were detained and subsequently released. The event organizer, Swiss broadcaster SRG SSR, said that a crew member was struck with paint but was unharmed."
    }
]