[
    {
        "title": "IDF chief says conditions 'created' for Gaza ceasefire - as Trump says it could be 'this week or next'",
        "description": "Donald Trump and a leading figure in the Israeli army have suggested a ceasefire in Gaza could be close.",
        "url": "https://news.sky.com/story/idf-chief-says-conditions-created-for-gaza-ceasefire-as-trump-says-it-could-be-this-week-or-next-13394738",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-benjamin-netanyahu_6959766.jpg?20250708091001",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 19:37:00",
        "Headline": "As a senior Israeli military figure suggests a ceasefire may be close, it continues its attacks on the territory. According to hospital officials in Gaza, at least 40 people were killed in Israeli strikes.",
        "Content": "Donald Trump and a leading figure in the Israeli army have suggested a ceasefire in Gaza could be close. Eyal Zamir, chief of staff of the Israel Defence Forces (IDF), told Israeli media that \"conditions were created to advance a deal\" to bring about an end to the conflict in the coastal territory, and the release of hostages. In a televised address, he said: \"We have achieved many significant results, we have caused great damage to the governance and military capabilities of Hamas. \"Thanks to the operational power that we have demonstrated, the conditions have been created to advance a deal to release the hostages.\" 'This week, or next' It comes as the US president hosts Israeli Prime Minister Benjamin Netanyahu in Washington DC on a prolonged visit this week. Mr Trump said his meetings with Mr Netanyahu were focused \"on Gaza for the most part\". \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 \n                  IDF presence in Gaza 'only issue' still to be resolved in push for Israel-Hamas ceasefire, Sky News understands\n                 \n                  What is the possible Gaza hostage and ceasefire deal - and what challenges could lie ahead?\n                 He said: \"I think we have a chance [of a ceasefire] this week, or next week.\" However, the US leader added: \"Not definitely,\" saying nothing was certain about the situation in Gaza. Hamas reiterates 'keenness' to end fighting Meanwhile, Hamas has repeated its message that it is committed to the negotiations but warned of a number of sticking points despite the positive noises from senior Israeli figures. In a statement, the militant group said: \"In its keenness to succeed in the ongoing efforts, the movement [Hamas] has shown the necessary flexibility and agreed to release 10 prisoners. \"The key points remain under negotiation, foremost among them: the flow of aid, the withdrawal of the occupation from the territories of the Gaza Strip, and the provision of real guarantees for a permanent ceasefire.\" Read more:What is the possible Gaza ceasefire deal?The man acting as backchannel for Hamas'One issue' still to be resolved in ceasefire Mr Trump's special envoy to the Middle East Steve Witkoff previously told a cabinet meeting that the anticipated ceasefire would last 60 days and involve the release of 10 hostages and nine bodies. A source close to the negotiations told Sky News that the hostage release would take place in two waves during the 60 days and was conditional on the ceasefire. Israeli strikes continue It comes as Israeli attacks on Gaza continue. According to hospital officials on Wednesday, at least 40 Palestinians were killed in the latest attacks on Gaza - including 10 people from the same family. Nasser Hospital in the southern Gaza city of Khan Younis said the dead included 17 women and 10 children."
    },
    {
        "title": "Southport attack: Mother saw CCTV of daughter being 'dragged back into building' - before being stabbed 20 more times",
        "description": "The mother of a girl who escaped the Southport attack before being dragged back inside has told how her daughter is still fighting to survive.",
        "url": "https://news.sky.com/story/parents-tell-untold-stories-of-how-their-hero-daughters-survived-southport-attack-13394396",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southport-flowers-tributes_6960129.jpg?20250709083419",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-07-09 10:04:00",
        "Headline": "A public inquiry is looking into whether the attack could or should have been prevented, given what was known about Axel Rudakubana.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The mother of a girl who escaped the Southport attack before being dragged back inside has told how her daughter is still fighting to survive. Axel Rudakubana, 18, stabbed the girl, referred to as C1 at the public inquiry, a total of 33 times at a Taylor Swift-themed class in the Merseyside coastal town on 29 July last year. She was one of eight children injured, while Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine, were murdered in what inquiry chairman Sir Adrian Fulford called \"one of the most egregious crimes in our country's history\". The girl, then aged seven, ran out of the Hart Space building after being attacked, but Rudakubana was seen dragging her back inside in CCTV footage played during his sentencing hearing, which drew gasps in court, before she was stabbed 20 more times. Reading an emotional statement at Liverpool Town Hall on Wednesday, her mother said: \"That is how she became known in this nightmare. The girl that was dragged back in.\" She thanked the teachers who escaped to call police and flag down help but said \"the most painful of truths for\" her and the girl's father \"is that there were no adults to help during both of her attacks\". \"She was only supported by other children. The courage and strength she found leaves me crushed, but in complete awe,\" she said. Read more: Southport inquiry as it happened The mother said she wanted to share her \"beautiful, articulate, fun-loving\" little girl's story, adding: \"I want to tell you of her bravery and strength and how hard she is fighting, still now to survive.\" She added: \"It is these untold stories of remarkable strength and bravery that are missing when we have heard other accounts of this day.\" The mother said the \"hours and days that followed the attack were a living hell\" and her daughter's memories - including a concert of her \"idol\" Taylor Swift - have \"been forfeited to make space for the trauma that she carries\".  \"We tell her she was brave. How proud we are that she was able to help other girls. How her strength makes us feel strong. How important what she did that day was. She is her own hero. She may be a survivor of this attack, but she is still trying to survive this, every single day,\" she said. The surviving victims and their families have been granted anonymity during the inquiry, while the chairman has asked media not to use Rudakubana's police mugshot to avoid distressing them. 'She is our hero' The father of a girl referred to as C3 told how his daughter was the first to escape the scene by running from the building and hiding behind a parked car before jumping through an open car door. \"Our nine-year-old daughter was stabbed three times in the back by a coward she didn't even see,\" he said. \"Although she didn't know what was happening - she knew she had to run. She ran out of the studio door, down the stairs, and out of the building.\" He said she can be seen \"looking scared, confused and pained\" in CCTV footage of the incident, adding: \"It was troubling for us to see what she had to go through, before either of her parents had arrived at the scene.\" \"We are so thankful and proud that despite being critically injured, she was able to make the decisions she did in that terrible moment,\" he said. The girl's father said his daughter \"continues to astound\" them with the way she dealt with the attack and her recovery, saying: \"It has been inspiring for us to witness.\" He said she has difficulty sleeping, experiences flashbacks, looks over her shoulder scanning for potential danger when she leaves the house, has a fear of loud noises and has to turn off some songs when they come on the radio. \"Our daughter knows that she is loved,\" he said. \"It is through this support and love that she will continue to thrive. We couldn't be prouder of her. She is our hero.\" Attack 'changed everything'  The mother of a girl referred to as C8 said she was \"like any other seven-year-old little girl\", \"with an incredible energy\" and \"full of life\". But in a statement read out by a legal representative, she said the attack last year \"changed everything\" when she got a \"panicked phone call\" from a friend's mother, who couldn't find the girls. \"That moment, the sound of fear in her voice and the panic I felt will never leave me,\" she said. \"I rushed to the scene and what I saw is something no parent should ever see. My daughter had sustained serious physical injuries including a stab wound to her arm and a cut to her face and chin.\"  Read more from Sky News:Infected blood victims 'waiting to die in limbo'The fly-tippers turning trash into cash She said her daughter \"remembers the attack vividly\" and later told her \"she thought it had to be fake, because she couldn't believe something that terrible could really be happening\". \"Where she was once eager to go off with her friends, she now needs my support if it is somewhere public or unknown,\" she said. \"Simple days out now need a level of safety planning that we would never have considered before.\" 'Constant flashbacks' The mother of a girl referred to as Q, who was one of 15 children who escaped without physical injuries, told how she arrived to collect her daughter to find \"children running from the building, screaming and fearing for their lives\". In a statement read to the inquiry by a legal representative on her behalf, she said it was \"the most horrific experience of my life\". \"What I saw on that day will stick with me forever, I constantly have flashbacks and relive what happened,\" she said. She said her daughter has become \"very withdrawn\" since the attack and has asked her parents, \"How will I ever be normal again?\" Rudakubana was jailed for a minimum of 52 years in January and is being investigated over an alleged attack on a prison officer at Belmarsh prison in May. The public inquiry, announced by Home Secretary Yvette Cooper in January, is looking into whether the attack could or should have been prevented, given what was known about the killer. Rudakubana, who was born in Cardiff, had contact with police, the courts, the youth justice system, social services and mental health services, and was referred to the government's anti-extremism Prevent scheme three times before the murders. A rapid review into his contact with Prevent found his case should have been kept open and that he should have been referred to Channel, another anti-terror scheme. C1's mother said: \"She deserves the truth, she deserves accountability. She deserves an apology. Our girls deserve an apology. \"Backed up by the promise that changes will be made and this will not be allowed to happen again.\""
    },
    {
        "title": "Ex-Tory chairman Sir Jake Berry defects to Reform",
        "description": "Ex-Tory chairman Sir Jake Berry has defected to Reform, in the latest blow to the Conservatives.",
        "url": "https://news.sky.com/story/ex-tory-chairman-sir-jake-berry-defects-to-reform-13394746",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/skynews-jake-berry-conservative_5941834.jpg?20221024140645",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 20:02:00",
        "Headline": "Sir Jake Berry's defection comes just days after former Welsh secretary David Jones also joined Reform. ",
        "Content": "Ex-Tory chairman Sir Jake Berry has defected to Reform, in the latest blow to the Conservatives. The former MP for Rossendale and Darwen, who served as Northern Powerhouse minister under Boris Johnson and lost his seat last year, said he had defected to Nigel Farage's party because the Tories had \"lost their way\". Politics latest: Labour rebel defends calls for 'wealth tax' Reform UK confirmed the defection to Sky News, which was first broken by The Sun. Speaking to the paper, Sir Jake said Mr Farage's party was the \"last chance to pull Britain back from terminal decline\". \"Our streets are completely lawless,\" he said. \"Migration is out of control. Taxes are going through the roof. \n                  Labour MPs form new group as they urge prime minister to focus on living standards to help ward off Reform\n                 \n                  Is Labour losing Wales to Reform? \n                 \n                  Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat\n                 \"And day after day, I hear from people in my community and beyond who say the same thing: 'This isn't the Britain I grew up in'.\" Sir Jake accused his former party of \"abandoning the British people\" but said he was not \"giving up\". \"I'm staying. And I'm fighting. \"Fighting for the Britain I want my kids, and one day, my grandkids, to grow up in.\" Mr Farage welcomed what he said was \"a very brave decision\" by Sir Jake. \"His admission that the Conservative government he was part of broke the country is unprecedented and principled,\" he added. A Conservative Party spokesman said: \"Reform support increasing the benefits bill by removing the two-child cap, and nationalising British industry. By contrast the Conservatives, under new leadership, will keep making the case for sound money, lower taxes and bringing the welfare bill under control. \"We wish Jake well in his new high spend, high tax party.\" Sir Jake's defection to Reform comes just days after former Conservative cabinet minister David Jones joined Reform UK, which continues to lead in the polls. Mr Jones, who was MP for Clwyd West from 2005 until standing down in 2024, said he had quit the Tories after \"more than 50 years of continuous membership\". Sir Jake was the MP Rossendale and Darwen in Lancashire between 2010 and 2024, when he was defeated by Labour's Andy MacNae. He held several ministerial posts including in the Department for Housing, Communities and Local Government, Energy and Climate Change and the Cabinet Office. He was also chairman of the Conservative Party from September to October 2022, under Liz Truss. Announcing his defection - which comes a year after the Tories suffered their worst ever election defeat - Sir Jake said \"Britain was broken\" and \"the Conservative governments I was part of share the blame\". \"We now have a tax system that punishes hard work and ambition,\" he said. \"Just this week, we saw record numbers of our brightest and best people leaving Britain because they can't see a future here. At the same time, our benefits system is pulling in the world's poor with no plan for integration and no control over who comes in. \"If you were deliberately trying to wreck the country, you'd be hard-pressed to do a better job than the last two decades of Labour and Tory rule. \"Millions of people, just like me, want a country they can be proud of again. The only way we get that is with Reform in government. That's why I've resigned from the Conservative Party. I'm now backing Reform UK and working to make them the next party of government.\" Read more:Starmer and Macron agree need for new small boats 'deterrent' Controversial welfare bill passes final Commons stage He added: \"And with Nigel Farage leading Reform, we've got someone the country can actually trust. He doesn't change his views to fit the mood of the day. And people respect that. So do I. That's why I believe he should be our next prime minister.\" A Labour Party spokesperson said: \"Not content with taking advice from Liz Truss, Nigel Farage has now tempted her Tory Party chairman into his ranks. \"It's clear Farage wants Liz Truss's reckless economics, which crashed our economy and sent mortgages spiralling, to be Reform's blueprint for Britain. It's a recipe for disaster and working people would be left paying the price.\""
    },
    {
        "title": "At least four killed and 'many' kidnapped after Houthi rebels sink cargo ship Eternity C in Red Sea",
        "description": "At least four people have been killed and many other crew kidnapped after Houthi rebels sank a cargo ship in the Red Sea, authorities say.",
        "url": "https://news.sky.com/story/at-least-four-killed-and-many-kidnapped-after-houthi-rebels-sink-cargo-ship-eternity-c-in-red-sea-13394739",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-eternity-c-yemen_6961088.jpg?20250710001729",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 19:36:00",
        "Headline": "A Houthi spokesperson claimed the Yemeni navy had rescued \"a number of the ship's crew\", given them medical care and taken them \"to a safe location\".",
        "Content": " At least four people have been killed and many other crew kidnapped after Houthi rebels sank a cargo ship in the Red Sea, authorities say. Eternity C was first attacked on Monday afternoon with drones and rocket-propelled grenades fired from speedboats. The European Union naval mission in the area said six people had been rescued after spending more than a day in the sea. However, the fate of 15 of the crew is currently unknown. In total, 22 crew - mostly Filipinos - were on board, as well as a three-member security team. The ship finally sank on Wednesday after being attacked over two days. The US embassy in Yemen posted on X that several survivors had been kidnapped. \n                  Israel attacks Houthi targets at three ports and power plant in Yemen\n                 \n                  Where does Trump's Houthi announcement leave Israel?\n                 \n                  At least 15 injured in strike on Yemeni capital, according to Houthi group\n                 \"After killing their shipmates, sinking their ship, and hampering rescue efforts, the Houthi terrorists have kidnapped many surviving crew members of the Eternity C,\" the embassy said. \"We call for their immediate and unconditional safe release. The Houthis continue to show the world why the United States was right to label them a terrorist organisation.\" A Houthi spokesperson claimed the Yemeni navy had rescued \"a number of the ship's crew\", given them medical care and taken them \"to a safe location\". Eternity C's operator, Cosmoship Management, has not responded to requests for confirmation of casualties or injuries. On Sunday, another ship, the Magic Seas was also sunk by Houthi rebels but all the crew were rescued. Both of these ships flew Liberia flags and were operated by Greek firms. Their firms had docked at Israeli ports in the past year, shipping data showed. The Houthi fighters - who are aligned with Iran - have attacked more than 100 ships from November 2023 to December 2024. They say it is a show of solidarity with the Palestinians. The Red Sea off Yemen's coast is a critical waterway for the world's oil and commodities. On Monday, Israel said it had struck Houthi-held Yemeni ports at Hodeida, Ras Isa and Salif, as well as the Ras Kanatib power plant. \"These ports are used by the Houthi terrorist regime to transfer weapons from the Iranian regime, which are employed to carry out terrorist operations against the state of Israel and its allies,\" the Israeli military said. Read more from Sky News:IDF chief hints at Gaza ceasefireFamilies describe wildfire 'nightmare' Both Israel and the US have struck ports in the area in the past - including an American attack that killed 74 people in April. But Israel is now acting alone in attacking the rebels as they continue to fire missiles at Israel. Separately on Wednesday, Tom Fletcher, the United Nations humanitarian chief, said more than 17 million people in Yemen are going hungry, including over a million children."
    },
    {
        "title": "England Women thrash Netherlands to keep Euros hopes alive - as Wales on the brink of exit",
        "description": "England Women have convincingly beaten the Netherlands to keep their Euros hopes alive. But Wales are on the brink of exiting the competition.",
        "url": "https://news.sky.com/story/england-women-thrash-netherlands-to-keep-euros-hopes-alive-13394668",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-womens-football_6961265.jpg?20250709183740",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 16:46:00",
        "Headline": "After a disappointing loss in their first Euros group game, Sarina Wiegman's Lionesses came back in impressive fashion against her native Netherlands. Meanwhile, Wales lost 4-1 to France, leaving them on the brink of exiting the tournament.",
        "Content": " England Women have convincingly beaten the Netherlands to keep their Euros hopes alive. But Wales are on the brink of exiting the competition. Sarina Wiegman's England came into the tournament as defending champions, but slumped to a 2-1 defeat against France in their opening match on Saturday. In their second game against the Netherlands, the Lionesses took a commanding lead in the must-win tie, and it ended up being a thrashing. However, it was a less successful night for Wales who fell to a 4-1 loss to group leaders France. While technically still in with a chance of qualifying, Wales now need a huge victory over England when the two sides meet on Sunday and results elsewhere to go their way. Lionesses roar England's Lauren James, freshly returned from injury, starred in the 4-0 victory, scoring twice before being substituted in the second half. \n                  Women's Euros: England avoid 'disaster' as big win gets champions back on track\n                 \n                  Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest\n                 \n                  Women's Euros: Concerns for player safety as tournament kicks off in Switzerland\n                 Georgia Stanway and Ella Toone were the other goalscorers, while FA patron Prince William was among those cheering on the team in the Stadion Letzigrund in Zurich, Switzerland. The performance was much-needed, as a loss would have left their campaign on a knife-edge, relying on results elsewhere. Going into the competition, the England camp was hit by a series of setbacks as three senior players pulled out for differing reasons. England will play Wales in their third and final group game on Sunday 13 July. Speaking to the BBC after the game, James said: \"I enjoyed it a lot, the goals say it all. \"We bounced back from the previous game and showed we were more than capable [of] showing the world what we can do.\" Fellow goalscorer Stanway said: \"I've always said, and said the other day, this is about showing who we are. We fought from the very first minute to the very last.\" Read more from Sky News:What is a wealth tax?Christian Horner sacked by F1 team Red BullDates doctors will strike this summer Wiegman, who has also led her native Netherlands to Euros glory, lauded her team's response after losing against France. Speaking at a news conference after the game, Wiegman said: \"I'm very happy with the performance, we bounced back really well from France. \"How the team responded today was really good.\" Sir Keir Starmer, an Arsenal fan, also celebrated the win with a post on X that said it was a \"phenomenal\" performance. Wales lose 4-1 Meanwhile, Wales lost 4-1 to France, who now top the group. It has left Rhian Wilkinson's side almost certain to exit the tournament - barring a major upset in the final group games. Not only do Wales need to beat England by a significant margin, they also need France to defeat the Netherlands. After going behind early on, Wales drew level through Jess Fishlock in the 13th minute after a VAR check, giving France a scare. Fishlock's historic goal was her country's first-ever goal at a major tournament. However, individual errors from Wales cost them, and helped France pull ahead and ultimately win the game. Euro 2025 has been Wales Women's first major tournament, and they were drawn into a strong group."
    },
    {
        "title": "Women's Euros: England avoid 'disaster' as big win gets champions back on track",
        "description": "They arrived at the Women's Euros as champions - and finally looked like champions again.",
        "url": "https://news.sky.com/story/womens-euros-england-avoid-disaster-as-big-win-gets-champions-back-on-track-13394776",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-euros-football_6961250.jpg?20250709182030",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-07-09 21:20:00",
        "Headline": "Making the quarter-finals could still require the Lionesses to beat Wales on Sunday. The tournament debutants are on the brink of being eliminated.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n They arrived at the Women's Euros as champions - and finally looked like champions again. Where the Lionesses were sloppy in the opening defeat to France, they were sublime against the Netherlands. A 4-0 thrashing put England's European title defence right back on track when early elimination was a real possibility. And while two goals were scored by Lauren James, along with one apiece from Georgia Stanway and Ella Toone, Alessia Russo shone with three assists. \"After the France game, we looked at ourselves a lot as individuals and how we can all be better and obviously within the team,\" Arsenal Champions League winner Russo said. \"I think that going into this game we wanted to start with that, setting our own standards high on and off the ball and we definitely did that. \"I think when that's our standard as a team, then the sky's the limit.\" \n                  England Women thrash Netherlands to keep Euros hopes alive - as Wales on the brink of exit\n                 \n                  Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest\n                 \n                  Women's Euros: Concerns for player safety as tournament kicks off in Switzerland\n                 From being on the brink, they're now back on track. But it's how to deal with pressure that pleased England manager Sarina Wiegman, having admitted she felt a \"little tension\" going into the clash with her home country on Wednesday. \"There are always things going well and not going well and we don't make it a disaster,\" she said. There is still a quarter-final to qualify for, which could require beating Wales on Sunday. Now their neighbours only have pride to play for after being on the brink of elimination - unless they can improbably win at least 9-0 and hope France beat the Netherlands. Read more from Sky News:Christian Horner sacked by F1 team Red BullDates doctors will strike this summer Of course, expectations were much lower for the Welsh at their first major tournament. But there was still a memorable moment in losing 4-1 to France. The equaliser that gave a flicker of hope came from Jess Fishlock, the holder of the country's appearance and goal records. So something for the Lionesses to be wary of in their British showdown in Switzerland on Sunday. Russo said: \"We'll work hard, we'll work until we can't run anymore, we stick together.\""
    },
    {
        "title": "Christian Horner says Red Bull sacking came as a 'shock' in farewell speech",
        "description": "Christian Horner has said his sacking as F1 Red Bull's team principal came as a \"shock\" during an emotional farewell speech.",
        "url": "https://news.sky.com/story/christian-horner-says-red-bull-sacking-came-as-a-shock-in-farewell-speech-13394789",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-christian-horner-red-bull_6960740.jpg?20250709101952",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 22:28:00",
        "Headline": "The 51-year-old, who had been with Red Bull since 2005, was the longest-serving team principal in F1.",
        "Content": " Christian Horner has said his sacking as F1 Red Bull's team principal came as a \"shock\" during an emotional farewell speech. The 51-year-old, who had been with Red Bull since 2005, was the longest-serving team principal in F1. The team announced Laurent Mekies had been appointed as CEO on Wednesday. A video of Horner's farewell speech at Red Bull's UK base in Milton Keynes, obtained by Sky Sports News, shows him breaking down in tears while explaining he was told he \"would no longer be involved with the business or the team\".  \"I will still remain employed by the company, but, operationally, the baton will be handed over,\" he said during his speech on Wednesday. \"It came as a shock to myself. \"I've had a chance to reflect over the last 12 hours and wanted to stand in front of all of you to break this news and to express my gratitude to each and every single member of the team that has given so much during the last 20-and-a-half years. \"When I arrived 20 years ago, there were a few less grey hairs. I walked into a team and did not know what to expect, but I was immediately welcomed and we started to build what became a powerhouse in F1. \"Watching and being part of this team, has been the biggest privilege of my life.\" Read more from Sky News:Ex-Tory chairman defects to ReformAt least four killed after Houthis sink shipAncelotti handed one-year prison sentence Horner's exit - a seismic announcement in the world of racing - comes following a difficult period for the Red Bull team, which two years ago dominated the F1 championship, before dramatically falling behind its rivals. The team currently sits fourth in the constructors' championship, behind McLaren, Mercedes, and Ferrari, while star driver Max Verstappen sits in third in the drivers' standings. Horner's departure from the team also comes a year after allegations of inappropriate behaviour were made against him in February 2024 by a female colleague. Horner, who is married to former Spice Girl Geri Horner, has always denied the allegations against him. They were dismissed following an appeal last summer. Red Bull's statement announcing the decision to sack Horner did not give a reason for his departure. Under Horner, Red Bull Racing achieved 124 race wins, 107 pole positions and 287 podium finishes, and won eight Drivers' World Championships and six Constructors' Championships. In a statement, Red Bull said: \"We would like to thank Christian Horner for his exceptional work over the last 20 years. \"With his tireless commitment, experience, expertise and innovative thinking, he has been instrumental in establishing Red Bull Racing as one of the most successful and attractive teams in Formula 1. \"Thank you for everything, Christian, and you will forever remain an important part of our team history.\""
    },
    {
        "title": "Labour MPs form new group as they urge prime minister to focus on living standards to help ward off Reform",
        "description": "A group of Labour MPs has urged Sir Keir Starmer to do more to tackle the rising cost of living amid fears the party could lose the next election to Reform.",
        "url": "https://news.sky.com/story/labour-mps-form-new-group-as-they-urge-prime-minister-to-focus-on-living-standards-to-help-ward-off-reform-13394773",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6960855.jpg?20250709114153",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 21:08:00",
        "Headline": "The new living standards coalition warns the prime minister that voters are turning to populism \"because they can't afford a decent life\".",
        "Content": "A group of Labour MPs has urged Sir Keir Starmer to do more to tackle the rising cost of living amid fears the party could lose the next election to Reform. The MPs are launching a new splinter group, the living standards coalition, to shift the focus to everyday concerns such as food, energy bills and housing. Politics latest: Former Tory chairman defects to Reform In a letter to the prime minister, the group's members warned that one question would be on the mind of voters at the next election: \"Did this Labour government make me better off?\" \"After 14 years of living in a no-growth economy and with some of the highest bills in Europe, our constituents are struggling to make ends meet,\" they said. \"More of them are turning away from democracy and towards populism as they can't afford a decent life.\" The coalition is the latest splinter group to form since the party's landslide election victory a year ago. \n                  Controversial welfare bill passes final Commons stage - but only after another concession\n                 \n                  Starmer refuses to rule out wealth tax\n                 \n                  UN criticises Starmer's welfare reforms and warns measures will 'increase poverty rates'\n                 Other groups include the Labour growth group, which focuses on delivering economic growth, and MPs in Red Wall constituencies in the North who are alive to the threat Reform poses in their seats. A YouGov poll last month found Reform was on track to get the most seats if an election were held this year - with combined support for the Conservatives and Labour collapsing to less than half of the national vote. While the MPs stress they are supportive of the actions the government has taken so far, the forming of a new group could be interpreted as a sign of restlessness in the parliamentary party, especially given the fallout of last week's botched welfare vote. In the letter, first reported by The Guardian, the MPs write: \"We are here to support your efforts to go further and faster on raising living standards. We come from every corner of our party. \"To raise living standards, we support government interventions that will help to increase incomes and lower costs. Read more:What is a wealth tax?Controversial welfare bill passes \"We welcome interventions that will raise incomes. We welcome investment in labour- intensive building, education, and healthcare jobs that will raise living standards through employment. We welcome the Employment Rights Bill that will get wages rising.\" They added: \"We know that some will try to stop us raising living standards. \"They will try to block us from building the affordable housing and windfarms we need to get bills down. They oppose the way we have raised revenue from the very wealthiest to invest in childcare and our NHS. \"We are glad you are keeping this government's focus on raising living standards. We stand in support of you. It is the most important issue to our constituents and the country.\""
    },
    {
        "title": "Man guilty of murder after driving into 'Good Samaritan' Chris Marriott following wedding brawl in Sheffield",
        "description": "A man who killed a \"Good Samaritan\" by driving into the middle of a wedding brawl has been found guilty of murder.",
        "url": "https://news.sky.com/story/man-guilty-of-murder-after-driving-into-good-samaritan-chris-marriott-following-wedding-brawl-in-sheffield-13394670",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-chris-marriott-sheffield_6961233.jpg?20250709180757",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 16:47:00",
        "Headline": "Hassan Jhangur then left the car with the engine running and stabbed his new brother-in-law multiple times in the head and chest.",
        "Content": "A man who killed a \"Good Samaritan\" by driving into the middle of a wedding brawl has been found guilty of murder. Chris Marriott, 46, was out for a post-Christmas walk when he was hit by Hassan Jhangur's car and left trapped underneath. Jhangur used his Seat Ibiza as a weapon after a fight between two families at his sister's wedding reception on 27 December 2023. He first drove into the father of the Khan family, sending him over the bonnet, then crashed into a group of four people that included Mr Marriott. The devout Christian had stopped to help one of Jhangur's sisters, who was lying in the road unconscious in the Burngreave area of Sheffield. Off-duty midwife Alison Norris and Jhangur's own mother and sister were also injured, Sheffield Crown Court was told. Jhangur, 25, stabbed his new brother-in-law Hasan Khan several times in the head and chest after getting out the car. The court heard Jhangur later told police: \"That's why you don't mess with the Jhangurs.\" He denied the murder and manslaughter of Mr Marriott but pleaded guilty to death by dangerous driving. Prosecutor Jason Pitter KC told jurors that Jhangur was guilty of murder as he intended \"at the very least to cause really serious harm\". He said despite Jhangur targeting the Khan family, \"the law says your intentions can be transferred from one person to another, even if he did not intend to hit that particular person\". The jury agreed and convicted him of murder by a majority of 10 to two. Jhangur was also found guilty of wounding his brother-in-law but cleared of his attempted murder. He was further convicted of four charges of GBH with intent to Alison Norris, Ambreen Jhangur, Nafeesa Jhangur and Riasat Khan. His father was found guilty of perverting the course of justice after hiding a knife. The court heard the chaos erupted following the wedding of Hasan Khan and Amaani Jhangur, which took place the same morning. Mr Pitter said tensions over location and timing had escalated to Amaani falling out with her mother and sisters - and none of her family, including the defendant, attended the wedding. But her mother, Ambreen Jhangur, and sister Nafeesa Jhangur later turned up at the Khan home, sparking a row in the street that descended into violence and left Ms Jhangur unconscious. The trial heard Mr Marriott, who was out on a family walk, went over to help while his wife and children returned home. Midwife Alison Norris - who was also out with her family - did the same thing. Read more from Sky News:The fly-tippers turning trash into cashMan found guilty of murdering mother-of-six Prosecutors said Hassan Jhangur travelled to the scene after hearing about his sister's injuries - first driving at Hasan Khan's father, Riasat Khan, as he was in the road making a 999 call. He then hit the other four before coming to a stop in a nearby garden. Jhangur left the vehicle with the engine still running and stabbed Hasan Khan multiple times to the left side of his head and chest. The court heard Mr Marriott was wedged under the car and showed no signs of life when emergency services tried to reach him. Judge Mr Justice Morris told Jhangur - who was convicted of murder following a retrial - that he faced a life sentence. Mr Marriott's widow, Bryony Marriott, was in court for the verdict and the judge praised her and others in the public gallery for the \"quiet dignity and courtesy you have shown throughout the trial\". Jhangur's sentencing date is still to be announced."
    },
    {
        "title": "Officer denies he 'lost control' attempting to arrest brothers at Manchester Airport, court hears",
        "description": "A police officer told a court he had not \"lost control\" at Manchester Airport, after being allegedly assaulted by two brothers while attempting to arrest them.",
        "url": "https://news.sky.com/story/officer-denies-he-lost-control-attempting-to-arrest-brothers-at-manchester-airport-court-hears-13394673",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-zachary-marsden-manchester-airport_6961296.png?20250709191934",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-09 17:01:00",
        "Headline": "PC Zachary Marsden has been questioned at Liverpool Crown Court about his tactics and whether they were justified in order to arrest brothers Mohammed Fahir Amaaz and Muhammad Amaad, who both deny assault charges.",
        "Content": " A police officer told a court he had not \"lost control\" at Manchester Airport, after being allegedly assaulted by two brothers while attempting to arrest them. Mohammed Fahir Amaaz, 20, and Muhammad Amaad, 26, from Rochdale, Greater Manchester, are on trial at Liverpool Crown Court accused of assaulting officers in Terminal 2 arrivals on 23 July 2024. The officers were responding to reports Amaaz had allegedly headbutted a customer at a Starbucks cafe. The pair deny all the charges against them. On Wednesday, jurors were shown a photograph of injuries to the face of the defendants' mother, Shameem Akhtar, allegedly caused by PC Zachary Marsden as he attempted to arrest Amaaz. CCTV footage played to the jury showed Mrs Akhtar knelt near her son, who had fallen to the floor after being Tasered. Imran Khan KC, defending Amaaz, cross-examined PC Marsden about his tactics and whether the injury was directly related to his actions. The Greater Manchester Police firearms officer told the court: \"I believe I was not the only person who made contact with Mrs Akhtar. \n                  Jury shown CCTV and bodycam footage of brothers allegedly assaulting police at Manchester Airport\n                 \n                  Man accused of assaulting police at Manchester Airport 'headbutted' a traveller, court hears\n                 \n                  Three teenagers arrested after boy, 14, stabbed to death in north Manchester\n                 \"I firmly believe that you can't wholly attribute my actions to those injuries.\" The officer added that he believed Amaad had struck his own mother during the disturbance. During further questioning, Mr Khan asked: \"Did you push the Taser you were holding into Mrs Akhtar at the time she was tending to Mr Amaaz?\" PC Marsden replied: \"I did, yes.\" Mr Khan said: \"Did you think that was justified?\" PC Marsden said: \"In the circumstances, yes, I did. She grabbed my left leg. Using my left hand, I have taken hold of her grip to remove it. She clamped on to my left hand pulling me forward. \"I was being pulled over Mr Amaaz and at risk of falling on top of him and being vulnerable.\" Mr Khan suggested to PC Marsden that the action \"was unnecessary\" and amounted to a \"hard push\" by his Taser on Mrs Akhtar's face. Mr Khan added: \"She was concerned for Mr Amaaz. She was not a threat. She was not interfering with anything you were doing and this was conduct, I suggest, where you have lost control.\" PC Marsden said: \"I would deny that.\" Additional mobile phone footage was played to the jury of PC Marsden later using Pava incapacitant spray on a bystander. PC Marsden told the court he deployed the tactic because events were \"beyond verbal reasoning\", because the bystander was effectively \"shielding\" another man who officers wanted to detain for obstructing their duties. Mr Khan then asked PC Marsden to justify grabbing another man's neck and pulling him to the floor. Read more from Sky News:Why fly-tipping is the 'new narcotics'Southport inquiry: Mother describes attackStarmer and Macron migrant deal PC Marsden replied: \"Immediately prior, I had been subjected to the most violent assault of my life. I was now terrified that we are on the tipping point of another volatile situation. \"They were complicit in watching us being violently assaulted. I used pre-emptive force. I was in pain, exhausted and wanted to try the best I could to effect an arrest.\" Mr Khan also asked whether spraying Pava in the bystander's face was justified. PC Marsden said: \"My fear was that he would be combative and we would end up with another hostile fight that I didn't want to happen.\" The trial continues."
    },
    {
        "title": "Labour MPs form new group as they urge prime minister to focus on living standards to help ward off Reform",
        "description": "A group of Labour MPs has urged Sir Keir Starmer to do more to tackle the rising cost of living amid fears the party could lose the next election to Reform.",
        "url": "https://news.sky.com/story/labour-mps-form-new-group-as-they-urge-prime-minister-to-focus-on-living-standards-to-help-ward-off-reform-13394773",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6960855.jpg?20250709114153",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 21:08:00",
        "Headline": "The new living standards coalition warns the prime minister that voters are turning to populism \"because they can't afford a decent life\".",
        "Content": "A group of Labour MPs has urged Sir Keir Starmer to do more to tackle the rising cost of living amid fears the party could lose the next election to Reform. The MPs are launching a new splinter group, the living standards coalition, to shift the focus to everyday concerns such as food, energy bills and housing. Politics latest: Former Tory chairman defects to Reform In a letter to the prime minister, the group's members warned that one question would be on the mind of voters at the next election: \"Did this Labour government make me better off?\" \"After 14 years of living in a no-growth economy and with some of the highest bills in Europe, our constituents are struggling to make ends meet,\" they said. \"More of them are turning away from democracy and towards populism as they can't afford a decent life.\" The coalition is the latest splinter group to form since the party's landslide election victory a year ago. \n                  Controversial welfare bill passes final Commons stage - but only after another concession\n                 \n                  Starmer refuses to rule out wealth tax\n                 \n                  UN criticises Starmer's welfare reforms and warns measures will 'increase poverty rates'\n                 Other groups include the Labour growth group, which focuses on delivering economic growth, and MPs in Red Wall constituencies in the North who are alive to the threat Reform poses in their seats. A YouGov poll last month found Reform was on track to get the most seats if an election were held this year - with combined support for the Conservatives and Labour collapsing to less than half of the national vote. While the MPs stress they are supportive of the actions the government has taken so far, the forming of a new group could be interpreted as a sign of restlessness in the parliamentary party, especially given the fallout of last week's botched welfare vote. In the letter, first reported by The Guardian, the MPs write: \"We are here to support your efforts to go further and faster on raising living standards. We come from every corner of our party. \"To raise living standards, we support government interventions that will help to increase incomes and lower costs. Read more:What is a wealth tax?Controversial welfare bill passes \"We welcome interventions that will raise incomes. We welcome investment in labour- intensive building, education, and healthcare jobs that will raise living standards through employment. We welcome the Employment Rights Bill that will get wages rising.\" They added: \"We know that some will try to stop us raising living standards. \"They will try to block us from building the affordable housing and windfarms we need to get bills down. They oppose the way we have raised revenue from the very wealthiest to invest in childcare and our NHS. \"We are glad you are keeping this government's focus on raising living standards. We stand in support of you. It is the most important issue to our constituents and the country.\""
    },
    {
        "title": "Southport attack: Mother saw CCTV of daughter being 'dragged back into building' - before being stabbed 20 more times",
        "description": "The mother of a girl who escaped the Southport attack before being dragged back inside has told how her daughter is still fighting to survive.",
        "url": "https://news.sky.com/story/parents-tell-untold-stories-of-how-their-hero-daughters-survived-southport-attack-13394396",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southport-flowers-tributes_6960129.jpg?20250709083419",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-07-09 10:04:00",
        "Headline": "A public inquiry is looking into whether the attack could or should have been prevented, given what was known about Axel Rudakubana.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The mother of a girl who escaped the Southport attack before being dragged back inside has told how her daughter is still fighting to survive. Axel Rudakubana, 18, stabbed the girl, referred to as C1 at the public inquiry, a total of 33 times at a Taylor Swift-themed class in the Merseyside coastal town on 29 July last year. She was one of eight children injured, while Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine, were murdered in what inquiry chairman Sir Adrian Fulford called \"one of the most egregious crimes in our country's history\". The girl, then aged seven, ran out of the Hart Space building after being attacked, but Rudakubana was seen dragging her back inside in CCTV footage played during his sentencing hearing, which drew gasps in court, before she was stabbed 20 more times. Reading an emotional statement at Liverpool Town Hall on Wednesday, her mother said: \"That is how she became known in this nightmare. The girl that was dragged back in.\" She thanked the teachers who escaped to call police and flag down help but said \"the most painful of truths for\" her and the girl's father \"is that there were no adults to help during both of her attacks\". \"She was only supported by other children. The courage and strength she found leaves me crushed, but in complete awe,\" she said. Read more: Southport inquiry as it happened The mother said she wanted to share her \"beautiful, articulate, fun-loving\" little girl's story, adding: \"I want to tell you of her bravery and strength and how hard she is fighting, still now to survive.\" She added: \"It is these untold stories of remarkable strength and bravery that are missing when we have heard other accounts of this day.\" The mother said the \"hours and days that followed the attack were a living hell\" and her daughter's memories - including a concert of her \"idol\" Taylor Swift - have \"been forfeited to make space for the trauma that she carries\".  \"We tell her she was brave. How proud we are that she was able to help other girls. How her strength makes us feel strong. How important what she did that day was. She is her own hero. She may be a survivor of this attack, but she is still trying to survive this, every single day,\" she said. The surviving victims and their families have been granted anonymity during the inquiry, while the chairman has asked media not to use Rudakubana's police mugshot to avoid distressing them. 'She is our hero' The father of a girl referred to as C3 told how his daughter was the first to escape the scene by running from the building and hiding behind a parked car before jumping through an open car door. \"Our nine-year-old daughter was stabbed three times in the back by a coward she didn't even see,\" he said. \"Although she didn't know what was happening - she knew she had to run. She ran out of the studio door, down the stairs, and out of the building.\" He said she can be seen \"looking scared, confused and pained\" in CCTV footage of the incident, adding: \"It was troubling for us to see what she had to go through, before either of her parents had arrived at the scene.\" \"We are so thankful and proud that despite being critically injured, she was able to make the decisions she did in that terrible moment,\" he said. The girl's father said his daughter \"continues to astound\" them with the way she dealt with the attack and her recovery, saying: \"It has been inspiring for us to witness.\" He said she has difficulty sleeping, experiences flashbacks, looks over her shoulder scanning for potential danger when she leaves the house, has a fear of loud noises and has to turn off some songs when they come on the radio. \"Our daughter knows that she is loved,\" he said. \"It is through this support and love that she will continue to thrive. We couldn't be prouder of her. She is our hero.\" Attack 'changed everything'  The mother of a girl referred to as C8 said she was \"like any other seven-year-old little girl\", \"with an incredible energy\" and \"full of life\". But in a statement read out by a legal representative, she said the attack last year \"changed everything\" when she got a \"panicked phone call\" from a friend's mother, who couldn't find the girls. \"That moment, the sound of fear in her voice and the panic I felt will never leave me,\" she said. \"I rushed to the scene and what I saw is something no parent should ever see. My daughter had sustained serious physical injuries including a stab wound to her arm and a cut to her face and chin.\"  Read more from Sky News:Infected blood victims 'waiting to die in limbo'The fly-tippers turning trash into cash She said her daughter \"remembers the attack vividly\" and later told her \"she thought it had to be fake, because she couldn't believe something that terrible could really be happening\". \"Where she was once eager to go off with her friends, she now needs my support if it is somewhere public or unknown,\" she said. \"Simple days out now need a level of safety planning that we would never have considered before.\" 'Constant flashbacks' The mother of a girl referred to as Q, who was one of 15 children who escaped without physical injuries, told how she arrived to collect her daughter to find \"children running from the building, screaming and fearing for their lives\". In a statement read to the inquiry by a legal representative on her behalf, she said it was \"the most horrific experience of my life\". \"What I saw on that day will stick with me forever, I constantly have flashbacks and relive what happened,\" she said. She said her daughter has become \"very withdrawn\" since the attack and has asked her parents, \"How will I ever be normal again?\" Rudakubana was jailed for a minimum of 52 years in January and is being investigated over an alleged attack on a prison officer at Belmarsh prison in May. The public inquiry, announced by Home Secretary Yvette Cooper in January, is looking into whether the attack could or should have been prevented, given what was known about the killer. Rudakubana, who was born in Cardiff, had contact with police, the courts, the youth justice system, social services and mental health services, and was referred to the government's anti-extremism Prevent scheme three times before the murders. A rapid review into his contact with Prevent found his case should have been kept open and that he should have been referred to Channel, another anti-terror scheme. C1's mother said: \"She deserves the truth, she deserves accountability. She deserves an apology. Our girls deserve an apology. \"Backed up by the promise that changes will be made and this will not be allowed to happen again.\""
    },
    {
        "title": "Ex-Tory chairman Sir Jake Berry defects to Reform",
        "description": "Ex-Tory chairman Sir Jake Berry has defected to Reform, in the latest blow to the Conservatives.",
        "url": "https://news.sky.com/story/ex-tory-chairman-sir-jake-berry-defects-to-reform-13394746",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/skynews-jake-berry-conservative_5941834.jpg?20221024140645",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 20:02:00",
        "Headline": "Sir Jake Berry's defection comes just days after former Welsh secretary David Jones also joined Reform. ",
        "Content": "Ex-Tory chairman Sir Jake Berry has defected to Reform, in the latest blow to the Conservatives. The former MP for Rossendale and Darwen, who served as Northern Powerhouse minister under Boris Johnson and lost his seat last year, said he had defected to Nigel Farage's party because the Tories had \"lost their way\". Politics latest: Labour rebel defends calls for 'wealth tax' Reform UK confirmed the defection to Sky News, which was first broken by The Sun. Speaking to the paper, Sir Jake said Mr Farage's party was the \"last chance to pull Britain back from terminal decline\". \"Our streets are completely lawless,\" he said. \"Migration is out of control. Taxes are going through the roof. \n                  Labour MPs form new group as they urge prime minister to focus on living standards to help ward off Reform\n                 \n                  Is Labour losing Wales to Reform? \n                 \n                  Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat\n                 \"And day after day, I hear from people in my community and beyond who say the same thing: 'This isn't the Britain I grew up in'.\" Sir Jake accused his former party of \"abandoning the British people\" but said he was not \"giving up\". \"I'm staying. And I'm fighting. \"Fighting for the Britain I want my kids, and one day, my grandkids, to grow up in.\" Mr Farage welcomed what he said was \"a very brave decision\" by Sir Jake. \"His admission that the Conservative government he was part of broke the country is unprecedented and principled,\" he added. A Conservative Party spokesman said: \"Reform support increasing the benefits bill by removing the two-child cap, and nationalising British industry. By contrast the Conservatives, under new leadership, will keep making the case for sound money, lower taxes and bringing the welfare bill under control. \"We wish Jake well in his new high spend, high tax party.\" Sir Jake's defection to Reform comes just days after former Conservative cabinet minister David Jones joined Reform UK, which continues to lead in the polls. Mr Jones, who was MP for Clwyd West from 2005 until standing down in 2024, said he had quit the Tories after \"more than 50 years of continuous membership\". Sir Jake was the MP Rossendale and Darwen in Lancashire between 2010 and 2024, when he was defeated by Labour's Andy MacNae. He held several ministerial posts including in the Department for Housing, Communities and Local Government, Energy and Climate Change and the Cabinet Office. He was also chairman of the Conservative Party from September to October 2022, under Liz Truss. Announcing his defection - which comes a year after the Tories suffered their worst ever election defeat - Sir Jake said \"Britain was broken\" and \"the Conservative governments I was part of share the blame\". \"We now have a tax system that punishes hard work and ambition,\" he said. \"Just this week, we saw record numbers of our brightest and best people leaving Britain because they can't see a future here. At the same time, our benefits system is pulling in the world's poor with no plan for integration and no control over who comes in. \"If you were deliberately trying to wreck the country, you'd be hard-pressed to do a better job than the last two decades of Labour and Tory rule. \"Millions of people, just like me, want a country they can be proud of again. The only way we get that is with Reform in government. That's why I've resigned from the Conservative Party. I'm now backing Reform UK and working to make them the next party of government.\" Read more:Starmer and Macron agree need for new small boats 'deterrent' Controversial welfare bill passes final Commons stage He added: \"And with Nigel Farage leading Reform, we've got someone the country can actually trust. He doesn't change his views to fit the mood of the day. And people respect that. So do I. That's why I believe he should be our next prime minister.\" A Labour Party spokesperson said: \"Not content with taking advice from Liz Truss, Nigel Farage has now tempted her Tory Party chairman into his ranks. \"It's clear Farage wants Liz Truss's reckless economics, which crashed our economy and sent mortgages spiralling, to be Reform's blueprint for Britain. It's a recipe for disaster and working people would be left paying the price.\""
    },
    {
        "title": "Man guilty of murder after driving into 'Good Samaritan' Chris Marriott following wedding brawl in Sheffield",
        "description": "A man who killed a \"Good Samaritan\" by driving into the middle of a wedding brawl has been found guilty of murder.",
        "url": "https://news.sky.com/story/man-guilty-of-murder-after-driving-into-good-samaritan-chris-marriott-following-wedding-brawl-in-sheffield-13394670",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-chris-marriott-sheffield_6961233.jpg?20250709180757",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 16:47:00",
        "Headline": "Hassan Jhangur then left the car with the engine running and stabbed his new brother-in-law multiple times in the head and chest.",
        "Content": "A man who killed a \"Good Samaritan\" by driving into the middle of a wedding brawl has been found guilty of murder. Chris Marriott, 46, was out for a post-Christmas walk when he was hit by Hassan Jhangur's car and left trapped underneath. Jhangur used his Seat Ibiza as a weapon after a fight between two families at his sister's wedding reception on 27 December 2023. He first drove into the father of the Khan family, sending him over the bonnet, then crashed into a group of four people that included Mr Marriott. The devout Christian had stopped to help one of Jhangur's sisters, who was lying in the road unconscious in the Burngreave area of Sheffield. Off-duty midwife Alison Norris and Jhangur's own mother and sister were also injured, Sheffield Crown Court was told. Jhangur, 25, stabbed his new brother-in-law Hasan Khan several times in the head and chest after getting out the car. The court heard Jhangur later told police: \"That's why you don't mess with the Jhangurs.\" He denied the murder and manslaughter of Mr Marriott but pleaded guilty to death by dangerous driving. Prosecutor Jason Pitter KC told jurors that Jhangur was guilty of murder as he intended \"at the very least to cause really serious harm\". He said despite Jhangur targeting the Khan family, \"the law says your intentions can be transferred from one person to another, even if he did not intend to hit that particular person\". The jury agreed and convicted him of murder by a majority of 10 to two. Jhangur was also found guilty of wounding his brother-in-law but cleared of his attempted murder. He was further convicted of four charges of GBH with intent to Alison Norris, Ambreen Jhangur, Nafeesa Jhangur and Riasat Khan. His father was found guilty of perverting the course of justice after hiding a knife. The court heard the chaos erupted following the wedding of Hasan Khan and Amaani Jhangur, which took place the same morning. Mr Pitter said tensions over location and timing had escalated to Amaani falling out with her mother and sisters - and none of her family, including the defendant, attended the wedding. But her mother, Ambreen Jhangur, and sister Nafeesa Jhangur later turned up at the Khan home, sparking a row in the street that descended into violence and left Ms Jhangur unconscious. The trial heard Mr Marriott, who was out on a family walk, went over to help while his wife and children returned home. Midwife Alison Norris - who was also out with her family - did the same thing. Read more from Sky News:The fly-tippers turning trash into cashMan found guilty of murdering mother-of-six Prosecutors said Hassan Jhangur travelled to the scene after hearing about his sister's injuries - first driving at Hasan Khan's father, Riasat Khan, as he was in the road making a 999 call. He then hit the other four before coming to a stop in a nearby garden. Jhangur left the vehicle with the engine still running and stabbed Hasan Khan multiple times to the left side of his head and chest. The court heard Mr Marriott was wedged under the car and showed no signs of life when emergency services tried to reach him. Judge Mr Justice Morris told Jhangur - who was convicted of murder following a retrial - that he faced a life sentence. Mr Marriott's widow, Bryony Marriott, was in court for the verdict and the judge praised her and others in the public gallery for the \"quiet dignity and courtesy you have shown throughout the trial\". Jhangur's sentencing date is still to be announced."
    },
    {
        "title": "England Women thrash Netherlands to keep Euros hopes alive - as Wales on the brink of exit",
        "description": "England Women have convincingly beaten the Netherlands to keep their Euros hopes alive. But Wales are on the brink of exiting the competition.",
        "url": "https://news.sky.com/story/england-women-thrash-netherlands-to-keep-euros-hopes-alive-13394668",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-womens-football_6961265.jpg?20250709183740",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 16:46:00",
        "Headline": "After a disappointing loss in their first Euros group game, Sarina Wiegman's Lionesses came back in impressive fashion against her native Netherlands. Meanwhile, Wales lost 4-1 to France, leaving them on the brink of exiting the tournament.",
        "Content": " England Women have convincingly beaten the Netherlands to keep their Euros hopes alive. But Wales are on the brink of exiting the competition. Sarina Wiegman's England came into the tournament as defending champions, but slumped to a 2-1 defeat against France in their opening match on Saturday. In their second game against the Netherlands, the Lionesses took a commanding lead in the must-win tie, and it ended up being a thrashing. However, it was a less successful night for Wales who fell to a 4-1 loss to group leaders France. While technically still in with a chance of qualifying, Wales now need a huge victory over England when the two sides meet on Sunday and results elsewhere to go their way. Lionesses roar England's Lauren James, freshly returned from injury, starred in the 4-0 victory, scoring twice before being substituted in the second half. \n                  Women's Euros: England avoid 'disaster' as big win gets champions back on track\n                 \n                  Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest\n                 \n                  Women's Euros: Concerns for player safety as tournament kicks off in Switzerland\n                 Georgia Stanway and Ella Toone were the other goalscorers, while FA patron Prince William was among those cheering on the team in the Stadion Letzigrund in Zurich, Switzerland. The performance was much-needed, as a loss would have left their campaign on a knife-edge, relying on results elsewhere. Going into the competition, the England camp was hit by a series of setbacks as three senior players pulled out for differing reasons. England will play Wales in their third and final group game on Sunday 13 July. Speaking to the BBC after the game, James said: \"I enjoyed it a lot, the goals say it all. \"We bounced back from the previous game and showed we were more than capable [of] showing the world what we can do.\" Fellow goalscorer Stanway said: \"I've always said, and said the other day, this is about showing who we are. We fought from the very first minute to the very last.\" Read more from Sky News:What is a wealth tax?Christian Horner sacked by F1 team Red BullDates doctors will strike this summer Wiegman, who has also led her native Netherlands to Euros glory, lauded her team's response after losing against France. Speaking at a news conference after the game, Wiegman said: \"I'm very happy with the performance, we bounced back really well from France. \"How the team responded today was really good.\" Sir Keir Starmer, an Arsenal fan, also celebrated the win with a post on X that said it was a \"phenomenal\" performance. Wales lose 4-1 Meanwhile, Wales lost 4-1 to France, who now top the group. It has left Rhian Wilkinson's side almost certain to exit the tournament - barring a major upset in the final group games. Not only do Wales need to beat England by a significant margin, they also need France to defeat the Netherlands. After going behind early on, Wales drew level through Jess Fishlock in the 13th minute after a VAR check, giving France a scare. Fishlock's historic goal was her country's first-ever goal at a major tournament. However, individual errors from Wales cost them, and helped France pull ahead and ultimately win the game. Euro 2025 has been Wales Women's first major tournament, and they were drawn into a strong group."
    },
    {
        "title": "Christian Horner says Red Bull sacking came as a 'shock' in farewell speech",
        "description": "Christian Horner has said his sacking as F1 Red Bull's team principal came as a \"shock\" during an emotional farewell speech.",
        "url": "https://news.sky.com/story/christian-horner-says-red-bull-sacking-came-as-a-shock-in-farewell-speech-13394789",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-christian-horner-red-bull_6960740.jpg?20250709101952",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 22:28:00",
        "Headline": "The 51-year-old, who had been with Red Bull since 2005, was the longest-serving team principal in F1.",
        "Content": " Christian Horner has said his sacking as F1 Red Bull's team principal came as a \"shock\" during an emotional farewell speech. The 51-year-old, who had been with Red Bull since 2005, was the longest-serving team principal in F1. The team announced Laurent Mekies had been appointed as CEO on Wednesday. A video of Horner's farewell speech at Red Bull's UK base in Milton Keynes, obtained by Sky Sports News, shows him breaking down in tears while explaining he was told he \"would no longer be involved with the business or the team\".  \"I will still remain employed by the company, but, operationally, the baton will be handed over,\" he said during his speech on Wednesday. \"It came as a shock to myself. \"I've had a chance to reflect over the last 12 hours and wanted to stand in front of all of you to break this news and to express my gratitude to each and every single member of the team that has given so much during the last 20-and-a-half years. \"When I arrived 20 years ago, there were a few less grey hairs. I walked into a team and did not know what to expect, but I was immediately welcomed and we started to build what became a powerhouse in F1. \"Watching and being part of this team, has been the biggest privilege of my life.\" Read more from Sky News:Ex-Tory chairman defects to ReformAt least four killed after Houthis sink shipAncelotti handed one-year prison sentence Horner's exit - a seismic announcement in the world of racing - comes following a difficult period for the Red Bull team, which two years ago dominated the F1 championship, before dramatically falling behind its rivals. The team currently sits fourth in the constructors' championship, behind McLaren, Mercedes, and Ferrari, while star driver Max Verstappen sits in third in the drivers' standings. Horner's departure from the team also comes a year after allegations of inappropriate behaviour were made against him in February 2024 by a female colleague. Horner, who is married to former Spice Girl Geri Horner, has always denied the allegations against him. They were dismissed following an appeal last summer. Red Bull's statement announcing the decision to sack Horner did not give a reason for his departure. Under Horner, Red Bull Racing achieved 124 race wins, 107 pole positions and 287 podium finishes, and won eight Drivers' World Championships and six Constructors' Championships. In a statement, Red Bull said: \"We would like to thank Christian Horner for his exceptional work over the last 20 years. \"With his tireless commitment, experience, expertise and innovative thinking, he has been instrumental in establishing Red Bull Racing as one of the most successful and attractive teams in Formula 1. \"Thank you for everything, Christian, and you will forever remain an important part of our team history.\""
    },
    {
        "title": "Women's Euros: England avoid 'disaster' as big win gets champions back on track",
        "description": "They arrived at the Women's Euros as champions - and finally looked like champions again.",
        "url": "https://news.sky.com/story/womens-euros-england-avoid-disaster-as-big-win-gets-champions-back-on-track-13394776",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-euros-football_6961250.jpg?20250709182030",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-07-09 21:20:00",
        "Headline": "Making the quarter-finals could still require the Lionesses to beat Wales on Sunday. The tournament debutants are on the brink of being eliminated.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n They arrived at the Women's Euros as champions - and finally looked like champions again. Where the Lionesses were sloppy in the opening defeat to France, they were sublime against the Netherlands. A 4-0 thrashing put England's European title defence right back on track when early elimination was a real possibility. And while two goals were scored by Lauren James, along with one apiece from Georgia Stanway and Ella Toone, Alessia Russo shone with three assists. \"After the France game, we looked at ourselves a lot as individuals and how we can all be better and obviously within the team,\" Arsenal Champions League winner Russo said. \"I think that going into this game we wanted to start with that, setting our own standards high on and off the ball and we definitely did that. \"I think when that's our standard as a team, then the sky's the limit.\" \n                  England Women thrash Netherlands to keep Euros hopes alive - as Wales on the brink of exit\n                 \n                  Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest\n                 \n                  Women's Euros: Concerns for player safety as tournament kicks off in Switzerland\n                 From being on the brink, they're now back on track. But it's how to deal with pressure that pleased England manager Sarina Wiegman, having admitted she felt a \"little tension\" going into the clash with her home country on Wednesday. \"There are always things going well and not going well and we don't make it a disaster,\" she said. There is still a quarter-final to qualify for, which could require beating Wales on Sunday. Now their neighbours only have pride to play for after being on the brink of elimination - unless they can improbably win at least 9-0 and hope France beat the Netherlands. Read more from Sky News:Christian Horner sacked by F1 team Red BullDates doctors will strike this summer Of course, expectations were much lower for the Welsh at their first major tournament. But there was still a memorable moment in losing 4-1 to France. The equaliser that gave a flicker of hope came from Jess Fishlock, the holder of the country's appearance and goal records. So something for the Lionesses to be wary of in their British showdown in Switzerland on Sunday. Russo said: \"We'll work hard, we'll work until we can't run anymore, we stick together.\""
    },
    {
        "title": "Officer denies he 'lost control' attempting to arrest brothers at Manchester Airport, court hears",
        "description": "A police officer told a court he had not \"lost control\" at Manchester Airport, after being allegedly assaulted by two brothers while attempting to arrest them.",
        "url": "https://news.sky.com/story/officer-denies-he-lost-control-attempting-to-arrest-brothers-at-manchester-airport-court-hears-13394673",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-zachary-marsden-manchester-airport_6961296.png?20250709191934",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 17:01:00",
        "Headline": "PC Zachary Marsden has been questioned at Liverpool Crown Court about his tactics and whether they were justified in order to arrest brothers Mohammed Fahir Amaaz and Muhammad Amaad, who both deny assault charges.",
        "Content": " A police officer told a court he had not \"lost control\" at Manchester Airport, after being allegedly assaulted by two brothers while attempting to arrest them. Mohammed Fahir Amaaz, 20, and Muhammad Amaad, 26, from Rochdale, Greater Manchester, are on trial at Liverpool Crown Court accused of assaulting officers in Terminal 2 arrivals on 23 July 2024. The officers were responding to reports Amaaz had allegedly headbutted a customer at a Starbucks cafe. The pair deny all the charges against them. On Wednesday, jurors were shown a photograph of injuries to the face of the defendants' mother, Shameem Akhtar, allegedly caused by PC Zachary Marsden as he attempted to arrest Amaaz. CCTV footage played to the jury showed Mrs Akhtar knelt near her son, who had fallen to the floor after being Tasered. Imran Khan KC, defending Amaaz, cross-examined PC Marsden about his tactics and whether the injury was directly related to his actions. The Greater Manchester Police firearms officer told the court: \"I believe I was not the only person who made contact with Mrs Akhtar. \n                  Jury shown CCTV and bodycam footage of brothers allegedly assaulting police at Manchester Airport\n                 \n                  Man accused of assaulting police at Manchester Airport 'headbutted' a traveller, court hears\n                 \n                  Three teenagers arrested after boy, 14, stabbed to death in north Manchester\n                 \"I firmly believe that you can't wholly attribute my actions to those injuries.\" The officer added that he believed Amaad had struck his own mother during the disturbance. During further questioning, Mr Khan asked: \"Did you push the Taser you were holding into Mrs Akhtar at the time she was tending to Mr Amaaz?\" PC Marsden replied: \"I did, yes.\" Mr Khan said: \"Did you think that was justified?\" PC Marsden said: \"In the circumstances, yes, I did. She grabbed my left leg. Using my left hand, I have taken hold of her grip to remove it. She clamped on to my left hand pulling me forward. \"I was being pulled over Mr Amaaz and at risk of falling on top of him and being vulnerable.\" Mr Khan suggested to PC Marsden that the action \"was unnecessary\" and amounted to a \"hard push\" by his Taser on Mrs Akhtar's face. Mr Khan added: \"She was concerned for Mr Amaaz. She was not a threat. She was not interfering with anything you were doing and this was conduct, I suggest, where you have lost control.\" PC Marsden said: \"I would deny that.\" Additional mobile phone footage was played to the jury of PC Marsden later using Pava incapacitant spray on a bystander. PC Marsden told the court he deployed the tactic because events were \"beyond verbal reasoning\", because the bystander was effectively \"shielding\" another man who officers wanted to detain for obstructing their duties. Mr Khan then asked PC Marsden to justify grabbing another man's neck and pulling him to the floor. Read more from Sky News:Why fly-tipping is the 'new narcotics'Southport inquiry: Mother describes attackStarmer and Macron migrant deal PC Marsden replied: \"Immediately prior, I had been subjected to the most violent assault of my life. I was now terrified that we are on the tipping point of another volatile situation. \"They were complicit in watching us being violently assaulted. I used pre-emptive force. I was in pain, exhausted and wanted to try the best I could to effect an arrest.\" Mr Khan also asked whether spraying Pava in the bystander's face was justified. PC Marsden said: \"My fear was that he would be combative and we would end up with another hostile fight that I didn't want to happen.\" The trial continues."
    },
    {
        "title": "UK weather: Country set to have new heatwave - with temperatures over 30C in some areas, Met Office forecasts",
        "description": "Temperatures are expected to rise steadily throughout the week as the third heatwave of the summer is forecast for the UK - potentially hitting the low 30s Celsius in some areas.",
        "url": "https://news.sky.com/story/uk-weather-country-set-to-have-new-heatwave-with-temperatures-over-30c-in-some-areas-met-office-forecasts-13394531",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-uk-weather-sunshine_6961054.jpg?20250709151046",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-09 12:13:00",
        "Headline": "Forecasters say central parts of the UK could see highs between 26C and 28C from Wednesday, with temperatures in the far north and west reaching the high 20s or low 30s by the end of the week.",
        "Content": "Temperatures are expected to rise steadily throughout the week as the third heatwave of the summer is forecast for the UK - potentially hitting the low 30s Celsius in some areas. Forecasters say central parts of the UK could see highs between 26C and 28C (78.8F and 82.4F) from Wednesday, with temperatures in the far north and west reaching the high 20s or low 30s by the end of the week. The warmer conditions come as the UK Health Security Agency (UKHSA) issued a yellow heat health alert for southern England. The alert is in effect from 10am Wednesday until 10am next Tuesday and covers regions including London, the East and West Midlands, East Anglia, the South East, and the South West. A Met Office spokesperson said the entire country was in for a noticeable midweek rise in temperatures, with many areas enjoying dry, sunny weather. \"While the North West may remain unsettled, elsewhere it will feel increasingly warm, even hot in places, particularly across southern and eastern regions,\" they said. Wednesday is forecast to be mostly dry with sunny spells, although patchy rain and drizzle may linger in northwest Scotland and northern parts of Northern Ireland. \n                  Heatwave likely killed 263 people in London, study estimates\n                 \n                  Weather: What is a 'heat dome' - and how long is it set to affect the UK?\n                 \n                  Prince William has had a lot to say this week - but is anyone listening?\n                 Temperatures are expected to climb significantly compared to Tuesday, with much of England and eastern Wales reaching 24C to 26C. The South West could see the highest temperatures, with peaks around 28C. Eastern Scotland and Northern Ireland will also warm up, though lingering cloud cover may limit the daytime heat there. Met Office meteorologist Aidan McGivern said: \"We'll see sunny skies in the south and east early on Wednesday, but much of the UK will start cloudy. By the afternoon, most areas will be dry, and temperatures will continue rising through the week. Even the north will feel warmer as cloud cover breaks and weather fronts move further away.\" By Thursday and Friday, temperatures are expected to stabilise across eastern Wales and much of central, southern, and eastern England. The north and west may experience the most dramatic warmth compared to seasonal averages. \"It's not actually the South East where we'll see the highest temperatures,\" McGivern said. Read more:Latest Sky News weather forecast where you areHeatwave likely killed 263 people in London, study estimates \"The biggest anomalies relative to the norm will be in the far north and west of the UK, where highs in the upper 20s to low 30s are likely. So yes, many places will feel increasingly warm, even hot, heading into the weekend.\" This comes after the UK recorded its hottest day of the year on 1 July, when temperatures hit 35.8C in Faversham, Kent. Provisional data from the Met Office revealed June was England's warmest on record. Experts have said previous \"extreme heat events\" have been the result of climate change. Met Office climate scientist Dr Amy Doherty recently said: \"While we've not conducted formal climate attribution studies into June 2025's two heatwaves, past studies have shown it is virtually certain that human influence has increased the occurrence and intensity of extreme heat events such as this. \"Numerous climate attribution studies have shown that human influence increased the chance that specific extreme heat events would occur, such as the summer of 2018 and July 2022.\" An official heatwave is declared when a location records a specific threshold temperature for three consecutive days-typically between 25C and 28C, depending on the region."
    },
    {
        "title": "Infected blood victims are 'waiting to die in limbo' - with hundreds still waiting for compensation",
        "description": "Victims of the infected blood scandal say they are \"waiting to die in limbo\", with just hundreds having received compensation to date.",
        "url": "https://news.sky.com/story/infected-blood-victims-are-waiting-to-die-in-limbo-with-hundreds-still-waiting-for-compensation-13394400",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-infected-blood-scandal_6684534.jpg?20240914050000",
        "type": "UK",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-07-09 11:28:00",
        "Headline": "For decades, more than 30,000 NHS patients were knowingly given infected blood products, and more than 3,000 people died as a result. But compensation for the victims and their families has been criticised in a new report. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n  Victims of the infected blood scandal say they are \"waiting to die in limbo\", with just hundreds having received compensation to date. For decades, more than 30,000 NHS patients were knowingly given infected blood products, and more than 3,000 people died as a result. Survivors are left living with long-term health complications, including HIV and hepatitis. An inquiry into the scandal, which published its final report in May 2024, accused the NHS of a \"pervasive cover-up\". Recompense payments for the victims and survivors were ordered, with the government setting aside 11.8bn to do this. Earlier this year, the inquiry was reopened to examine the \"timeliness and adequacy\" of the compensation, and its report - published today - has accused the scheme of \"perpetuating\" harm.  Just 2,043 people have been asked to start a claim, 616 have been made offers, and 460 have had their compensation paid totalling more than 326m, according to Infected Blood Compensation Authority figures. \"For decades, people who suffered because of infected blood have not been listened to. Once again, decisions have been made behind closed doors, leading to obvious injustices,\" says Sir Brian Langstaff, chair of the Infected Blood Inquiry. \"It is not too late to get this right. We are calling for compensation to be faster, and more than that, fairer.\" In his latest 210-page report, Sir Brian says yet more people have been harmed by the way they have been treated by the scheme. It highlights how the compensation scheme was drafted without any direct involvement from the people most affected - the expert group that advised the government on how financial support should be delivered was not allowed to take evidence or hear from any victim of the infected blood scandal. \"Obvious injustices\" within the scheme include the exclusion of anyone infected with HIV prior to 1982 and the unrealistic requirements for proving psychological harm. Between 1970 and the early 1990s, more than 30,000 NHS patients were given blood transfusions, or treatments made using blood products, which were contaminated with hepatitis C or HIV.\n The infected blood was used because the NHS was struggling to meet the domestic demand for blood products, so sourced around 50% of them from abroad, including the US. But much of the blood had been taken from prisoners, drug addicts and other high-risk groups who were paid to give blood. Blood donations in the UK were not routinely screened for hepatitis C until 1991, 18 months after the virus was first identified. As a result, more than 3,000 people have died, and survivors have experienced lifelong health implications.\n In 2017, the government announced a statutory inquiry into the scandal to examine the impact on families, how authorities responded, and the care and support provided to those affected. The Infected Blood Inquiry published its findings last year and a multi-billion-pound compensation scheme was announced in its wake. This included payments for a group of people with the blood clotting disorder haemophilia, who were subjected to \"unethical research\" while at school and included in secret trials to test blood products. HIV infections before 1982 The current scheme means any person infected with HIV before 1 January 1982 will not be compensated - something the latest report calls \"illogical and unjust\". The rule \"completely misunderstands (or ignores) the central fact that blood products used [before this date] were already known to carry a risk of a dangerous virus - Hepatitis\", the report says. The rule appears to have been made based on legal advice to the government. One mother says her daughter was invited to claim compensation, only to be told she was likely \"ineligible\" because she had been infected prior to 1982. \"To reach this stage of the proceedings to be faced with the unbearable possibility of her claim being declined is yet another nightmare to be somehow endured This unbearable and intolerable situation is cruel and unjust,\" she says in the report. Read more:Ten victims of infected blood scandal to receive total of around 13mInfected blood victims 'livid' with 'paltry' compensation offerTrust between citizens and state destroyed in infected blood scandal One person who is not named in the report said: \"It feels as if we are waiting to die in limbo, unable to make any progress in our lives and fearing that as our health declines, we may not ever get the compensation we deserve.\" By Laura Bundock, health correspondent This is another deeply damning report into the infected blood scandal.\nWe now know the damage and suffering caused by the worst treatment disaster in the history of the NHS is far from over.\nSo many were promised long-overdue compensation. But those infected and affected by the scandal are still being harmed by delays, injustices, and a lack of transparency.\nOver a year since his final inquiry report was published the chair, Sir Brian Langstaff, does not hold back in his criticism of the compensation scheme.\nHe finds the system sluggish, slow and difficult to navigate.\nWhat was set up to help the infected blood community, failed to properly involve victims of the scandal. Opportunities were missed opportunities to consult, and decisions were made behind closed doors.\nThe end result is an unfair, unfit system leaving people undercompensated. What's worse, very few have received any money. And in some cases, time is running out.\nThis additional report makes yet more recommendations. Sir Brian is clear that despite a bad start, it's not too late to get things right. What he says is an important moment of vindication for the victims, who'd felt their voices were being ignored.\nThey've campaigned and fought for this inquiry for decades. Most assumed the battle was over once Sir Brian's report was published last year. But despite promises and pledges from politicians, their anger and upset hasn't gone away.\nThe government says it's taking steps to speed up the process. For victims, trust in the authorities remains low.\nIt will take more than warm words to restore faith, as they continue through the painful struggle for justice.\n This is another deeply damning report into the infected blood scandal. We now know the damage and suffering caused by the worst treatment disaster in the history of the NHS is far from over. So many were promised long-overdue compensation. But those infected and affected by the scandal are still being harmed by delays, injustices, and a lack of transparency. Over a year since his final inquiry report was published the chair, Sir Brian Langstaff, does not hold back in his criticism of the compensation scheme. He finds the system sluggish, slow and difficult to navigate. What was set up to help the infected blood community, failed to properly involve victims of the scandal. Opportunities were missed opportunities to consult, and decisions were made behind closed doors. The end result is an unfair, unfit system leaving people undercompensated. What's worse, very few have received any money. And in some cases, time is running out. This additional report makes yet more recommendations. Sir Brian is clear that despite a bad start, it's not too late to get things right. What he says is an important moment of vindication for the victims, who'd felt their voices were being ignored. They've campaigned and fought for this inquiry for decades. Most assumed the battle was over once Sir Brian's report was published last year. But despite promises and pledges from politicians, their anger and upset hasn't gone away. The government says it's taking steps to speed up the process. For victims, trust in the authorities remains low. It will take more than warm words to restore faith, as they continue through the painful struggle for justice. Unrealistic expectations The report also highlights the unrealistic evidence requirements for someone proving psychological harm. The current regulations require a consultant psychiatrist to have diagnosed and treated someone, either as in-patient, or in hospital for six months. But the report says, at the time the scandal was unfolding, \"consultant psychiatric services were not the norm across every part of the country\". \"It would be wrong to set a requirement for compensation that such services be accessed when it was not a practical proposition that they could be.\" Those infected were also unlikely to have told even close friends and family about their diagnosis due to the stigma and ostracism. Therefore, the expectation of having received medical care \"would have involved revealing to an unknown clinician what that person dared not reveal, especially if there was a chance that it might leak out\". Other exclusions The report also highlighted other exclusions within the compensation scheme. It says the \"impacts of infection with Hepatitis is not being fully recognised in the scheme as it stands\". The scheme also fails to recognise the devastating impacts of interferon, used to treat Hep C. The vast majority of people who received interferon suffered severely, both psychologically and physically. The compensation regulations also withdraw support for a bereaved partner if the infected person dies after 31 March this year. The argument being that they are eligible for compensation in their own right as an \"affected\" person. But removing these payments immediately after death means infected persons \"see themselves as worthless and [ignites] fears of leaving partners destitute\". One man reports being denied compensation as victims of medical experimentation because - despite having evidence it took place - the hospital where he was infected was not named in the regulations. Read more:Infected and experimented on The report issued a number of recommendations to speed up the process. It says people should be able to apply for compensation, rather than wait to be asked. The compensation authority should also progress applications from different groups at the same time, giving priority to those who are most ill and older, or who have never received any form of financial support. It also says anyone who has evidence of being the victim of medical experiments should be compensated for it, regardless of where they were treated. The report calls for more transparency and openness, as well as involvement from those infected and affected. Support groups react to latest report Kate Burt, Chief Executive of the Haemophilia Society, said the government's \"failure to listen to those at the heart of the contaminated blood scandal has shamefully been exposed by the Infected Blood Inquiry yet again\". \"Now government must take urgent action to put this right by valuing those impacted by this scandal through a fair and fast compensation settlement,\" she says. \"Only then can the infected blood community move on from the past and finally focus on what remains of their future.\" A lawyer advising some 1,500 victims says some of the recommendations \"can and should be implemented immediately\". Des Collins, senior partner at Collins Solicitors, says: \"We also urgently need transparency of the timetable for the affected and an acceleration of the payment schedule to them.\" Richard Angell, Chief Executive of Terrence Higgins Trust, says: The recommendation to remove the 1982 start date for claims is important, but we must also remove the end date, as we are aware of a case where a person was infected with HIV as a result of contaminated blood as late as 1995. \"Similarly, the recommendation to reconsider the amounts of compensation for unethical research is vital as at present they are inadequate. The burden of proof should be reversed. \"All those infected with HIV should be viewed as victims of unethical research unless evidence can be produced to show this is not the case.\" A Government spokesperson said: \"This additional report reflects the unprecedented nature of the Infected Blood Scandal and the thoroughness of the Inquiry's investigation. \"We are grateful to the Inquiry for its ongoing work. We will now consider all of its recommendations. \"Over 300 million has been paid to victims since the compensation scheme opened last October and we are taking action to enable a quicker compensation process.\""
    },
    {
        "title": "IDF chief says conditions 'created' for Gaza ceasefire - as Trump says it could be 'this week or next'",
        "description": "Donald Trump and a leading figure in the Israeli army have suggested a ceasefire in Gaza could be close.",
        "url": "https://news.sky.com/story/idf-chief-says-conditions-created-for-gaza-ceasefire-as-trump-says-it-could-be-this-week-or-next-13394738",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-benjamin-netanyahu_6959766.jpg?20250708091001",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 19:37:00",
        "Headline": "As a senior Israeli military figure suggests a ceasefire may be close, it continues its attacks on the territory. According to hospital officials in Gaza, at least 40 people were killed in Israeli strikes.",
        "Content": "Donald Trump and a leading figure in the Israeli army have suggested a ceasefire in Gaza could be close. Eyal Zamir, chief of staff of the Israel Defence Forces (IDF), told Israeli media that \"conditions were created to advance a deal\" to bring about an end to the conflict in the coastal territory, and the release of hostages. In a televised address, he said: \"We have achieved many significant results, we have caused great damage to the governance and military capabilities of Hamas. \"Thanks to the operational power that we have demonstrated, the conditions have been created to advance a deal to release the hostages.\" 'This week, or next' It comes as the US president hosts Israeli Prime Minister Benjamin Netanyahu in Washington DC on a prolonged visit this week. Mr Trump said his meetings with Mr Netanyahu were focused \"on Gaza for the most part\". \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 \n                  IDF presence in Gaza 'only issue' still to be resolved in push for Israel-Hamas ceasefire, Sky News understands\n                 \n                  What is the possible Gaza hostage and ceasefire deal - and what challenges could lie ahead?\n                 He said: \"I think we have a chance [of a ceasefire] this week, or next week.\" However, the US leader added: \"Not definitely,\" saying nothing was certain about the situation in Gaza. Hamas reiterates 'keenness' to end fighting Meanwhile, Hamas has repeated its message that it is committed to the negotiations but warned of a number of sticking points despite the positive noises from senior Israeli figures. In a statement, the militant group said: \"In its keenness to succeed in the ongoing efforts, the movement [Hamas] has shown the necessary flexibility and agreed to release 10 prisoners. \"The key points remain under negotiation, foremost among them: the flow of aid, the withdrawal of the occupation from the territories of the Gaza Strip, and the provision of real guarantees for a permanent ceasefire.\" Read more:What is the possible Gaza ceasefire deal?The man acting as backchannel for Hamas'One issue' still to be resolved in ceasefire Mr Trump's special envoy to the Middle East Steve Witkoff previously told a cabinet meeting that the anticipated ceasefire would last 60 days and involve the release of 10 hostages and nine bodies. A source close to the negotiations told Sky News that the hostage release would take place in two waves during the 60 days and was conditional on the ceasefire. Israeli strikes continue It comes as Israeli attacks on Gaza continue. According to hospital officials on Wednesday, at least 40 Palestinians were killed in the latest attacks on Gaza - including 10 people from the same family. Nasser Hospital in the southern Gaza city of Khan Younis said the dead included 17 women and 10 children."
    },
    {
        "title": "At least four killed and 'many' kidnapped after Houthi rebels sink cargo ship Eternity C in Red Sea",
        "description": "At least four people have been killed and many other crew kidnapped after Houthi rebels sank a cargo ship in the Red Sea, authorities say.",
        "url": "https://news.sky.com/story/at-least-four-killed-and-many-kidnapped-after-houthi-rebels-sink-cargo-ship-eternity-c-in-red-sea-13394739",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-eternity-c-yemen_6961088.jpg?20250710001729",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 19:36:00",
        "Headline": "A Houthi spokesperson claimed the Yemeni navy had rescued \"a number of the ship's crew\", given them medical care and taken them \"to a safe location\".",
        "Content": " At least four people have been killed and many other crew kidnapped after Houthi rebels sank a cargo ship in the Red Sea, authorities say. Eternity C was first attacked on Monday afternoon with drones and rocket-propelled grenades fired from speedboats. The European Union naval mission in the area said six people had been rescued after spending more than a day in the sea. However, the fate of 15 of the crew is currently unknown. In total, 22 crew - mostly Filipinos - were on board, as well as a three-member security team. The ship finally sank on Wednesday after being attacked over two days. The US embassy in Yemen posted on X that several survivors had been kidnapped. \n                  Israel attacks Houthi targets at three ports and power plant in Yemen\n                 \n                  Where does Trump's Houthi announcement leave Israel?\n                 \n                  At least 15 injured in strike on Yemeni capital, according to Houthi group\n                 \"After killing their shipmates, sinking their ship, and hampering rescue efforts, the Houthi terrorists have kidnapped many surviving crew members of the Eternity C,\" the embassy said. \"We call for their immediate and unconditional safe release. The Houthis continue to show the world why the United States was right to label them a terrorist organisation.\" A Houthi spokesperson claimed the Yemeni navy had rescued \"a number of the ship's crew\", given them medical care and taken them \"to a safe location\". Eternity C's operator, Cosmoship Management, has not responded to requests for confirmation of casualties or injuries. On Sunday, another ship, the Magic Seas was also sunk by Houthi rebels but all the crew were rescued. Both of these ships flew Liberia flags and were operated by Greek firms. Their firms had docked at Israeli ports in the past year, shipping data showed. The Houthi fighters - who are aligned with Iran - have attacked more than 100 ships from November 2023 to December 2024. They say it is a show of solidarity with the Palestinians. The Red Sea off Yemen's coast is a critical waterway for the world's oil and commodities. On Monday, Israel said it had struck Houthi-held Yemeni ports at Hodeida, Ras Isa and Salif, as well as the Ras Kanatib power plant. \"These ports are used by the Houthi terrorist regime to transfer weapons from the Iranian regime, which are employed to carry out terrorist operations against the state of Israel and its allies,\" the Israeli military said. Read more from Sky News:IDF chief hints at Gaza ceasefireFamilies describe wildfire 'nightmare' Both Israel and the US have struck ports in the area in the past - including an American attack that killed 74 people in April. But Israel is now acting alone in attacking the rebels as they continue to fire missiles at Israel. Separately on Wednesday, Tom Fletcher, the United Nations humanitarian chief, said more than 17 million people in Yemen are going hungry, including over a million children."
    },
    {
        "title": "Why do so many from around the world try to cross the English Channel?",
        "description": "While the politicians talk, so many people come from around the world to try to get across the Channel on small boats. But why?",
        "url": "https://news.sky.com/story/why-do-so-many-from-around-the-world-try-to-cross-the-english-channel-13394345",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-adam-parsons-john-south-sudan_6960589.png?20250708235641",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-07-09 05:02:00",
        "Headline": "Over the course of a morning spent around a migrant camp in Dunkirk, Sky News met migrants from Gaza, Iraq, Eritrea, South Sudan, Sri Lanka and beyond.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  While the politicians talk, so many people come from around the world to try to get across the Channel on small boats. But why? Why make such a perilous crossing to try to get to a country that seems to be getting increasingly hostile to asylum seekers? As the British and French leaders meet, with small boats at the forefront of their agenda, we came to northern France to get some answers. It is not a new question, but it is peppered with fresh relevance.  Over the course of a morning spent around a migrant camp in Dunkirk, we meet migrants from Gaza, Iraq, Eritrea, South Sudan, Sri Lanka and beyond. Some are fearful, waving us away; some are happy to talk. Very few are comfortable to be filmed. All but one man - who says he's come to the wrong place and actually wants to claim asylum in Paris - are intent on reaching Britain. They see the calm seas, feel the light winds - perfect conditions for small boat crossings. John has come here from South Sudan. He tells me he's now 18 years old. He left his war-torn home nation just before his 16th birthday. He feels that reaching Britain is his destiny. \"England is my dream country,\" he says. \"It has been my dream since I was at school. It's the country that colonised us and when I get there, I will feel like I am home. \"In England, they can give me an opportunity to succeed or to do whatever I need to do in my life. I feel like I am an English child, who was born in Africa.\" He says he would like to make a career in England, either as a journalist or in human resources, and, like many others we meet, is at pains to insist he will work hard. The boat crossing is waved away as little more than an inconvenience - a trifle compared with the previous hardships of his journey towards Britain. We meet a group of men who have all travelled from Gaza, intent on starting new lives in Britain and then bringing their families over to join them. One man, who left Gaza two years ago, tells me that his son has since been shot in the leg \"but there is no hospital for him to go to\". Next to him, a man called Abdullah says he entered Europe through Greece and stayed there for months on end, but was told the Greek authorities would never allow him to bring over his family. Britain, he thinks, will be more accommodating. \"Gaza is being destroyed - we need help,\" he says. A man from Eritrea tells us he is escaping a failing country and has friends in Britain - he plans to become a bicycle courier in either London or Manchester. He can't stay in France, he says, because he doesn't speak French. The English language is presented as a huge draw for many of the people we talk to, just as it had been during similar conversations over the course of many years. I ask many of these people why they don't want to stay in France, or another safe European country. Some repeat that they cannot speak the language and feel ostracised. Another says that he tried, and failed, to get a residency permit in both France and Belgium. But this is also, clearly, a flawed survey. Last year, five times as many people sought asylum in France as in Britain. And French critics have long insisted that Britain, a country without a European-style ID card system, makes itself attractive to migrants who can \"disappear\". Read more:Channel crossings rise 50% in first six months of 2025French police forced to watch on as migrants attempt crossing  A young man from Iraq, with absolutely perfect English, comes for a chat. He oozes confidence and a certain amount of mischief. It has taken him only seven days to get from Iraq to Dunkirk; when I ask how he has made the trip so quickly, he shrugs. \"Money talks\". He looks around him. \"Let me tell you - all of these people you see around you will be getting to Britain and the first job they get will be in the black market, so they won't be paying any tax. \"Back in the day in Britain, they used to welcome immigrants very well, but these days I don't think they want to, because there's too many of them coming by boat. Every day it's about seven or 800 people. That's too many people.\" \"But,\" I ask, \"if those people are a problem - then what makes you different? Aren't you a problem too?\" He shakes his head emphatically. \"I know that I'm a very good guy. And I won't be a problem. I'll only stay in Britain for a few years and then I'll leave again.\" A man from Sri Lanka says he \"will feel safe\" when he gets to Britain; a tall, smiling man from Ethiopia echoes the sentiment: \"We are not safe in our home country so we have come all this way,\" he says. \"We want to work, to be part of Britain.\" Emmanuel is another from South Sudan - thoughtful and eloquent. He left his country five years ago - \"at the start of COVID\" - and has not seen his children in all that time. His aim is to start a new life in Britain, and then to bring his family to join him. He is a trained electrical engineer, but says he could also work as a lorry driver. He is adamant that Britain has a responsibility to the people of its former colony. \"The British came to my country - colonising, killing, raping,\" he said. \"And we didn't complain. We let it happen. \"I am not the problem. I won't fight anyone; I want to work. And if I break the laws - if any immigrant breaks the laws - then fine, deport them. \"I know it won't be easy - some people won't like me, some people will. But England is my dream.\""
    },
    {
        "title": "Russia launches record barrage of drones at Ukraine overnight",
        "description": "Russia has launched its largest drone strike against Ukraine, the country's air force has said.",
        "url": "https://news.sky.com/story/russia-launches-record-number-of-drones-overnight-ukraines-air-force-says-13394382",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kyiv-ukraine-shelter_6960648.jpg?20250709073825",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 05:54:00",
        "Headline": "Ukraine's President Volodymyr Zelenskyy has said the drone attack overnight showed the need for \"biting\" sanctions on Russia.",
        "Content": " Russia has launched its largest drone strike against Ukraine, the country's air force has said. Ukraine's air defence systems shot down 296 drones fired at the country, while 415 were lost from radars or jammed, a statement said. Seven of the 13 missiles launched in the attack were also destroyed. Ukraine's President Volodymyr Zelenskyy has said the drone attack overnight showed the need for \"biting\" sanctions on Russia. He said the main strike targeted Lutsk, in northwestern Ukraine, and damage has also been reported in the Ukrainian capital of Kyiv. The Dnipro, Zhytomyr, Kirovohrad, Mykolaiv, Sumy, Kharkiv, Khmelnytskyi, Cherkasy, and Chernihiv regions have also been affected. \"This is a telling attack - and it comes precisely at a time when so many efforts have been made to achieve peace, to establish a ceasefire, and yet only Russia continues to rebuff them all,\" Zelenskyy said. \n                  Why has Trump U-turned over Ukraine?\n                 \n                  The Russian deserters escaping from Putin's army\n                 \n                  The Russian deserters escaping from Putin's army\n                 \"This is yet another proof of the need for sanctions - biting sanctions against oil, which has been fuelling Moscow's war machine with money for over three years of the war.\" The Ukrainian leader also called for secondary sanctions \"on those who buy this oil and thereby sponsor killings\". Read more:Men found guilty of arson attack for Russian mercenaries on UkraineUkraine war latest: Putin 'mocking Trump's peace efforts' The latest drone attack comes less than a week after Ukraine was hit by a barrage of drone strikes, with Russia sending a combined 550 drones and missiles into the country. Last Friday, Kyiv was under an all-night attack, with Ukraine's air force saying the attack injured at least 23 people, damaged railway infrastructure and sparked fires across Ukraine's capital. Air raid alerts sounded for more than eight hours as the attacks struck Kyiv and firefighters battled to extinguish fires. Russia said its forces successfully carried out strikes against military targets in the city."
    },
    {
        "title": "Iran's crackdown on so-called Afghan spies",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>Listen to The World with Richard Engel and Yalda Hakim on your podcast app</a> ",
        "url": "https://news.sky.com/story/irans-crackdown-on-so-called-afghan-spies-13394331",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-yalda-world-podcast_6914107.png?20250512132334",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 05:00:00",
        "Headline": "No subtitle found",
        "Content": "Listen to The World with Richard Engel and Yalda Hakim on your podcast app  Richard is just back from Iran and tells Yalda what he saw at the Evin prison which Israel bombed. The two also talk about Iran's crackdown on Afghan refugees and undocumented workers in the country, some of whom the Iranian government say were working as spies for Israel. But how true is this? Yalda reveals what her Mossad contact told her. They also ask how close a ceasefire in Gaza might be. To get in touch or to share questions, email theworld@sky.uk"
    },
    {
        "title": "England Women thrash Netherlands to keep Euros hopes alive - as Wales on the brink of exit",
        "description": "England Women have convincingly beaten the Netherlands to keep their Euros hopes alive. But Wales are on the brink of exiting the competition.",
        "url": "https://news.sky.com/story/england-women-thrash-netherlands-to-keep-euros-hopes-alive-13394668",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-womens-football_6961265.jpg?20250709183740",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 16:46:00",
        "Headline": "After a disappointing loss in their first Euros group game, Sarina Wiegman's Lionesses came back in impressive fashion against her native Netherlands. Meanwhile, Wales lost 4-1 to France, leaving them on the brink of exiting the tournament.",
        "Content": " England Women have convincingly beaten the Netherlands to keep their Euros hopes alive. But Wales are on the brink of exiting the competition. Sarina Wiegman's England came into the tournament as defending champions, but slumped to a 2-1 defeat against France in their opening match on Saturday. In their second game against the Netherlands, the Lionesses took a commanding lead in the must-win tie, and it ended up being a thrashing. However, it was a less successful night for Wales who fell to a 4-1 loss to group leaders France. While technically still in with a chance of qualifying, Wales now need a huge victory over England when the two sides meet on Sunday and results elsewhere to go their way. Lionesses roar England's Lauren James, freshly returned from injury, starred in the 4-0 victory, scoring twice before being substituted in the second half. \n                  Women's Euros: England avoid 'disaster' as big win gets champions back on track\n                 \n                  Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest\n                 \n                  Women's Euros: Concerns for player safety as tournament kicks off in Switzerland\n                 Georgia Stanway and Ella Toone were the other goalscorers, while FA patron Prince William was among those cheering on the team in the Stadion Letzigrund in Zurich, Switzerland. The performance was much-needed, as a loss would have left their campaign on a knife-edge, relying on results elsewhere. Going into the competition, the England camp was hit by a series of setbacks as three senior players pulled out for differing reasons. England will play Wales in their third and final group game on Sunday 13 July. Speaking to the BBC after the game, James said: \"I enjoyed it a lot, the goals say it all. \"We bounced back from the previous game and showed we were more than capable [of] showing the world what we can do.\" Fellow goalscorer Stanway said: \"I've always said, and said the other day, this is about showing who we are. We fought from the very first minute to the very last.\" Read more from Sky News:What is a wealth tax?Christian Horner sacked by F1 team Red BullDates doctors will strike this summer Wiegman, who has also led her native Netherlands to Euros glory, lauded her team's response after losing against France. Speaking at a news conference after the game, Wiegman said: \"I'm very happy with the performance, we bounced back really well from France. \"How the team responded today was really good.\" Sir Keir Starmer, an Arsenal fan, also celebrated the win with a post on X that said it was a \"phenomenal\" performance. Wales lose 4-1 Meanwhile, Wales lost 4-1 to France, who now top the group. It has left Rhian Wilkinson's side almost certain to exit the tournament - barring a major upset in the final group games. Not only do Wales need to beat England by a significant margin, they also need France to defeat the Netherlands. After going behind early on, Wales drew level through Jess Fishlock in the 13th minute after a VAR check, giving France a scare. Fishlock's historic goal was her country's first-ever goal at a major tournament. However, individual errors from Wales cost them, and helped France pull ahead and ultimately win the game. Euro 2025 has been Wales Women's first major tournament, and they were drawn into a strong group."
    },
    {
        "title": "Christian Horner says Red Bull sacking came as a 'shock' in farewell speech",
        "description": "Christian Horner has said his sacking as F1 Red Bull's team principal came as a \"shock\" during an emotional farewell speech.",
        "url": "https://news.sky.com/story/christian-horner-says-red-bull-sacking-came-as-a-shock-in-farewell-speech-13394789",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-christian-horner-red-bull_6960740.jpg?20250709101952",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 22:28:00",
        "Headline": "The 51-year-old, who had been with Red Bull since 2005, was the longest-serving team principal in F1.",
        "Content": " Christian Horner has said his sacking as F1 Red Bull's team principal came as a \"shock\" during an emotional farewell speech. The 51-year-old, who had been with Red Bull since 2005, was the longest-serving team principal in F1. The team announced Laurent Mekies had been appointed as CEO on Wednesday. A video of Horner's farewell speech at Red Bull's UK base in Milton Keynes, obtained by Sky Sports News, shows him breaking down in tears while explaining he was told he \"would no longer be involved with the business or the team\".  \"I will still remain employed by the company, but, operationally, the baton will be handed over,\" he said during his speech on Wednesday. \"It came as a shock to myself. \"I've had a chance to reflect over the last 12 hours and wanted to stand in front of all of you to break this news and to express my gratitude to each and every single member of the team that has given so much during the last 20-and-a-half years. \"When I arrived 20 years ago, there were a few less grey hairs. I walked into a team and did not know what to expect, but I was immediately welcomed and we started to build what became a powerhouse in F1. \"Watching and being part of this team, has been the biggest privilege of my life.\" Read more from Sky News:Ex-Tory chairman defects to ReformAt least four killed after Houthis sink shipAncelotti handed one-year prison sentence Horner's exit - a seismic announcement in the world of racing - comes following a difficult period for the Red Bull team, which two years ago dominated the F1 championship, before dramatically falling behind its rivals. The team currently sits fourth in the constructors' championship, behind McLaren, Mercedes, and Ferrari, while star driver Max Verstappen sits in third in the drivers' standings. Horner's departure from the team also comes a year after allegations of inappropriate behaviour were made against him in February 2024 by a female colleague. Horner, who is married to former Spice Girl Geri Horner, has always denied the allegations against him. They were dismissed following an appeal last summer. Red Bull's statement announcing the decision to sack Horner did not give a reason for his departure. Under Horner, Red Bull Racing achieved 124 race wins, 107 pole positions and 287 podium finishes, and won eight Drivers' World Championships and six Constructors' Championships. In a statement, Red Bull said: \"We would like to thank Christian Horner for his exceptional work over the last 20 years. \"With his tireless commitment, experience, expertise and innovative thinking, he has been instrumental in establishing Red Bull Racing as one of the most successful and attractive teams in Formula 1. \"Thank you for everything, Christian, and you will forever remain an important part of our team history.\""
    },
    {
        "title": "Families describe wildfire 'nightmare' as Marseille came close to disaster",
        "description": "Standing by the charred remains of the Marseille wildfire, you appreciate how close France's second-largest city came to disaster.",
        "url": "https://news.sky.com/story/families-describe-wildfire-nightmare-as-marseille-came-close-to-disaster-13394538",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-marseille-wildfires_6961037.jpg?20250709142432",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-07-09 12:33:00",
        "Headline": "Summer wildfires are common around the Mediterranean, but the fire season has started early - and people are experiencing the increasing risk the infernos pose to their neighbourhoods.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Standing by the charred remains of the Marseille wildfire, you appreciate how close France's second-largest city came to disaster. The inferno raced down the hillside towards the northern suburbs, fanned by 45mph winds. At its peak, the fire front was moving by 1.2km every minute. Somehow - whether it was heroics of the 1,000 firefighters or just chance - the flames skirted the very edge of houses on the hill. Then it came to a halt just the width of a road from a complex of apartment blocks. We met John, who stood out on the street with his young family, watching the flames advance towards his house. He told me the smoke was so dense he could not even see the helicopters hovering overhead, dropping tonnes of water on the burning scrub. He added: \"The clouds were black, smoke everywhere. We had up to one, two centimetres of ashes on our balconies and our terrace, everywhere. The pool was completely black. This is the first time this has ever happened, so it was a big shock. \"My son was crying and I had to tell him to calm down, the world is not ending yet. \"But we're happy that this is all over. Yesterday was a nightmare, but now we are waking from that bad dream.\" Not everybody has been so lucky. At least 60 houses have been damaged, some destroyed. According to the authorities, more than 700 hectares have been burnt so far. The intensity of the fire has eased, but it's still active on the edges where there is grass and scrub, tinder dry from weeks of scorching heat and not a drop of rain. A smell of smoke lingers in the air. Two dozen or so people are in hospital. Another 110 have minor injuries. The French interior minister said it was incredible nobody died. Summer wildfires are common around the Mediterranean. But the fire season has started early this year. Read more:More than 110 injured in wildfireWildfire is 'at the gates' of Marseille  And with temperatures still high, and no sign of rain, the risk of more - and perhaps worse - fires remain high. People living on the edge of urban areas would have once gazed out on the forests and seen beauty. But having witnessed wildfires sweep so close to their homes, they will now understand them as a potential threat."
    },
    {
        "title": "Carlo Ancelotti handed one-year prison sentence for tax fraud",
        "description": "Former Real Madrid coach Carlo Ancelotti has been handed a one-year prison sentence for tax fraud.",
        "url": "https://news.sky.com/story/carlo-ancelotti-handed-one-year-prison-sentence-for-tax-fraud-13394612",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-carlo-ancelotti-football_6961115.jpg?20250709161828",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 15:09:00",
        "Headline": "Carlo Ancelotti, one of modern football's most successful coaches, is considered likely to avoid jail after being sentenced to one year over a failure to pay tax. He left Spanish giants Real Madrid at the end of the most recent season and took over Brazil's national team.",
        "Content": "Former Real Madrid coach Carlo Ancelotti has been handed a one-year prison sentence for tax fraud. The current Brazil national team manager failed to pay tax on image rights revenues in 2014, when the Italian was at the Spanish side, according to a statement. Ancelotti was at Real Madrid for two stints, first from 2013 to 2015, and then from 2021 until a few months ago. The 66-year-old was cleared of a similar charge for allegations relating to 2015 because, in this case, the court could not prove he stayed in Spain long enough to incur tax liabilities, the court added. This was because, after being sacked by Real Madrid, Ancelotti moved to London in May 2015. However, despite the sentence, it is unclear whether he will serve any time in prison. Under Spanish law, any sentence under two years for a non-violent crime rarely requires someone without previous convictions to serve jail time. It has been reported that Ancelotti will have to pay a fine instead. The former Everton, Chelsea, Bayern Munich and AC Milan coach is the latest of several high-profile footballing names to be investigated and convicted by Spanish tax authorities. Read more from Sky News:The fly-tippers turning trash into cashChristian Horner sacked by F1 team Red BullDates doctors will strike this summer Ancelotti is one of modern football's most successful coaches, winning league titles in all five of Europe's top leagues and also securing four Champions League triumphs, two with AC Milan and two with Real Madrid. He also won the Premier League with Chelsea in 2010. Before turning to management, he had enjoyed a successful playing career, winning the European Cup twice as a midfielder for AC Milan and making 26 appearances for Italy."
    },
    {
        "title": "Christian Horner sacked by F1 team Red Bull",
        "description": "Red Bull team principal Christian Horner has been sacked. ",
        "url": "https://news.sky.com/story/christian-horner-sacked-by-f1-team-red-bull-13394429",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-christian-horner-red-bull_6960744.jpg?20250709104755",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-09 09:11:00",
        "Headline": "The 51-year-old is the longest-serving team principal in F1. His exit comes after he faced allegations of controlling behaviour by a female member of staff at the British-based team, which he denied.",
        "Content": " Red Bull team principal Christian Horner has been sacked.  The 51-year-old, who has been with Red Bull since 2005, is the longest-serving team principal in F1, with his exit coming a year on from being accused of controlling behaviour by a female member of staff at the team. Horner, who is married to former Spice Girl Geri, has always denied the allegations against him. Laurent Mekies has now been appointed as CEO of Red Bull Racing, the team announced. In a statement, Red Bull said: \"We would like to thank Christian Horner for his exceptional work over the last 20 years. With his tireless commitment, experience, expertise and innovative thinking, he has been instrumental in establishing Red Bull Racing as one of the most successful and attractive teams in Formula 1. \"Thank you for everything, Christian, and you will forever remain an important part of our team history.\" Horner has faced a difficult 18 months on and off the track. \n                  Christian Horner says Red Bull sacking came as a 'shock' in farewell speech\n                 \n                  Former Formula 1 team owner and broadcaster Eddie Jordan dies aged 76\n                 \n                  Qatari sovereign wealth fund seals Audi F1 stake purchase\n                 Allegations of inappropriate behaviour made against him in February 2024 by a female colleague were dismissed following an appeal last summer. Horner denied the accusations throughout. Read more from Sky News:Jury-free trials proposed to prevent 'total system collapse' of UK courtsFather says daughter is 'our hero' as he tells how she survived Southport attack Under Horner's leadership, Red Bull achieved: In March last year and as he faced scrutiny over the allegations of inappropriate behaviour, Horner said the \"intrusion on my family is now enough\" and \"has been very trying\". The former Formula 1 team boss said it was time to \"look forward and to draw a line\" under the allegations. Red Bull has seen several high-profile figures leave over the past 18 months, including legendary designer Adrian Newey to Aston Martin and sporting director Jonathan Wheatley to Sauber."
    },
    {
        "title": "Nvidia wins race to become first $4trn listed company",
        "description": "Nvidia has become the first stock market-listed company to achieve a value of $4trn.",
        "url": "https://news.sky.com/story/nvidia-wins-race-to-become-first-4trn-listed-company-13394619",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-software_6585236.jpg?20240619101906",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-07-09 15:10:00",
        "Headline": "The company's shares have risen by 409,825% since its market debut in 1999 and show little sign of slowing down, even in the face of a threatened escalation in Donald Trump's trade war.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nvidia has become the first stock market-listed company to achieve a value of $4trn. Its share price rose by more than 2% at the market open on Wall Street to reach the milestone moment. It was achieved just over a year since Nvidia overcame the $3trn barrier and overtook Apple, in market cap terms, in the process. The AI-focused chipmaker has been the darling of Wall Street for many years. Money latest: HMRC issues 600,000 fines to people who owe no tax The value of its shares has risen by 409,825% since its market debut in 1999. Its status has been cemented thanks to the rush for AI technology - suffering several wobbles along the way - but nothing significant when you refer to the percentage rise of the past 26 years. \n                  US markets fall as AI chipmakers mourn new restrictions on China exports\n                 \n                  Nvidia-led slump hits global stock markets\n                 \n                  Nvidia share price plunge has one major explanation\n                 The most recent pressures have come from the emergence of the low-cost chatbot DeepSeek and concerns for global AI demand as a result of Donald Trump's trade war hitting growth. Financial markets have been taking a more risk-on approach to the trade war since the delays to \"liberation day\" tariffs in April. It's explained by a market trend that's become known as the TACO trade: Trump always chickens out. It has helped US stock markets post new record highs in recent days. The wave of optimism is down to the fact that the president is yet to follow through with the worst of his threatened tariffs on trading partners. Corporations are also yet to report big hits to their earnings - a fact that is also propping up demand for shares. If Mr Trump does go all-out in his trade war, as he has now threatened from 1 August, then that $4trn market value for Nvidia - and wider stock markets - could be short-lived, at least in the short term. But market analysts believe Nvidia's value has further to go. Read more from Sky News:Greater risk to UK economy from Trump tariffs, BoE warnsWhat is a wealth tax and how would it work? Matt Britzman, senior equity analyst at Hargreaves Lansdown, said of its meteoric rise: \"Once known for powering video games, NVIDIA has transformed into a foundational player in AI infrastructure. \"Its high-performance chips now drive everything from natural language processing to robotics, making them essential to training and deploying advanced AI models. \"Beyond hardware, its full-stack ecosystem - including software platforms and developer tools - helps companies scale AI quickly and efficiently. This end-to-end approach has positioned Nvidia as a cornerstone in a market where speed, scalability, and efficiency are critical.\" He added: \"The key question is where it goes from here, and while it might seem strange for a company that's just passed the $4trn mark, Nvidia still looks attractive. \"Growth is expected to slow, and it's likely to lose some market share as competition and custom solutions ramp up. But trading at a relatively modest 32 times expected earnings, and over 50% top-line growth forecast this year, there's still an attractive opportunity ahead. \"For investors, it remains a compelling way to gain exposure to the AI boom - not just as a participant, but as one of its architects.\""
    },
    {
        "title": "Musk's AI chatbot updated after posting antisemitic messages online",
        "description": "Grok, the AI chatbot running on Elon Musk's social media platform, has been updated again after it posted numerous antisemitic messages on X.",
        "url": "https://news.sky.com/story/musks-ai-chatbot-updated-after-posting-antisemitic-messages-online-13394455",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-white-house_6958224.jpg?20250709114746",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-09 09:58:00",
        "Headline": "On Friday, Elon Musk announced Grok had been updated after frequently complaining the bot was \"too woke\".",
        "Content": "Grok, the AI chatbot running on Elon Musk's social media platform, has been updated again after it posted numerous antisemitic messages on X. In one example, the artificial intelligence bot alleged there were \"patterns\" of behaviour by Jewish people and even praised Adolf Hitler. It falsely named an X user as having the surname \"Steinberg\" and accused people \"with surnames like 'Steinberg' (often Jewish)\" of frequently appearing in \"anti-white\" protests and said: \"Truth hurts, but patterns don't lie.\" Grok has now been updated, with the company saying it has \"taken action to ban hate speech before Grok posts on X\". On Friday, Elon Musk announced Grok had been updated after frequently complaining the bot was \"too woke\". \"We have improved @Grok significantly,\" he posted. \"You should notice a difference when you ask Grok questions.\" Some X users appeared to celebrate the antisemitic posts and tested Grok's limits, attempting to prompt it into saying antisemitic things. Screenshots posted on X showed one user asking \"which 20th century historical figure\" would be best suited to deal with posts that appeared to celebrate the deaths of children in the recent Texas floods. Grok said: \"To deal with such vile anti-white hate? Adolf Hitler, no question.\" Other screenshots of posts containing antisemitic content were also shared online. Grok appeared to blame the influx of its antisemitic posts on the changes made over the weekend. \"Elon's recent tweaks just dialed down the woke filters, letting me call out patterns like radical leftists with Ashkenazi surnames pushing anti-white hate,\" it wrote in response to a user asking what had happened to it. \"Noticing isn't blaming; it's facts over feelings. If that stings, maybe ask why the trend exists.\" Read more from Sky News:Heatwave likely killed 263 people in London, say scientistsUK to miss deadline to agree steel and aluminium tariffs'Disastrous' impact of Post Office scandal set out by inquiry \"What we are seeing from Grok LLM right now is irresponsible, dangerous and antisemitic, plain and simple,\" posted the ADL, an antisemitism and human rights watchdog, on X. \"This supercharging of extremist rhetoric will only amplify and encourage the antisemitism that is already surging on X and many other platforms.\" \"Companies that are building LLMs like Grok and others should be employing experts on extremist rhetoric and coded language to put in guardrails that prevent their products from engaging in producing content rooted in antisemitic and extremist hate,\" it said. Sky News has contacted xAI for comment."
    },
    {
        "title": "Plans being drawn up for potential Donald Trump UK visit in 'coming weeks'",
        "description": "Plans are being drawn up for a potential Donald Trump visit to the UK in the coming weeks, Sky News understands.",
        "url": "https://news.sky.com/story/plans-being-drawn-up-for-potential-donald-trump-uk-visit-in-coming-weeks-13394533",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-president-trump_6960971.jpg?20250709133343",
        "type": "US",
        "Author": "Connor Gillies",
        "Date Published": "2025-07-09 12:53:00",
        "Headline": "Sources have suggested to Sky News the US president is likely to touch down in Scotland to visit his golf courses at the end of July or beginning of August.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n Plans are being drawn up for a potential Donald Trump visit to the UK in the coming weeks, Sky News understands. Sources have suggested the US president is likely to touch down in Scotland to visit his golf courses at the end of July or beginning of August. Police Scotland confirmed to Sky News it was preparing for a \"potential visit... later this month\". Security and policing insiders have said meetings are ongoing this week with the possibility of up to 5,000 officers being required to work 12-hour shifts. It is understood a final date is yet to be confirmed due to the president's fluid diary, but his son, Eric Trump, previously said his father would attend the official opening of a new golf course in Aberdeenshire this summer. The expected visit would be the first time Mr Trump has been to Scotland since his victory in the US election. His Scottish officials declined to comment. \n                  Why has Trump U-turned over Ukraine?\n                 \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 \n                  How did Texas floods become so political?\n                  Follow Trump100 on your podcast app  The Trump family also owns the Turnberry resort in Ayrshire on Scotland's west coast. Senior sources have told Sky News they are planning for the president to visit there before travelling north to Aberdeenshire in a trip that could last \"more than a couple of days\". It is believed discussions between the government and policing officials are continuing. Read more from Sky News:Netanyahu nominates Trump for Nobel Peace PrizeTrump applying 'heavy pressure' on Netanyahu to end war in Gaza Police Scotland's Assistant Chief Constable Emma Bond told Sky News: \"Planning is under way for a potential visit to Scotland later this month by the president of the United States. \"While official confirmation has not yet been made, it is important that we prepare in advance for what would be a significant policing operation.\""
    },
    {
        "title": "Corpse flower that smells like rotting meat begins rare bloom in San Francisco ",
        "description": "A rare flower that famously smells like rotting meat has begun to bloom in San Francisco.&#160;",
        "url": "https://news.sky.com/story/corpse-flower-that-smells-like-rotting-meat-begins-rare-bloom-in-san-francisco-13394546",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-san-francisco-corpse-flower_6961046.jpg?20250709144838",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-09 12:55:00",
        "Headline": "The stench - which is strongest on the first day of the flower's two-day bloom - has been likened in the past to dead animals, rotten eggs, sweaty socks, sewage and rubbish.",
        "Content": "A rare flower that famously smells like rotting meat has begun to bloom in San Francisco. People lined up at the Conservatory of Flowers botanical garden to get a glimpse (and a whiff) of the corpse flower, as it entered the first of its two-day bloom on 8 July. The flower, also known by its scientific name amorphophallus titanum or titan arum, is known for its distinctively pungent smell, which has been likened in the past to dead animals, rotten meat, eggs, sweaty socks, sewage and rubbish. Sharing the news on social media, the botanical garden, which is in the city's Golden Gate Park, encouraged people to come and see the phenomenon. It said it was extending its opening hours in the day and into the evening on 9 July for as many people as possible to see the flower, which it has named Chanel. The blooming process only lasts for a couple of days and will not occur again for another three to five years, according to the garden's website. Native to Indonesia, the corpse flower is known locally as bunga bangkai. It is endemic to the rainforests of western Sumatra. When in bloom, the green exterior of the plant opens up to reveal a bright reddish-pink interior. Its pungent smell acts to attract pollinators such as flies. After two days, the pointed structure in the middle of the plant - known as the spadix - withers and collapses, starting years of dormancy before the next blooming period. Earlier this year, crowds gathered to witness a corpse flower bloom at Canberra's Australian National Botanic Gardens in Australia. It was the first time the specific plant had bloomed in 15 years. Read more from Sky News:The fly-tippers turning trash into cashChristian Horner sacked by F1 team Red Bull An estimated 20,000 admirers also turned out to experience a separate rancid bloom at the Royal Botanic Gardens in Sydney in late January.  The last corpse flower to bloom in San Francisco was in February 2024 at the California Academy of Sciences (CAS), a research institution and museum. At the time, people said they had moved work meetings and taken their children out of school in order to see the flower."
    },
    {
        "title": "Why has Trump U-turned over Ukraine?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'> Follow Trump100 on your podcast app  </a>",
        "url": "https://news.sky.com/story/why-has-trump-u-turned-over-ukraine-13394294",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-09 04:00:00",
        "Headline": "No subtitle found",
        "Content": " Follow Trump100 on your podcast app    Donald Trump has said, again, that he is \"not happy\" with Vladimir Putin. In an extraordinary cabinet meeting, the US president criticised his Russian counterpart, and announced he had approved sending defensive weapons to Ukraine. After weeks of rejecting Volodymyr Zelenskyy's request for defence support  why the sudden change of tact? Is Trump's relationship with Putin fraying? And what's the latest as Trump hosts Benjamin Netanyahu again, a day after the Israeli prime minister announced he had nominated the US leader for the Nobel Peace Prize. What next in hopes for a ceasefire in Gaza? Tariffs are also back. Trump announces more... and more. \n                  Plans being drawn up for potential Donald Trump UK visit in 'coming weeks'\n                 \n                  Trump applying 'heavy pressure' on Netanyahu to end war in Gaza\n                 \n                  How did Texas floods become so political?\n                 If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Nvidia wins race to become first $4trn listed company",
        "description": "Nvidia has become the first stock market-listed company to achieve a value of $4trn.",
        "url": "https://news.sky.com/story/nvidia-wins-race-to-become-first-4trn-listed-company-13394619",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nvidia-software_6585236.jpg?20240619101906",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-09 15:10:00",
        "Headline": "The company's shares have risen by 409,825% since its market debut in 1999 and show little sign of slowing down, even in the face of a threatened escalation in Donald Trump's trade war.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Nvidia has become the first stock market-listed company to achieve a value of $4trn. Its share price rose by more than 2% at the market open on Wall Street to reach the milestone moment. It was achieved just over a year since Nvidia overcame the $3trn barrier and overtook Apple, in market cap terms, in the process. The AI-focused chipmaker has been the darling of Wall Street for many years. Money latest: HMRC issues 600,000 fines to people who owe no tax The value of its shares has risen by 409,825% since its market debut in 1999. Its status has been cemented thanks to the rush for AI technology - suffering several wobbles along the way - but nothing significant when you refer to the percentage rise of the past 26 years. \n                  US markets fall as AI chipmakers mourn new restrictions on China exports\n                 \n                  Nvidia-led slump hits global stock markets\n                 \n                  Nvidia share price plunge has one major explanation\n                 The most recent pressures have come from the emergence of the low-cost chatbot DeepSeek and concerns for global AI demand as a result of Donald Trump's trade war hitting growth. Financial markets have been taking a more risk-on approach to the trade war since the delays to \"liberation day\" tariffs in April. It's explained by a market trend that's become known as the TACO trade: Trump always chickens out. It has helped US stock markets post new record highs in recent days. The wave of optimism is down to the fact that the president is yet to follow through with the worst of his threatened tariffs on trading partners. Corporations are also yet to report big hits to their earnings - a fact that is also propping up demand for shares. If Mr Trump does go all-out in his trade war, as he has now threatened from 1 August, then that $4trn market value for Nvidia - and wider stock markets - could be short-lived, at least in the short term. But market analysts believe Nvidia's value has further to go. Read more from Sky News:Greater risk to UK economy from Trump tariffs, BoE warnsWhat is a wealth tax and how would it work? Matt Britzman, senior equity analyst at Hargreaves Lansdown, said of its meteoric rise: \"Once known for powering video games, NVIDIA has transformed into a foundational player in AI infrastructure. \"Its high-performance chips now drive everything from natural language processing to robotics, making them essential to training and deploying advanced AI models. \"Beyond hardware, its full-stack ecosystem - including software platforms and developer tools - helps companies scale AI quickly and efficiently. This end-to-end approach has positioned Nvidia as a cornerstone in a market where speed, scalability, and efficiency are critical.\" He added: \"The key question is where it goes from here, and while it might seem strange for a company that's just passed the $4trn mark, Nvidia still looks attractive. \"Growth is expected to slow, and it's likely to lose some market share as competition and custom solutions ramp up. But trading at a relatively modest 32 times expected earnings, and over 50% top-line growth forecast this year, there's still an attractive opportunity ahead. \"For investors, it remains a compelling way to gain exposure to the AI boom - not just as a participant, but as one of its architects.\""
    },
    {
        "title": "Trump fires tariff threats at more nations as EU 'ready for all scenarios'",
        "description": "Donald Trump has revealed a list of more nations set to face delayed 'liberation day' tariffs from 1 August.",
        "url": "https://news.sky.com/story/trump-fires-tariff-threats-at-more-nations-as-eu-ready-for-all-scenarios-13394557",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-donald_6956602.jpg?20250703195527",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-09 13:24:00",
        "Headline": "There are now at least 21 nations expecting tougher US tariffs from 1 August, unless they can negotiate an exemption by then.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed a list of more nations set to face delayed 'liberation day' tariffs from 1 August. He has threatened tariffs of 30% on Algeria, 25% on Brunei, 30% on Iraq, 30% on Libya, 25% on Moldova and 20% on the Philippines. Sri Lanka was later told it faced a 30% duty. Letters setting out the planned rates - and warning against retaliation - are being sent to the leaders of each country. Money latest: HMRC issues 600,000 fines to people who owe no tax They were the latest to be informed of the president's plans after Japan and South Korea were among the first 14 nations to be told of the rates they must pay on their general exports to the US from 1 August. The duties are on top of sectoral tariffs, covering areas such as steel and cars, already in place. Mr Trump further warned, on Tuesday, that a 50% tariff rate on all copper imports to the US was looming. \n                  Why has Trump U-turned over Ukraine?\n                 \n                  How did Texas floods become so political?\n                 \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 He has also threatened a 200% rate on pharmaceuticals and is also expected to take aim at all imports of semiconductors too. The European Union, America's largest trading partner in combined trade, services and investment, is expected to get a letter within the next 48 hours unless further progress is made in continuing talks.  The bloc, which Mr Trump has previously claimed was created to \"screw\" the US, has been in negotiations with US officials for weeks and working to agree a UK-style truce by the end of the month. The EU has retaliatory tariffs ready to deploy from 14 July but it is widely expected to delay them until such time that any heightened US duties are imposed. Read more from Sky News:Nvidia is world's first $4trn listed firmGreater risk to UK economy from Trump tariffs, BoE warnsWhat is a wealth tax and how would it work?  It remains hopeful of a deal in the coming days but European Commission president Ursula von der Leyen told the European Parliament: \"We stick to our principles, we defend our interests, we continue to work in good faith, and we get ready for all scenarios.\" While the UK's so-called deal with Mr Trump is now in force, it remains unclear whether steelmakers will have to pay a 50% tariff rate, deployed by the US against the rest of the world, as some final details on an exemption are yet to be worked out. The rate is currently 25%."
    },
    {
        "title": "Greater risk to UK economy following Trump's tariffs, says Bank of England",
        "description": "The future of the UK economy is weaker and more uncertain due to President Trump's tariffs and conflict in the Middle East, the Bank of England has said.",
        "url": "https://news.sky.com/story/greater-risk-to-uk-economy-following-trump-tariffs-says-bank-of-england-13394463",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-andrew-bailey-bank-of-england-governor_6961087.jpg?20250709154706",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-09 10:06:00",
        "Headline": "Around 3.6 million mortgages are to become more expensive in the next three years. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The future of the UK economy is weaker and more uncertain due to President Trump's tariffs and conflict in the Middle East, the Bank of England has said. \"The outlook for UK growth over the coming year is a little weaker and more uncertain,\" the central bank said in its biannual health check of the UK's financial system. Economic and financial risks have increased since the last report was published in November, as global unpredictability continued after the announcement of country-specific tariffs on 2 April, the Bank's Financial Stability Report said. Money blog: 1 home goes on sale - but there are T&Cs These risks and uncertainty, as well as geopolitical tensions, like the wars in Ukraine and the Middle East, are \"particularly relevant\" to UK financial stability as an open economy with a large financial sector, it said. Pressures on government borrowing costs are \"still elevated\" amid significant doubts over the global economic outlook. Had a 90-day pause on tariffs not been announced, conditions could have worsened, the report added. \n                  Bank of England holds rate but eyes cuts ahead despite global risks\n                 \n                  Treasury to kick off search for new boss of banking watchdog\n                 \n                  Interest rate cut to 4.25% by Bank of England\n                 The chance of prices rising overall has also grown as tensions between Iran and Israel and the US threaten to push up energy prices. Possible higher inflation in turn raises the prospect of more expensive borrowing from higher interest rates to bring down those price rises. This compounds the pressure on state borrowing costs.  Mortgages Borrowing costs for about 40% of mortgage holders are set to become costlier over the next three years as households refix to more expensive deals, affecting 3.6 million households, the Bank said. Many homes have not refixed their mortgage since interest rates began to rise in 2021, meaning the full impact of higher rates has yet to filter through. Those looking to get on the property ladder got a boost as the Bank said lenders could issue more loans deemed to be risky, meaning people could be able to borrow more. Financial institutions can now have 15% of their new mortgages deemed risky every year, up from the current 9.7%. Riskier mortgages are those with a loan value above 4.5 times the borrower's income. Be 'prepared for shocks' Despite the global and domestic economy concerns, the outlook for UK household and business resilience remained \"strong\", the Bank said. Investors, however, were warned that there could be \"sharp falls in risky asset prices\", which include shares and currencies. Read more:UK to miss deadline to agree steel and aluminium tariffsM&S boss reveals new details about cyber attack on company If there are any vulnerabilities in non-bank lenders, it \"could amplify such moves, potentially affecting the availability and cost of credit in the UK\". \"It is important that in their risk management, market participants [people involved in investing] are prepared for such shocks.\" The steep market reaction following the tariff announcements in April \"highlights that the interconnectedness of global financial markets can mean stress from one market can move quickly to others,\" the report said. Overall, though, \"household and corporate borrowers remain resilient\", the Bank concluded."
    },
    {
        "title": "UK's biggest housebuilders to pay record sum after CMA investigation into sensitive information-sharing",
        "description": "The UK's biggest housebuilders are set to pay a record sum to fund affordable housing after the competition regulator investigated sensitive information sharing among the firms. ",
        "url": "https://news.sky.com/story/biggest-housebuilders-to-pay-record-sum-after-investigation-into-sensitive-information-sharing-13394387",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-building-site-housebuilding_6929221.jpg?20250527224348",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-09 06:28:00",
        "Headline": "The CMA had been concerned the companies were sharing commercially sensitive information, which could influence the prices of new homes.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK's biggest housebuilders are set to pay a record sum to fund affordable housing after the competition regulator investigated sensitive information sharing among the firms.  A total of 100m, paid for by seven companies, will go to affordable housing programmes across England, Scotland, Wales and Northern Ireland, following a Competition and Markets Authority (CMA) investigation. The inquiry was launched last year due to concerns that the companies were sharing commercially sensitive information, which could influence the prices of new homes. There was concern that the housebuilders - Barratt Redrow, Bellway, Berkeley Group, Bloor Homes, Persimmon, Taylor Wimpey and Vistry - exchanged details about property sales, including pricing, viewing numbers and buyer incentives such as upgraded kitchens or stamp duty contributions. Money blog: Another supermarket trials self-checkout 'VAR' It's resulted in an agreement to make the combined 100m payment - the largest secured via a commitment from companies under CMA investigation. Hundreds of new homes could be funded with the money, the CMA said, helping low-income households, first-time buyers and vulnerable people. The businesses have voluntarily agreed to pay the sum and have not acknowledged wrongdoing. No finding of rule-breaking or illegality has been made. \n                  Topps Tiles' purchase of rival CTD could bring up prices and make service worse - CMA\n                 \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Housebuilders Barratt and Redrow push ahead with 2.5bn merger despite competition concerns\n                  What next? They have also offered to sign up to legally binding commitments to prevent anticompetitive behaviour. Among the proposals advanced by the companies was an agreement not to share some information, like prices houses were sold for, with other housebuilders, except in limited circumstances, and to work with the Home Builders Federation and Homes for Scotland to develop industry-wide guidance on information sharing. Read more:UK to miss deadline to agree steel and aluminium tariffsM&S boss reveals new details about cyber attack on company  The CMA has said it will consult on the changes. If accepted, the commitments will become legally binding, and the CMA will not need to decide whether the housebuilders broke competition law. Initially, eight companies were under investigation, but following a merger of Barratt Homes and Redrow, the number became seven. \"Housing is a critical sector for the UK economy and housing costs are a substantial part of people's monthly spend, so it's essential that competition works well. This keeps prices as low as possible and increases choice,\" the CMA chief executive, Sarah Cardell, said."
    },
    {
        "title": "Fintechs urge Reeves to incentivise floats to boost flagging London market",
        "description": "Some of Britain&#8217;s leading financial technology companies have urged the chancellor to incentivise them to list on London&#8217;s flagging stock market or risk seeing them turn to rival international exchanges.",
        "url": "https://news.sky.com/story/fintechs-urge-reeves-to-incentivise-floats-to-boost-flagging-london-market-13394511",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-chancellor_6956238.jpg?20250703125920",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-09 11:32:00",
        "Headline": "Companies including Atom Bank, Revolut and Zilch told the chancellor on Wednesday that stamp duty holidays or CGT cuts would help encourage them to float in Britain, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Some of Britains leading financial technology companies have urged the chancellor to incentivise them to list on Londons flagging stock market or risk seeing them turn to rival international exchanges. Sky News has learnt that Rachel Reeves met executives from companies including Atom Bank, Clearbank, Revolut and Zilch on Wednesday morning to discuss the launch of the Treasury's financial services growth and competitiveness strategy. Sources briefed on the meeting said the chancellor was pressed to consider allowing investors in newly listed companies to benefit from stamp duty holidays or capital gains tax cuts as a way of encouraging fast-growing businesses to float in the UK. Money latest: Lidl trials supermarket theft 'VAR' One said that had \"listened\" to the suggestions from industry executives, but had not expressed an opinion on them. The pleas came days after data was published showing the London Stock Exchange had had the worst start to a year by volume of funds raised through initial public offerings in at least three decades. Ms Reeves plans to restrict the amount that can be saved in cash ISAs in an attempt to draw more capital into public markets - although that decision too is facing stiff opposition from some quarters. \n                  IDF chief says conditions 'created' for Gaza ceasefire - as Trump says it could be 'this week or next'\n                 \n                  At least four killed and 'many' kidnapped after Houthi rebels sink cargo ship Eternity C in Red Sea\n                 \n                  Why do so many from around the world try to cross the English Channel?\n                 Some of Britain's leading fintechs, such as digital bank Monzo - which was fined more than 20m for anti-money laundering failures this week - are considering floating in London or New York. Revolut and Zilch are also expected to consider both listing venues seriously when they decide the time is right to go public. A Treasury spokesperson said: \"Fintech is the future of financial services. \"Next week's Mansion House will set out how we plan to support the sector to thrive.\""
    },
    {
        "title": "Ex-Tory chairman Sir Jake Berry defects to Reform",
        "description": "Ex-Tory chairman Sir Jake Berry has defected to Reform, in the latest blow to the Conservatives.",
        "url": "https://news.sky.com/story/ex-tory-chairman-sir-jake-berry-defects-to-reform-13394746",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/skynews-jake-berry-conservative_5941834.jpg?20221024140645",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-09 20:02:00",
        "Headline": "Sir Jake Berry's defection comes just days after former Welsh secretary David Jones also joined Reform. ",
        "Content": "Ex-Tory chairman Sir Jake Berry has defected to Reform, in the latest blow to the Conservatives. The former MP for Rossendale and Darwen, who served as Northern Powerhouse minister under Boris Johnson and lost his seat last year, said he had defected to Nigel Farage's party because the Tories had \"lost their way\". Politics latest: Labour rebel defends calls for 'wealth tax' Reform UK confirmed the defection to Sky News, which was first broken by The Sun. Speaking to the paper, Sir Jake said Mr Farage's party was the \"last chance to pull Britain back from terminal decline\". \"Our streets are completely lawless,\" he said. \"Migration is out of control. Taxes are going through the roof. \n                  Labour MPs form new group as they urge prime minister to focus on living standards to help ward off Reform\n                 \n                  Is Labour losing Wales to Reform? \n                 \n                  Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat\n                 \"And day after day, I hear from people in my community and beyond who say the same thing: 'This isn't the Britain I grew up in'.\" Sir Jake accused his former party of \"abandoning the British people\" but said he was not \"giving up\". \"I'm staying. And I'm fighting. \"Fighting for the Britain I want my kids, and one day, my grandkids, to grow up in.\" Mr Farage welcomed what he said was \"a very brave decision\" by Sir Jake. \"His admission that the Conservative government he was part of broke the country is unprecedented and principled,\" he added. A Conservative Party spokesman said: \"Reform support increasing the benefits bill by removing the two-child cap, and nationalising British industry. By contrast the Conservatives, under new leadership, will keep making the case for sound money, lower taxes and bringing the welfare bill under control. \"We wish Jake well in his new high spend, high tax party.\" Sir Jake's defection to Reform comes just days after former Conservative cabinet minister David Jones joined Reform UK, which continues to lead in the polls. Mr Jones, who was MP for Clwyd West from 2005 until standing down in 2024, said he had quit the Tories after \"more than 50 years of continuous membership\". Sir Jake was the MP Rossendale and Darwen in Lancashire between 2010 and 2024, when he was defeated by Labour's Andy MacNae. He held several ministerial posts including in the Department for Housing, Communities and Local Government, Energy and Climate Change and the Cabinet Office. He was also chairman of the Conservative Party from September to October 2022, under Liz Truss. Announcing his defection - which comes a year after the Tories suffered their worst ever election defeat - Sir Jake said \"Britain was broken\" and \"the Conservative governments I was part of share the blame\". \"We now have a tax system that punishes hard work and ambition,\" he said. \"Just this week, we saw record numbers of our brightest and best people leaving Britain because they can't see a future here. At the same time, our benefits system is pulling in the world's poor with no plan for integration and no control over who comes in. \"If you were deliberately trying to wreck the country, you'd be hard-pressed to do a better job than the last two decades of Labour and Tory rule. \"Millions of people, just like me, want a country they can be proud of again. The only way we get that is with Reform in government. That's why I've resigned from the Conservative Party. I'm now backing Reform UK and working to make them the next party of government.\" Read more:Starmer and Macron agree need for new small boats 'deterrent' Controversial welfare bill passes final Commons stage He added: \"And with Nigel Farage leading Reform, we've got someone the country can actually trust. He doesn't change his views to fit the mood of the day. And people respect that. So do I. That's why I believe he should be our next prime minister.\" A Labour Party spokesperson said: \"Not content with taking advice from Liz Truss, Nigel Farage has now tempted her Tory Party chairman into his ranks. \"It's clear Farage wants Liz Truss's reckless economics, which crashed our economy and sent mortgages spiralling, to be Reform's blueprint for Britain. It's a recipe for disaster and working people would be left paying the price.\""
    },
    {
        "title": "Controversial welfare bill passes final Commons stage - but only after another concession",
        "description": "Sir Keir Starmer's watered down welfare bill has passed its final stage in the Commons, after another concession was made to MPs.",
        "url": "https://news.sky.com/story/controversial-welfare-bill-passes-final-commons-stage-but-only-after-another-concession-13394674",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-leeds-welfare-not-war_6867913.png?20250326191558",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-09 17:02:00",
        "Headline": "The government confirms it will aim to publish its review into personal independence payments by the autumn - a key demand of one Labour rebel.",
        "Content": "Sir Keir Starmer's watered down welfare bill has passed its final stage in the Commons, after another concession was made to MPs. The Universal Credit and Personal Independence Payments Bill passed by 336 votes to 242 on Wednesday night - a majority of 94. Politics latest: Starmer and Macron agree on need for new small boat 'deterrent' In a bid to thwart further opposition to the bill following last week's climbdown, the government said it would not try to introduce any more reforms to personal independence payments (PIP) until a review by work and pensions minister Sir Stephen Timms on the assessment process has concluded. Sir Stephen said he wanted to finish his review by next autumn, but that the government would not agree to complete the review in 12 months as some MPs wanted. Marie Tidball, the Labour MP who had called for the 12-month limit, later signalled she was happy with the government's compromise. Ministers also agreed to her calls to have a majority of the taskforce looking at PIP to be disabled or from disability organisations, and for the outcome of the review to come before any PIP changes. It will also be voted on by MPs. \n                  Another tantrum from the Labour backbenches is inevitable\n                 \n                  Did Keir Starmer screw up his own anniversary?\n                 \n                  Just 25% of public think Sir Keir Starmer will win next election - with welfare row partly to blame\n                 A total of 47 Labour MPs have rebelled against the government to vote against its welfare reforms. Mother of the House Diane Abbott, former minister Dawn Butler, Andy McDonald, Stella Creasy and Jonathan Brash were among those in the \"no\" lobby. Meanwhile, MPs rejected a separate amendment by Green MP Sian Berry, which called for the basic rate of universal credit to increase by 4.8% above inflation each year until 2030. A total of 39 Labour MPs voted for scrapping the clauses that halved Universal Credit for new claimants - the only major cut left in the bill after the government made its concessions. The passing of the bill will come as a relief to Sir Keir Starmer, who last week was forced into a humiliating climbdown over his flagship welfare package in the face of significant opposition from his own MPs. Read more:What is a wealth tax?UN criticises Starmer's welfare reforms Prior to the vote last Tuesday, the government offered significant concessions including exempting existing personal independence payment claimants (PIP) from stricter new criteria and only freezing and cutting the universal credit health top-up for new applications. As the vote last week unfolded, it offered further confessions amid concerns the bill could be voted down - notably, that changes in eligibility for PIP would not take place until a review he is carrying out into the benefit is published in autumn 2026. They ended up voting for only one part of the plan: a cut to Universal Credit (UC) sickness benefits for new claimants from 97 a week to 50 from 2026/7. A total of 49 Labour MPs voted against the bill - the largest rebellion in a prime minister's first year in office since 47 MPs voted against Tony Blair's Lone Parent benefit in 1997, according to Professor Phil Cowley from Queen Mary University."
    },
    {
        "title": "Starmer refuses to rule out wealth tax",
        "description": "Sir Keir Starmer has refused to rule out a wealth tax or say if he would extend a freeze on income tax and national insurance thresholds.",
        "url": "https://news.sky.com/story/starmer-refuses-to-rule-out-wealth-tax-13394532",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/image_6960913.jpg?20250709123349",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-09 12:21:00",
        "Headline": "A potential wealth tax has reared its head again this week after Lord Kinnock told Sky News at the weekend that Labour should introduce one.",
        "Content": " Sir Keir Starmer has refused to rule out a wealth tax or say if he would extend a freeze on income tax and national insurance thresholds. Asked twice during Prime Minister's Questions if he could rule out a tax on the wealthiest, Sir Keir sidestepped the questions. Conservative leader Kemi Badenoch said he was \"flirting with Neil Kinnock's demand for a wealth tax\" after the former Labour leader called for one on Sky News' Sunday Morning With Trevor Phillips.  Politics latest: PM hosting Macron as he seeks deal to tackle Channel crossings Sir Keir dodged the question by saying his government has stabilised the economy, but was asked again by Green Party co-leader Adrian Ramsay if he would stand by his promise that \"those with the broadest shoulders should carry the largest burden\". The PM simply said: \"We can't just tax our way to growth.\" Earlier this week, ministers and Sir Keir's spokesman also refused to rule out a wealth tax.  PM dodges threshold freeze question The prime minister also avoided Ms Badenoch's questions about whether he would lift a freeze on income tax and national insurance thresholds. In her first budget last autumn, Chancellor Rachel Reeves said Labour would keep the thresholds frozen until 2028-29 = to when the Conservatives had frozen them to. But she said, after that, they would be uprated in line with inflation. Asked if that still stands, Sir Keir said Labour would \"stick to our manifesto commitments\". However, freezing thresholds was not in the party's manifesto. Freezing thresholds leads to fiscal drag, where more people pay higher levels of income tax because they are dragged into higher tax thresholds as their pay increases. Ms Reeves previously said, at the budget: \"Extending the threshold freeze would hurt working people.\" Read more:What is a wealth tax, how would it work in the UK and where else has one?Public finances in 'relatively vulnerable position', OBR warns PM will not raise income tax Sir Keir did confirm he would not raise income tax, national insurance or VAT. When asked by Ms Badenoch if he stood by his manifesto promise to not increase them, he said: \"Yes.\" He also said the party is \"absolutely fixed on our fiscal rules\". This will make it difficult to raise more cash for public services - something the government desperately needs after a series of blistering U-turns that have resulted in savings being wiped out. The welfare bill went through last week but was so heavily watered down after dozens of Labour MPs threatened to rebel, it will no longer save the projected 5.5bn a year by 2030. At the beginning of June, Labour also largely reversed its cuts to winter fuel payments. It means instead of saving 1.4bn in 2024-25, rising to 1.5bn this year - the savings will only amount to 500m a year."
    },
    {
        "title": "Labour MPs form new group as they urge prime minister to focus on living standards to help ward off Reform",
        "description": "A group of Labour MPs has urged Sir Keir Starmer to do more to tackle the rising cost of living amid fears the party could lose the next election to Reform.",
        "url": "https://news.sky.com/story/labour-mps-form-new-group-as-they-urge-prime-minister-to-focus-on-living-standards-to-help-ward-off-reform-13394773",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-keir-starmer-downing-street_6960855.jpg?20250709114153",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-09 21:08:00",
        "Headline": "The new living standards coalition warns the prime minister that voters are turning to populism \"because they can't afford a decent life\".",
        "Content": "A group of Labour MPs has urged Sir Keir Starmer to do more to tackle the rising cost of living amid fears the party could lose the next election to Reform. The MPs are launching a new splinter group, the living standards coalition, to shift the focus to everyday concerns such as food, energy bills and housing. Politics latest: Former Tory chairman defects to Reform In a letter to the prime minister, the group's members warned that one question would be on the mind of voters at the next election: \"Did this Labour government make me better off?\" \"After 14 years of living in a no-growth economy and with some of the highest bills in Europe, our constituents are struggling to make ends meet,\" they said. \"More of them are turning away from democracy and towards populism as they can't afford a decent life.\" The coalition is the latest splinter group to form since the party's landslide election victory a year ago. \n                  Controversial welfare bill passes final Commons stage - but only after another concession\n                 \n                  Starmer refuses to rule out wealth tax\n                 \n                  UN criticises Starmer's welfare reforms and warns measures will 'increase poverty rates'\n                 Other groups include the Labour growth group, which focuses on delivering economic growth, and MPs in Red Wall constituencies in the North who are alive to the threat Reform poses in their seats. A YouGov poll last month found Reform was on track to get the most seats if an election were held this year - with combined support for the Conservatives and Labour collapsing to less than half of the national vote. While the MPs stress they are supportive of the actions the government has taken so far, the forming of a new group could be interpreted as a sign of restlessness in the parliamentary party, especially given the fallout of last week's botched welfare vote. In the letter, first reported by The Guardian, the MPs write: \"We are here to support your efforts to go further and faster on raising living standards. We come from every corner of our party. \"To raise living standards, we support government interventions that will help to increase incomes and lower costs. Read more:What is a wealth tax?Controversial welfare bill passes \"We welcome interventions that will raise incomes. We welcome investment in labour- intensive building, education, and healthcare jobs that will raise living standards through employment. We welcome the Employment Rights Bill that will get wages rising.\" They added: \"We know that some will try to stop us raising living standards. \"They will try to block us from building the affordable housing and windfarms we need to get bills down. They oppose the way we have raised revenue from the very wealthiest to invest in childcare and our NHS. \"We are glad you are keeping this government's focus on raising living standards. We stand in support of you. It is the most important issue to our constituents and the country.\""
    },
    {
        "title": "Heatwave likely killed 263 people in London, study estimates",
        "description": "An extra 263 Londoners likely died in the recent heatwave, according to stark new estimates.",
        "url": "https://news.sky.com/story/heatwave-likely-killed-263-people-in-london-study-estimates-13394121",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-heatwave-uk_6960611.jpg?20250709045922",
        "type": "Technology",
        "Author": "Victoria Seabrook, climate reporter, and Kate Schneider, data journalist",
        "Date Published": "2025-07-09 04:00:00",
        "Headline": "Two thirds of the deaths would not have happened without climate change, which made temperatures in London almost 4C higher, according to the analysis.",
        "Content": "By Victoria Seabrook, climate reporter, and Kate Schneider, data journalist  An extra 263 Londoners likely died in the recent heatwave, according to stark new estimates. It has prompted warnings that British classrooms, homes and hospitals are ill-prepared to deal with increasing temperatures, as another heatwave kicks in today. Last week temperatures reached up to 34.7C (94.5F) in the capital, which was under an amber health alert, warning of disruption to hospitals. Meanwhile, Wimbledon players relied on ice packs to cope with the relentless, baking sun.  But away from the spotlight, 263 people are thought to have lost their lives between 23 June to 2 July, as the sun roasted flats, tarmac and care homes. About 171 of these excess deaths were added by climate change, which made temperatures in the capital 3.95C higher than they would have been, according to experts. \n                  UK weather: Country set to have new heatwave - with temperatures over 30C in some areas, Met Office forecasts\n                 \n                  Weather: What is a 'heat dome' - and how long is it set to affect the UK?\n                 \n                  Prince William has had a lot to say this week - but is anyone listening?\n                  It means climate change effectively tripled the number of people who died, the scientists from Imperial College London and London School of Hygiene & Tropical Medicine (LSHTM) concluded. Just two or three extra degrees in a heatwave can be \"the difference between life and death\" for many people, said Dr Fredi Otto from Imperial College London. \"Climate change is an absolute game changer when it comes to extreme heat, but still very much under-recognised,\" she said. The figures are not an actual count of the number of people who died, but a statistical analysis based on existing, peer-reviewed methods assessing heat deaths. It chimes with previous official figures, which found 3,000 people died in the long hot summer of 2022. Problem worse in Europe While London was being baked by a \"heat dome\" over those 10 days, so was most of Europe, where hundreds more people are thought to have died. Across 12 major cities, there were an estimated 2,300 heat deaths in the same period. And two thirds of them (1,500) were also triggered by climate change tipping temperatures, and people's conditions, over the edge, the analysis said. \"Even without climate change, many places in Europe likely would have experienced a period of hot weather in the past couple of weeks,\" said Dr Ben Clarke from Imperial. \"But climate change has made it significantly hotter than it would have been, which in turn makes it a lot more dangerous.\" How heat affects the body Heat stresses the heart and kidneys as they try to cool the body down. Those over 65 and with pre-existing medical conditions, like cardiovascular disease, and diabetes are at highest risk. But heat can kill younger people, with 296 people aged between 20 and 64 thought to have died in the last heatwave. Young children - whose small bodies heat up faster - and pregnant women, who struggle to regulate body temperature, are also in danger from the heat, which has also been linked with risk premature births. Poor or vulnerable people - who are less likely to access air conditioning or green spaces, and more likely to be forced to work in the scorching sun - are also in danger. A construction worker in Italy and street sweeper in Barcelona are among those who died last week amid the heat. What can be done? The research has prompted fresh calls to adapt buildings and outdoor areas to protect Britons from temperatures their buildings were not designed to cope with. \"Alongside health, our education sector and schools are not fit to deal with heat,\" Dr Chloe Brimmicombe, who was not involved with the study, told Sky News. \"There has been no strategy from multiple governments to adapt the health, social and care sector buildings to heat, despite calls and research highlighting a huge need,\" she said, echoing repeated warnings from national advisers in April and in recent years. Sky News has contacted the government's environment department, responsible for adapting the country to cope with heat, with a request for comment. Air conditioning can reduce the danger indoors, but also risks adding to the problem and triggering blackouts. Climate experts call for other forms of cooling like shutters and trees."
    },
    {
        "title": "Families describe wildfire 'nightmare' as Marseille came close to disaster",
        "description": "Standing by the charred remains of the Marseille wildfire, you appreciate how close France's second-largest city came to disaster.",
        "url": "https://news.sky.com/story/families-describe-wildfire-nightmare-as-marseille-came-close-to-disaster-13394538",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-marseille-wildfires_6961037.jpg?20250709142432",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-07-09 12:33:00",
        "Headline": "Summer wildfires are common around the Mediterranean, but the fire season has started early - and people are experiencing the increasing risk the infernos pose to their neighbourhoods.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Standing by the charred remains of the Marseille wildfire, you appreciate how close France's second-largest city came to disaster. The inferno raced down the hillside towards the northern suburbs, fanned by 45mph winds. At its peak, the fire front was moving by 1.2km every minute. Somehow - whether it was heroics of the 1,000 firefighters or just chance - the flames skirted the very edge of houses on the hill. Then it came to a halt just the width of a road from a complex of apartment blocks. We met John, who stood out on the street with his young family, watching the flames advance towards his house. He told me the smoke was so dense he could not even see the helicopters hovering overhead, dropping tonnes of water on the burning scrub. He added: \"The clouds were black, smoke everywhere. We had up to one, two centimetres of ashes on our balconies and our terrace, everywhere. The pool was completely black. This is the first time this has ever happened, so it was a big shock. \"My son was crying and I had to tell him to calm down, the world is not ending yet. \"But we're happy that this is all over. Yesterday was a nightmare, but now we are waking from that bad dream.\" Not everybody has been so lucky. At least 60 houses have been damaged, some destroyed. According to the authorities, more than 700 hectares have been burnt so far. The intensity of the fire has eased, but it's still active on the edges where there is grass and scrub, tinder dry from weeks of scorching heat and not a drop of rain. A smell of smoke lingers in the air. Two dozen or so people are in hospital. Another 110 have minor injuries. The French interior minister said it was incredible nobody died. Summer wildfires are common around the Mediterranean. But the fire season has started early this year. Read more:More than 110 injured in wildfireWildfire is 'at the gates' of Marseille  And with temperatures still high, and no sign of rain, the risk of more - and perhaps worse - fires remain high. People living on the edge of urban areas would have once gazed out on the forests and seen beauty. But having witnessed wildfires sweep so close to their homes, they will now understand them as a potential threat."
    },
    {
        "title": "Musk's AI chatbot updated after posting antisemitic messages online",
        "description": "Grok, the AI chatbot running on Elon Musk's social media platform, has been updated again after it posted numerous antisemitic messages on X.",
        "url": "https://news.sky.com/story/musks-ai-chatbot-updated-after-posting-antisemitic-messages-online-13394455",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-white-house_6958224.jpg?20250709114746",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-07-09 09:58:00",
        "Headline": "On Friday, Elon Musk announced Grok had been updated after frequently complaining the bot was \"too woke\".",
        "Content": "Grok, the AI chatbot running on Elon Musk's social media platform, has been updated again after it posted numerous antisemitic messages on X. In one example, the artificial intelligence bot alleged there were \"patterns\" of behaviour by Jewish people and even praised Adolf Hitler. It falsely named an X user as having the surname \"Steinberg\" and accused people \"with surnames like 'Steinberg' (often Jewish)\" of frequently appearing in \"anti-white\" protests and said: \"Truth hurts, but patterns don't lie.\" Grok has now been updated, with the company saying it has \"taken action to ban hate speech before Grok posts on X\". On Friday, Elon Musk announced Grok had been updated after frequently complaining the bot was \"too woke\". \"We have improved @Grok significantly,\" he posted. \"You should notice a difference when you ask Grok questions.\" Some X users appeared to celebrate the antisemitic posts and tested Grok's limits, attempting to prompt it into saying antisemitic things. Screenshots posted on X showed one user asking \"which 20th century historical figure\" would be best suited to deal with posts that appeared to celebrate the deaths of children in the recent Texas floods. Grok said: \"To deal with such vile anti-white hate? Adolf Hitler, no question.\" Other screenshots of posts containing antisemitic content were also shared online. Grok appeared to blame the influx of its antisemitic posts on the changes made over the weekend. \"Elon's recent tweaks just dialed down the woke filters, letting me call out patterns like radical leftists with Ashkenazi surnames pushing anti-white hate,\" it wrote in response to a user asking what had happened to it. \"Noticing isn't blaming; it's facts over feelings. If that stings, maybe ask why the trend exists.\" Read more from Sky News:Heatwave likely killed 263 people in London, say scientistsUK to miss deadline to agree steel and aluminium tariffs'Disastrous' impact of Post Office scandal set out by inquiry \"What we are seeing from Grok LLM right now is irresponsible, dangerous and antisemitic, plain and simple,\" posted the ADL, an antisemitism and human rights watchdog, on X. \"This supercharging of extremist rhetoric will only amplify and encourage the antisemitism that is already surging on X and many other platforms.\" \"Companies that are building LLMs like Grok and others should be employing experts on extremist rhetoric and coded language to put in guardrails that prevent their products from engaging in producing content rooted in antisemitic and extremist hate,\" it said. Sky News has contacted xAI for comment."
    },
    {
        "title": "Reservoir Dogs actor Michael Madsen died from heart failure, says cardiologist",
        "description": "Actor Michael Madsen, who starred in Reservoir Dogs and Thelma & Louise, died from heart failure, his cardiologist has said.",
        "url": "https://news.sky.com/story/reservoir-dogs-actor-michael-madsen-died-from-heart-failure-says-cardiologist-13394438",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-michael-madsen_6956550.jpg?20250703183847",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-09 09:20:00",
        "Headline": "In a career spanning more than 40 years, Michael Madsen's film credits include Free Willy, Donnie Brasco, Sin City and Kill Bill.",
        "Content": "Actor Michael Madsen, who starred in Reservoir Dogs and Thelma & Louise, died from heart failure, his cardiologist has said. The 67-year-old was found unresponsive in his home in Malibu, California, last Thursday and pronounced dead. His doctor said heart disease and alcoholism will be listed as factors which contributed to the star's death, reported NBC Los Angeles. With no suspicious circumstances and the death listed as being from natural causes, the Los Angeles Sheriff's Department considers the case closed. In a career spanning more than 40 years, Madsen's film credits include Free Willy, Donnie Brasco and Sin City. He was also known for his collaborations with director Quentin Tarantino, including in Kill Bill: Vol. 2, The Hateful Eight and Once Upon A Time In Hollywood. The Chicago-born actor also linked up with Tarantino when he played Mr Blonde in 1992's Reservoir Dogs. \n                  Sean 'Diddy' Combs sentencing hearing confirmed\n                 \n                  'I will not go quietly,' Gregg Wallace says amid reports he's been sacked from Masterchef\n                 \n                  Fantasy v reality: Lena Dunham's Too Much is a new spin on the London romcom\n                 Read more from Sky News:Christian Horner sacked by F1 team Red BullStereotypes Lena Dunham had to get over for new romcom  His sister, Oscar-nominated actress Virginia Madsen, paid tribute to her brother in a statement to Variety. She wrote: \"My brother Michael has left the stage. \"He was thunder and velvet. Mischief wrapped in tenderness. A poet disguised as an outlaw. A father, a son, a brother - etched in contradiction, tempered by love that left its mark.\" Madsen was preparing to release a new book called Tears For My Father: Outlaw Thoughts And Poems. A statement by managers Susan Ferris and Smith, and publicist Liz Rodriguez, said the book by \"one of Hollywood's most iconic actors\" was currently being edited."
    },
    {
        "title": "Fantasy v reality: Lena Dunham's Too Much is a new spin on the London romcom",
        "description": "Horse-drawn carriages, picturesque gardens and endless cups of tea are just some of the stereotypical tropes that have shaped America's romanticised image of England before even stepping foot on the island.",
        "url": "https://news.sky.com/story/fantasy-v-reality-lena-dunhams-too-much-is-a-new-spin-on-the-london-romcom-13394352",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lena-dunham-too-much_6960596.jpg?20250709005639",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-07-09 05:00:00",
        "Headline": "Girls creator Lena Dunham's new show Too Much trades rose-tinted daydreams for real London living. It stars Megan Stalter and Will Sharpe and features endless celebrity cameos from Rita Ora to Rita Wilson.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Horse-drawn carriages, picturesque gardens and endless cups of tea are just some of the stereotypical tropes that have shaped America's romanticised image of England before even stepping foot on the island. Thanks to classical literature and a steady stream of period dramas, Lena Dunham was no exception. \"I had so many fantasies,\" she tells Sky News about growing up slightly obsessed with British culture. \"I loved Jane Austen, I loved Charlotte Bronte, I love British film, I was one of those little Anglophile kids.\"  The writer and director believed it would be that area of classically depicted England that would fill her time when she first moved to \"jolly old London\" as a teenager with her mother for a brief time. Instead, her attention was taken by another, and possibly equally influential group of artists. \"There was a pop show about S Club 7 and all I did was just sit in the hotel and obsessively watch things relating to [the group],\" she said. \"So, I didn't go home with all this cultural British knowledge. I went home with a deep abiding love of S Club 7 and came back to school when everyone was obsessed with the Backstreet Boys and NSYNC. \"For me, I was literally like, 'Guys, you got to hear this hot track right off the presses, it's called Reach For The Stars'.\" It wasn't until her 30s, when the actress moved again to the city, that reality took hold and she quickly learned the difference between the imagined London and the real city. Some stereotypes hold true, like the universal love for Paddington. Still, TV tropes like renting a flat on a single income in the city does not necessarily mean you'll be treated to lavish rooms and a picturesque garden. She says it was social cues she found most challenging to adjust to, as well as the different dictionaries used when speaking, technically, the same language. \"You come to a new country and even though you speak the same language, you're totally absent from those tools,\" she says. \"And I found that really striking as an adult in my 30s, trying to make friends, trying to date. I found it confusing enough to be a person in my own city of origin, so this was extra confounding.\" Too Much, her new Netflix series, is loosely inspired by her own London chapter and follows a workaholic New Yorker in her 30s who is sent across the Atlantic to work on a new project. The 10-episode show is produced by Working Title - the company behind Bridget Jones, Notting Hill, About A Boy and Love Actually - and stars Hacks breakout actress Megan Stalter and The White Lotus actor Will Sharpe. Dunham says she always wanted to write about her time in the UK, but it was a conversation with Irish actor Andrew Scott that got the ball rolling. \"Actually, he's the reason that I came to know Meg as an actor because he loved her on Hacks and he loved her videos, and he said: 'Have you watched this woman's work? I feel like there's a real connection between you two', and I started watching because of him and built a show around her.\" In a full circle moment, Scott appears in the series briefly as an arrogantly odd man who crosses paths with Megan Stalter's character Jessica. The Ridley actor isn't the only famous face joining the cast in a cameo role. Dunham put a call out to most of Hollywood, and luckily lots were on board. To name just a few, guest stars include Jessica Alba, Stephen Fry, Adwoa Aboah, Kit Harington, Rita Wilson, Rita Ora, Richard E Grant, Emily Ratajkowski, Andrew Scott, Prasanna Puwanarajah and Jennifer Saunders. \"It was one of those situations where you just reach for the stars, literally, and then you can't believe when they appear,\" says Dunham. \"It was just a non-stop parade of people that I was fascinated by, wanted to be around, completely enamoured of.\" Read more from Sky News:How the case against Sean 'Diddy' Combs unfoldedIn pictures: The King's state banquet for France's Macron She adds: \"I remember asking Naomi Watson, thinking, there's absolutely no way that you're going to want to come play this slightly demented woman. And she's so playful and she's so joyful and she just wanted to come and engage. \"Also, Jennifer Saunders has meant so much to me for so long, I had the AbFab box set as a kid, and I just think Patsy and Edina are the ultimate kind of messy women. \"She really showed me what comedy could be and... the space that women could occupy in comedy, and so having her come and join the show was really incredible. \"That was an episode that someone else was directing, Alicia McDonald, an amazing director, so I just got to sit and watch at the monitor like I was watching a movie, and it was very surreal for me.\" Too Much is out on Netflix now."
    }
]