[
    {
        "title": "Trump and Putin agree on 'many points' in Ukraine talks - but give little detail away",
        "description": "Donald Trump has said there are \"many points\" he and Vladimir Putin agreed on after holding critical talks on the war in Ukraine - but no deal has been reached yet.",
        "url": "https://news.sky.com/story/trump-and-putin-agree-on-many-points-in-ukraine-talks-but-give-little-detail-away-13412403",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-ukraine_6992281.jpg?20250816004842",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-15 19:28:00",
        "Headline": "The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where Vladimir Putin arrived to a red carpet - the kind of welcome usually reserved for close US allies.",
        "Content": " Donald Trump has said there are \"many points\" he and Vladimir Putin agreed on after holding critical talks on the war in Ukraine - but no deal has been reached yet. Following the much-anticipated meeting in Alaska, which lasted more than two-and-a-half hours, the two leaders gave a short media conference giving little detail about what had been discussed, and without taking questions. Mr Trump described the meeting as \"very productive\" and said there were \"many points that we agreed on... I would say a couple of big ones\". Trump-Putin summit - latest updates But there are a few left, he added. \"Some are not that significant. One is probably the most significant, but we have a very good chance of getting there... \"We haven't quite got there, we've made some headway. There's no deal until there's a deal.\" Mr Putin described the negotiations as \"thorough and constructive\" and said Russia was \"seriously interested in putting an end\" to the war in Ukraine. He also warned Europe not to \"torpedo nascent progress\". After much build-up to the summit - with the US president threatening \"severe\" consequences for Russia should it not go well - it was ultimately not clear whether the talks had produced meaningful steps towards a ceasefire in what has been the deadliest conflict in Europe in 80 years. Mr Trump said he intended to speak with Ukrainian President Volodymyr Zelenskyy and other European leaders, who were excluded from the discussions, to brief them. Despite not reaching any major breakthrough, the US leader ended his remarks with a thank you, and said he would probably see Mr Putin again \"very soon\". When the Russian president suggested that \"next time\" would be Moscow, he responded by saying he might face criticism, but \"I could see it possibly happening\".  The red carpet treatment The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where the US president stepped down from Air Force One and later greeted his Russian counterpart with a handshake and smiles on a red carpet. Mr Putin even travelled alongside Mr Trump in the presidential limousine, nicknamed \"The Beast\". It was the kind of reception typically reserved for close US allies, belying the bloodshed and the suffering in the war. Before the talks, the two presidents ignored frantically-shouted questions from journalists - and Mr Putin appeared to frown when asked by one reporter if he would stop \"killing civilians\" in Ukraine, putting his hand to his ear as though to indicate he could not hear.  Our US correspondent Martha Kelner, on the ground in Alaska, said he was shouting \"let's go\" - apparently in reference to getting the reporters out of the room. Read more:Mapping the land Ukraine could be told to give upThe snowy remote base where Trump hosted Putin A '10/10' meeting During his first day back in the White House in January, Mr Trump had pledged confidently to bring about an end to the war in Ukraine. But seven months later, after infamously berating Mr Zelenskyy during a meeting at the Oval Office in February, and then stanching the flow of some US military assistance to Kyiv, he still does not appear to have brought a pause to the conflict. In an interview with Fox News before leaving Alaska, Mr Trump described the meeting with Mr Putin as \"warm\" and gave it a \"10/10\", but declined to give details about what they discussed. He also insisted that the onus going forward could be on Mr Zelenskyy \"to get it done\", but said there would also be some involvement from European nations. What happens next? Mr Trump is expected to speak to Mr Zelenskyy, Sir Keir Starmer and European leaders about the talks. A meeting of ambassadors from European countries has been scheduled for 8.30am UK time, EU presidency sources have told Sky News. European heads of state and Trump are also likely to have a virtual meeting later in the day."
    },
    {
        "title": "What we expected from the Trump-Putin summit - and what actually happened",
        "description": "A warm handshake, big smiles, and a red carpet - this was the welcome for Vladimir Putin as he touched down on US soil for critical negotiations on the war in Ukraine.",
        "url": "https://news.sky.com/story/what-we-expected-from-the-trump-putin-summit-and-what-actually-happened-13412404",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6992244.jpg?20250815234202",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-15 19:31:00",
        "Headline": "There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself. The US president had threatened \"severe\" consequences for Russia should it not go well - but there was no mention of this following the talks.",
        "Content": " A warm handshake, big smiles, and a red carpet - this was the welcome for Vladimir Putin as he touched down on US soil for critical negotiations on the war in Ukraine. There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself - with the US president having threatened \"severe\" consequences for Russia should it not go well. But more than two-and-a-half hours of talks resulted in just a brief news conference with little detail given away - and ultimately, no talk of a ceasefire and no deal on Ukraine reached yet. Here is what was expected from the meeting - based on information from the White House, Mr Trump and the Kremlin beforehand - and what happened on the night. One-on-one turned into three-on-three It was thought this would be a one-on-one meeting between Mr Trump and Mr Putin. Instead, the US president was joined by US secretary of state Marco Rubio and special envoy Steve Witkoff, while the Russian leader was supported by his foreign affairs advisor Yuri Ushakov and Russian foreign minister Sergei Lavrov. The change seemed to indicate the White House was perhaps taking a more guarded approach than during a 2018 meeting in Helsinki, where Mr Trump and Mr Putin met privately with interpreters. The US leader then shocked the world by siding with the Russian leader over US intelligence officials on whether Russia meddled in the 2016 presidential campaign. Rolling out the red carpet Mr Putin was given the kind of reception typically reserved for close US allies, belying the bloodshed and the suffering in the war he started. The two men greeted each other with a handshake and a smiling Mr Trump even applauded the Russian president as he approached him on the red carpet. Our international affairs editor Dominic Waghorn, in Kyiv, gauged the Ukrainian reaction to the arrival - and said people were furious at the welcome extended by the Trump team. Images of US soldiers on their knees, unfurling the red carpet at the steps of the Russian leader's plane, went viral, he said, with social media \"lit up with fury, anger, and disgust\". He added: \"There are different ways of welcoming a world leader to this type of event, and Trump has gone all out to give a huge welcome to Putin, which is sticking in the craw of Ukrainians.\" Any questions? Plenty. But no one was really given a chance to ask. Ahead of the talks, cameras were allowed inside for just a minute - and while this was enough time for a few journalists to shout some questions, these were ignored by the two leaders. \"President Putin, will you stop killing civilians?\" one shouted. In response, Mr Putin put his hand up to his ear as if he could not hear. In their brief media conference after the talks, Mr Putin spoke for almost nine minutes, while Trump took just three-and-a-half to say what he wanted to say. The two men then did not stay to answer questions from reporters. Before the event, the Kremlin said it could last between six and seven hours, but the whole visit lasted about four-and-a-half hours. 'Severe consequences' Ever since his inauguration in January, Mr Trump had been threatening serious consequences for Russia should a deal on Ukraine not be reached soon. Just two days after the ceremony, he took to social media to declare there could be \"high levels of taxes, tariffs and sanctions\" and called for an end to the \"ridiculous\" war. In February, he held what he described as a \"productive\" call with the Russian leader, and about two weeks later he infamously berated Ukrainian President Volodymyr Zelenskyy during a visit to the Oval Office - this one taking place in front of the world's media. Read more:The moment Putin cravedMapping the land Ukraine could be told to give up In July, he started to set deadlines for an end to the war - first giving Mr Putin 50 days and later reducing this to \"10 or 12 days\", before announcing the summit last week. Yesterday, Mr Trump insisted his Russian counterpart was \"not going to mess around with me\". However, while both men insisted the talks were \"productive\", it is not clear what agreements have been reached, and whether Ukraine is any closer to finding peace. The word ceasefire was not mentioned by either leader. Instead, they praised each other, with Mr Trump describing Mr Putin's remarks as \"very profound\" - and there was no mention of sanctions. A meeting with Mr Zelenskyy? It was expected that after the talks, Mr Trump could set the table for the next meeting with the Ukrainian president. While he said he would call Mr Zelenskyy, he made no public commitment to a meeting during the media conference. In an interview with Fox News after the summit, he said Russia and Ukraine would set a date to discuss next steps and a potential ceasefire deal, but did not provide further details on specifics or timings. \"They're going to set up a meeting now, between President Zelenskyy and President Putin and myself, I guess,\" Mr Trump said. He also said that European nations \"have to get involved a little bit\" but it is \"really up to President Zelenskyy to get it done\". Putin brought his own limo - but travelled in The Beast instead After shaking hands on the red carpet, the two leaders made their way towards their waiting vehicles. But despite Mr Putin arriving with his \"Aurus\" limousine, and it being spotted on the tarmac near the planes, he got into the American presidential limousine, known as \"The Beast\", to travel to the meeting location. The Russian president was seen with a wide smile on his face, while Mr Trump appeared to be waving to the crowds."
    },
    {
        "title": "The moment Vladimir Putin has craved - a red carpet from Donald Trump for a man with blood on his hands",
        "description": "All eyes were on Donald Trump and Vladimir Putin as they met for the first time in more than six years, the Russian president visiting the US for high-stakes talks that could reshape the war in Ukraine.",
        "url": "https://news.sky.com/story/the-moment-vladimir-putin-has-craved-a-red-carpet-from-donald-trump-for-a-man-with-blood-on-his-hands-13412439",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6991991.jpg?20250815205748",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-15 20:10:00",
        "Headline": "Donald Trump and Vladimir Putin greeted each other with a handshake after stepping off their planes at the Elmendorf-Richardson military base in Anchorage, Alaska.",
        "Content": " All eyes were on Donald Trump and Vladimir Putin as they met for the first time in more than six years, the Russian president visiting the US for high-stakes talks that could reshape the war in Ukraine. The two leaders greeted each other with a handshake after stepping off their planes at the Elmendorf-Richardson military base in Anchorage, Alaska - and a smiling Trump even applauded Putin as he approached him on a red carpet that had been laid out. It is exactly the moment Putin has craved, writes Moscow correspondent Ivor Bennett. The Russian leader has been welcomed on to US soil as an equal for a meeting of great powers. Trump-Putin summit - latest updates The red carpet, the handshake, the flypast - only North Korea would give an indicted war criminal a greeting like this. It marks the end of his isolation from the West in the most spectacular fashion. Instead of sanctions, Trump has rewarded the Russian president with the equivalent of a state visit. The pariah looks more like a partner. US correspondent James Matthews, reporting from the ground in Alaska, describes the meeting on the tarmac as \"extraordinary\".  There was the red carpet and more for a man with blood on his hands, he writes. Putin - aggressor, pariah and wanted for war crimes. Quite the CV for a man who was applauded on to the airbase by his host, the US president. It couldn't have looked more cordial - a superpower moment with a smile and a shake between the men who hold peace in their hands. Read more:Mapping the land Ukraine could be told to give upThe snowy remote base where Trump is hosting Putin If that wasn't enough, there followed a military flypast to dress the spectacle. A smiling Putin seemed duly impressed, but what it says about the power dynamic in the relationship will trouble onlookers in Ukraine - and one moment they may have found particularly galling. Posing for photographs with Trump before waiting media, Putin was asked: \"Will you stop killing civilians?\" To which he smiled, and gave it a deaf ear. Our international affairs editor Dominic Waghorn, in Kyiv, gauged the Ukrainian reaction to Putin's arrival - and says people are furious at the red carpet welcome extended by the Trump team. Images of US soldiers on their knees, unfurling the red carpet at the steps of the Russian leader's plane, have been going viral, he reports. Social media has been lit up with fury, anger, and disgust, he says. There are different ways of welcoming a world leader to this type of event, and Trump has gone all out to give a huge welcome to Putin, which is sticking in the craw of Ukrainians."
    },
    {
        "title": "Israel releases video showing public humiliation of prominent Palestinian prisoner",
        "description": "The spectacle of Israel's Itamar Ben-Gvir humiliating perhaps the most popular of all Palestinians in his prison cell was as unedifying as the national security minister's extremist politics.",
        "url": "https://news.sky.com/story/israel-releases-video-showing-public-humiliation-of-prominent-palestinian-prisoner-13412121",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ben-gvir-barghouti_6991601.jpg?20250815141840",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-15 11:47:00",
        "Headline": "Imprisoned since 2002 on murder charges and sentenced to five life sentences plus an additional 40 years for his role in the second intifada, 67-year-old Marwan Barghouti had not been seen in many years.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  The spectacle of Israel's Itamar Ben-Gvir humiliating perhaps the most popular of all Palestinians in his prison cell was as unedifying as the national security minister's extremist politics. \"You won't win. Whoever messes with the people of Israel, whoever murders our children, whoever murders our women, we will erase him,\" Ben-Gvir told Marwan Barghouti, the figurehead of secular Palestinian nationalism, who appeared shocked and scared. His lawyer told Al-Arabiya TV that Ben-Gvir threatened him directly and that his life is in danger. Imprisoned since 2002 on murder charges and sentenced to five life sentences plus an additional 40 years for his role in the second intifada, the 67-year-old had not been seen in many years. The sight of this drawn, diminished figure will shock many across the Arab world, where he is both hugely popular and considered a potential Palestinian unity leader, were Israel to ever release him. Barghouti's face, his hands cuffed above his head, stares out from walls and buildings across the West Bank - a potent symbol of Palestinian suffering and resistance in the face of the Israeli occupation. His more than two-decade imprisonment leaves him untarnished from the charges of corruption and ineffectiveness levelled at the Palestinian leadership, and opinion polls before 7 October 2023 saw his popularity exceed that of both Ismail Haniyeh, head of Hamas' political wing, and Palestinian Authority President Mahmoud Abbas. \n                  Over 100 people killed in Gaza in 24 hours, officials say, marking deadliest day in a week\n                 \n                  Inside settler violence in the West Bank\n                 \n                  Settlers and segregation: Inside the conflict forcing Palestinians from their homes\n                 In a statement, the Palestinian Authority condemned Ben-Gvir's visit as an \"unprecedented provocation and organised state terrorism\". It is also a clear abuse of Ben-Gvir's authority as national security minister, where he has ultimate oversight over Israel's prison system and therefore direct access to the record number of Palestinian detainees currently imprisoned there. Barghouti's family say he has been held in solitary confinement since the 7 October attacks and has been subjected to brutal assaults, one of which left him severely injured. Israeli mistreatment Barghouti will be no stranger to Israeli mistreatment. In an op-ed from jail to the New York Times in 2017, he detailed the first time he was tortured at the age of just 18, when an Israeli interrogator \"forced me to spread my legs while I stood naked in the interrogation room, before hitting my genitals\". He passed out from the pain, hitting his head, which scarred permanently. Afterwards, he wrote, the Israeli interrogator mocked him, saying he would \"never procreate because people like me give birth only to terrorists and murderers\". Barghouti's release has been a key component of ceasefire negotiations between Israel and Hamas, with talks in February 2024 breaking down when Israel refused to let him go. Despite international pressure on Israel to ensure the humane treatment of its prisoners, the ICRC has not been granted access to Palestinian prisoners in Israeli detention since the 7 October attacks. String of provocations Ben-Gvir and his fellow ultra-nationalist coalition partner, Finance Minister Bezalel Smotrich, both excel at the provocative act. Less than two weeks ago, Ben-Gvir was filmed visiting the Al-Aqsa mosque in Jerusalem where he said he prayed, which is in direct violation of the status quo agreement governing relations between Muslims and Jews at the key holy sites on Temple Mount. Bear in mind, it was Ariel Sharon's visit to Temple Mount in 2000, which launched the second intifada, and you will get a sense of quite how incendiary that was. Similarly, on Thursday, in what appeared to be a direct response to international calls for recognition of Palestinian statehood, Bezalel Smotrich announced that Israel would start the long-delayed E1 settlement project between the West Bank and East Jerusalem. This, he said, would \"bury\" any notion of a Palestinian state once and for all. The video showing the public humiliation of a man championed by the likes of Desmond Tutu and Jimmy Carter as the Palestinian Mandela, was released just hours later. It looks like an attempt by Benjamin Netanyahu's ultra-nationalist allies to send a message both to Palestinians and to international supporters of Palestinian statehood that a state, and its potential leadership, is nothing but a pipe-dream. 'Still pursuing' Barghouti in prison In 2013, Barghouti's wife, Fadwa, launched a campaign for his release and that of all Palestinian prisoners from Robben Island, where Mandela was imprisoned, to draw attention to the similarities between South Africa during the apartheid era and the plight of Palestinians under Israeli occupation. After the release of this latest video, she wrote on her Facebook page that she barely recognised her husband and was scared to imagine what he had been subjected to. Read more from Sky News:Inside the conflict forcing Palestinians from their homesThe city where what was law now has no place in reality But her words were also a rallying cry. \"They are still pursuing you, Marwan, and chasing you even in the solitary cell where you've been living for two years,\" she wrote. \"I know that nothing shakes you except what you hear about the pain of your people, and nothing defeats or pains you except the lack of protection for our sons and daughters. You are one of the people: wherever you are, you are among them, for them, with them.\""
    },
    {
        "title": "Sonic boom heard after RAF Typhoon fighter jets scrambled to intercept passenger plane",
        "description": "A sonic boom has been reported across parts of east and southeast England after the RAF deployed aircraft to intercept a passenger plane.",
        "url": "https://news.sky.com/story/sonic-boom-heard-after-raf-typhoon-fighter-jets-scrambled-to-intercept-passenger-plane-13412193",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-eurofighter-typhoon_6229942.jpg?20230725154636",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-15 14:30:00",
        "Headline": "Flight tracking data shows one Eurofighter Typhoon FGR4 hitting speeds of just under 700 knots (805mph), triggering a sonic boom heard over Kent and Essex.",
        "Content": "A sonic boom has been reported across parts of east and southeast England after the RAF deployed aircraft to intercept a passenger plane. Three Typhoon jets were launched from RAF Coningsby in Lincolnshire on Friday morning to investigate the aircraft, which was not in contact with air traffic control. Data from flightradar24.com shows one Eurofighter Typhoon FGR4 hitting speeds of just under 700 knots (805mph) at 11.40am. When it went supersonic, the flight tracking website recorded it travelling at an altitude of around 40,000ft. People across parts of Kent and Essex reported hearing a loud bang as the fighter jet travelled at supersonic speed. A Royal Air Force spokesperson said: \"We can confirm that RAF Quick Reaction Alert Typhoon fighter aircraft from RAF Coningsby were launched today to investigate a civilian aircraft which was not in contact with air traffic control (ATC), communications were re-established and the aircraft was safely escorted to Stansted.\" Essex Police said: \"A flight has been escorted into Stansted Airport after it lost contact with the ground. Our officers determined there was nothing of concern.\" \n                  Damp and mould found in 'shocking' military accommodation, MPs say\n                 \n                  RAF officers on around £60,000 manning the gates at Cranwell due to guard shortage\n                 \n                  Unidentified drones spotted over three US bases in UK\n                 It is not known what caused the passenger plane, which had been travelling from Nice in the south of France, to stop communicating with ATC. A sonic boom is caused when planes fly faster than the speed of sound, which at ground level is about 761mph. The aircraft displaces the air and creates pressure waves that become compressed and are then released in a shockwave. Read more from Sky News:Concorde prototype breaks sound barrierSupersonic test flight in New ZealandMystery over sonic boom solved The RAF describes the Typhoon FGR4 as a \"highly capable and agile combat aircraft\" which can be \"deployed in a wide range of air operations, including air policing, peacekeeping, and high-intensity conflict\"."
    },
    {
        "title": "Ricky Jones: Suspended Labour councillor who called for protesters' throats to be cut at rally not guilty of encouraging violent disorder",
        "description": "A suspended Labour councillor who said far-right protesters should have their throats slit has been found not guilty of encouraging violent disorder.",
        "url": "https://news.sky.com/story/ricky-jones-suspended-labour-councillor-who-called-for-protesters-throats-to-be-cut-at-rally-not-guilty-of-encouraging-violent-disorder-13412060",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-ricky-jones-labour_6650937.jpg?20250815114139",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-15 09:55:00",
        "Headline": "Ricky Jones, 58, drew his finger across his throat and called demonstrators \"disgusting Nazi fascists\" at an anti-racism protest in east London last August following the Southport murders.",
        "Content": "A suspended Labour councillor who said far-right protesters should have their throats slit has been found not guilty of encouraging violent disorder. Ricky Jones, 58, drew his finger across his throat and called demonstrators \"disgusting Nazi fascists\" at an anti-racism protest in east London last August following the Southport murders. Jones, a borough councillor in Dartford, Kent, from 2019, said he felt it was his \"duty\" to attend the protest in Walthamstow, despite being warned by his party to stay away. He was suspended the day after the incident. Jones, of Dartford, who denied one count of encouraging violent disorder, told police he was \"sorry\" he made the comments \"in the heat of the moment\", and had not intended for them to be \"taken literally\", the court had earlier heard. On Friday, jurors found Jones not guilty after just half an hour of deliberations. The suspended councillor was seen mouthing \"thank you\" at the jurors after the verdict was handed down. Former Home Secretary and Tory leadership candidate James Cleverly called the jury's verdict clearing Jones \"perverse\", writing on X that \"decisions like this are adding to the anger that people feel and amplifying the belief that there isn't a dispassionate criminal justice system\". Reform UK leader Nigel Farage said the verdict was \"another outrageous example of two-tier justice\". \n                  Ricky Jones: Labour councillor told crowd far-right protesters 'need to have throats slit', court hears\n                 \n                  Girl, 16, and two teenage boys arrested on suspicion of murder after death of man on Isle of Sheppey\n                 \n                  Boy, 4, dies after being hit by bus as he walked out of hospital in Margate, Kent\n                 His statement was echoed by former Reform chairman Zia Yusuf, who said the \"two-tier justice in this country is out of control\" as Jones was cleared \"while Lucy Connolly gets 31 months in jail\". Connolly pleaded guilty - meaning she did not face trial - last year to a charge of inciting racial hatred by publishing and distributing \"threatening or abusive\" written material on X during the Southport riots. A video of Jones speaking to cheering protesters went viral on social media after the demonstration, which had been organised in response to plans for a far-right march outside nearby Waltham Forest Immigration Bureau, jurors at Snaresbrook Crown Court were told. It followed the nationwide violent disorder that occurred last summer after the Southport murders when Axel Rudakubana killed three girls and attempted to murder eight others at a summer holiday Taylor Swift-themed event. Jones, who was also employed as a full-time official for the Transport Salaried Staffs' Association (TSSA) union at the time, was arrested a day after the protest and questioned by police in Brixton. Jones said during his trial that his comment about cutting throats did not refer to far-right protesters involved in the riots at the time, but to people who had reportedly left National Front stickers on a train with razor blades hidden behind them. Before he made the comment, footage shows Jones telling the crowd: \"You've got women and children using these trains during the summer holidays. They don't give a shit about who they hurt.\" Prosecutor Ben Holt said during the trial that Jones used \"inflammatory, rabble-rousing language in the throng of a crowd that we will hear described as a tinderbox\". Read more from Sky News:King addresses global conflicts in VJ Day messageMan dead and another missing after boat collision He told the court that Jones gave his speech, which was amplified through a microphone and speakers, \"in a setting where violence could readily have been anticipated\". Jones, who said he was on the left of the Labour Party, told jurors that he was \"appalled\" by political violence, adding that the riots left him feeling \"upset\" and \"angry\". \"I've always believed the best way to make people realise who you are and what you are is to do it peacefully,\" he said."
    },
    {
        "title": "Queen appears emotional following 'off script' comments by veteran about King at VJ event",
        "description": "The Queen appeared emotional as a war veteran paid tribute to the \"brave king\" at a VJ Day memorial event following his cancer diagnosis.",
        "url": "https://news.sky.com/story/queen-appears-emotional-following-off-script-comments-about-king-at-vj-event-13412250",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6991496.jpg?20250815122552",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-15 16:28:00",
        "Headline": "A 105-year-old Second World War veteran says he makes \"no apology\" for going\" off script\" and talking about the King.",
        "Content": "The Queen appeared emotional as a war veteran paid tribute to the \"brave king\" at a VJ Day memorial event following his cancer diagnosis. The King and Camilla joined Sir Keir Starmer and 33 veterans aged 96-105, who served in the Far East and Pacific, at a national service of remembrance in Staffordshire on Friday. But when Yavar Abbas, who was a captain in the 11th Sikh Regiment, went on stage at the National Memorial Arboretum to read extracts from his diaries during his time in Burma in 1945, he also took a moment to go \"off script\". Camilla looked at her husband sitting next to her and appeared to wipe away a tear as Mr Abbas, 105, originally from Lucknow in India, said: \"I make no apologies for briefly going off the script to salute my brave king, who is here with his beloved queen in spite of the fact that he is under treatment for cancer.\" There was applause in the crowd as Mr Abbas said he had also been treated for cancer, and added that he hoped it would bring \"comfort\" that he had been rid of the disease himself for 25 years. VJ Day marks the 80th anniversary of the end of the Second World War, but much of the celebration in 1945 focused on VE (Victory in Europe) Day in May, with those who served in the Far East labelled The Forgotten Army. Mr Abbas added: \"I salute him for gracing this occasion, because by his presence here, he has gone a long way to make sure that his grandad's 14th Army is never given the sobriquet again of The Forgotten Army.\" \n                  Photograph of Queen Camilla released to celebrate 78th birthday\n                 \n                  King to visit Canada for first time as head of state in 'impactful' trip\n                 \n                  The King 'flabbergasted' by magician Steven Frayne's money trick as he and the Queen visit Bradford\n                 'He's human' Speaking afterwards, he said he made \"no apology\" for his comments. \"I admire the man... I admire The King. He has similar views about things as I have, about the environment for example. \"He's human. When I went up to him and talked to him, he said something very touching to me. He said to me when you said that I almost cried. That's our King and he's a great King.\"  Ahead of the service, King Charles, in a pre-recorded audio address to the nation, vowed the sacrifice of heroes who fought and died in the campaigns \"shall never be forgotten\". He also significantly acknowledged the devastation caused by the atomic bombing of Hiroshima and Nagasaki which led to Japan's surrender, describing the \"immense price\" paid by its citizens, adding, \"we pray no nation need ever pay again\". He said: \"Please know that the courage and camaraderie displayed in humanity's darkest hour is a flame that shall blaze for eternity - a beacon that honours our past and guides our future.\" After the service of remembrance, which started with a two-minute silence and a Red Arrows flypast, the King made his way to the Far East corner of the arboretum, where he met Silas Sarbah and Khadak Chettri, the grandsons of Second World War soldiers, as well as William Slim, the great-grandson of General Bill Slim, who led the so-called Forgotten Army. Read more from Sky News:Veteran's 'front-row seat' for moment WW2 endedPledge to make Nagasaki last atomic bomb site He saw tributes at the Burma Railway memorial, which is built from 30 metres of original track from the so-called \"Railway of Death\", and took a moment of reflection at the Burma Star Memorial and the Chindit Memorial, before going to a reception for VJ veterans and their families. The King and Queen were joined by the prime minister and Lady Starmer, as they met some 30 veterans who served in the Far East during the six-year war for the British and Commonwealth Armed Forces, accompanied by their families and carers."
    },
    {
        "title": "Thousands more Afghans affected by second data breach, ministers say",
        "description": "Thousands more Afghan nationals may have been affected by another data breach, the government has said.",
        "url": "https://news.sky.com/story/thousands-more-afghans-affected-by-second-data-breach-ministers-say-13412464",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-afghanistan-royal-marine_6649597.jpg?20240807101344",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-08-15 20:37:00",
        "Headline": "Names, passport details and other information from up to 3,700 Afghans brought to the UK between January and March 2024 have potentially been impacted after a cyber security breach at a third party supplier, the MoD says.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Thousands more Afghan nationals may have been affected by another data breach, the government has said. Up to 3,700 Afghans brought to the UK between January and March 2024 have potentially been impacted as names, passport details and information from the Afghan Relocations and Assistance Policy has been compromised again, this time by a breach on a third party supplier used by the Ministry of Defence (MoD). This was not an attack directly on the government but a cyber security incident on a sub-contractor named Inflite - The Jet Centre - an MoD supplier that provides ground handling services for flights at London Stansted Airport.    The flights were used to bring Afghans to the UK, travel to routine military exercises, and official engagements. It was also used to fly British troops and government officials. Those involved were informed of it on Friday afternoon by the MoD, marking the second time information about Afghan nationals relocated to the UK has been compromised. It is understood former Tory ministers are also affected by the hack. Earlier this year, it emerged that almost 7,000 Afghan nationals would have to be relocated to the UK following a massive data breach by the British military that successive governments tried to keep secret with a super-injunction. Defence Secretary John Healey offered a \"sincere apology\" for the first data breach in a statement to the House of Commons, saying he was \"deeply concerned about the lack of transparency\" around the data breach, adding: \"No government wishes to withhold information from the British public, from parliamentarians or the press in this manner.\"  The previous Conservative government set up a secret scheme in 2023 to relocate Afghan nationals impacted by the data breach, but who were not eligible for an existing programme to relocate and help people who had worked for the British government in Afghanistan. The mistake exposed personal details of close to 20,000 individuals, endangering them and their families, with as many as 100,000 people impacted in total. Read more from Sky News:Data breach victims sent spam emailsAfghan data leak timelineMoD urged to reveal details of nuclear incident A government spokesperson said of Friday's latest breach: \"We were recently notified that a third-party sub-contractor to a supplier experienced a cyber security incident involving unauthorised access to a small number of its emails that contained basic personal information. \"We take data security extremely seriously and are going above and beyond our legal duties in informing all potentially affected individuals. The incident has not posed any threat to individuals' safety, nor compromised any government systems.\" In a statement, Inflite - The Jet Centre confirmed the \"data security incident\" involving \"unauthorised access to a limited number of company emails\". \"We have reported the incident to the Information Commissioner's Office and have been actively working with the relevant UK cyber authorities, including the National Crime Agency and the National Cyber Security Centre, to support our investigation and response,\" it said. \"We believe the scope of the incident was limited to email accounts only, however, as a precautionary measure, we have contacted our key stakeholders whose data may have been affected during the period of January to March 2024.\""
    },
    {
        "title": "Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court",
        "description": "A High Court judge is to decide if a hotel has breached planning rules by becoming a site for migrant accommodation.",
        "url": "https://news.sky.com/story/battle-to-prevent-the-bell-hotel-in-epping-from-housing-asylum-seekers-reaches-high-court-13412359",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-bell-hotel-epping_6967902.jpg?20250718155828",
        "type": "Home",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-08-15 18:28:00",
        "Headline": "Epping Forest District Council wants to prevent asylum seekers staying at the hotel, where protests have taken place after two men staying there were charged with sexual offences, including one involving a 14-year-old girl.",
        "Content": "\n          News correspondent\n              @esadiya\n A High Court judge is to decide if a hotel has breached planning rules by becoming a site for migrant accommodation. And the case that could have repercussions for councils across the country where asylum seekers are housed in hotels. Epping Forest District Council wants an interim injunction against The Bell Hotel in the town, which is owned by Somani Hotels, to prevent it being used as migrant accommodation, arguing the premises was not operating as intended as a hotel. Lawyers for the council called it \"a very serious problem\" and said it was creating \"a feeding ground for unrest,\" stating that there is an \"overwhelming case for an injunction\". Opening the hearing at the High Court in London on Friday, Philip Coppel KC, for the council, said it was a problem that was \"getting out of hand\" and \"causing great anxiety\" to local people. Protests have taken place outside the hotel after two men staying there were charged with sexual offences in separate incidents, including one involving a 14-year-old girl. Mr Coppel said there was \"no agreement between [asylum seekers] and the hotel, they do not choose the duration of their stay... they do not choose the type of room\". \n                  What do Ukrainians think of Trump-Putin Alaska summit?\n                 \n                  Clampdown on social media ads for Channel crossings unveiled\n                 \n                  Man suffers cardiac arrest on boat trying to reach UK\n                 The hotel \"is no more a hotel [to asylum seekers] than a borstal to a young offender\", he said. Barristers for the hotel group told the court that an injunction would cause asylum seekers \"hardship\" and that the move would set \"a dangerous precedent that protests justify planning injunctions\". Piers Riley-Smith, for Somani Hotels Limited, said the company did not argue that residents' concerns \"are not genuine\", but that they did not justify an interim injunction to stop the use of the hotel. \"Those particular ideological, non-community concerns are not relevant to planning,\" he said. The council had \"not shown any evidence\" that it had \"grappled with the hardship\" that would be caused to asylum seekers, the Home Office and the company if a temporary injunction was granted, Mr Riley-Smith said. 50,000 migrants come to UK More than 50,000 migrants have crossed the Channel in small boats since Sir Keir Starmer became prime minister last July. The barrister told the court that what was happening at The Bell Hotel \"is occurring in hotels across the country\" and that the Home Office has a \"statutory duty\" to provide temporary emergency accommodation for asylum seekers. During Mr Riley-Smith's submissions, the judge, Mr Justice Eyre said: \"I think I can take judicial notice that there has been no diminution of the need for accommodation for asylum seekers.\" More on this story:Man denies sex assault chargesEpping protests the 'latest flashpoint' Migrants were housed at the hotel from May 2020 to March 2021, and from October 2022 to April 2024 and the court heard the council never instigated any formal enforcement proceedings against this use. Council 'entirely wrong' In April 2025, they were once again being placed there and Mr Riley-Smith said that a planning application was not made \"having taken advice from the Home Office\". In written submissions, the barrister said it was \"entirely wrong\" for the council to \"suggest the use has been hidden from them\", saying it was \"directly approached in February 2025 by the Home Office before the use began and alerted to the upcoming usage\". He said an injunction would be a \"draconian step,\" and warned granting one would cause harm. \"The main harm would be the loss of accommodation for asylum seekers currently being housed there under the Home Office's statutory duties,\" he said. Mr Justice Eyre is due to deliver his decision on Tuesday."
    },
    {
        "title": "Thousands more Afghans affected by second data breach, ministers say",
        "description": "Thousands more Afghan nationals may have been affected by another data breach, the government has said.",
        "url": "https://news.sky.com/story/thousands-more-afghans-affected-by-second-data-breach-ministers-say-13412464",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-afghanistan-royal-marine_6649597.jpg?20240807101344",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-08-15 20:37:00",
        "Headline": "Names, passport details and other information from up to 3,700 Afghans brought to the UK between January and March 2024 have potentially been impacted after a cyber security breach at a third party supplier, the MoD says.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Thousands more Afghan nationals may have been affected by another data breach, the government has said. Up to 3,700 Afghans brought to the UK between January and March 2024 have potentially been impacted as names, passport details and information from the Afghan Relocations and Assistance Policy has been compromised again, this time by a breach on a third party supplier used by the Ministry of Defence (MoD). This was not an attack directly on the government but a cyber security incident on a sub-contractor named Inflite - The Jet Centre - an MoD supplier that provides ground handling services for flights at London Stansted Airport.    The flights were used to bring Afghans to the UK, travel to routine military exercises, and official engagements. It was also used to fly British troops and government officials. Those involved were informed of it on Friday afternoon by the MoD, marking the second time information about Afghan nationals relocated to the UK has been compromised. It is understood former Tory ministers are also affected by the hack. Earlier this year, it emerged that almost 7,000 Afghan nationals would have to be relocated to the UK following a massive data breach by the British military that successive governments tried to keep secret with a super-injunction. Defence Secretary John Healey offered a \"sincere apology\" for the first data breach in a statement to the House of Commons, saying he was \"deeply concerned about the lack of transparency\" around the data breach, adding: \"No government wishes to withhold information from the British public, from parliamentarians or the press in this manner.\"  The previous Conservative government set up a secret scheme in 2023 to relocate Afghan nationals impacted by the data breach, but who were not eligible for an existing programme to relocate and help people who had worked for the British government in Afghanistan. The mistake exposed personal details of close to 20,000 individuals, endangering them and their families, with as many as 100,000 people impacted in total. Read more from Sky News:Data breach victims sent spam emailsAfghan data leak timelineMoD urged to reveal details of nuclear incident A government spokesperson said of Friday's latest breach: \"We were recently notified that a third-party sub-contractor to a supplier experienced a cyber security incident involving unauthorised access to a small number of its emails that contained basic personal information. \"We take data security extremely seriously and are going above and beyond our legal duties in informing all potentially affected individuals. The incident has not posed any threat to individuals' safety, nor compromised any government systems.\" In a statement, Inflite - The Jet Centre confirmed the \"data security incident\" involving \"unauthorised access to a limited number of company emails\". \"We have reported the incident to the Information Commissioner's Office and have been actively working with the relevant UK cyber authorities, including the National Crime Agency and the National Cyber Security Centre, to support our investigation and response,\" it said. \"We believe the scope of the incident was limited to email accounts only, however, as a precautionary measure, we have contacted our key stakeholders whose data may have been affected during the period of January to March 2024.\""
    },
    {
        "title": "Sam Rimmer: Mum's plea to find e-bike riders who shot dead son in Liverpool three years ago",
        "description": "The mother of a man shot dead by attackers on electric bikes three years ago has appealed for help finding his killers.",
        "url": "https://news.sky.com/story/sam-rimmer-mums-plea-to-find-e-bike-riders-who-shot-dead-son-in-liverpool-three-years-ago-13412022",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sam-rimmer-merseyside-police_6991328.png?20250815092815",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 23:01:00",
        "Headline": "Police say any information will be handled carefully and \"extensive measures\" put in place to protect anyone who comes forward.",
        "Content": "The mother of a man shot dead by attackers on electric bikes three years ago has appealed for help finding his killers. Sam Rimmer was shot in the back on 16 August 2022 when the bikes rode into Lavrock Bank in Liverpool and fired at him and his friends. The 22-year-old was injured and died a short while later in hospital. Ten people have been arrested since then but no charges have followed. Sam's mum, Joanne, said the last three years have been \"agonising\" and \"the passing of time has not eased the pain\". \"People say to cherish the memories, but when I think of Sam, the memory I have is of his body in the morgue, staring at his chest, willing him to breathe. No parent should ever have to identify their child's body,\" she said. Joanne pleaded: \"If you know something and you are reading this, please, please speak up. \"No one will ever know as it will be completely anonymous. Sam was shot in his back. He was turned away from his killers. This image haunts me. In his final moments, was he scared? Was he in pain?\" \n                  Man accused of driving into Liverpool title parade crowds to appear in court today\n                 \n                  Minute's silence for Diogo Jota cut short because of boos\n                 \n                  Migrant protesters face off amid concerns over women and girls' safety\n                 She added: \"I died the day Sam did. I function but I do not live.\" Detective Chief Inspector Steve McGrath, from Merseyside Police, said they \"just need the final piece of the puzzle\". \"We know that there are people out there who live in the Dingle/Toxteth area who know who is responsible and my appeal is for those people to come forward and tell us what they know,\" he urged. \"Do you know who was riding on the bikes that arrived in Lavrock Bank that night? Do you know where they went afterwards or where they are being stored?\" He said any information would be handled carefully and \"extensive measures\" put in place to protect anyone who comes forward. Anyone who witnessed the incident, was in the area at the time, or has any other information is urged to contact Merseyside Police on their public portal. They can also be reached on @MerPolCC on X, or information can be left anonymously with Crimestoppers on 0800 555 111."
    },
    {
        "title": "Sixty more people to be prosecuted for 'showing support' for proscribed Palestine Action, Met Police says",
        "description": "A further 60 people will be prosecuted for \"showing support for the proscribed terrorist group Palestine Action\", the Metropolitan Police has said.",
        "url": "https://news.sky.com/story/60-more-people-to-be-prosecuted-for-showing-support-for-proscribed-palestine-action-met-police-says-13412337",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestine-action-guardtech_6954445.jpg?20250815204847",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 18:08:00",
        "Headline": "Palestine Action was proscribed in July after the group claimed responsibility for damage to jets at RAF Brize Norton and was also linked to \"allegations of a serious assault on staff and police officers at a business premises in South Gloucestershire,\" Met Police said.",
        "Content": "A further 60 people will be prosecuted for \"showing support for the proscribed terrorist group Palestine Action\", the Metropolitan Police has said. This follows the arrest of more than 700 people since the group was proscribed on 7 July, including 522 in central London during a protest last Saturday. Stephen Parkinson, director of public prosecutions, said: \"The decisions that we have announced today are the first significant numbers to come out of the recent protests, and many more can be expected in the next few weeks. \"We are ready to make swift decisions in all cases where arrests have been made.\"  The Metropolitan Police said it has been working closely with Counter Terrorism Policing, the Crown Prosecution Service (CPS), and the Attorney General's Office \"to process the case files, with more prosecutions expected in the coming weeks\". Palestine Action was proscribed in July after the group claimed responsibility for damage to jets at RAF Brize Norton and was also linked to \"allegations of a serious assault on staff and police officers at a business premises in South Gloucestershire,\" Met Police said. \"Proscription of Palestine Action made membership or support of it a criminal offence,\" the force said. Last week, the Met confirmed the first three charges in England and Wales under Section 13 of the Terrorism Act, linked to Palestine Action, following the arrests of three individuals at a protest in Parliament Square on 5 July. Read more from Sky News:Mapping the land Ukraine could be told to give upSonic boom heard after RAF fighter jets scrambled to intercept passenger plane Sir Mark Rowley, the Metropolitan Police commissioner, said: \"I am proud of how our police and CPS teams have worked so speedily together to overcome misguided attempts to overwhelm the justice system. \"If necessary, we are able to investigate and quickly charge significant numbers of people each week if people want the potentially life-changing consequences of a terrorist conviction. \"At the same time, we will continue to police the numerous protests each week where people express their views in support of Palestine without choosing to break counter-terrorism laws by supporting proscribed terror groups.\" The Met said the consequences for those charged under the Terrorism Act include a maximum sentence of six months' imprisonment. If a person is a member of a professional body, they may face disciplinary proceedings and potentially lose their job. Their future job applications could also be affected, as employers may see their records. Additionally, they might be denied admission to university courses and entry to several countries, including the US, Australia, and Japan, the Met said."
    },
    {
        "title": "Hit-and-run driver jailed for 13 years over baby's death",
        "description": "A driver who knocked down a pregnant student, killing her baby boy, has been jailed for 13 years.",
        "url": "https://news.sky.com/story/hit-and-run-driver-jailed-for-13-years-over-babys-death-13412311",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ashir-shahid-renju-joseph_6991961.jpg?20250815201613",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 17:41:00",
        "Headline": "Pregnant Renju Joseph, 31, was struck by a car driven at high-speed by Ashir Shahid, 20, as she walked on a zebra crossing on her way to work.",
        "Content": "A driver who knocked down a pregnant student, killing her baby boy, has been jailed for 13 years. Renju Joseph, 31, was struck by a speeding car driven by 20-year-old Ashir Shahid at a zebra crossing in the village of Bamber Bridge, near Preston, Lancashire. The Toyota Prius driven by Shahid was thought to be going at speeds between 58mph and 71mph in a 30mph zone, in dark and wet conditions, Preston Crown Court heard. Mrs Joseph, who was five months pregnant at the time, was taken to hospital from the scene in Station Road in the early evening of 29 September 2024. Doctors carried out an emergency C-section to try to save the life of her son, Olive. The woman was walking slightly behind two female colleagues on the crossing around 7.50pm as they made their way to a night shift at a nearby care home. A motorist driving in the opposite direction reported that the Prius appeared to accelerate about 15 metres before reaching the crossing, then swerved to avoid the two pedestrians ahead. The pregnant woman was hit and \"thrown into the air for quite some distance\" before she tumbled and rolled into his car, according to the witness. \n                  Thousands more Afghans affected by second data breach, ministers say\n                 \n                  Sam Rimmer: Mum's plea to find e-bike riders who shot dead son in Liverpool three years ago\n                 \n                  Sixty more people to be prosecuted for 'showing support' for proscribed Palestine Action, Met Police says\n                 Prosecutors said Shahid's driving before the collision also \"left a lot to be desired\". Footage recovered from the mobile phones of Shahid and his 17-year-old younger brother, Sam Shahid, who was in the front passenger seat, showed the pair laughing and singing along to music while the car was being driven recklessly and at high speed. Sam Shahid was also seen sticking his feet and upper body out of the window while the driver occasionally took both hands off the wheel and made gun gestures. Minutes after the collision, the Toyota was abandoned in a side street and covered with a sheet by the defendants. Others then moved the vehicle onto the back of a flatbed truck and dumped it in Farnworth, Greater Manchester. Ashir Shahid was arrested days later and made no comment when interviewed, but when his phone was examined, it revealed that on the night of the collision, he made an online search for \"charge for hit and run human\". Ashir Shahid, of Walton le Dale, Preston, pleaded guilty in June to causing death and serious injury by dangerous driving. On Friday, he was also banned from driving for 15 years and one month, and must pass an extended retest. Sam Shahid, also of Walton le Dale, Preston, was detained for three years after he pleaded guilty to assisting an offender. During sentencing, Judge Ian Unsworth KC remarked that Ashir Shahid's acceleration just before the crash was \"similar to what you might witness on a Formula 1 racetrack\". He said: \"Your driving was nothing less than appalling. You engaged in a prolonged and persistent course of dangerous driving. \"Your speed was significantly in excess of the speed limit and was highly inappropriate for the prevailing road conditions. \"Olive's life lasted five hours and 38 minutes. He did not live to see dawn. His mother never saw him alive. His life was snubbed out before it really began.\" Mrs Joseph spent a fortnight in a coma before she learned of the death of her son, the court heard. She and her nurse husband, Nyjil Jonn, both originally from India, had planned a gender reveal party at a baby shower for family and friends on 2 October. One of her last memories before the collision was buying a dress to wear for the occasion, she said in a victim personal statement read out to the court. Mrs Joseph said: \"Everything has been ruined by that one night and the callous and reckless actions of those two people in that car. My life will never by the same again.\""
    },
    {
        "title": "Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court",
        "description": "A High Court judge is to decide if a hotel has breached planning rules by becoming a site for migrant accommodation.",
        "url": "https://news.sky.com/story/battle-to-prevent-the-bell-hotel-in-epping-from-housing-asylum-seekers-reaches-high-court-13412359",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-bell-hotel-epping_6967902.jpg?20250718155828",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-08-15 18:28:00",
        "Headline": "Epping Forest District Council wants to prevent asylum seekers staying at the hotel, where protests have taken place after two men staying there were charged with sexual offences, including one involving a 14-year-old girl.",
        "Content": "\n          News correspondent\n              @esadiya\n A High Court judge is to decide if a hotel has breached planning rules by becoming a site for migrant accommodation. And the case that could have repercussions for councils across the country where asylum seekers are housed in hotels. Epping Forest District Council wants an interim injunction against The Bell Hotel in the town, which is owned by Somani Hotels, to prevent it being used as migrant accommodation, arguing the premises was not operating as intended as a hotel. Lawyers for the council called it \"a very serious problem\" and said it was creating \"a feeding ground for unrest,\" stating that there is an \"overwhelming case for an injunction\". Opening the hearing at the High Court in London on Friday, Philip Coppel KC, for the council, said it was a problem that was \"getting out of hand\" and \"causing great anxiety\" to local people. Protests have taken place outside the hotel after two men staying there were charged with sexual offences in separate incidents, including one involving a 14-year-old girl. Mr Coppel said there was \"no agreement between [asylum seekers] and the hotel, they do not choose the duration of their stay... they do not choose the type of room\". \n                  What do Ukrainians think of Trump-Putin Alaska summit?\n                 \n                  Clampdown on social media ads for Channel crossings unveiled\n                 \n                  Man suffers cardiac arrest on boat trying to reach UK\n                 The hotel \"is no more a hotel [to asylum seekers] than a borstal to a young offender\", he said. Barristers for the hotel group told the court that an injunction would cause asylum seekers \"hardship\" and that the move would set \"a dangerous precedent that protests justify planning injunctions\". Piers Riley-Smith, for Somani Hotels Limited, said the company did not argue that residents' concerns \"are not genuine\", but that they did not justify an interim injunction to stop the use of the hotel. \"Those particular ideological, non-community concerns are not relevant to planning,\" he said. The council had \"not shown any evidence\" that it had \"grappled with the hardship\" that would be caused to asylum seekers, the Home Office and the company if a temporary injunction was granted, Mr Riley-Smith said. 50,000 migrants come to UK More than 50,000 migrants have crossed the Channel in small boats since Sir Keir Starmer became prime minister last July. The barrister told the court that what was happening at The Bell Hotel \"is occurring in hotels across the country\" and that the Home Office has a \"statutory duty\" to provide temporary emergency accommodation for asylum seekers. During Mr Riley-Smith's submissions, the judge, Mr Justice Eyre said: \"I think I can take judicial notice that there has been no diminution of the need for accommodation for asylum seekers.\" More on this story:Man denies sex assault chargesEpping protests the 'latest flashpoint' Migrants were housed at the hotel from May 2020 to March 2021, and from October 2022 to April 2024 and the court heard the council never instigated any formal enforcement proceedings against this use. Council 'entirely wrong' In April 2025, they were once again being placed there and Mr Riley-Smith said that a planning application was not made \"having taken advice from the Home Office\". In written submissions, the barrister said it was \"entirely wrong\" for the council to \"suggest the use has been hidden from them\", saying it was \"directly approached in February 2025 by the Home Office before the use began and alerted to the upcoming usage\". He said an injunction would be a \"draconian step,\" and warned granting one would cause harm. \"The main harm would be the loss of accommodation for asylum seekers currently being housed there under the Home Office's statutory duties,\" he said. Mr Justice Eyre is due to deliver his decision on Tuesday."
    },
    {
        "title": "Queen appears emotional following 'off script' comments by veteran about King at VJ event",
        "description": "The Queen appeared emotional as a war veteran paid tribute to the \"brave king\" at a VJ Day memorial event following his cancer diagnosis.",
        "url": "https://news.sky.com/story/queen-appears-emotional-following-off-script-comments-about-king-at-vj-event-13412250",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6991496.jpg?20250815122552",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 16:28:00",
        "Headline": "A 105-year-old Second World War veteran says he makes \"no apology\" for going\" off script\" and talking about the King.",
        "Content": "The Queen appeared emotional as a war veteran paid tribute to the \"brave king\" at a VJ Day memorial event following his cancer diagnosis. The King and Camilla joined Sir Keir Starmer and 33 veterans aged 96-105, who served in the Far East and Pacific, at a national service of remembrance in Staffordshire on Friday. But when Yavar Abbas, who was a captain in the 11th Sikh Regiment, went on stage at the National Memorial Arboretum to read extracts from his diaries during his time in Burma in 1945, he also took a moment to go \"off script\". Camilla looked at her husband sitting next to her and appeared to wipe away a tear as Mr Abbas, 105, originally from Lucknow in India, said: \"I make no apologies for briefly going off the script to salute my brave king, who is here with his beloved queen in spite of the fact that he is under treatment for cancer.\" There was applause in the crowd as Mr Abbas said he had also been treated for cancer, and added that he hoped it would bring \"comfort\" that he had been rid of the disease himself for 25 years. VJ Day marks the 80th anniversary of the end of the Second World War, but much of the celebration in 1945 focused on VE (Victory in Europe) Day in May, with those who served in the Far East labelled The Forgotten Army. Mr Abbas added: \"I salute him for gracing this occasion, because by his presence here, he has gone a long way to make sure that his grandad's 14th Army is never given the sobriquet again of The Forgotten Army.\" \n                  Photograph of Queen Camilla released to celebrate 78th birthday\n                 \n                  King to visit Canada for first time as head of state in 'impactful' trip\n                 \n                  The King 'flabbergasted' by magician Steven Frayne's money trick as he and the Queen visit Bradford\n                 'He's human' Speaking afterwards, he said he made \"no apology\" for his comments. \"I admire the man... I admire The King. He has similar views about things as I have, about the environment for example. \"He's human. When I went up to him and talked to him, he said something very touching to me. He said to me when you said that I almost cried. That's our King and he's a great King.\"  Ahead of the service, King Charles, in a pre-recorded audio address to the nation, vowed the sacrifice of heroes who fought and died in the campaigns \"shall never be forgotten\". He also significantly acknowledged the devastation caused by the atomic bombing of Hiroshima and Nagasaki which led to Japan's surrender, describing the \"immense price\" paid by its citizens, adding, \"we pray no nation need ever pay again\". He said: \"Please know that the courage and camaraderie displayed in humanity's darkest hour is a flame that shall blaze for eternity - a beacon that honours our past and guides our future.\" After the service of remembrance, which started with a two-minute silence and a Red Arrows flypast, the King made his way to the Far East corner of the arboretum, where he met Silas Sarbah and Khadak Chettri, the grandsons of Second World War soldiers, as well as William Slim, the great-grandson of General Bill Slim, who led the so-called Forgotten Army. Read more from Sky News:Veteran's 'front-row seat' for moment WW2 endedPledge to make Nagasaki last atomic bomb site He saw tributes at the Burma Railway memorial, which is built from 30 metres of original track from the so-called \"Railway of Death\", and took a moment of reflection at the Burma Star Memorial and the Chindit Memorial, before going to a reception for VJ veterans and their families. The King and Queen were joined by the prime minister and Lady Starmer, as they met some 30 veterans who served in the Far East during the six-year war for the British and Commonwealth Armed Forces, accompanied by their families and carers."
    },
    {
        "title": "Sonic boom heard after RAF Typhoon fighter jets scrambled to intercept passenger plane",
        "description": "A sonic boom has been reported across parts of east and southeast England after the RAF deployed aircraft to intercept a passenger plane.",
        "url": "https://news.sky.com/story/sonic-boom-heard-after-raf-typhoon-fighter-jets-scrambled-to-intercept-passenger-plane-13412193",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-eurofighter-typhoon_6229942.jpg?20230725154636",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 14:30:00",
        "Headline": "Flight tracking data shows one Eurofighter Typhoon FGR4 hitting speeds of just under 700 knots (805mph), triggering a sonic boom heard over Kent and Essex.",
        "Content": "A sonic boom has been reported across parts of east and southeast England after the RAF deployed aircraft to intercept a passenger plane. Three Typhoon jets were launched from RAF Coningsby in Lincolnshire on Friday morning to investigate the aircraft, which was not in contact with air traffic control. Data from flightradar24.com shows one Eurofighter Typhoon FGR4 hitting speeds of just under 700 knots (805mph) at 11.40am. When it went supersonic, the flight tracking website recorded it travelling at an altitude of around 40,000ft. People across parts of Kent and Essex reported hearing a loud bang as the fighter jet travelled at supersonic speed. A Royal Air Force spokesperson said: \"We can confirm that RAF Quick Reaction Alert Typhoon fighter aircraft from RAF Coningsby were launched today to investigate a civilian aircraft which was not in contact with air traffic control (ATC), communications were re-established and the aircraft was safely escorted to Stansted.\" Essex Police said: \"A flight has been escorted into Stansted Airport after it lost contact with the ground. Our officers determined there was nothing of concern.\" \n                  Damp and mould found in 'shocking' military accommodation, MPs say\n                 \n                  RAF officers on around £60,000 manning the gates at Cranwell due to guard shortage\n                 \n                  Unidentified drones spotted over three US bases in UK\n                 It is not known what caused the passenger plane, which had been travelling from Nice in the south of France, to stop communicating with ATC. A sonic boom is caused when planes fly faster than the speed of sound, which at ground level is about 761mph. The aircraft displaces the air and creates pressure waves that become compressed and are then released in a shockwave. Read more from Sky News:Concorde prototype breaks sound barrierSupersonic test flight in New ZealandMystery over sonic boom solved The RAF describes the Typhoon FGR4 as a \"highly capable and agile combat aircraft\" which can be \"deployed in a wide range of air operations, including air policing, peacekeeping, and high-intensity conflict\"."
    },
    {
        "title": "Second suspect appears in court charged with man's murder and robbery in Aberdeen",
        "description": "A second suspect has appeared in court charged with murder and robbery following the death of a young man in Aberdeen.",
        "url": "https://news.sky.com/story/second-suspect-appears-in-court-charged-with-mans-murder-and-robbery-in-aberdeen-13412186",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-austin-ironside-police-scotland_6990716.jpg?20250815151059",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-15 14:07:00",
        "Headline": "Austin Ironside, 25, died in hospital earlier this month days after being found injured in the city's Skene Street.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A second suspect has appeared in court charged with murder and robbery following the death of a young man in Aberdeen. Austin Ironside, 25, was found injured in the city's Skene Street at about 3.10pm on Sunday 3 August. He was taken to Aberdeen Royal Infirmary, where he died two days later. Police Scotland arrested and charged Shaun Lerche, 34, in connection with the death.  On Friday, he appeared before Aberdeen Sheriff Court where he made no plea to the charge of murder and robbery. The suspect, from Aberdeen, was remanded in custody and is due back in the dock within the next eight days. Read more from Sky News:Man dead and another missing after collision involving boatIsrael releases video showing public humiliation of prisoner Co-accused Scott Adams, 46, faced the same charge when he appeared in court on Thursday. He too was remanded in custody ahead of his next appearance. The probe continues and is being led by detectives from Police Scotland's Major Investigation Team. A force spokesperson said enquiries remain ongoing."
    },
    {
        "title": "Major search after man goes missing in River Tay in Perth",
        "description": "A major search operation is under way after a man went missing in the River Tay.",
        "url": "https://news.sky.com/story/major-search-after-man-goes-missing-in-river-tay-in-perth-13412204",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-river-tay-perth_6991673.jpg?20250815160640",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 14:56:00",
        "Headline": "Emergency crews were called to a report of three men in the water in Perth at about 7.45pm on Thursday.",
        "Content": "A major search operation is under way after a man went missing in the River Tay. Emergency crews were called to a report of three men in the water in Perth at about 7.45pm on Thursday. Two of the men were traced and were checked over by the Scottish Ambulance Service. Searches continued at Moncreiffe Island in the area on Friday.  Police, mountain rescue, the air support unit and Scottish Fire and Rescue Service were among those involved. Tay Street has been closed in both directions, from Marshall Place to Canal Street, for motorists and pedestrians. Read more from Sky News:More than 280 dead after flash floodsOasis fan dies in hotel room hours before show Police have asked people to avoid the area."
    },
    {
        "title": "Ricky Jones: Suspended Labour councillor who called for protesters' throats to be cut at rally not guilty of encouraging violent disorder",
        "description": "A suspended Labour councillor who said far-right protesters should have their throats slit has been found not guilty of encouraging violent disorder.",
        "url": "https://news.sky.com/story/ricky-jones-suspended-labour-councillor-who-called-for-protesters-throats-to-be-cut-at-rally-not-guilty-of-encouraging-violent-disorder-13412060",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-ricky-jones-labour_6650937.jpg?20250815114139",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-15 09:55:00",
        "Headline": "Ricky Jones, 58, drew his finger across his throat and called demonstrators \"disgusting Nazi fascists\" at an anti-racism protest in east London last August following the Southport murders.",
        "Content": "A suspended Labour councillor who said far-right protesters should have their throats slit has been found not guilty of encouraging violent disorder. Ricky Jones, 58, drew his finger across his throat and called demonstrators \"disgusting Nazi fascists\" at an anti-racism protest in east London last August following the Southport murders. Jones, a borough councillor in Dartford, Kent, from 2019, said he felt it was his \"duty\" to attend the protest in Walthamstow, despite being warned by his party to stay away. He was suspended the day after the incident. Jones, of Dartford, who denied one count of encouraging violent disorder, told police he was \"sorry\" he made the comments \"in the heat of the moment\", and had not intended for them to be \"taken literally\", the court had earlier heard. On Friday, jurors found Jones not guilty after just half an hour of deliberations. The suspended councillor was seen mouthing \"thank you\" at the jurors after the verdict was handed down. Former Home Secretary and Tory leadership candidate James Cleverly called the jury's verdict clearing Jones \"perverse\", writing on X that \"decisions like this are adding to the anger that people feel and amplifying the belief that there isn't a dispassionate criminal justice system\". Reform UK leader Nigel Farage said the verdict was \"another outrageous example of two-tier justice\". \n                  Ricky Jones: Labour councillor told crowd far-right protesters 'need to have throats slit', court hears\n                 \n                  Girl, 16, and two teenage boys arrested on suspicion of murder after death of man on Isle of Sheppey\n                 \n                  Boy, 4, dies after being hit by bus as he walked out of hospital in Margate, Kent\n                 His statement was echoed by former Reform chairman Zia Yusuf, who said the \"two-tier justice in this country is out of control\" as Jones was cleared \"while Lucy Connolly gets 31 months in jail\". Connolly pleaded guilty - meaning she did not face trial - last year to a charge of inciting racial hatred by publishing and distributing \"threatening or abusive\" written material on X during the Southport riots. A video of Jones speaking to cheering protesters went viral on social media after the demonstration, which had been organised in response to plans for a far-right march outside nearby Waltham Forest Immigration Bureau, jurors at Snaresbrook Crown Court were told. It followed the nationwide violent disorder that occurred last summer after the Southport murders when Axel Rudakubana killed three girls and attempted to murder eight others at a summer holiday Taylor Swift-themed event. Jones, who was also employed as a full-time official for the Transport Salaried Staffs' Association (TSSA) union at the time, was arrested a day after the protest and questioned by police in Brixton. Jones said during his trial that his comment about cutting throats did not refer to far-right protesters involved in the riots at the time, but to people who had reportedly left National Front stickers on a train with razor blades hidden behind them. Before he made the comment, footage shows Jones telling the crowd: \"You've got women and children using these trains during the summer holidays. They don't give a shit about who they hurt.\" Prosecutor Ben Holt said during the trial that Jones used \"inflammatory, rabble-rousing language in the throng of a crowd that we will hear described as a tinderbox\". Read more from Sky News:King addresses global conflicts in VJ Day messageMan dead and another missing after boat collision He told the court that Jones gave his speech, which was amplified through a microphone and speakers, \"in a setting where violence could readily have been anticipated\". Jones, who said he was on the left of the Labour Party, told jurors that he was \"appalled\" by political violence, adding that the riots left him feeling \"upset\" and \"angry\". \"I've always believed the best way to make people realise who you are and what you are is to do it peacefully,\" he said."
    },
    {
        "title": "Trump and Putin agree on 'many points' in Ukraine talks - but give little detail away",
        "description": "Donald Trump has said there are \"many points\" he and Vladimir Putin agreed on after holding critical talks on the war in Ukraine - but no deal has been reached yet.",
        "url": "https://news.sky.com/story/trump-and-putin-agree-on-many-points-in-ukraine-talks-but-give-little-detail-away-13412403",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-ukraine_6992281.jpg?20250816004842",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-15 19:28:00",
        "Headline": "The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where Vladimir Putin arrived to a red carpet - the kind of welcome usually reserved for close US allies.",
        "Content": " Donald Trump has said there are \"many points\" he and Vladimir Putin agreed on after holding critical talks on the war in Ukraine - but no deal has been reached yet. Following the much-anticipated meeting in Alaska, which lasted more than two-and-a-half hours, the two leaders gave a short media conference giving little detail about what had been discussed, and without taking questions. Mr Trump described the meeting as \"very productive\" and said there were \"many points that we agreed on... I would say a couple of big ones\". Trump-Putin summit - latest updates But there are a few left, he added. \"Some are not that significant. One is probably the most significant, but we have a very good chance of getting there... \"We haven't quite got there, we've made some headway. There's no deal until there's a deal.\" Mr Putin described the negotiations as \"thorough and constructive\" and said Russia was \"seriously interested in putting an end\" to the war in Ukraine. He also warned Europe not to \"torpedo nascent progress\". After much build-up to the summit - with the US president threatening \"severe\" consequences for Russia should it not go well - it was ultimately not clear whether the talks had produced meaningful steps towards a ceasefire in what has been the deadliest conflict in Europe in 80 years. Mr Trump said he intended to speak with Ukrainian President Volodymyr Zelenskyy and other European leaders, who were excluded from the discussions, to brief them. Despite not reaching any major breakthrough, the US leader ended his remarks with a thank you, and said he would probably see Mr Putin again \"very soon\". When the Russian president suggested that \"next time\" would be Moscow, he responded by saying he might face criticism, but \"I could see it possibly happening\".  The red carpet treatment The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where the US president stepped down from Air Force One and later greeted his Russian counterpart with a handshake and smiles on a red carpet. Mr Putin even travelled alongside Mr Trump in the presidential limousine, nicknamed \"The Beast\". It was the kind of reception typically reserved for close US allies, belying the bloodshed and the suffering in the war. Before the talks, the two presidents ignored frantically-shouted questions from journalists - and Mr Putin appeared to frown when asked by one reporter if he would stop \"killing civilians\" in Ukraine, putting his hand to his ear as though to indicate he could not hear.  Our US correspondent Martha Kelner, on the ground in Alaska, said he was shouting \"let's go\" - apparently in reference to getting the reporters out of the room. Read more:Mapping the land Ukraine could be told to give upThe snowy remote base where Trump hosted Putin A '10/10' meeting During his first day back in the White House in January, Mr Trump had pledged confidently to bring about an end to the war in Ukraine. But seven months later, after infamously berating Mr Zelenskyy during a meeting at the Oval Office in February, and then stanching the flow of some US military assistance to Kyiv, he still does not appear to have brought a pause to the conflict. In an interview with Fox News before leaving Alaska, Mr Trump described the meeting with Mr Putin as \"warm\" and gave it a \"10/10\", but declined to give details about what they discussed. He also insisted that the onus going forward could be on Mr Zelenskyy \"to get it done\", but said there would also be some involvement from European nations. What happens next? Mr Trump is expected to speak to Mr Zelenskyy, Sir Keir Starmer and European leaders about the talks. A meeting of ambassadors from European countries has been scheduled for 8.30am UK time, EU presidency sources have told Sky News. European heads of state and Trump are also likely to have a virtual meeting later in the day."
    },
    {
        "title": "What we expected from the Trump-Putin summit - and what actually happened",
        "description": "A warm handshake, big smiles, and a red carpet - this was the welcome for Vladimir Putin as he touched down on US soil for critical negotiations on the war in Ukraine.",
        "url": "https://news.sky.com/story/what-we-expected-from-the-trump-putin-summit-and-what-actually-happened-13412404",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6992244.jpg?20250815234202",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-15 19:31:00",
        "Headline": "There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself. The US president had threatened \"severe\" consequences for Russia should it not go well - but there was no mention of this following the talks.",
        "Content": " A warm handshake, big smiles, and a red carpet - this was the welcome for Vladimir Putin as he touched down on US soil for critical negotiations on the war in Ukraine. There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself - with the US president having threatened \"severe\" consequences for Russia should it not go well. But more than two-and-a-half hours of talks resulted in just a brief news conference with little detail given away - and ultimately, no talk of a ceasefire and no deal on Ukraine reached yet. Here is what was expected from the meeting - based on information from the White House, Mr Trump and the Kremlin beforehand - and what happened on the night. One-on-one turned into three-on-three It was thought this would be a one-on-one meeting between Mr Trump and Mr Putin. Instead, the US president was joined by US secretary of state Marco Rubio and special envoy Steve Witkoff, while the Russian leader was supported by his foreign affairs advisor Yuri Ushakov and Russian foreign minister Sergei Lavrov. The change seemed to indicate the White House was perhaps taking a more guarded approach than during a 2018 meeting in Helsinki, where Mr Trump and Mr Putin met privately with interpreters. The US leader then shocked the world by siding with the Russian leader over US intelligence officials on whether Russia meddled in the 2016 presidential campaign. Rolling out the red carpet Mr Putin was given the kind of reception typically reserved for close US allies, belying the bloodshed and the suffering in the war he started. The two men greeted each other with a handshake and a smiling Mr Trump even applauded the Russian president as he approached him on the red carpet. Our international affairs editor Dominic Waghorn, in Kyiv, gauged the Ukrainian reaction to the arrival - and said people were furious at the welcome extended by the Trump team. Images of US soldiers on their knees, unfurling the red carpet at the steps of the Russian leader's plane, went viral, he said, with social media \"lit up with fury, anger, and disgust\". He added: \"There are different ways of welcoming a world leader to this type of event, and Trump has gone all out to give a huge welcome to Putin, which is sticking in the craw of Ukrainians.\" Any questions? Plenty. But no one was really given a chance to ask. Ahead of the talks, cameras were allowed inside for just a minute - and while this was enough time for a few journalists to shout some questions, these were ignored by the two leaders. \"President Putin, will you stop killing civilians?\" one shouted. In response, Mr Putin put his hand up to his ear as if he could not hear. In their brief media conference after the talks, Mr Putin spoke for almost nine minutes, while Trump took just three-and-a-half to say what he wanted to say. The two men then did not stay to answer questions from reporters. Before the event, the Kremlin said it could last between six and seven hours, but the whole visit lasted about four-and-a-half hours. 'Severe consequences' Ever since his inauguration in January, Mr Trump had been threatening serious consequences for Russia should a deal on Ukraine not be reached soon. Just two days after the ceremony, he took to social media to declare there could be \"high levels of taxes, tariffs and sanctions\" and called for an end to the \"ridiculous\" war. In February, he held what he described as a \"productive\" call with the Russian leader, and about two weeks later he infamously berated Ukrainian President Volodymyr Zelenskyy during a visit to the Oval Office - this one taking place in front of the world's media. Read more:The moment Putin cravedMapping the land Ukraine could be told to give up In July, he started to set deadlines for an end to the war - first giving Mr Putin 50 days and later reducing this to \"10 or 12 days\", before announcing the summit last week. Yesterday, Mr Trump insisted his Russian counterpart was \"not going to mess around with me\". However, while both men insisted the talks were \"productive\", it is not clear what agreements have been reached, and whether Ukraine is any closer to finding peace. The word ceasefire was not mentioned by either leader. Instead, they praised each other, with Mr Trump describing Mr Putin's remarks as \"very profound\" - and there was no mention of sanctions. A meeting with Mr Zelenskyy? It was expected that after the talks, Mr Trump could set the table for the next meeting with the Ukrainian president. While he said he would call Mr Zelenskyy, he made no public commitment to a meeting during the media conference. In an interview with Fox News after the summit, he said Russia and Ukraine would set a date to discuss next steps and a potential ceasefire deal, but did not provide further details on specifics or timings. \"They're going to set up a meeting now, between President Zelenskyy and President Putin and myself, I guess,\" Mr Trump said. He also said that European nations \"have to get involved a little bit\" but it is \"really up to President Zelenskyy to get it done\". Putin brought his own limo - but travelled in The Beast instead After shaking hands on the red carpet, the two leaders made their way towards their waiting vehicles. But despite Mr Putin arriving with his \"Aurus\" limousine, and it being spotted on the tarmac near the planes, he got into the American presidential limousine, known as \"The Beast\", to travel to the meeting location. The Russian president was seen with a wide smile on his face, while Mr Trump appeared to be waving to the crowds."
    },
    {
        "title": "The moment Vladimir Putin has craved - a red carpet from Donald Trump for a man with blood on his hands",
        "description": "All eyes were on Donald Trump and Vladimir Putin as they met for the first time in more than six years, the Russian president visiting the US for high-stakes talks that could reshape the war in Ukraine.",
        "url": "https://news.sky.com/story/the-moment-vladimir-putin-has-craved-a-red-carpet-from-donald-trump-for-a-man-with-blood-on-his-hands-13412439",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6991991.jpg?20250815205748",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-15 20:10:00",
        "Headline": "Donald Trump and Vladimir Putin greeted each other with a handshake after stepping off their planes at the Elmendorf-Richardson military base in Anchorage, Alaska.",
        "Content": " All eyes were on Donald Trump and Vladimir Putin as they met for the first time in more than six years, the Russian president visiting the US for high-stakes talks that could reshape the war in Ukraine. The two leaders greeted each other with a handshake after stepping off their planes at the Elmendorf-Richardson military base in Anchorage, Alaska - and a smiling Trump even applauded Putin as he approached him on a red carpet that had been laid out. It is exactly the moment Putin has craved, writes Moscow correspondent Ivor Bennett. The Russian leader has been welcomed on to US soil as an equal for a meeting of great powers. Trump-Putin summit - latest updates The red carpet, the handshake, the flypast - only North Korea would give an indicted war criminal a greeting like this. It marks the end of his isolation from the West in the most spectacular fashion. Instead of sanctions, Trump has rewarded the Russian president with the equivalent of a state visit. The pariah looks more like a partner. US correspondent James Matthews, reporting from the ground in Alaska, describes the meeting on the tarmac as \"extraordinary\".  There was the red carpet and more for a man with blood on his hands, he writes. Putin - aggressor, pariah and wanted for war crimes. Quite the CV for a man who was applauded on to the airbase by his host, the US president. It couldn't have looked more cordial - a superpower moment with a smile and a shake between the men who hold peace in their hands. Read more:Mapping the land Ukraine could be told to give upThe snowy remote base where Trump is hosting Putin If that wasn't enough, there followed a military flypast to dress the spectacle. A smiling Putin seemed duly impressed, but what it says about the power dynamic in the relationship will trouble onlookers in Ukraine - and one moment they may have found particularly galling. Posing for photographs with Trump before waiting media, Putin was asked: \"Will you stop killing civilians?\" To which he smiled, and gave it a deaf ear. Our international affairs editor Dominic Waghorn, in Kyiv, gauged the Ukrainian reaction to Putin's arrival - and says people are furious at the red carpet welcome extended by the Trump team. Images of US soldiers on their knees, unfurling the red carpet at the steps of the Russian leader's plane, have been going viral, he reports. Social media has been lit up with fury, anger, and disgust, he says. There are different ways of welcoming a world leader to this type of event, and Trump has gone all out to give a huge welcome to Putin, which is sticking in the craw of Ukrainians."
    },
    {
        "title": "Ukraine vows to continue drone attacks until there's a peace deal",
        "description": "Ukraine says there will be no let-up in its punishing long-range drone attacks on Russia until Moscow agrees to peace.",
        "url": "https://news.sky.com/story/ukraine-vows-to-continue-drone-attacks-until-theres-a-peace-deal-13412075",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kharkiv-ukraine-drone_6970464.jpg?20250722081348",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-15 10:08:00",
        "Headline": "Ahead of Donald Trump's meeting with Vladimir Putin in Alaska, one of the key commanders of Ukraine's drone forces tells Sky News their attacks on Russian territory will continue.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Ukraine says there will be no let-up in its punishing long-range drone attacks on Russia until Moscow agrees to peace. The warning comes ahead of Vladimir Putin meeting Donald Trump in Alaska. Ukraine war latest: Trump prepares for summit with Putin It was made in a rare interview with one of the key commanders of Ukraine's drone forces. We met in an undisclosed location in woods outside Kyiv. Brigadier General Yuriy Shchygol is a wanted man. There is a quiet, understated but steely resolve about this man hunted by Russia. His eyes are piercing and he speaks with precision and determination. His drone units have done billions of dollars of damage to Russia's economy and their range and potency is increasing exponentially. \n                  The moment Vladimir Putin has craved - a red carpet from Donald Trump for a man with blood on his hands\n                 \n                  What we expected from the Trump-Putin summit - and what actually happened\n                 \n                  Trump and Putin agree on 'many points' in Ukraine talks - but give little detail away\n                 \"Operations\", he said euphemistically, \"will develop if Russia refuses a just peace and stays on Ukrainian territory\". \"Initially, we had a few drones a month, capable of striking targets 100 to 250 kilometres away. Today, we have drones capable of flying 3,000 to 4,000 kilometres, and that's not the limit, it's constrained only by fuel supply, which can be increased\". His teams, together with special operation forces, had just carried off one of their most complicated and most devastating strikes yet. A massive fire was raging in an oil refinery in Volgograd, or Stalingrad as it was once called. \"If the refinery is completely destroyed, it will be one of the largest operations conducted,\" Brigadier General Shchygol said. \"There have been other major targets too, in Saratov and Akhtubinsk. Those refineries are now either non-operational or functioning at only 5% of capacity.\" Oil is potentially Vladimir Putin's Achilles heel. So much of his economy and war effort is dependent on it. Donald Trump could cripple Russia tomorrow if he sanctioned it but so has appeared reluctant to do so, a source of constant frustration for the Ukrainians. Military activity on both sides has increased as diplomacy has picked up pace.  In another long-range attack, Ukraine says it hit the port of Olya in Russia's Astrakhan region, striking a ship loaded with drone parts and ammunition sent from Iran. But on the ground, Russian forces have made a surprise advance of more than 15km into Ukrainian territory. Ukraine says the intrusion can be contained, but it adds to fears about its ability to hold back the Russians along the 1000-mile frontline. Read more from Sky News:Why was Putin invited to Alaska?Russia sends heavyweights to summitWhat to expect from pivotal meeting Russia launches almost nightly drone attacks on Ukraine's cities, killing civilians and striking residential targets. General Yuriy says Ukraine picks targets that hurt Russia's war effort, and it is constantly honing its capability. \"Each operation\", he says, \"uses multiple types of drones simultaneously, some fly higher, others lower. That is our technical edge.\" How satisfying, I asked, was it to watch so much enemy infrastructure go up in smoke? He answered with detached professionalism. \"It does not bring me pleasure, war can never be a source of enjoyment. Each of us has tasks we could fulfil in peacetime. But this is war; it doesn't bring satisfaction. However, it benefits the state and harms our enemy.\" Whatever happens in Alaska, General Yuriy and his teams will continue pioneering drone warfare, hitting Vladimir Putin's economy where it hurts most."
    },
    {
        "title": "Israel releases video showing public humiliation of prominent Palestinian prisoner",
        "description": "The spectacle of Israel's Itamar Ben-Gvir humiliating perhaps the most popular of all Palestinians in his prison cell was as unedifying as the national security minister's extremist politics.",
        "url": "https://news.sky.com/story/israel-releases-video-showing-public-humiliation-of-prominent-palestinian-prisoner-13412121",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ben-gvir-barghouti_6991601.jpg?20250815141840",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-15 11:47:00",
        "Headline": "Imprisoned since 2002 on murder charges and sentenced to five life sentences plus an additional 40 years for his role in the second intifada, 67-year-old Marwan Barghouti had not been seen in many years.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  The spectacle of Israel's Itamar Ben-Gvir humiliating perhaps the most popular of all Palestinians in his prison cell was as unedifying as the national security minister's extremist politics. \"You won't win. Whoever messes with the people of Israel, whoever murders our children, whoever murders our women, we will erase him,\" Ben-Gvir told Marwan Barghouti, the figurehead of secular Palestinian nationalism, who appeared shocked and scared. His lawyer told Al-Arabiya TV that Ben-Gvir threatened him directly and that his life is in danger. Imprisoned since 2002 on murder charges and sentenced to five life sentences plus an additional 40 years for his role in the second intifada, the 67-year-old had not been seen in many years. The sight of this drawn, diminished figure will shock many across the Arab world, where he is both hugely popular and considered a potential Palestinian unity leader, were Israel to ever release him. Barghouti's face, his hands cuffed above his head, stares out from walls and buildings across the West Bank - a potent symbol of Palestinian suffering and resistance in the face of the Israeli occupation. His more than two-decade imprisonment leaves him untarnished from the charges of corruption and ineffectiveness levelled at the Palestinian leadership, and opinion polls before 7 October 2023 saw his popularity exceed that of both Ismail Haniyeh, head of Hamas' political wing, and Palestinian Authority President Mahmoud Abbas. \n                  Over 100 people killed in Gaza in 24 hours, officials say, marking deadliest day in a week\n                 \n                  Inside settler violence in the West Bank\n                 \n                  Settlers and segregation: Inside the conflict forcing Palestinians from their homes\n                 In a statement, the Palestinian Authority condemned Ben-Gvir's visit as an \"unprecedented provocation and organised state terrorism\". It is also a clear abuse of Ben-Gvir's authority as national security minister, where he has ultimate oversight over Israel's prison system and therefore direct access to the record number of Palestinian detainees currently imprisoned there. Barghouti's family say he has been held in solitary confinement since the 7 October attacks and has been subjected to brutal assaults, one of which left him severely injured. Israeli mistreatment Barghouti will be no stranger to Israeli mistreatment. In an op-ed from jail to the New York Times in 2017, he detailed the first time he was tortured at the age of just 18, when an Israeli interrogator \"forced me to spread my legs while I stood naked in the interrogation room, before hitting my genitals\". He passed out from the pain, hitting his head, which scarred permanently. Afterwards, he wrote, the Israeli interrogator mocked him, saying he would \"never procreate because people like me give birth only to terrorists and murderers\". Barghouti's release has been a key component of ceasefire negotiations between Israel and Hamas, with talks in February 2024 breaking down when Israel refused to let him go. Despite international pressure on Israel to ensure the humane treatment of its prisoners, the ICRC has not been granted access to Palestinian prisoners in Israeli detention since the 7 October attacks. String of provocations Ben-Gvir and his fellow ultra-nationalist coalition partner, Finance Minister Bezalel Smotrich, both excel at the provocative act. Less than two weeks ago, Ben-Gvir was filmed visiting the Al-Aqsa mosque in Jerusalem where he said he prayed, which is in direct violation of the status quo agreement governing relations between Muslims and Jews at the key holy sites on Temple Mount. Bear in mind, it was Ariel Sharon's visit to Temple Mount in 2000, which launched the second intifada, and you will get a sense of quite how incendiary that was. Similarly, on Thursday, in what appeared to be a direct response to international calls for recognition of Palestinian statehood, Bezalel Smotrich announced that Israel would start the long-delayed E1 settlement project between the West Bank and East Jerusalem. This, he said, would \"bury\" any notion of a Palestinian state once and for all. The video showing the public humiliation of a man championed by the likes of Desmond Tutu and Jimmy Carter as the Palestinian Mandela, was released just hours later. It looks like an attempt by Benjamin Netanyahu's ultra-nationalist allies to send a message both to Palestinians and to international supporters of Palestinian statehood that a state, and its potential leadership, is nothing but a pipe-dream. 'Still pursuing' Barghouti in prison In 2013, Barghouti's wife, Fadwa, launched a campaign for his release and that of all Palestinian prisoners from Robben Island, where Mandela was imprisoned, to draw attention to the similarities between South Africa during the apartheid era and the plight of Palestinians under Israeli occupation. After the release of this latest video, she wrote on her Facebook page that she barely recognised her husband and was scared to imagine what he had been subjected to. Read more from Sky News:Inside the conflict forcing Palestinians from their homesThe city where what was law now has no place in reality But her words were also a rallying cry. \"They are still pursuing you, Marwan, and chasing you even in the solitary cell where you've been living for two years,\" she wrote. \"I know that nothing shakes you except what you hear about the pain of your people, and nothing defeats or pains you except the lack of protection for our sons and daughters. You are one of the people: wherever you are, you are among them, for them, with them.\""
    },
    {
        "title": "Two injured in shooting near Orebro mosque in Sweden",
        "description": "Two people have been injured after a shooting near a mosque in southern Sweden, police have said.",
        "url": "https://news.sky.com/story/two-injured-in-shooting-near-orebro-mosque-in-sweden-13412216",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sweden-orebro-mosque-shooting_6991754.jpg?20250815174733",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-15 15:17:00",
        "Headline": "Both victims were taken to hospital, the latest casualties of Sweden's lengthy wave of gang-related violence, police believe.",
        "Content": "Two people have been injured after a shooting near a mosque in southern Sweden, police have said. Police in the city of Orebro, around 125 miles (200km) west of the capital, Stockholm, have opened an attempted murder investigation after what they said was probably a gang-related incident and are searching for those responsible. Officers said in a statement: \"Based on the current situation regarding the shooting in Orebro, the incident is believed to be linked to the criminal network environment.\"   Both victims were taken to hospital, a police spokesperson said, without giving details on the extent of their injuries. Many emergency services were at the scene, and police told people to stay away. Investigators said the incident could be the latest in a wave of gang-related violence that has plagued Sweden for more than a decade. Criminal gangs often recruit teenagers in socially disadvantaged immigrant neighbourhoods to attack rivals. Local TV news channel TV4 said there has been tension between two gangs in Orebro recently. Police were called at around 1.45pm, local time, during Friday prayers, Swedish news outlet Dagens Nyheter said. It quoted a statement from the mosque that said it was \"not a target\". Read more from Sky News:What to expect from Ukraine summitBaby Shark plagiarism case rejectedTraditional world map 'should be torn up' Orebro saw Sweden's deadliest gun attack when 10 students and teachers were killed when a former student opened fire at the Campus Risbergska school in February. The perpetrator also took his own life in an outrage unrelated to gang violence, according to police who found no clear motive in the case. Sweden's Prime Minister Ulf Kristersson called it the worst shooting in the country's history. Last month, three men in their 20s were jailed for between 12-and-a-half years and life, over the fatal shooting of award-winning rapper C Gambino in Gothenburg last year. The musician's murder has been linked to a local gangland conflict."
    },
    {
        "title": "India 'will not tolerate' nuclear blackmail, says prime minister Narendra Modi in warning to Pakistan on Independence Day",
        "description": "India's Prime Minister has warned Pakistan it will not succumb to, or tolerate, nuclear blackmail.",
        "url": "https://news.sky.com/story/india-will-not-tolerate-nuclear-blackmail-says-prime-minister-narendra-modi-in-warning-to-pakistan-on-independence-day-13412000",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-narendra-modi-independence-day_6991366.jpg?20250815100358",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-08-15 07:47:00",
        "Headline": "It's a national day of celebration, but also a grim reminder of the tragedy of partition - the trauma of which still haunts India.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  India's Prime Minister has warned Pakistan it will not succumb to, or tolerate, nuclear blackmail. In Narendra Modi's 12th consecutive speech from the ramparts of Delhi's iconic Red Fort, he addressed the nation celebrating its 79th Independence Day from colonial Britain. He laid emphasis on 'Atmanirbhar', or self-reliance, in defending India by increasing and developing a more powerful weapons system for security. Mr Modi said: \"India has decided, we will not tolerate nuclear blackmail. We have established a new normal. Now we will not distinguish between terrorists and those who nurture and support terrorists. Both are enemies of humanity\" This comes on the back of the conflict in May after the killing of 26 people by terrorists in Pahalgam, Kashmir. In retaliation, India launched attacks on terrorist infrastructure across the border. Pakistan retaliated, which quickly escalated into both countries launching a series of missiles, armed drones and heavy gunfire on each other. After four days of fighting, a ceasefire was agreed to between the two nuclear-armed neighbours that have fought wars and many skirmishes over decades. \n                  More than 280 dead after flash floods hit India and Pakistan\n                 \n                  At least 56 dead and dozens missing after flash flooding in Indian Himalayas\n                 \n                  India flash floods: Race to find survivors after at least four killed as homes and hotels destroyed\n                 US President Donald Trump intervened saying: \"I know the leaders of Pakistan and India. I know [them] very well. And they're in the midst of a trade deal, and yet they're talking about nuclear weapons... this is crazy. \"I'm not doing a trade deal with you if you're going to have war, and that's a war that spreads to other countries, you'll get nuclear dust. When they start using nuclear weapons, that stuff blows all over the place and really bad things happen.\"  Pakistan Prime Minister Shehbaz Sharif immediately thanked the American president for the ceasefire and bringing about peace and stability in the region, also recommending him for the Nobel Peace Prize as a genuine peacemaker and his commitment to conflict resolution. Mr Modi's government is yet to acknowledge President Trump's intervention and maintains that the Pakistani military initiated the ceasefire process and India agreed to halt military action.  In parliament, India's Foreign Minister Subrahmanyam Jaishankar said: \"There was no leader... nobody in the world that asked India to stop its operations. This is something the prime minister also said. There was no linkage of trade in any of these conversations and there was no talk between the prime minister and President Trump.\" Mr Modi's speech is an audit of the year gone by and his future plans of strengthening the economy and of self-reliance in the face of very high tariffs imposed by President Trump for buying discounted Russian oil. He spoke of bringing in structural reforms, welfare schemes for farmers, women's empowerment, employment, technology, clean energy and the green industry, but also raised concerns about rising obesity levels. India has the fourth largest economy in the world and is expected to be the third largest before Mr Modi's current term ends in 2029. Although when it comes to GDP per capita income, which serves as an indicator of individual prosperity, India is ranked 144 out of 196 countries. The big economy illusion of GDP size has little to do with the well-being and fortune of its people, something the government refuses to acknowledge. Read more from Sky News:Deadly flooding hits Kashmir villageUK-India free trade deal examinedModi sworn in as PM for third time In its 2024 report, Paris-based World Inequality Lab said the inequality in India now is worse than under British rule. The research stated that 1% of the wealthiest Indians hold 40% of its wealth and enjoy a quarter of the nation's income. Comparing the 'British Raj' to the 'Billionaire Raj', the study said there are now 271 billionaires in the country and 94 new ones were added the previous year. The rise of top-end inequality in India has been particularly pronounced in terms of wealth concentration in the Modi years between 2014-15 and 2022-23.  With over 1.46 billion people, India is the most populous country, making up 17.8% of the global population. More than half the country is under 30, and it has one of the lowest old-age dependency ratios, enabling productivity, higher savings and investment. A key challenge for the government is to match employment with its growing young population. It's even more critical as artificial intelligence (AI) is increasingly used in production and services, eating into jobs. Last week, President Trump levied an additional 25% tariff on India for buying Russian oil, taking the total tariff level to over 50% and hitting Indian manufacturing and trade. \"I don't care what India does with Russia. They can take their dead economies down together,\" the president said. Since the Ukraine war, India has been buying discounted Russian crude and its imports have risen from 3% in 2021 to about 35% to 40% in 2024. Defending its stance, India says it does so for its energy security and to protect millions of its citizens from rising costs. It's a national day of celebration with patriotic fervour all around, but also a grim reminder of the tragedy of partition - the trauma of which still haunts its people."
    },
    {
        "title": "UK's trade envoy to Turkey resigns following visit to Northern Cyprus",
        "description": "The UK's trade envoy to Turkey, Afzal Khan, has resigned following a trip last week to Northern Cyprus.",
        "url": "https://news.sky.com/story/uks-trade-envoy-to-turkey160resigns-following-visit-to-northern-cyprus-13412422",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-afzal-khan-uk-trade-envoy_6992033.jpg?20250815210335",
        "type": "World",
        "Author": "Nick Stylianou, specialist producer",
        "Date Published": "2025-08-15 19:43:00",
        "Headline": "The MP for Manchester Rusholme, Afzal Khan, has resigned following a trip to the territory, which is not recognised by the British government as a self-declared independent nation.",
        "Content": "By Nick Stylianou, specialist producer  The UK's trade envoy to Turkey, Afzal Khan, has resigned following a trip last week to Northern Cyprus. It is a territory not recognised by the British government as a self-declared independent nation since Turkey's military invasion of the island in 1974. The MP for Manchester Rusholme was forced to quit just days after Sky News revealed the outrage from the Cypriot government, which called Mr Khan's actions \"absolutely condemnable\", insisting \"the relevant representations have been made to him for his unacceptable behaviour\". The spokesperson went on to say Mr Khan's actions \"are in complete contradiction with the established position of all British governments\". The Foreign Office said in a statement this week that Mr Khan's visit \"was undertaken in a personal capacity\", adding: \"There is no change to the government's long-standing position regarding the so-called 'Turkish Republic of Northern Cyprus'.\" On Friday, a UK government spokesperson said: \"Mr Khan has left his position as trade envoy to the Republic of Turkey.\" The Turkish Cypriot leader, Ersin Tatar, initially said Mr Khan was invited at his request after meeting him in Manchester a few months ago. \n                  Ukraine war latest: Trump says no deal reached on Ukraine yet - but tells joint news conference with Putin they made 'great progress'\n                 \n                  Trump and Putin agree on 'many points' in Ukraine talks - but give little detail away\n                 \n                  What we expected from the Trump-Putin summit - and what actually happened\n                 A video published by a newspaper showed Mr Khan posing for photos in Mr Tatar's office. He was awarded an honorary doctorate from the only university in Northern Cyprus on Monday. Shadow foreign secretary Dame Priti Patel had called for his resignation, and shadow foreign affairs minister Wendy Morton had also written to Europe minister Stephen Doughty to express \"deep concern\" at Mr Khan's visit. Ms Morton noted that he travelled via Tymbou airport (locally known as Ercan International Airport), to which the British government prevents direct flights. The Cypriot government considers the use of the airport to enter or exit the island illegal. Read more:Reeves refuses to rule out tightening inheritance tax rulesMoD urged to reveal details of nuclear incident at Faslane The president of the National Federation of Cypriots in the UK, which represents the more than 30,000 Cypriots in Britain, told Sky News: \"We welcome Afzhal Khan's resignation as the UK trade envoy to Turkey. His position was clearly untenable following his deeply inappropriate and unacceptable visit to occupied northern Cyprus. \"The UK has a special role in Cyprus as a guarantor power and permanent member of the UN Security Council. Mr Khan's condemnable actions compromised UK foreign policy, undermined the sovereignty of the Republic of Cyprus and contravened international law. \"We are very grateful to the Parliamentarians and media who stood with our UK Cypriot community and raised this issue.\" In a letter to Prime Minister Sir Keir Starmer shared with Sky News on Friday, Mr Khan wrote: \"This travel was unrelated to my role as trade envoy, however I understand the circumstances have generated controversy. It is my belief that trust in Parliament is paramount. Due to the attention this matter has drawn, I feel it is best to step down at this time, as to not distract from the hard work this Labour government is doing to secure the best possible trade deals and international relationships for our country.\""
    },
    {
        "title": "Why African campaign groups want the traditional world map scrapped",
        "description": "The African Union (AU) has backed a campaign to end the use of a 16th-century map in favour of one that more accurately displays Africa's size.",
        "url": "https://news.sky.com/story/why-african-campaign-groups-want-the-traditional-world-map-scrapped-13412037",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mercator-world-map_6991447.jpg?20250815114633",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-15 09:16:00",
        "Headline": "The Mercator map of the world is used by many governments and international organisations. But the Correct The Map campaign has revived criticism of its use.",
        "Content": "The African Union (AU) has backed a campaign to end the use of a 16th-century map in favour of one that more accurately displays Africa's size. The Mercator projection of the world distorts the sizes of some continents, enlarging areas near the poles like North America and Greenland while shrinking Africa and South America. This is the map currently used by many governments and international organisations, as well as schools and tech companies. Google Maps switched from using Mercator on desktops to a 3D globe view in 2018, though users can still switch back to Mercator if they prefer. On the mobile app, Mercator remains the default. \"It might seem to be just a map, but in reality, it is not,\" AU commission deputy chairperson Selma Malika Haddadi told the Reuters news agency. She said the Mercator projection fostered a false impression that Africa was \"marginal\", despite being the world's second-largest continent by area, with over a billion people. Such stereotypes then influence media, education and policy, Ms Haddadi said. Why it matters Criticism of the map is not new, but the debate has recently been revived by the Correct The Map campaign led by advocacy groups Africa No Filter and Speak Up Africa. The campaign urges organisations such as the World Bank and the United Nations to adopt the 2018 Equal Earth projection, which tries to reflect countries' true sizes. It is the first time the AU has endorsed the campaign. The union is a key driving force for the continent's political and economic development. Ms Haddadi said the AU aligns with the campaign's goal of \"reclaiming Africa's rightful place on the global stage\" amid growing calls for reparations for colonialism and slavery. The union will now move to advocate for wider map adoption and discuss collective actions with member states. 'The world's longest misinformation campaign' Moky Makura, an author and executive director of Africa No Filter, said the Mercator projection is simply \"wrong\". \"It's the world's longest misinformation and disinformation campaign, and it just simply has to stop,\" she said. Fara Ndiaye, co-founder of Speak Up Africa, added that the Mercator projection affected Africans' identity and pride, especially children who might encounter it early in school. \"We're actively working on promoting a curriculum where the Equal Earth projection will be the main standard across all [African] classrooms,\" she said, adding she hoped it would also be the one used by global institutions, including Africa-based ones. Read more from Sky News:What to expect from pivotal Ukraine summitBaby Shark plagiarism case rejected A World Bank spokesperson said they already use the Equal Earth for static maps and are phasing out Mercator on web maps. Correct The Map has sent a request to the UN geospatial body, which a UN spokesperson said would be reviewed and approved by a committee of experts."
    },
    {
        "title": "More than 280 dead after flash floods hit India and Pakistan",
        "description": "Flash flooding has killed more than 280 people in India and Pakistan over the last 24 hours, according to local officials.",
        "url": "https://news.sky.com/story/at-least-176-dead-after-flash-floods-hit-india-and-pakistan-13412122",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mingora-pakistan_6991553.jpg?20250815133448",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-15 12:10:00",
        "Headline": "Dozens of people are missing in both countries, while rescuers in Pakistan have evacuated 1,300 tourists trapped by flash flooding and landslides. Meanwhile, a helicopter carrying relief supplies has crashed in bad weather.",
        "Content": "Flash flooding has killed more than 280 people in India and Pakistan over the last 24 hours, according to local officials. Dozens more are missing after torrential rains struck two mountainous districts in the neighbouring countries. Some 1,600 people have been brought to safety. In India-controlled Kashmir, at least 60 people were killed in the remote Himalayan village of Chasoti in the Jammu and Kashmir region on Thursday. Chasoti, around 85 miles (136km) northeast of Jammu, is the last village accessible to vehicles on the route of an annual Hindu pilgrimage to a mountainous shrine, the Machail Mata temple. More than 80 people have been reported missing, and officials believe many of those were washed away in the floods. Forecasters say more heavy rains and floods could hit the area. Officials halted rescue operations overnight but rescued at least 300 people on Thursday. Meanwhile, in Pakistan, at least 243 people have died in flash floods, including 157 people in Buner district in the northwestern district of Khyber Pakhtunkhwa province. Authorities there have declared a state of emergency. Rescuers evacuated 1,300 tourists from the mountainous Mansehra district who were trapped by flash flooding and landslides in the Siran Valley on Thursday, according to Bilal Faizi, a provincial emergency service spokesman. A helicopter carrying relief supplies to the flood-hit northwestern region of Bajaur crashed on Friday due to bad weather, killing all five people on board, including two pilots, a government statement said. Read more from Sky News:Watch: Flash flood hits Indian villageIndia 'will not tolerate' nuclear blackmailWhy the world map should be changed Pakistan's disaster management agency has issued fresh alerts for glacial lake outburst flooding in the north, warning people to avoid affected areas. The Gilgit-Baltistan region has been hit by multiple floods since July, triggering landslides along the Karakoram Highway, a key trade and travel route linking Pakistan and China. A study released this week by World Weather Attribution, a network of international scientists, found rainfall in Pakistan between 24 June to 23 July was 10% to 15% heavier because of global warming."
    },
    {
        "title": "Trump and Putin agree on 'many points' in Ukraine talks - but give little detail away",
        "description": "Donald Trump has said there are \"many points\" he and Vladimir Putin agreed on after holding critical talks on the war in Ukraine - but no deal has been reached yet.",
        "url": "https://news.sky.com/story/trump-and-putin-agree-on-many-points-in-ukraine-talks-but-give-little-detail-away-13412403",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-ukraine_6992281.jpg?20250816004842",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-15 19:28:00",
        "Headline": "The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where Vladimir Putin arrived to a red carpet - the kind of welcome usually reserved for close US allies.",
        "Content": " Donald Trump has said there are \"many points\" he and Vladimir Putin agreed on after holding critical talks on the war in Ukraine - but no deal has been reached yet. Following the much-anticipated meeting in Alaska, which lasted more than two-and-a-half hours, the two leaders gave a short media conference giving little detail about what had been discussed, and without taking questions. Mr Trump described the meeting as \"very productive\" and said there were \"many points that we agreed on... I would say a couple of big ones\". Trump-Putin summit - latest updates But there are a few left, he added. \"Some are not that significant. One is probably the most significant, but we have a very good chance of getting there... \"We haven't quite got there, we've made some headway. There's no deal until there's a deal.\" Mr Putin described the negotiations as \"thorough and constructive\" and said Russia was \"seriously interested in putting an end\" to the war in Ukraine. He also warned Europe not to \"torpedo nascent progress\". After much build-up to the summit - with the US president threatening \"severe\" consequences for Russia should it not go well - it was ultimately not clear whether the talks had produced meaningful steps towards a ceasefire in what has been the deadliest conflict in Europe in 80 years. Mr Trump said he intended to speak with Ukrainian President Volodymyr Zelenskyy and other European leaders, who were excluded from the discussions, to brief them. Despite not reaching any major breakthrough, the US leader ended his remarks with a thank you, and said he would probably see Mr Putin again \"very soon\". When the Russian president suggested that \"next time\" would be Moscow, he responded by saying he might face criticism, but \"I could see it possibly happening\".  The red carpet treatment The news conference came after a grand arrival at the Elmendorf-Richardson military base in Anchorage, where the US president stepped down from Air Force One and later greeted his Russian counterpart with a handshake and smiles on a red carpet. Mr Putin even travelled alongside Mr Trump in the presidential limousine, nicknamed \"The Beast\". It was the kind of reception typically reserved for close US allies, belying the bloodshed and the suffering in the war. Before the talks, the two presidents ignored frantically-shouted questions from journalists - and Mr Putin appeared to frown when asked by one reporter if he would stop \"killing civilians\" in Ukraine, putting his hand to his ear as though to indicate he could not hear.  Our US correspondent Martha Kelner, on the ground in Alaska, said he was shouting \"let's go\" - apparently in reference to getting the reporters out of the room. Read more:Mapping the land Ukraine could be told to give upThe snowy remote base where Trump hosted Putin A '10/10' meeting During his first day back in the White House in January, Mr Trump had pledged confidently to bring about an end to the war in Ukraine. But seven months later, after infamously berating Mr Zelenskyy during a meeting at the Oval Office in February, and then stanching the flow of some US military assistance to Kyiv, he still does not appear to have brought a pause to the conflict. In an interview with Fox News before leaving Alaska, Mr Trump described the meeting with Mr Putin as \"warm\" and gave it a \"10/10\", but declined to give details about what they discussed. He also insisted that the onus going forward could be on Mr Zelenskyy \"to get it done\", but said there would also be some involvement from European nations. What happens next? Mr Trump is expected to speak to Mr Zelenskyy, Sir Keir Starmer and European leaders about the talks. A meeting of ambassadors from European countries has been scheduled for 8.30am UK time, EU presidency sources have told Sky News. European heads of state and Trump are also likely to have a virtual meeting later in the day."
    },
    {
        "title": "What we expected from the Trump-Putin summit - and what actually happened",
        "description": "A warm handshake, big smiles, and a red carpet - this was the welcome for Vladimir Putin as he touched down on US soil for critical negotiations on the war in Ukraine.",
        "url": "https://news.sky.com/story/what-we-expected-from-the-trump-putin-summit-and-what-actually-happened-13412404",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-vladimir-putin_6992244.jpg?20250815234202",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-15 19:31:00",
        "Headline": "There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself. The US president had threatened \"severe\" consequences for Russia should it not go well - but there was no mention of this following the talks.",
        "Content": " A warm handshake, big smiles, and a red carpet - this was the welcome for Vladimir Putin as he touched down on US soil for critical negotiations on the war in Ukraine. There had been much build-up to the summit in Anchorage, Alaska, not least from Donald Trump himself - with the US president having threatened \"severe\" consequences for Russia should it not go well. But more than two-and-a-half hours of talks resulted in just a brief news conference with little detail given away - and ultimately, no talk of a ceasefire and no deal on Ukraine reached yet. Here is what was expected from the meeting - based on information from the White House, Mr Trump and the Kremlin beforehand - and what happened on the night. One-on-one turned into three-on-three It was thought this would be a one-on-one meeting between Mr Trump and Mr Putin. Instead, the US president was joined by US secretary of state Marco Rubio and special envoy Steve Witkoff, while the Russian leader was supported by his foreign affairs advisor Yuri Ushakov and Russian foreign minister Sergei Lavrov. The change seemed to indicate the White House was perhaps taking a more guarded approach than during a 2018 meeting in Helsinki, where Mr Trump and Mr Putin met privately with interpreters. The US leader then shocked the world by siding with the Russian leader over US intelligence officials on whether Russia meddled in the 2016 presidential campaign. Rolling out the red carpet Mr Putin was given the kind of reception typically reserved for close US allies, belying the bloodshed and the suffering in the war he started. The two men greeted each other with a handshake and a smiling Mr Trump even applauded the Russian president as he approached him on the red carpet. Our international affairs editor Dominic Waghorn, in Kyiv, gauged the Ukrainian reaction to the arrival - and said people were furious at the welcome extended by the Trump team. Images of US soldiers on their knees, unfurling the red carpet at the steps of the Russian leader's plane, went viral, he said, with social media \"lit up with fury, anger, and disgust\". He added: \"There are different ways of welcoming a world leader to this type of event, and Trump has gone all out to give a huge welcome to Putin, which is sticking in the craw of Ukrainians.\" Any questions? Plenty. But no one was really given a chance to ask. Ahead of the talks, cameras were allowed inside for just a minute - and while this was enough time for a few journalists to shout some questions, these were ignored by the two leaders. \"President Putin, will you stop killing civilians?\" one shouted. In response, Mr Putin put his hand up to his ear as if he could not hear. In their brief media conference after the talks, Mr Putin spoke for almost nine minutes, while Trump took just three-and-a-half to say what he wanted to say. The two men then did not stay to answer questions from reporters. Before the event, the Kremlin said it could last between six and seven hours, but the whole visit lasted about four-and-a-half hours. 'Severe consequences' Ever since his inauguration in January, Mr Trump had been threatening serious consequences for Russia should a deal on Ukraine not be reached soon. Just two days after the ceremony, he took to social media to declare there could be \"high levels of taxes, tariffs and sanctions\" and called for an end to the \"ridiculous\" war. In February, he held what he described as a \"productive\" call with the Russian leader, and about two weeks later he infamously berated Ukrainian President Volodymyr Zelenskyy during a visit to the Oval Office - this one taking place in front of the world's media. Read more:The moment Putin cravedMapping the land Ukraine could be told to give up In July, he started to set deadlines for an end to the war - first giving Mr Putin 50 days and later reducing this to \"10 or 12 days\", before announcing the summit last week. Yesterday, Mr Trump insisted his Russian counterpart was \"not going to mess around with me\". However, while both men insisted the talks were \"productive\", it is not clear what agreements have been reached, and whether Ukraine is any closer to finding peace. The word ceasefire was not mentioned by either leader. Instead, they praised each other, with Mr Trump describing Mr Putin's remarks as \"very profound\" - and there was no mention of sanctions. A meeting with Mr Zelenskyy? It was expected that after the talks, Mr Trump could set the table for the next meeting with the Ukrainian president. While he said he would call Mr Zelenskyy, he made no public commitment to a meeting during the media conference. In an interview with Fox News after the summit, he said Russia and Ukraine would set a date to discuss next steps and a potential ceasefire deal, but did not provide further details on specifics or timings. \"They're going to set up a meeting now, between President Zelenskyy and President Putin and myself, I guess,\" Mr Trump said. He also said that European nations \"have to get involved a little bit\" but it is \"really up to President Zelenskyy to get it done\". Putin brought his own limo - but travelled in The Beast instead After shaking hands on the red carpet, the two leaders made their way towards their waiting vehicles. But despite Mr Putin arriving with his \"Aurus\" limousine, and it being spotted on the tarmac near the planes, he got into the American presidential limousine, known as \"The Beast\", to travel to the meeting location. The Russian president was seen with a wide smile on his face, while Mr Trump appeared to be waving to the crowds."
    },
    {
        "title": "Alaska's quiet is pierced with a cacophony of questions over Trump-Putin summit",
        "description": "On the Alaska governor's desk, the horned skull of a musk ox, an ice age relic, is proudly displayed, resting on a collage of pictures of the state.",
        "url": "https://news.sky.com/story/alaskas-quiet-is-pierced-with-a-cacophony-of-questions-over-trump-putin-summit-13411944",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-whittier-alaska-putin_6991204.jpg?20250815045948",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-08-15 03:31:00",
        "Headline": "Why was Putin invited here? What does he want? What's he willing to concede? And is Donald Trump about to walk into his trap?",
        "Content": "\n          US correspondent\n              @marthakelner\n  On the Alaska governor's desk, the horned skull of a musk ox, an ice age relic, is proudly displayed, resting on a collage of pictures of the state. It was hunted by Mike Dunleavy himself on a trip to an island in the Bering Sea, the narrow strait of water which separates the US from Russia, where Vladimir Putin's plane will cross into American airspace before his first foray onto US soil in almost a decade. The governor, the state's most senior politician, proudly tells me that there is another trophy from his hunting trips on show in the nearby airport, a large brown bear hide, encased in glass. Follow latest updates from Ukraine war Alaska is a vast wilderness which is sparsely populated. But the quiet is being pierced now by a cacophony of questions over this summit. Why was Putin invited here? What does he want? What's he willing to concede? And is Donald Trump about to walk into his trap? The summit will take place on a military base on the outskirts of Anchorage, Alaska's biggest city. It was thrown together at short notice so there were few venue options available, given the security that is required. Even so, many of the visiting journalists and support staff for politicians are staying in Airbnbs because there are not enough hotel rooms available for everyone. There is the sense that this is a momentous occasion. The last time Putin met a US president was in 2021, when he exchanged starkly differing views with Joe Biden in Geneva.  But that was before his invasion of Ukraine in 2022. He's been a pariah ever since, wanted by the International Criminal Court for alleged war crimes, including the abduction of Ukrainian children. With this invite, Trump is bringing him back in from the cold. I ask Governor Dunleavy whether Putin is being rewarded for his invasion of a sovereign nation. \"I don't think so,\" he replies, \"I think this is an opportunity for the president to sit down face to face [with Putin]. \"And the president is going to ascertain really quickly in a face-to-face meeting whether he's serious or not for peace. It's difficult to solve these wars unless you have a discussion with the participants.\" In a green, timber-framed house around the corner, Meg Leonard - a one-time Republican who describes herself as a \"never Trumper\" - has a different view. On a tree in her front garden, the Ukrainian flag hangs. She bought it after watching Zelenskyy's disastrous meeting with Trump in the Oval Office in February on TV. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summitUkrainians are appalled at Trump's naive and cack-handed diplomacy  Zelenskyy was mocked for not wearing a suit and told by Trump he \"didn't hold the cards\" in the situation. \"I think he was denigrating the president of Ukraine and that is not good,\" she says. \"Right after that, I ordered the flag and hung it up because I support Ukraine. Putin should not be allowed to take land that is not his. \"I think Donald Trump thinks he's a strongman and that Putin should capitulate to him. \"I don't think Putin has any intention of doing that.\"  Meg says she is appalled that this meeting is taking place one-on-one, without Ukraine's president. Trump has said that Vlodymyr Zelenskyy will be invited to any follow-up meeting. \"Trump should not be making decisions for Ukraine,\" Meg says, \"Zelenskyy should at least have a voice in what is being decided. It is his country and his people. \"Putin's going to be five miles from here. He's not welcome by me. He is an international criminal; he should be arrested. He is killing women and children, and people in hospitals.\" But you don't have to go far in Alaska to find a contrasting view. In Whittier, a port town mostly home to fishermen, boat operators and tourists, wildlife photographer Tim Colley from New York thinks Trump is an underestimated dealmaker. He's not concerned about Zelenskyy's absence from the summit. \"I think Trump truly wants peace,\" Tim says, \"At some point in time, you've got to decide how many more people need to die. Does Zelenskyy want to just keep throwing people into the fire? \"I think these two guys [Trump and Putin] have probably the ultimate egos in the world. I'm not sure Zelenskyy's got the self-control to tread lightly on those egos.\" There is a symbolism to this meeting taking place in Alaska. The US bought the state from Russia in 1867. It's an example of how territories can be traded. Ukraine is nervous that their land may, too, be carved up, without them in the room. Trump has promised that is not on the table in this initial meeting with Putin, but the US president is famously unpredictable. When he met with Putin in 2018 in Helsinki, he went against his own intelligence community to side with the Russian president, suggesting there hadn't been Russian interference in the 2016 presidential election. The people of Ukraine, who are enduring a terrifying and intensifying onslaught from Russia, will watch nervously as this summit takes place thousands of miles away without an advocate for them in attendance."
    },
    {
        "title": "Putin: The Russian bear back in the fold",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>  ",
        "url": "https://news.sky.com/story/putin-the-russian-bear-back-in-the-fold-13411934",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/sky-news-trump-100-saudi-arabia_6913749.jpg?20250716070238",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-15 01:07:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    It's been 10 years since Vladimir Putin came to the US to meet a president and tensions are running high. Donald Trump seems confident he can get a deal, Moscow however is cautious to predict the outcome. Whatever the conclusion, is Putin, back on US soil being welcomed back into the fold by Trump? The Trump100 team are in Alaska preparing for one of Trump's most crucial summits yet. Plus they speak to Sky's Moscow correspondent Ivor Bennett to work out exactly how Putin must be thinking in the hours before the meet. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk.You can also watch all episodes - on our YouTube channel."
    },
    {
        "title": "Man accused of shooting US politicians while posing as a police officer has charges upgraded",
        "description": "A man accused of murdering a US politician and wounding another while pretending to be a police officer is facing upgraded state charges.",
        "url": "https://news.sky.com/story/man-accused-of-shooting-us-politicians-while-posing-as-a-police-officer-has-charges-upgraded-13411936",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vance-boelter-minnesota_6942861.png?20250615184208",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-15 02:00:00",
        "Headline": "A county attorney has said the charges against Vance Boelter now \"reflect the weight\" of his crimes.",
        "Content": "A man accused of murdering a US politician and wounding another while pretending to be a police officer is facing upgraded state charges. Just a week after Vance Boelter, 57, pleaded not guilty in court, a fresh indictment was announced on Thursday. In the state case against him, he now faces two charges of first-degree murder, four counts of attempted first-degree murder and charges of impersonating a police officer and animal cruelty for shooting one family's dog. Hennepin County attorney Mary Moriarty said the charges now \"reflect the weight of Mr Boelter's crimes\". There is also a federal case against Boelter, where he faces six counts of murder, stalking and firearms violations. The murder charges could carry the federal death penalty.  In June, there was a manhunt after Representative Melissa Hortman and her husband, Senator John Hoffman, were shot dead in their Minnesota home. \n                  Suspect in killing of US politician went to homes of other lawmakers in same night, officials say\n                 \n                  Suspect in shooting of Minnesota politicians captured after two-day manhunt\n                 \n                  'It feels like a bad dream': Minnesota mourns victims of 'politically motivated assassination'\n                 Police said they responded to gunfire reports at the home of Democrat senator John Hoffman and his wife, Yvette, shortly after 2am and found them with multiple gunshot wounds. Read more from Sky News:What to expect from Trump-Putin summitNational Guard on streets of Washington DC They then checked on the Hoffmans, who lived nearby, and saw what appeared to be a police car and a man dressed as an officer leaving the front door. \"The individual immediately fired upon the officers, who exchanged gunfire, and the suspect retreated back into the home\" and escaped on foot, said Brooklyn Park police chief Mark Bruley. Authorities believe it was Boelter wearing a mask as he posed as a police officer and approached the victims' front doors. He is also thought to have used a vehicle resembling a squad car. Several AK-style firearms and a list of about 70 names, which included politicians and abortion rights activists, were allegedly found inside the vehicle later on."
    },
    {
        "title": "Russia's master negotiator knows Trump's weaknesses and will try to exploit them",
        "description": "Vladimir Putin will know exactly how he wants this to play out.",
        "url": "https://news.sky.com/story/russias-master-negotiator-knows-trumps-weaknesses-and-will-try-to-exploit-them-13411937",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin_6991195.jpg?20250815035920",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2025-08-15 02:33:00",
        "Headline": "Vladimir Putin will have to give the appearance of making concessions because he knows the American president can't lose face here. He must have something to show from this summit.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n Vladimir Putin will know exactly how he wants this to play out. He is the master negotiator who's been doing this for decades. He'll be across all the details, the history and the legal arguments. And he'll know that his opponent is not. Follow latest updates from Ukraine war His strategy will be to exploit that. I think the ultimate aim for the Kremlin leader is to convince Donald Trump that the quickest path to peace is a deal on Russia's terms. But he can't present it like that. He'll have to give the appearance of making concessions because he knows the American president can't lose face here. He must have something to show from this summit.  That something could be the promise of a meeting with Volodymyr Zelenskyy, which Trump has once again talked up the chances of. But if that's the case, I suspect it'll be a loose promise, with strings attached. Something the White House can claim is progress, but may prove unachievable. I expect the Russian president will seek to play on Trump's desire for a rapid resolution to the conflict and his desire to take credit for it. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summit That's why Putin has been buttering him up ahead of the meeting, praising Trump's \"energetic and sincere\" efforts to find peace. I think he'll also try to appeal to Trump's transactional nature and seek to tempt him with various sweeteners that could come from siding with Russia.  That means things like rare earth deals and joint projects in the Arctic, which is why the Russian delegation includes finance minister Anton Siluanov and Kremlin investment envoy Kirill Dmitriev. It also includes defence minister Andrei Belousov, which might suggest that Putin is serious about proposing a deal on nuclear arms control, after raising the prospect of it on Thursday. Only one pact remains between the US and Russia, and it expires in February. A new one would almost certainly be a prize the American president would go for.  The challenge for Putin is to make Trump feel like he is the one in charge. For the former KGB agent, that might not be too tricky."
    },
    {
        "title": "Government will not offer bailout to UK's largest bioethanol plant",
        "description": "The UK's largest bioethanol plant is set for closure with the loss of 160 jobs after the government confirmed it would not offer a bailout deal to the facility in Lincolnshire.&#160;",
        "url": "https://news.sky.com/story/government-will-not-offer-bailout-to-uks-largest-bioethanol-plant-13412143",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vivergo-bioethanol_6950889.jpg?20250626072546",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-15 12:28:00",
        "Headline": "Owners Vivergo, a subsidiary of Associated British Foods, had warned that the plant would close without government support, and sources at the company have told Sky News the wind-down process is now likely to begin.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n The UK's largest bioethanol plant is set for closure with the loss of 160 jobs after the government confirmed it would not offer a bailout deal to the facility in Lincolnshire.  Owners Vivergo, a subsidiary of Associated British Foods, had warned that the plant would close without government support, and sources at the company have told Sky News the wind-down process is now likely to begin. An ABF spokesperson, which also owns Primark, said the government's decision was \"deeply regrettable\" and it had \"chosen not to support a key national asset\". They added that the government had \"thrown away billions in potential growth in the Humber and a sovereign capability in clean fuels that had the chance to lead the world\". Vivergo have blamed the UK's trade deal with the United States, which ended a 19% tariff on imported ethanol, for making the plant unviable. Ethanol tariffs were cut along with those on beef as part of the UK-US deal, which focused on reducing or removing Donald Trump's import taxes on UK cars and aerospace parts. The plant, which converts wheat into the fuel typically added to petrol to reduce carbon emissions, was already losing £3m a month before the trade deal, with industrial energy prices, the highest among developed economies, cited as a major factor. \n                  Trump's son-in-law Kushner takes stake in UK lender OakNorth\n                 \n                  Money latest: Warning 100 supermarkets could close due to government plan; congestion discount tip could be worth £1,000\n                 \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 Vivergo and ABF have warned of the threat to the plant since the spring, but had hoped negotiations with the government would lead to an improved offer by the end of the week. On Friday morning, they were told there would be no bailout. Government sources said they had employed external consultants to provide advice, and pointed out that the plant had not been profitable since 2011. Read more:How trade deal could bring about collapse of renewable energy plant MoD urged to reveal details of nuclear incident at FaslaneUK quarterly GDP slows as economy feels effect of higher business costs A government spokesman said: \"Direct funding would not provide value for the UK taxpayer or solve the long-term problems of the bioethanol industry.\" \"This government will always take decisions in the national interest. That's why we negotiated a landmark deal with the US which protected hundreds of thousands of jobs in sectors like auto and aerospace. \"We have worked closely with the companies since June to understand the financial challenges they have faced over the past decade, and have taken the difficult decision not to offer direct funding as it would not provide value for the taxpayer or solve the long-term problems the industry faces. \"We recognise this is a difficult time for the workers and their families and we will work with trade unions, local partners and the companies to support them through this process. \"We also continue to work up proposals that ensure the resilience of our CO2 supply in the long-term in consultation with the sector.\" Unite general secretary Sharon Graham said the government's decision not to provide support to the UK's bioethanol industry was \"short-sighted\" and \"totally disregards the benefits the domestic bioethanol sector will bring to jobs and energy security\". \"Once again, the government's total lack of a plan to support oil and gas workers as the industry transitions is glaring,\" Ms Graham added. GMB Union's Charlotte Brumpton-Childs said the closure of the Hull and Redcar bioethanol plants would result in \"working people losing their livelihoods\", adding that this was the impact of tariffs and trade deals. \"They're not numbers in a spreadsheet. These are lives put on hold and communities potentially devastated,\" she said."
    },
    {
        "title": "Trump's son-in-law Kushner takes stake in UK lender OakNorth",
        "description": "The private equity firm set up by Jared Kushner, President Donald Trump's son-in-law, is to take a stake in OakNorth, the British-based lender which has set its sights on a rapid expansion in the US.",
        "url": "https://news.sky.com/story/trumps-son-in-law-kushner-takes-stake-in-uk-lender-oaknorth-13412055",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jared-kushner-donald-trump_6991409.jpg?20250815104918",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-15 09:45:00",
        "Headline": "Affinity Partners, which was founded by Jared Kushner in 2021, is buying an 8% shareholding in the digital lender, which is targeting rapid expansion in the US, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm set up by Jared Kushner, President Donald Trump's son-in-law, is to take a stake in OakNorth, the British-based lender which has set its sights on a rapid expansion in the US. Sky News has learnt that Affinity Partners, which has amassed billions of dollars in assets under management, has signed a deal to acquire an 8% stake in OakNorth. The deal is expected to be concluded in the coming weeks, industry sources said on Friday. Mr Kushner established Affinity Partners in 2021 after leaving his role as an adviser to President Trump during his first term in the White House. He is married to Ivanka, the president's daughter. Affinity manages money for a range of investors including the sovereign wealth funds of Qatar and Saudi Arabia. Insiders said that Affinity Partners was buying the OakNorth stake from an unidentified existing investor in the digital bank. \n                  Government will not offer bailout to UK's largest bioethanol plant\n                 \n                  Money latest: Warning 100 supermarkets could close due to government plan; congestion discount tip could be worth £1,000\n                 \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 The valuation at which the transaction was taking place was unclear, although OakNorth was valued at $2.8bn in its most recent funding round in 2019. OakNorth, which was founded by Rishi Khosla, is targeting substantial loan growth in the US in the coming years. Earlier this year, it agreed to buy Community Unity Bank (CUB), which is based in Birmingham, Michigan, in an all-share deal. The transaction is awaiting regulatory approval. OakNorth began lending in the US in 2023 and has since made roughly $1.3bn of loans. The bank is chaired by the former City watchdog chair Lord Turner, and is among a group of digital-only British banks which are expected to explore stock market listings in the next few years. Monzo, Revolut and Starling Bank are all likely to float by the end of 2028, although London is far from certain to be the destination for all of them. Similarly, OakNorth's ambition to grow its US presence means it is likely to be advised by bankers that New York is a more logical listing venue for the business. Launched in 2015, the bank is among a group of lenders founded after the 2008 financial crisis. Its UK clients include F1 Arcade and Ultimate Performance, both of which have themselves expanded into the US market. Its existing backers include the giant Japanese investor SoftBank, GIC, the Singaporean state fund, and Toscafund, the London-based asset management firm. Since its launch, OakNorth has lent around £12.5bn and boasts an industry-leading loan default ratio. Last year, it paid out just over £30m to shareholders in its maiden dividend payment. OakNorth has been growing rapidly, saying this year that it had recorded pre-tax profits of £214.8m in 2024, up from £187.3m the previous year. It made more than £2.1bn of new loans last year. On Friday, a spokesperson for OakNorth declined to comment."
    },
    {
        "title": "Thousands more Afghans affected by second data breach, ministers say",
        "description": "Thousands more Afghan nationals may have been affected by another data breach, the government has said.",
        "url": "https://news.sky.com/story/thousands-more-afghans-affected-by-second-data-breach-ministers-say-13412464",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-afghanistan-royal-marine_6649597.jpg?20240807101344",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-08-15 20:37:00",
        "Headline": "Names, passport details and other information from up to 3,700 Afghans brought to the UK between January and March 2024 have potentially been impacted after a cyber security breach at a third party supplier, the MoD says.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Thousands more Afghan nationals may have been affected by another data breach, the government has said. Up to 3,700 Afghans brought to the UK between January and March 2024 have potentially been impacted as names, passport details and information from the Afghan Relocations and Assistance Policy has been compromised again, this time by a breach on a third party supplier used by the Ministry of Defence (MoD). This was not an attack directly on the government but a cyber security incident on a sub-contractor named Inflite - The Jet Centre - an MoD supplier that provides ground handling services for flights at London Stansted Airport.    The flights were used to bring Afghans to the UK, travel to routine military exercises, and official engagements. It was also used to fly British troops and government officials. Those involved were informed of it on Friday afternoon by the MoD, marking the second time information about Afghan nationals relocated to the UK has been compromised. It is understood former Tory ministers are also affected by the hack. Earlier this year, it emerged that almost 7,000 Afghan nationals would have to be relocated to the UK following a massive data breach by the British military that successive governments tried to keep secret with a super-injunction. Defence Secretary John Healey offered a \"sincere apology\" for the first data breach in a statement to the House of Commons, saying he was \"deeply concerned about the lack of transparency\" around the data breach, adding: \"No government wishes to withhold information from the British public, from parliamentarians or the press in this manner.\"  The previous Conservative government set up a secret scheme in 2023 to relocate Afghan nationals impacted by the data breach, but who were not eligible for an existing programme to relocate and help people who had worked for the British government in Afghanistan. The mistake exposed personal details of close to 20,000 individuals, endangering them and their families, with as many as 100,000 people impacted in total. Read more from Sky News:Data breach victims sent spam emailsAfghan data leak timelineMoD urged to reveal details of nuclear incident A government spokesperson said of Friday's latest breach: \"We were recently notified that a third-party sub-contractor to a supplier experienced a cyber security incident involving unauthorised access to a small number of its emails that contained basic personal information. \"We take data security extremely seriously and are going above and beyond our legal duties in informing all potentially affected individuals. The incident has not posed any threat to individuals' safety, nor compromised any government systems.\" In a statement, Inflite - The Jet Centre confirmed the \"data security incident\" involving \"unauthorised access to a limited number of company emails\". \"We have reported the incident to the Information Commissioner's Office and have been actively working with the relevant UK cyber authorities, including the National Crime Agency and the National Cyber Security Centre, to support our investigation and response,\" it said. \"We believe the scope of the incident was limited to email accounts only, however, as a precautionary measure, we have contacted our key stakeholders whose data may have been affected during the period of January to March 2024.\""
    },
    {
        "title": "Government will not offer bailout to UK's largest bioethanol plant",
        "description": "The UK's largest bioethanol plant is set for closure with the loss of 160 jobs after the government confirmed it would not offer a bailout deal to the facility in Lincolnshire.&#160;",
        "url": "https://news.sky.com/story/government-will-not-offer-bailout-to-uks-largest-bioethanol-plant-13412143",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vivergo-bioethanol_6950889.jpg?20250626072546",
        "type": "Politics",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-15 12:28:00",
        "Headline": "Owners Vivergo, a subsidiary of Associated British Foods, had warned that the plant would close without government support, and sources at the company have told Sky News the wind-down process is now likely to begin.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n The UK's largest bioethanol plant is set for closure with the loss of 160 jobs after the government confirmed it would not offer a bailout deal to the facility in Lincolnshire.  Owners Vivergo, a subsidiary of Associated British Foods, had warned that the plant would close without government support, and sources at the company have told Sky News the wind-down process is now likely to begin. An ABF spokesperson, which also owns Primark, said the government's decision was \"deeply regrettable\" and it had \"chosen not to support a key national asset\". They added that the government had \"thrown away billions in potential growth in the Humber and a sovereign capability in clean fuels that had the chance to lead the world\". Vivergo have blamed the UK's trade deal with the United States, which ended a 19% tariff on imported ethanol, for making the plant unviable. Ethanol tariffs were cut along with those on beef as part of the UK-US deal, which focused on reducing or removing Donald Trump's import taxes on UK cars and aerospace parts. The plant, which converts wheat into the fuel typically added to petrol to reduce carbon emissions, was already losing £3m a month before the trade deal, with industrial energy prices, the highest among developed economies, cited as a major factor. \n                  Trump's son-in-law Kushner takes stake in UK lender OakNorth\n                 \n                  Money latest: Warning 100 supermarkets could close due to government plan; congestion discount tip could be worth £1,000\n                 \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 Vivergo and ABF have warned of the threat to the plant since the spring, but had hoped negotiations with the government would lead to an improved offer by the end of the week. On Friday morning, they were told there would be no bailout. Government sources said they had employed external consultants to provide advice, and pointed out that the plant had not been profitable since 2011. Read more:How trade deal could bring about collapse of renewable energy plant MoD urged to reveal details of nuclear incident at FaslaneUK quarterly GDP slows as economy feels effect of higher business costs A government spokesman said: \"Direct funding would not provide value for the UK taxpayer or solve the long-term problems of the bioethanol industry.\" \"This government will always take decisions in the national interest. That's why we negotiated a landmark deal with the US which protected hundreds of thousands of jobs in sectors like auto and aerospace. \"We have worked closely with the companies since June to understand the financial challenges they have faced over the past decade, and have taken the difficult decision not to offer direct funding as it would not provide value for the taxpayer or solve the long-term problems the industry faces. \"We recognise this is a difficult time for the workers and their families and we will work with trade unions, local partners and the companies to support them through this process. \"We also continue to work up proposals that ensure the resilience of our CO2 supply in the long-term in consultation with the sector.\" Unite general secretary Sharon Graham said the government's decision not to provide support to the UK's bioethanol industry was \"short-sighted\" and \"totally disregards the benefits the domestic bioethanol sector will bring to jobs and energy security\". \"Once again, the government's total lack of a plan to support oil and gas workers as the industry transitions is glaring,\" Ms Graham added. GMB Union's Charlotte Brumpton-Childs said the closure of the Hull and Redcar bioethanol plants would result in \"working people losing their livelihoods\", adding that this was the impact of tariffs and trade deals. \"They're not numbers in a spreadsheet. These are lives put on hold and communities potentially devastated,\" she said."
    },
    {
        "title": "TikTok stars help govt highlight risks of travelling abroad for cosmetic procedures ",
        "description": "Influential TikTok stars are to help the government highlight the risks of travelling abroad for cosmetic procedures. ",
        "url": "https://news.sky.com/story/tiktok-stars-help-govt-highlight-risks-of-travelling-abroad-for-cosmetic-procedures-13411969",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tiktok-influencer-surgery_6991235.jpg?20250815071429",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-15 05:57:00",
        "Headline": "The campaign forms part of wider efforts to crack down on \"cowboy\" cosmetic procedures, amid warnings that the medical complications can be life-changing or even fatal.",
        "Content": "Influential TikTok stars are to help the government highlight the risks of travelling abroad for cosmetic procedures.  A new campaign will explain how hair transplants and dental treatments can go wrong overseas, so Britons can make \"more informed choices before they go under the knife\". Videos featuring well-known medical influencers such as Midwife Marley and Doc Tally are planned, with clips urging patients to speak to British doctors first. Other top tips include avoiding package holidays that include procedures, checking a surgeon's credentials and how their clinic is regulated, and understanding aftercare. These influencers have tens of thousands of followers, and may manage to reach those who are less likely to see government warnings in newspapers and on TV. It forms part of wider efforts to crack down on \"cowboy\" cosmetic procedures, amid warnings that medical complications can be life-changing or even fatal. Last month, Sky's Katie Barnfield spoke to one woman who was left unable to swallow after developing botulism that was linked to an unlicenced anti-wrinkle injection. \n                  Thousands more Afghans affected by second data breach, ministers say\n                 \n                  Sam Rimmer: Mum's plea to find e-bike riders who shot dead son in Liverpool three years ago\n                 \n                  Sixty more people to be prosecuted for 'showing support' for proscribed Palestine Action, Met Police says\n                  The disease is so rare that many doctors have never seen it in their entire careers - with slurred speech and breathing problems among the common symptoms. Meanwhile, one woman nearly died after contracting sepsis from a liquid Brazilian butt lift procedure carried out by a non-medical practitioner here in the UK. At one point, Louise Taylor was told that her leg may need to be amputated to save her life. Read more UK news:Cost of weight loss drug could surge by 170%Oasis fan dies in hotel room - hours before gig  The government hopes teaming up with TikTok stars - and campaigns like it - will tackle medical tourism and ensure the NHS isn't footing the bill when things go wrong. Health minister Karin Smyth said: \"Too many people are being left with life-altering injuries after going abroad for medical procedures, without access to proper advice or safeguards. \"Often drawn in by deals too good to be true and promoted by influencers - some of whom have never been to the practice in question.\" Foreign Office minister Stephen Doughty said travelling overseas for treatment must not be done lightly, adding: \"Informed choices today can help avoid serious complications tomorrow.\""
    },
    {
        "title": "Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court",
        "description": "A High Court judge is to decide if a hotel has breached planning rules by becoming a site for migrant accommodation.",
        "url": "https://news.sky.com/story/battle-to-prevent-the-bell-hotel-in-epping-from-housing-asylum-seekers-reaches-high-court-13412359",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-essex-bell-hotel-epping_6967902.jpg?20250718155828",
        "type": "Politics",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-08-15 18:28:00",
        "Headline": "Epping Forest District Council wants to prevent asylum seekers staying at the hotel, where protests have taken place after two men staying there were charged with sexual offences, including one involving a 14-year-old girl.",
        "Content": "\n          News correspondent\n              @esadiya\n A High Court judge is to decide if a hotel has breached planning rules by becoming a site for migrant accommodation. And the case that could have repercussions for councils across the country where asylum seekers are housed in hotels. Epping Forest District Council wants an interim injunction against The Bell Hotel in the town, which is owned by Somani Hotels, to prevent it being used as migrant accommodation, arguing the premises was not operating as intended as a hotel. Lawyers for the council called it \"a very serious problem\" and said it was creating \"a feeding ground for unrest,\" stating that there is an \"overwhelming case for an injunction\". Opening the hearing at the High Court in London on Friday, Philip Coppel KC, for the council, said it was a problem that was \"getting out of hand\" and \"causing great anxiety\" to local people. Protests have taken place outside the hotel after two men staying there were charged with sexual offences in separate incidents, including one involving a 14-year-old girl. Mr Coppel said there was \"no agreement between [asylum seekers] and the hotel, they do not choose the duration of their stay... they do not choose the type of room\". \n                  What do Ukrainians think of Trump-Putin Alaska summit?\n                 \n                  Clampdown on social media ads for Channel crossings unveiled\n                 \n                  Man suffers cardiac arrest on boat trying to reach UK\n                 The hotel \"is no more a hotel [to asylum seekers] than a borstal to a young offender\", he said. Barristers for the hotel group told the court that an injunction would cause asylum seekers \"hardship\" and that the move would set \"a dangerous precedent that protests justify planning injunctions\". Piers Riley-Smith, for Somani Hotels Limited, said the company did not argue that residents' concerns \"are not genuine\", but that they did not justify an interim injunction to stop the use of the hotel. \"Those particular ideological, non-community concerns are not relevant to planning,\" he said. The council had \"not shown any evidence\" that it had \"grappled with the hardship\" that would be caused to asylum seekers, the Home Office and the company if a temporary injunction was granted, Mr Riley-Smith said. 50,000 migrants come to UK More than 50,000 migrants have crossed the Channel in small boats since Sir Keir Starmer became prime minister last July. The barrister told the court that what was happening at The Bell Hotel \"is occurring in hotels across the country\" and that the Home Office has a \"statutory duty\" to provide temporary emergency accommodation for asylum seekers. During Mr Riley-Smith's submissions, the judge, Mr Justice Eyre said: \"I think I can take judicial notice that there has been no diminution of the need for accommodation for asylum seekers.\" More on this story:Man denies sex assault chargesEpping protests the 'latest flashpoint' Migrants were housed at the hotel from May 2020 to March 2021, and from October 2022 to April 2024 and the court heard the council never instigated any formal enforcement proceedings against this use. Council 'entirely wrong' In April 2025, they were once again being placed there and Mr Riley-Smith said that a planning application was not made \"having taken advice from the Home Office\". In written submissions, the barrister said it was \"entirely wrong\" for the council to \"suggest the use has been hidden from them\", saying it was \"directly approached in February 2025 by the Home Office before the use began and alerted to the upcoming usage\". He said an injunction would be a \"draconian step,\" and warned granting one would cause harm. \"The main harm would be the loss of accommodation for asylum seekers currently being housed there under the Home Office's statutory duties,\" he said. Mr Justice Eyre is due to deliver his decision on Tuesday."
    },
    {
        "title": "More than 280 dead after flash floods hit India and Pakistan",
        "description": "Flash flooding has killed more than 280 people in India and Pakistan over the last 24 hours, according to local officials.",
        "url": "https://news.sky.com/story/at-least-176-dead-after-flash-floods-hit-india-and-pakistan-13412122",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mingora-pakistan_6991553.jpg?20250815133448",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-15 12:10:00",
        "Headline": "Dozens of people are missing in both countries, while rescuers in Pakistan have evacuated 1,300 tourists trapped by flash flooding and landslides. Meanwhile, a helicopter carrying relief supplies has crashed in bad weather.",
        "Content": "Flash flooding has killed more than 280 people in India and Pakistan over the last 24 hours, according to local officials. Dozens more are missing after torrential rains struck two mountainous districts in the neighbouring countries. Some 1,600 people have been brought to safety. In India-controlled Kashmir, at least 60 people were killed in the remote Himalayan village of Chasoti in the Jammu and Kashmir region on Thursday. Chasoti, around 85 miles (136km) northeast of Jammu, is the last village accessible to vehicles on the route of an annual Hindu pilgrimage to a mountainous shrine, the Machail Mata temple. More than 80 people have been reported missing, and officials believe many of those were washed away in the floods. Forecasters say more heavy rains and floods could hit the area. Officials halted rescue operations overnight but rescued at least 300 people on Thursday. Meanwhile, in Pakistan, at least 243 people have died in flash floods, including 157 people in Buner district in the northwestern district of Khyber Pakhtunkhwa province. Authorities there have declared a state of emergency. Rescuers evacuated 1,300 tourists from the mountainous Mansehra district who were trapped by flash flooding and landslides in the Siran Valley on Thursday, according to Bilal Faizi, a provincial emergency service spokesman. A helicopter carrying relief supplies to the flood-hit northwestern region of Bajaur crashed on Friday due to bad weather, killing all five people on board, including two pilots, a government statement said. Read more from Sky News:Watch: Flash flood hits Indian villageIndia 'will not tolerate' nuclear blackmailWhy the world map should be changed Pakistan's disaster management agency has issued fresh alerts for glacial lake outburst flooding in the north, warning people to avoid affected areas. The Gilgit-Baltistan region has been hit by multiple floods since July, triggering landslides along the Karakoram Highway, a key trade and travel route linking Pakistan and China. A study released this week by World Weather Attribution, a network of international scientists, found rainfall in Pakistan between 24 June to 23 July was 10% to 15% heavier because of global warming."
    },
    {
        "title": "Comedian Milton Jones reveals he's cancer free",
        "description": "Comedian Milton Jones has revealed he is cancer free after being treated for prostate cancer.",
        "url": "https://news.sky.com/story/comedian-milton-jones160reveals-hes-cancer-free-13412062",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-milton-jones-comedian_6991419.jpg?20250815110120",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-08-15 11:18:00",
        "Headline": "Milton Jones, the king of the surreal one-liner, is returning to the stage after receiving treatment for prostate cancer a few months ago.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Comedian Milton Jones has revealed he is cancer free after being treated for prostate cancer. In April, the 61-year-old, who is known for his appearances on Mock The Week, announced he was cancelling a number of UK tour dates to undergo surgery. Jones said in a statement: \"A few months ago, I had to stop my tour HA!MILTON because I needed treatment for prostate cancer. I'm glad to say I've had that treatment and am now cancer-free! \"So, many thanks to all the doctors and nurses who helped me get better - I couldn't do their job (I tried, but apparently you have to be qualified).\" Thanking his family, friends and fans, he went on to joke: \"I have to admit there were a few dark moments when I wondered if anyone would ever see me again, but then I realised that I was leaning against the light switch. \"Thankfully, I'm now in a completely different place, and if you look at my website, you'll see that very soon I'll be in lots of other different places on tour too\". Jones picks up his tour on 15 September in Stafford, touring until the end of November 2025. The show, whose name is a play on the title of the hit musical Hamilton, promises laughter and unforgettable comedy moments, as well as jokes about giraffes and tomatoes. The Richmond-born comedian has been hailed as the king of the one-liner, basing his jokes on clever wordplay and surreal humour. He has performed on Live At The Apollo, Lee Mack's All Star Cast, and Michael McIntyre's Comedy Roadshow."
    }
]