[
    {
        "title": "Prince Andrew insisted on 'gag order' to stop allegations spoiling Queen's Platinum Jubilee, memoir claims",
        "description": "Prince Andrew insisted his accuser, Virginia Giuffre, sign a one-year gag order - to prevent details of her allegations tarnishing the late Queen's platinum jubilee, her memoirs have claimed.",
        "url": "https://news.sky.com/story/prince-andrew-insisted-on-gag-order-to-stop-allegations-spoiling-queens-platinum-jubilee-memoir-claims-13452459",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-queen_7054320.jpg?20251018162000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-18 14:50:00",
        "Headline": "In her book to be published posthumously next week, Virginia Giuffre also claimed Andrew's ex-wife Sarah Ferguson, and daughters Princess Beatrice and Princess Eugenie were also almost drawn into the case.",
        "Content": " Prince Andrew insisted his accuser, Virginia Giuffre, sign a one-year gag order - to prevent details of her allegations tarnishing the late Queen's platinum jubilee, her memoirs have claimed. Andrew relinquished his Duke of York title and remaining honours on Friday evening. It came after discussions with King Charles, in consultation with the Prince of Wales, both of whom wanted to bring an end to the long-lasting scandal. But, according to The Telegraph, Ms Giuffre's book, which is due out on Tuesday, is focusing further attention on the sexual assault allegations and the prince's friendship with paedophile Jeffrey Epstein, which led to the royal's downfall. She tells how Andrew's \"disastrous\" Newsnight interview with Emily Maitlis was like an \"injection of jet fuel\" for her legal team, and it raised the possibility of \"subpoenaing\" his ex-wife Sarah Ferguson, and daughters Princess Beatrice and Princess Eugenie and drawing them into the legal case.  The Telegraph also reports Ms Giuffre's claims that she got \"more out of\" Andrew than a reported £12m payout and $2m (around £1.4m) donation to her charity because she had \"an acknowledgement that I and many other women had been victimised and a tacit pledge to never deny it again\". The former duke paid to settle a civil sexual assault case with Ms Giuffre in 2022, despite insisting he had never met her. \n                  How Prince Andrew allegations unfolded and his titles were lost\n                 \n                  Why William and Camilla likely had influential roles in decision over Prince Andrew's titles\n                 \n                  Everything we know about Prince Andrew's titles decision\n                 Ms Giuffre alleged she was forced to have sex with the prince when she was 17, after being trafficked by Epstein. Andrew continues to vehemently deny her allegations. Read more:Andrew giving up title is 'Victory for Virginia'Everything we know about Andrew losing titlesPrince Andrew: A timeline of events Queen Elizabeth II was celebrating her platinum jubilee in 2022 - the first British monarch to reach the milestone - as the civil case against her son was gathering pace. It was settled nine days after she reached the 70th anniversary of her accession. According to the Telegraph, Ms Giuffre, who died in April, reveals in her book: \"I agreed to a one-year gag order, which seemed important to the prince because it ensured that his mother's platinum jubilee would not be tarnished any more than it already had been.\" In January 2022, a US judge ruled the civil case against Andrew could go ahead, and the Queen went on to strip him of his honorary military roles, with the prince also giving up his HRH style. 'Devastating' interview His 2019 Newsnight interview, which he hoped would clear his name, backfired when he said he \"did not regret\" his friendship with convicted paedophile Epstein, who trafficked Ms Giuffre. Andrew also said he had \"no recollection\" of ever meeting Ms Giuffre and added he could not have had sex with her in March 2001 because he was at Pizza Express with his daughter Beatrice on the day in question. Ms Giuffre, whose book is called Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice, wrote, according to The Telegraph: \"As devastating as this interview was for Prince Andrew, for my legal team it was like an injection of jet fuel. \"Its contents would not only help us build an ironclad case against the prince but also open the door to potentially subpoenaing his ex-wife, Sarah Ferguson, and their daughters, Princesses Beatrice and Eugenie.\" 'Amazed he was stupid enough' She also told how Andrew had \"stonewalled\" her legal team for months before settlement discussions began moving very quickly when his deposition was scheduled for March 2022. Ms Giuffre also wrote she was \"amazed\" that a member of the royal family would be \"stupid enough\" to appear in public with the convicted paedophile, after a photo of the pair walking in New York emerged. Andrew, who remains a prince and continues to live in the Crown Estate property Royal Lodge, said on Friday the \"continued accusations about me distract from the work of His Majesty and the royal family\". He insisted he was putting his \"family and country first\" and would stop using \"my title or the honours which have been conferred upon me\". Gloria Allred, a US lawyer who represented 27 of Epstein's victims, said she welcomed the news the prince had relinquished his Duke of York title, saying it was \"some consequence\". But in an interview with Sky News, she added: \"It's not everything, in terms of a measure of justice.\""
    },
    {
        "title": "Why William and Camilla likely had influential roles in decision over Prince Andrew's titles",
        "description": "It's not the first seismic statement I've had to deal with from the Royal Family late into the evening.",
        "url": "https://news.sky.com/story/why-william-and-camilla-likely-had-influential-roles-in-decision-over-prince-andrews-titles-13452138",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prince-william-kate_7022291.jpg?20250916164527",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-18 09:26:00",
        "Headline": "\"It might feel like we have heard this all before, but after the latest details of Prince Andrew's relationship with Jeffrey Epstein it seems the Royal Family has just had enough.\"",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It's not the first seismic statement I've had to deal with from the Royal Family late into the evening. But what I have learnt from past experience is that when they do come in this way, it's because the decision has been made to act now and act fast. Which inevitably has us all wondering, why now?  The latest stories about Prince Andrew and his email to Jeffrey Epstein were again a sign of just how close he'd been to the convicted paedophile, and an extract released from the late Virginia Giuffre's book was heartbreaking and excruciatingly seedy. And yes, the full book is released on Tuesday. But in some ways, we have heard a lot of these lurid details before, albeit allegations that Prince Andrew denies. Which is why it feels like this time, the family had just had enough. It's framed as a personal statement from Andrew, but the involvement of his relatives could not be any clearer: \"In discussion with the King, and my immediate and wider family,\" he writes, followed up by, \"with His Majesty's agreement, we feel I must now go a step further\". It has always been hard to get a full picture of how much the King has engaged in the problems with his brother. Speak to those who know the family well and they'll tell you our current monarch \"doesn't like confrontation\", just like Queen Elizabeth II. And while there has always remained \"a warm familial feeling between the two brothers\" which we've seen through Andrew's appearance at family events, it is \"tempered by the King's responsibilities as head of state to be entirely separate from the perceived, real or alleged activities of the Duke of York\". In the end, as head of the institution, and not as his brother, the King would have had to lead the discussions about the Andrew problem, but I suspect with heavy involvement from his eldest son and wife. William, only in recent weeks, has told us there will be change when he becomes monarch, his advisors stressing he isn't afraid to question why the Royal Family continues to do things in a certain way. His very visible unease at standing next to Prince Andrew at the Duchess of Kent's funeral showed us how uncomfortable he felt about his uncle being there at such a public moment. His involvement in those discussions behind the scenes and making sure the institution was seen to be taking action against Andrew is likely to have been considerable.  I know that Queen Camilla is also a quiet but hugely powerful influence behind palace walls. She is her husband's listening ear, sounding board, but also not afraid to tell him when she believes there needs to be change. Her own work to break taboos around sexual violence and encourage survivors to speak out must have made it even more difficult for her to read the stories about Andrew's links to Epstein, and the sexual allegations against her brother-in-law, even though he has always vehemently denied them. And then there are those closest to the Prince. You have to have sympathy with his daughters, Princess Beatrice and Princess Eugenie. Did they tell their father that he needed to do something for their sake to try and shut down the noise? His ex-wife, Sarah Ferguson, has also been burned in recent weeks by her association with Epstein - a spectre who, despite his death, has continued to haunt the royal family. So what of Prince Andrew? How will this impact him? Any sense he might have a chance at returning to some kind of public life has truly evaporated. We wait to see if, with time, he is again allowed to appear at least for family occasions. I've always been told \"he is robust and self-contained and always has been\". Interpret that how you will - arrogance that he could ride it out, or a very strongly-held conviction that he has never done anything wrong? Either way, he clearly believes he has been unfairly punished by the court of public opinion. One thing a source did tell me is that there is a sense he's never really needed the affirmation of his family. Read more from Sky News:Andrew named in Epstein filesHarry denies fight with AndrewAuthor: Andrew has no public future He may not need their emotional support, but in the end, we have again seen how no member of the family is bigger than the institution. Protecting the reputation of \"the firm\" has to come first. Prince Andrew may feel that he has done the right thing, even done his family a favour, by personally relinquishing the use of his titles and honours, but this, in the end, was not just his choice. No longer to be known as HRH or the Duke of York, he is now Prince Andrew only - ultimately forced to fall on his sword by his own family."
    },
    {
        "title": "US airstrike destroyed 'drug-carrying submarine', says Trump - as survivors repatriated",
        "description": "Two survivors of a US airstrike, targeting what Donald Trump has described as a \"drug-carrying submarine\" in the Caribbean, have been repatriated to their home countries.",
        "url": "https://news.sky.com/story/us-airstrike-destroyed-drug-carrying-submarine-says-trump-as-survivors-repatriated-13453002",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sub-caribbean-narcotics_7055030.png?20251019000950",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-18 22:33:00",
        "Headline": "The American military rescued two people after striking a submersible vessel on Thursday as part of an ongoing operation in the Caribbean. The campaign has been ordered by the Trump administration to target what the US president has called \"narcoterrorists trafficking illegal drugs\".",
        "Content": "Two survivors of a US airstrike, targeting what Donald Trump has described as a \"drug-carrying submarine\" in the Caribbean, have been repatriated to their home countries. The US president posted footage of Thursday's operation, part of a recent military campaign targeting boats transporting drugs to America. \"It was my great honor to destroy a very large DRUG-CARRYING SUBMARINE that was navigating towards the United States on a well known narcotrafficking transit route,\" Mr Trump wrote on Truth Social. \"US intelligence confirmed this vessel was loaded up with mostly Fentanyl, and other illegal narcotics,\" he added. The US military staged a helicopter rescue for the survivors on Thursday after the strike on their semi-submersiblevessel, suspected of trafficking illegal narcotics. They were then transported to a US Navy warship. Two other crew members on board were killed. President Trump confirmed the survivors would be returned to their home countries of Colombia and Ecuador \"for detention and prosecution\". Both countries subsequently confirmed they had been handed over. \n                  Inside Pablo Escobar's home city where drugs are readily available to a traffic jam of cars\n                 \n                  'I don't care': Colombia's president says US violating international law after visa revoked\n                 \n                  At least 17 dead in Colombia after car bombing and helicopter attack\n                 \"America will not tolerate narcoterrorists trafficking illegal drugs, by land or by sea,\" he added. On Saturday, Colombian President Gustavo Petro posted on X: \"We have received the Colombian detained on the narco submarine, we are happy he is alive and he will be processed according to the law.\"  Read more from Sky News:Venezuela's president pleads for peaceIs Trump planning to attack Venezuela?Venezuela's Nobel Peace Prize winner The Trump administration has said previous strikes in the Caribbean have killed 27 people, raising concerns among some about the legality of the military operations. The strikes also come against the backdrop of a US military buildup in the Caribbean that includes guided missile destroyers, F-35 fighter jets, a nuclear submarine and around 6,500 troops as the US president escalates a standoff with the Venezuelan government.  On Wednesday, Mr Trump disclosed he had authorised the CIA to conduct covert operations inside Venezuela, adding to speculation in Caracas that the US is attempting to topple Venezuelan President Nicolas Maduro. Mr Maduro has denied any connection to drug smuggling and claimed the US boat strikes are a pretext for regime change, and violations of sovereignty and international law."
    },
    {
        "title": "Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says",
        "description": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned.",
        "url": "https://news.sky.com/story/brexit-impact-on-uk-economy-negative-for-foreseeable-future-bank-of-england-chief-says-13452747",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-bailey-bank_7054686.jpg?20251018182824",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-18 18:12:00",
        "Headline": "The bank's governor, Andrew Bailey, said for nearly a decade he had been careful to \"take no position on Brexit\" but when asked directly about its impact on economic growth he \"had to answer that question\".",
        "Content": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned. Bank of England governor Andrew Bailey said a decline in the UK's potential growth rate from 2.5% to 1.5% over the past 15 years was linked to lower productivity growth, an ageing population, trade restrictions - and post-Brexit economic policies. But he did add that the economy is, however, likely to adjust and find balance again in the longer term. \"Over the longer term, there will be - because trade adjusts - some at least partial rebalancing,\" he added. Speaking at an international banking seminar on Saturday in Washington DC, Mr Bailey said: \"For nearly a decade, I have been very careful to say that I take no position per se on Brexit, which was a decision by the people of the UK, and it is our job as public officials to implement it. \"But, I quite often get asked a second question: what's the impact on economic growth? \"And as a public official, I have to answer that question. \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Reeves seeks outsider to run Britain's banking watchdog\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \"And the answer is that for the foreseeable future it is negative.\" However, Mr Bailey did say investment in innovation and new technologies, including AI, may help address the decline in productivity growth in the long run. \"If we take account of the impact of ageing and trade restrictions, we're really putting our chips on investment,\" he added. \"We're putting our chips on general-purpose technology, and AI looks like the next general-purpose technology, so we need to work with it. \"We need to ensure that it develops appropriately and well.\" Read more from Sky:You can't win every investment, says chancellorSidemen partner lands backing from Osborne-led firmMr Bailey warned that, although AI is likely to usher in a breakthrough in productivity long-term, it may \"in the current circumstances, be a risk to financial stability through stretched valuations in the markets\". \"It doesn't undermine the fact that AI, in my view, is likely, in addressing this slower growth issue, that we have and the consequences of it - that it is actually the best hope we have, and we really do need to do all we can to foster it,\" he said.  The Bank of England governor's prediction comes as Chancellor Rachel Reeves is under pressure ahead of next month's budget, with official figures showing muted growth in August following a surprise contraction in July. Inflation surge The Office for National Statistics (ONS) said gross domestic product (GDP) rose by 0.1% month-on-month in August and fell by 0.1% in July, in a revision to the previous estimate for no growth. In the three months to August, GDP grew by 0.3% compared with 0.2% growth in the three months to July, the ONS said. The latest figures come after the International Monetary Fund earlier this week forecast UK inflation was set to surge to the highest in the G7 in 2025 and 2026."
    },
    {
        "title": "Hamas hands over bodies of two more hostages, Israel confirms",
        "description": "Israel has received the bodies of two more hostages from the Red Cross, the Israeli prime minister's office has confirmed.",
        "url": "https://news.sky.com/story/hamas-hands-over-bodies-of-two-more-hostages-israel-confirms-13452925",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sarch-for-bodies-gaza_7055042.jpg?20251019012216",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-18 19:51:00",
        "Headline": "It comes as Israel increased pressure on the militant group to share the rest more quickly under their ceasefire agreement.",
        "Content": " Israel has received the bodies of two more hostages from the Red Cross, the Israeli prime minister's office has confirmed. Shortly after 10pm UK time on Saturday, Israel's military said Hamas handed over \"two coffins of deceased hostages\". There has been no identification of the bodies yet. The news came as tensions were beginning to rise over the closure of the Rafah border crossing between Gaza and Egypt. Benjamin Netanyahu's office had said earlier on Saturday evening that it would stay closed \"until further notice\" - as the deadline for Hamas to return the bodies of the hostages had passed with no confirmation. Mr Netanyahu had warned that its reopening would depend on how Hamas fulfilled its role in returning the remains of all 28 dead hostages. The handover brings the count of returned bodies to 12 hostages, up from 10, according to Israel's tally. Another 16 deceased hostages would then still have to be returned. \n                  Donald Trump plays peacemaker as domestic struggles grow\n                 \n                  Has Trump made peace in the Middle East?\n                 \n                  Why Gaza peace agreement seems to finally suit the key players after two years of war\n                 All 28 were supposed to have been handed over by last Monday. The handover of remains is among key points - along with aid deliveries into Gaza and the devastated territory's future - in the ceasefire process meant to end two years of war. Israel's foreign ministry had originally said the Rafah crossing would likely reopen on Sunday - another step in the fragile ceasefire. This has now been revised to being closed \"until further notice\". A fully reopened crossing would make it easier for Gazans to seek medical treatment, travel internationally or visit family in Egypt, which is home to tens of thousands of Palestinians. It is unclear who will operate the crossing's heavily damaged Gaza side once the war ends. Meanwhile, Gaza's ruins were being scoured for the dead, over a week into a ceasefire. Newly recovered bodies brought the Palestinian toll above 68,000, according to Gaza's Health Ministry. Read more:Watch: Evidence of Israeli support for Gaza militiaGaza health authorities struggling to identify bodiesViolence that plagues Gaza The ministry, part of the Hamas-run government, does not distinguish between civilians and combatants in its count. But the ministry maintains detailed casualty records that are seen as generally reliable by UN agencies and independent experts.  Famine declared Israel has disputed them without providing its own toll. Hamas-led militants killed around 1,200 people, mostly civilians, and abducted 251 people in the attack on southern Israel that sparked the war on October 7 2023. Gaza's more than two million people are hoping the ceasefire will bring relief from the humanitarian disaster caused by Israel's offensive. Throughout the war, Israel restricted aid entry to Gaza - sometimes halting it altogether.  Famine was declared in Gaza City, and the UN says it has verified more than 400 people who died of malnutrition-related causes, including more than 100 children. Officials in Israel say they have let in enough food, accusing Hamas of stealing much of it. The UN and other aid agencies deny this claim. Hamas has again accused Israel of violating the ceasefire, claiming that 38 Palestinians had been killed since it began on Monday. There has been no immediate response from Israel. Hamas accuses Israel of violations On Friday, Gaza's Civil Defence, first responders operating under the Hamas-run interior ministry, said nine people were killed when their vehicle was hit by Israeli fire in Gaza City. The Civil Defence said the car crossed into an Israeli-controlled area in eastern Gaza. Israel's military said it saw a \"suspicious vehicle\" crossing the so-called yellow line and approaching troops. It said it fired warning shots, but the vehicle continued to approach in a manner that posed an \"imminent threat\". The army said it acted in accordance with the ceasefire."
    },
    {
        "title": "Leading candidates to chair grooming gangs inquiry revealed - with both set to face a survivors' panel this week",
        "description": "A former police officer and a social worker are the leading candidates to chair the government's national inquiry into grooming gangs, Sky News has learned.",
        "url": "https://news.sky.com/story/leading-candidates-to-chair-grooming-gangs-inquiry-revealed-with-both-set-to-face-a-survivors-panel-this-week-13452934",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anonymous-teenager_6983780.jpg?20250805225703",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-10-18 20:15:00",
        "Headline": "The two prospective candidates are former police officer Jim Gamble and social worker Annie Hudson.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n A former police officer and a social worker are the leading candidates to chair the government's national inquiry into grooming gangs, Sky News has learned. The two prospective candidates, Jim Gamble and Annie Hudson, are due to meet a survivors' panel on Tuesday. That group will then pass on their reflections of the candidates to the Home Secretary Shabana Mahmood and Prime Minister Sir Keir Starmer to decide who leads the inquiry. The prime minister launched the inquiry into grooming gangs after an audit by Baroness Louise Casey showed the scale of the problem. Some victims have already expressed concern that the two candidates' backgrounds in policing and social work might lead to conflicts of interest. \"These are exactly the institutions that let us down,\" said one campaigner. Others want the inquiry to be judge-led, including shadow justice secretary Robert Jenrick, who believes the chair should have \"deep experience\" of criminal cases. \n                  Prince Andrew insisted on 'gag order' to stop allegations spoiling Queen's Platinum Jubilee, memoir claims\n                 \n                  Why William and Camilla likely had influential roles in decision over Prince Andrew's titles\n                 \n                  Everything we know about Prince Andrew's titles decision\n                 However, both candidates have had careers tackling child abuse, and Mr Gamble has on several occasions challenged police and other institutions over child protection failures. He began his career as a police officer in Northern Ireland, rising to become head of RUC special branch in Belfast, but is best known for his work combating child abuse. In 2006, he headed up the Child Exploitation and Online Protection Centre, which revolutionised the approach to policing online child abuse networks. Its investigations are said to have led to more than 1,000 arrests before Mr Gamble resigned in 2010 when the then Home Secretary Theresa May decided to merge his unit with other departments. He also headed up Operation Ore, the UK's largest ever police investigation into who was viewing internet child abuse images. It identified more than 7,000 suspects and led to more than 2,000 convictions. In 2021, he examined evidence gathered by Sky News into an Asian grooming gang in Humberside and was critical of the police investigation, calling on forces to treat group-based child abuse \"as seriously as we treat terrorism\". He added: \"This is organised, industrial-level rape.\" In 2022, he led an independent inquiry into the strip-search of a black schoolgirl in Hackney known as \"Child Q\", concluding that racism was a factor, including \"adultification bias\", in which adults perceive black children as being older than they are because they see them as more streetwise. The rival candidate, Annie Hudson, was appointed as chair of the child safeguarding practice review panel in December 2020. Before that, she was director of children's services at the London Borough of Lambeth, having held the same role at Bristol City Council. Hudson was also previously chief executive of the College of Social Work. In 2012, she was given a national Social Worker of the Year award for her 'outstanding contribution to social work'. She is also the lead trustee for safeguarding at Oxfam. Political heat has been ramped up on the government to show progress with the inquiry. Last week, a motion in parliament expressed \"deep concern\" that four months on from the announcement of the inquiry,\"no chair has been appointed, no terms of reference have been published, and no hearings or local investigations have begun\". A Home Office Spokesperson said: \"The abuse of children by grooming gangs is one of the most horrific crimes imaginable. We will do everything in our power to ensure these crimes never happen again. \"We are working urgently to appoint the best chair to take forward this work, to get to the truth and deliver justice to the survivors. It would be wrong to provide a running commentary on that process while it is still under way.\""
    },
    {
        "title": "Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce",
        "description": "Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years.",
        "url": "https://news.sky.com/story/oil-and-gas-workers-offered-cash-to-retrain-in-major-plan-for-future-clean-energy-workforce-13452705",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wind-turbine-wind-farm_7054926.jpg?20251018213008",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-18 23:01:00",
        "Headline": "Unions welcome the new plan but warn funding for training does not equate to jobs, saying they won't materialise without further investment, nor measures to revitalise the country's dwindling manufacturing capacity.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years. Up to £18m of new money has been pledged by the UK and Scottish governments specifically to move those working in the oil and gas sector into new roles. Their jobs are about to fall off a cliff as the industry declines, with at least 40,000 of the current 115,000 jobs forecast to disappear by the early 2030s. Almost all of those roles are thought to be fairly easily transferable into green industries - requiring little more than a few months of extra training. But in the absence of government help, workers have been moving abroad, industry says, taking with them the expertise Britain badly needs to for its new greener energy system. And it has left them feeling forgotten about after years of working to keep the lights on, and increasingly swayed by Reform UK, both GMB and Unite unions have warned Labour. Pledge to double green jobs by 2030 \n                  Britain's winter blackout risk the lowest in six years\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Energy bill payers to back 'super-battery' projects\n                 Energy Secretary Ed Miliband told Sky News that creating jobs in sectors like carbon capture and storage and hydrogen would help \"create a future for those in the North Sea communities\". The new £18m will pay for careers advice, training, and \"skills passports\" to enable oil and gas workers to make the switch without having to repeat qualifications. The cash was announced on Sunday in the new Clean Energy Jobs Plan, which details how the government hopes to make good on its promise to double green jobs by 2030.  Mr Miliband said in an interview: \"This plan shows 400,000 extra jobs in the clean energy economy by 2030. \"This isn't a target. This is actually what we believe is necessary to meet all the plans we have across the economy.\" The first strategy of its kind hopes to plug the UK's massive skills gap that threatens to derail the government's target to green the electricity system by 2030. It identifies 31 priority occupations that are particularly in demand, such as plumbers, electricians and welders, and lists a target to convert five colleges into new \"Technical Excellence Colleges\" to train workers. 'You can't train people for jobs that aren't there' Unions welcomed the plan, but pointed out that skills and training do not equate to new jobs. They say it will mean nothing without extra money and a revitalised domestic supply chain to build all the green technology needed, from fibreglass wind turbines to aluminium sub-sea cables. Sharon Graham, the Unite general secretary who has threatened to cut ties with Labour over its policy to end North Sea oil and gas drilling and watering down of a ban on zero-hours contracts, welcomed the \"initial steps\" but called for \"an equally ambitious programme of public investment\". Professor Paul de Leeuw from the Energy Transition Institute in Aberdeen said the plan was \"genuinely new and different\", and had for the first time joined up relevant information and strategies in one place. But \"you can't train people for jobs that aren't there\", he added, also calling for an investment plan.f Reform heartlands could benefit from Labour's jobs plan The boom in clean energy jobs stands to benefit Reform heartlands along the east coast of Britain. That fact is more by luck than design, given the east coast's proximity to offshore wind farms and carbon capture and storage fields in the North Sea. Reform promises a radically different vision for the country's future, based on reopening coal mines and maxing out nuclear power and what's left of North Sea oil and gas to boost jobs and the economy. Its deputy leader, Richard Tice, objects to land being used for solar panels and pylons. Government modelling forecasts an additional 35,000 direct jobs in Scotland, 55,000 in the East of England and 50,000 in the North West. To keep the unions sweet, the government will also have to follow through on its pledge to boost the rights of those working offshore in green energy. A current loophole gives protections like the minimum wage to oil and gas workers in UK territorial seas, but not to workers in the clean energy sector."
    },
    {
        "title": "Socialite Lady Annabel Goldsmith dies",
        "description": "Lady Annabel Goldsmith, the socialite who gave her name to a famous Mayfair nightclub, has died aged 91.",
        "url": "https://news.sky.com/story/socialite-lady-annabel-goldsmith-remembered-as-simply-irreplaceable-after-death-13452540",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-princess-diana-jemima-khan_7054474.jpg?20251018171449",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-18 17:09:00",
        "Headline": "The socialite Lady Annabel Goldsmith lent her name to the famous London nightclub of the rich and famous, Annabel's, in Mayfair.",
        "Content": "Lady Annabel Goldsmith, the socialite who gave her name to a famous Mayfair nightclub, has died aged 91. Her son Ben Goldsmith, an environmentalist and financier, described her as \"quite simply irreplaceable\" and said her life had been \"extraordinary and complete\". The widow of flamboyant billionaire financier Sir James Goldsmith died peacefully in her sleep on Saturday morning, her family said. Mr Goldsmith paid tribute to his mother in a statement to The Times newspaper, which read: \"She was quite simply irreplaceable. \"We are bereft, not for her - because her life has been extraordinary and complete - but for us, because of the immense hole in our lives she leaves behind. \"I spoke to her every day for 45 years. She truly had my back and we loved each other very much. I will miss her terribly.\" Lady Annabel was also mother to former Conservative minister and now Lord Zac Goldsmith, as well as writer and producer Jemima Goldsmith, entrepreneur Robin Birley and artist India Jane Birley. \"It is with great sadness that we announce the passing of our mother, Lady Annabel Goldsmith, who died peacefully in her sleep this morning at the age of 91,\" her children said in a joint statement. Born Lady Annabel Vane-Tempest-Stewart in 1934, she was the aristocratic daughter of the eighth Marquess of Londonderry. She married her first husband, Mark Birley, at the age of 19. He named the private members' club Annabel's, in London's Mayfair, after her. It has since become a destination for the rich and famous. Diana, Princess of Wales, with whom Lady Annabel was friends, held her hen do at the exclusive club. Her eldest son, Rupert, disappeared off the coast of West Africa in 1986 and was assumed to have died. Robin, the second son she had with Mark Birley, was mauled and permanently scarred by a tiger as a child at a private zoo. Lady Annabel later had an affair with Sir James, and went on to marry him. She described him as \"the most dynamic, charismatic and irresistible man I had ever come across\". She told The Guardian in 2009: \"My happiness in my life has nothing to do with being elite. \"Give me dogs, give me children, give me books and I'll be happy.\" Lady Annabel said people always assumed she was haughty, but insisted \"really I'm not\". She wrote a number of books, including a memoir of her life in 2004."
    },
    {
        "title": "Donald Trump responds to idea of tunnel connecting Russia and US ",
        "description": "Russia's investment envoy has said research into the feasibility of a tunnel joining the US and Russia started \"six months ago\".",
        "url": "https://news.sky.com/story/donald-trump-responds-to-idea-of-tunnel-connecting-russia-and-us-13452151",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin-alaska_6992429.jpg?20250816091711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-18 10:46:00",
        "Headline": "The link proposal between the US and Russia reflects an \"enduring vision\", investment envoy Kirill Dmitriev has said.",
        "Content": "Russia's investment envoy has said research into the feasibility of a tunnel joining the US and Russia started \"six months ago\". Kirill Dmitriev first posted about the idea on Thursday, suggesting a \"Putin-Trump\" rail tunnel could connect the two countries under the Bering Strait, which separates Russia's vast and sparsely populated Chukotka region from Alaska. Asked about the idea during a press conference with Ukraine's President Volodymyr Zelenskyy on Friday, Donald Trump called it \"interesting\". He also asked President Zelenskyy what he made of it, to which Mr Zelenskyy replied: \"I'm not happy with this idea.\" This prompted laughter from the US side.  Overnight, Mr Dmitriev posted on X, saying: \"We have started the feasibility study of the Russia-Alaska tunnel six months ago. \"Russian Direct Investment Fund with partners financed on a commercial basis the first ever railroad bridge between Russia and China. \"The bridge reduced cargo route by more than 700 kilometres,\" he said. He directed a post on X towards Elon Musk, suggesting the tunnel could be dug by the billionaire's construction firm, Boring Company. \"The dream of a US-Russia link via the Bering Strait reflects an enduring vision - from the 1904 Siberia-Alaska railway to Russia's 2007 plan,\" Mr Dmitriev wrote. \"RDIF has studied existing proposals, including the US-Canada-Russia-China railroad, and will support the most viable. \"Imagine connecting the US and Russia, the Americas and the Afro-Eurasia with the Putin-Trump Tunnel - a 70-mile link symbolizing unity.\" Read more from Sky News:Zelenskyy on US 'long-range' weaponsPutin faces difficult trip to summitTrump's 'game of diplomatic chess' \"Traditional costs are $65B+, but @boringcompany's tech could reduce it to future together,\" he added. There has been no public response from Elon Musk."
    },
    {
        "title": "Protesters in Germany demand removal of Madeleine McCann suspect",
        "description": "Protesters have gathered in northern Germany demanding the prime suspect in the disappearance of Madeleine McCann be ousted from where they live.",
        "url": "https://news.sky.com/story/protesters-in-germany-demand-removal-of-madeleine-mccann-suspect-13452330",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christian-b-mccann_7054123.jpg?20251018145517",
        "type": "Home",
        "Author": "Rob Hyde, journalist",
        "Date Published": "2025-10-18 15:01:00",
        "Headline": "Christian B is suspected by police of abducting Madeleine McCann from her parents' holiday apartment in Portugal in 2007.",
        "Content": "By Rob Hyde, journalist  Protesters have gathered in northern Germany demanding the prime suspect in the disappearance of Madeleine McCann be ousted from where they live. More than 150 demonstrators assembled over the whereabouts of convicted paedophile and rapist Christian B, 48. He is suspected by German police of abducting three-year-old Madeleine from her parents' holiday apartment in Portugal in 2007. He denies all involvement in the case and he has never been charged.  Alex Ehmke, 49, who runs a local informal information exchange Facebook group, said: \"I'm a father and have two daughters and so I take this seriously. \"I do accept the idea that a released prisoner needs to be able to be given the space to reintegrate into society - but there's a difference between that and letting a person so boldly strut around the place.\" Christian B was released from prison in Germany in September after serving a seven-year sentence for the rape of a woman in Praia da Luz in 2005. Since then, he has been unable to settle because many hotels evict him once they realise who he is, and he has also been turned away by some homeless shelters. Read more:What we know about Christian BAlleged Madeleine McCann family stalker: 'I believe I'm really her' Local residents began posting supposed sightings of him, while others demanded he be removed from the area. Some even called for violent action against him. Police then moved Christian B for his own safety, after which he made a surprise appearance in Braunschweig. He turned up at the public prosecutor's office there, where he had been made the prime suspect in July 2020. Here, Christian B demanded an audience with chief prosecutor Hans-Christian Wolters, who he holds responsible for the current situation he is now in. Protester Annika P said: \"We are here today because we must raise our voices - for our children, for our families, for safety in our streets and our neighbourhoods.\" The protesters demanded that authorities not only stop placing sex offenders in residential areas but also be transparent with the public about their decisions. Fellow demonstrator Denise P, 38, added: \"I'm not against reintegration but a person like this needs locking up in preventive detention or at least put in a facility where he is monitored properly by professionals. \"The ankle [tag] is also not sufficient as a form of protection. We need more protection for victims - protection for victims placed before protection for perpetrators.\""
    },
    {
        "title": "Prince Andrew insisted on 'gag order' to stop allegations spoiling Queen's Platinum Jubilee, memoir claims",
        "description": "Prince Andrew insisted his accuser, Virginia Giuffre, sign a one-year gag order - to prevent details of her allegations tarnishing the late Queen's platinum jubilee, her memoirs have claimed.",
        "url": "https://news.sky.com/story/prince-andrew-insisted-on-gag-order-to-stop-allegations-spoiling-queens-platinum-jubilee-memoir-claims-13452459",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-queen_7054320.jpg?20251018162000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-18 14:50:00",
        "Headline": "In her book to be published posthumously next week, Virginia Giuffre also claimed Andrew's ex-wife Sarah Ferguson, and daughters Princess Beatrice and Princess Eugenie were also almost drawn into the case.",
        "Content": " Prince Andrew insisted his accuser, Virginia Giuffre, sign a one-year gag order - to prevent details of her allegations tarnishing the late Queen's platinum jubilee, her memoirs have claimed. Andrew relinquished his Duke of York title and remaining honours on Friday evening. It came after discussions with King Charles, in consultation with the Prince of Wales, both of whom wanted to bring an end to the long-lasting scandal. But, according to The Telegraph, Ms Giuffre's book, which is due out on Tuesday, is focusing further attention on the sexual assault allegations and the prince's friendship with paedophile Jeffrey Epstein, which led to the royal's downfall. She tells how Andrew's \"disastrous\" Newsnight interview with Emily Maitlis was like an \"injection of jet fuel\" for her legal team, and it raised the possibility of \"subpoenaing\" his ex-wife Sarah Ferguson, and daughters Princess Beatrice and Princess Eugenie and drawing them into the legal case.  The Telegraph also reports Ms Giuffre's claims that she got \"more out of\" Andrew than a reported £12m payout and $2m (around £1.4m) donation to her charity because she had \"an acknowledgement that I and many other women had been victimised and a tacit pledge to never deny it again\". The former duke paid to settle a civil sexual assault case with Ms Giuffre in 2022, despite insisting he had never met her. \n                  How Prince Andrew allegations unfolded and his titles were lost\n                 \n                  Why William and Camilla likely had influential roles in decision over Prince Andrew's titles\n                 \n                  Everything we know about Prince Andrew's titles decision\n                 Ms Giuffre alleged she was forced to have sex with the prince when she was 17, after being trafficked by Epstein. Andrew continues to vehemently deny her allegations. Read more:Andrew giving up title is 'Victory for Virginia'Everything we know about Andrew losing titlesPrince Andrew: A timeline of events Queen Elizabeth II was celebrating her platinum jubilee in 2022 - the first British monarch to reach the milestone - as the civil case against her son was gathering pace. It was settled nine days after she reached the 70th anniversary of her accession. According to the Telegraph, Ms Giuffre, who died in April, reveals in her book: \"I agreed to a one-year gag order, which seemed important to the prince because it ensured that his mother's platinum jubilee would not be tarnished any more than it already had been.\" In January 2022, a US judge ruled the civil case against Andrew could go ahead, and the Queen went on to strip him of his honorary military roles, with the prince also giving up his HRH style. 'Devastating' interview His 2019 Newsnight interview, which he hoped would clear his name, backfired when he said he \"did not regret\" his friendship with convicted paedophile Epstein, who trafficked Ms Giuffre. Andrew also said he had \"no recollection\" of ever meeting Ms Giuffre and added he could not have had sex with her in March 2001 because he was at Pizza Express with his daughter Beatrice on the day in question. Ms Giuffre, whose book is called Nobody's Girl: A Memoir of Surviving Abuse and Fighting for Justice, wrote, according to The Telegraph: \"As devastating as this interview was for Prince Andrew, for my legal team it was like an injection of jet fuel. \"Its contents would not only help us build an ironclad case against the prince but also open the door to potentially subpoenaing his ex-wife, Sarah Ferguson, and their daughters, Princesses Beatrice and Eugenie.\" 'Amazed he was stupid enough' She also told how Andrew had \"stonewalled\" her legal team for months before settlement discussions began moving very quickly when his deposition was scheduled for March 2022. Ms Giuffre also wrote she was \"amazed\" that a member of the royal family would be \"stupid enough\" to appear in public with the convicted paedophile, after a photo of the pair walking in New York emerged. Andrew, who remains a prince and continues to live in the Crown Estate property Royal Lodge, said on Friday the \"continued accusations about me distract from the work of His Majesty and the royal family\". He insisted he was putting his \"family and country first\" and would stop using \"my title or the honours which have been conferred upon me\". Gloria Allred, a US lawyer who represented 27 of Epstein's victims, said she welcomed the news the prince had relinquished his Duke of York title, saying it was \"some consequence\". But in an interview with Sky News, she added: \"It's not everything, in terms of a measure of justice.\""
    },
    {
        "title": "Why William and Camilla likely had influential roles in decision over Prince Andrew's titles",
        "description": "It's not the first seismic statement I've had to deal with from the Royal Family late into the evening.",
        "url": "https://news.sky.com/story/why-william-and-camilla-likely-had-influential-roles-in-decision-over-prince-andrews-titles-13452138",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prince-william-kate_7022291.jpg?20250916164527",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-18 09:26:00",
        "Headline": "\"It might feel like we have heard this all before, but after the latest details of Prince Andrew's relationship with Jeffrey Epstein it seems the Royal Family has just had enough.\"",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It's not the first seismic statement I've had to deal with from the Royal Family late into the evening. But what I have learnt from past experience is that when they do come in this way, it's because the decision has been made to act now and act fast. Which inevitably has us all wondering, why now?  The latest stories about Prince Andrew and his email to Jeffrey Epstein were again a sign of just how close he'd been to the convicted paedophile, and an extract released from the late Virginia Giuffre's book was heartbreaking and excruciatingly seedy. And yes, the full book is released on Tuesday. But in some ways, we have heard a lot of these lurid details before, albeit allegations that Prince Andrew denies. Which is why it feels like this time, the family had just had enough. It's framed as a personal statement from Andrew, but the involvement of his relatives could not be any clearer: \"In discussion with the King, and my immediate and wider family,\" he writes, followed up by, \"with His Majesty's agreement, we feel I must now go a step further\". It has always been hard to get a full picture of how much the King has engaged in the problems with his brother. Speak to those who know the family well and they'll tell you our current monarch \"doesn't like confrontation\", just like Queen Elizabeth II. And while there has always remained \"a warm familial feeling between the two brothers\" which we've seen through Andrew's appearance at family events, it is \"tempered by the King's responsibilities as head of state to be entirely separate from the perceived, real or alleged activities of the Duke of York\". In the end, as head of the institution, and not as his brother, the King would have had to lead the discussions about the Andrew problem, but I suspect with heavy involvement from his eldest son and wife. William, only in recent weeks, has told us there will be change when he becomes monarch, his advisors stressing he isn't afraid to question why the Royal Family continues to do things in a certain way. His very visible unease at standing next to Prince Andrew at the Duchess of Kent's funeral showed us how uncomfortable he felt about his uncle being there at such a public moment. His involvement in those discussions behind the scenes and making sure the institution was seen to be taking action against Andrew is likely to have been considerable.  I know that Queen Camilla is also a quiet but hugely powerful influence behind palace walls. She is her husband's listening ear, sounding board, but also not afraid to tell him when she believes there needs to be change. Her own work to break taboos around sexual violence and encourage survivors to speak out must have made it even more difficult for her to read the stories about Andrew's links to Epstein, and the sexual allegations against her brother-in-law, even though he has always vehemently denied them. And then there are those closest to the Prince. You have to have sympathy with his daughters, Princess Beatrice and Princess Eugenie. Did they tell their father that he needed to do something for their sake to try and shut down the noise? His ex-wife, Sarah Ferguson, has also been burned in recent weeks by her association with Epstein - a spectre who, despite his death, has continued to haunt the royal family. So what of Prince Andrew? How will this impact him? Any sense he might have a chance at returning to some kind of public life has truly evaporated. We wait to see if, with time, he is again allowed to appear at least for family occasions. I've always been told \"he is robust and self-contained and always has been\". Interpret that how you will - arrogance that he could ride it out, or a very strongly-held conviction that he has never done anything wrong? Either way, he clearly believes he has been unfairly punished by the court of public opinion. One thing a source did tell me is that there is a sense he's never really needed the affirmation of his family. Read more from Sky News:Andrew named in Epstein filesHarry denies fight with AndrewAuthor: Andrew has no public future He may not need their emotional support, but in the end, we have again seen how no member of the family is bigger than the institution. Protecting the reputation of \"the firm\" has to come first. Prince Andrew may feel that he has done the right thing, even done his family a favour, by personally relinquishing the use of his titles and honours, but this, in the end, was not just his choice. No longer to be known as HRH or the Duke of York, he is now Prince Andrew only - ultimately forced to fall on his sword by his own family."
    },
    {
        "title": "Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce",
        "description": "Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years.",
        "url": "https://news.sky.com/story/oil-and-gas-workers-offered-cash-to-retrain-in-major-plan-for-future-clean-energy-workforce-13452705",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wind-turbine-wind-farm_7054926.jpg?20251018213008",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-18 23:01:00",
        "Headline": "Unions welcome the new plan but warn funding for training does not equate to jobs, saying they won't materialise without further investment, nor measures to revitalise the country's dwindling manufacturing capacity.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years. Up to £18m of new money has been pledged by the UK and Scottish governments specifically to move those working in the oil and gas sector into new roles. Their jobs are about to fall off a cliff as the industry declines, with at least 40,000 of the current 115,000 jobs forecast to disappear by the early 2030s. Almost all of those roles are thought to be fairly easily transferable into green industries - requiring little more than a few months of extra training. But in the absence of government help, workers have been moving abroad, industry says, taking with them the expertise Britain badly needs to for its new greener energy system. And it has left them feeling forgotten about after years of working to keep the lights on, and increasingly swayed by Reform UK, both GMB and Unite unions have warned Labour. Pledge to double green jobs by 2030 \n                  Britain's winter blackout risk the lowest in six years\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Energy bill payers to back 'super-battery' projects\n                 Energy Secretary Ed Miliband told Sky News that creating jobs in sectors like carbon capture and storage and hydrogen would help \"create a future for those in the North Sea communities\". The new £18m will pay for careers advice, training, and \"skills passports\" to enable oil and gas workers to make the switch without having to repeat qualifications. The cash was announced on Sunday in the new Clean Energy Jobs Plan, which details how the government hopes to make good on its promise to double green jobs by 2030.  Mr Miliband said in an interview: \"This plan shows 400,000 extra jobs in the clean energy economy by 2030. \"This isn't a target. This is actually what we believe is necessary to meet all the plans we have across the economy.\" The first strategy of its kind hopes to plug the UK's massive skills gap that threatens to derail the government's target to green the electricity system by 2030. It identifies 31 priority occupations that are particularly in demand, such as plumbers, electricians and welders, and lists a target to convert five colleges into new \"Technical Excellence Colleges\" to train workers. 'You can't train people for jobs that aren't there' Unions welcomed the plan, but pointed out that skills and training do not equate to new jobs. They say it will mean nothing without extra money and a revitalised domestic supply chain to build all the green technology needed, from fibreglass wind turbines to aluminium sub-sea cables. Sharon Graham, the Unite general secretary who has threatened to cut ties with Labour over its policy to end North Sea oil and gas drilling and watering down of a ban on zero-hours contracts, welcomed the \"initial steps\" but called for \"an equally ambitious programme of public investment\". Professor Paul de Leeuw from the Energy Transition Institute in Aberdeen said the plan was \"genuinely new and different\", and had for the first time joined up relevant information and strategies in one place. But \"you can't train people for jobs that aren't there\", he added, also calling for an investment plan.f Reform heartlands could benefit from Labour's jobs plan The boom in clean energy jobs stands to benefit Reform heartlands along the east coast of Britain. That fact is more by luck than design, given the east coast's proximity to offshore wind farms and carbon capture and storage fields in the North Sea. Reform promises a radically different vision for the country's future, based on reopening coal mines and maxing out nuclear power and what's left of North Sea oil and gas to boost jobs and the economy. Its deputy leader, Richard Tice, objects to land being used for solar panels and pylons. Government modelling forecasts an additional 35,000 direct jobs in Scotland, 55,000 in the East of England and 50,000 in the North West. To keep the unions sweet, the government will also have to follow through on its pledge to boost the rights of those working offshore in green energy. A current loophole gives protections like the minimum wage to oil and gas workers in UK territorial seas, but not to workers in the clean energy sector."
    },
    {
        "title": "Leading candidates to chair grooming gangs inquiry revealed - with both set to face a survivors' panel this week",
        "description": "A former police officer and a social worker are the leading candidates to chair the government's national inquiry into grooming gangs, Sky News has learned.",
        "url": "https://news.sky.com/story/leading-candidates-to-chair-grooming-gangs-inquiry-revealed-with-both-set-to-face-a-survivors-panel-this-week-13452934",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anonymous-teenager_6983780.jpg?20250805225703",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-10-18 20:15:00",
        "Headline": "The two prospective candidates are former police officer Jim Gamble and social worker Annie Hudson.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n A former police officer and a social worker are the leading candidates to chair the government's national inquiry into grooming gangs, Sky News has learned. The two prospective candidates, Jim Gamble and Annie Hudson, are due to meet a survivors' panel on Tuesday. That group will then pass on their reflections of the candidates to the Home Secretary Shabana Mahmood and Prime Minister Sir Keir Starmer to decide who leads the inquiry. The prime minister launched the inquiry into grooming gangs after an audit by Baroness Louise Casey showed the scale of the problem. Some victims have already expressed concern that the two candidates' backgrounds in policing and social work might lead to conflicts of interest. \"These are exactly the institutions that let us down,\" said one campaigner. Others want the inquiry to be judge-led, including shadow justice secretary Robert Jenrick, who believes the chair should have \"deep experience\" of criminal cases. \n                  Prince Andrew insisted on 'gag order' to stop allegations spoiling Queen's Platinum Jubilee, memoir claims\n                 \n                  Why William and Camilla likely had influential roles in decision over Prince Andrew's titles\n                 \n                  Everything we know about Prince Andrew's titles decision\n                 However, both candidates have had careers tackling child abuse, and Mr Gamble has on several occasions challenged police and other institutions over child protection failures. He began his career as a police officer in Northern Ireland, rising to become head of RUC special branch in Belfast, but is best known for his work combating child abuse. In 2006, he headed up the Child Exploitation and Online Protection Centre, which revolutionised the approach to policing online child abuse networks. Its investigations are said to have led to more than 1,000 arrests before Mr Gamble resigned in 2010 when the then Home Secretary Theresa May decided to merge his unit with other departments. He also headed up Operation Ore, the UK's largest ever police investigation into who was viewing internet child abuse images. It identified more than 7,000 suspects and led to more than 2,000 convictions. In 2021, he examined evidence gathered by Sky News into an Asian grooming gang in Humberside and was critical of the police investigation, calling on forces to treat group-based child abuse \"as seriously as we treat terrorism\". He added: \"This is organised, industrial-level rape.\" In 2022, he led an independent inquiry into the strip-search of a black schoolgirl in Hackney known as \"Child Q\", concluding that racism was a factor, including \"adultification bias\", in which adults perceive black children as being older than they are because they see them as more streetwise. The rival candidate, Annie Hudson, was appointed as chair of the child safeguarding practice review panel in December 2020. Before that, she was director of children's services at the London Borough of Lambeth, having held the same role at Bristol City Council. Hudson was also previously chief executive of the College of Social Work. In 2012, she was given a national Social Worker of the Year award for her 'outstanding contribution to social work'. She is also the lead trustee for safeguarding at Oxfam. Political heat has been ramped up on the government to show progress with the inquiry. Last week, a motion in parliament expressed \"deep concern\" that four months on from the announcement of the inquiry,\"no chair has been appointed, no terms of reference have been published, and no hearings or local investigations have begun\". A Home Office Spokesperson said: \"The abuse of children by grooming gangs is one of the most horrific crimes imaginable. We will do everything in our power to ensure these crimes never happen again. \"We are working urgently to appoint the best chair to take forward this work, to get to the truth and deliver justice to the survivors. It would be wrong to provide a running commentary on that process while it is still under way.\""
    },
    {
        "title": "Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says",
        "description": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned.",
        "url": "https://news.sky.com/story/brexit-impact-on-uk-economy-negative-for-foreseeable-future-bank-of-england-chief-says-13452747",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-bailey-bank_7054686.jpg?20251018182824",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-18 18:12:00",
        "Headline": "The bank's governor, Andrew Bailey, said for nearly a decade he had been careful to \"take no position on Brexit\" but when asked directly about its impact on economic growth he \"had to answer that question\".",
        "Content": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned. Bank of England governor Andrew Bailey said a decline in the UK's potential growth rate from 2.5% to 1.5% over the past 15 years was linked to lower productivity growth, an ageing population, trade restrictions - and post-Brexit economic policies. But he did add that the economy is, however, likely to adjust and find balance again in the longer term. \"Over the longer term, there will be - because trade adjusts - some at least partial rebalancing,\" he added. Speaking at an international banking seminar on Saturday in Washington DC, Mr Bailey said: \"For nearly a decade, I have been very careful to say that I take no position per se on Brexit, which was a decision by the people of the UK, and it is our job as public officials to implement it. \"But, I quite often get asked a second question: what's the impact on economic growth? \"And as a public official, I have to answer that question. \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Reeves seeks outsider to run Britain's banking watchdog\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \"And the answer is that for the foreseeable future it is negative.\" However, Mr Bailey did say investment in innovation and new technologies, including AI, may help address the decline in productivity growth in the long run. \"If we take account of the impact of ageing and trade restrictions, we're really putting our chips on investment,\" he added. \"We're putting our chips on general-purpose technology, and AI looks like the next general-purpose technology, so we need to work with it. \"We need to ensure that it develops appropriately and well.\" Read more from Sky:You can't win every investment, says chancellorSidemen partner lands backing from Osborne-led firmMr Bailey warned that, although AI is likely to usher in a breakthrough in productivity long-term, it may \"in the current circumstances, be a risk to financial stability through stretched valuations in the markets\". \"It doesn't undermine the fact that AI, in my view, is likely, in addressing this slower growth issue, that we have and the consequences of it - that it is actually the best hope we have, and we really do need to do all we can to foster it,\" he said.  The Bank of England governor's prediction comes as Chancellor Rachel Reeves is under pressure ahead of next month's budget, with official figures showing muted growth in August following a surprise contraction in July. Inflation surge The Office for National Statistics (ONS) said gross domestic product (GDP) rose by 0.1% month-on-month in August and fell by 0.1% in July, in a revision to the previous estimate for no growth. In the three months to August, GDP grew by 0.3% compared with 0.2% growth in the three months to July, the ONS said. The latest figures come after the International Monetary Fund earlier this week forecast UK inflation was set to surge to the highest in the G7 in 2025 and 2026."
    },
    {
        "title": "Hamas hands over bodies of two more hostages, Israel confirms",
        "description": "Israel has received the bodies of two more hostages from the Red Cross, the Israeli prime minister's office has confirmed.",
        "url": "https://news.sky.com/story/hamas-hands-over-bodies-of-two-more-hostages-israel-confirms-13452925",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sarch-for-bodies-gaza_7055042.jpg?20251019012216",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-18 19:51:00",
        "Headline": "It comes as Israel increased pressure on the militant group to share the rest more quickly under their ceasefire agreement.",
        "Content": " Israel has received the bodies of two more hostages from the Red Cross, the Israeli prime minister's office has confirmed. Shortly after 10pm UK time on Saturday, Israel's military said Hamas handed over \"two coffins of deceased hostages\". There has been no identification of the bodies yet. The news came as tensions were beginning to rise over the closure of the Rafah border crossing between Gaza and Egypt. Benjamin Netanyahu's office had said earlier on Saturday evening that it would stay closed \"until further notice\" - as the deadline for Hamas to return the bodies of the hostages had passed with no confirmation. Mr Netanyahu had warned that its reopening would depend on how Hamas fulfilled its role in returning the remains of all 28 dead hostages. The handover brings the count of returned bodies to 12 hostages, up from 10, according to Israel's tally. Another 16 deceased hostages would then still have to be returned. \n                  Donald Trump plays peacemaker as domestic struggles grow\n                 \n                  Has Trump made peace in the Middle East?\n                 \n                  Why Gaza peace agreement seems to finally suit the key players after two years of war\n                 All 28 were supposed to have been handed over by last Monday. The handover of remains is among key points - along with aid deliveries into Gaza and the devastated territory's future - in the ceasefire process meant to end two years of war. Israel's foreign ministry had originally said the Rafah crossing would likely reopen on Sunday - another step in the fragile ceasefire. This has now been revised to being closed \"until further notice\". A fully reopened crossing would make it easier for Gazans to seek medical treatment, travel internationally or visit family in Egypt, which is home to tens of thousands of Palestinians. It is unclear who will operate the crossing's heavily damaged Gaza side once the war ends. Meanwhile, Gaza's ruins were being scoured for the dead, over a week into a ceasefire. Newly recovered bodies brought the Palestinian toll above 68,000, according to Gaza's Health Ministry. Read more:Watch: Evidence of Israeli support for Gaza militiaGaza health authorities struggling to identify bodiesViolence that plagues Gaza The ministry, part of the Hamas-run government, does not distinguish between civilians and combatants in its count. But the ministry maintains detailed casualty records that are seen as generally reliable by UN agencies and independent experts.  Famine declared Israel has disputed them without providing its own toll. Hamas-led militants killed around 1,200 people, mostly civilians, and abducted 251 people in the attack on southern Israel that sparked the war on October 7 2023. Gaza's more than two million people are hoping the ceasefire will bring relief from the humanitarian disaster caused by Israel's offensive. Throughout the war, Israel restricted aid entry to Gaza - sometimes halting it altogether.  Famine was declared in Gaza City, and the UN says it has verified more than 400 people who died of malnutrition-related causes, including more than 100 children. Officials in Israel say they have let in enough food, accusing Hamas of stealing much of it. The UN and other aid agencies deny this claim. Hamas has again accused Israel of violating the ceasefire, claiming that 38 Palestinians had been killed since it began on Monday. There has been no immediate response from Israel. Hamas accuses Israel of violations On Friday, Gaza's Civil Defence, first responders operating under the Hamas-run interior ministry, said nine people were killed when their vehicle was hit by Israeli fire in Gaza City. The Civil Defence said the car crossed into an Israeli-controlled area in eastern Gaza. Israel's military said it saw a \"suspicious vehicle\" crossing the so-called yellow line and approaching troops. It said it fired warning shots, but the vehicle continued to approach in a manner that posed an \"imminent threat\". The army said it acted in accordance with the ceasefire."
    },
    {
        "title": "Donald Trump responds to idea of tunnel connecting Russia and US ",
        "description": "Russia's investment envoy has said research into the feasibility of a tunnel joining the US and Russia started \"six months ago\".",
        "url": "https://news.sky.com/story/donald-trump-responds-to-idea-of-tunnel-connecting-russia-and-us-13452151",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin-alaska_6992429.jpg?20250816091711",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-18 10:46:00",
        "Headline": "The link proposal between the US and Russia reflects an \"enduring vision\", investment envoy Kirill Dmitriev has said.",
        "Content": "Russia's investment envoy has said research into the feasibility of a tunnel joining the US and Russia started \"six months ago\". Kirill Dmitriev first posted about the idea on Thursday, suggesting a \"Putin-Trump\" rail tunnel could connect the two countries under the Bering Strait, which separates Russia's vast and sparsely populated Chukotka region from Alaska. Asked about the idea during a press conference with Ukraine's President Volodymyr Zelenskyy on Friday, Donald Trump called it \"interesting\". He also asked President Zelenskyy what he made of it, to which Mr Zelenskyy replied: \"I'm not happy with this idea.\" This prompted laughter from the US side.  Overnight, Mr Dmitriev posted on X, saying: \"We have started the feasibility study of the Russia-Alaska tunnel six months ago. \"Russian Direct Investment Fund with partners financed on a commercial basis the first ever railroad bridge between Russia and China. \"The bridge reduced cargo route by more than 700 kilometres,\" he said. He directed a post on X towards Elon Musk, suggesting the tunnel could be dug by the billionaire's construction firm, Boring Company. \"The dream of a US-Russia link via the Bering Strait reflects an enduring vision - from the 1904 Siberia-Alaska railway to Russia's 2007 plan,\" Mr Dmitriev wrote. \"RDIF has studied existing proposals, including the US-Canada-Russia-China railroad, and will support the most viable. \"Imagine connecting the US and Russia, the Americas and the Afro-Eurasia with the Putin-Trump Tunnel - a 70-mile link symbolizing unity.\" Read more from Sky News:Zelenskyy on US 'long-range' weaponsPutin faces difficult trip to summitTrump's 'game of diplomatic chess' \"Traditional costs are $65B+, but @boringcompany's tech could reduce it to future together,\" he added. There has been no public response from Elon Musk."
    },
    {
        "title": "US airstrike destroyed 'drug-carrying submarine', says Trump - as survivors repatriated",
        "description": "Two survivors of a US airstrike, targeting what Donald Trump has described as a \"drug-carrying submarine\" in the Caribbean, have been repatriated to their home countries.",
        "url": "https://news.sky.com/story/us-airstrike-destroyed-drug-carrying-submarine-says-trump-as-survivors-repatriated-13453002",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sub-caribbean-narcotics_7055030.png?20251019000950",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-18 22:33:00",
        "Headline": "The American military rescued two people after striking a submersible vessel on Thursday as part of an ongoing operation in the Caribbean. The campaign has been ordered by the Trump administration to target what the US president has called \"narcoterrorists trafficking illegal drugs\".",
        "Content": "Two survivors of a US airstrike, targeting what Donald Trump has described as a \"drug-carrying submarine\" in the Caribbean, have been repatriated to their home countries. The US president posted footage of Thursday's operation, part of a recent military campaign targeting boats transporting drugs to America. \"It was my great honor to destroy a very large DRUG-CARRYING SUBMARINE that was navigating towards the United States on a well known narcotrafficking transit route,\" Mr Trump wrote on Truth Social. \"US intelligence confirmed this vessel was loaded up with mostly Fentanyl, and other illegal narcotics,\" he added. The US military staged a helicopter rescue for the survivors on Thursday after the strike on their semi-submersiblevessel, suspected of trafficking illegal narcotics. They were then transported to a US Navy warship. Two other crew members on board were killed. President Trump confirmed the survivors would be returned to their home countries of Colombia and Ecuador \"for detention and prosecution\". Both countries subsequently confirmed they had been handed over. \n                  Inside Pablo Escobar's home city where drugs are readily available to a traffic jam of cars\n                 \n                  'I don't care': Colombia's president says US violating international law after visa revoked\n                 \n                  At least 17 dead in Colombia after car bombing and helicopter attack\n                 \"America will not tolerate narcoterrorists trafficking illegal drugs, by land or by sea,\" he added. On Saturday, Colombian President Gustavo Petro posted on X: \"We have received the Colombian detained on the narco submarine, we are happy he is alive and he will be processed according to the law.\"  Read more from Sky News:Venezuela's president pleads for peaceIs Trump planning to attack Venezuela?Venezuela's Nobel Peace Prize winner The Trump administration has said previous strikes in the Caribbean have killed 27 people, raising concerns among some about the legality of the military operations. The strikes also come against the backdrop of a US military buildup in the Caribbean that includes guided missile destroyers, F-35 fighter jets, a nuclear submarine and around 6,500 troops as the US president escalates a standoff with the Venezuelan government.  On Wednesday, Mr Trump disclosed he had authorised the CIA to conduct covert operations inside Venezuela, adding to speculation in Caracas that the US is attempting to topple Venezuelan President Nicolas Maduro. Mr Maduro has denied any connection to drug smuggling and claimed the US boat strikes are a pretext for regime change, and violations of sovereignty and international law."
    },
    {
        "title": "Protesters in Germany demand removal of Madeleine McCann suspect",
        "description": "Protesters have gathered in northern Germany demanding the prime suspect in the disappearance of Madeleine McCann be ousted from where they live.",
        "url": "https://news.sky.com/story/protesters-in-germany-demand-removal-of-madeleine-mccann-suspect-13452330",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-christian-b-mccann_7054123.jpg?20251018145517",
        "type": "World",
        "Author": "Rob Hyde, journalist",
        "Date Published": "2025-10-18 15:01:00",
        "Headline": "Christian B is suspected by police of abducting Madeleine McCann from her parents' holiday apartment in Portugal in 2007.",
        "Content": "By Rob Hyde, journalist  Protesters have gathered in northern Germany demanding the prime suspect in the disappearance of Madeleine McCann be ousted from where they live. More than 150 demonstrators assembled over the whereabouts of convicted paedophile and rapist Christian B, 48. He is suspected by German police of abducting three-year-old Madeleine from her parents' holiday apartment in Portugal in 2007. He denies all involvement in the case and he has never been charged.  Alex Ehmke, 49, who runs a local informal information exchange Facebook group, said: \"I'm a father and have two daughters and so I take this seriously. \"I do accept the idea that a released prisoner needs to be able to be given the space to reintegrate into society - but there's a difference between that and letting a person so boldly strut around the place.\" Christian B was released from prison in Germany in September after serving a seven-year sentence for the rape of a woman in Praia da Luz in 2005. Since then, he has been unable to settle because many hotels evict him once they realise who he is, and he has also been turned away by some homeless shelters. Read more:What we know about Christian BAlleged Madeleine McCann family stalker: 'I believe I'm really her' Local residents began posting supposed sightings of him, while others demanded he be removed from the area. Some even called for violent action against him. Police then moved Christian B for his own safety, after which he made a surprise appearance in Braunschweig. He turned up at the public prosecutor's office there, where he had been made the prime suspect in July 2020. Here, Christian B demanded an audience with chief prosecutor Hans-Christian Wolters, who he holds responsible for the current situation he is now in. Protester Annika P said: \"We are here today because we must raise our voices - for our children, for our families, for safety in our streets and our neighbourhoods.\" The protesters demanded that authorities not only stop placing sex offenders in residential areas but also be transparent with the public about their decisions. Fellow demonstrator Denise P, 38, added: \"I'm not against reintegration but a person like this needs locking up in preventive detention or at least put in a facility where he is monitored properly by professionals. \"The ankle [tag] is also not sufficient as a form of protection. We need more protection for victims - protection for victims placed before protection for perpetrators.\""
    },
    {
        "title": "Afghanistan to boycott Twenty20 cricket tri-series in Pakistan after 'strike killed three local players'",
        "description": "Afghanistan has withdrawn its national team from a cricket series in Pakistan after strikes in an eastern border province killed three local players, the national governing body said.",
        "url": "https://news.sky.com/story/afghanistan-to-boycott-twenty20-cricket-tri-series-in-pakistan-after-strike-killed-three-local-players-13452278",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-afghanistan-paktika_7054072.jpg?20251018144026",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-18 14:29:00",
        "Headline": "The players were in a home in Paktika province, which borders Pakistan, on Friday when they were targeted, according to the Afghanistan Cricket Board. Kabul then decided to pull the team out of the upcoming Twenty20 cricket tri-series.",
        "Content": "Afghanistan has withdrawn its national team from a cricket series in Pakistan after strikes in an eastern border province killed three local players, the national governing body said. The Afghanistan Cricket Board (ACB) said on social media cricketers had been \"targeted during a gathering\" in Urgun district, Paktika province, on Friday after they had returned home from a friendly match in Sharana. Paktika officials said the strike on a home killed 10 people in total. Recent border clashes between the South Asia neighbours have killed dozens and wounded hundreds more, in the worst violence between the two countries since the Taliban seized power again in 2021. Peace talks were scheduled to take place in Doha on Saturday amid a ceasefire. ACB spokesman Said Nasim Sadat identified the players killed as Kabeer Agha Argon, Sibghatullah Zirok, and Haroon, who, as per custom for many Afghans, only goes by one name. The wounded cricketers were treated in hospital. \n                  Pakistan agrees to ceasefire with Afghanistan after days of bloodshed\n                 \n                  Border crossings between Pakistan and Afghanistan remain closed as clashes continue\n                 \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \"We are athletes and ambassadors of peace,\" said fellow player Saifullah Khan, who also attended the hospital. \"We don't want there to be any more bombings or killings like this.\" Several thousand people attended the funeral prayers in Paktika on Saturday, sitting outside as sermons and condemnations blared through loudspeakers. \"The ACB considers this a great loss for Afghanistan's sports community, its athletes, and the cricketing family,\" the board said in its statement. \"In response of this tragic incident, and as a gesture of respect to the victims, the Afghanistan Cricket Board has decided to withdraw from participating in the upcoming Tri-Nation T20I Series.\" Afghan captain Rashid Khan and the Afghanistan Sports Journalists Federation welcomed the decision, the latter calling the strikes a \"barbaric and shameful act, which stands in clear violation of all international laws\". The tri-series, also featuring Sri Lanka, was scheduled for 17-29 November in Rawalpindi and Lahore. It is a part of preparations for next year's T20 World Cup in India and Sri Lanka. Pakistan's military did not respond to a request from the Reuters news agency for a comment on the airstrikes."
    },
    {
        "title": "Portugal set for burka ban after MPs back right-wing party's plan",
        "description": "Burkas and niqabs are set to be banned in most public spaces in Portugal after MPs voted for a proposal to outlaw face veils introduced by a far-right political party.&#160;",
        "url": "https://news.sky.com/story/portugal-set-for-burka-ban-after-mps-back-right-wing-partys-plan-13452199",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-burqa-afghanistan_5763397.jpg?20220507112119",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-18 11:35:00",
        "Headline": "The measure, approved by MPs, was proposed by the Chega party, whose leaders pointed to women's rights and security concerns.",
        "Content": "Burkas and niqabs are set to be banned in most public spaces in Portugal after MPs voted for a proposal to outlaw face veils introduced by a far-right political party.  The measure applies when such veils are used for \"gender or religious motives\" and carries fines for offenders of between 200 euros and 4,000 euros (£174-£3,473). Anyone forcing someone else to wear one could be jailed for up to three years. Gaza latest - Hamas accuses Israel of breaking ceasefire If it becomes law, it would mirror the full or partial bans introduced by other European countries, including France, Austria, Belgium and the Netherlands. Portugal's President Marcelo Rebelo de Sousa could veto the bill or send it to the Constitutional Court for checks. Andre Ventura, leader of the far-right Chega party, told MPs during Friday's debate they were \"protecting female members of parliament, your daughters, our daughters, from having to use burqas in this country one day\". 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Several women MPs from left-wing parties who opposed the bill, confronted Mr Ventura in the Assembly of the Republic chamber, but the measure passed with support from the centre-right coalition. Andreia Neto, from the ruling Social Democratic Party, said before the vote: \"This is a debate on equality between men and women. No woman should be forced to veil her face.\" Read more from Sky News:'Victory for Virginia', family saysPutin 'may be playing me' - Trump Only a small minority of Muslim women in Europe cover their faces, and in Portugal, such veils are very rare. But full-face coverings such as niqabs and burqas have become a controversial topic across the continent, with some arguing that they symbolise gender discrimination or can represent a security threat and should be outlawed."
    },
    {
        "title": "US airstrike destroyed 'drug-carrying submarine', says Trump - as survivors repatriated",
        "description": "Two survivors of a US airstrike, targeting what Donald Trump has described as a \"drug-carrying submarine\" in the Caribbean, have been repatriated to their home countries.",
        "url": "https://news.sky.com/story/us-airstrike-destroyed-drug-carrying-submarine-says-trump-as-survivors-repatriated-13453002",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sub-caribbean-narcotics_7055030.png?20251019000950",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-18 22:33:00",
        "Headline": "The American military rescued two people after striking a submersible vessel on Thursday as part of an ongoing operation in the Caribbean. The campaign has been ordered by the Trump administration to target what the US president has called \"narcoterrorists trafficking illegal drugs\".",
        "Content": "Two survivors of a US airstrike, targeting what Donald Trump has described as a \"drug-carrying submarine\" in the Caribbean, have been repatriated to their home countries. The US president posted footage of Thursday's operation, part of a recent military campaign targeting boats transporting drugs to America. \"It was my great honor to destroy a very large DRUG-CARRYING SUBMARINE that was navigating towards the United States on a well known narcotrafficking transit route,\" Mr Trump wrote on Truth Social. \"US intelligence confirmed this vessel was loaded up with mostly Fentanyl, and other illegal narcotics,\" he added. The US military staged a helicopter rescue for the survivors on Thursday after the strike on their semi-submersiblevessel, suspected of trafficking illegal narcotics. They were then transported to a US Navy warship. Two other crew members on board were killed. President Trump confirmed the survivors would be returned to their home countries of Colombia and Ecuador \"for detention and prosecution\". Both countries subsequently confirmed they had been handed over. \n                  Inside Pablo Escobar's home city where drugs are readily available to a traffic jam of cars\n                 \n                  'I don't care': Colombia's president says US violating international law after visa revoked\n                 \n                  At least 17 dead in Colombia after car bombing and helicopter attack\n                 \"America will not tolerate narcoterrorists trafficking illegal drugs, by land or by sea,\" he added. On Saturday, Colombian President Gustavo Petro posted on X: \"We have received the Colombian detained on the narco submarine, we are happy he is alive and he will be processed according to the law.\"  Read more from Sky News:Venezuela's president pleads for peaceIs Trump planning to attack Venezuela?Venezuela's Nobel Peace Prize winner The Trump administration has said previous strikes in the Caribbean have killed 27 people, raising concerns among some about the legality of the military operations. The strikes also come against the backdrop of a US military buildup in the Caribbean that includes guided missile destroyers, F-35 fighter jets, a nuclear submarine and around 6,500 troops as the US president escalates a standoff with the Venezuelan government.  On Wednesday, Mr Trump disclosed he had authorised the CIA to conduct covert operations inside Venezuela, adding to speculation in Caracas that the US is attempting to topple Venezuelan President Nicolas Maduro. Mr Maduro has denied any connection to drug smuggling and claimed the US boat strikes are a pretext for regime change, and violations of sovereignty and international law."
    },
    {
        "title": "Donald Trump responds to idea of tunnel connecting Russia and US ",
        "description": "Russia's investment envoy has said research into the feasibility of a tunnel joining the US and Russia started \"six months ago\".",
        "url": "https://news.sky.com/story/donald-trump-responds-to-idea-of-tunnel-connecting-russia-and-us-13452151",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin-alaska_6992429.jpg?20250816091711",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-18 10:46:00",
        "Headline": "The link proposal between the US and Russia reflects an \"enduring vision\", investment envoy Kirill Dmitriev has said.",
        "Content": "Russia's investment envoy has said research into the feasibility of a tunnel joining the US and Russia started \"six months ago\". Kirill Dmitriev first posted about the idea on Thursday, suggesting a \"Putin-Trump\" rail tunnel could connect the two countries under the Bering Strait, which separates Russia's vast and sparsely populated Chukotka region from Alaska. Asked about the idea during a press conference with Ukraine's President Volodymyr Zelenskyy on Friday, Donald Trump called it \"interesting\". He also asked President Zelenskyy what he made of it, to which Mr Zelenskyy replied: \"I'm not happy with this idea.\" This prompted laughter from the US side.  Overnight, Mr Dmitriev posted on X, saying: \"We have started the feasibility study of the Russia-Alaska tunnel six months ago. \"Russian Direct Investment Fund with partners financed on a commercial basis the first ever railroad bridge between Russia and China. \"The bridge reduced cargo route by more than 700 kilometres,\" he said. He directed a post on X towards Elon Musk, suggesting the tunnel could be dug by the billionaire's construction firm, Boring Company. \"The dream of a US-Russia link via the Bering Strait reflects an enduring vision - from the 1904 Siberia-Alaska railway to Russia's 2007 plan,\" Mr Dmitriev wrote. \"RDIF has studied existing proposals, including the US-Canada-Russia-China railroad, and will support the most viable. \"Imagine connecting the US and Russia, the Americas and the Afro-Eurasia with the Putin-Trump Tunnel - a 70-mile link symbolizing unity.\" Read more from Sky News:Zelenskyy on US 'long-range' weaponsPutin faces difficult trip to summitTrump's 'game of diplomatic chess' \"Traditional costs are $65B+, but @boringcompany's tech could reduce it to future together,\" he added. There has been no public response from Elon Musk."
    },
    {
        "title": "Donald Trump tells disgraced Republican politician George Santos to 'have a great life' after ordering prison release",
        "description": "Donald Trump has ordered the release of former Republican politician George Santos, who was jailed for more than seven years on fraud and identity theft charges.",
        "url": "https://news.sky.com/story/donald-trump-tells-disgraced-republican-politician-george-santos-to-have-a-great-life-after-ordering-prison-release-13452068",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-george-santos-santos_6033644.jpg?20230123132435",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-18 00:49:00",
        "Headline": "Santos suffered a dramatic fall from grace after he was elected to Congress and then exposed as having fabricated much of his life story. While some Republicans believe his punishment was harsh, others are questioning his release just a few months into an 87-month sentence.",
        "Content": "Donald Trump has ordered the release of former Republican politician George Santos, who was jailed for more than seven years on fraud and identity theft charges. \"George Santos was somewhat of a 'rogue,' but there are many rogues throughout our Country that aren't forced to serve seven years in prison,\" the US president posted on his social media platform. He said he had \"just signed a Commutation, releasing George Santos from prison, IMMEDIATELY.\" \"Good luck George, have a great life!\" Mr Trump added. In April, the former New York representative was sentenced to 87 months after prosecutors said Santos preyed upon the campaign finance system and his own political party, donors and family members to line his own pockets. His fall from grace came less than a year after he was elected to Congress in 2022. It had emerged he fabricated much of his life story, including his business credentials, education, sporting accolades and even his status as a Jewish man.  The decision to commute his sentence followed a public campaign calling for the US president to issue a pardon. A senior White House official said that \"many people wrote to him about it\". \n                  US airstrike destroyed 'drug-carrying submarine', says Trump - as survivors repatriated\n                 \n                  Donald Trump responds to idea of tunnel connecting Russia and US \n                 \n                  Volodymyr Zelenskyy believes 'Putin is afraid' that Donald Trump could still supply Ukraine with Tomahawk missiles\n                 While behind bars, Santos published a letter via a local newspaper pleading to Mr Trump directly. \"Sir, I appeal to your sense of justice and humanity - the same qualities that have inspired millions of Americans to believe in you,\" he wrote. \"I humbly ask that you consider the unusual pain and hardship of this environment and allow me the opportunity to return to my family, my friends, and my community.\" Santos kept in solitary Earlier this week, Republican Marjorie Taylor Greene told Sky's US partner NBC that she had been in contact with the Department of Justice and argued that his punishment was excessively harsh and he was being held in solitary confinement for his safety. Although before he went to prison, Santos wrote on X, demanding \"to be kept in solitary confinement for the entire duration\" of his prison sentence. Mr Trump's post on Friday included accusations that Santos had been \"mistreated\" while in prison. \"George has been in solitary confinement for long stretches of time and, by all accounts, has been horribly mistreated,\" Mr Trump wrote. Life story was fabricated After becoming the first openly gay Republican elected to Congress in 2022, Santos served less than a year before it was revealed that he had fabricated much of his life story. On the campaign trail, Santos had claimed he was a successful business consultant with a sizable real estate portfolio. But when his resume came under scrutiny, Santos eventually admitted he had never graduated from Baruch College - or been a standout player on the Manhattan college's volleyball team, as he had claimed. He wasn't even Jewish but raised Catholic. Although Santos insisted he meant he was \"Jew-ish\" because his mother's family had a Jewish background. Read more:Explainer: Who is George Santos?Santos expelled from HouseWhat is the US presidential pardon? 'He stole millions' But some have criticised the US president's move. Republican Andrew Garbarino, who sits on the House Ethics Committee, said it is \"not justice\" for Santos to serve only a few months of his seven-year sentence. Republican Nick LaLota, who represents a swing district in New York, said Santos \"didn't merely lie - he stole millions, defrauded an election\". Mr Trump has been actively using his power to grant clemency in his second term. On his first day in office, he pardoned roughly 1,500 criminal defendants charged in the 6 January 2021 attack on the US Capitol and a number of politicians, including Democrats."
    },
    {
        "title": "Twin who allegedly urged sister to take fall for deadly Amish buggy crash is jailed for four years",
        "description": "A US woman who allegedly asked her twin to take responsibility for a deadly crash with an Amish buggy has been sentenced to four years in prison.",
        "url": "https://news.sky.com/story/twin-who-allegedly-urged-sister-to-take-fall-for-deadly-amish-buggy-crash-is-jailed-for-four-years-13452139",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sarah-peterson_7053863.jpg?20251018105859",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-18 09:40:00",
        "Headline": "Samantha Petersen's twin sister Sarah initially told police that she was driving, following a crash in Minnesota in which two young girls were killed.",
        "Content": "A US woman who allegedly asked her twin to take responsibility for a deadly crash with an Amish buggy has been sentenced to four years in prison. Police said Samantha Petersen was high on methamphetamine after work when she rear-ended a horse-drawn buggy near Spring Valley, Minnesota, in September 2023. Two sisters in the buggy, Wilma Miller, seven, and Irma Miller, 11, died, and two other siblings were seriously injured, authorities said. After the crash, police said Samantha summoned her twin, Sarah, to the scene. Her twin initially told officers she had been driving, but was recorded by police saying: \"There's no way they would ever know the difference between the two of us so they can't tell.\" Samantha has now pleaded guilty to criminal vehicular homicide under the influence and criminal vehicular operation under the influence. \"We started to determine that, in fact, Samantha was the sister that was coming from Rochester, driving southbound at the time of the crash, not Sarah,\" said Fillmore County Sheriff John DeGeorge. Using search warrants, location data from Samantha's mobile phone, and a phone call from her employer, police concluded she was driving. They found various online searches on Samantha's phone, including \"what happens if you get in an accident with an Amish buggy and kill two people\", and \"how to lock an iphone cops have\". Police also alleged she called her place of work's human resource department after the incident, and said: \"I f***** up... I just killed two Amish people. \"They were kids... I just hit a f****** buggy... I'm not sober.\" Read more from Sky News:'Victory for Virginia', says family - as Andrew gives up titlesEverything we know about title decisionTrump admits it's possible he's being 'played' by Putin Minnesota District Court Judge Jeremy Clinefelter sentenced her on Thursday to two sentences of two and four years in prison, to be served concurrently. He also ordered her to pay nearly $40,000 (£29,790) in restitution, according to his sentencing memo for the case. \"I wish with everything in me that I could go back and change what happened,\" Samantha said before the sentencing, according to Minneapolis news station KARE, which is an affiliate of Sky News' partner newsroom NBC. \"But, I know I cannot. \"My addiction took a lot from me, but it took the world from you,\" she said, directing her comments to the bereaved family. After the sentencing, her criminal defence lawyer, Carson J Heefner, said: \"I guess in the grand of scheme of things, it was a fair sentence.\" Sarah Petersen has already served her sentence for contributing to criminal vehicular operation, according to KARE."
    },
    {
        "title": "Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says",
        "description": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned.",
        "url": "https://news.sky.com/story/brexit-impact-on-uk-economy-negative-for-foreseeable-future-bank-of-england-chief-says-13452747",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-bailey-bank_7054686.jpg?20251018182824",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-18 18:12:00",
        "Headline": "The bank's governor, Andrew Bailey, said for nearly a decade he had been careful to \"take no position on Brexit\" but when asked directly about its impact on economic growth he \"had to answer that question\".",
        "Content": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned. Bank of England governor Andrew Bailey said a decline in the UK's potential growth rate from 2.5% to 1.5% over the past 15 years was linked to lower productivity growth, an ageing population, trade restrictions - and post-Brexit economic policies. But he did add that the economy is, however, likely to adjust and find balance again in the longer term. \"Over the longer term, there will be - because trade adjusts - some at least partial rebalancing,\" he added. Speaking at an international banking seminar on Saturday in Washington DC, Mr Bailey said: \"For nearly a decade, I have been very careful to say that I take no position per se on Brexit, which was a decision by the people of the UK, and it is our job as public officials to implement it. \"But, I quite often get asked a second question: what's the impact on economic growth? \"And as a public official, I have to answer that question. \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Reeves seeks outsider to run Britain's banking watchdog\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \"And the answer is that for the foreseeable future it is negative.\" However, Mr Bailey did say investment in innovation and new technologies, including AI, may help address the decline in productivity growth in the long run. \"If we take account of the impact of ageing and trade restrictions, we're really putting our chips on investment,\" he added. \"We're putting our chips on general-purpose technology, and AI looks like the next general-purpose technology, so we need to work with it. \"We need to ensure that it develops appropriately and well.\" Read more from Sky:You can't win every investment, says chancellorSidemen partner lands backing from Osborne-led firmMr Bailey warned that, although AI is likely to usher in a breakthrough in productivity long-term, it may \"in the current circumstances, be a risk to financial stability through stretched valuations in the markets\". \"It doesn't undermine the fact that AI, in my view, is likely, in addressing this slower growth issue, that we have and the consequences of it - that it is actually the best hope we have, and we really do need to do all we can to foster it,\" he said.  The Bank of England governor's prediction comes as Chancellor Rachel Reeves is under pressure ahead of next month's budget, with official figures showing muted growth in August following a surprise contraction in July. Inflation surge The Office for National Statistics (ONS) said gross domestic product (GDP) rose by 0.1% month-on-month in August and fell by 0.1% in July, in a revision to the previous estimate for no growth. In the three months to August, GDP grew by 0.3% compared with 0.2% growth in the three months to July, the ONS said. The latest figures come after the International Monetary Fund earlier this week forecast UK inflation was set to surge to the highest in the G7 in 2025 and 2026."
    },
    {
        "title": "Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce",
        "description": "Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years.",
        "url": "https://news.sky.com/story/oil-and-gas-workers-offered-cash-to-retrain-in-major-plan-for-future-clean-energy-workforce-13452705",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wind-turbine-wind-farm_7054926.jpg?20251018213008",
        "type": "Business",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-18 23:01:00",
        "Headline": "Unions welcome the new plan but warn funding for training does not equate to jobs, saying they won't materialise without further investment, nor measures to revitalise the country's dwindling manufacturing capacity.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years. Up to £18m of new money has been pledged by the UK and Scottish governments specifically to move those working in the oil and gas sector into new roles. Their jobs are about to fall off a cliff as the industry declines, with at least 40,000 of the current 115,000 jobs forecast to disappear by the early 2030s. Almost all of those roles are thought to be fairly easily transferable into green industries - requiring little more than a few months of extra training. But in the absence of government help, workers have been moving abroad, industry says, taking with them the expertise Britain badly needs to for its new greener energy system. And it has left them feeling forgotten about after years of working to keep the lights on, and increasingly swayed by Reform UK, both GMB and Unite unions have warned Labour. Pledge to double green jobs by 2030 \n                  Britain's winter blackout risk the lowest in six years\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Energy bill payers to back 'super-battery' projects\n                 Energy Secretary Ed Miliband told Sky News that creating jobs in sectors like carbon capture and storage and hydrogen would help \"create a future for those in the North Sea communities\". The new £18m will pay for careers advice, training, and \"skills passports\" to enable oil and gas workers to make the switch without having to repeat qualifications. The cash was announced on Sunday in the new Clean Energy Jobs Plan, which details how the government hopes to make good on its promise to double green jobs by 2030.  Mr Miliband said in an interview: \"This plan shows 400,000 extra jobs in the clean energy economy by 2030. \"This isn't a target. This is actually what we believe is necessary to meet all the plans we have across the economy.\" The first strategy of its kind hopes to plug the UK's massive skills gap that threatens to derail the government's target to green the electricity system by 2030. It identifies 31 priority occupations that are particularly in demand, such as plumbers, electricians and welders, and lists a target to convert five colleges into new \"Technical Excellence Colleges\" to train workers. 'You can't train people for jobs that aren't there' Unions welcomed the plan, but pointed out that skills and training do not equate to new jobs. They say it will mean nothing without extra money and a revitalised domestic supply chain to build all the green technology needed, from fibreglass wind turbines to aluminium sub-sea cables. Sharon Graham, the Unite general secretary who has threatened to cut ties with Labour over its policy to end North Sea oil and gas drilling and watering down of a ban on zero-hours contracts, welcomed the \"initial steps\" but called for \"an equally ambitious programme of public investment\". Professor Paul de Leeuw from the Energy Transition Institute in Aberdeen said the plan was \"genuinely new and different\", and had for the first time joined up relevant information and strategies in one place. But \"you can't train people for jobs that aren't there\", he added, also calling for an investment plan.f Reform heartlands could benefit from Labour's jobs plan The boom in clean energy jobs stands to benefit Reform heartlands along the east coast of Britain. That fact is more by luck than design, given the east coast's proximity to offshore wind farms and carbon capture and storage fields in the North Sea. Reform promises a radically different vision for the country's future, based on reopening coal mines and maxing out nuclear power and what's left of North Sea oil and gas to boost jobs and the economy. Its deputy leader, Richard Tice, objects to land being used for solar panels and pylons. Government modelling forecasts an additional 35,000 direct jobs in Scotland, 55,000 in the East of England and 50,000 in the North West. To keep the unions sweet, the government will also have to follow through on its pledge to boost the rights of those working offshore in green energy. A current loophole gives protections like the minimum wage to oil and gas workers in UK territorial seas, but not to workers in the clean energy sector."
    },
    {
        "title": "Heathrow puts Jansen on runway as next chairman",
        "description": "The former BT Group chief Philip Jansen is being lined up as the next chairman of Heathrow Airport as Britain's biggest aviation hub prepares to deliver an expansion costing close to &#163;50bn.",
        "url": "https://news.sky.com/story/heathrow-puts-jansen-on-runway-as-next-chairman-13452101",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-heathrow-terminal-4_7014681.jpg?20250908195503",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-18 07:00:00",
        "Headline": "Philip Jansen, the former BT Group boss, is the leading candidate to succeed Lord Deighton as the airport's new chairman as it prepares to deliver a £48bn expansion plan, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The former BT Group chief Philip Jansen is being lined up as the next chairman of Heathrow Airport as Britain's biggest aviation hub prepares to deliver an expansion costing close to £50bn. Sky News has learnt that Mr Jansen, who chairs the FTSE-100 marketing services group WPP, is in advanced talks with Heathrow's board and shareholders about taking on the role. If the discussions reach a successful conclusion, sources said an announcement could come within weeks. Mr Jansen is said to have emerged as the frontrunner from a shortlist of candidates compiled by headhunters at Russell Reynolds Associates. His experience as the boss of BT, a regulated utility, is said to have been key to his selection as the preferred candidate. Mr Jansen has also run companies including MyTravel and Worldpay. The appointment of a successor to Lord Deighton, who has held the post for nine years, comes at a critical time for Heathrow. In August, the airport submitted a revised expansion plan consisting of a third runway costing £21bn, £12bn for a new terminal and stand capacity, and £15bn to modernise the current airport through the expansion of Terminal 2. The existing Terminal 3 would ultimately be closed. Read more: Full details of Heathrow's plans for a third runway revealed Heathrow handled a record 83.9 million passengers in 2024 and is adamant that a third runway is essential to the growth of Britain's economy, given the volume of exports which pass through the site. \"It has never been more important or urgent to expand Heathrow,\" the airport's chief executive, Thomas Woldbye, said in August. \"We are effectively operating at capacity to the detriment of trade and connectivity. \"With a green light from government and the correct policy support underpinned by a fit for purpose regulatory model, we are ready to mobilise and start investing this year in our supply chain across the country. \"We are uniquely placed to do this for the country; it is time to clear the way for take-off.\" Read more from Money:27 years after conviction, he hopes he'll still be alive by the time he's cleared his nameSidemen partner lands backing from Osborne-led firmMajor milestone in Post Office scandal The expansion remains opposed by many airlines alarmed by the prospective increase in charges to use the airport, as well It has, however, been backed by the government, with Rachel Reeves, the chancellor, saying that a third runway \"would unlock further growth, boost investment, increase exports, and make the UK more open and more connected as part of our Plan for Change\". Heathrow's next chairman will lead a board dominated by representatives of the airport's principal shareholders. Mr Woldbye apologised in May for being asleep during the power outage in March which forced Heathrow's temporary closure.  The airport said it would implement the recommendations of a review conducted by former transport secretary Ruth Kelly. Heathrow's search for a new chairman comes months after the most significant changes to its ownership structure in years. Ardian, a French investment group, now owns 32.6% of the company following a series of transactions over the last 12 months. Saudi Arabia's Public Investment Fund has also become an investor. Heathrow has never formally announced Lord Deighton's intention to step down, other than a disclosure in its annual report in which he wrote: \"In light of the recent changes to the HAHL [Heathrow Airport Holdings Limited] board…the nominations committee…has asked me to extend my appointment for a limited period to help ensure a smooth transition whilst new non-executive shareholder directors become familiar with the business and a new chair is appointed. \"I have therefore agreed to extend my role as chair for a limited period to ensure continuity and stability on the HAHL Board during this period of transition.\" A Heathrow spokesperson declined to comment, while Mr Jansen could not be reached for comment."
    },
    {
        "title": "Brexit impact on UK economy 'negative for foreseeable future', Bank of England chief says",
        "description": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned.",
        "url": "https://news.sky.com/story/brexit-impact-on-uk-economy-negative-for-foreseeable-future-bank-of-england-chief-says-13452747",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-bailey-bank_7054686.jpg?20251018182824",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-18 18:12:00",
        "Headline": "The bank's governor, Andrew Bailey, said for nearly a decade he had been careful to \"take no position on Brexit\" but when asked directly about its impact on economic growth he \"had to answer that question\".",
        "Content": "Brexit will have a negative impact on the UK's economic growth \"for the foreseeable future\", the UK's most senior banker has warned. Bank of England governor Andrew Bailey said a decline in the UK's potential growth rate from 2.5% to 1.5% over the past 15 years was linked to lower productivity growth, an ageing population, trade restrictions - and post-Brexit economic policies. But he did add that the economy is, however, likely to adjust and find balance again in the longer term. \"Over the longer term, there will be - because trade adjusts - some at least partial rebalancing,\" he added. Speaking at an international banking seminar on Saturday in Washington DC, Mr Bailey said: \"For nearly a decade, I have been very careful to say that I take no position per se on Brexit, which was a decision by the people of the UK, and it is our job as public officials to implement it. \"But, I quite often get asked a second question: what's the impact on economic growth? \"And as a public official, I have to answer that question. \n                  Bank of England warns of 'sharp correction' for markets if AI bubble bursts - and IMF agrees\n                 \n                  Reeves seeks outsider to run Britain's banking watchdog\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \"And the answer is that for the foreseeable future it is negative.\" However, Mr Bailey did say investment in innovation and new technologies, including AI, may help address the decline in productivity growth in the long run. \"If we take account of the impact of ageing and trade restrictions, we're really putting our chips on investment,\" he added. \"We're putting our chips on general-purpose technology, and AI looks like the next general-purpose technology, so we need to work with it. \"We need to ensure that it develops appropriately and well.\" Read more from Sky:You can't win every investment, says chancellorSidemen partner lands backing from Osborne-led firmMr Bailey warned that, although AI is likely to usher in a breakthrough in productivity long-term, it may \"in the current circumstances, be a risk to financial stability through stretched valuations in the markets\". \"It doesn't undermine the fact that AI, in my view, is likely, in addressing this slower growth issue, that we have and the consequences of it - that it is actually the best hope we have, and we really do need to do all we can to foster it,\" he said.  The Bank of England governor's prediction comes as Chancellor Rachel Reeves is under pressure ahead of next month's budget, with official figures showing muted growth in August following a surprise contraction in July. Inflation surge The Office for National Statistics (ONS) said gross domestic product (GDP) rose by 0.1% month-on-month in August and fell by 0.1% in July, in a revision to the previous estimate for no growth. In the three months to August, GDP grew by 0.3% compared with 0.2% growth in the three months to July, the ONS said. The latest figures come after the International Monetary Fund earlier this week forecast UK inflation was set to surge to the highest in the G7 in 2025 and 2026."
    },
    {
        "title": "Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce",
        "description": "Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years.",
        "url": "https://news.sky.com/story/oil-and-gas-workers-offered-cash-to-retrain-in-major-plan-for-future-clean-energy-workforce-13452705",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wind-turbine-wind-farm_7054926.jpg?20251018213008",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-18 23:01:00",
        "Headline": "Unions welcome the new plan but warn funding for training does not equate to jobs, saying they won't materialise without further investment, nor measures to revitalise the country's dwindling manufacturing capacity.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years. Up to £18m of new money has been pledged by the UK and Scottish governments specifically to move those working in the oil and gas sector into new roles. Their jobs are about to fall off a cliff as the industry declines, with at least 40,000 of the current 115,000 jobs forecast to disappear by the early 2030s. Almost all of those roles are thought to be fairly easily transferable into green industries - requiring little more than a few months of extra training. But in the absence of government help, workers have been moving abroad, industry says, taking with them the expertise Britain badly needs to for its new greener energy system. And it has left them feeling forgotten about after years of working to keep the lights on, and increasingly swayed by Reform UK, both GMB and Unite unions have warned Labour. Pledge to double green jobs by 2030 \n                  Britain's winter blackout risk the lowest in six years\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Energy bill payers to back 'super-battery' projects\n                 Energy Secretary Ed Miliband told Sky News that creating jobs in sectors like carbon capture and storage and hydrogen would help \"create a future for those in the North Sea communities\". The new £18m will pay for careers advice, training, and \"skills passports\" to enable oil and gas workers to make the switch without having to repeat qualifications. The cash was announced on Sunday in the new Clean Energy Jobs Plan, which details how the government hopes to make good on its promise to double green jobs by 2030.  Mr Miliband said in an interview: \"This plan shows 400,000 extra jobs in the clean energy economy by 2030. \"This isn't a target. This is actually what we believe is necessary to meet all the plans we have across the economy.\" The first strategy of its kind hopes to plug the UK's massive skills gap that threatens to derail the government's target to green the electricity system by 2030. It identifies 31 priority occupations that are particularly in demand, such as plumbers, electricians and welders, and lists a target to convert five colleges into new \"Technical Excellence Colleges\" to train workers. 'You can't train people for jobs that aren't there' Unions welcomed the plan, but pointed out that skills and training do not equate to new jobs. They say it will mean nothing without extra money and a revitalised domestic supply chain to build all the green technology needed, from fibreglass wind turbines to aluminium sub-sea cables. Sharon Graham, the Unite general secretary who has threatened to cut ties with Labour over its policy to end North Sea oil and gas drilling and watering down of a ban on zero-hours contracts, welcomed the \"initial steps\" but called for \"an equally ambitious programme of public investment\". Professor Paul de Leeuw from the Energy Transition Institute in Aberdeen said the plan was \"genuinely new and different\", and had for the first time joined up relevant information and strategies in one place. But \"you can't train people for jobs that aren't there\", he added, also calling for an investment plan.f Reform heartlands could benefit from Labour's jobs plan The boom in clean energy jobs stands to benefit Reform heartlands along the east coast of Britain. That fact is more by luck than design, given the east coast's proximity to offshore wind farms and carbon capture and storage fields in the North Sea. Reform promises a radically different vision for the country's future, based on reopening coal mines and maxing out nuclear power and what's left of North Sea oil and gas to boost jobs and the economy. Its deputy leader, Richard Tice, objects to land being used for solar panels and pylons. Government modelling forecasts an additional 35,000 direct jobs in Scotland, 55,000 in the East of England and 50,000 in the North West. To keep the unions sweet, the government will also have to follow through on its pledge to boost the rights of those working offshore in green energy. A current loophole gives protections like the minimum wage to oil and gas workers in UK territorial seas, but not to workers in the clean energy sector."
    },
    {
        "title": "Thousands of protesters march through London streets against digital ID plans",
        "description": "Crowds of protesters have marched through London streets rallying against government plans for digital IDs.",
        "url": "https://news.sky.com/story/thousands-of-protesters-march-through-london-streets-against-digital-id-plans-13452894",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-digital-id-protest_7054875.jpg?20251018200907",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-18 20:17:00",
        "Headline": "The prime minister says the ID system is to tackle illegal migration - but opponents say it's an invasion of privacy.",
        "Content": " Crowds of protesters have marched through London streets rallying against government plans for digital IDs. Thousands of demonstrators - controlled by strict police conditions - chanted and waved banners along the route on Saturday, which ended at the heart of government - Whitehall. The prime minister announced in September that a digital ID system would be introduced in 2029 and would be mandatory for people working in the UK as part of a bid to tackle illegal migration. Former Conservative MP Andrew Bridgen, who was expelled from the Conservative Party in 2023 for comparing COVID-19 vaccines to the Holocaust, walked at the front of the march. One protester carried an effigy of Sir Keir Starmer. An advert for the protest on the website of organiser Mass Non-Compliance said \"if you accept digital ID now, it may be the last real choice you ever make\". The Metropolitan Police told demonstrators not to deviate from their pre-planned route, and to stay on the left-hand side of the road. Explainer: What is a digital ID card, will it be mandatory and will it be safe? Plans to roll out digital IDs have already faced criticism. Conservative former minister Sir David Davis, who campaigned against their introduction during Sir Tony Blair's Labour government, said: \"While digital IDs and ID cards sound like modern and efficient solutions to problems like illegal immigration, such claims are misleading at best. \"The systems involved are profoundly dangerous to the privacy and fundamental freedoms of the British people.\" Read more:The countries where digital IDs already existStarmer's found new enthusiasm for digital ID - but will he be able to sell it? Tory leader Kemi Badenoch has dismissed the plans as a \"gimmick that will do nothing to stop the boats\". Reform UK leader Nigel Farage has also said he is \"firmly opposed\". The Liberal Democrats have said they would not support mandatory digital ID where people are \"forced to turn over their private data just to go about their daily lives\"."
    },
    {
        "title": "Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce",
        "description": "Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years.",
        "url": "https://news.sky.com/story/oil-and-gas-workers-offered-cash-to-retrain-in-major-plan-for-future-clean-energy-workforce-13452705",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wind-turbine-wind-farm_7054926.jpg?20251018213008",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-18 23:01:00",
        "Headline": "Unions welcome the new plan but warn funding for training does not equate to jobs, saying they won't materialise without further investment, nor measures to revitalise the country's dwindling manufacturing capacity.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Ministers have unveiled their flagship plan to train and recruit workers for the booming clean energy sector, which it is hoping to supercharge in the next five years. Up to £18m of new money has been pledged by the UK and Scottish governments specifically to move those working in the oil and gas sector into new roles. Their jobs are about to fall off a cliff as the industry declines, with at least 40,000 of the current 115,000 jobs forecast to disappear by the early 2030s. Almost all of those roles are thought to be fairly easily transferable into green industries - requiring little more than a few months of extra training. But in the absence of government help, workers have been moving abroad, industry says, taking with them the expertise Britain badly needs to for its new greener energy system. And it has left them feeling forgotten about after years of working to keep the lights on, and increasingly swayed by Reform UK, both GMB and Unite unions have warned Labour. Pledge to double green jobs by 2030 \n                  Britain's winter blackout risk the lowest in six years\n                 \n                  Renewable energy produces more electricity than coal for the first time, experts say\n                 \n                  Energy bill payers to back 'super-battery' projects\n                 Energy Secretary Ed Miliband told Sky News that creating jobs in sectors like carbon capture and storage and hydrogen would help \"create a future for those in the North Sea communities\". The new £18m will pay for careers advice, training, and \"skills passports\" to enable oil and gas workers to make the switch without having to repeat qualifications. The cash was announced on Sunday in the new Clean Energy Jobs Plan, which details how the government hopes to make good on its promise to double green jobs by 2030.  Mr Miliband said in an interview: \"This plan shows 400,000 extra jobs in the clean energy economy by 2030. \"This isn't a target. This is actually what we believe is necessary to meet all the plans we have across the economy.\" The first strategy of its kind hopes to plug the UK's massive skills gap that threatens to derail the government's target to green the electricity system by 2030. It identifies 31 priority occupations that are particularly in demand, such as plumbers, electricians and welders, and lists a target to convert five colleges into new \"Technical Excellence Colleges\" to train workers. 'You can't train people for jobs that aren't there' Unions welcomed the plan, but pointed out that skills and training do not equate to new jobs. They say it will mean nothing without extra money and a revitalised domestic supply chain to build all the green technology needed, from fibreglass wind turbines to aluminium sub-sea cables. Sharon Graham, the Unite general secretary who has threatened to cut ties with Labour over its policy to end North Sea oil and gas drilling and watering down of a ban on zero-hours contracts, welcomed the \"initial steps\" but called for \"an equally ambitious programme of public investment\". Professor Paul de Leeuw from the Energy Transition Institute in Aberdeen said the plan was \"genuinely new and different\", and had for the first time joined up relevant information and strategies in one place. But \"you can't train people for jobs that aren't there\", he added, also calling for an investment plan.f Reform heartlands could benefit from Labour's jobs plan The boom in clean energy jobs stands to benefit Reform heartlands along the east coast of Britain. That fact is more by luck than design, given the east coast's proximity to offshore wind farms and carbon capture and storage fields in the North Sea. Reform promises a radically different vision for the country's future, based on reopening coal mines and maxing out nuclear power and what's left of North Sea oil and gas to boost jobs and the economy. Its deputy leader, Richard Tice, objects to land being used for solar panels and pylons. Government modelling forecasts an additional 35,000 direct jobs in Scotland, 55,000 in the East of England and 50,000 in the North West. To keep the unions sweet, the government will also have to follow through on its pledge to boost the rights of those working offshore in green energy. A current loophole gives protections like the minimum wage to oil and gas workers in UK territorial seas, but not to workers in the clean energy sector."
    },
    {
        "title": "New blood test for more than 50 cancers 'could transform outcomes'",
        "description": "A pioneering blood test correctly identified cancer in almost two thirds of cases it highlighted so could lead to earlier diagnosis, a study has found.",
        "url": "https://news.sky.com/story/new-blood-test-for-more-than-50-cancers-could-transform-outcomes-13452132",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-blood-test-me_7045056.jpg?20251007140735",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-18 08:59:00",
        "Headline": "More than 23,000 people without symptoms from the US and Canada were analysed and assessed for at least a year as part of the Pathfinder 2 trial.",
        "Content": "A pioneering blood test correctly identified cancer in almost two thirds of cases it highlighted so could lead to earlier diagnosis, a study has found. The Galleri test, which screens for more than 50 cancers and is being trialled in the NHS, searches for the \"fingerprint\" of dozens of deadly cancers and can even identify signs before symptoms show. It identifies DNA shed by cancer cells in the bloodstream, giving the earliest signs a patient may have the disease. More than 23,000 people without symptoms from the US and Canada were analysed and assessed for at least a year as part of the Pathfinder 2 trial. Results showed that of those found to have a \"cancer signal\" detected in their blood, 61.6% went on to be diagnosed with the disease. Galleri, developed by US biotechnology firm Grail, is also highly accurate in identifying when the disease is not present, the study found - correctly ruling it out in almost all (99.6%) cases. For those with cancer, it identified which organ or tissue was affected with a 92% success rate, meaning time and money could be saved on further scans and other tests. The Pathfinder 2 study looked at how the Galleri test may be used in a real-world setting, alongside regular screening programmes for difference cancers such as breast and bowel. Read more on Sky News:'Game-changing' HIV jabBrain cancer drug rejected'Victory' for Andrew's accuser An NHS Galleri trial on how well the test works in screening people without symptoms is expected to be published next year. Sir Harpal Kumar, Grail's president of international business and biopharma, said the trial results showed Galleri detected \"seven times as many cancers as the other screening programmes put together\", meaning it will help in \"transforming cancer outcomes\". Modelling suggests the Galleri test could be effective as an annual blood test in people from the age of 50, when cancer cases begin to rapidly increase, he said. Earlier this year, research published in the journal BMJ Open found that an annual blood test for cancer could lead to 49% fewer late-stage diagnoses and 21% fewer deaths within five years. Professor Nitzan Rosenfeld, director of the Barts Cancer Institute in London, said the Galleri test results were \"impressive\". However, other experts have reacted more cautiously. Professor Clare Turnbull, from the Institute of Cancer Research, called for further research into whether such tests reduced cancer death rates. And Anna Schuh, professor of molecular diagnostics at the University of Oxford, warned that the test gets it wrong when it calls a positive result \"almost half of the time\", which she said was \"disappointing as it is only fractionally better compared to tossing a coin\"."
    },
    {
        "title": "Socialite Lady Annabel Goldsmith dies",
        "description": "Lady Annabel Goldsmith, the socialite who gave her name to a famous Mayfair nightclub, has died aged 91.",
        "url": "https://news.sky.com/story/socialite-lady-annabel-goldsmith-remembered-as-simply-irreplaceable-after-death-13452540",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-princess-diana-jemima-khan_7054474.jpg?20251018171449",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-18 17:09:00",
        "Headline": "The socialite Lady Annabel Goldsmith lent her name to the famous London nightclub of the rich and famous, Annabel's, in Mayfair.",
        "Content": "Lady Annabel Goldsmith, the socialite who gave her name to a famous Mayfair nightclub, has died aged 91. Her son Ben Goldsmith, an environmentalist and financier, described her as \"quite simply irreplaceable\" and said her life had been \"extraordinary and complete\". The widow of flamboyant billionaire financier Sir James Goldsmith died peacefully in her sleep on Saturday morning, her family said. Mr Goldsmith paid tribute to his mother in a statement to The Times newspaper, which read: \"She was quite simply irreplaceable. \"We are bereft, not for her - because her life has been extraordinary and complete - but for us, because of the immense hole in our lives she leaves behind. \"I spoke to her every day for 45 years. She truly had my back and we loved each other very much. I will miss her terribly.\" Lady Annabel was also mother to former Conservative minister and now Lord Zac Goldsmith, as well as writer and producer Jemima Goldsmith, entrepreneur Robin Birley and artist India Jane Birley. \"It is with great sadness that we announce the passing of our mother, Lady Annabel Goldsmith, who died peacefully in her sleep this morning at the age of 91,\" her children said in a joint statement. Born Lady Annabel Vane-Tempest-Stewart in 1934, she was the aristocratic daughter of the eighth Marquess of Londonderry. She married her first husband, Mark Birley, at the age of 19. He named the private members' club Annabel's, in London's Mayfair, after her. It has since become a destination for the rich and famous. Diana, Princess of Wales, with whom Lady Annabel was friends, held her hen do at the exclusive club. Her eldest son, Rupert, disappeared off the coast of West Africa in 1986 and was assumed to have died. Robin, the second son she had with Mark Birley, was mauled and permanently scarred by a tiger as a child at a private zoo. Lady Annabel later had an affair with Sir James, and went on to marry him. She described him as \"the most dynamic, charismatic and irresistible man I had ever come across\". She told The Guardian in 2009: \"My happiness in my life has nothing to do with being elite. \"Give me dogs, give me children, give me books and I'll be happy.\" Lady Annabel said people always assumed she was haughty, but insisted \"really I'm not\". She wrote a number of books, including a memoir of her life in 2004."
    },
    {
        "title": "Police in Derbyshire solve mystery of crocodile found in canal",
        "description": "Police hunting for a crocodile in Derbyshire have said the search turned out to be \"more fluff than fear\".",
        "url": "https://news.sky.com/story/police-in-derbyshire-solve-mystery-of-crocodile-found-in-canal-13452117",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-crocodile-derbyshire_7053843.jpg?20251018092507",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-10-18 08:08:00",
        "Headline": "The escapade seems to have entertained Derbyshire police's social media followers, with one commenting: \"Brilliant! Really made me smile once it was revealed what it was!\"",
        "Content": "Police hunting for a crocodile in Derbyshire have said the search turned out to be \"more fluff than fear\". Derbyshire Police's rural crime team posted \"the strangest appeal ever to grace our Facebook page\" on Thursday, after a member of the public spotted a crocodile dumped in a canal in Willington. \"We're going to go out on a limb and guess this little guy isn't native to Derbyshire and as such, if you can offer any information about the crocodile's whereabouts now, or have knowledge of how it ended up at that site, please drop us a direct message,\" said the appeal. \"For clarification, although we cannot claim to be medical professionals, we are acutely aware the crocodile is deceased,\" it added, after a number of commenters pointed out the animal looked dead. The appeal was widely shared and the team soon had an answer. \"We can now confirm the mystery has been solved!\" wrote the rural crime team on Friday. \"A member of [the] public has come forward and explained that the crocodile was a stuffed taxidermy one, filled with hay, and inadvertently caught while fishing... \"While it gave us all a bit of a surprise, it turns out this one was more fluff than fear!\" Read more from Sky News:'Victory for Virginia', says family - as Andrew gives up titlesEverything we know about Prince Andrew's title decisionTrump admits it's possible he's being 'played' by Putin The escapade seems to have entertained the crime team's Facebook followers, with one commenting: \"Brilliant! Really made me smile once it was revealed what it was! \"I can imagine it gave you all a bit of a shock.\""
    }
]