[
    {
        "title": "Boy, 13, arrested on suspicion of attempted murder after double stabbing at school",
        "description": "Police will continue to question a 13-year-old boy on suspicion of attempted murder today, as counter-terrorism officers lead an investigation into a double stabbing at a school.",
        "url": "https://news.sky.com/story/boy-13-arrested-on-suspicion-of-attempted-murder-after-double-stabbing-at-school-13505865",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kingsbury-high-school_7161366.jpg?20260210192714",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-10 18:27:00",
        "Headline": "The two victims remain in hospital, while the suspect is being questioned by officers. Anyone with information is being urged to contact police.",
        "Content": "Police will continue to question a 13-year-old boy on suspicion of attempted murder today, as counter-terrorism officers lead an investigation into a double stabbing at a school. Two boys, aged 12 and 13, are in a serious condition in hospital after Tuesday's attack at Kingsbury High School in Brent, northwest London. Police launched a search for the suspect, and officers later detained a 13-year-old boy. The investigation is being led by counter-terror police, although a terrorist incident has not been declared. Detective Chief Superintendent Luke Williams said detectives are \"keeping an open mind as to any motivation behind the attack\". Police and ambulance crews were called to reports of a stabbing at the school at around 12.40pm. A search for the suspect - identified as a teenage boy - was launched after it was established he had left the scene. Simon Theodorou, a parent of a child at the school, told The Telegraph the attacker \"managed to get his way in by climbing over a wall\". The Metropolitan Police confirmed the boy had been arrested shortly after 6pm, and a weapon was recovered. He remains in custody, while the two victims are still in hospital. One was taken to a major trauma centre \"as a priority\", the London Ambulance Service said. 'Deeply traumatic' In a letter to parents, the school's head teacher told parents the incident was a \"deeply traumatic event for the whole school community\". Alex Thomas said the lower school will remain shut on Wednesday, after some pupils were kept behind to speak to police officers more than three hours after their usual finishing time. Some were seen leaving in tears. 'No honour in staying silent' Home Secretary Shabana Mahmood described the attack as \"shocking\" and urged people to give police \"space to pursue their investigation\". The education secretary, Bridget Phillipson, said her \"heart goes out to the families affected\" and that the government was supporting the school. According to the latest Department for Education information, it has 1,997 pupils. Local MP Bob Blackman and London mayor Sadiq Khan also expressed their shock, and the latter urged anyone with information to contact police. \"There is no honour in staying silent,\" he added."
    },
    {
        "title": "Starmer insists he'll lead Labour into next election as he attempts to move on from leadership crisis",
        "description": "Sir Keir Starmer has said he will lead Labour into the next general election, as he attempts to move on from his biggest leadership crisis yet.",
        "url": "https://news.sky.com/story/starmer-insists-hell-lead-labour-into-next-election-as-he-attempts-to-move-on-from-leadership-crisis-13505915",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starmer-labour_7161546.jpg?20260210221026",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-10 21:10:00",
        "Headline": "The prime minister said he would \"never walk away from the people that I'm charged with fighting for\" as he tried to reboot his flailing premiership.",
        "Content": "Sir Keir Starmer has said he will lead Labour into the next general election, as he attempts to move on from his biggest leadership crisis yet. The prime minister told broadcasters on Tuesday: \"I had a five-year mandate to deliver the change. I intend to get on with what I was elected to do.\" Asked whether he would lead his party into the next election, scheduled for 2029, he said: \"Yes, I will.\" Politics latest: What are the next challenges for Starmer? Despite his strong words, with his cabinet and Labour MPs having rallied round him, Sky's political editor Beth Rigby said the prime minister remains in a \"weak position\". There have been growing doubts since last week about whether Sir Keir would stay in post - and for how long. He faced the biggest challenge to his leadership yet on Monday as Labour's leader in Scotland, Anas Sarwar, called for him to resign following the scandal over his appointment of Peter Mandelson as his US ambassador. In Sir Keir's first remarks since, he joked at an event in Hertfordshire on Tuesday: \"It's been a busy week.\" He then largely repeated the message he gave his own MPs on Monday evening, saying he \"will never walk away from the people that I'm charged with fighting for\". \"And I will never walk away from the country that I love,\" Sir Keir added. Addressing Labour infighting, he said his party needs to focus on improving living standards and public services, as well as battling what he described as Reform UK's politics of \"grievance\". But Conservative leader Kemi Badenoch told Sky News that Labour MPs had given Sir Keir a \"stay of execution, because they are terrified of losing their own jobs\". Labour MPs 'stepped back from the precipice' The PM's comments came after he chaired a cabinet meeting on Tuesday morning, having received its unanimous backing to remain in his post. Energy Secretary Ed Miliband told Sky News that Labour MPs had \"looked over the precipice yesterday and thought, we need to step back. We need to back our leader. We need to back the man who was elected only 18 months ago as prime minister.\" He said that Monday had been a \"very difficult day\" for the government, admitting that it had made \"mistakes\" and needed to change course. Challenged that Downing Street was briefing that Health Secretary Wes Streeting - often seen as a potential leadership challenger - told Mr Sarwar to make his statement, Ed Miliband said: \"MoveOn.org. I mean, let's just move past all this, honestly.\" Meanwhile, Manchester mayor Andy Burnham also gave his backing to Sir Keir, as did Welsh First Minister Eluned Morgan. Mr Burnham - who Sir Keir blocked from standing in the Gorton and Denton by-election - called for \"stability\" and \"greater unity\"."
    },
    {
        "title": "William didn't react to Epstein question - but his actions on Saudi trip have been telling",
        "description": "There was no reaction but we know Prince William and his team at least heard the shout, even if they didn't hear the full question.",
        "url": "https://news.sky.com/story/william-didnt-react-to-epstein-question-but-his-actions-on-saudi-trip-have-been-telling-13505881",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-prince-of-wales-prince-william_7160962.jpg?20260210120056",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-02-10 19:07:00",
        "Headline": "As William walked off a football pitch on the outskirts of Riyadh, where he is on an official visit, a reporter asked the prince: \"Sir, to what extent do you think the Royal Family has done enough around the Andrew and Epstein issue?\"",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n There was no reaction but we know Prince William and his team at least heard the shout, even if they didn't hear the full question. As William walked off a football pitch on the outskirts of Riyadh, where he is on an official visit, a reporter asked the prince: \"Sir, to what extent do you think the Royal Family has done enough around the Andrew and Epstein issue?\" The palace is trying to keep this trip to Saudi on track, with no cancellations or obvious adjustments to engagements. They want to remind us that William is used to navigating difficult times and takes his role seriously. If nothing else, they hope the heir and his family show the monarchy has got a positive future, at a time when they really need it, as they continue to compete against the seemingly uncontrollable noise around Andrew and Epstein. It's clear from the statements released on Monday that something has shifted over the past few days. William and Kate publicly addressed the Epstein scandal for the first time, with Kensington Palace saying they were \"deeply concerned\" at the \"continued revelations\" and that their thoughts \"remain focused on the victims\". Meanwhile, Buckingham Palace said the King had \"profound concern\" over claims about Andrew and it would support police if contacted. Silence was not an option, with the questions about what information Andrew was sharing during his time as trade envoy going right to the heart of the Royal Family's public purpose and what they're meant to be about. Andrew has denied any wrongdoing in relation to Epstein. Neither William nor the King have spoken about it on camera - not really a surprise - and William wasn't going to do it here in Saudi. But it doesn't help quell the voices of those who say they want to hear more from them - visible proof, you might say, of the \"concerns\" they have written about. William will also no doubt have seen the calls for the King to encourage Andrew to voluntarily speak to the police and authorities in America. We know that even on official trips, he monitors the news back home. Read more:Timing of palace's Andrew statement is extraordinaryPoll: Most people think King should encourage Andrew to testify But here in Saudi there was a new global audience for him to think about - one that wasn't going to ask him about Epstein. William and Kate's social media accounts feature a stream of photos of him meeting and greeting, and especially focusing on the time he spent with children and women. For the palace, it was a day meant to be about important future relationships as headlines in the UK continue to dwell on the past."
    },
    {
        "title": "Mandelson would have had 'thorough' vetting process before US ambassador role, says ex-MI6 boss",
        "description": "Lord Mandelson would have been subject to a \"thorough\" and \"intimate\" vetting process before he was appointed UK ambassador to the US, a former head of MI6 has said.",
        "url": "https://news.sky.com/story/mandelson-would-have-had-thorough-vetting-process-before-us-ambassador-role-says-ex-mi6-boss-13505826",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lord-mandelson-ambassador_7161356.jpg?20260210190315",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-10 17:01:00",
        "Headline": "Sir Richard Moore, who left his post last September, said he had not been part of the vetting process for Lord Mandelson, amid more revelations about the peer's relationship with paedophile Jeffrey Epstein.",
        "Content": "Lord Mandelson would have been subject to a \"thorough\" and \"intimate\" vetting process before he was appointed UK ambassador to the US, a former head of MI6 has said. Sir Richard Moore, who left his post last September, told Sky News' lead world news presenter Yalda Hakim he had not been part of the process, amid more revelations about the ex-Labour peer's relationship with paedophile Jeffrey Epstein. Sir Keir Starmer last week apologised to the public and to Epstein's victims for believing what he called \"Mandelson's lies\". The prime minister insisted he was misled over the extent of Lord Mandelson and Epstein's links, saying he had \"no reason\" to believe the peer was allegedly lying when he said he barely knew Epstein before being made ambassador. Sir Keir criticised the vetting process that Lord Mandelson went through. The Epstein files appear to show regular contact between the former Labour grandee and Epstein after the US financier's sex offence conviction in 2008. 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 Speaking about background checks more broadly, former spy chief Sir Richard said: \"Undoubtedly there would have been some background checks and then there's an interview process, where you rely to a degree. \"You've got the background checks, of course, to set it against, but you rely on people in those interview processes being very honest.\" He added: \"I've been through that many, many times. They can sometimes be uncomfortable conversations because you're being asked about very private elements of your lifestyle or about your financial situation, and you are required to answer those questions truthfully. \"And the system depends on the balance between truthful answers in the interview process and the checks on whether what's been said is truthful.\" Read more: What do the Epstein files say about Mandelson? Sir Richard said he was not aware of any intelligence relating to the peer's appointment as US ambassador, but even if he was, he would not be able to share it. He added: \"I'll say to you, I'm not aware of anything, but I repeat what I said, you have to understand the sensitivities of this, this stuff does not get circulated around the building. So the answer is, I have no idea.\" He also called out what he described as the \"rancid misogyny and appalling systematic abuse of women and girls\" exposed in the Epstein files. Lead world news presenter I've spent much of my career speaking to people trained to measure every word. Sir Richard Moore does that instinctively - not out of evasiveness, but habit. When I asked him about the vetting of Lord Mandelson, he drew a clear line. The prime minister has said Lord Mandelson was vetted; Sir Richard said he wasn't across the details and didn't want to discuss individual cases. It was a reminder of how intelligence leaders see their role: not as political referees, but as custodians of process and boundaries. What Sir Richard did lean into was culture. He spoke thoughtfully about misogyny and the need to listen to victims - a striking shift away from politics towards people. Coming from a former intelligence chief, it felt less like a talking point and more like a reckoning with how power can fail those it is meant to protect. After 38 years in service, Sir Richard admitted he misses the work, but spoke with pride rather than nostalgia. Above all, he highlighted MI6's cooperation with Ukraine. He cited intelligence suggesting around 30,000 Russian soldiers were killed in December alone - a brutal statistic that underlines the scale of the war. Despite sanctions and diplomatic pressure, Sir Richard believes Vladimir Putin remains too comfortable. His argument was analytical, not emotional: pressure works, but only when it is relentless. Hesitation, he suggested, is what allows wars like this to endure. Lord Mandelson was appointed ambassador in December 2024 and was sacked by Sir Keir in September 2025 over the peer's ties to Epstein. It comes as government figures prepare to hand over huge amounts of material to Parliament's security watchdog after they came under pressure to reveal what was known about the peer's friendship with Epstein when he was picked for the Washington job. Meanwhile, the Metropolitan Police has launched an investigation following accusations that Lord Mandelson passed market-sensitive information to Epstein in 2009."
    },
    {
        "title": "Starmer's ex-comms chief should lose peerage over links to paedophile, says Labour chair",
        "description": "Sir Keir Starmer's ex-communications chief should be stripped of his peerage over his ties to a paedophile councillor, Labour's chairwoman has said.",
        "url": "https://news.sky.com/story/starmers-ex-comms-chief-should-lose-peerage-over-links-to-paedophile-says-labour-chair-13506017",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-matthew-doyle-house-of-lords_7161664.png?20260210232901",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-10 22:55:00",
        "Headline": "Lord Doyle apologised and was suspended from the Labour Party on Tuesday for his links to Sean Morton, who he campaigned for in 2017 after he had been charged over indecent images of children.",
        "Content": "Sir Keir Starmer's ex-communications chief should be stripped of his peerage over his ties to a paedophile councillor, Labour's chairwoman has said. Anna Turley MP told Sky News \"there's no place [...] in the Lords\" for people like Matthew Doyle, who she suggested hadn't been truthful before being elevated to parliament's upper chamber earlier this year. Lord Doyle apologised and was suspended from Labour on Tuesday for his links to Sean Morton, who he campaigned for in 2017 after he had been charged over indecent images of children. The peer said he had believed Morton's initial assertions of innocence at the time, before he later pled guilty. Downing Street 10 was not aware Lord Doyle had campaigned for Morton at the time of his appointment, it is understood, and Ms Turley said \"what we'd been told was not the truth when that decision was made\". Asked if he should remain a peer, she told Sky News: \"No, I don't think he should. That's my personal view.\" \"There's no place for them in the Lords\" for people who \"have not been clear and transparent\", she added. Politics Hub: Follow the latest Lord Doyle has apologised \"unreservedly\" for supporting Morton, who was a councillor in Moray, Scotland. He first appeared in court in connection with indecent child images in late 2016, and was suspended by Labour. He was running as an independent when Lord Doyle campaigned for him in May 2017. He didn't plead guilty until November that year. Lord Doyle said he had \"extremely limited\" contact with him after his conviction, and described his offences as \"vile\". \"My thoughts are with the victims and all those impacted by these crimes,\" he added. He continued: \"At the point of my campaigning support, Morton repeatedly asserted to all those who knew him his innocence, including initially in court. \"He later changed his plea in court to guilty. \"To have not ceased support ahead of a judicial conclusion was a clear error of judgment for which I apologise unreservedly. Those of us who took him at his word were clearly mistaken.\" Read more from Sky News:Double stabbing at schoolOlympian admits cheating on girlfriend Lord Doyle only took his place in the upper chamber last month. The SNP had opposed his peerage. Tory leader Kemi Badenoch has called on the prime minister to publish \"vetting advice and due diligence\" reports provided before the peer's appointment. A Labour spokesman said Lord Doyle had lost the party whip while an investigation is carried out, and added: \"All complaints are assessed thoroughly in line with our rules and procedures.\""
    },
    {
        "title": "Olympian Sturla Holm Laegreid admits to cheating on girlfriend after medal win",
        "description": "Norwegian Olympian Sturla Holm Laegreid confessed in a live television interview to cheating on his girlfriend, moments after winning a bronze medal. ",
        "url": "https://news.sky.com/story/olympian-sturla-holm-laegreid-admits-to-cheating-on-girlfriend-after-medal-win-13505853",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-laegreid-olympics_7161374.jpg?20260210193211",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-10 17:59:00",
        "Headline": "The Norwegian told fans he already \"had a gold medal\" up until last week - but squandered it by being unfaithful.",
        "Content": "Norwegian Olympian Sturla Holm Laegreid confessed in a live television interview to cheating on his girlfriend, moments after winning a bronze medal.  Laegreid finished in third place in the biathlon, which combines cross-country skiing and rifle shooting, and then broke down in tears at the Winter Olympics on Tuesday. The Norwegian told fans he already \"had a gold medal\" up until last week - but squandered it by being unfaithful. Speaking to Norwegian state broadcaster NRK in his native language, just moments after finishing his biathlon, he said: \"There's someone I wanted to share it with who might not be watching today. \"Six months ago, I met the ​love of my life - the most beautiful and kindest ​person in the world. \"Three months ago, I made my biggest mistake and cheated on her. I told her about it a week ago. It's ‌been the worst week of my life.\" The 28-year-old then issued a heartfelt plea but stopped short of naming the woman. \"I had a gold medal in my life, and there are probably many who look ​at me with different eyes, but I only have eyes for her,\" he added. \"Sport has taken a slightly different place [in my life] the last few days. I wish I could share it with her.\" Read more from Sky News:Lindsey Vonn reveals extent of injuriesWinter Olympics hit by penis enhancement controversy   Laegreid later said he might not have been in the right state of mind to give the interview after the race, which came in the wake of the death of his teammate, Sivert ‍Guttorm Bakken, in December last year. \"Maybe it was really selfish of me to give that interview,\" he said a few hours later. \"So yeah, I ​don't know. I was, I'm a bit, I don't know... I'm not really here mentally. \"So yeah, we will see what happens.\" Laegreid came third in the men's Olympic 20km individual biathlon race in northern Italy. His fellow Norwegian Johan-Olav Botn took gold while France's Eric Perrot claimed the silver. The race came as US skier Lindsey Vonn confirmed she will need \"multiple surgeries\" following her crash in the women's downhill skiing final on Sunday."
    },
    {
        "title": "Plane ends up in ocean after emergency landing and all 55 people on board survive",
        "description": "All 55 people on board a passenger plane were safely evacuated after the aircraft overran the runway and ended up in shallow waters during an emergency landing in Somalia.",
        "url": "https://news.sky.com/story/plane-ends-up-in-ocean-after-emergency-landing-and-all-55-people-on-board-survive-13505888",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-somalia-emergency-landing_7161608.jpg?20260210224052",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-10 19:44:00",
        "Headline": "The Starsky Aviation aircraft had taken off from Mogadishu's international airport and was bound for the northern city of Gaalkacyo when it developed a technical problem about 15 minutes into its flight.",
        "Content": "All 55 people on board a passenger plane were safely evacuated after the aircraft overran the runway and ended up in shallow waters during an emergency landing in Somalia. No one was injured in the incident which happened near the country's main airport on Tuesday. The Starsky Aviation aircraft had taken off from Mogadishu's Aden Abdulle International Airport and was bound for the northern city of Gaalkacyo when it developed a technical problem about 15 minutes into its flight. The pilot then turned back and made an emergency landing but he overshot the tarmac, veered off and finished at the shoreline of a beach in the Indian Ocean. All 50 passengers and five crew members safely left the plane, a Fokker 50. Everyone on board was accounted for by a rescue team, transportation minister Mohamed Farah Nuh said. The aircraft was damaged and the cause of the crash will be investigated. Pictures showed the plane with at least one wing snapped but otherwise intact on the shoreline. Starsky Aviation chief executive Ahmed Nur said \"the aircraft overran on the runway\" before coming to a rest on the shore of the Indian Ocean near the airport. He added: \"No injuries, no deaths.\" Read more from Sky News:Irish man detained for five months in by ICERussia claims Zaporizhzhia gains The Somali Civil Aviation Authority said in a statement that at 1.17pm local time (10.17am UK time) \"an aircraft with registration number 60-YAS, an F50, was involved in a runway overrun at Mogadishu Aden Abdulle International Airport\". \"The aircraft was carrying 55 people on board. All occupants survived the incident and were promptly transported to a nearby hospital for medical evaluation and care. \"No fatalities have been reported.\""
    },
    {
        "title": "Boy, 13, arrested on suspicion of attempted murder after double stabbing at school",
        "description": "Police will continue to question a 13-year-old boy on suspicion of attempted murder today, as counter-terrorism officers lead an investigation into a double stabbing at a school.",
        "url": "https://news.sky.com/story/boy-13-arrested-on-suspicion-of-attempted-murder-after-double-stabbing-at-school-13505865",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kingsbury-high-school_7161366.jpg?20260210192714",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 18:27:00",
        "Headline": "The two victims remain in hospital, while the suspect is being questioned by officers. Anyone with information is being urged to contact police.",
        "Content": "Police will continue to question a 13-year-old boy on suspicion of attempted murder today, as counter-terrorism officers lead an investigation into a double stabbing at a school. Two boys, aged 12 and 13, are in a serious condition in hospital after Tuesday's attack at Kingsbury High School in Brent, northwest London. Police launched a search for the suspect, and officers later detained a 13-year-old boy. The investigation is being led by counter-terror police, although a terrorist incident has not been declared. Detective Chief Superintendent Luke Williams said detectives are \"keeping an open mind as to any motivation behind the attack\". Police and ambulance crews were called to reports of a stabbing at the school at around 12.40pm. A search for the suspect - identified as a teenage boy - was launched after it was established he had left the scene. Simon Theodorou, a parent of a child at the school, told The Telegraph the attacker \"managed to get his way in by climbing over a wall\". The Metropolitan Police confirmed the boy had been arrested shortly after 6pm, and a weapon was recovered. He remains in custody, while the two victims are still in hospital. One was taken to a major trauma centre \"as a priority\", the London Ambulance Service said. 'Deeply traumatic' In a letter to parents, the school's head teacher told parents the incident was a \"deeply traumatic event for the whole school community\". Alex Thomas said the lower school will remain shut on Wednesday, after some pupils were kept behind to speak to police officers more than three hours after their usual finishing time. Some were seen leaving in tears. 'No honour in staying silent' Home Secretary Shabana Mahmood described the attack as \"shocking\" and urged people to give police \"space to pursue their investigation\". The education secretary, Bridget Phillipson, said her \"heart goes out to the families affected\" and that the government was supporting the school. According to the latest Department for Education information, it has 1,997 pupils. Local MP Bob Blackman and London mayor Sadiq Khan also expressed their shock, and the latter urged anyone with information to contact police. \"There is no honour in staying silent,\" he added."
    },
    {
        "title": "Starmer's ex-comms chief should lose peerage over links to paedophile, says Labour chair",
        "description": "Sir Keir Starmer's ex-communications chief should be stripped of his peerage over his ties to a paedophile councillor, Labour's chairwoman has said.",
        "url": "https://news.sky.com/story/starmers-ex-comms-chief-should-lose-peerage-over-links-to-paedophile-says-labour-chair-13506017",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-matthew-doyle-house-of-lords_7161664.png?20260210232901",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 22:55:00",
        "Headline": "Lord Doyle apologised and was suspended from the Labour Party on Tuesday for his links to Sean Morton, who he campaigned for in 2017 after he had been charged over indecent images of children.",
        "Content": "Sir Keir Starmer's ex-communications chief should be stripped of his peerage over his ties to a paedophile councillor, Labour's chairwoman has said. Anna Turley MP told Sky News \"there's no place [...] in the Lords\" for people like Matthew Doyle, who she suggested hadn't been truthful before being elevated to parliament's upper chamber earlier this year. Lord Doyle apologised and was suspended from Labour on Tuesday for his links to Sean Morton, who he campaigned for in 2017 after he had been charged over indecent images of children. The peer said he had believed Morton's initial assertions of innocence at the time, before he later pled guilty. Downing Street 10 was not aware Lord Doyle had campaigned for Morton at the time of his appointment, it is understood, and Ms Turley said \"what we'd been told was not the truth when that decision was made\". Asked if he should remain a peer, she told Sky News: \"No, I don't think he should. That's my personal view.\" \"There's no place for them in the Lords\" for people who \"have not been clear and transparent\", she added. Politics Hub: Follow the latest Lord Doyle has apologised \"unreservedly\" for supporting Morton, who was a councillor in Moray, Scotland. He first appeared in court in connection with indecent child images in late 2016, and was suspended by Labour. He was running as an independent when Lord Doyle campaigned for him in May 2017. He didn't plead guilty until November that year. Lord Doyle said he had \"extremely limited\" contact with him after his conviction, and described his offences as \"vile\". \"My thoughts are with the victims and all those impacted by these crimes,\" he added. He continued: \"At the point of my campaigning support, Morton repeatedly asserted to all those who knew him his innocence, including initially in court. \"He later changed his plea in court to guilty. \"To have not ceased support ahead of a judicial conclusion was a clear error of judgment for which I apologise unreservedly. Those of us who took him at his word were clearly mistaken.\" Read more from Sky News:Double stabbing at schoolOlympian admits cheating on girlfriend Lord Doyle only took his place in the upper chamber last month. The SNP had opposed his peerage. Tory leader Kemi Badenoch has called on the prime minister to publish \"vetting advice and due diligence\" reports provided before the peer's appointment. A Labour spokesman said Lord Doyle had lost the party whip while an investigation is carried out, and added: \"All complaints are assessed thoroughly in line with our rules and procedures.\""
    },
    {
        "title": "Afghan asylum seeker found guilty of abducting and raping 12-year-old girl",
        "description": "An Afghan asylum seeker has been found guilty of abducting and raping a 12-year-old girl in Warwickshire.",
        "url": "https://news.sky.com/story/afghan-national-found-guilty-of-abducting-and-raping-12-year-old-girl-13505786",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ahmad-mulakhil-nuneaton_7161185.jpg?20260210160425",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 15:41:00",
        "Headline": "Ahmad Mulakhil, 23, \"targeted\" the child after spotting her in a park in Nuneaton last July, prosecutors said.",
        "Content": "An Afghan asylum seeker has been found guilty of abducting and raping a 12-year-old girl in Warwickshire. Ahmad Mulakhil, 23, \"targeted\" the child after spotting her in a park in Nuneaton last July, prosecutors said. The attack sparked protests in the town, with demonstrators holding St George's Cross flags and Union flags as they marched along the high street chanting \"stop the boats\" and \"we want our country back\". Mulakhil was unanimously convicted at Warwick Crown Court of rape and two counts of sexual assault, having admitted a further rape charge before his trial. Jurors also convicted him of child abduction and taking an indecent video of the girl during her ordeal. He had told the court he did not force the girl to do anything, and did not threaten her family, but had filmed her, at her insistence, during a brief period of sexual activity. Mulakhil told police he believed the girl was 19 and that she had initiated what was his first sexual encounter. Co-defendant Mohammad Kabir, also an Afghan national, was acquitted of intentional strangulation, attempted child abduction and committing an offence with intent to commit a sexual offence. Kabir, who is 24 according to court documents but told jurors he was 22, was cleared after maintaining he never touched the victim and had no sexual intentions towards her. Jurors were told Mulakhil arrived in the UK four months before the rapes and had made an immigration application linked to \"problems\" he had experienced in Afghanistan. The trial was not told he had arrived in Britain by small boat, or that Kabir had entered the UK by the same method on Christmas Day in 2024. Read more from Sky News:Teen sentenced for murder of 12-year-old in random attackKing should encourage Andrew to testify about Epstein - poll The men's arrest and charge prompted Reform UK leader Nigel Farage and Warwickshire County Council leader George Finch to claim there had been a \"cover-up\" of details about the attack. In August, Mr Farage also suggested police should release the immigration status of people charged with offences. Guidance for police has since changed to allow forces to give nationality and ethnicity details if there is a legitimate policing purpose - but forces still do not confirm the immigration status of crime suspects. Mulakhil was remanded in custody and will be sentenced on a date to be fixed. Judge Kristina Montgomery KC said: \"He will plainly receive a substantial custodial sentence which will automatically make him liable for deportation at its conclusion.\" She thanked jurors for discharging their duties without paying regard to the \"noise\" surrounding the proceedings."
    },
    {
        "title": "Daily Mail editor Paul Dacre clashes with lawyer as he describes 'rage' over allegations",
        "description": "Former Daily Mail editor Paul Dacre has clashed in court with a lawyer, calling some of the allegations in a case against his newspaper group by a number of celebrities and Prince Harry \"preposterous\".",
        "url": "https://news.sky.com/story/daily-mail-editor-paul-dacre-clashes-with-lawyer-as-he-describes-rage-over-allegations-13505860",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-paul-dacre-courts-associated-newspapers_7161084.jpg?20260210140944",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-10 18:18:00",
        "Headline": "One of Britain's most powerful press figures, Paul Dacre began his evidence, describing his \"rage\" at the allegations levelled against Associated Newspapers Limited by figures including Prince Harry.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Former Daily Mail editor Paul Dacre has clashed in court with a lawyer, calling some of the allegations in a case against his newspaper group by a number of celebrities and Prince Harry \"preposterous\". The 77-year-old called for for \"a sense of proportion\" and echoed his earlier witness statement, which said some of the claims \"have astonished, appalled and - in the small hours of the night - reduced me to rage.\" Mr Dacre, who was editor of the Daily Mail between 1992 and 2018, was the first witness giving evidence in support of Associated Newspapers Limited's defence, entering the witness stand on Tuesday afternoon, in the fourth week of the trial. The group litigation is being brought by seven high-profile individuals, including The Duke of Sussex, Sir Elton John and Liz Hurley, who claim Associated Newspapers Limited (ANL) hired private detectives to commit a series of unlawful acts between 1993 and 2011. The other claimants are David Furnish, Sadie Frost, anti-racism campaigner Baroness Doreen Lawrence, and Sir Simon Hughes. Allegations range from tapping their phones and bugging their homes to paying police officials for inside information and getting medical records by deception. ANL denies the allegations and says none of the information for the stories complained of was unlawfully obtained. \n                  Liz Hurley hits back at 'leak' suggestions and claims phone was bugged, during intense day at High Court\n                 \n                  Prince Harry v Daily Mail: A huge day, but a surprisingly short time on the stand in his case against Associated Newspapers\n                 \n                  Prince Harry becomes emotional after day of dramatic evidence against Mail publisher\n                 Ex Mail boss: 'My heart bleeds for Doreen Lawrence' Mr Dacre, who is now the editor-in-chief of DMG Media, the holding company of ANL, previously told the Leveson Inquiry in 2012 there was \"no phone hacking on the Daily Mail\". When asked in court about documents showing the Daily Mail and The Mail On Sunday spent more than £3m on private investigators during the relevant period, Mr Dacre said while he had a \"vague memory\" of the discovery of such invoices, he was unable to comment on the sum without \"more specifics\". Early in his evidence, he said his \"heart bleeds\" for Baroness Doreen Lawrence, the mother of 1993 murder victim Stephen Lawrence, but would not generalise about his feelings towards the other six claimants. In his witness statement, Mr Dacre called Lady Lawrence's claims \"especially bewildering and bitterly wounding to me personally\". The paper conducted a 15-year campaign to bring Stephen's killers to justice, including a front-page story on Valentine's Day 1997, labelling five men - Gary Dobson, Neil Acourt, Jamie Acourt, Luke Knight, and David Norris - as \"murderers\" and challenging them to sue the newspaper for libel. Mr Dacre described it as \"the campaign of which I am most proud\". In her claim, Lady Lawrence alleges ANL had targeted her with hidden electronic surveillance, as well as tapping her landline, monitoring her bank account and making payments to police officers for confidential information, with the court told she felt \"like a victim all over again\". In his written evidence, Mr Dacre said that it was \"inconceivable\" that anyone at the Daily Mail would have carried out the alleged activities, and said the story was personally given to him by the then home secretary Jack Straw. He also said \"the suggestion that we ran the campaign to generate exclusive headlines, sell newspapers and profit is sickeningly misplaced and bleakly cynical\". Report was a 'wake-up' call When asked by the claimants' lawyer David Sherborne if he was motivated by a desire to \"protect his legacy\" rather than get to the truth, Mr Dacre said, while he did wish to clear his name, he also cared about the paper and \"the honest and dedicated staff who work for it\". Mr Dacre called a 2006 Information Commissioner's Office report, which showed journalists at the Mail were the top users of private detective Steve Whittamore, a \"wake-up call\" which set \"alarm bells ringing\". While he said he would not attempt to \"justify the figures\", he said in the three months following the report, he had \"stamped out the use of search agencies\". Mr Dacre also described his lack of technical know-how to the court, and said in his witness statement: \"I didn't ever use a personal computer and barely knew how to log on.\" ANL's barrister Antony White KC has previously said that ANL was defending the claims both on their merits and for being brought too late and that the allegations in relation to Lady Lawrence \"are denied in their entirety\" and \"are unsupported by the available evidence\". Meanwhile, the claimants' lawyer Mr Sherborne has accused the Daily Mail and The Mail on Sunday of being engaged in unlawful information gathering over \"at least two decades\", claiming they have \"skeletons in their closet\". Giving evidence in the first week of the trial, Prince Harry opened up about his experiences with the media, appearing emotional as he recounted how the press \"made my wife's life misery\". Actress Liz Hurley gave evidence the following day, becoming tearful as she described the alleged \"brutal invasion\" of her privacy by the media. Mr Dacre will continue his evidence on Wednesday morning. The trial before Mr Justice Nicklin is due to conclude in March, with a judgment in writing due at a later date."
    },
    {
        "title": "Teenager sentenced for murder of 12-year-old Leo Ross who was stabbed in random attack",
        "description": "A teenage boy who murdered 12-year-old Birmingham schoolboy Leo Ross by stabbing him in the stomach in a random attack has been detained for a minimum of 13 years. ",
        "url": "https://news.sky.com/story/teenager-sentenced-for-murder-of-12-year-old-leo-ross-who-was-stabbed-in-random-attack-13505547",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-leo-ross-birmingham_7161171.jpg?20260210154457",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 07:36:00",
        "Headline": "The judge at Birmingham Crown Court accused the defendant of \"a campaign of serious violence\", including a separate attempt to drown an 82-year-old woman.",
        "Content": "A teenage boy who murdered 12-year-old Birmingham schoolboy Leo Ross by stabbing him in the stomach in a random attack has been detained for a minimum of 13 years.  The 15-year-old, who was 14 at the time of the attack and cannot be named for legal reasons, pleaded guilty to murder at a hearing in January. He also admitted to three separate attacks on elderly women. During sentencing at Birmingham Crown Court, Mr Justice Choudhury told the defendant his actions were \"cowardly\" but also \"indicate quite sophisticated and callous thinking\". \"You engaged in a campaign of serious violence against different people, culminating in the fatal stabbing of Leo. The devastation you have caused to so many lives is hard to comprehend,\" he added. Leo died after being taken to hospital from a riverside path in Shire Country Park, Hall Green, Birmingham, on 21 January last year. He had been walking home from school when he was stabbed. Leo's mother, Rachel Fisher, delivered a victim impact statement at the sentencing hearing and said her family had been \"shattered\" by his death. The defendant looked at the floor as Ms Fisher sobbed and said: \"Everyone has lost the most beautiful little soul, for what? We won't ever know why such an innocent young boy, just walking home from school, minding his business, was robbed of his life for no reason whatsoever.\" Leo's mother later spoke outside the court and said the 13-year sentence was a \"joke\". \"Thirteen years is a complete and utter joke, and it's just going to keep on happening and keep on happening until something's done about it,\" she said. \"These kids aren't scared. They aren't scared of the sentence. They're not worried.\" In a statement read by police, Leo's foster family, the Westons, said he was \"deeply loved\" and killed in a \"senseless and unprovoked act of violence\", but added that today's sentence \"marks neither closure nor healing\". The defendant admitted to two counts of causing grievous bodily harm with intent on the 19 and 20 January and assault occasioning actual bodily harm on 21 January 2025, in relation to the separate attacks on other victims. The boy also admitted to having a bladed article on the day he killed Leo. However, he denied assault occasioning actual bodily harm on 22 October 2024 and assault by beating on 29 December 2024 in relation to two further victims - those charges were ordered to lie on file. Police inquiries established that the knife used to kill Leo was thrown into a nearby river, while the youth had previously hunted down and attacked several women, including an 82-year-old woman who suffered several broken bones. \"The savagery required to inflict such injuries to a defenceless elderly lady is hard to comprehend,\" Mr Justice Choudhury told the defendant. Read more from Sky News:Timing of Palace's latest Andrew statement is extraordinaryLindsey Vonn has 'no regrets' after Winter Olympics injuries West Midlands Police also found that the killer, who had been riding a bike, had opted to hang around to talk to officers at the murder scene, falsely claiming he had stumbled across Leo lying fatally injured beside the River Cole. The judge said the defendant's behaviour of pretending he was an innocent bystander was part of a pattern in which he enjoyed \"witnessing the havoc you have created\". Leo had no connection with his attacker and was subjected to what senior officers believe was a completely random and unprovoked stabbing. After applications from the media, the judge ruled Leo's killer would be named on Wednesday, unless there was an appeal, to allow the public to know \"what could have led a child to commit such acts\"."
    },
    {
        "title": "Mandelson would have had 'thorough' vetting process before US ambassador role, says ex-MI6 boss",
        "description": "Lord Mandelson would have been subject to a \"thorough\" and \"intimate\" vetting process before he was appointed UK ambassador to the US, a former head of MI6 has said.",
        "url": "https://news.sky.com/story/mandelson-would-have-had-thorough-vetting-process-before-us-ambassador-role-says-ex-mi6-boss-13505826",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lord-mandelson-ambassador_7161356.jpg?20260210190315",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 17:01:00",
        "Headline": "Sir Richard Moore, who left his post last September, said he had not been part of the vetting process for Lord Mandelson, amid more revelations about the peer's relationship with paedophile Jeffrey Epstein.",
        "Content": "Lord Mandelson would have been subject to a \"thorough\" and \"intimate\" vetting process before he was appointed UK ambassador to the US, a former head of MI6 has said. Sir Richard Moore, who left his post last September, told Sky News' lead world news presenter Yalda Hakim he had not been part of the process, amid more revelations about the ex-Labour peer's relationship with paedophile Jeffrey Epstein. Sir Keir Starmer last week apologised to the public and to Epstein's victims for believing what he called \"Mandelson's lies\". The prime minister insisted he was misled over the extent of Lord Mandelson and Epstein's links, saying he had \"no reason\" to believe the peer was allegedly lying when he said he barely knew Epstein before being made ambassador. Sir Keir criticised the vetting process that Lord Mandelson went through. The Epstein files appear to show regular contact between the former Labour grandee and Epstein after the US financier's sex offence conviction in 2008. 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 Speaking about background checks more broadly, former spy chief Sir Richard said: \"Undoubtedly there would have been some background checks and then there's an interview process, where you rely to a degree. \"You've got the background checks, of course, to set it against, but you rely on people in those interview processes being very honest.\" He added: \"I've been through that many, many times. They can sometimes be uncomfortable conversations because you're being asked about very private elements of your lifestyle or about your financial situation, and you are required to answer those questions truthfully. \"And the system depends on the balance between truthful answers in the interview process and the checks on whether what's been said is truthful.\" Read more: What do the Epstein files say about Mandelson? Sir Richard said he was not aware of any intelligence relating to the peer's appointment as US ambassador, but even if he was, he would not be able to share it. He added: \"I'll say to you, I'm not aware of anything, but I repeat what I said, you have to understand the sensitivities of this, this stuff does not get circulated around the building. So the answer is, I have no idea.\" He also called out what he described as the \"rancid misogyny and appalling systematic abuse of women and girls\" exposed in the Epstein files. Lead world news presenter I've spent much of my career speaking to people trained to measure every word. Sir Richard Moore does that instinctively - not out of evasiveness, but habit. When I asked him about the vetting of Lord Mandelson, he drew a clear line. The prime minister has said Lord Mandelson was vetted; Sir Richard said he wasn't across the details and didn't want to discuss individual cases. It was a reminder of how intelligence leaders see their role: not as political referees, but as custodians of process and boundaries. What Sir Richard did lean into was culture. He spoke thoughtfully about misogyny and the need to listen to victims - a striking shift away from politics towards people. Coming from a former intelligence chief, it felt less like a talking point and more like a reckoning with how power can fail those it is meant to protect. After 38 years in service, Sir Richard admitted he misses the work, but spoke with pride rather than nostalgia. Above all, he highlighted MI6's cooperation with Ukraine. He cited intelligence suggesting around 30,000 Russian soldiers were killed in December alone - a brutal statistic that underlines the scale of the war. Despite sanctions and diplomatic pressure, Sir Richard believes Vladimir Putin remains too comfortable. His argument was analytical, not emotional: pressure works, but only when it is relentless. Hesitation, he suggested, is what allows wars like this to endure. Lord Mandelson was appointed ambassador in December 2024 and was sacked by Sir Keir in September 2025 over the peer's ties to Epstein. It comes as government figures prepare to hand over huge amounts of material to Parliament's security watchdog after they came under pressure to reveal what was known about the peer's friendship with Epstein when he was picked for the Washington job. Meanwhile, the Metropolitan Police has launched an investigation following accusations that Lord Mandelson passed market-sensitive information to Epstein in 2009."
    },
    {
        "title": "Drug dealer inspired by Home Alone rigged house with booby-traps",
        "description": "A drug dealer who rigged his house with booby-traps after being inspired by the Christmas classic Home Alone has been jailed for seven years.",
        "url": "https://news.sky.com/story/drug-dealer-inspired-by-home-alone-rigged-house-with-booby-traps-13505690",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ian-claughton-home-alone_7161000.jpg?20260210124259",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 14:13:00",
        "Headline": "Opening the trial to jurors last October, the prosecutor said: \"If you are sitting there thinking that this sounds a little like the film Home Alone, then you would be correct\".",
        "Content": "A drug dealer who rigged his house with booby-traps after being inspired by the Christmas classic Home Alone has been jailed for seven years. Ian Claughton used tripwires and home-made pipe bombs to protect his drugs business from would-be intruders. Around 100 homes in Grimethorpe, a former pit village in South Yorkshire, had to be evacuated in May 2024 as police searched three neighbouring houses connected to Claughton and his ex-wife. They found a series of traps as well as a home-made flamethrower, large quantities of cannabis, amphetamines and cash. Mr Claughton was jailed for seven years at Sheffield Crown Court on Tuesday by Judge Graham Reeds, who said he was \"a drug dealer who used these weapons to protect [his] cannabis growing operation\". His ex-wife, Lesley Claughton, was sentenced to 21 months in prison, suspended for two years. Opening the trial to jurors last October, prosecutor Helen Chapman said: \"If you are sitting there thinking that this sounds a little like the film Home Alone, then you would be correct. \"In fact, that is precisely what Ian Claughton said he was aiming for when he told the police about these devices.\" Police found a fishing wire running across the length of one of the rooms at knee height, attached to an electrical connector and a battery pack. Ian Claughton told police the explosives were crow-scarers, used by farmers, which he had inserted into plastic piping and, in one instance, into a bag of paint. A stun gun was found behind a fridge-freezer, and a homemade flame-thrower was discovered in a workshop. Other weapons found at the properties included two high-powered air guns and a crossbow. A large amount of cash was also discovered, including £27,000 sewn into a sofa. Cannabis plants were found growing in two of the houses, including some in tents in hidden rooms. The Home Alone fan was caught when Border Force found a package of imitation firearms addressed to his ex-wife at Heathrow Airport. The five small silver-and-black folding five-shot revolvers had been ordered by Ian Claughton using Lesley Claughton's eBay account, the court heard. Ian Claughton, 60, pleaded guilty to bringing a realistic imitation firearm into the country, being concerned in the production of cannabis and two counts of possession with intent to supply class B drugs. Read more from Sky News:Butcher guilty of killing and cutting up girlfriendHundreds of homes flooded with record levels of rain set to continue He was convicted of three counts of possessing prohibited firearms, possession of criminal property and possession of explosive substances after a trial at Doncaster Crown Court. He was cleared of a firearms charge relating to a stun gun. Lesley Claughton, 59, was found guilty of bringing a realistic imitation firearm into the country, possessing class B drugs with intent to supply, possession of criminal property and being concerned in production of cannabis. Detective Superintendent Al Burns, of the Yorkshire and Humber Regional Organised Crime Unit, said Claughton \"appears to have developed a siege mentality that saw him go to unusual and elaborate lengths to defend his home and its illicit contents from would-be intruders, drawing inspiration from Macaulay Culkin's character in the popular Christmas film Home Alone\"."
    },
    {
        "title": "Starmer insists he'll lead Labour into next election as he attempts to move on from leadership crisis",
        "description": "Sir Keir Starmer has said he will lead Labour into the next general election, as he attempts to move on from his biggest leadership crisis yet.",
        "url": "https://news.sky.com/story/starmer-insists-hell-lead-labour-into-next-election-as-he-attempts-to-move-on-from-leadership-crisis-13505915",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starmer-labour_7161546.jpg?20260210221026",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 21:10:00",
        "Headline": "The prime minister said he would \"never walk away from the people that I'm charged with fighting for\" as he tried to reboot his flailing premiership.",
        "Content": "Sir Keir Starmer has said he will lead Labour into the next general election, as he attempts to move on from his biggest leadership crisis yet. The prime minister told broadcasters on Tuesday: \"I had a five-year mandate to deliver the change. I intend to get on with what I was elected to do.\" Asked whether he would lead his party into the next election, scheduled for 2029, he said: \"Yes, I will.\" Politics latest: What are the next challenges for Starmer? Despite his strong words, with his cabinet and Labour MPs having rallied round him, Sky's political editor Beth Rigby said the prime minister remains in a \"weak position\". There have been growing doubts since last week about whether Sir Keir would stay in post - and for how long. He faced the biggest challenge to his leadership yet on Monday as Labour's leader in Scotland, Anas Sarwar, called for him to resign following the scandal over his appointment of Peter Mandelson as his US ambassador. In Sir Keir's first remarks since, he joked at an event in Hertfordshire on Tuesday: \"It's been a busy week.\" He then largely repeated the message he gave his own MPs on Monday evening, saying he \"will never walk away from the people that I'm charged with fighting for\". \"And I will never walk away from the country that I love,\" Sir Keir added. Addressing Labour infighting, he said his party needs to focus on improving living standards and public services, as well as battling what he described as Reform UK's politics of \"grievance\". But Conservative leader Kemi Badenoch told Sky News that Labour MPs had given Sir Keir a \"stay of execution, because they are terrified of losing their own jobs\". Labour MPs 'stepped back from the precipice' The PM's comments came after he chaired a cabinet meeting on Tuesday morning, having received its unanimous backing to remain in his post. Energy Secretary Ed Miliband told Sky News that Labour MPs had \"looked over the precipice yesterday and thought, we need to step back. We need to back our leader. We need to back the man who was elected only 18 months ago as prime minister.\" He said that Monday had been a \"very difficult day\" for the government, admitting that it had made \"mistakes\" and needed to change course. Challenged that Downing Street was briefing that Health Secretary Wes Streeting - often seen as a potential leadership challenger - told Mr Sarwar to make his statement, Ed Miliband said: \"MoveOn.org. I mean, let's just move past all this, honestly.\" Meanwhile, Manchester mayor Andy Burnham also gave his backing to Sir Keir, as did Welsh First Minister Eluned Morgan. Mr Burnham - who Sir Keir blocked from standing in the Gorton and Denton by-election - called for \"stability\" and \"greater unity\"."
    },
    {
        "title": "Why is the UK so wet? The 'blocking' phenomenon causing rain to 'stall' over country",
        "description": "Rainfall records have been broken across Britain as a phenomenon called a \"blocking pattern\" is causing the wet weather to linger.    ",
        "url": "https://news.sky.com/story/hundreds-of-homes-flooded-with-record-levels-of-rain-set-to-continue-13505552",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-weather-rain-flood_7160696.jpg?20260210080459",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-10 07:47:00",
        "Headline": "With  26 weather stations setting new monthly records for the highest January rainfall and more than 150 flood alerts in force, the Met Office said there was a sense of winter being \"stuck on repeat\".",
        "Content": "Rainfall records have been broken across Britain as a phenomenon called a \"blocking pattern\" is causing the wet weather to linger.     Blocks are \"areas of high pressure that remain nearly stationary and distort the usual [...] progression of pressure systems,\" the Met Office says. The pattern has settled over northern Europe, preventing weather fronts from clearing and causing the rain to stall over the UK, it added. Check the weather forecast in your area \"The result has been continuous waves of rain, strong winds, and hill snow in parts of Scotland,\" Met Office chief forecaster Neil Armstrong said. This event has created a sense of winter being \"stuck on repeat\" in many places, the Met Office added, and the persistent rain has caused hundreds of homes to flood, with more at risk. The Environment Agency (EA) had 97 flood warnings in place across England on Tuesday night, with two flood warnings in Scotland. A further 150 flood alerts, meaning flooding is possible, were in force across England, with seven in Scotland and one in Wales. The EA is urging the public to remain vigilant against floods after at least 300 homes were flooded in England. And with Britain facing rain every day in 2026, meteorologists say the downpours are set to continue. Steven Keates, deputy chief forecaster with the Met Office, said: \"In the near term, the unsettled theme is expected to continue, with further showers or longer spells of rain for most. \"We are likely to see the transition from wet and windy weather to colder, more settled conditions towards the end of the week, with Saturday looking a fine day for many. \"But, this reprieve doesn't last long, as the next set of Atlantic weather fronts looks set to move in from the west at the end of the weekend.\" Across the UK, 26 weather stations set new monthly records for the highest January rainfall, according to the forecaster. Northern Ireland endured its wettest January in 149 years. Daily rainfall records were broken too - with weather stations in Plymouth, Dorset, and Devon recording their wettest January day for 104 years, 74 years and 57 years respectively. The theme has continued in February, with England already recording 59% of its usual rainfall for the month, rising to 72% in the South. A number of observing sites, mostly clustered in the South West, have recorded rain every day this year. Read more:Migrant crossings hit five-year low in stormy JanuaryUK facing up to 10 more days of rain, forecasters warn In Scotland, Aberdeen has already had 180% of its typical February rainfall, Kincardineshire 152%, and Angus 130%. A yellow weather warning for rain remains in effect for parts of eastern Scotland throughout Tuesday. Andrew Hitchings, flood duty manager at the Environment Agency, said: \"With another band of rain on its way, we need the public to remain vigilant to the risk of flooding. \"As well as significant groundwater remaining likely in parts of Dorset and Wiltshire, there are risks of significant river flooding impacts on the Somerset Levels, with minor river flooding impacts expected in parts of the East Midlands and probable in Worcestershire and Gloucestershire. \"So far 16,000 homes and business have been protected but sadly 300 have suffered flooding and our thoughts are with those communities affected. \"Our teams will continue to do all they can to support local people, with pumps, temporary barriers and by clearing waterways to ensure flood water can drain away.\" He added: \"It is extremely dangerous to drive through flood water - we urge drivers not to do so.\""
    },
    {
        "title": "Prince William asked to raise case of detained Manchester man during visit to Saudi Arabia",
        "description": "The Prince of Wales has been asked to raise the case of a Manchester man detained in Saudi Arabia during his first official trip to the country.",
        "url": "https://news.sky.com/story/prince-william-asked-to-raise-case-of-detained-manchester-man-during-visit-to-saudi-arabia-13505616",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ahmed-doush_7160848.jpg?20260210101523",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-02-10 09:53:00",
        "Headline": "In a letter, exclusively shared with Sky News, Amnesty International has written to Prince William sharing the plight of father-of-four Ahmed al-Doush.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The Prince of Wales has been asked to raise the case of a Manchester man detained in Saudi Arabia during his first official trip to the country. In a letter, exclusively shared with Sky News, Amnesty International has written to Prince William sharing the plight of Ahmed al-Doush. The father of four, and senior banking analyst for Bank of America, was returning from a holiday in Saudi with his wife and children in 2024 when he was arrested for past social media posts and his alleged association with a Saudi critic in exile, which he denies. He was initially sentenced to ten years in prison now reduced to eight. Sky News approached the Saudi embassy for comment but received no response. Felix Jakens, head of campaigns for Amnesty, told us: \"It was unsurprising the UK government and our economy and society are moving much closer to Saudi Arabia, so we would expect to see a royal visit at some point. \"Obviously, what we as a human rights organisation want to do is make sure that human rights are part of that conversation… \n                  William didn't react to Epstein question - but his actions on Saudi trip have been telling\n                 \n                  Prince William and Prince George help prepare Christmas lunch for the homeless\n                 \n                  William and Kate reveal Christmas card featuring family photo with George, Charlotte and Louis\n                 \"Obviously, we wouldn't be expecting him (Prince William) to make big public statements about human rights in Saudi Arabia, but we know that some of these issues are close to his and his wife's heart, so we'd just be asking him whether, in private, he'd be willing to raise the case of Ahmed.\" Talking about the impact on the al-Doush family, Haydee Dijkstal, Mr al-Doush's legal representative, said: \"His wife has spoken about the core role that Ahmed had in their family, not only as a provider, as the main provider for the family, but as a loving father. \"And his absence has been very much missed by his wife and children, and has had a serious impact on them. \"And this in addition to the most recent concerns about the fact that Ahmed's health and well-being, and the recent fear about his mental health, his mental well-being as well, have led his wife to appeal directly to the Crown Prince of Saudi Arabia.\" We understand his case has been raised by the UK with Saudi authorities. The Foreign Office told Sky News: \"We are supporting a British man who is detained in Saudia Arabia and are in contact with his family and the local authorities.\" This visit was always going to have its political sensitivities. Kensington Palace wouldn't comment on the letter from Amnesty, but talking more widely about Prince William's three-day visit, a royal source said: \"Prince William didn't blink [when asked to go]. \"He knows this is an important part of his global role for UK PLC.\" Prince William spent his first night in Saudi with his royal counterpart Mohammed bin Salman Al Saud, the Crown Prince of Saudi Arabia; the man credited with having a more open and more modern vision for Saudi, albeit one that some would suggest hasn't been wide-reaching enough in the political arena. But the first full day of engagements for William will be a display of how the country has liberalised and changed its focus, from meeting women's football teams, talking about their energy transition away from a dependence on oil and taking part in an e-gaming competition, another part of how Saudi's economy is diversifying, and trying to draw in a global tourism audience. William is also tasked with trying to maintain the attention on the significance of the trip after statements were released yesterday both on his behalf and from Buckingham Palace about the Epstein files and Andrew Mountbatten-Windsor's association with the convicted paedophile. Andrew denies any wrongdoing in relation to Epstein."
    },
    {
        "title": "Olympian Sturla Holm Laegreid admits to cheating on girlfriend after medal win",
        "description": "Norwegian Olympian Sturla Holm Laegreid confessed in a live television interview to cheating on his girlfriend, moments after winning a bronze medal. ",
        "url": "https://news.sky.com/story/olympian-sturla-holm-laegreid-admits-to-cheating-on-girlfriend-after-medal-win-13505853",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-laegreid-olympics_7161374.jpg?20260210193211",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-10 17:59:00",
        "Headline": "The Norwegian told fans he already \"had a gold medal\" up until last week - but squandered it by being unfaithful.",
        "Content": "Norwegian Olympian Sturla Holm Laegreid confessed in a live television interview to cheating on his girlfriend, moments after winning a bronze medal.  Laegreid finished in third place in the biathlon, which combines cross-country skiing and rifle shooting, and then broke down in tears at the Winter Olympics on Tuesday. The Norwegian told fans he already \"had a gold medal\" up until last week - but squandered it by being unfaithful. Speaking to Norwegian state broadcaster NRK in his native language, just moments after finishing his biathlon, he said: \"There's someone I wanted to share it with who might not be watching today. \"Six months ago, I met the ​love of my life - the most beautiful and kindest ​person in the world. \"Three months ago, I made my biggest mistake and cheated on her. I told her about it a week ago. It's ‌been the worst week of my life.\" The 28-year-old then issued a heartfelt plea but stopped short of naming the woman. \"I had a gold medal in my life, and there are probably many who look ​at me with different eyes, but I only have eyes for her,\" he added. \"Sport has taken a slightly different place [in my life] the last few days. I wish I could share it with her.\" Read more from Sky News:Lindsey Vonn reveals extent of injuriesWinter Olympics hit by penis enhancement controversy   Laegreid later said he might not have been in the right state of mind to give the interview after the race, which came in the wake of the death of his teammate, Sivert ‍Guttorm Bakken, in December last year. \"Maybe it was really selfish of me to give that interview,\" he said a few hours later. \"So yeah, I ​don't know. I was, I'm a bit, I don't know... I'm not really here mentally. \"So yeah, we will see what happens.\" Laegreid came third in the men's Olympic 20km individual biathlon race in northern Italy. His fellow Norwegian Johan-Olav Botn took gold while France's Eric Perrot claimed the silver. The race came as US skier Lindsey Vonn confirmed she will need \"multiple surgeries\" following her crash in the women's downhill skiing final on Sunday."
    },
    {
        "title": "Irish man detained for five months in 'concentration camp' by ICE",
        "description": "An Irishman who has been detained by ICE for five months has described the facilities as \"like a modern-day concentration camp\".",
        "url": "https://news.sky.com/story/irish-man-detained-for-five-months-in-concentration-camp-by-ice-13505571",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-seamus-seamus-culleton_7160756.jpg?20260210091604",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-10 10:25:00",
        "Headline": "Seamus Culleton, who has been living in the US for almost 20 years and is married to a US citizen, said \"I don't know how much more I can take\", it's \"torture\".",
        "Content": "An Irishman who has been detained by ICE for five months has described the facilities as \"like a modern-day concentration camp\". Seamus Culleton said he would like Irish premier Micheal Martin to raise his case with US President Donald Trump during his meeting at the White House in March. Mr Culleton, who is originally from Co Kilkenny, has been living in the US for nearly 20 years and is married to a US citizen. He was detained by ICE (US Immigration and Customs Enforcement) agents in September 2025 while driving home after finishing work, describing how several cars appeared around him. He was asked if he had a green card, and he said he did not, but said he was married to a US citizen, had a work permit and was due to receive his green card. However, he was detained and initially put into a holding cell in Massachusetts, before being taken to New York, and then to the detention centre in El Paso in Texas. Mr Culleton claims ICE agents tried to get him to sign deportation papers, which he refused to do. \n                  How Irish police tackled Dublin's drug gangs after fake SWAT team besieged hotel during bitter feud\n                 \n                  Northern Ireland should hold unity referendum by 2030, first minister says\n                 \n                  Teacher in transgender student row sent back to jail in Ireland\n                 He described the detention centre in El Paso as \"horrible\" and \"filthy\", with little sanitation, limited food and where it was \"tough to stay positive\". He said he was in fear of his life from the security firm in charge, who he said were \"capable of anything\", and there was competition for food, and he had \"definitely\" lost weight. The Irishman said there were 72 people in a tent the size of a 16ft by 35ft room with no ceiling, with two rows of bunk beds on either side and a long table down the middle. Illnesses are rife among detainees, he said, with barely any outside time, fresh air or sunlight. Mr Culleton added: \"It's just torture. I don't know how much more I can take. \"I just want to get back to my wife. We're so desperate to start a family.\" Mr Culleton said his mother is heartbroken about his situation, though he can talk with her most days. His wife described the shock of his original detention and the \"awful\" experience of trying to maintain contact with him after his detainment. She said she did not hear from him for almost a week after an initial phone call following his arrest and said she \"did not know if he was deported\" and \"had no idea if he was safe\". She added it was \"almost impossible\" to set up a visit to see her husband. Read more from Sky News:Wedding ceremony during Bad Bunny's half-time show was genuineRansom deadline for US star's missing mother passes She had booked flights from Massachusetts to Texas to attend one of Mr Culleton's court dates, but the hearing was moved on the day before her journey. \"He's a good man. I don't think anyone deserves this, but Seamus definitely doesn't deserve this,\" she said. Earlier, Mr Culleton's sister, Caroline, said his family still does not know why he was detained. She said he has lost an \"awful lot of weight\", has sores, infections and hair loss. In a statement, the Department of Foreign Affairs and Trade said: \"Minister McEntee is aware of this case and of the consular assistance being provided to the citizen involved, and his family, by our Consulate General in Austin, Texas, and our consular unit in Dublin. \"Our embassy in Washington DC is also engaging directly with the Department of Homeland Security at a senior level in relation to this case.\""
    },
    {
        "title": "Plane ends up in ocean after emergency landing and all 55 people on board survive",
        "description": "All 55 people on board a passenger plane were safely evacuated after the aircraft overran the runway and ended up in shallow waters during an emergency landing in Somalia.",
        "url": "https://news.sky.com/story/plane-ends-up-in-ocean-after-emergency-landing-and-all-55-people-on-board-survive-13505888",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-somalia-emergency-landing_7161608.jpg?20260210224052",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-10 19:44:00",
        "Headline": "The Starsky Aviation aircraft had taken off from Mogadishu's international airport and was bound for the northern city of Gaalkacyo when it developed a technical problem about 15 minutes into its flight.",
        "Content": "All 55 people on board a passenger plane were safely evacuated after the aircraft overran the runway and ended up in shallow waters during an emergency landing in Somalia. No one was injured in the incident which happened near the country's main airport on Tuesday. The Starsky Aviation aircraft had taken off from Mogadishu's Aden Abdulle International Airport and was bound for the northern city of Gaalkacyo when it developed a technical problem about 15 minutes into its flight. The pilot then turned back and made an emergency landing but he overshot the tarmac, veered off and finished at the shoreline of a beach in the Indian Ocean. All 50 passengers and five crew members safely left the plane, a Fokker 50. Everyone on board was accounted for by a rescue team, transportation minister Mohamed Farah Nuh said. The aircraft was damaged and the cause of the crash will be investigated. Pictures showed the plane with at least one wing snapped but otherwise intact on the shoreline. Starsky Aviation chief executive Ahmed Nur said \"the aircraft overran on the runway\" before coming to a rest on the shore of the Indian Ocean near the airport. He added: \"No injuries, no deaths.\" Read more from Sky News:Irish man detained for five months in by ICERussia claims Zaporizhzhia gains The Somali Civil Aviation Authority said in a statement that at 1.17pm local time (10.17am UK time) \"an aircraft with registration number 60-YAS, an F50, was involved in a runway overrun at Mogadishu Aden Abdulle International Airport\". \"The aircraft was carrying 55 people on board. All occupants survived the incident and were promptly transported to a nearby hospital for medical evaluation and care. \"No fatalities have been reported.\""
    },
    {
        "title": "Hong Kong leader celebrates Jimmy Lai's sentence - as plan to enhance security law published",
        "description": "The leader of Hong Kong has celebrated the 20-year jail sentence given to British pro-democracy campaigner Jimmy Lai, saying the media tycoon had \"poisoned\" the city.",
        "url": "https://news.sky.com/story/hong-kong-leader-celebrates-jimmy-lais-sentence-as-plan-to-enhance-security-law-published-13505520",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jimmy-lai-court-of-final-appeal_7159679.jpg?20260209002717",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-10 03:11:00",
        "Headline": "Since Jimmy Lai was sentenced, China has released a white paper outlining plans to further enhance a draconian national security law that's been used to clamp down on free speech and dissent in Hong Kong.",
        "Content": "The leader of Hong Kong has celebrated the 20-year jail sentence given to British pro-democracy campaigner Jimmy Lai, saying the media tycoon had \"poisoned\" the city. John Lee was defiant in the face of criticism from Western nations, including the UK, following the 78-year-old's sentencing yesterday. He was found guilty ​of two counts of conspiracy to collude with foreign forces and one ​count of publishing seditious materials last December. Mr Lai denied all the charges and said he was a \"political prisoner\" facing persecution from Beijing. His son, Sebastien, told Sky News it was \"essentially a life sentence… a death sentence\". Sir Keir Starmer had been under pressure to raise Mr Lai's case with China's Xi Jinping when he visited the country last month. While the government is seeking closer economic ties with Beijing, Foreign Secretary Yvette Cooper said Mr Lai's prosecution was \"politically motivated\" and expressed concern for his health. But China remains defiant despite the criticism, which has also come from the likes of the US and the UN. China's London embassy described Ms Cooper's comments as \"erroneous\", and accused the UK of \"interfering in Hong Kong's rule of law\". Since Mr Lai was sentenced, the Beijing regime has released a white paper outlining plans to further enhance a draconian national security law that has been used to clamp down on free speech and dissent in Hong Kong. Read more:What is the China's national security law? The city, which Britain handed over in 1997, was the scene of huge pro-democracy protests in 2019. The white paper described the security law as a \"legal shield\" that had restored order. Mr Lee said Mr Lai's sentencing sent a \"solemn warning against malicious plots\" that endanger national security, and welcomed the white paper's publication. Mr Lai's sentencing came more than five years after he was arrested. The founder of the now defunct Apple Daily newspaper is a long-standing critic of ⁠the Chinese Communist Party. 'The embodiment of what they fear' Speaking after the verdict, Sky's Asia correspondent Helen-Ann Smith said she spoke to Mr Lai's biographer Mark Clifford last month. \"He's really the embodiment of what they fear,\" she cited the author and close friend of the jailed tycoon as saying. \"A principled person, absolutely refusing to back down, smart, articulate, and crucially with a platform.\""
    },
    {
        "title": "Lindsey Vonn has 'no regrets' after suffering leg fracture in Winter Olympics crash",
        "description": "US skier Lindsey Vonn says she has \"no regrets\" despite confirming she needs \"multiple surgeries\" after suffering a leg fracture in a crash at the Winter Olympics.&#160;",
        "url": "https://news.sky.com/story/lindsey-vonn-has-no-regrets-after-suffering-leg-fracture-in-winter-olympics-crash-13505522",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsey-vonn-winter-olympics_7160647.jpg?20260210071715",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-10 03:31:00",
        "Headline": "The US skier - who had already ruptured her ACL just last month - suffered a \"complex tibia fracture\" in a crash during the women's downhill final on Sunday.",
        "Content": "US skier Lindsey Vonn says she has \"no regrets\" despite confirming she needs \"multiple surgeries\" after suffering a leg fracture in a crash at the Winter Olympics.  The 41-year-old was competing in the women's downhill skiing final on Sunday in Cortina, northern Italy, when she crashed on the piste after clipping a slalom gate while midair. The crash, occurring just 13 seconds into the run, resulted in Vonn, who was airlifted to hospital, sustaining a \"complex tibia fracture\" and undergoing initial surgery. She had already ruptured her ACL in a crash at a World Cup race in Switzerland on 30 January but was determined to compete at her fifth and final Games. In an Instagram post on Monday, Vonn said: \"Yesterday my Olympic dream did not finish the way I dreamt it would. \"It wasn't a story book ending or a fairy tale, it was just life. \"Unfortunately, I sustained a complex tibia fracture that is currently stable but will require multiple surgeries to fix properly. \"While yesterday did not end the way I had hoped, and despite the intense physical pain it caused, I have no regrets.\" Despite coming into the Winter Olympics with injury, Vonn was still considered a medal hopeful and completed two impressive training runs earlier in the week. The 2010 downhill champion had returned to elite ski racing last season after nearly six years in retirement, having had a partial knee replacement on her right leg. She said her past injuries \"had nothing to do with my crash whatsoever\". Taking risks 'the beauty of life' In her social media message, Vonn acknowledged the dangers of ski racing but insisted having the chance to compete \"was an incredible feeling that I will never forget\". \"Knowing I stood there having a chance to win was a victory in and of itself,\" she said. \"I also knew that racing was a risk. It always was and always will be an incredibly dangerous sport. \"And similar to ski racing, we take risks in life. \"We dream. We love. We jump. And sometimes we fall. Sometimes our hearts are broken. Sometimes we don't achieve the dreams we know we could have. But that is also the beauty of life; we can try. \"I tried. I dreamt. I jumped.\" Read more:Should Vonn have even been competing?Water cannon and tear gas fired at protesters International Olympic Committee (IOC) sports director Pierre Ducrey said the decision for Vonn to compete was entirely her own. He said: \"She was able to train and make the choice with the excellent team that she has to take part.\" Mr Ducrey said it wasn't for the IOC to say whether she should have participated, adding: \"This decision was really hers and her team's to take.\""
    },
    {
        "title": "Ukraine rallies Europe to block FIFA's push to reinstate Russia and end ban from international football",
        "description": "Ukraine is gathering support from European governments to oppose FIFA's moves to end Russia's ban from international football.",
        "url": "https://news.sky.com/story/ukraine-rallies-europe-to-block-fifas-push-to-reinstate-russia-and-end-ban-from-international-football-13505732",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-matvii-bidnyi-ukraine_7161119.jpg?20260210145051",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2026-02-10 14:21:00",
        "Headline": "While the ban is a symbol of Russia's isolation and pariah status, FIFA believes it \"has not achieved anything\", although Ukraine argues it represents an important part of \"international efforts to stop the aggressor\".",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Ukraine is gathering support from European governments to oppose FIFA's moves to end Russia's ban from international football. Ukrainian sports minister Matvii Bidnyi told Sky News that allowing Russia back into World Cups would be legitimising Vladimir Putin's aggression. European football leaders are gathering for their annual congress in Brussels today, four years after booting out Russian teams at the start of the all-out war on Ukraine. FIFA president Gianni Infantino is set to attend the UEFA Congress, a week after telling Sky News: \"This ban has not achieved anything, it has just created more frustration and hatred.\" Responding to the football boss, Mr Bidnyi said: \"It's a very strange position... nothing changed. This condemnation of all of the world, of the sports community, is very important for international pressure on the aggressor.\" While stopping Russia playing at World Cups is a symbol of the country's isolation and pariah status, it has not ended the conflict and killing. \"If we start to make our policy softer... what sign do you make for the world?\" Mr Bidnyi said. \n                  After the crackdown: what is happening on the streets of Iran? \n                 \n                  FIFA boss Gianni Infantino apologises for fans joke - and insists Trump deserved peace prize\n                 \n                  World Cup winning team to get $50m as FIFA boosts total prize fund by 50% \n                 \"The ban, it's an important part of international efforts to stop the aggressor... it's a crime and you want to justify, you want to legitimise this crime.\" Mr Bidnyi wants a statement opposing football sanctions on Russia being lifted - as was secured last year from 28 European governments, including the UK, calling on the Paralympics to restore their ban. 'Irresponsible and infantile' \"I think we are close to it,\" he told Sky News. \"And I would think it would (have) a big resonance.\" The Ukrainian government would welcome a first visit to the country by Mr Infantino since the war started. \"His actions look irresponsible and infantile,\" Mr Bidnyi said, citing children being killed playing football or seriously injured after Russian strikes. Read more from Sky News:FIFA: Trump deserves peace prizeParalympics in dispute with UK The ban was imposed because European rivals were refusing to play Russian teams or host their matches on neutral integrity - as FIFA and UEFA came under pressure from politicians to apply sporting sanctions. Within FIFA there is discussion about why they should have to cut ties with Russia when governments advocating for the ban on teams still allow trading with the country with non-sanctioned products. \"It's wrong, but we can see now it's become less and less,\" Mr Bidnyi said. Culture Secretary Lisa Nandy last week criticised the International Olympic Committee and FIFA for moving towards restoring Russian teams, arguing \"if anything the situation in Ukraine has got worse\" since the original bans were imposed."
    },
    {
        "title": "Armed gang posing as police blow up armoured vehicle in robbery attempt in Italy",
        "description": "An armed gang in southern Italy posed as police and blew up an armoured van in a bid to carry out a raid, in what local media referred to as a scene out of the \"wild west\".",
        "url": "https://news.sky.com/story/armed-gang-posing-as-police-blow-up-armoured-vehicle-in-robbery-attempt-in-italy-13505595",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/9afa8e2d9aefac16cfa3ac9e29b1b73d1d1157dfec548ded7501edb0884ab480_7161099.jpg?20260210143930",
        "type": "World",
        "Author": "Claire Gilbody-Dickerson",
        "Date Published": "2026-02-10 09:34:00",
        "Headline": "Footage from the incident on a motorway in the region of Puglia shows the group wearing balaclavas and armed with Kalashnikov rifles during the attack on Monday morning.",
        "Content": "\n          News reporter\n              @ClaireGilbodyD\n An armed gang in southern Italy posed as police and blew up an armoured van in a bid to carry out a raid, in what local media referred to as a scene out of the \"wild west\". Footage from the incident on a motorway in Italy's region of Puglia shows the group wearing balaclavas and armed with Kalashnikov rifles during the attack on Monday morning. The heist took place shortly after dawn on the 613 motorway connecting Lecce and Brindisi, when the armed group arrived on the scene in an Alfa Romeo Stelvio, a Jeep Compass and Kia Sportage - all of which had fake emergency lights on, local media reports. They then set a vehicle on fire, forcing the armoured van to stop. The gang then used an explosive on the van, resulting in a huge plume of smoke. According to some reports, the number of armoured vehicles blocked was actually two and they were carrying millions of euros - but this hasn't been confirmed. Video taken by witnesses shows at least six masked people, some of whom appeared to be in white suits. \n                  All you need to know about the Winter Olympics 2026\n                 \n                  Hundreds protest against ICE role in Winter Olympics in Milan\n                 \n                  'The entire hill is collapsing': Landslide in Sicily causes homes to fall off cliff edge, 1,500 evacuated \n                 As they later sought to escape, the armed group opened fire against the Carabinieri - Italy's national law enforcement agency - which had intervened. The heist, however, appears to have been unsuccessful. Two people have reportedly been arrested."
    },
    {
        "title": "William didn't react to Epstein question - but his actions on Saudi trip have been telling",
        "description": "There was no reaction but we know Prince William and his team at least heard the shout, even if they didn't hear the full question.",
        "url": "https://news.sky.com/story/william-didnt-react-to-epstein-question-but-his-actions-on-saudi-trip-have-been-telling-13505881",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-prince-of-wales-prince-william_7160962.jpg?20260210120056",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-02-10 19:07:00",
        "Headline": "As William walked off a football pitch on the outskirts of Riyadh, where he is on an official visit, a reporter asked the prince: \"Sir, to what extent do you think the Royal Family has done enough around the Andrew and Epstein issue?\"",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n There was no reaction but we know Prince William and his team at least heard the shout, even if they didn't hear the full question. As William walked off a football pitch on the outskirts of Riyadh, where he is on an official visit, a reporter asked the prince: \"Sir, to what extent do you think the Royal Family has done enough around the Andrew and Epstein issue?\" The palace is trying to keep this trip to Saudi on track, with no cancellations or obvious adjustments to engagements. They want to remind us that William is used to navigating difficult times and takes his role seriously. If nothing else, they hope the heir and his family show the monarchy has got a positive future, at a time when they really need it, as they continue to compete against the seemingly uncontrollable noise around Andrew and Epstein. It's clear from the statements released on Monday that something has shifted over the past few days. William and Kate publicly addressed the Epstein scandal for the first time, with Kensington Palace saying they were \"deeply concerned\" at the \"continued revelations\" and that their thoughts \"remain focused on the victims\". Meanwhile, Buckingham Palace said the King had \"profound concern\" over claims about Andrew and it would support police if contacted. Silence was not an option, with the questions about what information Andrew was sharing during his time as trade envoy going right to the heart of the Royal Family's public purpose and what they're meant to be about. Andrew has denied any wrongdoing in relation to Epstein. Neither William nor the King have spoken about it on camera - not really a surprise - and William wasn't going to do it here in Saudi. But it doesn't help quell the voices of those who say they want to hear more from them - visible proof, you might say, of the \"concerns\" they have written about. William will also no doubt have seen the calls for the King to encourage Andrew to voluntarily speak to the police and authorities in America. We know that even on official trips, he monitors the news back home. Read more:Timing of palace's Andrew statement is extraordinaryPoll: Most people think King should encourage Andrew to testify But here in Saudi there was a new global audience for him to think about - one that wasn't going to ask him about Epstein. William and Kate's social media accounts feature a stream of photos of him meeting and greeting, and especially focusing on the time he spent with children and women. For the palace, it was a day meant to be about important future relationships as headlines in the UK continue to dwell on the past."
    },
    {
        "title": "Lindsey Vonn has 'no regrets' after suffering leg fracture in Winter Olympics crash",
        "description": "US skier Lindsey Vonn says she has \"no regrets\" despite confirming she needs \"multiple surgeries\" after suffering a leg fracture in a crash at the Winter Olympics.&#160;",
        "url": "https://news.sky.com/story/lindsey-vonn-has-no-regrets-after-suffering-leg-fracture-in-winter-olympics-crash-13505522",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsey-vonn-winter-olympics_7160647.jpg?20260210071715",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-10 03:31:00",
        "Headline": "The US skier - who had already ruptured her ACL just last month - suffered a \"complex tibia fracture\" in a crash during the women's downhill final on Sunday.",
        "Content": "US skier Lindsey Vonn says she has \"no regrets\" despite confirming she needs \"multiple surgeries\" after suffering a leg fracture in a crash at the Winter Olympics.  The 41-year-old was competing in the women's downhill skiing final on Sunday in Cortina, northern Italy, when she crashed on the piste after clipping a slalom gate while midair. The crash, occurring just 13 seconds into the run, resulted in Vonn, who was airlifted to hospital, sustaining a \"complex tibia fracture\" and undergoing initial surgery. She had already ruptured her ACL in a crash at a World Cup race in Switzerland on 30 January but was determined to compete at her fifth and final Games. In an Instagram post on Monday, Vonn said: \"Yesterday my Olympic dream did not finish the way I dreamt it would. \"It wasn't a story book ending or a fairy tale, it was just life. \"Unfortunately, I sustained a complex tibia fracture that is currently stable but will require multiple surgeries to fix properly. \"While yesterday did not end the way I had hoped, and despite the intense physical pain it caused, I have no regrets.\" Despite coming into the Winter Olympics with injury, Vonn was still considered a medal hopeful and completed two impressive training runs earlier in the week. The 2010 downhill champion had returned to elite ski racing last season after nearly six years in retirement, having had a partial knee replacement on her right leg. She said her past injuries \"had nothing to do with my crash whatsoever\". Taking risks 'the beauty of life' In her social media message, Vonn acknowledged the dangers of ski racing but insisted having the chance to compete \"was an incredible feeling that I will never forget\". \"Knowing I stood there having a chance to win was a victory in and of itself,\" she said. \"I also knew that racing was a risk. It always was and always will be an incredibly dangerous sport. \"And similar to ski racing, we take risks in life. \"We dream. We love. We jump. And sometimes we fall. Sometimes our hearts are broken. Sometimes we don't achieve the dreams we know we could have. But that is also the beauty of life; we can try. \"I tried. I dreamt. I jumped.\" Read more:Should Vonn have even been competing?Water cannon and tear gas fired at protesters International Olympic Committee (IOC) sports director Pierre Ducrey said the decision for Vonn to compete was entirely her own. He said: \"She was able to train and make the choice with the excellent team that she has to take part.\" Mr Ducrey said it wasn't for the IOC to say whether she should have participated, adding: \"This decision was really hers and her team's to take.\""
    },
    {
        "title": "Why is Trump threatening Canada over a bridge?",
        "description": "Donald Trump has threatened to block the long-awaited opening of a new $4.7bn (&#163;3.4bn) bridge connecting the US and Canada.",
        "url": "https://news.sky.com/story/why-is-trump-threatening-canada-over-a-bridge-13505686",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-gordie-howe-international-bridge_7160987.jpg?20260210123740",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-10 12:25:00",
        "Headline": "The US president launched into a rant about a new bridge connecting Michigan to Ontario, saying he would not allow it to open unless his criteria were met.",
        "Content": "Donald Trump has threatened to block the long-awaited opening of a new $4.7bn (£3.4bn) bridge connecting the US and Canada. The Gordie Howe International Bridge, which is supposed to be ready to open in spring, connects Detroit in the US state of Michigan to Windsor in the Canadian province of Ontario. The US Department of Homeland Security has estimated it will save $12.7m (£9.3m) annually for travellers by reducing congestion and travel time, easing traffic flows on alternative routes such as the Detroit-Windsor Tunnel and Ambassador Bridge. It will also be the only route with the option of walking or cycling between the two countries, as well as offering six lanes for vehicles - compared to the Ambassador Bridge's four - and fewer traffic light stops. So why is the US president threatening to delay its opening? Trump's rant over bridge opening Mr Trump launched into a rant over the bridge on his Truth Social platform on Monday, in a post claiming Canada had treated the US \"unfairly for decades\". Some of his frustrations were about the bridge itself, while others were over broader tensions between the countries, largely ramped up by his tariffs. The outburst came despite the fact Mr Trump endorsed the bridge during his first term in 2017 alongside then Canadian prime minister Justin Trudeau. Wants to own 'at least one half' of the bridge In his post, Mr Trump said the US would be getting \"absolutely NOTHING\" from the bridge. He added: \"I will not allow this bridge to open until the United States is fully compensated for everything we have given them, and also, importantly, Canada treats the United States with the Fairness and Respect that we deserve. \"We will start negotiations, IMMEDIATELY. With all that we have given them, we should own, perhaps, at least one half of this asset.\" Mr Trump has not made clear how he would seek to block the bridge from opening. Sky News has contacted the White House for comment. The bridge was financed predominantly by Canada after Michigan's former governor Rick Snyder - a Republican - accepted an offer from the Canadian government in 2012 to cover most of the costs. He took the unusual step of using executive authority to bypass the legislature. The Canadian government is set to recoup its investment in the bridge through toll revenue, and will receive ongoing capital and availability payments to operate, maintain and rehabilitate the project for the next 36 years. Mr Trump also took issue with the fact the bridge, named after a Canadian hockey star who played for the Detroit Red Wings for 25 seasons, was not built using US steel. It was built by union construction workers from both countries, according to local officials. Why else would Trump want to block it? The US president's bridge threats come during heightened tensions between him and Canada's Prime Minister Mark Carney, largely over trade. Mr Trump has made a number of threats against Canada in his second term and drastically hiked tariffs on the country, prompting China to swoop in and negotiate a trade deal with the Canadian government. Mr Trump referenced this in his lengthy Truth Social post about the bridge, claiming China would \"eat Canada alive\" and that the US would \"just get the leftovers\". The US president previously threatened to impose a 100% tariff on Canada if it followed through with the deal. He also referenced his longstanding frustrations with Canada's policies on dairy product imports and Ontario's enforcement of a sweeping ban on American alcoholic beverages. The bridge threat also comes shortly before a formal review of the US-Mexico-Canada Agreement, the trade deal that protects Canada from the heaviest impacts of Mr Trump's tariffs. Bridge 'going to open one way or another' Michigan, a swing state which Mr Trump won over in both 2016 and 2024, would feel the brunt of a delay to the bridge's opening, local politicians say. Michigan's Democratic governor Gretchen Whitmer has maintained an unusually good relationship with Mr Trump since his second term began, but her spokesperson Stacey LaRouche said the bridge was \"going to open one way or another, and the governor looks forward to attending the ribbon-cutting\". Read more:'End of the monarchy' may be at hand, says US congressmanIrish man detained for months in 'concentration camp' by ICE Senator Elissa Slotkin, a Michigan Democrat, has called the bridge a \"huge boon\" to her state and its economic future, and warned: \"Cancelling this project will have serious repercussions. Higher costs for Michigan businesses, less secure supply chains, and ultimately, fewer jobs. \"So to shoot yourself in the foot and threaten the Gordie Howe Bridge means that this guy [Trump] has completely lost the plot on what's good for us versus just what's spite against the Canadians.\" She added Mr Trump is \"punishing Michiganders for a trade war he started\". \"The only reason Canada is on the verge of a trade deal with China is because President Trump has kicked them in the teeth for a year,\" she said. Rep Shri Thanedar, the Democratic House representative of Detroit, said blocking the bridge would be \"crazy\" and Mr Trump's attacks on Canada weren't good for business or jobs. She added: \"The bridge is going to help Michigan's economy. There's so much commerce between Michigan and Canada. They're one of our biggest partners.\" Sky News has contacted the Ontario premier's office and the Detroit mayor's office for comment."
    },
    {
        "title": "Instagram and YouTube 'engineer addiction' in young people, landmark trial hears",
        "description": "Instagram and YouTube have been accused of \"engineer[ing] addiction in children's brains\", in the opening statements of a landmark social media trial taking place in LA.",
        "url": "https://news.sky.com/story/instagram-and-youtube-engineer-addiction-in-young-people-landmark-trial-hears-13505652",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-social-media-trial_7160916.jpg?20260210112856",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-10 11:22:00",
        "Headline": "Meta's lawyer, Paul Schmidt, said some in the scientific community don't believe social media addiction exists.",
        "Content": "\n          Science and technology reporter\n       Instagram and YouTube have been accused of \"engineer[ing] addiction in children's brains\", in the opening statements of a landmark social media trial taking place in LA. Mark Lanier, representing plaintiffs who accuse social media companies of developing harmful and addictive platforms, described the case as being \"as easy as ABC\", which he said stands for \"addicting the brains of children.\" This is the first of a number of \"bellwether\" lawsuits, ie test cases, with lawyers considering the testimonies of more than 1,500 people when launching the action. Both TikTok and Snapchat settled out of court in the first lawsuit but will be involved in subsequent trials. If the social media companies lose, they'll need to pay compensation but could also be forced to change the way they work. Read more: Social media goes on trial in LA - here's what you need to know Mr Lanier called Meta and Google \"two of the richest corporations in history\" that have \"engineered addiction in children's brains\". \n                  Apple and Amazon defy expectations with latest results\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 \n                  Is OpenAI's browser worth the hype? These experts tried it out\n                 Meta's lawyer, Paul Schmidt, spoke of the disagreement within the scientific community over social media addiction, with some believing it doesn't exist or that addiction is not the most appropriate way to describe heavy social media use. He also spoke about the 20-year-old plaintiff, known as KGM, and her mental health struggles. Her lawyer, Mr Lanier, said she started using YouTube at age 6 and Instagram at age 9. Before she finished primary school, she had posted 284 videos on YouTube. She says she became addicted to social media, which caused her anxiety, depression and body image issues. However, Meta's lawyer, Mr Schmidt, argued her mental health issues were caused by other things going on in her life. \"If you took Instagram away, would she have experienced those same struggles?\" he asked the jury, telling them to consider the question throughout the trial, which is expected to last around eight weeks. Mr Lanier told the jury that Google and Meta \"deliberately designed their products to hook users and keep them coming back, not by accident [but] by design, because addiction is profitable\". He pointed out three features he said were designed to make social media addictive: • \"The endless ride\", or infinite scrolling• The \"chemical high five\", or the like button, which he said \"caters to a minor's craving for social validation\"• The \"fun house mirror\", or body image filters, which he said means a young person looks at the screen and sees a \"perfect version of herself that doesn't exist\" Meta chief executive Mark Zuckerberg is among the tech execs expected to testify, along with Adam Mosseri, head of Instagram. In a blog post, Meta said this kind of legal action against them \"oversimplifies\" the \"complex issue\" of teenage mental health. \"Narrowing the challenges faced by teens to a single factor ignores the scientific research and the many stressors impacting young people today, like academic pressure, school safety, socio-economic challenges, and substance abuse,\" said the post. Read more from Sky News:Face of a 'vampire' revealedThis AI just passed the 'vending machine test' In a statement to Sky News, Google also rebuffed the trial's central allegations. \"Providing young people with a safer, healthier experience has always been core to our work,\" said Google spokesperson Jose Castaneda. \"In collaboration with youth, mental health and parenting experts, we built services and policies to provide young people with age-appropriate experiences, and parents with robust controls. \"The allegations in these complaints are simply not true.\""
    },
    {
        "title": "Congress turns on the King",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>&#160;",
        "url": "https://news.sky.com/story/congress-turns-on-the-king-13505521",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump100-t100_7160612.jpg?20260210034513",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-10 03:17:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈    A congressman tells us the British monarchy has questions to answer over Andrew Mountbatten-Windsor's relationship with Jeffrey Epstein. The King and Queen in America's sights - what does this mean? That's all as Ghislaine Maxwell appears via video link to testify over the Epstein files. Elsewhere - the fallout over the half-time show at the Super Bowl and Trump's racist Truth Social post on Friday. Plus - have we just been introduced to a new frontrunner for the next president of the US? You can watch all episodes on our YouTube channel. \n                  Majority of people think the King should encourage Andrew to testify about Epstein – poll\n                 \n                  Timing of Palace's latest Andrew statement is extraordinary - don't underestimate the significance\n                 \n                  King has 'profound concern' over Andrew claims - and Buckingham Palace 'ready to support' police if contacted\n                 Email us on trump100@sky.uk with your comments and questions. Andrew Mountbatten-Windsor vigorously denies any allegations of wrongdoing in relation to Jeffrey Epstein."
    },
    {
        "title": "British woman, 23, shot dead by dad after arguing about Donald Trump, inquest hears",
        "description": "A 23-year-old British woman who was shot dead by her father had argued with him about Donald Trump earlier that day, an inquest has heard.",
        "url": "https://news.sky.com/story/british-woman-23-shot-dead-by-dad-after-arguing-about-donald-trump-inquest-hears-13505747",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-lucy-harrison-texas_6826844.jpg?20250212185149",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-10 14:31:00",
        "Headline": "Lucy Harrison was staying with her father in the US when he fatally shot her, an inquest has heard.",
        "Content": "A 23-year-old British woman who was shot dead by her father had argued with him about Donald Trump earlier that day, an inquest has heard. Lucy Harrison, a fashion buyer from Warrington, Cheshire, was staying with her father, Kris Harrison, and his family at their home in Prosper, Texas, in January last year. Ms Harrison's boyfriend, Sam Littler, who made the trip with her, told Cheshire Coroner's Court she would often become upset with her father when he spoke about his gun ownership. He said that on the morning of 10 January - when the couple were due to fly home - Ms Harrison and her father argued about Donald Trump. \"Kris and Lucy ended up having quite a big argument which led to Lucy running upstairs and being upset,\" Mr Littler said. He said Ms Harrison asked her father how he'd feel if she was sexually assaulted. Her father replied that he had two other daughters who lived with him so it would not upset him that much, the inquest heard. Then, Mr Littler said, about half an hour before they were due to leave for the airport, Mr Harrison took his daughter by the hand and led her into his ground-floor bedroom. He said he heard a loud bang some 15 seconds later, before Mr Harrison started screaming for his wife, Heather. Mr Littler said: \"I remember running into the room and Lucy was lying on the floor near the entrance to the bathroom and Kris was just screaming, just sort of nonsense.\" Read more:Teen sentenced for murder of 12-year-oldHome Alone-inspired drug dealer rigged house with traps Ms Harrison, who worked for fashion brand Boohoo, was described as a \"real force of life\" by her mother, Jane Coates. She said: \"She cared. She was passionate about things. She loved to have debates about things that meant a lot to her.\" The inquest heard a grand jury in the US determined there was insufficient evidence to charge anyone in connection with Ms Harrison's death. It was also told that Mr Harrison had previously been to rehab for alcohol addiction. He did not attend the hearing, but his representative, Ana Samuel, said it was \"more akin to a criminal investigation than a fact-finding inquiry\". In a statement issued by his solicitors, Mr Harrison said: \"I fully accept the consequences of my actions, and there isn't a day I don't feel the weight of that loss - a weight I will carry for the rest of my life, and I know that nothing I say can ease the heartbreak this tragedy has caused. \"I cannot undo what happened, but I can honour Lucy by being the best father I can be to her sisters and by carrying her memory forward in everything we do. \"I am deeply sorry for the pain others feel from this tragedy. Lucy's spirit - her warmth, her humour, her kindness - will live on in all of us who loved her.\" The inquest is expected to conclude on Tuesday."
    },
    {
        "title": "Chappell Roan leaves talent agency led by Casey Wasserman after emails shown in Epstein files",
        "description": "US singer Chappell Roan has announced she is leaving her talent agency, after emails between its founder and Ghislaine Maxwell were featured in the Epstein files.",
        "url": "https://news.sky.com/story/chappell-roan-leaves-talent-agency-led-by-casey-wasserman-after-emails-shown-in-epstein-files-13505614",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-chappell-roan-grammys_7160817.jpg?20260210095641",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-10 10:30:00",
        "Headline": "The star said the decision \"reflects my belief that meaningful change in our industry requires accountability and leadership that earns trust\".",
        "Content": "US singer Chappell Roan has announced she is leaving her talent agency, after emails between its founder and Ghislaine Maxwell were featured in the Epstein files. The Grammy-winning star shared a statement on social media announcing her departure from Wasserman, led by Casey Wasserman, saying she holds her teams \"to the highest standards\" and has \"a duty to protect them\" as well. \"No artist, agent or employee should ever be expected to defend or overlook actions that conflict so deeply with our own moral values,\" she added. Roan, 27, said she refused to \"passively stand by\" and that artists \"deserve representation that aligns with their values and supports their safety and dignity\". The decision to leave Wasserman \"reflects my belief that meaningful change in our industry requires accountability and leadership that earns trust\", she concluded. Roan did not mention the Epstein files in her statement. Documents recently released by the US justice department included flirtatious email exchanges between Wasserman, who was married at the time, and Maxwell, from 2003. Wasserman, who is in charge of organising the 2028 Olympic Games in Los Angeles, has since apologised for communicating with Maxwell. \"I deeply regret my correspondence with Ghislaine Maxwell,\" he said, adding it occurred \"long before her horrific crimes came to light\". Read more:Here's what we've found in the Epstein filesSurvivors condemn US govt's handling of files Wasserman said he \"never had a personal or business relationship\" with Jeffrey Epstein but that he did take part in a \"humanitarian trip\" on his plane. He added: \"I am terribly sorry for having any association with either of them.\" Wasserman's name appears in the official Epstein documents but no wrongdoing is alleged. Sky News has contacted the Wasserman agency for comment on Roan's departure. Maxwell, 64, is serving a 20-year jail term for her role in helping Epstein sexually abuse teenage girls. Yesterday, she refused to answer questions on the convicted sex offender before the US House Oversight Committee, citing her 5th amendment right to silence under the US constitution. Her lawyer told reporters Maxwell was \"prepared to speak fully and honestly\" in return for leniency on her sentence from Donald Trump. Epstein, who was convicted of sexual offences in 2008, was found dead in his prison cell in New York in August 2019, as he was awaiting trial after being charged with sex trafficking."
    },
    {
        "title": "Irish man detained for five months in 'concentration camp' by ICE",
        "description": "An Irishman who has been detained by ICE for five months has described the facilities as \"like a modern-day concentration camp\".",
        "url": "https://news.sky.com/story/irish-man-detained-for-five-months-in-concentration-camp-by-ice-13505571",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-seamus-seamus-culleton_7160756.jpg?20260210091604",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-10 10:25:00",
        "Headline": "Seamus Culleton, who has been living in the US for almost 20 years and is married to a US citizen, said \"I don't know how much more I can take\", it's \"torture\".",
        "Content": "An Irishman who has been detained by ICE for five months has described the facilities as \"like a modern-day concentration camp\". Seamus Culleton said he would like Irish premier Micheal Martin to raise his case with US President Donald Trump during his meeting at the White House in March. Mr Culleton, who is originally from Co Kilkenny, has been living in the US for nearly 20 years and is married to a US citizen. He was detained by ICE (US Immigration and Customs Enforcement) agents in September 2025 while driving home after finishing work, describing how several cars appeared around him. He was asked if he had a green card, and he said he did not, but said he was married to a US citizen, had a work permit and was due to receive his green card. However, he was detained and initially put into a holding cell in Massachusetts, before being taken to New York, and then to the detention centre in El Paso in Texas. Mr Culleton claims ICE agents tried to get him to sign deportation papers, which he refused to do. \n                  How Irish police tackled Dublin's drug gangs after fake SWAT team besieged hotel during bitter feud\n                 \n                  Northern Ireland should hold unity referendum by 2030, first minister says\n                 \n                  Teacher in transgender student row sent back to jail in Ireland\n                 He described the detention centre in El Paso as \"horrible\" and \"filthy\", with little sanitation, limited food and where it was \"tough to stay positive\". He said he was in fear of his life from the security firm in charge, who he said were \"capable of anything\", and there was competition for food, and he had \"definitely\" lost weight. The Irishman said there were 72 people in a tent the size of a 16ft by 35ft room with no ceiling, with two rows of bunk beds on either side and a long table down the middle. Illnesses are rife among detainees, he said, with barely any outside time, fresh air or sunlight. Mr Culleton added: \"It's just torture. I don't know how much more I can take. \"I just want to get back to my wife. We're so desperate to start a family.\" Mr Culleton said his mother is heartbroken about his situation, though he can talk with her most days. His wife described the shock of his original detention and the \"awful\" experience of trying to maintain contact with him after his detainment. She said she did not hear from him for almost a week after an initial phone call following his arrest and said she \"did not know if he was deported\" and \"had no idea if he was safe\". She added it was \"almost impossible\" to set up a visit to see her husband. Read more from Sky News:Wedding ceremony during Bad Bunny's half-time show was genuineRansom deadline for US star's missing mother passes She had booked flights from Massachusetts to Texas to attend one of Mr Culleton's court dates, but the hearing was moved on the day before her journey. \"He's a good man. I don't think anyone deserves this, but Seamus definitely doesn't deserve this,\" she said. Earlier, Mr Culleton's sister, Caroline, said his family still does not know why he was detained. She said he has lost an \"awful lot of weight\", has sores, infections and hair loss. In a statement, the Department of Foreign Affairs and Trade said: \"Minister McEntee is aware of this case and of the consular assistance being provided to the citizen involved, and his family, by our Consulate General in Austin, Texas, and our consular unit in Dublin. \"Our embassy in Washington DC is also engaging directly with the Department of Homeland Security at a senior level in relation to this case.\""
    },
    {
        "title": "BP annual profits slide 16% on weaker oil prices",
        "description": "BP has reported a 16% drop in annual profits following the slump in wholesale oil prices towards the end of 2025.",
        "url": "https://news.sky.com/story/bp-annual-profits-slide-16-on-weaker-oil-prices-13505532",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-bp-petrol-company_6801167.jpg?20250116113343",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-02-10 06:20:00",
        "Headline": "Shares open down as investors digest a tougher end to the last financial year and face up to competing forces over the company's direction, despite BP's clear shift back towards oil and gas.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n BP has reported a 16% drop in annual profits following the slump in wholesale oil prices towards the end of 2025. The company, which is awaiting the arrival of a new chief executive in April amid its renewed drive for oil and gas earnings, reported net profits of $7.5bn (£5.5bn). BP said it had made progress against its four main objectives, including growing cash flow and reducing costs, but was going further. It suspended share buybacks to help unlock more cash to trim its debt pile. Money latest: Illegal supplements for sale For more information about how we use your data and your rights, you can visit our Privacy Centre. Interim chief executive Carol Howle told investors: \"With a continued emphasis on capital discipline and returns, we are reducing capital expenditure for 2026 to the lower end of the guidance range, while continuing to drive down our cost base. \"We are also taking decisive action to high-grade our portfolio and strengthen our company, including the execution of our $20bn disposal programme and the decision to suspend the share buyback and fully allocate excess cash to our balance sheet. \n                  Epstein scandal: How the paedophile financier made his millions\n                 \n                  Instagram and YouTube 'engineer addiction' in young people, landmark trial hears\n                 \n                  Liquidators bid to have Vashi jewellery boss made bankrupt\n                 \"These decisions position us to progress long-term value growth through the distinctive opportunity set we are creating in our upstream business, including the Bumerangue discovery in Brazil, where our initial estimates indicate around 8 billion barrels of liquids in place.\" BP shares - up 10% so far this year ahead of Tuesday's market open - were more than 3.5% lower. The company is stepping up a focus on maximising more lucrative oil and gas opportunities at the expense of investment in renewables. BP embraced alternatives under the leadership of Bernard Looney but he left under a cloud in 2023 over the disclosure of relationships with BP colleagues. The company changed course under pressure from major investors as BP's share price long lagged growth seen by all its major rivals, including Shell. The architect of that shift back to fossil fuels, Murray Auchincloss, was shown the door in December - the first major move by BP's new chairman Albert Manifold, amid continued shareholder frustration over the progress of BP's turnaround. Meg O'Neill, the head of Australia's Woodside Energy since 2021, is to succeed him in April as the board seeks to build on recent progress in recapturing investor value. However, at the same time there remain voices among BPs shareholders arguing for a more balanced approach to investment in the energy future on both climate and demand grounds. The environment-focused shareholder lobby group Follow This argued that BP's earnings figures demonstrated it was on the wrong path. Its chief executive, Mark van Baal, said: \"BP is in dire straits because the company has drifted without a consistent strategic direction. \"After a half-hearted energy transition, the company is now doubling down on fossil fuels in a market that will soon start to shrink. \"If BP cannot grow profits and restore its dividend in a growing market, how will the company create shareholder value in a declining one?\""
    },
    {
        "title": "Instagram and YouTube 'engineer addiction' in young people, landmark trial hears",
        "description": "Instagram and YouTube have been accused of \"engineer[ing] addiction in children's brains\", in the opening statements of a landmark social media trial taking place in LA.",
        "url": "https://news.sky.com/story/instagram-and-youtube-engineer-addiction-in-young-people-landmark-trial-hears-13505652",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-social-media-trial_7160916.jpg?20260210112856",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-10 11:22:00",
        "Headline": "Meta's lawyer, Paul Schmidt, said some in the scientific community don't believe social media addiction exists.",
        "Content": "\n          Science and technology reporter\n       Instagram and YouTube have been accused of \"engineer[ing] addiction in children's brains\", in the opening statements of a landmark social media trial taking place in LA. Mark Lanier, representing plaintiffs who accuse social media companies of developing harmful and addictive platforms, described the case as being \"as easy as ABC\", which he said stands for \"addicting the brains of children.\" This is the first of a number of \"bellwether\" lawsuits, ie test cases, with lawyers considering the testimonies of more than 1,500 people when launching the action. Both TikTok and Snapchat settled out of court in the first lawsuit but will be involved in subsequent trials. If the social media companies lose, they'll need to pay compensation but could also be forced to change the way they work. Read more: Social media goes on trial in LA - here's what you need to know Mr Lanier called Meta and Google \"two of the richest corporations in history\" that have \"engineered addiction in children's brains\". \n                  Apple and Amazon defy expectations with latest results\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 \n                  Is OpenAI's browser worth the hype? These experts tried it out\n                 Meta's lawyer, Paul Schmidt, spoke of the disagreement within the scientific community over social media addiction, with some believing it doesn't exist or that addiction is not the most appropriate way to describe heavy social media use. He also spoke about the 20-year-old plaintiff, known as KGM, and her mental health struggles. Her lawyer, Mr Lanier, said she started using YouTube at age 6 and Instagram at age 9. Before she finished primary school, she had posted 284 videos on YouTube. She says she became addicted to social media, which caused her anxiety, depression and body image issues. However, Meta's lawyer, Mr Schmidt, argued her mental health issues were caused by other things going on in her life. \"If you took Instagram away, would she have experienced those same struggles?\" he asked the jury, telling them to consider the question throughout the trial, which is expected to last around eight weeks. Mr Lanier told the jury that Google and Meta \"deliberately designed their products to hook users and keep them coming back, not by accident [but] by design, because addiction is profitable\". He pointed out three features he said were designed to make social media addictive: • \"The endless ride\", or infinite scrolling• The \"chemical high five\", or the like button, which he said \"caters to a minor's craving for social validation\"• The \"fun house mirror\", or body image filters, which he said means a young person looks at the screen and sees a \"perfect version of herself that doesn't exist\" Meta chief executive Mark Zuckerberg is among the tech execs expected to testify, along with Adam Mosseri, head of Instagram. In a blog post, Meta said this kind of legal action against them \"oversimplifies\" the \"complex issue\" of teenage mental health. \"Narrowing the challenges faced by teens to a single factor ignores the scientific research and the many stressors impacting young people today, like academic pressure, school safety, socio-economic challenges, and substance abuse,\" said the post. Read more from Sky News:Face of a 'vampire' revealedThis AI just passed the 'vending machine test' In a statement to Sky News, Google also rebuffed the trial's central allegations. \"Providing young people with a safer, healthier experience has always been core to our work,\" said Google spokesperson Jose Castaneda. \"In collaboration with youth, mental health and parenting experts, we built services and policies to provide young people with age-appropriate experiences, and parents with robust controls. \"The allegations in these complaints are simply not true.\""
    },
    {
        "title": "Liquidators bid to have Vashi jewellery boss made bankrupt",
        "description": "The jewellery tycoon, alleged to have orchestrated a &#163;170m scam which defrauded a legion of wealthy investors, will be declared bankrupt if a bid by his former company's liquidators is successful.",
        "url": "https://news.sky.com/story/liquidators-bid-to-have-vashi-jewellery-boss-made-bankrupt-13505691",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-vashi-jewellery_6111571.jpg?20230405143035",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-10 12:34:00",
        "Headline": "Vashi Dominguez, whose diamond retailing business collapsed in 2023, is facing an attempt by the company's liquidators to have him declared bankrupt, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The jewellery tycoon, alleged to have orchestrated a £170m scam which defrauded a legion of wealthy investors, will be declared bankrupt if a bid by his former company's liquidators is successful. Sky News has learnt that insolvency practitioners in charge of probing the demise of Vashi, a luxury diamond jeweller which had shops in some of London's most prestigious addresses, have served a statutory demand on its founder, Vashi Dominguez. The demand, which is seeking the repayment of just over £17,500, is expected to be made public later this week, nearly three years after the company collapsed in mysterious circumstances. Money latest: Anger over David Lloyd 'queue-jump' pass Mr Dominguez, whose whereabouts have been unclear since the business was forced into liquidation, established the bespoke jeweller in 2007, and attracted investment from prominent City names including Lord Spencer, the ICAP founder, and John Caudwell, the Phones 4U billionaire. He told shareholders that the company's stock of diamonds, purportedly worth more than £150m, would act as security for their investments. Its inventory was subsequently valued at just £100,000. \n                  Epstein scandal: How the paedophile financier made his millions\n                 \n                  BP annual profits slide 16% on weaker oil prices\n                 \n                  Instagram and YouTube 'engineer addiction' in young people, landmark trial hears\n                 Teneo, which has been in the process of liquidating the company and attempting to secure recoveries for creditors since April 2023, is understood to have served the statutory demand in the expectation that it will lead to a bankruptcy petition against him. For more information about how we use your data and your rights, you can visit our Privacy Centre. Under the Insolvency Act, a statutory demand acts as a formal warning notice to repay a debt within 21 days, after which a creditor can seek to have the recipient declared bankrupt. Some creditors have been left frustrated by the decisions of the Serious Fraud Office and Metropolitan Police not to investigate both the company's collapse and the alleged actions of its founder. Last month, The Times reported that the Financial Ombudsman Service had rejected further submissions from investors in relation to Vashi, saying that they had not produced \"definitive evidence that a scam had taken place\". Teneo declined to comment, while Mr Dominguez could not be contacted by Sky News."
    },
    {
        "title": "Minimum age for train drivers to be lowered to 18 amid fears of driver shortfall by 2030",
        "description": "Eighteen-year-olds will soon be permitted to drive trains, the government has said, following concerns about the number of drivers approaching retirement.",
        "url": "https://news.sky.com/story/minimum-age-for-train-drivers-to-be-lowered-to-18-amid-fears-of-driver-shortfall-by-2030-13505517",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-transport-government_7160610.jpg?20260210012656",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-10 01:11:00",
        "Headline": "The move comes amid the government's push to increase placement and apprenticeship opportunities for young people in Britain.",
        "Content": "Eighteen-year-olds will soon be permitted to drive trains, the government has said, following concerns about the number of drivers approaching retirement. Legislation to lower the minimum age limit from 20 to 18 will be brought before parliament this week, the Department for Transport (DfT) has announced, with the change due to come into effect from 30 June. The move comes amid fears over a potential upcoming driver shortfall, with a quarter of train drivers expected to reach retirement age by 2030, the DfT said. Fewer than one in 25 drivers are under the age of 30, while only one in nine train drivers are women. The proportion of drivers that have an ethnic minority background is less than 13%. The DfT said the change will \"level the playing field across the transport sector\", with 18-year-olds in Britain already allowed to drive Tube trains and buses. It will bring the UK in line with other countries such as Switzerland, Germany and Australia, the DfT added. \n                  London bus driver sacked after chasing and punching man who stole passenger's necklace\n                 \n                  Green Party calls for free bus travel in England for under-22s\n                 \n                  Learner drivers to be told to wait six months before taking a test\n                 Move will 'secure future' of railways Lord Hendy, the rail minister, called the move \"a significant step forward for young people across Britain\". He said: \"This change will open doors for those wanting to move straight into the workplace, giving a younger generation the chance to build rewarding careers in the railway, whether that's in freight or passenger services. \"It's a move that will help secure the future of Great British Railways and the wider rail industry, and ensure the workforce reflects the energy, talent, and ambition of the next generation.\" Work and Pensions secretary Pat McFadden said the change will help \"open up new routes into skilled, well-paid careers\". Dave Calfe, general secretary of train drivers' union, ASLEF, said the decision will increase the diversity of train drivers and enable the rail industry to \"recruit the large numbers of train drivers required over the next five years\". Read more from Sky News:King has 'profound concern' over Andrew claimsNursery worker found guilty of rape and sexual assault The change comes as the government looks to increase placement and apprenticeship opportunities for young people, with the latest figures showing nearly a million people aged 16-24 are currently unemployed or economically inactive in the UK. As part of the plans, the Department for Education has said 13,000 new placements will become available as construction firms working on school building projects will be required to show that they are providing opportunities for apprentices and T Level students."
    },
    {
        "title": "Starmer's ex-comms chief should lose peerage over links to paedophile, says Labour chair",
        "description": "Sir Keir Starmer's ex-communications chief should be stripped of his peerage over his ties to a paedophile councillor, Labour's chairwoman has said.",
        "url": "https://news.sky.com/story/starmers-ex-comms-chief-should-lose-peerage-over-links-to-paedophile-says-labour-chair-13506017",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-matthew-doyle-house-of-lords_7161664.png?20260210232901",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-10 22:55:00",
        "Headline": "Lord Doyle apologised and was suspended from the Labour Party on Tuesday for his links to Sean Morton, who he campaigned for in 2017 after he had been charged over indecent images of children.",
        "Content": "Sir Keir Starmer's ex-communications chief should be stripped of his peerage over his ties to a paedophile councillor, Labour's chairwoman has said. Anna Turley MP told Sky News \"there's no place [...] in the Lords\" for people like Matthew Doyle, who she suggested hadn't been truthful before being elevated to parliament's upper chamber earlier this year. Lord Doyle apologised and was suspended from Labour on Tuesday for his links to Sean Morton, who he campaigned for in 2017 after he had been charged over indecent images of children. The peer said he had believed Morton's initial assertions of innocence at the time, before he later pled guilty. Downing Street 10 was not aware Lord Doyle had campaigned for Morton at the time of his appointment, it is understood, and Ms Turley said \"what we'd been told was not the truth when that decision was made\". Asked if he should remain a peer, she told Sky News: \"No, I don't think he should. That's my personal view.\" \"There's no place for them in the Lords\" for people who \"have not been clear and transparent\", she added. Politics Hub: Follow the latest Lord Doyle has apologised \"unreservedly\" for supporting Morton, who was a councillor in Moray, Scotland. He first appeared in court in connection with indecent child images in late 2016, and was suspended by Labour. He was running as an independent when Lord Doyle campaigned for him in May 2017. He didn't plead guilty until November that year. Lord Doyle said he had \"extremely limited\" contact with him after his conviction, and described his offences as \"vile\". \"My thoughts are with the victims and all those impacted by these crimes,\" he added. He continued: \"At the point of my campaigning support, Morton repeatedly asserted to all those who knew him his innocence, including initially in court. \"He later changed his plea in court to guilty. \"To have not ceased support ahead of a judicial conclusion was a clear error of judgment for which I apologise unreservedly. Those of us who took him at his word were clearly mistaken.\" Read more from Sky News:Double stabbing at schoolOlympian admits cheating on girlfriend Lord Doyle only took his place in the upper chamber last month. The SNP had opposed his peerage. Tory leader Kemi Badenoch has called on the prime minister to publish \"vetting advice and due diligence\" reports provided before the peer's appointment. A Labour spokesman said Lord Doyle had lost the party whip while an investigation is carried out, and added: \"All complaints are assessed thoroughly in line with our rules and procedures.\""
    },
    {
        "title": "Court battle over definition of 'woman' has cost Scottish government more than £766,000",
        "description": "The Scottish government has spent more than &#163;766,000 of taxpayers' money in its long-running legal battle over the definition of a woman.",
        "url": "https://news.sky.com/story/court-battle-over-definition-of-woman-has-cost-scottish-government-more-than-163766000-13505705",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-for-women-scotland_7011055.jpg?20260210132838",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2026-02-10 13:18:00",
        "Headline": "The Scottish government was ordered to pay a portion of For Women Scotland's legal costs, totalling £540,000.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government has spent more than £766,000 of taxpayers' money in its long-running legal battle over the definition of a woman. For Women Scotland (FWS) won the case last April when the UK's highest court ruled \"woman\" and \"sex\" in the Equality Act 2010 refer to \"a biological woman and biological sex\". The Scottish government was ordered to pay a portion of the campaign group's legal costs, with FWS confirming on Tuesday it had received a \"full and final settlement\" of £392,500. In total, FWS has received £540,000 from the Scottish government. Adding this to its own legal costs, the SNP administration has spent at least £766,498.80 of taxpayers' money on two judicial reviews linked to the case. FWS said the funds received will be used to cover the costs of its current legal challenge against the government's policy on the management of transgender prisoners, and \"any future legal action necessary to ensure the Scottish government complies with the law\". In a statement, the group said: \"We are eternally grateful for the overwhelming public support that enabled us to successfully challenge the Scottish government's unlawful actions and to clarify that 'woman', 'man' and 'sex' have always taken their biological meaning in the Equality Act 2010.\" \n                  Licences to control wild birds have been suspended following golden eagle's disappearance\n                 \n                  Murder investigation launched after man killed in 'targeted' Glasgow attack\n                 \n                  CCTV at murder suspect's home went off on morning of alleged shooting, court hears\n                 Figures revealed by a Freedom of Information (FOI) request last year showed the Scottish government spent £216,182.50 on the judicial review at the Court of Session in Edinburgh, which FWS won in February 2022. This included £68,682.50 for its own counsel and court costs and £147,500 to cover FWS legal fees. The Scottish government then spent at least £550,316.30 on the judicial review at the UK Supreme Court in London. This included £392,500 to FWS and £157,816.30 for its own costs, although the campaign group noted that amount is \"expected to rise slightly\" to reflect the legal work in settling FWS's bill. That means the Scottish government has spent at least £766,498.80 on these two judicial reviews. Final costs are yet to be confirmed and will be published once complete. Read more from Sky News:Man sought after rape on university campusTeen sentenced for murder of 12-year-old Scottish Conservative shadow equalities minister Tess White MSP said the government had \"taken far too long to pay what is owed\". She added: \"They should never have squandered taxpayers' cash in the first place on defending the indefensible. \"Worse still, the Nationalists have not learned their lesson and are wasting even more public cash on a legal fight to allow male-bodied prisoners to be housed in women's jails.\" Ms White urged First Minister John Swinney to \"grow a backbone and stop dancing to the tune of gender extremists\". A Scottish government spokesperson said: \"The Scottish government has made clear it accepts the Supreme Court ruling and is taking forward the detailed work necessary. \"There is an established process whereby parties seek to establish the final costs payable for a legal case. \"This has now concluded and payment has been settled.\""
    },
    {
        "title": "Starmer insists he'll lead Labour into next election as he attempts to move on from leadership crisis",
        "description": "Sir Keir Starmer has said he will lead Labour into the next general election, as he attempts to move on from his biggest leadership crisis yet.",
        "url": "https://news.sky.com/story/starmer-insists-hell-lead-labour-into-next-election-as-he-attempts-to-move-on-from-leadership-crisis-13505915",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starmer-labour_7161546.jpg?20260210221026",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-10 21:10:00",
        "Headline": "The prime minister said he would \"never walk away from the people that I'm charged with fighting for\" as he tried to reboot his flailing premiership.",
        "Content": "Sir Keir Starmer has said he will lead Labour into the next general election, as he attempts to move on from his biggest leadership crisis yet. The prime minister told broadcasters on Tuesday: \"I had a five-year mandate to deliver the change. I intend to get on with what I was elected to do.\" Asked whether he would lead his party into the next election, scheduled for 2029, he said: \"Yes, I will.\" Politics latest: What are the next challenges for Starmer? Despite his strong words, with his cabinet and Labour MPs having rallied round him, Sky's political editor Beth Rigby said the prime minister remains in a \"weak position\". There have been growing doubts since last week about whether Sir Keir would stay in post - and for how long. He faced the biggest challenge to his leadership yet on Monday as Labour's leader in Scotland, Anas Sarwar, called for him to resign following the scandal over his appointment of Peter Mandelson as his US ambassador. In Sir Keir's first remarks since, he joked at an event in Hertfordshire on Tuesday: \"It's been a busy week.\" He then largely repeated the message he gave his own MPs on Monday evening, saying he \"will never walk away from the people that I'm charged with fighting for\". \"And I will never walk away from the country that I love,\" Sir Keir added. Addressing Labour infighting, he said his party needs to focus on improving living standards and public services, as well as battling what he described as Reform UK's politics of \"grievance\". But Conservative leader Kemi Badenoch told Sky News that Labour MPs had given Sir Keir a \"stay of execution, because they are terrified of losing their own jobs\". Labour MPs 'stepped back from the precipice' The PM's comments came after he chaired a cabinet meeting on Tuesday morning, having received its unanimous backing to remain in his post. Energy Secretary Ed Miliband told Sky News that Labour MPs had \"looked over the precipice yesterday and thought, we need to step back. We need to back our leader. We need to back the man who was elected only 18 months ago as prime minister.\" He said that Monday had been a \"very difficult day\" for the government, admitting that it had made \"mistakes\" and needed to change course. Challenged that Downing Street was briefing that Health Secretary Wes Streeting - often seen as a potential leadership challenger - told Mr Sarwar to make his statement, Ed Miliband said: \"MoveOn.org. I mean, let's just move past all this, honestly.\" Meanwhile, Manchester mayor Andy Burnham also gave his backing to Sir Keir, as did Welsh First Minister Eluned Morgan. Mr Burnham - who Sir Keir blocked from standing in the Gorton and Denton by-election - called for \"stability\" and \"greater unity\"."
    },
    {
        "title": "Mandelson would have had 'thorough' vetting process before US ambassador role, says ex-MI6 boss",
        "description": "Lord Mandelson would have been subject to a \"thorough\" and \"intimate\" vetting process before he was appointed UK ambassador to the US, a former head of MI6 has said.",
        "url": "https://news.sky.com/story/mandelson-would-have-had-thorough-vetting-process-before-us-ambassador-role-says-ex-mi6-boss-13505826",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lord-mandelson-ambassador_7161356.jpg?20260210190315",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-10 17:01:00",
        "Headline": "Sir Richard Moore, who left his post last September, said he had not been part of the vetting process for Lord Mandelson, amid more revelations about the peer's relationship with paedophile Jeffrey Epstein.",
        "Content": "Lord Mandelson would have been subject to a \"thorough\" and \"intimate\" vetting process before he was appointed UK ambassador to the US, a former head of MI6 has said. Sir Richard Moore, who left his post last September, told Sky News' lead world news presenter Yalda Hakim he had not been part of the process, amid more revelations about the ex-Labour peer's relationship with paedophile Jeffrey Epstein. Sir Keir Starmer last week apologised to the public and to Epstein's victims for believing what he called \"Mandelson's lies\". The prime minister insisted he was misled over the extent of Lord Mandelson and Epstein's links, saying he had \"no reason\" to believe the peer was allegedly lying when he said he barely knew Epstein before being made ambassador. Sir Keir criticised the vetting process that Lord Mandelson went through. The Epstein files appear to show regular contact between the former Labour grandee and Epstein after the US financier's sex offence conviction in 2008. 👉Listen to The World With Richard Engel And Yalda Hakim on your podcast app👈 Speaking about background checks more broadly, former spy chief Sir Richard said: \"Undoubtedly there would have been some background checks and then there's an interview process, where you rely to a degree. \"You've got the background checks, of course, to set it against, but you rely on people in those interview processes being very honest.\" He added: \"I've been through that many, many times. They can sometimes be uncomfortable conversations because you're being asked about very private elements of your lifestyle or about your financial situation, and you are required to answer those questions truthfully. \"And the system depends on the balance between truthful answers in the interview process and the checks on whether what's been said is truthful.\" Read more: What do the Epstein files say about Mandelson? Sir Richard said he was not aware of any intelligence relating to the peer's appointment as US ambassador, but even if he was, he would not be able to share it. He added: \"I'll say to you, I'm not aware of anything, but I repeat what I said, you have to understand the sensitivities of this, this stuff does not get circulated around the building. So the answer is, I have no idea.\" He also called out what he described as the \"rancid misogyny and appalling systematic abuse of women and girls\" exposed in the Epstein files. Lead world news presenter I've spent much of my career speaking to people trained to measure every word. Sir Richard Moore does that instinctively - not out of evasiveness, but habit. When I asked him about the vetting of Lord Mandelson, he drew a clear line. The prime minister has said Lord Mandelson was vetted; Sir Richard said he wasn't across the details and didn't want to discuss individual cases. It was a reminder of how intelligence leaders see their role: not as political referees, but as custodians of process and boundaries. What Sir Richard did lean into was culture. He spoke thoughtfully about misogyny and the need to listen to victims - a striking shift away from politics towards people. Coming from a former intelligence chief, it felt less like a talking point and more like a reckoning with how power can fail those it is meant to protect. After 38 years in service, Sir Richard admitted he misses the work, but spoke with pride rather than nostalgia. Above all, he highlighted MI6's cooperation with Ukraine. He cited intelligence suggesting around 30,000 Russian soldiers were killed in December alone - a brutal statistic that underlines the scale of the war. Despite sanctions and diplomatic pressure, Sir Richard believes Vladimir Putin remains too comfortable. His argument was analytical, not emotional: pressure works, but only when it is relentless. Hesitation, he suggested, is what allows wars like this to endure. Lord Mandelson was appointed ambassador in December 2024 and was sacked by Sir Keir in September 2025 over the peer's ties to Epstein. It comes as government figures prepare to hand over huge amounts of material to Parliament's security watchdog after they came under pressure to reveal what was known about the peer's friendship with Epstein when he was picked for the Washington job. Meanwhile, the Metropolitan Police has launched an investigation following accusations that Lord Mandelson passed market-sensitive information to Epstein in 2009."
    },
    {
        "title": "Instagram and YouTube 'engineer addiction' in young people, landmark trial hears",
        "description": "Instagram and YouTube have been accused of \"engineer[ing] addiction in children's brains\", in the opening statements of a landmark social media trial taking place in LA.",
        "url": "https://news.sky.com/story/instagram-and-youtube-engineer-addiction-in-young-people-landmark-trial-hears-13505652",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-social-media-trial_7160916.jpg?20260210112856",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-02-10 11:22:00",
        "Headline": "Meta's lawyer, Paul Schmidt, said some in the scientific community don't believe social media addiction exists.",
        "Content": "\n          Science and technology reporter\n       Instagram and YouTube have been accused of \"engineer[ing] addiction in children's brains\", in the opening statements of a landmark social media trial taking place in LA. Mark Lanier, representing plaintiffs who accuse social media companies of developing harmful and addictive platforms, described the case as being \"as easy as ABC\", which he said stands for \"addicting the brains of children.\" This is the first of a number of \"bellwether\" lawsuits, ie test cases, with lawyers considering the testimonies of more than 1,500 people when launching the action. Both TikTok and Snapchat settled out of court in the first lawsuit but will be involved in subsequent trials. If the social media companies lose, they'll need to pay compensation but could also be forced to change the way they work. Read more: Social media goes on trial in LA - here's what you need to know Mr Lanier called Meta and Google \"two of the richest corporations in history\" that have \"engineered addiction in children's brains\". \n                  Apple and Amazon defy expectations with latest results\n                 \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 \n                  Is OpenAI's browser worth the hype? These experts tried it out\n                 Meta's lawyer, Paul Schmidt, spoke of the disagreement within the scientific community over social media addiction, with some believing it doesn't exist or that addiction is not the most appropriate way to describe heavy social media use. He also spoke about the 20-year-old plaintiff, known as KGM, and her mental health struggles. Her lawyer, Mr Lanier, said she started using YouTube at age 6 and Instagram at age 9. Before she finished primary school, she had posted 284 videos on YouTube. She says she became addicted to social media, which caused her anxiety, depression and body image issues. However, Meta's lawyer, Mr Schmidt, argued her mental health issues were caused by other things going on in her life. \"If you took Instagram away, would she have experienced those same struggles?\" he asked the jury, telling them to consider the question throughout the trial, which is expected to last around eight weeks. Mr Lanier told the jury that Google and Meta \"deliberately designed their products to hook users and keep them coming back, not by accident [but] by design, because addiction is profitable\". He pointed out three features he said were designed to make social media addictive: • \"The endless ride\", or infinite scrolling• The \"chemical high five\", or the like button, which he said \"caters to a minor's craving for social validation\"• The \"fun house mirror\", or body image filters, which he said means a young person looks at the screen and sees a \"perfect version of herself that doesn't exist\" Meta chief executive Mark Zuckerberg is among the tech execs expected to testify, along with Adam Mosseri, head of Instagram. In a blog post, Meta said this kind of legal action against them \"oversimplifies\" the \"complex issue\" of teenage mental health. \"Narrowing the challenges faced by teens to a single factor ignores the scientific research and the many stressors impacting young people today, like academic pressure, school safety, socio-economic challenges, and substance abuse,\" said the post. Read more from Sky News:Face of a 'vampire' revealedThis AI just passed the 'vending machine test' In a statement to Sky News, Google also rebuffed the trial's central allegations. \"Providing young people with a safer, healthier experience has always been core to our work,\" said Google spokesperson Jose Castaneda. \"In collaboration with youth, mental health and parenting experts, we built services and policies to provide young people with age-appropriate experiences, and parents with robust controls. \"The allegations in these complaints are simply not true.\""
    },
    {
        "title": "Drinking tea and coffee may help preserve brain function and reduce risk of dementia, study suggests",
        "description": "Drinking tea or coffee may help preserve brain function and reduce dementia risk, a large US study has suggested.",
        "url": "https://news.sky.com/story/drinking-tea-and-coffee-may-help-preserve-brain-function-and-reduce-risk-of-dementia-study-suggests-13505607",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-coffee-tea-drink_6988567.jpg?20250812064800",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-10 09:45:00",
        "Headline": "The strongest results were found among people whose daily intake was about two to three cups of caffeinated coffee or about one to two cups of tea.",
        "Content": "Drinking tea or coffee may help preserve brain function and reduce dementia risk, a large US study has suggested. Researchers said those who had the highest daily intake of caffeinated coffee had an 18% lower risk of developing dementia compared to those with the lowest such intake. People who drank the most tea appeared to have a 16% reduced risk. The study, published in the Journal of the American Medical Association (JAMA), ​also found that those who consumed the most tea and coffee also showed a slower rate of cognitive decline compared to those who drank the least. But decaffeinated coffee was not associated with lower dementia risk or better cognitive performance. Experts from Harvard University examined data on 131,000 health workers in the US, who were tracked for an average of 43 years. \"We observed the most favourable associations were at moderate intake levels - the strongest associations were seen at about two to three cups per day of caffeinated coffee and about one to two cups per day of tea,\" study leader Dr Daniel Wang of Harvard Medical School said ​in a statement. \n                  Instagram and YouTube 'engineer addiction' in young people, landmark trial hears\n                 \n                  Instagram, TikTok and Facebook posts by users promoting weight-loss jabs banned as 'ads' for the first time\n                 \n                  Claude Opus 4.6: This AI just passed the 'vending machine test' - and we may want to be worried about how it did\n                 But the study does not prove caffeine ‌helps protect the brain. Researchers also concluded the effect of caffeine, if any, was small, and there are ‌other better ways to protect cognitive function as people age. Lifestyle factors linked with lower risks of dementia include physical exercise, a healthy diet and adequate sleep, according to previous research. Study has 'important limitations' Commenting on the study, Dr Susan Kohlhaas from Alzheimer's Research UK, said the research \"doesn't prove that coffee or tea protect the brain\". Professor Tara Spires-Jones, at the UK Dementia Research Institute, agreed there were \"important limitations\", adding that \"other factors related to coffee and tea-drinking habits could be responsible\". Further research is needed to validate the factors and mechanisms responsible ‍for the findings, the researchers said. They noted that bioactive ingredients in coffee and tea such as caffeine and polyphenols have emerged as possible factors that reduce nerve cell inflammation and damage while protecting against cognitive decline. Read more from Sky News:Matcha and iron deficiency linkAI's 'vending machine test'Parents clueless about web use Other experts offered a mixed, but broadly cautious, response. Dr Mohammad Talaei, from Queen Mary University of London, said there was \"a robust association\" but warned that \"reverse causation is a concern\" and that dietary substitutions may complicate findings. Reverse causation could apply in this case by creating an illusion that caffeine lowers dementia risk, when it is also possible that people with early cognitive decline associated with dementia may change their tea or coffee drinking habits, potentially reducing their caffeine intake. Professor Jules Griffin, from the University of Aberdeen, described \"compelling evidence\" of lower risk but pointed out \"the reduction in risk is quite a small decrease\", while Professor Naveed Sattar at the University of Glasgow said he would interpret the findings with \"considerable caution\", pointing out they were \"suggestive\" only. Meanwhile, Dr Simon White at the University of Cambridge stressed the study was not sufficient to recommend changing people's behaviours."
    },
    {
        "title": "Daily Mail editor Paul Dacre clashes with lawyer as he describes 'rage' over allegations",
        "description": "Former Daily Mail editor Paul Dacre has clashed in court with a lawyer, calling some of the allegations in a case against his newspaper group by a number of celebrities and Prince Harry \"preposterous\".",
        "url": "https://news.sky.com/story/daily-mail-editor-paul-dacre-clashes-with-lawyer-as-he-describes-rage-over-allegations-13505860",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-paul-dacre-courts-associated-newspapers_7161084.jpg?20260210140944",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2026-02-10 18:18:00",
        "Headline": "One of Britain's most powerful press figures, Paul Dacre began his evidence, describing his \"rage\" at the allegations levelled against Associated Newspapers Limited by figures including Prince Harry.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Former Daily Mail editor Paul Dacre has clashed in court with a lawyer, calling some of the allegations in a case against his newspaper group by a number of celebrities and Prince Harry \"preposterous\". The 77-year-old called for for \"a sense of proportion\" and echoed his earlier witness statement, which said some of the claims \"have astonished, appalled and - in the small hours of the night - reduced me to rage.\" Mr Dacre, who was editor of the Daily Mail between 1992 and 2018, was the first witness giving evidence in support of Associated Newspapers Limited's defence, entering the witness stand on Tuesday afternoon, in the fourth week of the trial. The group litigation is being brought by seven high-profile individuals, including The Duke of Sussex, Sir Elton John and Liz Hurley, who claim Associated Newspapers Limited (ANL) hired private detectives to commit a series of unlawful acts between 1993 and 2011. The other claimants are David Furnish, Sadie Frost, anti-racism campaigner Baroness Doreen Lawrence, and Sir Simon Hughes. Allegations range from tapping their phones and bugging their homes to paying police officials for inside information and getting medical records by deception. ANL denies the allegations and says none of the information for the stories complained of was unlawfully obtained. \n                  Liz Hurley hits back at 'leak' suggestions and claims phone was bugged, during intense day at High Court\n                 \n                  Prince Harry v Daily Mail: A huge day, but a surprisingly short time on the stand in his case against Associated Newspapers\n                 \n                  Prince Harry becomes emotional after day of dramatic evidence against Mail publisher\n                 Ex Mail boss: 'My heart bleeds for Doreen Lawrence' Mr Dacre, who is now the editor-in-chief of DMG Media, the holding company of ANL, previously told the Leveson Inquiry in 2012 there was \"no phone hacking on the Daily Mail\". When asked in court about documents showing the Daily Mail and The Mail On Sunday spent more than £3m on private investigators during the relevant period, Mr Dacre said while he had a \"vague memory\" of the discovery of such invoices, he was unable to comment on the sum without \"more specifics\". Early in his evidence, he said his \"heart bleeds\" for Baroness Doreen Lawrence, the mother of 1993 murder victim Stephen Lawrence, but would not generalise about his feelings towards the other six claimants. In his witness statement, Mr Dacre called Lady Lawrence's claims \"especially bewildering and bitterly wounding to me personally\". The paper conducted a 15-year campaign to bring Stephen's killers to justice, including a front-page story on Valentine's Day 1997, labelling five men - Gary Dobson, Neil Acourt, Jamie Acourt, Luke Knight, and David Norris - as \"murderers\" and challenging them to sue the newspaper for libel. Mr Dacre described it as \"the campaign of which I am most proud\". In her claim, Lady Lawrence alleges ANL had targeted her with hidden electronic surveillance, as well as tapping her landline, monitoring her bank account and making payments to police officers for confidential information, with the court told she felt \"like a victim all over again\". In his written evidence, Mr Dacre said that it was \"inconceivable\" that anyone at the Daily Mail would have carried out the alleged activities, and said the story was personally given to him by the then home secretary Jack Straw. He also said \"the suggestion that we ran the campaign to generate exclusive headlines, sell newspapers and profit is sickeningly misplaced and bleakly cynical\". Report was a 'wake-up' call When asked by the claimants' lawyer David Sherborne if he was motivated by a desire to \"protect his legacy\" rather than get to the truth, Mr Dacre said, while he did wish to clear his name, he also cared about the paper and \"the honest and dedicated staff who work for it\". Mr Dacre called a 2006 Information Commissioner's Office report, which showed journalists at the Mail were the top users of private detective Steve Whittamore, a \"wake-up call\" which set \"alarm bells ringing\". While he said he would not attempt to \"justify the figures\", he said in the three months following the report, he had \"stamped out the use of search agencies\". Mr Dacre also described his lack of technical know-how to the court, and said in his witness statement: \"I didn't ever use a personal computer and barely knew how to log on.\" ANL's barrister Antony White KC has previously said that ANL was defending the claims both on their merits and for being brought too late and that the allegations in relation to Lady Lawrence \"are denied in their entirety\" and \"are unsupported by the available evidence\". Meanwhile, the claimants' lawyer Mr Sherborne has accused the Daily Mail and The Mail on Sunday of being engaged in unlawful information gathering over \"at least two decades\", claiming they have \"skeletons in their closet\". Giving evidence in the first week of the trial, Prince Harry opened up about his experiences with the media, appearing emotional as he recounted how the press \"made my wife's life misery\". Actress Liz Hurley gave evidence the following day, becoming tearful as she described the alleged \"brutal invasion\" of her privacy by the media. Mr Dacre will continue his evidence on Wednesday morning. The trial before Mr Justice Nicklin is due to conclude in March, with a judgment in writing due at a later date."
    },
    {
        "title": "Chappell Roan leaves talent agency led by Casey Wasserman after emails shown in Epstein files",
        "description": "US singer Chappell Roan has announced she is leaving her talent agency, after emails between its founder and Ghislaine Maxwell were featured in the Epstein files.",
        "url": "https://news.sky.com/story/chappell-roan-leaves-talent-agency-led-by-casey-wasserman-after-emails-shown-in-epstein-files-13505614",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-chappell-roan-grammys_7160817.jpg?20260210095641",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-10 10:30:00",
        "Headline": "The star said the decision \"reflects my belief that meaningful change in our industry requires accountability and leadership that earns trust\".",
        "Content": "US singer Chappell Roan has announced she is leaving her talent agency, after emails between its founder and Ghislaine Maxwell were featured in the Epstein files. The Grammy-winning star shared a statement on social media announcing her departure from Wasserman, led by Casey Wasserman, saying she holds her teams \"to the highest standards\" and has \"a duty to protect them\" as well. \"No artist, agent or employee should ever be expected to defend or overlook actions that conflict so deeply with our own moral values,\" she added. Roan, 27, said she refused to \"passively stand by\" and that artists \"deserve representation that aligns with their values and supports their safety and dignity\". The decision to leave Wasserman \"reflects my belief that meaningful change in our industry requires accountability and leadership that earns trust\", she concluded. Roan did not mention the Epstein files in her statement. Documents recently released by the US justice department included flirtatious email exchanges between Wasserman, who was married at the time, and Maxwell, from 2003. Wasserman, who is in charge of organising the 2028 Olympic Games in Los Angeles, has since apologised for communicating with Maxwell. \"I deeply regret my correspondence with Ghislaine Maxwell,\" he said, adding it occurred \"long before her horrific crimes came to light\". Read more:Here's what we've found in the Epstein filesSurvivors condemn US govt's handling of files Wasserman said he \"never had a personal or business relationship\" with Jeffrey Epstein but that he did take part in a \"humanitarian trip\" on his plane. He added: \"I am terribly sorry for having any association with either of them.\" Wasserman's name appears in the official Epstein documents but no wrongdoing is alleged. Sky News has contacted the Wasserman agency for comment on Roan's departure. Maxwell, 64, is serving a 20-year jail term for her role in helping Epstein sexually abuse teenage girls. Yesterday, she refused to answer questions on the convicted sex offender before the US House Oversight Committee, citing her 5th amendment right to silence under the US constitution. Her lawyer told reporters Maxwell was \"prepared to speak fully and honestly\" in return for leniency on her sentence from Donald Trump. Epstein, who was convicted of sexual offences in 2008, was found dead in his prison cell in New York in August 2019, as he was awaiting trial after being charged with sex trafficking."
    },
    {
        "title": "Prince William asked to raise case of detained Manchester man during visit to Saudi Arabia",
        "description": "The Prince of Wales has been asked to raise the case of a Manchester man detained in Saudi Arabia during his first official trip to the country.",
        "url": "https://news.sky.com/story/prince-william-asked-to-raise-case-of-detained-manchester-man-during-visit-to-saudi-arabia-13505616",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ahmed-doush_7160848.jpg?20260210101523",
        "type": "Entertainment",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-02-10 09:53:00",
        "Headline": "In a letter, exclusively shared with Sky News, Amnesty International has written to Prince William sharing the plight of father-of-four Ahmed al-Doush.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The Prince of Wales has been asked to raise the case of a Manchester man detained in Saudi Arabia during his first official trip to the country. In a letter, exclusively shared with Sky News, Amnesty International has written to Prince William sharing the plight of Ahmed al-Doush. The father of four, and senior banking analyst for Bank of America, was returning from a holiday in Saudi with his wife and children in 2024 when he was arrested for past social media posts and his alleged association with a Saudi critic in exile, which he denies. He was initially sentenced to ten years in prison now reduced to eight. Sky News approached the Saudi embassy for comment but received no response. Felix Jakens, head of campaigns for Amnesty, told us: \"It was unsurprising the UK government and our economy and society are moving much closer to Saudi Arabia, so we would expect to see a royal visit at some point. \"Obviously, what we as a human rights organisation want to do is make sure that human rights are part of that conversation… \n                  William didn't react to Epstein question - but his actions on Saudi trip have been telling\n                 \n                  Prince William and Prince George help prepare Christmas lunch for the homeless\n                 \n                  William and Kate reveal Christmas card featuring family photo with George, Charlotte and Louis\n                 \"Obviously, we wouldn't be expecting him (Prince William) to make big public statements about human rights in Saudi Arabia, but we know that some of these issues are close to his and his wife's heart, so we'd just be asking him whether, in private, he'd be willing to raise the case of Ahmed.\" Talking about the impact on the al-Doush family, Haydee Dijkstal, Mr al-Doush's legal representative, said: \"His wife has spoken about the core role that Ahmed had in their family, not only as a provider, as the main provider for the family, but as a loving father. \"And his absence has been very much missed by his wife and children, and has had a serious impact on them. \"And this in addition to the most recent concerns about the fact that Ahmed's health and well-being, and the recent fear about his mental health, his mental well-being as well, have led his wife to appeal directly to the Crown Prince of Saudi Arabia.\" We understand his case has been raised by the UK with Saudi authorities. The Foreign Office told Sky News: \"We are supporting a British man who is detained in Saudia Arabia and are in contact with his family and the local authorities.\" This visit was always going to have its political sensitivities. Kensington Palace wouldn't comment on the letter from Amnesty, but talking more widely about Prince William's three-day visit, a royal source said: \"Prince William didn't blink [when asked to go]. \"He knows this is an important part of his global role for UK PLC.\" Prince William spent his first night in Saudi with his royal counterpart Mohammed bin Salman Al Saud, the Crown Prince of Saudi Arabia; the man credited with having a more open and more modern vision for Saudi, albeit one that some would suggest hasn't been wide-reaching enough in the political arena. But the first full day of engagements for William will be a display of how the country has liberalised and changed its focus, from meeting women's football teams, talking about their energy transition away from a dependence on oil and taking part in an e-gaming competition, another part of how Saudi's economy is diversifying, and trying to draw in a global tourism audience. William is also tasked with trying to maintain the attention on the significance of the trip after statements were released yesterday both on his behalf and from Buckingham Palace about the Epstein files and Andrew Mountbatten-Windsor's association with the convicted paedophile. Andrew denies any wrongdoing in relation to Epstein."
    },
    {
        "title": "British Museum to keep pendant linked to Henry VIII after raising £3.5m",
        "description": "A gold pendant linked to Henry VIII and his first wife, Catherine of Aragon, has been acquired by the British Museum following a successful fundraising campaign.",
        "url": "https://news.sky.com/story/british-museum-to-keep-pendant-linked-to-henry-viii-after-raising-16335m-13505519",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-british-museum-pendant_7159793.jpg?20260209081009",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-10 02:21:00",
        "Headline": "The artefact is believed to be linked to Henry VIII and his first wife, Catherine of Aragon. ",
        "Content": "A gold pendant linked to Henry VIII and his first wife, Catherine of Aragon, has been acquired by the British Museum following a successful fundraising campaign. The London museum launched the appeal in October to buy the Tudor Heart - a 16th-century, heart-shaped pendant discovered in Warwickshire by a metal detectorist in 2019 - and prevent it from entering a private collection. It has now announced it has reached its £3.5m fundraising target, after receiving more than £350,000 in public contributions and a string of donations from grants, trusts, and arts organisations. More than 45,000 members of the public contributed to the fundraising effort, the museum said, while it received £1.75m from The National Heritage Memorial Fund. Other donors included The Julia Rausing Trust, which donated £500,000 to the cause, the charity Art Fund, which donated £400,000, and The American Friends of the British Museum, which gave £300,000. The 24-carat gold artefact is thought to have been created for an event held in October 1518 to mark the betrothal of Henry and Catherine's daughter, Princess Mary - who would become Mary I - to the French heir apparent, according to research by the British Museum. It added that Henry VIII regularly commissioned London goldsmiths to create costume jewellery for major celebrations and state occasions. However, very few objects celebrating Henry and Catherine's relationship remain. 'Beautiful survivor' Nicholas Cullinan, director of the British Museum, offered \"a heartfelt thank you\" to those who supported the campaign. He said: \"The success of the campaign shows the power of history to spark the imagination and why objects like the Tudor Heart should be in a museum. \"This beautiful survivor tells us about a piece of English history few of us knew, but in which we can all now share. \"I am looking forward to saying more soon on our plans for it to tour the UK in the future.\" Read more from Sky News:King has 'profound concern' over Andrew claimsI'm going nowhere, PM declares After it was discovered, the pendant was reported under the Treasure Act 1996, which gives museums and galleries in England the opportunity to acquire historical objects and put them on display. Since the fundraising effort was announced, the Tudor Heart has been on display in the British Museum's gallery two, where it is set to remain on view. The museum said it hopes to have the pendant formally in the collection later this year."
    }
]