[
    {
        "title": "Madeleine McCann's sister tells court 'stalker' sent edited images to 'prove' she was missing girl",
        "description": "Madeleine McCann's sister has said her family's alleged stalker sent \"creepy\" messages about \"flashbacks\" and edited images to try to show a family resemblance.",
        "url": "https://news.sky.com/story/madeleine-mccanns-sister-tells-court-stalker-sent-edited-images-to-prove-she-was-missing-girl-13447550",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-amelie-mccann-madeleine-mccann_7046727.jpg?20251009124210",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 12:43:00",
        "Headline": "\"She'd clearly edited the pictures to make me look more like her, which was disturbing,\" Ms McCann told the court. \"I didn't look like that and I knew it had been changed.\"",
        "Content": "Madeleine McCann's sister has said her family's alleged stalker sent \"creepy\" messages about \"flashbacks\" and edited images to try to show a family resemblance. Amelie McCann told a court that Julia Wandelt was \"desperate\" to convince her she was missing Madeleine and had claimed her memories included playing 'ring-a-ring-a-roses' as a child. The court heard Wandelt allegedly sent the 20-year-old numerous social media messages and letters. The first, in January 2024, allegedly read: \"I know so many things. I don't know if this is the real account for Amelie McCann but I can tell you my memories.\" As it happened: Madeleine McCann's sister tells trial of 'creepy' messages Ms McCann told Leicester Crown Court it was \"quite disturbing that she's coming up with these supposed memories,\" as she was clearly not her sister. \"It makes me feel quite uncomfortable because it is quite creepy she is giving those details and trying to play with my emotions,\" she said. Madeleine McCann disappeared in Praia da Luz, Portugal in May 2007. She has never been found. Wandelt, 24, from Lubin in Poland, denies subsequently stalking the family. However, Madeleine's sister told the trial Wandelt had sent \"persistent\" messages urging her and her mother to take a DNA test, as well as images that were \"clearly altered or edited\". In one instance, she allegedly printed pictures of herself and Amelie McCann and sent them to the family's home address. A separate online message is said to have shown an image of her and Wandelt side-by-side. \"She'd clearly edited the pictures to make me look more like her, which was disturbing,\" Ms McCann told the court. \"I didn't look like that and I knew it had been changed.\" \"She is Polish and has Polish family who are her parents. It didn't make any sense to me,\" she added. Amelie McCann gave evidence remotely on Thursday, a day after her parents also described the distress they had felt, including when the defendants allegedly turned up at their house last December. She told the court she was scared by a message from Wandelt, which allegedly stated she would \"do whatever to prove my identity\" as Madeleine. \"It shows you the lengths she would go to, to try and get heard, which is a bit scary because you don't know what she would do next,\" said Ms McCann.  She said she had blocked Wandelt on multiple social media sites, but that her alleged actions were hardest for her mother, Kate. \"It definitely took a toll on her and her wellbeing because all the time her phone would be going off and it would be Julia,\" she said. Following the alleged December visit by Wandelt and her co-defendant 61-year-old Cardiff woman Karen Spragg - who also denies stalking - Ms McCann said she returned home from university and her parents had strengthened security. They told her there was \"an alarm we could press and alert the police,\" the court heard. 'Upsetting and disrespectful' Amelie's twin, Sean McCann, also gave evidence via a written statement in which he said Wandelt had caused a \"great deal of stress\". He said her claim to be his sister was \"upsetting\" and \"deeply disturbing\" - but that he felt \"guilty\" for feeling that way as he believes she might be suffering with a mental health condition. However, he added: \"If she is fully aware she is not Madeleine, yet makes these claims she is, that will be very upsetting for me.\" Sean McCann, 20, told the court he had also received Instagram messages from Wandelt but immediately blocked her. A friend of the McCanns, Ellie McQueen, was the final witness on Thursday morning and said Wandelt had sent her \"relentless\" messages online. She told jurors the first was on Facebook in June 2024 from the profile \"Julia Julia\". Ms McQueen said Wandelt asked for help to contact the McCanns: \"She seemed to know my mum was very close with Kate,\" she told the court. \"She was trying to send me DNA evidence to say she is Maddie,\" she told the court, adding that Wandelt seemed \"upset and aggravated\". One message allegedly sent by the defendant asks why Kate and Gerry McCann did not turn up to a vigil for Madeleine in their village, which she attended. In other messages, Wandelt allegedly said she \"remembered\" a life with Kate and Gerry McCann and even claimed to have the same \"spot in my right eye\" and \"lots of the same moles\" as Madeleine. The trial continues."
    },
    {
        "title": "Tim Westwood charged with four counts of rape",
        "description": "Former Radio 1 DJ Tim Westwood has been charged with four counts of rape, nine counts of indecent assault and two counts of sexual assault. ",
        "url": "https://news.sky.com/story/tim-westwood-charged-with-four-counts-of-rape-13447617",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tim-westwood-dj_7046930.jpg?20251009153413",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 14:20:00",
        "Headline": "The alleged historical assaults against seven different women are said to have taken place in various parts of London and a town in Gloucestershire.",
        "Content": "Former Radio 1 DJ Tim Westwood has been charged with four counts of rape, nine counts of indecent assault and two counts of sexual assault.  The charges relate to seven different women during a period from 1983 to 2016, the Metropolitan Police said. Officers say the youngest was aged 17 at the time of the alleged assault. The 68-year-old is due to appear at Westminster Magistrates' Court on Monday 10 November. Westwood has previously denied all allegations of sexual misconduct made against him. What are the charges? Police have said the former BBC broadcaster is alleged to have indecently assaulted a 17-year-old girl in the Fulham area of London in 1983. He is also accused of sexually assaulting a woman in her 20s in the Vauxhall area of London in 1986, as well as raping and sexually assaulting a woman, aged between 17 and 18, in London between 1995 and 1996. Westwood is alleged to have raped and sexually assaulted a woman aged 17 to 18 between 2000 and 2001 and raped a woman in her 20s in 2010 - with the alleged offences also reported to have taken place in London. He is further accused of sexually assaulting a woman in her 20s in Stroud, Gloucestershire, in 2010 and sexually assaulting another woman in her 20s in the Finchley area of London in 2016. Police investigation still open Detective Superintendent Andy Furphy, from the Metropolitan Police, said: \"It takes courage to come forward and report allegations of this nature. \"The women who have done so have put their trust in us and we continue to provide them with all available support. \"Our investigation remains open and we'd encourage anyone who has been impacted by this case, or anyone with information, to come forward and speak with us.\" When the first accusations surfaced in April 2022, his representative issued a statement saying he \"strongly rejects all allegations of wrongdoing\". Decades of broadcasting Westwood began his broadcasting career in local radio before joining Capital Radio in the late 1980s. He moved to the BBC in 1994, working on Radio 1 and Radio 1Xtra, spending nearly 20 years with the corporation. He left the BBC in 2013. Westwood then joined Capital Xtra, hosting a regular Saturday show where he was referred to as \"The Big Dawg\", before he left the company in 2022."
    },
    {
        "title": "Man arrested and released over Manchester synagogue attack is rearrested at city's airport",
        "description": "A man who was arrested and released without charge over the Manchester synagogue attack has been rearrested at the city's airport. ",
        "url": "https://news.sky.com/story/man-arrested-and-released-over-manchester-synagogue-attack-is-rearrested-at-citys-airport-13447729",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-flowers-heaton-park_7047306.jpg?20251009225745",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 17:57:00",
        "Headline": "The 30-year-old was detained again on Thursday - as members of the synagogue community gathered to pray and mourn, a week on, victims of the deadly attack.",
        "Content": "A man who was arrested and released without charge over the Manchester synagogue attack has been rearrested at the city's airport.  The 30-year-old was detained at 12.34pm on Thursday on suspicion of failing to disclose information about an act of terrorism, said Greater Manchester Police. The unnamed suspect had been arrested on 2 October on suspicion of the commission, preparation and instigation of acts of terrorism following the terror attack in Crumpsall last week. Following his rearrest at Manchester Airport on Thursday, the man has since been released on bail with conditions. It has now been revealed that last Thursday, 35-year-old Jihad al Shamie called 999 during his deadly rampage, pledging allegiance to the so-called Islamic State terror group. He drove his car at Jews gathering at the Heaton Park Hebrew Synagogue for the holy day of Yom Kippur, then attacked others with a knife and tried to storm the synagogue, wearing a fake suicide belt, before armed police shot him dead. Father-of-three Melvin Cravitz, 66, was killed in the attack, along with Adrian Daulby, 53, who was believed to have been inadvertently shot by police as he ran to block the synagogue doors to stop al Shamie getting inside to continue his knife rampage. \n                  The father of Jihad al Shamie has called for unity, one week on from deadly attack\n                 \n                  Manchester synagogue killer 'pledged allegiance to Islamic State' during attack, police say\n                 \n                  'Who's going to protect us?': Ex-wife of man injured in Manchester synagogue attack says he no longer wants to live in UK\n                 Read more:The father of Jihad al Shamie calls for unityHow attacker became radicalised On Wednesday, the police watchdog said it had found no evidence of misconduct in the police's actions. But the three Greater Manchester Police officers who fired their weapons are being treated as witnesses and the case remains under review, the Independent Office for Police Conduct said. Counter-terror police believe al Shamie, a Syrian-born UK citizen, was influenced by extremist Islamist ideology. Despite claiming to act on behalf of Islamic State, MI5 has reportedly been unable to establish any links between al Shamie and the terror group or other proscribed organisations.  Counter-terror police initially arrested six people in connection with the attack, releasing two without charge on Saturday. The four others arrested were released without charge on Wednesday, a day ahead of one's rearrest."
    },
    {
        "title": "Ringleaders of car theft gang who stole more than £2m worth of cars are jailed",
        "description": "The ringleaders of a \"highly sophisticated\" car theft gang who stole 107 high-value vehicles worth more than &#163;2m over an eight-month period have been jailed.",
        "url": "https://news.sky.com/story/ringleaders-of-car-theft-gang-who-stole-more-than-1632m-worth-of-cars-are-jailed-13447703",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bradley-paddick-benjamin-cross_7047028.jpg?20251009171138",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 17:03:00",
        "Headline": "The gang used technology to access the vehicles before returning in the middle of the night to drive them to \"chop shops\" where they were stripped for parts.",
        "Content": "The ringleaders of a \"highly sophisticated\" car theft gang who stole 107 high-value vehicles worth more than £2m over an eight-month period have been jailed. George Berry and Benjamin Cross, both from Southampton, led a gang of 12 thieves who stole cars mostly from driveways while their owners were asleep, Hampshire Constabulary said. The gang used signal boosters to trick keyless ignition vehicles that the key fob was close by so it could be unlocked and 'signal jammers' to prevent vehicles from being locked in the first place, with the owner unaware the key fob had not worked. They would then \"return in the middle of the night to drive the unlocked cars away,\" a Hampshire Constabulary spokesman said. They took the cars, 76 of which were stolen from addresses in Hampshire, 28 from Dorset and three from Wiltshire, between February and October 2023, to a \"chop shop\" to be stripped for parts. The makes included Land Rover, Range Rover, Jaguar, Mercedes, Audi, Bentley, Lexus, Hyundai, Citroen and Ford as well as motorcycles and Ford vans containing thousands of pounds worth of tools. Berry, 32, and Cross, 25, who played \"leading roles in the conspiracy\", were jailed for 56 months and 64 months respectively at Southampton Crown Court on Thursday. \n                  Major incident declared as crews battle Holt Heath fire near Wimborne\n                 \n                  US government department 'disappointed' by conviction of woman who breached abortion clinic 'buffer zone'\n                 \n                  Fire crews battle blazes in Dorset and Scotland as 'extreme' wildfire risk remains\n                 They were both convicted of conspiracy to steal motor vehicles, conspiracy to handle stolen goods, and possession of criminal property. Cross, from the Bursledon area of the city, was also found guilty of perverting the course of justice. Detective Constable Paul Beasley said: \"The vast majority of the vehicles were stolen by these thugs in the middle of the night from driveways as the owners slept. The victims suffered both \"vast\" financial hurt and mental harm from the distress of losing their vehicles, the officer said. \"For many people, having their car stolen can completely disrupt their day-to-day lives as these are relied upon so much for their work commutes, school runs, grocery shopping and social lives.\" Read more on Sky News:Madeleine McCann's sister targeted by stalkerEx Radio 1 DJ charged with rapeSynagogue attacker's father calls for unity Bradley Paddick, 22, of Southampton, was jailed for 36 months for conspiracy to steal motor vehicles and conspiracy to handle stolen goods. Rachael Moran, 31, of Southampton, was jailed for a year, suspended for 18 months, for possession of criminal property. Charlotte Traves, 24, of Bursledon, Southampton, was given an 18-month prison sentence suspended for 18 months for possession of criminal property and perverting the course of justice. Seven other members of the conspiracy are to be sentenced next month."
    },
    {
        "title": "The King and Prince William step out together for rare joint environmental engagement",
        "description": "The King and the Prince of Wales have enjoyed a rare public night out together to mark the countdown to the COP30 climate conference in Brazil.",
        "url": "https://news.sky.com/story/king-and-prince-william-step-out-together-for-rare-joint-environmental-engagement-13447803",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-the-king-prince-of-wales_7047291.jpg?20251009222529",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-09 20:34:00",
        "Headline": "At an event in London, it was confirmed the Prince of Wales will attend the COP30 leaders' summit in Brazil on behalf of his father.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The King and the Prince of Wales have enjoyed a rare public night out together to mark the countdown to the COP30 climate conference in Brazil. As the father and son arrived at London's Natural History Museum for the 'Countdown to COP30: mobilising action for climate and nature', it was confirmed that Prince William will attend the leaders' gathering in Belem on behalf of King Charles. William was already due to fly to Rio de Janeiro on 3 November for the Earthshot Awards. He will then travel to Belem on 6 November for the COP30 world leaders' summit. Historically, the King has delivered numerous keynote speeches at the UN Climate Crisis conference, both as Prince of Wales and monarch. Arriving together at the Natural History Museum, the two men - who share a passion for the environment - seemed in their element, with the event bringing together changemakers tackling climate change and nature loss. Speaking to Prince William, the deputy prime minister David Lammy and Ed Miliband, Secretary of State for Energy and Climate Change, appeared to be telling the prince how delighted they were that he was attending the climate conference in three weeks' time. William's global profile will be a significant boost for the UK's presence at the summit. \n                   Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise\n                 \n                  Those close to William say this is the most publicly vulnerable we have seen him\n                 \n                  Prince William hints at 'changes' to come when he is king\n                 Read more from Sky News:Princess of Wales: Phones creating 'epidemic of disconnection'Ex-Radio 1 DJ Tim Westwood charged with four counts of rape The King and William also met the Brazilian ambassador to the UK, Antonio de Aguiar Patriota, and minister of health, Alexandre Padilha, who were representing the COP30 host nation. At the end of the evening, William appeared to have waited to say goodbye to his father, as the King was happily deep in conversation with one of the attendees, but eventually, with an affectionate hand on the shoulder, William said his farewells."
    },
    {
        "title": "Only man to appeal Gisele Pelicot rape conviction handed longer sentence",
        "description": "A French appeals court has handed a longer 10-year sentence to the only man to challenge his conviction for raping Gisele Pelicot while she was drugged and unconscious.",
        "url": "https://news.sky.com/story/only-man-to-appeal-pelicot-rape-conviction-handed-longer-sentence-13447664",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-husamettin-dogan-pelicot_7047098.jpg?20251009181920",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 15:52:00",
        "Headline": "Husamettin Dogan was the only man among the 51 convicted of abusing Gisele Pelicot who appealed. His sentence was increased from nine to ten years.",
        "Content": "A French appeals court has handed a longer 10-year sentence to the only man to challenge his conviction for raping Gisele Pelicot while she was drugged and unconscious. Construction worker Husamettin Dogan, 44, was the only one of 51 men convicted last December in the harrowing mass rape trial to appeal against his verdict.  The trial was covered around the world and turned Ms Pelicot into a global icon after she opposed a closed hearing - a demand made by several defendants. The court sided with her. Those convicted included Dominique Pelicot, Ms Pelicot's ex-husband, who knocked her unconscious by lacing her food and drink with drugs before offering her to strangers he met online between 2011 and 2020, filming their assaults. Dogan had been sentenced to nine years in prison in the initial trial. He was tried on charges of aggravated rape by administering substances that impair judgement or self-control, which could have been punished by up to 20 years in prison. The prosecutor in the appeal case in Nimes, southern France, asked for a 12-year sentence, French media reported. \"One cannot, in 2025, think that because she said nothing, that she agreed. Because that kind of thinking belongs to another era!\" the prosecutor told the court, according to Le Monde newspaper. Read more from Sky News:Tim Westwood charged with four counts of rapeCould Trump win the Nobel Peace Prize? Dogan had denied he intended to rape Ms Pelicot and claimed he was deceived by her husband. Dominique Pelicot was found guilty on all charges and sentenced to the maximum 20 years in prison after admitting his role. He did not appeal. Husband filmed assaults Sentences for the other convicted men, who were found guilty of rape, attempted rape or sexual assault, ranged from three to 15 years in prison. One of them was also convicted of drugging and raping his own wife with Dominique Pelicot's help. Evidence presented at the trial included horrific videos of rapes and assaults Dominique Pelicot filmed in the couple's home in the small Provence town of Mazan and elsewhere. In November, civil proceedings in the southern French city of Avignon are due to settle damages owed to Ms Pelicot and her family, to be paid jointly by the convicted men. Ms Pelicot has become a symbol of the fight against sexual violence, and the case has spurred a national reckoning over rape culture in France."
    },
    {
        "title": "Police thwart suspected plot to attack Belgium's prime minister",
        "description": "Three men have been arrested in Belgium over a suspected plot to attack the country's politicians, including Prime Minister Bart De Wever.",
        "url": "https://news.sky.com/story/police-thwart-suspected-plot-to-attack-belgiums-prime-minister-13447781",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-police-antwerp-belgium_7047226.jpg?20251009212731",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 19:57:00",
        "Headline": "Belgian prosecutors said there are indications the intention was to carry out an alleged \"jihadist-inspired terrorist attack\" targeting politicians.",
        "Content": "Three men have been arrested in Belgium over a suspected plot to attack the country's politicians, including Prime Minister Bart De Wever. The suspects were not identified, but were described as \"young adults,\" born in 2001, 2002 and 2007, and all three lived in the city of Antwerp. As of Thursday evening, two suspects were still being questioned by Antwerp police, and were due to appear before the investigating judge on Friday. Police said the third suspect was released. Federal prosecutors said they were taken into custody after an anti-terrorism judge ordered searches of their homes in the city by police officers backed by explosive sniffer dogs. They said in a statement that the raids were \"part of an investigation into, among other things, attempted terrorist murder and participation in the activities of a terrorist group\". \"There are indications that the intention was to carry out a jihadist-inspired terrorist attack targeting politicians,\" they added, without naming the individuals who might have been targeted as part of the suspected plot. \n                  Belgium announces it will recognise Palestinian state\n                 \n                  Tomorrowland: 'Devastating' blaze destroys main stage at major festival - two days before it was due to begin\n                 \n                  Three Belgian soldiers injured in 'shooting incident' during training exercise in Scotland\n                 But in a post on social media, Belgian foreign minister and deputy prime minister Maxime Prevot said the attack allegedly planned to target Prime Minister Bart De Wever - a former mayor of Antwerp who lives in the city. He said it was \"deeply shocking,\" adding his thanks to security and justice services for their \"rapid action\". Read more from Sky News:How two years of war have shattered the Gaza StripGaza peace plan: What has been agreed? Prosecutors said police found \"an improvised device\" that was not operational at the time in one of the suspects' houses. A bag of steel balls was also found during search, and a 3D printer believed to be used to make parts for the alleged planned attack was found at another residence. \"There are also indications that the intention was to build a drone to attach a load,\" the prosecutors added."
    },
    {
        "title": "Islamic State supporter 'hero-worshipped' mastermind of 2015 Paris attacks, court told",
        "description": "An Islamic State supporter was said to have \"hero-worshipped\" the mastermind of the 2015 Paris attacks, a court has heard.",
        "url": "https://news.sky.com/story/islamic-state-supporter-hero-worshipped-mastermind-of-2015-paris-attacks-court-told-13447718",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-walid-saadaoui-bilel-saadaoui_7046019.jpg?20251008153940",
        "type": "Home",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-10-09 17:37:00",
        "Headline": "Walid Saadaoui is accused of preparing a terrorist attack by making plans for an attack, conducting reconnaissance and arranging the purchase and delivery of firearms.",
        "Content": "By Duncan Gardham, security journalist  An Islamic State supporter was said to have \"hero-worshipped\" the mastermind of the 2015 Paris attacks, a court has heard. Walid Saadaoui, 38, of Abram, Greater Manchester, is accused along with Amar Hussein, 52, of preparing a terrorist attack by making plans for an attack, conducting reconnaissance and arranging the purchase and delivery of firearms. Preston Crown Court heard how he paid thousands of pounds to buy six firearms for a terrorist cell planning to attack Jewish people in Manchester. Saadaoui was arrested by undercover police in a car park in Bolton on 8 May last year as he took delivery of the weapons. The court was told that on 18 January 2023, Saadaoui had posted praise on Facebook of Abdelhamid Abaaoud - an Islamic State terrorist behind the 2015 Paris attacks. 2015 Paris attacks a 'source of inspiration' Harpreet Sandhu KC, prosecuting, said the terrorist was a \"source of inspiration\" for Saadaoui. He added: \"The sort of firearms Walid Saadaoui had arranged to have smuggled into the UK were the sort of weapons which had been used to kill 130 people and injure hundreds more in Paris. \"He wanted to replicate what Abaaoud had done. Walid Saadaoui hero-worshipped that terrorist.\" The court heard that Saadaoui was contacted on Facebook by an undercover officer called Farouk - using the name Abu Bilal - in December that year At that time, Saadaoui was said to be using an image of Abaaoud as a profile picture. The undercover officer asked him: \"Peace and blessing of god, how did you get to know the martyr brother Abdul Hamid?\" Saadaoui later told Farouk: \"I can use a knife in the operation, but this will not be enough to take revenge, only the automatic gun. I want to kill as many as possible.\" Read more from Sky News:How two years of war have shattered the Gaza StripCould Trump win the Nobel Peace Prize tomorrow? Mr Sandhu told the court that in January 2024, Farouk sent a video to Saadaoui showing a Kalashnikov being loaded and then unloaded. In later messages to the undercover officer, Saadaoui said: \"I have two others with me... One of them is a brother who said that he doesn't wish to continue to live.\" Saadaoui and Hussein face trial alongside Saadaoui's younger brother, Bilel, 36, of Hindley near Wigan. The younger brother is charged with failure to disclose information about an act of terrorism. All three defendants deny the allegations. Before the trial started, the judge told the jury that the background of the case was \"coincidental\" to last week's attack at the Heaton Park Hebrew Congregation Synagogue in Crumpsall, Manchester. He said: \"You must try them fairly without reference or thought to what happened there.\" The trial continues."
    },
    {
        "title": "Huddersfield man who stabbed 16-year-old Syrian refugee after he brushed past his girlfriend found guilty of murder",
        "description": "A man who stabbed a 16-year-old Syrian refugee in the neck after he brushed past his girlfriend has been found guilty of murder.",
        "url": "https://news.sky.com/story/huddersfield-man-who-stabbed-16-year-old-syrian-refugee-in-neck-after-he-brushed-past-his-girlfriend-found-guilty-of-murder-13447654",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-alfie-franco-ahmad-mamdouh-al-ibrahim_7046951.jpg?20251009171000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-09 15:29:00",
        "Headline": "Ahmad Al Ibrahim, who dreamed of being a doctor, was killed after an altercation with Alfie Franco.",
        "Content": " A man who stabbed a 16-year-old Syrian refugee in the neck after he brushed past his girlfriend has been found guilty of murder. Alfie Franco, 20, was on Thursday convicted of killing Ahmad Al Ibrahim on a busy shopping street in Huddersfield earlier this year. Ahmad, who fled war-torn Homs as an unaccompanied child refugee after being injured in a bombing, had only been living in the West Yorkshire town for a couple of weeks. Jurors at Leeds Crown Court heard that on 3 April, Ahmad, whose parents said had dreamed of being a doctor, was walking around the town with a friend while Franco was going to buy eyelash glue with his girlfriend after a Jobcentre appointment. When they crossed paths, prosecutors said Franco took \"some petty exception\" to Ahmad \"innocuously\" walking past his girlfriend, and CCTV footage showed Franco saying something to Ahmad, before calling him over after a short verbal altercation. As Ahmad walked over, Franco opened the blade on a flick knife he was carrying and drove it into the teenager's neck. The court heard that Franco had used cannabis before the encounter. Later tests also revealed he had recently used cocaine, diazepam, ketamine and codeine. \n                  Harry Pitman killed in 'blink of an eye' at New Year's Eve event, trial told\n                 \n                  Southport killer Axel Rudakubana had anti-Islamic material, inquiry into stabbings told\n                 \n                  Southport teacher Heidi Liddle battles 'crushing guilt' after surviving attack in which three children died\n                 Footage played during the trial showed Ahmad clutching his throat and staggering a few yards up the street, before collapsing. The court was told how Franco kept the knife hidden \"in a sly way\" until the last second so that Ahmad, who was unarmed, \"didn't have a chance\". Read more from Sky News:Could Trump win the Nobel Peace Prize?Tim Westwood charged with four counts of rapePutin admits Russia shot down Azerbaijani jet 'A young man with a cocky swagger' After the stabbing, Franco fled the scene before handing himself in at a police station, telling officers in an interview he had been acting in self-defence. Franco, who returned to Huddersfield from South Africa at the age of 13, also told officers he had spent years as the only white boy in the Cape Flats, where \"if a boy came for you with aggression, they are either coming to hurt you or kill you\". But prosecutor Richard Wright KC said that \"to plunge that knife into someone's neck who has done no more than walk towards you after you've engaged them in some verbal argy-bargy in the street... that's not reasonable self-defence\". During the trial, Franco told the court he thought he had seen Ahmad reaching for a weapon in his waistband during the altercation and said he had only been aiming for the boy's cheek, and wanted to \"cut him and get away\". Mr Wright added: \"This is a case of a young man with a cocky swagger, wandering around town with his girlfriend, on drugs, who doesn't like the fact that Ahmad has spoken back to him.\" 'I will always carry the guilt': Ahmad's uncle After the verdict, Ahmad's uncle, Ghazwan Al Ibrahim, said that the 16-year-old \"had travelled from Syria to the UK, and this was meant to be his opportunity to create a better life for himself, leaving behind his parents and siblings in a war-torn country\". He added: \"I cannot begin to imagine how Ahmad was feeling in his final minutes. Alone in a strange country that should have been the place where he was safe. \"The image of having to identify my nephew and then having to break the news to my brother and sister-in-law, and relay to them what had happened to their precious son, will never leave me. \"His parents are heartbroken beyond words. As Ahmad's uncle, I will always carry the guilt that Ahmad had come to the UK, and I could not keep him safe.\" On his hopes of becoming a doctor, Ahmad's family said he wanted \"to heal others after all he had endured\". They said: \"He chose to come to the UK because he believed in the values of human rights, safety, and dignity... he had just begun settling into his new life with his uncle, adjusting to a new language, a new home, and a future he was excited to build. \"Ahmad was kind, gentle, and carried so much promise. Losing him has left an unimaginable emptiness in our hearts. \"We never thought that the place he saw as a safe haven would be where his life would end.\" Franco was found guilty of murder by a jury after just over three hours of deliberations. He also admitted a charge of possessing a knife in a public place at an earlier hearing. He will be sentenced on Friday afternoon."
    },
    {
        "title": "Discord hack shows dangers of online age checks as internet policing hopes put to the test",
        "description": "Messaging platform Discord has said the official ID photos of around 70,000 users have been stolen by hackers.",
        "url": "https://news.sky.com/story/discord-hack-shows-dangers-of-online-age-checks-as-internet-policing-hopes-put-to-the-test-13447618",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-discord-app_7046939.jpg?20251009153940",
        "type": "Home",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "As the drive for age verification grows, so does the pressure on online companies to keep users' data safe and, as the Discord hack shows, that cannot be guaranteed. ",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n  Messaging platform Discord has said the official ID photos of around 70,000 users have been stolen by hackers. The app, which is popular with gamers and teenagers, said the hackers targeted a firm responsible for verifying the ages of its users. Discord said its own platform was not breached. The stolen data could include personal information, partial credit card numbers and messages with Discord's customer service agents, the firm said. No full credit card details, passwords or messages and activity beyond conversations with Discord customer support were leaked, it added. Discord said it had revoked the third-party service's access and was continuing to investigate. It said all affected users have been contacted. \"Looking ahead, we recommend impacted users stay alert when receiving messages or other communication that may seem suspicious,\" it said. Until recently, a hack like this could not have happened, because companies had no need to process and collect proofs of age. Now, so many governments are following the UK and introducing age verification for unsuitable or pornographic content that a company like Discord has to roll out age checks for a decent portion of its 200 million active users. It's a bit like the way that shops have to check your age if you're buying alcohol - only because it's online, it comes with a lot of additional complications. A shop, for instance, won't keep a copy of your passport once they've checked your age. And it definitely won't keep it in a massive (yet strangely light) safe along with thousands of other passport photocopies, stored right by its front door, ready to be taken. Online, it's surprisingly easy to do just that. Read more on Sky News:AI 'distorting women online'Pros and cons of digital IDsImpact of new online safety rules It's worth noting that the age verification system used by Discord wasn't hacked itself. That system asked people to take a photo of themselves, then used software to estimate their age. Once the check was complete, the image was immediately deleted. The problem came with the appeals part of the process, which was supplied to Discord by an as-yet-unnamed third party. If someone thought that the age verification system had wrongly barred them from Discord they could send in a picture of their ID to prove their age. This collection of images was hacked. As a result, Discord says, more than 70,000 IDs are now in the possession of hackers. (The hackers themselves claim that the number is much bigger - 2,185,151 photos. Discord says this is wrong and the hackers are simply trying to extort money. It's a messy situation.) There are ways to make age verification safer. Companies could stop storing photo ID, for instance (although then it would be impossible to know for sure if their checks were correct). And advocates of ID cards will point out that a proper government ID could avoid the need to send pictures of your passport simply to prove your age. You'd use your digital ID instead, which would stay safely on your device. But the best way to stop data being hacked is not to collect it in the first place. We're at the start of a defining test - can governments actually police the internet? Or will the measures that are supposed to make us safer actually end up making us less secure?"
    },
    {
        "title": "Madeleine McCann's sister tells court 'stalker' sent edited images to 'prove' she was missing girl",
        "description": "Madeleine McCann's sister has said her family's alleged stalker sent \"creepy\" messages about \"flashbacks\" and edited images to try to show a family resemblance.",
        "url": "https://news.sky.com/story/madeleine-mccanns-sister-tells-court-stalker-sent-edited-images-to-prove-she-was-missing-girl-13447550",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-amelie-mccann-madeleine-mccann_7046727.jpg?20251009124210",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-09 12:43:00",
        "Headline": "\"She'd clearly edited the pictures to make me look more like her, which was disturbing,\" Ms McCann told the court. \"I didn't look like that and I knew it had been changed.\"",
        "Content": "Madeleine McCann's sister has said her family's alleged stalker sent \"creepy\" messages about \"flashbacks\" and edited images to try to show a family resemblance. Amelie McCann told a court that Julia Wandelt was \"desperate\" to convince her she was missing Madeleine and had claimed her memories included playing 'ring-a-ring-a-roses' as a child. The court heard Wandelt allegedly sent the 20-year-old numerous social media messages and letters. The first, in January 2024, allegedly read: \"I know so many things. I don't know if this is the real account for Amelie McCann but I can tell you my memories.\" As it happened: Madeleine McCann's sister tells trial of 'creepy' messages Ms McCann told Leicester Crown Court it was \"quite disturbing that she's coming up with these supposed memories,\" as she was clearly not her sister. \"It makes me feel quite uncomfortable because it is quite creepy she is giving those details and trying to play with my emotions,\" she said. Madeleine McCann disappeared in Praia da Luz, Portugal in May 2007. She has never been found. Wandelt, 24, from Lubin in Poland, denies subsequently stalking the family. However, Madeleine's sister told the trial Wandelt had sent \"persistent\" messages urging her and her mother to take a DNA test, as well as images that were \"clearly altered or edited\". In one instance, she allegedly printed pictures of herself and Amelie McCann and sent them to the family's home address. A separate online message is said to have shown an image of her and Wandelt side-by-side. \"She'd clearly edited the pictures to make me look more like her, which was disturbing,\" Ms McCann told the court. \"I didn't look like that and I knew it had been changed.\" \"She is Polish and has Polish family who are her parents. It didn't make any sense to me,\" she added. Amelie McCann gave evidence remotely on Thursday, a day after her parents also described the distress they had felt, including when the defendants allegedly turned up at their house last December. She told the court she was scared by a message from Wandelt, which allegedly stated she would \"do whatever to prove my identity\" as Madeleine. \"It shows you the lengths she would go to, to try and get heard, which is a bit scary because you don't know what she would do next,\" said Ms McCann.  She said she had blocked Wandelt on multiple social media sites, but that her alleged actions were hardest for her mother, Kate. \"It definitely took a toll on her and her wellbeing because all the time her phone would be going off and it would be Julia,\" she said. Following the alleged December visit by Wandelt and her co-defendant 61-year-old Cardiff woman Karen Spragg - who also denies stalking - Ms McCann said she returned home from university and her parents had strengthened security. They told her there was \"an alarm we could press and alert the police,\" the court heard. 'Upsetting and disrespectful' Amelie's twin, Sean McCann, also gave evidence via a written statement in which he said Wandelt had caused a \"great deal of stress\". He said her claim to be his sister was \"upsetting\" and \"deeply disturbing\" - but that he felt \"guilty\" for feeling that way as he believes she might be suffering with a mental health condition. However, he added: \"If she is fully aware she is not Madeleine, yet makes these claims she is, that will be very upsetting for me.\" Sean McCann, 20, told the court he had also received Instagram messages from Wandelt but immediately blocked her. A friend of the McCanns, Ellie McQueen, was the final witness on Thursday morning and said Wandelt had sent her \"relentless\" messages online. She told jurors the first was on Facebook in June 2024 from the profile \"Julia Julia\". Ms McQueen said Wandelt asked for help to contact the McCanns: \"She seemed to know my mum was very close with Kate,\" she told the court. \"She was trying to send me DNA evidence to say she is Maddie,\" she told the court, adding that Wandelt seemed \"upset and aggravated\". One message allegedly sent by the defendant asks why Kate and Gerry McCann did not turn up to a vigil for Madeleine in their village, which she attended. In other messages, Wandelt allegedly said she \"remembered\" a life with Kate and Gerry McCann and even claimed to have the same \"spot in my right eye\" and \"lots of the same moles\" as Madeleine. The trial continues."
    },
    {
        "title": "Tim Westwood charged with four counts of rape",
        "description": "Former Radio 1 DJ Tim Westwood has been charged with four counts of rape, nine counts of indecent assault and two counts of sexual assault. ",
        "url": "https://news.sky.com/story/tim-westwood-charged-with-four-counts-of-rape-13447617",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tim-westwood-dj_7046930.jpg?20251009153413",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-09 14:20:00",
        "Headline": "The alleged historical assaults against seven different women are said to have taken place in various parts of London and a town in Gloucestershire.",
        "Content": "Former Radio 1 DJ Tim Westwood has been charged with four counts of rape, nine counts of indecent assault and two counts of sexual assault.  The charges relate to seven different women during a period from 1983 to 2016, the Metropolitan Police said. Officers say the youngest was aged 17 at the time of the alleged assault. The 68-year-old is due to appear at Westminster Magistrates' Court on Monday 10 November. Westwood has previously denied all allegations of sexual misconduct made against him. What are the charges? Police have said the former BBC broadcaster is alleged to have indecently assaulted a 17-year-old girl in the Fulham area of London in 1983. He is also accused of sexually assaulting a woman in her 20s in the Vauxhall area of London in 1986, as well as raping and sexually assaulting a woman, aged between 17 and 18, in London between 1995 and 1996. Westwood is alleged to have raped and sexually assaulted a woman aged 17 to 18 between 2000 and 2001 and raped a woman in her 20s in 2010 - with the alleged offences also reported to have taken place in London. He is further accused of sexually assaulting a woman in her 20s in Stroud, Gloucestershire, in 2010 and sexually assaulting another woman in her 20s in the Finchley area of London in 2016. Police investigation still open Detective Superintendent Andy Furphy, from the Metropolitan Police, said: \"It takes courage to come forward and report allegations of this nature. \"The women who have done so have put their trust in us and we continue to provide them with all available support. \"Our investigation remains open and we'd encourage anyone who has been impacted by this case, or anyone with information, to come forward and speak with us.\" When the first accusations surfaced in April 2022, his representative issued a statement saying he \"strongly rejects all allegations of wrongdoing\". Decades of broadcasting Westwood began his broadcasting career in local radio before joining Capital Radio in the late 1980s. He moved to the BBC in 1994, working on Radio 1 and Radio 1Xtra, spending nearly 20 years with the corporation. He left the BBC in 2013. Westwood then joined Capital Xtra, hosting a regular Saturday show where he was referred to as \"The Big Dawg\", before he left the company in 2022."
    },
    {
        "title": "Man arrested and released over Manchester synagogue attack is rearrested at city's airport",
        "description": "A man who was arrested and released without charge over the Manchester synagogue attack has been rearrested at the city's airport. ",
        "url": "https://news.sky.com/story/man-arrested-and-released-over-manchester-synagogue-attack-is-rearrested-at-citys-airport-13447729",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-flowers-heaton-park_7047306.jpg?20251009225745",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-09 17:57:00",
        "Headline": "The 30-year-old was detained again on Thursday - as members of the synagogue community gathered to pray and mourn, a week on, victims of the deadly attack.",
        "Content": "A man who was arrested and released without charge over the Manchester synagogue attack has been rearrested at the city's airport.  The 30-year-old was detained at 12.34pm on Thursday on suspicion of failing to disclose information about an act of terrorism, said Greater Manchester Police. The unnamed suspect had been arrested on 2 October on suspicion of the commission, preparation and instigation of acts of terrorism following the terror attack in Crumpsall last week. Following his rearrest at Manchester Airport on Thursday, the man has since been released on bail with conditions. It has now been revealed that last Thursday, 35-year-old Jihad al Shamie called 999 during his deadly rampage, pledging allegiance to the so-called Islamic State terror group. He drove his car at Jews gathering at the Heaton Park Hebrew Synagogue for the holy day of Yom Kippur, then attacked others with a knife and tried to storm the synagogue, wearing a fake suicide belt, before armed police shot him dead. Father-of-three Melvin Cravitz, 66, was killed in the attack, along with Adrian Daulby, 53, who was believed to have been inadvertently shot by police as he ran to block the synagogue doors to stop al Shamie getting inside to continue his knife rampage. \n                  The father of Jihad al Shamie has called for unity, one week on from deadly attack\n                 \n                  Manchester synagogue killer 'pledged allegiance to Islamic State' during attack, police say\n                 \n                  'Who's going to protect us?': Ex-wife of man injured in Manchester synagogue attack says he no longer wants to live in UK\n                 Read more:The father of Jihad al Shamie calls for unityHow attacker became radicalised On Wednesday, the police watchdog said it had found no evidence of misconduct in the police's actions. But the three Greater Manchester Police officers who fired their weapons are being treated as witnesses and the case remains under review, the Independent Office for Police Conduct said. Counter-terror police believe al Shamie, a Syrian-born UK citizen, was influenced by extremist Islamist ideology. Despite claiming to act on behalf of Islamic State, MI5 has reportedly been unable to establish any links between al Shamie and the terror group or other proscribed organisations.  Counter-terror police initially arrested six people in connection with the attack, releasing two without charge on Saturday. The four others arrested were released without charge on Wednesday, a day ahead of one's rearrest."
    },
    {
        "title": "'Uncertainty really matters': Sky News investigates new AI test at sea",
        "description": "A new generation of artificial intelligence that provides a \"confidence rating\" of its answers could make algorithms more trustworthy and speed their rollout in safety-critical situations.",
        "url": "https://news.sky.com/story/uncertainty-really-matters-sky-news-investigates-new-ai-test-at-sea-13443514",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sea-saling-at-sea-ai_7038183.jpg?20251001141441",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "Scientists developing the technology called \"uncertainty-aware AI\" say it removes the risk of hallucinations - fictitious answers created by computer algorithms when they have incomplete or conflicting data.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A new generation of artificial intelligence that provides a \"confidence rating\" of its answers could make algorithms more trustworthy and speed their rollout in safety-critical situations. Scientists developing the technology called \"uncertainty-aware AI\" say it removes the risk of hallucinations - fictitious answers created by computer algorithms when they have incomplete or conflicting data. The new AI assistant would instead provide its best assessment of a situation when faced with patchy evidence, but confirm that it wasn't sure. A human operator would then be able to judge how much weight to put on the answer and seek additional information where necessary. The start-up digiLab, which devised the AI assistant called the Uncertainty Engine, is already collaborating with a major manufacturer in the design of a new generation of small-scale nuclear reactors that are likely to be placed closer to people's houses in future. It helps engineers accelerate development without taking risks. Read more about AI:How most people are using ChatGPTMeet Diella: Albania's AI-generated 'minister' Tim Dodwell, company founder, told Sky News: \"As we adopt AI in situations that are going to [be] transformative, like energy, maritime safety and healthcare, uncertainty really matters. \"I see no real future for AI unless we answer another problem: can we trust it? Human lives are at stake and people have to take responsibility for what the algorithms will do.\" Sky News was invited to join a team testing the Uncertainty Engine out at sea, where they believe it could be a game-changer for complex maritime route planning. The AI assistant is being used on a high-performance sailing yacht to help plot the fastest or safest route. It can't currently be used in races, but it is helping the Next Step Racing team prepare and understand how to extract even more power from the boat. Joss Creswell, co-skipper, said offshore racing, like Formula One, is all about small margins - and AI can help crunch a mass of data. \"There's a lot, a lot of information coming to the screen,\" he said. \"You've got information about the wind, the sea state, the boat's performance, as well as the position of other boats you're racing against. \"Quantifying that and reducing it to something that we understand and then react to is really difficult, so it's really useful to use AI for that. \"It can give you insights into the changes you can make to give you an advantage over the competition.\" Read more from Thomas Moore:AI model could predict disease risk a decade before symptomsCould refreezing the Arctic actually work?Mars 'leopard spots' clearest sign life once existed there Mr Dodwell said the AI assistant could also reduce fuel costs and carbon dioxide emissions of enormous oil tankers and cargo vessels by giving the crew advice on the most efficient route. \"Over a long journey, like Australia to Southampton, there's uncertainty about what the wind and sea conditions will be. \"What we really want is for AI to look at options for the different routes we can take and capture uncertainty in those weather conditions \"It can also capture uncertainty in shipping lanes - for example, if the Suez Canal was closed. \"By doing this intelligently, a 1-5% saving could mean huge benefits to efficiency overall.\" Mr Dodwell added that saving 5% in fuel consumption would reduce carbon emissions from the UK shipping industry by 600,000 tonnes a year, equivalent to taking 300,000 cars off the road."
    },
    {
        "title": "Phones creating 'epidemic of disconnection' in families, says Princess of Wales",
        "description": "The Princess of Wales has said smartphones and computer screens create \"an epidemic of disconnection\" within families.",
        "url": "https://news.sky.com/story/phones-creating-epidemic-of-disconnection-in-families-says-princess-of-wales-13447487",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-prince-of-wales-princess-of-wales_7016438.jpg?20250910200222",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-09 10:29:00",
        "Headline": "\"Our undivided attention is the most precious gift we can give another person. Yet, increasingly, it's the most difficult gift to offer,\" Kate writes in a joint essay. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The Princess of Wales has said smartphones and computer screens create \"an epidemic of disconnection\" within families. Kate's words - in an essay co-written with a Harvard professor - come ahead of a visit to Oxford to highlight her work on early years education and support. In the piece, she says that \"while new technology has many benefits, we must also acknowledge that it plays a complex and often troubling role in this epidemic of disconnection\". \"While digital devices promise to keep us connected, they frequently do the opposite,\" writes the princess. \"Our smartphones, tablets, and computers have become sources of constant distraction, fragmenting our focus and preventing us from giving others the undivided attention that relationships require.\" Emphasising how she believes technology can interfere in family life, she adds: \"We sit together in the same room while our minds are scattered across dozens of apps, notifications, and feeds. \"We're physically present but mentally absent, unable to fully engage with the people right in front of us. \n                  Prince William praises 'remarkable legacies' of Southport victims' parents\n                 \n                  Trump100: The King and the Donald\n                 \n                  Sword, book and Union flag among gifts exchanged between the King and Donald Trump\n                 \"This technological interference strikes at something fundamental: our undivided attention is the most precious gift we can give another person. Yet, increasingly, it's the most difficult gift to offer.\" The Prince and Princess of Wales have previously spoken about the potentially harmful effects of social media. In a recent interview, Prince William revealed that their three children, George, Charlotte and Louis, currently don't have mobile phones, and that they try to have dinner together. Kate's essay, titled The Power of Human Connection in a Distracted World, was released by her Royal Foundation Centre for Early Childhood and written in collaboration with Professor Robert Waldinger. Read more from Sky News:William hints at 'changes' to come when he is kingWilliam says he misses late Queen and Prince Philip Kate first met the Harvard academic in 2022 and he's worked closely with the Royal Foundation ever since. \"We live increasingly lonelier lives, which research shows is toxic to human health, and it's our young people (aged 16 to 24) that report being the loneliest of all, the very generation that should be forming the relationships that will sustain them throughout life,\" write the princess and the professor. Later today, the princess will visit Home‑Start Oxford to meet volunteers and families, and talk about how they are using resources and films produced by the Centre for Early Childhood to help parents and children."
    },
    {
        "title": "Starmer's found new enthusiasm for his digital ID project - but will he be able to sell it?",
        "description": "One metric for the rise and fall of this government might end up being the&#160;progress of the rollout of digital ID.",
        "url": "https://news.sky.com/story/starmers-found-new-enthusiasm-for-his-digital-id-project-but-will-he-be-able-to-sell-it-13447805",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/digital-id-starmer-digital-id-cards_7032482.jpg?20250928151755",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "The PM's plan to introduce digital IDs has been opposed by millions - but his trip to India may have shown him a way through.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  One metric for the rise and fall of this government might end up being the progress of the rollout of digital ID. The lack of a clear plan - despite the high profile announcement by the PM - means the destination still remains slightly opaque, and some cabinet ministers are sceptical. However, the PM's India trip suggests that there might just be a path to success, if things fall in Keir Starmer's favour. During his visit, Starmer met the boss of Infosys, Nandan Nilekani, who is behind the rollout of digital ID to more than 1.4 billion Indian citizens. Afterwards, when I asked about it at the closing press conference of the India trip, he was infused by a fresh enthusiasm for the plan, not evident at the Labour gathering in Liverpool in the days after he first unveiled it.  Below is what he said to me, transcribed in full. But as you read it, notice how the PM's explanation and justification for this scheme - which will be one of the biggest projects this government undertakes if it does happen - centres around convenience for citizens and makes no mention of the case originally used for it - to combat illegal migration. \n                  Politics latest: First group deportation of small boat migrants under UK-France deal\n                 \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  Less than half of Scots trust Scottish government to do right by country, report finds\n                 Politics latest - follow live Starmer told me: \"We did discuss [digital ID] yesterday. And in particular, the benefits that it has brought in India. \"We've obviously also looked at other countries - Estonia, for example. The speed with which it allows citizens here to access services, particularly financial services, is something that was recognised in our discussions yesterday and actually at the fintech discussion that we had today, as well. \"So, we're looking at those examples of how digital ID helps individuals, with the processes that sometimes take too long and are too cumbersome, and makes it easier for them.\"  The answer is clear: the prime minister now puts personal convenience as the top justification. While Starmer was locked in the Fintech summit, we visited Mumbai University to gauge opinion on digital ID, which has rolled out across India over the past 10 to 15 years. We asked students as they could traditionally have been thought to be one of the more cautious groups in society towards a project which involves state intrusion into the lives of individuals.  Among all the people that we talked to - and you can watch our video at the top of this page - there was a recognition of privacy concerns, worries about data leaks, and uncertainty about how some of the information might be used. But every single person we stopped and talked to about it was nevertheless enthusiastically in favour - and said it had made their lives simpler and more efficient. The net benefits of this scheme had landed with the Indian citizens we spoke to.  The engagement from Infosys is also significant after the boss of Palantir, a rival tech company, gave the idea of a UK digital ID scheme a comprehensive shellacking last week. For a moment, it looked like the corporate world might be pulling back from the scheme - so the engagement of a massive multinational corporation has come at just the right moment. None of which is to downplay the obstacles. Read moreThe film fighting back against 'cheap laughs' at Tourette's expenseOnly man to appeal Gisele Pelicot rape conviction handed longer sentence  In a bizarre move, the Home Office appears to have been allowed to swerve responsibility for the project, which has gone instead to Liz Kendall's Department of Science, Innovation and Technology (DSIT), which does not yet have any track record of major delivery. One DSIT aide said that the young average age of staff at the newly formed department is an advantage, a claim which seems somewhat doubtful. So, Whitehall may tie itself up in knots over this project. Or, it might turn out that India's cultural norms simply make it an easier place to roll out a scheme like this. But on the basis of our enquiries, there is the potential case for a scheme that can be sold to a willing public."
    },
    {
        "title": "I Swear: The film fighting back against abuse and 'cheap laughs' at Tourette's expense",
        "description": "When John Davidson was 10 years old, he experienced his first symptoms of Tourette syndrome - small facial tics and eye blinking.",
        "url": "https://news.sky.com/story/i-swear-the-film-fighting-back-against-abuse-and-cheap-laughs-at-tourettes-expense-13446397",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-i-swear-robert-aramayo_7039966.jpg?20251003112925",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "John Davidson is the only MBE recipient to have shouted \"F*** the Queen\" at the ceremony. He tells Bethany Minelle about living with a condition where your brain can be your own worst enemy.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  When John Davidson was 10 years old, he experienced his first symptoms of Tourette syndrome - small facial tics and eye blinking. By the time he was 13, the neurological condition was causing full-body movements so extreme he compares himself with the young heroine in horror film The Exorcist. John tells Sky News: \"There's a scene where the girl's on the bed and her whole body's twitching about and screaming. That's almost what it felt like. My tics became so extreme that I was hurting myself. I was pulling muscles. I was tired all the time. \"I would break down and cry so many times in a day because I was totally out of control. Something had completely taken over my mind and my body.\" Growing up in Galashiels in the Scottish Borders, John was repeatedly told his symptoms were in his head - or worse, intentional - when a chance meeting with a visiting junior doctor while in hospital led to a diagnosis. Largely unheard of in the 1980s, today, high-profile figures including Scottish musician Lewis Capaldi and US star Billie Eilish have publicly spoken about living with Tourette's. Affecting more than 300,000 people in Britain, it's more common than many think. One schoolchild in every hundred is estimated to be affected by the syndrome, according to NHS England. \n                  Tim Westwood charged with four counts of rape\n                 \n                  Dolly Parton says 'I ain't dead yet' after health fears triggered by singer's sister\n                 \n                  Robin Williams's daughter begs people to stop sending her AI videos of her father\n                 While severity can range, there is currently no cure. And while the University of Nottingham is working on a device which uses electrical pulses to suppress tic urges, the wristband - called Neupulse - is currently awaiting full medical approval. 'Medication turned me into a zombie' Treated with drugs as a child, John suffered devastating side-effects: \"Anti-psychotic medications turned me into a zombie. I've got probably about a two-year period in my teens where I have no real proper memories.\" Frustrated by the lack of support available to him growing up, John is now a Tourette syndrome campaigner, recognised for his work with an MBE. But even that came with challenges unique to his condition. At the 2019 ceremony at Holyrood Palace, when collecting his award, John shouted \"F*** the Queen\" at Elizabeth II. He says: \"It was horrific for me. It was like the last thing I ever wanted to have to shout. And I think that's the nature of the coprolalia, part of the condition, where it's the worst possible thing you could say in that situation.\" Affecting a minority of the Tourette's population, coprolalia is the involuntary utterance of socially inappropriate words or phrases. While less common, it's the feature of Tourette's most often portrayed in the media. John goes on: \"It came as much of a shock to me as to everyone else, you know? But I'm the one in the moment having to deal with those emotions and feelings of wanting the ground to swallow me up. [Thinking] I don't want to be here any more.\" 'Living with it is absolutely awful' Now, in a bid to tackle the stereotype, a film is being made about John's life based on his 2025 memoir, with Game Of Thrones star Robert Aramayo playing the lead role. No stranger to media exposure himself, John has appeared in numerous documentaries over the years, following on from the groundbreaking 1989 documentary about his life, John's Not Mad. But it hasn't always been a positive experience. John says: \"Every time they make a documentary, they make such a thing about the swearing part, which then stigmatises the condition because people are then left to assume that everyone with Tourette's swears and shouts obscenities.\" In reality, coprolalia is not typical of the condition and only affects around one in 10 people with Tourette's. John acknowledges there is a comedic element to this: \"When people think of uncontrollably swearing like that, it's funny. 'Oh my God', you know, 'shock, horror'. But for the one living with it, it's absolutely awful.\" 'Let's have sex!' It's a sentiment the film's director echoes. Kirk Jones first met John in 2022. Meeting him at his house to discuss the potential of making the film, John opened the door and, after inviting him in, shouted in his face: \"Let's have sex!\" His first introduction to John's verbal ticks, the director admits it was a \"steep learning curve\". He tells Sky News: \"There's something about Tourette's, which I don't think has made it a very friendly or accessible condition. I think that's down to the fact that people who have coprolalia come across as being aggressive or argumentative or difficult or upsetting people, and I think that's unfair. They need as much support as anyone else.\" The director says it took him some time to gain John's trust, showing he wanted to do more than just revisit tired stereotypes. He says: \"The Tourette's community had been kind of abused in the past. They've been invited to appear on TV shows or radio or be in newspaper articles, under the guise of helping people to understand Tourette's more. But what the TV channel or the radio show really wanted was just a cheap laugh. \"When I first met John and started talking about the idea of the film, he was understandably suspicious.\" Handing over some creative control, John is also an executive producer on the film. 'When you laugh, it breaks the ice' Now, at 54, and having lived with the condition for over 40 years, John believes people are becoming more tolerant of Tourette's, but would love to see further acceptance. \"It's about not being shocked. It's not about being dead serious with a straight face. Feel free to laugh, because when you laugh, it breaks the ice. \"I wish people had the confidence to approach people with Tourette's and just deal with it as if it was an everyday thing.\" The director, too, hopes the film will have a real-world impact and open people's eyes to the reality of the condition. He says: \"I hope this film can play a small part in starting to refocus people's attention on helping and supporting people rather than just laughing or mocking.\" I Swear is in UK and Irish cinemas from Friday 10 October. Anyone looking for support or information about Tourette syndrome can access resources at Tourettes Action or Tourette Scotland for those living in Scotland."
    },
    {
        "title": "Discord hack shows dangers of online age checks as internet policing hopes put to the test",
        "description": "Messaging platform Discord has said the official ID photos of around 70,000 users have been stolen by hackers.",
        "url": "https://news.sky.com/story/discord-hack-shows-dangers-of-online-age-checks-as-internet-policing-hopes-put-to-the-test-13447618",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-discord-app_7046939.jpg?20251009153940",
        "type": "UK",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "As the drive for age verification grows, so does the pressure on online companies to keep users' data safe and, as the Discord hack shows, that cannot be guaranteed. ",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n  Messaging platform Discord has said the official ID photos of around 70,000 users have been stolen by hackers. The app, which is popular with gamers and teenagers, said the hackers targeted a firm responsible for verifying the ages of its users. Discord said its own platform was not breached. The stolen data could include personal information, partial credit card numbers and messages with Discord's customer service agents, the firm said. No full credit card details, passwords or messages and activity beyond conversations with Discord customer support were leaked, it added. Discord said it had revoked the third-party service's access and was continuing to investigate. It said all affected users have been contacted. \"Looking ahead, we recommend impacted users stay alert when receiving messages or other communication that may seem suspicious,\" it said. Until recently, a hack like this could not have happened, because companies had no need to process and collect proofs of age. Now, so many governments are following the UK and introducing age verification for unsuitable or pornographic content that a company like Discord has to roll out age checks for a decent portion of its 200 million active users. It's a bit like the way that shops have to check your age if you're buying alcohol - only because it's online, it comes with a lot of additional complications. A shop, for instance, won't keep a copy of your passport once they've checked your age. And it definitely won't keep it in a massive (yet strangely light) safe along with thousands of other passport photocopies, stored right by its front door, ready to be taken. Online, it's surprisingly easy to do just that. Read more on Sky News:AI 'distorting women online'Pros and cons of digital IDsImpact of new online safety rules It's worth noting that the age verification system used by Discord wasn't hacked itself. That system asked people to take a photo of themselves, then used software to estimate their age. Once the check was complete, the image was immediately deleted. The problem came with the appeals part of the process, which was supplied to Discord by an as-yet-unnamed third party. If someone thought that the age verification system had wrongly barred them from Discord they could send in a picture of their ID to prove their age. This collection of images was hacked. As a result, Discord says, more than 70,000 IDs are now in the possession of hackers. (The hackers themselves claim that the number is much bigger - 2,185,151 photos. Discord says this is wrong and the hackers are simply trying to extort money. It's a messy situation.) There are ways to make age verification safer. Companies could stop storing photo ID, for instance (although then it would be impossible to know for sure if their checks were correct). And advocates of ID cards will point out that a proper government ID could avoid the need to send pictures of your passport simply to prove your age. You'd use your digital ID instead, which would stay safely on your device. But the best way to stop data being hacked is not to collect it in the first place. We're at the start of a defining test - can governments actually police the internet? Or will the measures that are supposed to make us safer actually end up making us less secure?"
    },
    {
        "title": "The King and Prince William step out together for rare joint environmental engagement",
        "description": "The King and the Prince of Wales have enjoyed a rare public night out together to mark the countdown to the COP30 climate conference in Brazil.",
        "url": "https://news.sky.com/story/king-and-prince-william-step-out-together-for-rare-joint-environmental-engagement-13447803",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-the-king-prince-of-wales_7047291.jpg?20251009222529",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-10-09 20:34:00",
        "Headline": "At an event in London, it was confirmed the Prince of Wales will attend the COP30 leaders' summit in Brazil on behalf of his father.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n The King and the Prince of Wales have enjoyed a rare public night out together to mark the countdown to the COP30 climate conference in Brazil. As the father and son arrived at London's Natural History Museum for the 'Countdown to COP30: mobilising action for climate and nature', it was confirmed that Prince William will attend the leaders' gathering in Belem on behalf of King Charles. William was already due to fly to Rio de Janeiro on 3 November for the Earthshot Awards. He will then travel to Belem on 6 November for the COP30 world leaders' summit. Historically, the King has delivered numerous keynote speeches at the UN Climate Crisis conference, both as Prince of Wales and monarch. Arriving together at the Natural History Museum, the two men - who share a passion for the environment - seemed in their element, with the event bringing together changemakers tackling climate change and nature loss. Speaking to Prince William, the deputy prime minister David Lammy and Ed Miliband, Secretary of State for Energy and Climate Change, appeared to be telling the prince how delighted they were that he was attending the climate conference in three weeks' time. William's global profile will be a significant boost for the UK's presence at the summit. \n                   Prince William 'cares deeply about tradition' but Earthshot Prize shows he's not afraid to modernise\n                 \n                  Those close to William say this is the most publicly vulnerable we have seen him\n                 \n                  Prince William hints at 'changes' to come when he is king\n                 Read more from Sky News:Princess of Wales: Phones creating 'epidemic of disconnection'Ex-Radio 1 DJ Tim Westwood charged with four counts of rape The King and William also met the Brazilian ambassador to the UK, Antonio de Aguiar Patriota, and minister of health, Alexandre Padilha, who were representing the COP30 host nation. At the end of the evening, William appeared to have waited to say goodbye to his father, as the King was happily deep in conversation with one of the attendees, but eventually, with an affectionate hand on the shoulder, William said his farewells."
    },
    {
        "title": "'The time is now to stop Reform' - Plaid Cymru calls on Labour voters to unite behind Welsh nationalists ",
        "description": "One party has held court over Welsh politics for more than a century.",
        "url": "https://news.sky.com/story/the-time-is-now-to-stop-reform-plaid-cymru-calls-on-labour-voters-to-unite-behind-welsh-nationalists-13447776",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rhun-ap-iorworth-plaid-cymru_6956369.jpg?20250703152550",
        "type": "UK",
        "Author": "Hannah Woodward, political news editor",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "Welsh politics has traditionally been dominated by Labour, but as Plaid Cymru begins its conference, it can sense the winds of change.",
        "Content": "By Hannah Woodward, political news editor  One party has held court over Welsh politics for more than a century. Welsh Labour MPs have been the largest group sent to Westminster in every general election since 1922 - and the party has been in government in the country for more than a quarter of a century. But if the polls are accurate, Labour's long-standing grip on politics in Wales is fading. Politics latest - follow live Plaid Cymru and Reform UK are running almost neck and neck, while Labour trails significantly. A recent YouGov poll put Plaid Cymru on 30%, Reform UK on 29% and Labour at 14%. Plaid Cymru, heading into its conference this weekend, can sense the mood for change in Wales - and intends to show it is ready for government. The party hopes to capitalise on disillusioned Labour voters feeling let down by their party under Sir Keir Starmer, and use this to tackle the rise of Reform - which is key to getting it into power. \n                  Two admit rioting after deaths of boys in e-bike crash in Cardiff\n                 \n                  Charlene Hobbs: Renewed appeal to find missing mum a year on from her last sighting\n                 \n                  Former Conservative MP Katie Wallis appears in court accused of having false passport\n                 In his leader's speech, Rhun ap Iorwerth is expected to position Plaid Cymru as Wales's progressive force, and the only party capable of taking on Reform. He will say: \"We're not here to act as Labour's conscience. We are not here to repair Labour. We are here to replace them. \"If you've never voted for Plaid Cymru before, the time is now. \"The time is now to stop Reform and elect a government more radical, more ambitious, more impatient to bring about positive change than any which has gone before it. A government of progress and of progressive values.\" One in five Labour voters in Wales intend to back Plaid Cymru at the Senedd elections in 2026, according to YouGov. But almost a quarter of Labour voters remain undecided on who to endorse. The topic of independence will no doubt be a contentious issue for voters who are angry about decisions made by Labour in Wales and Westminster, but do not want an independent Wales. Mr ap Iorwerth has ruled out an independence referendum if Plaid Cymru wins next year's elections, signalling that he doesn't want the campaign to centre on independence. Throughout the conference, Plaid Cymru will position itself as ready to govern. But voters will expect clear plans for the NHS, education, and the economy. The question for the party, both during this conference and over the coming months, will be whether its proposals can win over Labour voters in its quest to beat Reform. But Plaid Cymru's challenge to Nigel Farage's party faces a critical test sooner than May. Instead, its next battle will be in the Caerphilly Senedd by-election on 23 October. Historically a Labour stronghold at both Senedd and Westminster levels, Caerphilly has consistently returned Labour representatives, with Plaid Cymru as the main opposition at Senedd elections.  However, this election introduces a new dynamic, as Reform has emerged as a credible challenger, poised to disrupt the traditional two-party contest. Coming second at this election won't be a total loss for Plaid Cymru. If it can come second at the by-election, it will prove the point Mr ap Iorwerth will be making at the conference in Swansea: that his party is the only credible anti-Reform vote. The full list of candidates standing at the Caerphilly by-election: Labour - Richard Tunnicliffe Plaid Cymru - Lindsay Whittle Reform UK - Llŷr Powell Conservative - Gareth Potter Green Party - Gareth Hughes Gwlad - Anthony Cook UKIP - Roger Quilliam Liberal Democrats - Steve Aicheler"
    },
    {
        "title": "How two years of war have shattered the Gaza Strip",
        "description": "As a possible ceasefire takes shape, Palestinians face the prospect of rebuilding their shattered enclave.",
        "url": "https://news.sky.com/story/how-two-years-of-war-have-shattered-the-gaza-strip-13447628",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dxf-teaser-gaza_7047004.jpg?20251009164513",
        "type": "World",
        "Author": "Ben van der Merwe, Kate Schneider and Sophia Massam, Data &amp; Forensics Unit",
        "Date Published": "2025-10-09 14:42:00",
        "Headline": "One in 10 Palestinians in Gaza has been killed or injured since the war began, and 92% of homes have been destroyed.",
        "Content": "By Ben van der Merwe, Kate Schneider and Sophia Massam, Data & Forensics Unit   As a possible ceasefire takes shape, Palestinians face the prospect of rebuilding their shattered enclave. At least 67,194 people have been killed, according to Gaza's Hamas-run health ministry, the majority of them (53%) women, children and elderly people. The war has left 4,900 people with permanent disabilities, including amputations, and has orphaned 58,556 children. Altogether, one in 10 Palestinians has been killed or injured since the war began following Hamas's October 7, 2023 attack on southern Israel. The attack killed 1,195 people, including 725 civilians, according to Israeli officials. The IDF says that a further 466 Israeli soldiers have been killed during the subsequent conflict in Gaza.  Swathes of Gaza have been reduced to rubble More than 90% of Palestinians in Gaza have been displaced, many of them multiple times, following Israeli evacuation orders that now cover 85% of the Gaza Strip. Few of them will have homes to return to, with aid groups estimating that 92% of homes have been destroyed. \"Despite our happiness, we cannot help but think of what is to come,\" says Mohammad Al-Farra, in Khan Younis. \"The areas we are going back to, or intending to return to, are uninhabitable.\" The destruction of Gaza is visible from space. The satellite images below show the city of Rafah, which has been almost totally razed over the past two years. In just the first ten days of the war, 4% of buildings in Gaza were damaged or destroyed. By May 2024 - seven months later - more than 50% of buildings had been damaged or destroyed. At the start of this month, it rose to 60% of buildings. A joint report from the UN, EU and World Bank estimated that it would take years of rebuilding and more than $53 billion to repair the damage from the first year of war alone. A surge in aid Central to the promise of the ceasefire deal is that Israel will allow a surge of humanitarian aid to enter the Gaza Strip. The widespread destruction of homes has left 1.5 million Palestinians in need of emergency shelter items. Many of these people are living in crowded tent camps along Gaza's coast. That includes Al Mawasi, a sandy strip of coastline and agricultural land that Israel has designated a \"humanitarian zone\". Aid agencies report that families are being charged rent of up to 600 shekels (£138) for tent space, and over $2,000 (£1,500) for tents. Israel has forbidden the entry of construction equipment since the war began and has periodically blocked the import of tents and tent poles. Restrictions on the entry of food aid have created a famine in Gaza City, and mass hunger throughout the rest of the territory. Data from Israeli border officials shows that the amount of food entering Gaza has frequently been below the \"bare minimum\" that the UN's famine-review agency says is necessary to meet basic needs. As a result, the number of deaths from malnutrition has skyrocketed in recent months. To date, Gaza's health ministry says, 461 people have died from malnutrition, including 157 children. \"Will Netanyahu abide this time?\" As talks of a ceasefire progressed, the Israeli assault on Gaza City continued. Footage shared on Tuesday, the two-year anniversary of the war, showed smoke rising over the city following an airstrike. A video posted on Wednesday, verified by Sky News, showed an Israeli tank destroying a building in the city's northern suburbs. Uncertainty still remains over the future of Gaza, with neither Israel nor Hamas agreeing in full to the peace plan presented by US president Donald Trump. So far, only the first stage has been agreed. A previous ceasefire, agreed in January, collapsed after Israel refused to progress to the agreement's second stage. With that in mind, many in Gaza are cautious about their hopes for the future. \"Maybe we trust Trump, but will Netanyahu abide this time?,\" asks Aya, a 31-year old displaced Palestinian in Deir al Balah. \"He has always sabotaged everything and continued the war. I hope he ends it now.\" Additional reporting by Sam Doak, OSINT producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "All the hostages believed to be alive and who are due for release",
        "description": "As Israel and Hamas finally strike a deal aimed at bringing an end to the war in Gaza, we take a look at the hostages still believed to be alive and who are set to return home any day now.",
        "url": "https://news.sky.com/story/all-the-hostages-believed-to-be-alive-and-who-are-due-for-release-13447520",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-israel-gaza-hostages_7047035.png?20251009171619",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-09 11:35:00",
        "Headline": "No subtitle found",
        "Content": "As Israel and Hamas finally strike a deal aimed at bringing an end to the war in Gaza, we take a look at the hostages still believed to be alive and who are set to return home any day now. Israel says that of the 250 initially taken captive in Hamas's 7 October attack, 20 of the hostages that remain in Gaza are thought to be alive and 28 are dead. As part of the first phase of the peace deal brokered by US President Donald Trump, some hostages will be released and Israeli soldiers will start withdrawing from Gaza. On Thursday, Israel said the deal had been signed and the ceasefire would go into force within 24 hours of a cabinet meeting. After that period, the hostages in Gaza will be freed within 72 hours, an Israeli government spokeswoman said. Here are the hostages believed to be alive and who could soon be returning home after two years of captivity in the besieged enclave of Gaza:"
    },
    {
        "title": "Trump's Gaza deal may not go down well with everyone - but for now, it's a beacon of optimism",
        "description": "When the peace deal came, it came quickly.",
        "url": "https://news.sky.com/story/trumps-gaza-deal-may-not-go-down-well-with-everyone-but-for-now-its-a-beacon-of-optimism-13447291",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-einav-zangauker-matan-zangauker_7046386.jpg?20251009041153",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-10-09 00:51:00",
        "Headline": "Shortly before midnight on Wednesday, the US president said Israel and Hamas had agreed to the first phase of his peace deal. Does it cover everything? Absolutely not, but these talks have always been fuelled by optimism.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  When the peace deal came, it came quickly. Rumours had been spreading over the course of the day, anticipation grew. A source told me that a deal would be done by Friday, another said perhaps by Thursday evening. Israel and Hamas agree to peace deal - live updates They were both wrong. Instead, it came much sooner, announced by Donald Trump on his own social media channel. Without being anywhere near the talks in Egypt, the president was the dominant figure. Few will argue that he deserves the credit for driving this agreement. We can probably see the origins of all this in Israel's decision to try to kill the Hamas leadership in Doha. The attack failed, and the White House was annoyed.  Arab states started to express themselves to Trump more successfully, arguing that it was time for him to rein in Benjamin Netanyahu and bring an end to the war. They repeated the call at a meeting during the UN General Assembly, which seems to have landed. When the president later met Netanyahu, the 20-point plan was born, which led to this fresh peace agreement. Does it cover everything? Absolutely not. We don't know who will run Gaza in the future, for a start, which is a pretty yawning hole when you consider that Gaza's fresh start is imminent. We don't know what will happen to Hamas, or to its weapons, or really how Israel will withdraw from the Strip. But these talks have always been fuelled by optimism, and by the sense that if you could stop the fighting and get the hostages home, then everything else might just fall into place. In order to agree to this, Hamas must surely have been given strong assurances that, even at some level, its demands for Palestinian self-determination would bear fruit. Otherwise, why would the group have given up their one trump card - the 48 hostages? Once they have gone, Hamas has no leverage at all. It has precious few friends among the countries sitting around the negotiating table, and it is a massively depleted fighting force. So to give up that power, I can only assume that Khalil al-Hayya, the de facto Hamas leader, got a cast-iron guarantee of... something. Arab states will greet this agreement with joy. Some of that is to do with empathy for the Palestinians in Gaza, where 67,000 people have been killed and more than 10% of the population has become a casualty of war. But they will also welcome a path to stability, where there is less fear of spillover from the Gaza conflict and more confidence about the region's economic and political unity. Trump's worldview - that everything comes down to business and deal-making - is welcomed by some of these leaders as a smart way of seeing diplomacy. Jared Kushner has plenty of friends among these nations, and his input was important. Read more about 7 October:'It is trauma': Two lives torn apart'Instead of getting married, they got buried together'  For many Israelis, this comes down to a few crucial things. Firstly, the hostages are coming home. It is hard to overstate just how embedded that cause is to Israeli society. The return of all 48, living and dead, will be a truly profound moment for this nation. Secondly, their soldiers will no longer be fighting a war that, even within the higher echelons of the military, is believed to be drifting and purposeless. Thirdly, there is growing empathy for the plight of the Gazans, which is tied to a fourth point - a realisation that Israel's reputation on the world stage has been desperately tarnished. Some will object to this deal and say that it is too weak; that it lets Hamas off the hook and fails to punish them for the atrocities of 7 October. It is an accusation that will be levelled by far-right members of Netanyahu's coalition government. It could even collapse the administration. But for most people, in Israel, Gaza, across the Middle East and around the world, it is a moment of relief. Last week, I was in Gaza, and the destruction was absolutely devastating to witness. Whatever the compromises, the idea that the war has stopped is, for the moment at least, a beacon of optimism."
    },
    {
        "title": "'Uncertainty really matters': Sky News investigates new AI test at sea",
        "description": "A new generation of artificial intelligence that provides a \"confidence rating\" of its answers could make algorithms more trustworthy and speed their rollout in safety-critical situations.",
        "url": "https://news.sky.com/story/uncertainty-really-matters-sky-news-investigates-new-ai-test-at-sea-13443514",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sea-saling-at-sea-ai_7038183.jpg?20251001141441",
        "type": "World",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "Scientists developing the technology called \"uncertainty-aware AI\" say it removes the risk of hallucinations - fictitious answers created by computer algorithms when they have incomplete or conflicting data.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A new generation of artificial intelligence that provides a \"confidence rating\" of its answers could make algorithms more trustworthy and speed their rollout in safety-critical situations. Scientists developing the technology called \"uncertainty-aware AI\" say it removes the risk of hallucinations - fictitious answers created by computer algorithms when they have incomplete or conflicting data. The new AI assistant would instead provide its best assessment of a situation when faced with patchy evidence, but confirm that it wasn't sure. A human operator would then be able to judge how much weight to put on the answer and seek additional information where necessary. The start-up digiLab, which devised the AI assistant called the Uncertainty Engine, is already collaborating with a major manufacturer in the design of a new generation of small-scale nuclear reactors that are likely to be placed closer to people's houses in future. It helps engineers accelerate development without taking risks. Read more about AI:How most people are using ChatGPTMeet Diella: Albania's AI-generated 'minister' Tim Dodwell, company founder, told Sky News: \"As we adopt AI in situations that are going to [be] transformative, like energy, maritime safety and healthcare, uncertainty really matters. \"I see no real future for AI unless we answer another problem: can we trust it? Human lives are at stake and people have to take responsibility for what the algorithms will do.\" Sky News was invited to join a team testing the Uncertainty Engine out at sea, where they believe it could be a game-changer for complex maritime route planning. The AI assistant is being used on a high-performance sailing yacht to help plot the fastest or safest route. It can't currently be used in races, but it is helping the Next Step Racing team prepare and understand how to extract even more power from the boat. Joss Creswell, co-skipper, said offshore racing, like Formula One, is all about small margins - and AI can help crunch a mass of data. \"There's a lot, a lot of information coming to the screen,\" he said. \"You've got information about the wind, the sea state, the boat's performance, as well as the position of other boats you're racing against. \"Quantifying that and reducing it to something that we understand and then react to is really difficult, so it's really useful to use AI for that. \"It can give you insights into the changes you can make to give you an advantage over the competition.\" Read more from Thomas Moore:AI model could predict disease risk a decade before symptomsCould refreezing the Arctic actually work?Mars 'leopard spots' clearest sign life once existed there Mr Dodwell said the AI assistant could also reduce fuel costs and carbon dioxide emissions of enormous oil tankers and cargo vessels by giving the crew advice on the most efficient route. \"Over a long journey, like Australia to Southampton, there's uncertainty about what the wind and sea conditions will be. \"What we really want is for AI to look at options for the different routes we can take and capture uncertainty in those weather conditions \"It can also capture uncertainty in shipping lanes - for example, if the Suez Canal was closed. \"By doing this intelligently, a 1-5% saving could mean huge benefits to efficiency overall.\" Mr Dodwell added that saving 5% in fuel consumption would reduce carbon emissions from the UK shipping industry by 600,000 tonnes a year, equivalent to taking 300,000 cars off the road."
    },
    {
        "title": "Only man to appeal Gisele Pelicot rape conviction handed longer sentence",
        "description": "A French appeals court has handed a longer 10-year sentence to the only man to challenge his conviction for raping Gisele Pelicot while she was drugged and unconscious.",
        "url": "https://news.sky.com/story/only-man-to-appeal-pelicot-rape-conviction-handed-longer-sentence-13447664",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-husamettin-dogan-pelicot_7047098.jpg?20251009181920",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-09 15:52:00",
        "Headline": "Husamettin Dogan was the only man among the 51 convicted of abusing Gisele Pelicot who appealed. His sentence was increased from nine to ten years.",
        "Content": "A French appeals court has handed a longer 10-year sentence to the only man to challenge his conviction for raping Gisele Pelicot while she was drugged and unconscious. Construction worker Husamettin Dogan, 44, was the only one of 51 men convicted last December in the harrowing mass rape trial to appeal against his verdict.  The trial was covered around the world and turned Ms Pelicot into a global icon after she opposed a closed hearing - a demand made by several defendants. The court sided with her. Those convicted included Dominique Pelicot, Ms Pelicot's ex-husband, who knocked her unconscious by lacing her food and drink with drugs before offering her to strangers he met online between 2011 and 2020, filming their assaults. Dogan had been sentenced to nine years in prison in the initial trial. He was tried on charges of aggravated rape by administering substances that impair judgement or self-control, which could have been punished by up to 20 years in prison. The prosecutor in the appeal case in Nimes, southern France, asked for a 12-year sentence, French media reported. \"One cannot, in 2025, think that because she said nothing, that she agreed. Because that kind of thinking belongs to another era!\" the prosecutor told the court, according to Le Monde newspaper. Read more from Sky News:Tim Westwood charged with four counts of rapeCould Trump win the Nobel Peace Prize? Dogan had denied he intended to rape Ms Pelicot and claimed he was deceived by her husband. Dominique Pelicot was found guilty on all charges and sentenced to the maximum 20 years in prison after admitting his role. He did not appeal. Husband filmed assaults Sentences for the other convicted men, who were found guilty of rape, attempted rape or sexual assault, ranged from three to 15 years in prison. One of them was also convicted of drugging and raping his own wife with Dominique Pelicot's help. Evidence presented at the trial included horrific videos of rapes and assaults Dominique Pelicot filmed in the couple's home in the small Provence town of Mazan and elsewhere. In November, civil proceedings in the southern French city of Avignon are due to settle damages owed to Ms Pelicot and her family, to be paid jointly by the convicted men. Ms Pelicot has become a symbol of the fight against sexual violence, and the case has spurred a national reckoning over rape culture in France."
    },
    {
        "title": "Police thwart suspected plot to attack Belgium's prime minister",
        "description": "Three men have been arrested in Belgium over a suspected plot to attack the country's politicians, including Prime Minister Bart De Wever.",
        "url": "https://news.sky.com/story/police-thwart-suspected-plot-to-attack-belgiums-prime-minister-13447781",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-police-antwerp-belgium_7047226.jpg?20251009212731",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-09 19:57:00",
        "Headline": "Belgian prosecutors said there are indications the intention was to carry out an alleged \"jihadist-inspired terrorist attack\" targeting politicians.",
        "Content": "Three men have been arrested in Belgium over a suspected plot to attack the country's politicians, including Prime Minister Bart De Wever. The suspects were not identified, but were described as \"young adults,\" born in 2001, 2002 and 2007, and all three lived in the city of Antwerp. As of Thursday evening, two suspects were still being questioned by Antwerp police, and were due to appear before the investigating judge on Friday. Police said the third suspect was released. Federal prosecutors said they were taken into custody after an anti-terrorism judge ordered searches of their homes in the city by police officers backed by explosive sniffer dogs. They said in a statement that the raids were \"part of an investigation into, among other things, attempted terrorist murder and participation in the activities of a terrorist group\". \"There are indications that the intention was to carry out a jihadist-inspired terrorist attack targeting politicians,\" they added, without naming the individuals who might have been targeted as part of the suspected plot. \n                  Belgium announces it will recognise Palestinian state\n                 \n                  Tomorrowland: 'Devastating' blaze destroys main stage at major festival - two days before it was due to begin\n                 \n                  Three Belgian soldiers injured in 'shooting incident' during training exercise in Scotland\n                 But in a post on social media, Belgian foreign minister and deputy prime minister Maxime Prevot said the attack allegedly planned to target Prime Minister Bart De Wever - a former mayor of Antwerp who lives in the city. He said it was \"deeply shocking,\" adding his thanks to security and justice services for their \"rapid action\". Read more from Sky News:How two years of war have shattered the Gaza StripGaza peace plan: What has been agreed? Prosecutors said police found \"an improvised device\" that was not operational at the time in one of the suspects' houses. A bag of steel balls was also found during search, and a 3D printer believed to be used to make parts for the alleged planned attack was found at another residence. \"There are also indications that the intention was to build a drone to attach a load,\" the prosecutors added."
    },
    {
        "title": "Putin admits Russia shot down Azerbaijani passenger jet, killing 38",
        "description": "Vladimir Putin has admitted Russia's air defences were responsible for shooting down an Azerbaijani passenger jet in December, killing 38 people.",
        "url": "https://news.sky.com/story/putin-admits-russia-shot-down-azerbaijani-passenger-jet-killing-38-13447588",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vladimir-putin-russia_7046927.jpg?20251009152634",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-09 13:35:00",
        "Headline": "The Russian president said missiles fired by Russian air defences to target a Ukrainian drone detonated near the Azerbaijan Airlines plane on 25 December last year.",
        "Content": "Vladimir Putin has admitted Russia's air defences were responsible for shooting down an Azerbaijani passenger jet in December, killing 38 people. The Russian president said missiles fired by Russian air defences to target a Ukrainian drone detonated near the Azerbaijani Airlines plane, which was flying from Baku, as it prepared to land in Grozny, the regional capital of the Russian republic of Chechnya, on Christmas day last year. \"The two missiles that were launched did not hit the plane directly; if that had happened, it would have crashed on the spot, but they exploded, perhaps as a self-destruction measure, a few metres away, about 10m,\" Mr Putin said. \"And so the damage was caused, mainly not by the warheads, but most likely by the debris from the missiles themselves. That is why the pilot perceived it as a collision with a flock of birds, which he reported to Russian air traffic controllers, and all this is recorded in the so-called 'black boxes'.\"  Speaking at a meeting with Azerbaijan's President Ilham Aliyev in Tajikistan's capital, Dushanbe, Mr Putin pledged to punish those responsible and compensate the victims. \"It is our duty,\" he said, \"to give an objective assessment of everything that happened and to identify the true causes.\" Mr Putin warned it would \"probably take some more time\" to fully investigate the cause of the crash. Read more from Sky News:Could Trump win the Nobel Peace Prize?Sky News joins NATO air patrol designed to deter Russia Azerbaijani authorities had said the jet was accidentally hit by fire from Russian air defences. It then tried to land in western Kazakhstan, where it crashed, killing 38 of the 67 people on board. Days later, Mr Putin apologised to Mr Aliyev for what he called a \"tragic accident\", but stopped short of taking responsibility. Mr Aliyev criticised Moscow for trying to \"hush up\" the incident. But on Thursday, he thanked Mr Putin for personally monitoring the progress of the investigation. \"I would like to express my gratitude once again for the fact that you deemed it necessary to highlight this issue at our meeting,\" Mr Aliyev told Mr Putin. It is the second deadly aviation incident linked to the Kremlin's conflict in Ukraine, after Malaysia Airlines Flight 17 was shot down by a Russian missile in 2014, killing all 298 people aboard."
    },
    {
        "title": "China tightens control of global rare-earth supply chain ahead of Trump talks",
        "description": "China has toughened its rules on the export of rare earths, crucial materials for many modern technologies from smartphones to fighter jets.",
        "url": "https://news.sky.com/story/china-unveils-sweeping-controls-on-rare-earth-exports-before-trump-talks-13447386",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-rare-earth-mine_7046594.jpg?20251009102952",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-09 08:18:00",
        "Headline": "The controls on rare earth materials used in phones and defence give Chinese President Xi Jinping more leverage in upcoming talks with US President Donald Trump. They include a measure that mimics a US restriction on exports of chip-related products to China.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n China has toughened its rules on the export of rare earths, crucial materials for many modern technologies from smartphones to fighter jets. The move strengthens Beijing's hand ahead of talks expected later this month between China's President Xi Jinping and his US counterpart Donald Trump. China's Ministry of Commerce on Thursday announced tighter restrictions on exports of processing technology and hinted at limits on exports to foreign arms manufacturers and some semiconductor firms. It follows calls in the US for stricter bans on exports of chip-making equipment to China, and mimics a measure Washington has used to restrict exports of semiconductor-related products to China. \"From a geostrategic perspective, this helps with increasing leverage for Beijing ahead of the anticipated Trump-Xi summit in (South) Korea later this month,\" said Tim Zhang, founder of Singapore-based Edge Research. The rules give China more control over the global rare-earth supply chain - a major sticking point in recent lengthy trade negotiations with Washington. China's rare earth dominance \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 \n                  'Disappointed': Starmer blames Tories for China spy trial being dropped\n                 China accounts for nearly 70% of the world's rare earths mining and controls roughly 90% of global rare earths processing. The 17 rare earth elements are used in products across society, including electric vehicles and military radars. China's dominance has given it a cutting edge over the clean technologies of the future, including electric vehicles and wind turbines.  In April, it announced sweeping controls in retaliation for tariffs imposed by the Trump administration, which caused worldwide shortages until a series of deals with Europe and the US somewhat eased the crunch. Under the new rules coming into effect in December, foreign companies will have to get special approval to export items that contain even small traces of rare earths elements sourced from China. Permits will also be required for exports of any technology related to rare earth mining, smelting, recycling and magnet-making - though it's not yet clear how China would enforce these policies overseas. The new restrictions are to \"better safeguard national security\" and to stop uses in \"sensitive fields such as the military\", the Commerce Ministry said. It said some \"overseas bodies and individuals\" had transferred rare earths elements and technologies from China abroad for defence or other sensitive uses, which caused \"significant damage\" to its national security. \"Rare earths will continue to be a key part of negotiations for Washington and Beijing,\" said George Chen, a partner at The Asia Group. \"Both sides want more stability, but there will be still a lot of noises before the two leaders, President Trump and Xi, can make a final deal next year when they meet. Those noises are all negotiation tactics.\" Warning solar panel prices will rise Last week, analysts warned the cost of solar panels was about to jump by 9% after the Chinese government cancelled a VAT rebate on exports - combined with cuts to supply side production and restrictions on polysilicon production. China makes more than 80% of the world's solar modules and in doing so has driven down costs globally. \"With no possibility of alternative supply in the short term, developers will have little choice but to absorb these higher costs,\" said Yana Hryshko from Wood Mackenzie, which produced the research. \"For developers globally, it means adjusting procurement expectations. And for policymakers, it's a timely reminder of the risks inherent in concentrated supply chains.\""
    },
    {
        "title": "The pulse of a city on edge - hundreds protest Trump's plan to deploy troops in Chicago",
        "description": "The sun went down and the volume went up.",
        "url": "https://news.sky.com/story/the-pulse-of-a-city-on-edge-hundreds-protest-trumps-plan-to-deploy-troops-in-chicago-13447337",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-chicago-protest_7046469.jpg?20251009080514",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-10-09 06:02:00",
        "Headline": "Hundreds of National Guard troops have set up camp at an army training centre on the outskirts of Chicago. Their presence drew a diverse crowd of protesters to the city centre - their faces lit by phone screens, voices raised and fists raised in defiance.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  The sun went down and the volume went up. In the shadow of Chicago's high-rise skyline, downtown streets reverberated with protest. \"Ain't no power like the power of the people, and the power of the people don't stop,\" they chanted. The president's plan to deploy troops in the city brought hundreds to the streets in opposition. They marched the full length of Michigan Avenue, flanked by a line of Chicago police officers. This is a city on edge, the federal government taking on the state, both braced for a showdown. Among the people I spoke to, there was no surprise about Donald Trump's threat to invoke the Insurrection Act, just outrage. \n                  Man arrested over deadly Pacific Palisades fire in California\n                 \n                  Trump says Illinois governor and Chicago mayor should be jailed, as National Guard deployed\n                 \n                  What is the Insurrection Act which Trump keeps threatening to use?\n                 Asked why he had joined the protest, a Vietnam veteran pointed to the word 'Trump' blazing in bright lights from a nearby hotel. \"That idiot right there, that's why,\" he said. Read more: What is the Insurrection Act? His message to the president: \"Get the hell out of the White House, or we will put you out of it.\" \"I'm on this march because I'm concerned the US is slipping away from democracy to authoritarianism,\" another man told me. One older woman said she was marching for her daughters and granddaughters, \"because there isn't going to be an America for them\". \"I don't think he [Donald Trump] listens to anybody,\" she added, \"but doing nothing is not going to do anything so we got to do something.\" A young African American woman told me she felt compelled to march because immigration agents \"taking people from their families just isn't right\". Shades of orange and pink reflected off the glass skyscrapers, casting long shadows on the streets where the threat of troop deployment looms. More from Sky News:'I ain't dead yet,' says Dolly PartonIs another spectacular Bitcoin comedown inevitable? Hundreds of National Guard troops from Texas have set up camp at Elwood, an army training centre on the outskirts of Chicago. Their presence drew a diverse crowd of protesters to the city centre - their faces lit by phone screens, voices raised and fists raised in defiance. \"No ICE, no fear,\" they chanted, telling Immigration Customs Enforcement agents to leave Chicago. \"Immigrants are welcome here,\" they repeated on cue from those wielding megaphones. It was much more than the noise of protest. This was the pulse of a city fighting back. A restless city, charged with tension, refusing to be silent."
    },
    {
        "title": "Customers of five water firms are facing higher than expected hikes to bills",
        "description": "Customers of five water firms are facing higher than expected rises to their inflation-busting bills after the companies disputed limits imposed by the industry regulator.",
        "url": "https://news.sky.com/story/customers-of-five-water-firms-are-facing-higher-than-expected-hikes-to-bills-13447341",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-water-bill-bills_6911000.jpg?20250509123621",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-10-09 06:08:00",
        "Headline": "While most claims for extra cash were found to be unjustified, rises to bills on top of what Ofwat has allowed look set to be granted at each company",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Customers of five water firms are facing higher than expected rises to their inflation-busting bills after the companies disputed limits imposed by the industry regulator. The Competition and Markets Authority (CMA) was called in to review Ofwat's determinations on what Anglian Water, Northumbrian Water, South East Water, Southern Water, and Wessex Water could charge customers from 2025-30. The CMA's panel said on Thursday: \"The group has provisionally decided to allow 21% - an additional £556m in revenue - of the total £2.7bn the five firms requested. \"This extra funding is expected to result in an average increase of 3% in bills for customers of the disputing companies, which is in addition to the 24% increase for customers of these companies expected as part of Ofwat's original determination.\" Money latest: The generation that hates their job the most The decision showed that Wessex household and business customers faced the largest increase - on top of the rise agreed by Ofwat - of 5%, leaving their average annual bills at £622. South East and Southern customers will see rises of 4% and 3% respectively while Anglian and Northumbrian's are set to soak up the lowest percentage increase of just 1%. \n                  Steel tycoon Gupta fires new legal salvo in battle to save crumbling empire\n                 \n                  Post Office scandal compensation shake-up and new redress body revealed\n                 \n                  Private equity backers call time on bar chain The Alchemist\n                 South East had sought the biggest increase - 18% on top of the 18% hike it had been granted over the five-year period.  The companies exercised their right to an appeal after Ofwat released its final determinations on what they could charge at the end of last year. They essentially argued that they could not meet their regulatory requirements under the controls amid a rush to bolster crucial infrastructure including storm drains, water pipelines and storage capacity. Crisis-hit Thames Water was initially among them but it later withdrew its objection pending the outcome of ongoing efforts to secure its financial future through a change of ownership.  Chair of the CMA's independent panel, Kirstin Baker, said: \"We've found that water companies' requests for significant bill increases, on top of those allowed by Ofwat, are largely unjustified. \"We understand the real pressure on household budgets and have worked to keep increases to a minimum, while still ensuring there is funding to deliver essential improvements at reasonable cost.\" Ofwat, which has faced industry criticism in the past for an emphasis on keeping bills low at the expense of investment, is set to be replaced by a new super regulator under plans confirmed in the summer. It has faced outrage on many fronts, especially over sewage spills, and allowing rewards for failure.   A spokesperson for the industry lobby group Water UK said: \"The Competition and Markets Authority's findings are provisional and water companies will need time to understand the detail in full. \"If these decisions stand, the CMA has restored more than half a billion pounds in funding. This overturns the limits set by Ofwat for how much five companies can invest in their infrastructure. This process has unfortunately been necessary to secure the investment our economy and environment need. \"As the CMA acknowledges, the system requires urgent reform. The government has said it will abolish Ofwat and set up a new regulator. The country needs that to happen as soon as possible.\" Water Minister Emma Hardy said in response to the CMA's decision: \"I understand the public's anger over bill rises - that's why I expect every water company to offer proper support to anyone struggling to pay. \"We've made sure that investment cash goes into infrastructure upgrades, not bonuses, and we're creating a tough new regulator to clean up our waterways and restore trust in the system. \"We are laser focused on helping ease the cost of living pressure on households: we've frozen fuel duty, raised the minimum wage and pensions and brought down mortgage rates - putting more money in people's pockets.\""
    },
    {
        "title": "Steel tycoon Gupta fires new legal salvo in battle to save crumbling empire",
        "description": "The metals tycoon Sanjeev Gupta has opened a new front in the battle to save his crumbling business empire with a legal claim asserting his ownership of a $3bn Australian steel producer.",
        "url": "https://news.sky.com/story/steel-tycoon-gupta-fires-new-legal-salvo-in-battle-to-save-crumbling-empire-13447432",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sanjeev-gupta-liberty-steel_6922076.jpg?20250520105107",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-09 09:14:00",
        "Headline": "The Liberty Steel owner has seen his main UK asset collapse and now faces a legal battle to preserve control of his stake in Australian company, InfraBuild, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The metals tycoon Sanjeev Gupta has opened a new front in the battle to save his crumbling business empire with a legal claim asserting his ownership of a $3bn Australian steel producer. Sky News understands that Mr Gupta's GFG Alliance holding company has filed a claim in the High Court disputing a claim over its shares in InfraBuild which has been made by the administrators to Greensill, the collapsed finance group. Mr Gupta's claim, which was filed in the second half of September, escalates his battle to retain ownership of his equity in InfraBuild, which is worth billions of pounds. Money latest: The generation that hates their job the most It comes weeks after the tycoon lost control of Speciality Steels UK, part of his Liberty Steel subsidiary. SSUK, Britain's third-biggest steel producer, collapsed into compulsory liquidation, with a sale process now being orchestrated by the government. Some of Mr Gupta's other assets, including in Europe, are also the subject of ongoing legal disputes. \n                  Customers of five water firms are facing higher than expected hikes to bills\n                 \n                  Post Office scandal compensation shake-up and new redress body revealed\n                 \n                  Private equity backers call time on bar chain The Alchemist\n                 A GFG Alliance spokesperson said: \"GFG Alliance has initiated legal proceedings in relation to Greensill's disputed security claim over the shares of its Australian steel business, InfraBuild. \"The disputed security, dating back to 2021, has no legal foundation. \"It was conditional on Greensill securing insurance and advancing substantial new funding - neither of which ever materialised. \"As a result, the security remains unperfected and without consideration.\" He added that GFG was now seeking a \"declaration from the UK court to confirm that the security is invalid\". \"While proceedings are ongoing, GFG seeks to negotiate a comprehensive settlement in the interests of all stakeholders.\" UBS Asset Management, one of Greensill's largest creditors, is also named as a defendant on the claim form. Grant Thornton, the accountancy firm which is handling Greensill's long-running insolvency process, is said to have filed a separate action in Australia to assert its security over the InfraBuild stake. A spokesperson for the joint administrators of Greensill Capital UK Ltd said: \"The joint administrators of Greensill Capital UK Ltd firmly believe the action lacks merit and will be responding appropriately where necessary.\" In August, Sky News revealed that officials from the Australian Securities & Investment Commission (ASIC) had served Mr Gupta's Liberty Steel group with a new demand for information about its activities. Sources said the regulator had taken possession of a mobile phone belonging to Mr Gupta as part of its probe."
    },
    {
        "title": "Post Office scandal compensation shake-up and new redress body revealed",
        "description": "Post Office IT scandal compensation schemes are to be improved and victims' legal advice to be funded , according to the government which may create an independent body to handle similar miscarriages of justice in future.",
        "url": "https://news.sky.com/story/post-office-scandal-compensation-shake-up-and-new-redress-body-revealed-13447456",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-post-office-branch_6986135.jpg?20250809021535",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-09 09:37:00",
        "Headline": "Ministers say they are accepting all but one of the recommendations made so far by public inquiry into the Horizon scandal.",
        "Content": " Post Office IT scandal compensation schemes are to be improved and victims' legal advice to be funded , according to the government which may create an independent body to handle similar miscarriages of justice in future. The announcements were made as part of the official response to the damning conclusions of the first volume of the Horizon inquiry's findings, released in July. It focused on the \"disastrous\" human impact of false theft and false accounting accusations made against at least 1,000 postmasters as a result of the faulty IT accounting system used by the Post Office. The retired judge who chaired the two-year inquiry, Sir Wyn Williams, made 19 recommendations. Money latest: Morrisons ends free drink refills The government said on Thursday that only one would not be taken up. Its pledges included funding of legal advice for postmasters, redress for close family members - a measure that had been previously announced - and a new appeals process, with funded legal advice, for those who have accepted Horizon Shortfall Scheme (HSS) fixed sum offers. \n                  Post Office Capture IT system conviction referred to Court of Appeal for first time\n                 \n                  Post Office transformation effort gets £118m funding boost\n                 \n                  Anorexia, bankruptcy, suicide – how the Horizon IT system ruined lives\n                 HSS, which has been run by the Post Office and subject to widespread complaints relating to undervaluation of claims, covers compensation for those postmasters who were not wrongly convicted of any crime but lost money due to the IT shortcomings covered up. Those who apply can choose between a £75,000 fixed sum offer or a full assessment of their case if they believe they are entitled to a higher amount.  That scheme's closure to new applicants - recommended under efforts to bolster the independence of its offers - will be enacted at the end of January next year rather than in November. It was further announced that Sir Gary Hickinbottom had been appointed as the senior lawyer to oversee the HSS.  Post Office chair, Nigel Railton, said: \"We have been working closely with the Department for Business and Trade to respond to the recommendations in Volume 1 of Sir Wyn Williams’ Inquiry report and to speed up redress payments to those who have been impacted by this awful scandal. \"I am pleased that we have made progress, with over £1.2bn now paid to 9,100 people across all schemes. But there is still more work to do. \"We accept the recommendation that a date should be set for the Horizon Shortfall Scheme to close. We have now agreed with the Department for Business and Trade that 31 January 2026 should be the deadline for accepting new applications into the Horizon Shortfall Scheme. We have chosen this date, which is later than the one proposed by Sir Wyn Williams, to give potential applicants more time to consider and submit their applications after the Christmas peak period, which is particularly busy for current postmasters. \"I encourage any current or former postmaster who thinks they might be eligible for the Horizon Shortfall Scheme to get in touch ahead of the closure date. We have a dedicated claimant support team available on the phone to discuss your options, provide support, and answer any questions so we can begin to process your claim right away.\" The government said that a \"clear definition\" of what constitutes \"full and fair redress\" will also be published to provide greater clarity for claimants and their representatives who have long complained about their treatment. Read more:Post Office inquiry report reveals further injusticeKey points from Horizon scandal report Work has also commenced on a restorative justice project for postmasters and their families in partnership with Post Office and Fujitsu, the company responsible for the Horizon system. A Fujitsu spokesperson said: \"We have apologised for, and deeply regret, our role in sub-postmasters' suffering. Our partnership with the Restorative Justice Council, announced last month in response to the Inquiry's recommendation, reflects our commitment to building a restorative justice framework that not only supports those impacted but is also shaped by them. \"We will provide more details on this programme to Sir Wyn ahead of the Inquiry's deadline of October 31. \"We remain committed to providing our full cooperation to the Inquiry as Sir Wyn prepares his final report and we are engaged with Government regarding Fujitsu's contribution to compensation.\" Sir Wyn's recommendation to close a HSS dispute resolution process was not accepted but the government did say it was now examining the creation of an independent body to oversee the redress process in the event of a similar scandal in future. Business Secretary Peter Kyle said: \"We must never lose sight of the wronged postmasters affected by the Horizon Scandal, which the Inquiry has highlighted so well. \"There is clearly more to do to bring justice to those affected. The recommendations we are accepting today will be a crucial step towards this.\"  "
    },
    {
        "title": "Private equity backers call time on bar chain The Alchemist",
        "description": "The long-standing private equity backers of The Alchemist, the well-known town centre cocktail bar chain, are calling time on their ownership of the business.",
        "url": "https://news.sky.com/story/private-equity-backers-call-time-on-bar-chain-the-alchemist-13447622",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-the-alchemist-bar-london_7046954.jpg?20251009155013",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-09 14:37:00",
        "Headline": "Palatine, which bought the cocktail bar operator ten years ago, is working with Pura Advisory on a sale of the business amid tough industry-wide trading conditions, Sky News learns. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The long-standing private equity backers of The Alchemist, the well-known town centre cocktail bar chain, are calling time on their ownership of the business. Sky News has learnt that Palatine, which has owned The Alchemist since 2015, is working with advisers on an auction of the company. The Alchemist, which has withstood a tough economic environment exacerbated by tax hikes earlier this year, trades from 23 sites in the UK and one in Germany. It employs close to 1,000 staff. City sources said the sale process was being conducted by Pura Advisory. The chain trades in locations including Birmingham, London, Manchester and Newcastle. News of the prospective sale comes on the day that Sir Keir Starmer outlined plans for a quickfire review of licensing rules aimed at enabling pub and bar operators to extend their opening hours. \n                  Greggs increasing prices due to higher employment costs\n                 \n                  Cote restaurant's owner cooks up fresh capital injection\n                 \n                  Govt vows to protect 'pavement pints' and make it easier for pubs to extend their opening hours \n                 \"This review is about cutting red tape, boosting footfall, and making it easier for venues to put on the kind of events that bring people together,\" the prime minister said. \"When our locals do well, our economy does too.\" Palatine's portfolio has encompassed a number of consumer-facing companies, but the firm is now increasingly focused on business-to-business investments. The price it hoped to command from a sale of The Alchemist was unclear on Thursday. Last year, it announced plans for ten additional openings, backed by a £15m loan facility with the challenger bank OakNorth. Simon Potts, chief executive of The Alchemist, said at the time: \"Despite the well-known challenges facing the hospitality sector, we take pride in our unwavering commitment of growing our brand across the UK.\" The company has also closed a number of underperforming venues. A spokesperson for Palatine declined to comment."
    },
    {
        "title": "China tightens control of global rare-earth supply chain ahead of Trump talks",
        "description": "China has toughened its rules on the export of rare earths, crucial materials for many modern technologies from smartphones to fighter jets.",
        "url": "https://news.sky.com/story/china-unveils-sweeping-controls-on-rare-earth-exports-before-trump-talks-13447386",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-rare-earth-mine_7046594.jpg?20251009102952",
        "type": "Business",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-09 08:18:00",
        "Headline": "The controls on rare earth materials used in phones and defence give Chinese President Xi Jinping more leverage in upcoming talks with US President Donald Trump. They include a measure that mimics a US restriction on exports of chip-related products to China.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n China has toughened its rules on the export of rare earths, crucial materials for many modern technologies from smartphones to fighter jets. The move strengthens Beijing's hand ahead of talks expected later this month between China's President Xi Jinping and his US counterpart Donald Trump. China's Ministry of Commerce on Thursday announced tighter restrictions on exports of processing technology and hinted at limits on exports to foreign arms manufacturers and some semiconductor firms. It follows calls in the US for stricter bans on exports of chip-making equipment to China, and mimics a measure Washington has used to restrict exports of semiconductor-related products to China. \"From a geostrategic perspective, this helps with increasing leverage for Beijing ahead of the anticipated Trump-Xi summit in (South) Korea later this month,\" said Tim Zhang, founder of Singapore-based Edge Research. The rules give China more control over the global rare-earth supply chain - a major sticking point in recent lengthy trade negotiations with Washington. China's rare earth dominance \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 \n                  'Disappointed': Starmer blames Tories for China spy trial being dropped\n                 China accounts for nearly 70% of the world's rare earths mining and controls roughly 90% of global rare earths processing. The 17 rare earth elements are used in products across society, including electric vehicles and military radars. China's dominance has given it a cutting edge over the clean technologies of the future, including electric vehicles and wind turbines.  In April, it announced sweeping controls in retaliation for tariffs imposed by the Trump administration, which caused worldwide shortages until a series of deals with Europe and the US somewhat eased the crunch. Under the new rules coming into effect in December, foreign companies will have to get special approval to export items that contain even small traces of rare earths elements sourced from China. Permits will also be required for exports of any technology related to rare earth mining, smelting, recycling and magnet-making - though it's not yet clear how China would enforce these policies overseas. The new restrictions are to \"better safeguard national security\" and to stop uses in \"sensitive fields such as the military\", the Commerce Ministry said. It said some \"overseas bodies and individuals\" had transferred rare earths elements and technologies from China abroad for defence or other sensitive uses, which caused \"significant damage\" to its national security. \"Rare earths will continue to be a key part of negotiations for Washington and Beijing,\" said George Chen, a partner at The Asia Group. \"Both sides want more stability, but there will be still a lot of noises before the two leaders, President Trump and Xi, can make a final deal next year when they meet. Those noises are all negotiation tactics.\" Warning solar panel prices will rise Last week, analysts warned the cost of solar panels was about to jump by 9% after the Chinese government cancelled a VAT rebate on exports - combined with cuts to supply side production and restrictions on polysilicon production. China makes more than 80% of the world's solar modules and in doing so has driven down costs globally. \"With no possibility of alternative supply in the short term, developers will have little choice but to absorb these higher costs,\" said Yana Hryshko from Wood Mackenzie, which produced the research. \"For developers globally, it means adjusting procurement expectations. And for policymakers, it's a timely reminder of the risks inherent in concentrated supply chains.\""
    },
    {
        "title": "Starmer denies ministers involved in China spy trial collapse",
        "description": "Sir Keir Starmer has denied any ministers were involved in the collapse of the trial of alleged Chinese spies.",
        "url": "https://news.sky.com/story/starmer-denies-ministers-involved-in-china-spy-trial-collapse-13447592",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-india_7046814.jpg?20251009134857",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-09 13:47:00",
        "Headline": "The collapse of the trial has resulted in a blame game between Downing Street, the former Conservative government and the Crown Prosecution Service.",
        "Content": "Sir Keir Starmer has denied any ministers were involved in the collapse of the trial of alleged Chinese spies. Christopher Cash, 30, a former parliamentary researcher, and teacher Christopher Berry, 33, were accused of spying for China, but weeks before their trial was due to begin, it was dropped. Berry, of Witney, Oxfordshire, and Cash, of Whitechapel, east London denied the allegations. Politics Latest: Starmer \"less interested\" in Blair than ceasefire Sir Keir, his ministers and national security adviser Jonathan Powell have faced accusations they were involved in the trial being dropped. The prime minister has maintained that because the last Conservative government had not designated China as a threat to national security, his government could not provide evidence to that effect, which the director of public prosecutions Stephen Parkinson said was required to meet the threshold for prosecution. Mr Parkinson had blamed ministers for failing to provide the crucial evidence needed to proceed. \n                  China tightens control of global rare-earth supply chain ahead of Trump talks\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 \n                  'Disappointed': Starmer blames Tories for China spy trial being dropped\n                 During a trade visit to India, the prime minister was asked whether any minister, or Mr Powell, were involved in the decision not to provide the Crown Prosecution Service (CPS) with evidence that, at the time of the alleged offences, China represented a threat to national security. He replied: \"I can be absolutely clear no ministers were involved in any of the decisions since this government's been in in relation to the evidence that's put before the court on this issue.\" He did not mention Mr Powell specifically. Read more:Blame game over trial collapse. Who's right? Who's wrong? Earlier this week, Mr Parkinson took the unusual step of sending MPs a letter to say the government had refused to label Beijing an enemy, which led to the case being dropped. Sir Keir reiterated his line that the case could only rely on evidence from the period the pair were accused of spying, from 2021 to 2023, when the Conservatives were in government. He said: \"The evidence in this case was drawn up at the time and reflected the position as it was at the time,\" the PM said in India. \"And that has remained the situation from start to finish. \"That is inevitably the case because in the United Kingdom, you can only try people on the basis of the situation as it was at the time. \"You can't try people on the basis of the situation, as it now is or might be in the future, and therefore, the only evidence that a court would ever admit on this would be evidence of what the situation was at the time. \"It's not a party political point. It's a matter of law.\"  Sir Keir's assertion has been called into question by former top civil servants and legal experts. Mark Elliott, professor of public law at the University of Cambridge, told Sky News there is no legal requirement for a country to be declared an enemy for someone to be tried for breaching the Official Secrets Act. He said the current government was \"cherry picking\" what the previous government had said about China to claim they did not regard them as a threat to national security. However, there are several examples of the Tory government saying China was a national security threat during the time Berry and Cash were accused of spying."
    },
    {
        "title": "Less than half of Scots trust Scottish government to do right by country, report finds",
        "description": "A new report has warned of a \"clear decline in trust\" in the Scottish government since devolution, with less than half of respondents saying it acts in the country's best interests.",
        "url": "https://news.sky.com/story/less-than-half-of-scots-trust-scottish-government-to-do-right-by-country-report-finds-13447385",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-scottish-parliament_6496922.jpg?20250917141057",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-09 08:17:00",
        "Headline": "The Scottish Social Attitudes survey, published on Thursday, also found satisfaction with the NHS has fallen to 22%.",
        "Content": "A new report has warned of a \"clear decline in trust\" in the Scottish government since devolution, with less than half of respondents saying it acts in the country's best interests. The Scottish Social Attitudes survey, published by the Scottish Centre for Social Research (ScotCen) on Thursday, found 47% of Scots trust the Scottish government to do what is right for Scotland. The figure has decreased from 61% in 2019 and is down from 81% when devolution began in 1999. The survey, 25 Years Of Devolution In Scotland: Public Attitudes And Reaction, also found 38% of respondents believe the government is good at listening to the public before making decisions, the lowest result since 2006. The statistics on trust in the Scottish government are from research in 2023, with other data coming from 2024. Satisfaction with the NHS has fallen to 22%, which ScotCen says is comparable with the rest of the UK. This follows a 2023 finding in which 69% of people surveyed said they felt the standard of the health service had declined. \n                  Perth and Kinross council leader Grant Laing resigns and quits SNP after embezzlement charge\n                 \n                  Scottish minister Jamie Hepburn quits after assault claim\n                 \n                  Former Scottish Tory leader Douglas Ross accuses SNP minister Jamie Hepburn of assault and verbal abuse\n                 ScotCen said this represents the lowest level of satisfaction and the highest perception of a decline in standards since the time series began in 1999. In 2024, around two in five adults in Scotland (41%) said they were living comfortably or doing alright financially, while around one in four (24%) reported they were really struggling. Most of those north of the border continued to identify as Scottish, though the 74% saying in 2024 that it was at least one of their identities was a reduction from 84% who said so in 1999. Despite trust in the Scottish government having reduced, support for independence is at 47%, up from 27% in 1999. Read more:Why next year's Scottish elections could get messy Paul Bradshaw, director of ScotCen, said: \"These latest results show a clear decline in trust in the Scottish government, alongside continued concern about public services and the economy. \"While Scots remain strongly attached to their Scottish identity, our data suggest that confidence in political institutions is under pressure, a finding that will be important for policymakers and the public alike.\" In an extract from the report's conclusion, co-authors Sophie Birtwistle and Sir John Curtice wrote: \"So far as public opinion is concerned, devolution has not turned out in the way that either its advocates or its critics anticipated when the Scottish parliament first met on 1 July 1999. \"On the one hand, it has not resulted in any long-term marked decline in Scots' willingness to acknowledge a British identity or in any marked divergence of attitudes and values between Scotland and England. \"On the other hand, far from persuading Scots of the merits of being part of the UK, the decision to put the independence question to voters in 2014 occasioned a marked long-term increase in support for leaving the UK. \"Yet, at the same time, although support for independence may now be higher, it is still a long way from looking like a 'settled will' in the way that, by 1999, the idea of Scotland having its own parliament appeared to be.\" Deputy First Minister Kate Forbes said the \"fresh start of independence\" would help to \"raise living standards, grow the economy, and shape a fairer, more prosperous future\". She added: \"The data suggests that trust in the Scottish government is on a level with governments elsewhere, but we are determined to do more. \"Much of this data was collected up to two years ago. \"Since then, the Scottish government has made considerable progress to deliver on the people of Scotland's priorities - including abolishing peak rail fares, confirming plans to deliver winter heating support for pensioners and taking action to improve our NHS, including investing record funding of £21.7bn for health and social care this year.\""
    },
    {
        "title": "'The time is now to stop Reform' - Plaid Cymru calls on Labour voters to unite behind Welsh nationalists ",
        "description": "One party has held court over Welsh politics for more than a century.",
        "url": "https://news.sky.com/story/the-time-is-now-to-stop-reform-plaid-cymru-calls-on-labour-voters-to-unite-behind-welsh-nationalists-13447776",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rhun-ap-iorworth-plaid-cymru_6956369.jpg?20250703152550",
        "type": "Politics",
        "Author": "Hannah Woodward, political news editor",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "Welsh politics has traditionally been dominated by Labour, but as Plaid Cymru begins its conference, it can sense the winds of change.",
        "Content": "By Hannah Woodward, political news editor  One party has held court over Welsh politics for more than a century. Welsh Labour MPs have been the largest group sent to Westminster in every general election since 1922 - and the party has been in government in the country for more than a quarter of a century. But if the polls are accurate, Labour's long-standing grip on politics in Wales is fading. Politics latest - follow live Plaid Cymru and Reform UK are running almost neck and neck, while Labour trails significantly. A recent YouGov poll put Plaid Cymru on 30%, Reform UK on 29% and Labour at 14%. Plaid Cymru, heading into its conference this weekend, can sense the mood for change in Wales - and intends to show it is ready for government. The party hopes to capitalise on disillusioned Labour voters feeling let down by their party under Sir Keir Starmer, and use this to tackle the rise of Reform - which is key to getting it into power. \n                  Two admit rioting after deaths of boys in e-bike crash in Cardiff\n                 \n                  Charlene Hobbs: Renewed appeal to find missing mum a year on from her last sighting\n                 \n                  Former Conservative MP Katie Wallis appears in court accused of having false passport\n                 In his leader's speech, Rhun ap Iorwerth is expected to position Plaid Cymru as Wales's progressive force, and the only party capable of taking on Reform. He will say: \"We're not here to act as Labour's conscience. We are not here to repair Labour. We are here to replace them. \"If you've never voted for Plaid Cymru before, the time is now. \"The time is now to stop Reform and elect a government more radical, more ambitious, more impatient to bring about positive change than any which has gone before it. A government of progress and of progressive values.\" One in five Labour voters in Wales intend to back Plaid Cymru at the Senedd elections in 2026, according to YouGov. But almost a quarter of Labour voters remain undecided on who to endorse. The topic of independence will no doubt be a contentious issue for voters who are angry about decisions made by Labour in Wales and Westminster, but do not want an independent Wales. Mr ap Iorwerth has ruled out an independence referendum if Plaid Cymru wins next year's elections, signalling that he doesn't want the campaign to centre on independence. Throughout the conference, Plaid Cymru will position itself as ready to govern. But voters will expect clear plans for the NHS, education, and the economy. The question for the party, both during this conference and over the coming months, will be whether its proposals can win over Labour voters in its quest to beat Reform. But Plaid Cymru's challenge to Nigel Farage's party faces a critical test sooner than May. Instead, its next battle will be in the Caerphilly Senedd by-election on 23 October. Historically a Labour stronghold at both Senedd and Westminster levels, Caerphilly has consistently returned Labour representatives, with Plaid Cymru as the main opposition at Senedd elections.  However, this election introduces a new dynamic, as Reform has emerged as a credible challenger, poised to disrupt the traditional two-party contest. Coming second at this election won't be a total loss for Plaid Cymru. If it can come second at the by-election, it will prove the point Mr ap Iorwerth will be making at the conference in Swansea: that his party is the only credible anti-Reform vote. The full list of candidates standing at the Caerphilly by-election: Labour - Richard Tunnicliffe Plaid Cymru - Lindsay Whittle Reform UK - Llŷr Powell Conservative - Gareth Potter Green Party - Gareth Hughes Gwlad - Anthony Cook UKIP - Roger Quilliam Liberal Democrats - Steve Aicheler"
    },
    {
        "title": "Starmer's found new enthusiasm for his digital ID project - but will he be able to sell it?",
        "description": "One metric for the rise and fall of this government might end up being the&#160;progress of the rollout of digital ID.",
        "url": "https://news.sky.com/story/starmers-found-new-enthusiasm-for-his-digital-id-project-but-will-he-be-able-to-sell-it-13447805",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/digital-id-starmer-digital-id-cards_7032482.jpg?20250928151755",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "The PM's plan to introduce digital IDs has been opposed by millions - but his trip to India may have shown him a way through.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  One metric for the rise and fall of this government might end up being the progress of the rollout of digital ID. The lack of a clear plan - despite the high profile announcement by the PM - means the destination still remains slightly opaque, and some cabinet ministers are sceptical. However, the PM's India trip suggests that there might just be a path to success, if things fall in Keir Starmer's favour. During his visit, Starmer met the boss of Infosys, Nandan Nilekani, who is behind the rollout of digital ID to more than 1.4 billion Indian citizens. Afterwards, when I asked about it at the closing press conference of the India trip, he was infused by a fresh enthusiasm for the plan, not evident at the Labour gathering in Liverpool in the days after he first unveiled it.  Below is what he said to me, transcribed in full. But as you read it, notice how the PM's explanation and justification for this scheme - which will be one of the biggest projects this government undertakes if it does happen - centres around convenience for citizens and makes no mention of the case originally used for it - to combat illegal migration. \n                  Politics latest: First group deportation of small boat migrants under UK-France deal\n                 \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  Less than half of Scots trust Scottish government to do right by country, report finds\n                 Politics latest - follow live Starmer told me: \"We did discuss [digital ID] yesterday. And in particular, the benefits that it has brought in India. \"We've obviously also looked at other countries - Estonia, for example. The speed with which it allows citizens here to access services, particularly financial services, is something that was recognised in our discussions yesterday and actually at the fintech discussion that we had today, as well. \"So, we're looking at those examples of how digital ID helps individuals, with the processes that sometimes take too long and are too cumbersome, and makes it easier for them.\"  The answer is clear: the prime minister now puts personal convenience as the top justification. While Starmer was locked in the Fintech summit, we visited Mumbai University to gauge opinion on digital ID, which has rolled out across India over the past 10 to 15 years. We asked students as they could traditionally have been thought to be one of the more cautious groups in society towards a project which involves state intrusion into the lives of individuals.  Among all the people that we talked to - and you can watch our video at the top of this page - there was a recognition of privacy concerns, worries about data leaks, and uncertainty about how some of the information might be used. But every single person we stopped and talked to about it was nevertheless enthusiastically in favour - and said it had made their lives simpler and more efficient. The net benefits of this scheme had landed with the Indian citizens we spoke to.  The engagement from Infosys is also significant after the boss of Palantir, a rival tech company, gave the idea of a UK digital ID scheme a comprehensive shellacking last week. For a moment, it looked like the corporate world might be pulling back from the scheme - so the engagement of a massive multinational corporation has come at just the right moment. None of which is to downplay the obstacles. Read moreThe film fighting back against 'cheap laughs' at Tourette's expenseOnly man to appeal Gisele Pelicot rape conviction handed longer sentence  In a bizarre move, the Home Office appears to have been allowed to swerve responsibility for the project, which has gone instead to Liz Kendall's Department of Science, Innovation and Technology (DSIT), which does not yet have any track record of major delivery. One DSIT aide said that the young average age of staff at the newly formed department is an advantage, a claim which seems somewhat doubtful. So, Whitehall may tie itself up in knots over this project. Or, it might turn out that India's cultural norms simply make it an easier place to roll out a scheme like this. But on the basis of our enquiries, there is the potential case for a scheme that can be sold to a willing public."
    },
    {
        "title": "Discord hack shows dangers of online age checks as internet policing hopes put to the test",
        "description": "Messaging platform Discord has said the official ID photos of around 70,000 users have been stolen by hackers.",
        "url": "https://news.sky.com/story/discord-hack-shows-dangers-of-online-age-checks-as-internet-policing-hopes-put-to-the-test-13447618",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-discord-app_7046939.jpg?20251009153940",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "As the drive for age verification grows, so does the pressure on online companies to keep users' data safe and, as the Discord hack shows, that cannot be guaranteed. ",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n  Messaging platform Discord has said the official ID photos of around 70,000 users have been stolen by hackers. The app, which is popular with gamers and teenagers, said the hackers targeted a firm responsible for verifying the ages of its users. Discord said its own platform was not breached. The stolen data could include personal information, partial credit card numbers and messages with Discord's customer service agents, the firm said. No full credit card details, passwords or messages and activity beyond conversations with Discord customer support were leaked, it added. Discord said it had revoked the third-party service's access and was continuing to investigate. It said all affected users have been contacted. \"Looking ahead, we recommend impacted users stay alert when receiving messages or other communication that may seem suspicious,\" it said. Until recently, a hack like this could not have happened, because companies had no need to process and collect proofs of age. Now, so many governments are following the UK and introducing age verification for unsuitable or pornographic content that a company like Discord has to roll out age checks for a decent portion of its 200 million active users. It's a bit like the way that shops have to check your age if you're buying alcohol - only because it's online, it comes with a lot of additional complications. A shop, for instance, won't keep a copy of your passport once they've checked your age. And it definitely won't keep it in a massive (yet strangely light) safe along with thousands of other passport photocopies, stored right by its front door, ready to be taken. Online, it's surprisingly easy to do just that. Read more on Sky News:AI 'distorting women online'Pros and cons of digital IDsImpact of new online safety rules It's worth noting that the age verification system used by Discord wasn't hacked itself. That system asked people to take a photo of themselves, then used software to estimate their age. Once the check was complete, the image was immediately deleted. The problem came with the appeals part of the process, which was supplied to Discord by an as-yet-unnamed third party. If someone thought that the age verification system had wrongly barred them from Discord they could send in a picture of their ID to prove their age. This collection of images was hacked. As a result, Discord says, more than 70,000 IDs are now in the possession of hackers. (The hackers themselves claim that the number is much bigger - 2,185,151 photos. Discord says this is wrong and the hackers are simply trying to extort money. It's a messy situation.) There are ways to make age verification safer. Companies could stop storing photo ID, for instance (although then it would be impossible to know for sure if their checks were correct). And advocates of ID cards will point out that a proper government ID could avoid the need to send pictures of your passport simply to prove your age. You'd use your digital ID instead, which would stay safely on your device. But the best way to stop data being hacked is not to collect it in the first place. We're at the start of a defining test - can governments actually police the internet? Or will the measures that are supposed to make us safer actually end up making us less secure?"
    },
    {
        "title": "'Uncertainty really matters': Sky News investigates new AI test at sea",
        "description": "A new generation of artificial intelligence that provides a \"confidence rating\" of its answers could make algorithms more trustworthy and speed their rollout in safety-critical situations.",
        "url": "https://news.sky.com/story/uncertainty-really-matters-sky-news-investigates-new-ai-test-at-sea-13443514",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sea-saling-at-sea-ai_7038183.jpg?20251001141441",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "Scientists developing the technology called \"uncertainty-aware AI\" say it removes the risk of hallucinations - fictitious answers created by computer algorithms when they have incomplete or conflicting data.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  A new generation of artificial intelligence that provides a \"confidence rating\" of its answers could make algorithms more trustworthy and speed their rollout in safety-critical situations. Scientists developing the technology called \"uncertainty-aware AI\" say it removes the risk of hallucinations - fictitious answers created by computer algorithms when they have incomplete or conflicting data. The new AI assistant would instead provide its best assessment of a situation when faced with patchy evidence, but confirm that it wasn't sure. A human operator would then be able to judge how much weight to put on the answer and seek additional information where necessary. The start-up digiLab, which devised the AI assistant called the Uncertainty Engine, is already collaborating with a major manufacturer in the design of a new generation of small-scale nuclear reactors that are likely to be placed closer to people's houses in future. It helps engineers accelerate development without taking risks. Read more about AI:How most people are using ChatGPTMeet Diella: Albania's AI-generated 'minister' Tim Dodwell, company founder, told Sky News: \"As we adopt AI in situations that are going to [be] transformative, like energy, maritime safety and healthcare, uncertainty really matters. \"I see no real future for AI unless we answer another problem: can we trust it? Human lives are at stake and people have to take responsibility for what the algorithms will do.\" Sky News was invited to join a team testing the Uncertainty Engine out at sea, where they believe it could be a game-changer for complex maritime route planning. The AI assistant is being used on a high-performance sailing yacht to help plot the fastest or safest route. It can't currently be used in races, but it is helping the Next Step Racing team prepare and understand how to extract even more power from the boat. Joss Creswell, co-skipper, said offshore racing, like Formula One, is all about small margins - and AI can help crunch a mass of data. \"There's a lot, a lot of information coming to the screen,\" he said. \"You've got information about the wind, the sea state, the boat's performance, as well as the position of other boats you're racing against. \"Quantifying that and reducing it to something that we understand and then react to is really difficult, so it's really useful to use AI for that. \"It can give you insights into the changes you can make to give you an advantage over the competition.\" Read more from Thomas Moore:AI model could predict disease risk a decade before symptomsCould refreezing the Arctic actually work?Mars 'leopard spots' clearest sign life once existed there Mr Dodwell said the AI assistant could also reduce fuel costs and carbon dioxide emissions of enormous oil tankers and cargo vessels by giving the crew advice on the most efficient route. \"Over a long journey, like Australia to Southampton, there's uncertainty about what the wind and sea conditions will be. \"What we really want is for AI to look at options for the different routes we can take and capture uncertainty in those weather conditions \"It can also capture uncertainty in shipping lanes - for example, if the Suez Canal was closed. \"By doing this intelligently, a 1-5% saving could mean huge benefits to efficiency overall.\" Mr Dodwell added that saving 5% in fuel consumption would reduce carbon emissions from the UK shipping industry by 600,000 tonnes a year, equivalent to taking 300,000 cars off the road."
    },
    {
        "title": "China tightens control of global rare-earth supply chain ahead of Trump talks",
        "description": "China has toughened its rules on the export of rare earths, crucial materials for many modern technologies from smartphones to fighter jets.",
        "url": "https://news.sky.com/story/china-unveils-sweeping-controls-on-rare-earth-exports-before-trump-talks-13447386",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-china-rare-earth-mine_7046594.jpg?20251009102952",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-09 08:18:00",
        "Headline": "The controls on rare earth materials used in phones and defence give Chinese President Xi Jinping more leverage in upcoming talks with US President Donald Trump. They include a measure that mimics a US restriction on exports of chip-related products to China.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n China has toughened its rules on the export of rare earths, crucial materials for many modern technologies from smartphones to fighter jets. The move strengthens Beijing's hand ahead of talks expected later this month between China's President Xi Jinping and his US counterpart Donald Trump. China's Ministry of Commerce on Thursday announced tighter restrictions on exports of processing technology and hinted at limits on exports to foreign arms manufacturers and some semiconductor firms. It follows calls in the US for stricter bans on exports of chip-making equipment to China, and mimics a measure Washington has used to restrict exports of semiconductor-related products to China. \"From a geostrategic perspective, this helps with increasing leverage for Beijing ahead of the anticipated Trump-Xi summit in (South) Korea later this month,\" said Tim Zhang, founder of Singapore-based Edge Research. The rules give China more control over the global rare-earth supply chain - a major sticking point in recent lengthy trade negotiations with Washington. China's rare earth dominance \n                  Starmer denies ministers involved in China spy trial collapse\n                 \n                  The blame game over China spy trial collapse - who is right and who is wrong?\n                 \n                  'Disappointed': Starmer blames Tories for China spy trial being dropped\n                 China accounts for nearly 70% of the world's rare earths mining and controls roughly 90% of global rare earths processing. The 17 rare earth elements are used in products across society, including electric vehicles and military radars. China's dominance has given it a cutting edge over the clean technologies of the future, including electric vehicles and wind turbines.  In April, it announced sweeping controls in retaliation for tariffs imposed by the Trump administration, which caused worldwide shortages until a series of deals with Europe and the US somewhat eased the crunch. Under the new rules coming into effect in December, foreign companies will have to get special approval to export items that contain even small traces of rare earths elements sourced from China. Permits will also be required for exports of any technology related to rare earth mining, smelting, recycling and magnet-making - though it's not yet clear how China would enforce these policies overseas. The new restrictions are to \"better safeguard national security\" and to stop uses in \"sensitive fields such as the military\", the Commerce Ministry said. It said some \"overseas bodies and individuals\" had transferred rare earths elements and technologies from China abroad for defence or other sensitive uses, which caused \"significant damage\" to its national security. \"Rare earths will continue to be a key part of negotiations for Washington and Beijing,\" said George Chen, a partner at The Asia Group. \"Both sides want more stability, but there will be still a lot of noises before the two leaders, President Trump and Xi, can make a final deal next year when they meet. Those noises are all negotiation tactics.\" Warning solar panel prices will rise Last week, analysts warned the cost of solar panels was about to jump by 9% after the Chinese government cancelled a VAT rebate on exports - combined with cuts to supply side production and restrictions on polysilicon production. China makes more than 80% of the world's solar modules and in doing so has driven down costs globally. \"With no possibility of alternative supply in the short term, developers will have little choice but to absorb these higher costs,\" said Yana Hryshko from Wood Mackenzie, which produced the research. \"For developers globally, it means adjusting procurement expectations. And for policymakers, it's a timely reminder of the risks inherent in concentrated supply chains.\""
    },
    {
        "title": "I Swear: The film fighting back against abuse and 'cheap laughs' at Tourette's expense",
        "description": "When John Davidson was 10 years old, he experienced his first symptoms of Tourette syndrome - small facial tics and eye blinking.",
        "url": "https://news.sky.com/story/i-swear-the-film-fighting-back-against-abuse-and-cheap-laughs-at-tourettes-expense-13446397",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-i-swear-robert-aramayo_7039966.jpg?20251003112925",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-10-09 23:01:00",
        "Headline": "John Davidson is the only MBE recipient to have shouted \"F*** the Queen\" at the ceremony. He tells Bethany Minelle about living with a condition where your brain can be your own worst enemy.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  When John Davidson was 10 years old, he experienced his first symptoms of Tourette syndrome - small facial tics and eye blinking. By the time he was 13, the neurological condition was causing full-body movements so extreme he compares himself with the young heroine in horror film The Exorcist. John tells Sky News: \"There's a scene where the girl's on the bed and her whole body's twitching about and screaming. That's almost what it felt like. My tics became so extreme that I was hurting myself. I was pulling muscles. I was tired all the time. \"I would break down and cry so many times in a day because I was totally out of control. Something had completely taken over my mind and my body.\" Growing up in Galashiels in the Scottish Borders, John was repeatedly told his symptoms were in his head - or worse, intentional - when a chance meeting with a visiting junior doctor while in hospital led to a diagnosis. Largely unheard of in the 1980s, today, high-profile figures including Scottish musician Lewis Capaldi and US star Billie Eilish have publicly spoken about living with Tourette's. Affecting more than 300,000 people in Britain, it's more common than many think. One schoolchild in every hundred is estimated to be affected by the syndrome, according to NHS England. \n                  Tim Westwood charged with four counts of rape\n                 \n                  Dolly Parton says 'I ain't dead yet' after health fears triggered by singer's sister\n                 \n                  Robin Williams's daughter begs people to stop sending her AI videos of her father\n                 While severity can range, there is currently no cure. And while the University of Nottingham is working on a device which uses electrical pulses to suppress tic urges, the wristband - called Neupulse - is currently awaiting full medical approval. 'Medication turned me into a zombie' Treated with drugs as a child, John suffered devastating side-effects: \"Anti-psychotic medications turned me into a zombie. I've got probably about a two-year period in my teens where I have no real proper memories.\" Frustrated by the lack of support available to him growing up, John is now a Tourette syndrome campaigner, recognised for his work with an MBE. But even that came with challenges unique to his condition. At the 2019 ceremony at Holyrood Palace, when collecting his award, John shouted \"F*** the Queen\" at Elizabeth II. He says: \"It was horrific for me. It was like the last thing I ever wanted to have to shout. And I think that's the nature of the coprolalia, part of the condition, where it's the worst possible thing you could say in that situation.\" Affecting a minority of the Tourette's population, coprolalia is the involuntary utterance of socially inappropriate words or phrases. While less common, it's the feature of Tourette's most often portrayed in the media. John goes on: \"It came as much of a shock to me as to everyone else, you know? But I'm the one in the moment having to deal with those emotions and feelings of wanting the ground to swallow me up. [Thinking] I don't want to be here any more.\" 'Living with it is absolutely awful' Now, in a bid to tackle the stereotype, a film is being made about John's life based on his 2025 memoir, with Game Of Thrones star Robert Aramayo playing the lead role. No stranger to media exposure himself, John has appeared in numerous documentaries over the years, following on from the groundbreaking 1989 documentary about his life, John's Not Mad. But it hasn't always been a positive experience. John says: \"Every time they make a documentary, they make such a thing about the swearing part, which then stigmatises the condition because people are then left to assume that everyone with Tourette's swears and shouts obscenities.\" In reality, coprolalia is not typical of the condition and only affects around one in 10 people with Tourette's. John acknowledges there is a comedic element to this: \"When people think of uncontrollably swearing like that, it's funny. 'Oh my God', you know, 'shock, horror'. But for the one living with it, it's absolutely awful.\" 'Let's have sex!' It's a sentiment the film's director echoes. Kirk Jones first met John in 2022. Meeting him at his house to discuss the potential of making the film, John opened the door and, after inviting him in, shouted in his face: \"Let's have sex!\" His first introduction to John's verbal ticks, the director admits it was a \"steep learning curve\". He tells Sky News: \"There's something about Tourette's, which I don't think has made it a very friendly or accessible condition. I think that's down to the fact that people who have coprolalia come across as being aggressive or argumentative or difficult or upsetting people, and I think that's unfair. They need as much support as anyone else.\" The director says it took him some time to gain John's trust, showing he wanted to do more than just revisit tired stereotypes. He says: \"The Tourette's community had been kind of abused in the past. They've been invited to appear on TV shows or radio or be in newspaper articles, under the guise of helping people to understand Tourette's more. But what the TV channel or the radio show really wanted was just a cheap laugh. \"When I first met John and started talking about the idea of the film, he was understandably suspicious.\" Handing over some creative control, John is also an executive producer on the film. 'When you laugh, it breaks the ice' Now, at 54, and having lived with the condition for over 40 years, John believes people are becoming more tolerant of Tourette's, but would love to see further acceptance. \"It's about not being shocked. It's not about being dead serious with a straight face. Feel free to laugh, because when you laugh, it breaks the ice. \"I wish people had the confidence to approach people with Tourette's and just deal with it as if it was an everyday thing.\" The director, too, hopes the film will have a real-world impact and open people's eyes to the reality of the condition. He says: \"I hope this film can play a small part in starting to refocus people's attention on helping and supporting people rather than just laughing or mocking.\" I Swear is in UK and Irish cinemas from Friday 10 October. Anyone looking for support or information about Tourette syndrome can access resources at Tourettes Action or Tourette Scotland for those living in Scotland."
    },
    {
        "title": "Tim Westwood charged with four counts of rape",
        "description": "Former Radio 1 DJ Tim Westwood has been charged with four counts of rape, nine counts of indecent assault and two counts of sexual assault. ",
        "url": "https://news.sky.com/story/tim-westwood-charged-with-four-counts-of-rape-13447617",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tim-westwood-dj_7046930.jpg?20251009153413",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-09 14:20:00",
        "Headline": "The alleged historical assaults against seven different women are said to have taken place in various parts of London and a town in Gloucestershire.",
        "Content": "Former Radio 1 DJ Tim Westwood has been charged with four counts of rape, nine counts of indecent assault and two counts of sexual assault.  The charges relate to seven different women during a period from 1983 to 2016, the Metropolitan Police said. Officers say the youngest was aged 17 at the time of the alleged assault. The 68-year-old is due to appear at Westminster Magistrates' Court on Monday 10 November. Westwood has previously denied all allegations of sexual misconduct made against him. What are the charges? Police have said the former BBC broadcaster is alleged to have indecently assaulted a 17-year-old girl in the Fulham area of London in 1983. He is also accused of sexually assaulting a woman in her 20s in the Vauxhall area of London in 1986, as well as raping and sexually assaulting a woman, aged between 17 and 18, in London between 1995 and 1996. Westwood is alleged to have raped and sexually assaulted a woman aged 17 to 18 between 2000 and 2001 and raped a woman in her 20s in 2010 - with the alleged offences also reported to have taken place in London. He is further accused of sexually assaulting a woman in her 20s in Stroud, Gloucestershire, in 2010 and sexually assaulting another woman in her 20s in the Finchley area of London in 2016. Police investigation still open Detective Superintendent Andy Furphy, from the Metropolitan Police, said: \"It takes courage to come forward and report allegations of this nature. \"The women who have done so have put their trust in us and we continue to provide them with all available support. \"Our investigation remains open and we'd encourage anyone who has been impacted by this case, or anyone with information, to come forward and speak with us.\" When the first accusations surfaced in April 2022, his representative issued a statement saying he \"strongly rejects all allegations of wrongdoing\". Decades of broadcasting Westwood began his broadcasting career in local radio before joining Capital Radio in the late 1980s. He moved to the BBC in 1994, working on Radio 1 and Radio 1Xtra, spending nearly 20 years with the corporation. He left the BBC in 2013. Westwood then joined Capital Xtra, hosting a regular Saturday show where he was referred to as \"The Big Dawg\", before he left the company in 2022."
    }
]