[
    {
        "title": "Armed man shot and killed after entering perimeter of Trump's Mar-a-Lago residence",
        "description": "A man has been shot dead by Secret Service agents after trying to unlawfully enter Donald Trump's Mar-a-Lago estate, authorities in the US have said.",
        "url": "https://news.sky.com/story/armed-man-shot-and-killed-after-entering-perimeter-of-mar-a-lago-13510785",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-austin-tucker-martin_7172174.jpg?20260222175631",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-22 15:09:00",
        "Headline": "The suspect has been identified by US media as a 21-year-old who was reported missing by his family a few days ago.",
        "Content": "A man has been shot dead by Secret Service agents after trying to unlawfully enter Donald Trump's Mar-a-Lago estate, authorities in the US have said. The man was seen by the north gate of the Florida property at around 1.30am local time (6.30am UK time) on Sunday. He was carrying what appeared to be a shotgun and a fuel can, officials added. US media have identified the suspect as Austin Tucker Martin - a 21-year-old who was reported missing by his family a few days ago. Rick Bradshaw, the sheriff of Palm Beach County, said the man made it into Mar-a-Lago's inner perimeter. He is believed to have driven through the north gate of the estate as another vehicle was exiting. The man raised his shotgun to a shooting position after being confronted by a deputy and two Secret Service agents, who then \"fired their weapons and neutralised the threat\", the sheriff added. Secret Service spokesman Anthony Guglielmi said the suspect was in his early 20s and from North Carolina. According to Mr Guglielmi, investigators believe he left North Carolina and headed south, picking up a shotgun along the way. The box for the gun was recovered in his vehicle. \n                  As protests resume in Tehran, Iran's regime may be ready to strike a deal with Trump\n                 \n                  Trump sending 'great hospital boat' to Greenland to 'take care of the sick'\n                 \n                  Trump bumps up global tariffs - creating more mess and uncertainty for the world\n                 Investigators are working to compile a psychological profile while the motive is still under investigation. Suspect 'from family of Trump supporters', says relative The suspect's cousin, Braeden Fields, 19, spoke with a reporter from the Associated Press, stating: \"We are big Trump supporters, all of us. Everybody.\" But he said his relative didn't discuss politics and was \"real quiet, never really talked about anything\". \"He's a good kid,\" Mr Fields said, adding that Martin sent part of every pay cheque from his job at a local golf course to charity. \"I wouldn't believe he would do something like this. It's mind-blowing.\" While Mr Trump often spends the weekends at Mar-a-Lago, he was at the White House with his wife Melania when the incident took place. White House praises Secret Service White House press secretary Karoline Leavitt said the Secret Service had acted \"quickly and decisively to neutralise a crazy person\" who had intruded into Mr Trump's home. She wrote on X: \"Federal law enforcement are working 24/7 to keep our country safe and protect all Americans. It's shameful and reckless that Democrats have chosen to shut down their Department.\" Earlier this month, Democrats in the US Senate blocked a funding package for the Department of Homeland Security, which includes the Secret Service, over their opposition to an immigration crackdown that has triggered widespread protests and seen two people killed in Minneapolis. The FBI has asked residents who live near Mar-a-Lago to check any security cameras as they may have footage that could help investigators. Five days ago, US Capitol Police arrested a Georgia gunman armed with a shotgun as he sprinted towards the west side of the Capitol. Read more on Sky News:Trump sending 'great hospital boat' to GreenlandUS president announces new global tariffs Mr Trump previously faced a threat to his life when he was wounded during an assassination attempt during a campaign rally in Butler, Pennsylvania, on 13 July 2024. On 15 September 2024, a man with a rifle was captured after waiting near Mr Trump's golf course in West Palm Beach while the president played a round. He was sentenced to life in prison earlier this month."
    },
    {
        "title": "Mexican drug lord 'El Mencho' killed in military operation - sparking retaliatory violence",
        "description": "One of Mexico's most notorious drug lords, \"El Mencho\", has been killed in a military operation carried out by Mexican special forces &#8204;with \"intelligence\" support from the US.",
        "url": "https://news.sky.com/story/mexican-drug-lord-el-mencho-killed-in-military-operation-official-says-13510875",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-el-mencho-nemesio-ruben_7172145.jpg?20260222174359",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-22 17:37:00",
        "Headline": "Nemesio Ruben Oseguera Cervantes was the leader of the Jalisco New Generation Cartel, one of the nation's most powerful criminal organisations.",
        "Content": "One of Mexico's most notorious drug lords, \"El Mencho\", has been killed in a military operation carried out by Mexican special forces ‌with \"intelligence\" support from the US. The leader of the Jalisco New Generation Cartel, whose real name is Nemesio Ruben Oseguera Cervantes, was wounded in an operation to capture him in Tapalpa, Jalisco state, on Sunday. He later died while being flown to Mexico City, the country's defence department said. Jalisco is the base of the cartel known for trafficking large quantities of fentanyl and other drugs to the US. The cartel was designated as a foreign terrorist organisation by Donald Trump's administration earlier this month. During the operation, the defence department said troops came under fire and killed four people. Three others, including Oseguera Cervantes, were wounded and later died. Two more people were arrested, and armoured vehicles, rocket launchers and other firearms were seized. Three members of the armed forces were also wounded. The US Embassy in Mexico said on X that Mexican special forces carried out the operation \"within the framework of bilateral cooperation, with U.S. authorities providing complementary intelligence\". US deputy secretary of state Christopher Landau, previously ambassador to Mexico, said Oseguera Cervantes' killing was a \"great development\" for the US and Mexico, as well as the rest of Latin America. Roads blocked and cars set on fire After news of Oseguera Cervantes' death, cartel henchmen blockaded highways with burning cars and torched businesses in several states, paralysing parts of the country. Such tactics are commonly used by the cartels to block military operations. In Jalisco's popular beach resort of Puerto Vallarta, frightened tourists on social media described a \"war zone\" as plumes ​of smoke billowed into the sky. Air Canada, United Airlines, Aeromexico and American Airlines suspended flight operations on Sunday. Read more from Sky News:Iran's regime may be ready to strike a deal with TrumpVirtual reality offers escape to Gaza's children The US State Department warned US citizens in Jalisco, Tamaulipas, Michoacan, Guerrero and Nuevo Leon states to remain in safe places while security operations are carried out. Jalisco governor Pablo Lemus told residents to stay at home and suspended public transportation. Schools in the state have also been closed on Monday. Reaction to operation In a post on X, President Claudia Sheinbaum said: \"There is full coordination with the governments of all states; we must remain informed and calm... in most parts of the country, activities are proceeding normally. \"My recognition goes to the Mexican Army, the National Guard, the Armed Forces, and the Security Cabinet. We work every day for the peace, security, justice, and well-being of Mexico.\" She said she would ​strengthen efforts to cooperate with the US to fight cartels, but vowed to uphold Mexico's sovereignty and warned against any unilateral military action ​by the US in Mexico. In January after the US capture of Venezuelan President Nicolas Maduro, President Trump said \"the cartels are running Mexico\", and warned \"we are ⁠going to start now hitting land with regard to the cartels\". The US State Department had offered a reward of up to $15m for information leading to the arrest of El Mencho. Oseguera Cervantes was heavily involved in drug trafficking since the 1990s. He was convicted of conspiracy to distribute heroin in the US District Court for the Northern District of California in 1994 and spent almost three years in prison. Following his release from custody, Oseguera Cervantes returned to Mexico and continued drug trafficking operations. Since 2017, he was indicted several times in the United States District Court for the District of Columbia. One of Mexico's most powerful criminal organisations  The Jalisco New Generation Cartel is one of the most powerful and fastest-growing criminal organisations in Mexico. The cartel carried out a daring assassination attempt in 2020 with grenades and high-powered rifles against the then-head of the capital's police force, who is now head of federal security, in the heart of Mexico City. The US Drug Enforcement Administration considers it to be as powerful as the Sinaloa cartel, one of Mexico's most notorious criminal groups. The cartel has a presence in all 50 US states and is believed to be one of the leading suppliers of cocaine to the US market. Like the Sinaloa cartel, it earns billions of dollars from the production of methamphetamines and fentanyl."
    },
    {
        "title": "Mainstream schools to receive extra funding for SEND pupils as part of £4bn package",
        "description": "Mainstream schools will receive direct funding to support children with special educational needs and disabilities (SEND) as part of a &#163;4bn package to make the system more inclusive.",
        "url": "https://news.sky.com/story/mainstream-schools-to-receive-extra-funding-for-send-pupils-as-part-of-1634bn-package-13510934",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-pupils-school_7172318.jpg?20260222204726",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-22 20:22:00",
        "Headline": "Education Secretary Bridget Phillipson said the government is \"fiercely ambitious for children and young people with SEND\", who deserve a system that \"lifts them up\".",
        "Content": "Mainstream schools will receive direct funding to support children with special educational needs and disabilities (SEND) as part of a £4bn package to make the system more inclusive. Targeted interventions such as small-group language work will receive funding, and there will be help for staff to introduce adaptive teaching styles, as part of a major government overhaul to be announced on Monday. Some £1.6bn over three years will be provided to early years, schools and colleges through an \"inclusive mainstream fund\". Another £1.8bn over the same period will go towards creating an \"experts at hand\" service, made up of specialists such as SEND teachers and speech and language therapists in every area. Schools will be able to draw from this bank on demand regardless of whether pupils have education, health and care plans (EHCPs) - legal documents setting out the support children with SEND are entitled to - the Department for Education (DfE) said. A further £200m will be invested in SEND outreach teams for communities, and another £200m for local authorities to \"transform how they operate in line with our reforms while maintaining current SEND services\", the DfE said. Unions broadly welcomed the commitment to reform but warned they would be scrutinising the detail when the Schools White Paper is released to see whether the changes are enough. Prime Minister Sir Keir Starmer promised \"tailored support\" for families and an end to the \"one size fits all system\". \"I've heard first hand the struggles and exhaustion faced by too many parents who feel they have to fight the system to get their child the support they need,\" he said. \"But getting the right support should never be a battle - it should be a given.\" Read more from Sky News:BAFTAs red carpet: All the fashion from the starsCall for 'treason' probe into Andrew's Epstein links  Education Secretary Bridget Phillipson said the government was \"fiercely ambitious for children and young people with SEND\", who deserve a system that \"lifts them up, and that puts no limit on what they can go on to achieve\". She said: \"These reforms are a watershed moment for a generation of young people and generations to come, and a major milestone in this government's mission to make sure opportunity is for each and every child.\" But public service union Unison said the money \"has to go where it's needed\" and \"exactly how that will happen under these new plans is not clear\". Head of education at the union Mike Short said: \"The broad themes in the White Paper are encouraging and cutting the disadvantage gap is key if every child is to achieve and thrive. \"Any reforms must ensure there's enough funding to support all children and pay staff properly for the work they do.\" He added: \"Ministers and schools must properly recognise and reward the vital role support staff play in delivering for children with SEND.\" The National Association of Headteachers welcomed the \"principle\" of more support for pupils in mainstream schools and said \"along with this significant investment, we will be scrutinising the details closely and speaking to school leaders to weigh up whether it is sufficient\". \"There will always be some pupils whose needs are so great that they require support in a special school, and it's crucial the government's plans ensure all children get the support they need at the right time in the right setting,\" Paul Whiteman, general secretary of the union, said. Jon Sparkes, chief executive of learning disability charity Mencap, said: \"The move to make mainstream schools more inclusive is welcome news. \"Families must have their children's needs identified early and for them to be given the right help straight away, backed by services fully funded to do the job, and rights underpinned by law.\" The Institute for Public Policy Research think tank said \"no plan will be perfect\" but that reforms to the system should not become the next \"political flashpoint\" in Westminster. \"The costs of delay are already being felt,\" associate director Avnee Morjaria said. \"This must now be a moment for everyone to get behind a serious programme of reform.\""
    },
    {
        "title": "British rising star Robert Aramayo beats Timothee Chalamet and Leonardo DiCaprio to acting BAFTA - as One Battle After Another named best film",
        "description": "British film newcomer Robert Aramayo has been named best actor at the BAFTAs - beating favourite Timothee Chalamet and other A-listers including Leonardo DiCaprio to win the prize.",
        "url": "https://news.sky.com/story/british-rising-star-robert-aramayo-beats-timothee-chalamet-and-leonardo-dicaprio-to-acting-bafta-as-one-battle-after-another-named-best-film-13510746",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-robert-aramayo-baftas_7172288.jpg?20260222195807",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-22 13:40:00",
        "Headline": "Robert Aramayo won the award for his performance in I Swear, which tells the real-life story of Tourette's campaigner John Davidson, while Irish actress Jessie Buckley was named best actress for her performance in Shakespeare biopic Hamnet.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n British film newcomer Robert Aramayo has been named best actor at the BAFTAs - beating favourite Timothee Chalamet and other A-listers including Leonardo DiCaprio to win the prize. Aramayo won the award for his performance in I Swear, which tells the real-life story of Tourette's campaigner John Davidson, while Irish actress Jessie Buckley was named best actress for her performance in the Shakespeare biopic Hamnet. Paul Thomas Anderson's comedy-thriller One Battle After Another, starring DiCaprio, Teyana Taylor, Chase Infiniti and Sean Penn, was the biggest winner of the night, picking up six BAFTAs including best film, best director, and supporting actor for Penn. Accepting the best film award, Anderson - who had earlier almost dropped his BAFTA for best adapted screenplay - said it was a \"tremendous honour\", adding: \"Anybody who says that movies aren't good any more can piss right off because this is a great f***ing year.\" Prince William, who is president of BAFTA, and Kate were in the room to cheer the winners on, alongside other stars including nominees Emma Stone and Kate Hudson, music stars Little Simz, Stormzy and Jessie Ware, and Kylie Jenner - here in the UK to support her boyfriend Chalamet. Snacks for the stars Host Alan Cumming brought some humour to the show, offering snacks to the A-listers - Jammie Dodgers for Chalamet and Jenner, Twiglets for Rose Byrne, and an oaty flapjack for DiCaprio (who said it sounded \"fantastic\"). During his speech, Aramayo was cheered on by his dad, and became emotional as he told the BAFTAs audience: \"I honestly cannot believe that I have won this award.\" The 33-year-old, who grew up in Hull, thanked fellow nominee Ethan Hawke, and said: \"Everyone in this category blows me away. \"When I was in school, Ethan Hawke came in to speak to us in Julliard and he gave an amazing talk on longevity as an actor, about protecting your instrument and avoiding self-destructive behaviours, and it had a great impact on everyone in the room. \"So to be in this category with you tonight is incredible. Thank you, Ethan.\" The award was his second of the night, coming not long after he had accepted the rising star prize - the only one to be chosen by a public vote - and I Swear also picked up a third award for its casting. 'Nuclear bad fake tan' In contrast to Aramayo, Buckley was the favourite to win the best actress award after picking up the prize at the Critics Choice Awards and Golden Globes earlier this year. She is the first Irish star to take home the prize. \"As a little girl, I never in a million years thought I would get to make a film,\" she said in her speech. Recalling her early days as an actress, she said: \"I had nuclear bad fake tan on, white hoop earrings, a polka-dot red skirt and had the audacity to say one day I wanted to be like Judi Dench.\" Buckley, who rose to fame on the talent show I'd Do Anything, coming runner-up in the series' search to find a lead to play Nancy in the 2009 West End revival of the British musical Oliver, said it was \"nuts\" to be on stage, winning a BAFTA, and paid tribute to the \"women past, present and future who taught me and continue to teach me how to do it differently\". Addressing her fellow nominees, the Irish actress said: \"You are all just radical and you are doing it for the naughty girls, and I'm in awe of all your incredible performances.\" She also dedicated the award to her daughter, saying: \"It's the best role of my life being your mum and I promise to continue to be disobedient so you can belong to a world in all your complete wildness as a young woman. I am very grateful for this.\" Read more on the BAFTAs:The full list of winnersThe best red carpet fashion Wins for Sinners and Frankenstein Paul Mescal plays Shakespeare alongside Buckley, who plays his wife, Agnes, in Hamnet. The film tells the story of the death of their son, Hamnet, from the plague, and how Shakespeare was inspired to write Hamlet. Buckley's win was one of two for the film, which also picked up the prize for outstanding British film. Arts and entertainment correspondent Hugging his dad as his name was called, Robert Aramayo was the big BAFTA surprise this year - a relative unknown beating the likes of favourite Timothee Chalamet and awards veteran Leonardo DiCaprio. BAFTA has form for going its own way, especially when it comes to recognising British films that may not break through in Hollywood, and Aramayo's performance in I Swear stopped critics in their tracks. This was also a night that saw the big American films rising to the top. Vampire horror Sinners took home three gongs, including best supporting actress for British star Wunmi Mosaku, as did Frankenstein. But One Battle After Another - a film that has felt increasingly timely, with authority seen as unpredictable, militarised and with the power to destabilise entire neighbourhoods - was the night's big winner. As he accepted the award for best film, Anderson said: \"I know what freedom is - it's filmmaking without fear... See you at the bar.\" A sentiment worth celebrating. Producer Sir Sam Mendes acknowledged the other nominees in the category and said: \"We are not great as an industry or a culture for patting ourselves on the back, but perhaps we should.\" Elsewhere, period vampire horror Sinners, starring Michael B Jordan, picked up three awards, including best supporting actress for British star Wunmi Mosaku, and the prizes for original screenplay and score. Frankenstein, starring Jacob Elordi, also won three - for costume, make-up and hair, and production design."
    },
    {
        "title": "Call for 'treason' probe into Andrew's Epstein links - as searches at ex-duke's former home continue",
        "description": "Searches of Andrew Mountbatten-Windsor's former home have continued for a fourth day - as a Conservative former security minister called for a \"treason\" probe into Andrew's links to disgraced financier Jeffrey Epstein. ",
        "url": "https://news.sky.com/story/inconceivable-andrews-guards-didnt-see-anything-says-ex-head-of-uk-royal-protection-13510640",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-andrew-mountbatten-windsor_7170540.jpg?20260220200932",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-22 03:11:00",
        "Headline": "Conservative former security minister Tom Tugendhat is calling for a parliamentary investigation into Andrew and Peter Mandelson's links to Epstein.",
        "Content": "Searches of Andrew Mountbatten-Windsor's former home have continued for a fourth day - as a Conservative former security minister called for a \"treason\" probe into Andrew's links to disgraced financier Jeffrey Epstein.  Tom Tugendhat has suggested a parliamentary probe into Andrew and Peter Mandelson's links to Epstein, telling The Sun on Sunday: \"This goes beyond what a court could reasonably consider. Parliament must consider what it means for the country. \"If the worst is proved, do we need to revisit treason laws written 700 years ago?\" Education Secretary Bridget Phillipson suggested the UK government is open to taking further steps regarding the fallout from Andrew's arrest. \"We're not ruling anything out around this,\" she told Sunday Morning with Trevor Phillips. She also said the government would look \"at any sensible proposals\" when asked about the possibility of an independent judge-led inquiry. But, Ms Phillipson added, the government would not be setting out further steps until police \"have been able to do their work\", with a live investigation under way. Ms Phillipson confirmed the government will \"keep available\" the option of removing Andrew from the royal line of succession, plans which had emerged on Friday. Reform UK's Treasury spokesman Robert Jenrick will support a possible government bill to remove Andrew from the line of succession, he told Sunday Morning with Trevor Phillips. \"If the government brings forward this bill with the support of the King, then we will back it,\" Mr Jenrick said. He also said he was open to a parliamentary probe into both Andrew and Mr Mandelson, who is being investigated for potential misconduct in public office. \"The King serves this country extremely well,\" Mr Jenrick said but added that Andrew had \"disgraced the Royal Family, and he's disgraced our country in the process\". \"And whatever happens, whether he's ultimately prosecuted or not, he should now just go off, lead a private life and allow the King and the rest of the Royal Family to continue doing the good job that they do for us.\" Read more: What exactly is misconduct in public office? The Sunday Times reported Metropolitan Police officers assigned to Andrew were instructed to provide security for a dinner party at Epstein's residence in New ‌York in 2010. The newspaper cited emails from the Epstein files that appear to detail arrangements for Andrew to stay with the ​late paedophile financier in December 2010, along ‌with his two protection officers from the Met Police. Police ‌said they have not identified any wrongdoing by the protection officers at this stage. Asked to respond to Sunday's reports, the Met Police said it had no further comment. Read more from Sky News:Three dead and four others injured in crashTrump sending 'great hospital boat' to Greenland Royal biographer and historian Andrew Morton told Sunday Morning with Trevor Phillips the fallout surrounding Andrew could have particularly grave consequences for the Royal Family because there is \"no end in sight\". Mr Morton, who wrote a biography of the late Princess Diana, said there was very little the King could do to stop the fallout, as he publicly let the police lead on the matter, and there was now \"blood seeping under the doorway on a regular basis\". Mr Morton said he expected police investigating Andrew would have looked at \"the money trail\" - including Sarah Ferguson borrowing money from Epstein. \"The money side of things will be, I would have thought, front and central in this investigation,\" he said. Mr Morton added: \"This is a turning moment for the monarchy.\" Thames Valley Police has said the searches at Royal Lodge in Windsor would continue until Monday. On Sunday, images showed cars with police officers still moving in and out of Royal Lodge, a few miles from Windsor Castle. The former prince was arrested on Thursday, with Thames Valley Police later releasing a statement saying it had \"arrested a man in his sixties from Norfolk on suspicion of misconduct in public office\". Andrew was released from the Aylsham police station after 11 hours of questioning. Andrew has always strenuously denied any wrongdoing."
    },
    {
        "title": "As protests resume in Tehran, Iran's regime may be ready to strike a deal with Trump",
        "description": "Student-led protests have taken place in Iran this weekend, coinciding with the start of the new university term and the 40th day of mourning for many of the thousands of people killed by security forces in early January.",
        "url": "https://news.sky.com/story/as-protests-resume-in-tehran-irans-regime-may-be-ready-to-strike-a-deal-with-trump-13510831",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-ayatollah-khamenei_7172050.jpg?20260222163812",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2026-02-22 16:22:00",
        "Headline": "Ayatollah Khamenei, who called some protesters 'naive and inexperienced', has signalled his country is prepared to work towards an agreement - but also willing to fight.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Student-led protests have taken place in Iran this weekend, coinciding with the start of the new university term and the 40th day of mourning for many of the thousands of people killed by security forces in early January. Pro-and anti-regime activists protested at five universities in Tehran on Saturday, in some instances facing off against each other. At the Ferdowsi University in Mashhad, Iran's second city and birthplace of Ayatollah Khamenei, video shows a large gathering of anti-regime protestors chanting \"so much crime all these years\" and \"death to this rule\". These demonstrations are nowhere near the scale of the protests six weeks ago which saw uprisings in towns and cities across all Iran's 31 provinces, but it is brave to be coming out at all given the authorities' crackdown in January. The numbers killed then are still unclear, but the US-based Human Rights Activists Agency (HRANA) says they have verified at least 7,015 fatalities and have thousands more cases under review.The government has admitted to 3,117 deaths including around 200 security personnel. Donald Trump has said he believes 32,000 people were killed. The 40th day is an important moment in the mourning process in Iran. During the revolution in 1979, 40th day commemorations became flashpoints for fresh protest, sparking renewed crackdowns and killings and further cycles of unrest. As a result, the Iranian regime has been wary of allowing mourners to gather for commemorative rituals. Last week, clashes around the 40th day took place in Abdanan, a city near the border with Iraq. Videos show people chanting \"death to Khamenei\" as they remembered Alireza Seydi, a 16-year-old boy killed on January 8th. In another video from the city, the sound of gunfire echoes across the valley. It is difficult to tell what exactly the response of the authorities has been to this latest unrest. Internet is back but it is patchy. On Tuesday, the Ayatollah gave a speech saying some of those who took part in the January protests had been \"naive and inexperienced\" and were deceived by the rioters, but that they were still \"part of us, they were our children\". Given the US military build-up across the Middle East, the Iranian authorities appear not to want to provoke Donald Trump by being heavy-handed with protesters - but, instead, to focus minds on further negotiations on Iran's nuclear programme which they say could take place next week. Read more:How Iran might be preparing for a potential US strikeUK has not agreed to let US strike Iran from British bases They are signalling that they are prepared to work towards a deal but that they stand ready to fight should the US strike. Now it is up to Donald Trump to decide whether and how long he is prepared to wait for a deal, and what he does if he fails to get one."
    },
    {
        "title": "Trump sending 'great hospital boat' to Greenland to 'take care of the sick'",
        "description": "Donald Trump has said he is sending a \"great hospital boat\" to Greenland, the semi-autonomous Danish territory he wants to acquire.",
        "url": "https://news.sky.com/story/trump-sending-great-hospital-boat-to-greenland-to-take-care-of-the-sick-13510664",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-white-house_7171621.jpg?20260222083020",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-22 08:09:00",
        "Headline": "The US president, who wants to acquire the semi-autonomous Danish territory, says a vessel is \"on the way\", though it is unclear if the help was requested.",
        "Content": "Donald Trump has said he is sending a \"great hospital boat\" to Greenland, the semi-autonomous Danish territory he wants to acquire. The US president threatened, at one point, to take the Arctic island by force in the interests of \"national security\". However, in late January he announced \"the framework of a future deal\" on Greenland and its security following talks with NATO secretary general Mark Rutte. Now, Mr Trump has claimed he is sending a boat to \"take care of the many people who are sick\" in Greenland, which has a universal public healthcare system. He announced the plan at a dinner for Republican governors at the White House. Mr Trump posted on Truth Social: \"Working with ‌the fantastic Governor of Louisiana, Jeff Landry, we are going to send a ​great hospital boat to Greenland to take care of the many people who are sick, and not being taken care ​of there. It's on the way!!!\" Louisiana Governor Jeff Landry reposted Mr Trump's message on X - and added: \"Thank you, President [Trump]! Proud to work with you on this important issue!\" The US Navy has two hospital ships, the Mercy and the Comfort, which support forces on deployments and provide disaster and humanitarian relief. The White House and ⁠Mr Landry's office have not made any further comment on the post - or revealed whether the ship had been requested by Denmark ‌or Greenland. Denmark's prime minister, Mette Frederiksen, said in a Facebook post on Sunday that she was \"happy to live in a country where there is free and equal access to health for all. Where it's not insurance and wealth that determine whether you get proper treatment\". \"You have the same approach in Greenland.\" Aaja Chemnitz, one of the two Greenlandic politicians in the Danish parliament, wrote on Facebook: \"Donald Trump wants to send a hospital ship to Greenland. \"It seems rather desperate, and does not contribute to the permanent and sustainable strengthening of the healthcare system that we need.\" Read more:NATO starts mission to strengthen presence in ArcticWhy Trump has insisted the US 'needs' Greenland Denmark maintains control of the territory's foreign affairs and defence. Troels Lund Poulsen, the country's defence minister, told Danish broadcaster DR on Sunday that the ship was not needed. \"The Greenlandic population receives the healthcare it needs,\" said Mr Poulsen. Mr Trump's post came hours after Denmark's Joint Arctic ​Command said it had evacuated a crew member of a US submarine off the coast of Greenland after the person needed medical treatment. The submariner was retrieved by a Danish Seahawk helicopter that had been deployed on an inspection ship."
    },
    {
        "title": "BAFTAs red carpet 2026: All the fashion from British and Hollywood stars",
        "description": "As well as the film prizes, red carpet fashion is also a huge part of any awards ceremony.",
        "url": "https://news.sky.com/story/baftas-red-carpet-2026-all-the-fashion-as-hollywood-stars-arrive-for-ceremony-13510744",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bafta-2026-baftas-kpop-demon-hunters_7171851.jpg?20260222142457",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-22 13:25:00",
        "Headline": "Emma Stone, Kate Hudson, Leonardo DiCaprio, Jessie Buckley, Teyana Taylor, Timothee Chalamet, Michael B Jordan, Carey Mulligan and Rose Byrne were among the stars on the red carpet.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n As well as the film prizes, red carpet fashion is also a huge part of any awards ceremony. Emma Stone, Kate Hudson, Leonardo DiCaprio, Jessie Buckley, Teyana Taylor, Timothee Chalamet, Michael B Jordan, Carey Mulligan and Rose Byrne were among the stars on the BAFTA Film Awards red carpet this year. One Battle After Another was the big winner, with acting prizes for Buckley and British rising star Robert Aramayo. Here are all the outfits as the stars arrived ahead of the ceremony."
    },
    {
        "title": "Three dead and four others injured in crash, says Police Service of Northern Ireland",
        "description": "Three people have died and four others were injured in a three-car crash in Co Tyrone.",
        "url": "https://news.sky.com/story/three-dead-and-four-injured-in-crash-in-northern-ireland-13510749",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-moy-county-tyrone-crash_7171967.jpg?20260222154151",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-22 13:36:00",
        "Headline": "A 23-year-old woman and two men, aged 31 and 48, died at the scene in the Armagh Road area of Moy, Co Tyrone.",
        "Content": "Three people have died and four others were injured in a three-car crash in Co Tyrone. The collision happened in the Armagh Road area of Moy at around 10.20pm on Saturday, the Police Service of Northern Ireland (PSNI) said. A 23-year-old woman and two men, aged 31 and 48, died at the scene. Four other people were injured, three of whom are receiving medical treatment. The crash involved a red BMW, a grey Volkswagen and a white Audi, police said. Fermanagh and South Tyrone MLA Diana Armstrong described it as \"a very dark day for families who have been plunged into shock and mourning\". Ms Armstrong said she is sending out her \"deepest sympathies and sincere condolences\", adding they must be \"totally at a loss to comprehend the scale of this tragedy\".The Ulster Unionist Party deputy leader said: \"The toll of the loss of life in this incident has shocked the local community and many will be holding those impacted in their thoughts and prayers today.\"My thanks go to the PSNI and emergency services who attended the scene and transferred those affected for medical treatment.\" SDLP Armagh councillor Thomas O'Hanlon said in a statement: \"Three families and their wider communities have been plunged into deep grief. \"There are truly no words that can ease such pain, other than to offer our thoughts and prayers at this incredibly difficult time.\" He also offered his condolences to the \"first responders from all emergency services who attended the scene and were faced with such harrowing circumstances\". Read more from Sky News:Man stabbed to death at skate park namedGirl and woman die in crash Police say enquiries are ongoing and have asked anyone who was in the area and witnessed the incident to contact them. The Armagh Road at Moy remains closed."
    },
    {
        "title": "British rising star Robert Aramayo beats Timothee Chalamet and Leonardo DiCaprio to acting BAFTA - as One Battle After Another named best film",
        "description": "British film newcomer Robert Aramayo has been named best actor at the BAFTAs - beating favourite Timothee Chalamet and other A-listers including Leonardo DiCaprio to win the prize.",
        "url": "https://news.sky.com/story/british-rising-star-robert-aramayo-beats-timothee-chalamet-and-leonardo-dicaprio-to-acting-bafta-as-one-battle-after-another-named-best-film-13510746",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-robert-aramayo-baftas_7172288.jpg?20260222195807",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-22 13:40:00",
        "Headline": "Robert Aramayo won the award for his performance in I Swear, which tells the real-life story of Tourette's campaigner John Davidson, while Irish actress Jessie Buckley was named best actress for her performance in Shakespeare biopic Hamnet.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n British film newcomer Robert Aramayo has been named best actor at the BAFTAs - beating favourite Timothee Chalamet and other A-listers including Leonardo DiCaprio to win the prize. Aramayo won the award for his performance in I Swear, which tells the real-life story of Tourette's campaigner John Davidson, while Irish actress Jessie Buckley was named best actress for her performance in the Shakespeare biopic Hamnet. Paul Thomas Anderson's comedy-thriller One Battle After Another, starring DiCaprio, Teyana Taylor, Chase Infiniti and Sean Penn, was the biggest winner of the night, picking up six BAFTAs including best film, best director, and supporting actor for Penn. Accepting the best film award, Anderson - who had earlier almost dropped his BAFTA for best adapted screenplay - said it was a \"tremendous honour\", adding: \"Anybody who says that movies aren't good any more can piss right off because this is a great f***ing year.\" Prince William, who is president of BAFTA, and Kate were in the room to cheer the winners on, alongside other stars including nominees Emma Stone and Kate Hudson, music stars Little Simz, Stormzy and Jessie Ware, and Kylie Jenner - here in the UK to support her boyfriend Chalamet. Snacks for the stars Host Alan Cumming brought some humour to the show, offering snacks to the A-listers - Jammie Dodgers for Chalamet and Jenner, Twiglets for Rose Byrne, and an oaty flapjack for DiCaprio (who said it sounded \"fantastic\"). During his speech, Aramayo was cheered on by his dad, and became emotional as he told the BAFTAs audience: \"I honestly cannot believe that I have won this award.\" The 33-year-old, who grew up in Hull, thanked fellow nominee Ethan Hawke, and said: \"Everyone in this category blows me away. \"When I was in school, Ethan Hawke came in to speak to us in Julliard and he gave an amazing talk on longevity as an actor, about protecting your instrument and avoiding self-destructive behaviours, and it had a great impact on everyone in the room. \"So to be in this category with you tonight is incredible. Thank you, Ethan.\" The award was his second of the night, coming not long after he had accepted the rising star prize - the only one to be chosen by a public vote - and I Swear also picked up a third award for its casting. 'Nuclear bad fake tan' In contrast to Aramayo, Buckley was the favourite to win the best actress award after picking up the prize at the Critics Choice Awards and Golden Globes earlier this year. She is the first Irish star to take home the prize. \"As a little girl, I never in a million years thought I would get to make a film,\" she said in her speech. Recalling her early days as an actress, she said: \"I had nuclear bad fake tan on, white hoop earrings, a polka-dot red skirt and had the audacity to say one day I wanted to be like Judi Dench.\" Buckley, who rose to fame on the talent show I'd Do Anything, coming runner-up in the series' search to find a lead to play Nancy in the 2009 West End revival of the British musical Oliver, said it was \"nuts\" to be on stage, winning a BAFTA, and paid tribute to the \"women past, present and future who taught me and continue to teach me how to do it differently\". Addressing her fellow nominees, the Irish actress said: \"You are all just radical and you are doing it for the naughty girls, and I'm in awe of all your incredible performances.\" She also dedicated the award to her daughter, saying: \"It's the best role of my life being your mum and I promise to continue to be disobedient so you can belong to a world in all your complete wildness as a young woman. I am very grateful for this.\" Read more on the BAFTAs:The full list of winnersThe best red carpet fashion Wins for Sinners and Frankenstein Paul Mescal plays Shakespeare alongside Buckley, who plays his wife, Agnes, in Hamnet. The film tells the story of the death of their son, Hamnet, from the plague, and how Shakespeare was inspired to write Hamlet. Buckley's win was one of two for the film, which also picked up the prize for outstanding British film. Arts and entertainment correspondent Hugging his dad as his name was called, Robert Aramayo was the big BAFTA surprise this year - a relative unknown beating the likes of favourite Timothee Chalamet and awards veteran Leonardo DiCaprio. BAFTA has form for going its own way, especially when it comes to recognising British films that may not break through in Hollywood, and Aramayo's performance in I Swear stopped critics in their tracks. This was also a night that saw the big American films rising to the top. Vampire horror Sinners took home three gongs, including best supporting actress for British star Wunmi Mosaku, as did Frankenstein. But One Battle After Another - a film that has felt increasingly timely, with authority seen as unpredictable, militarised and with the power to destabilise entire neighbourhoods - was the night's big winner. As he accepted the award for best film, Anderson said: \"I know what freedom is - it's filmmaking without fear... See you at the bar.\" A sentiment worth celebrating. Producer Sir Sam Mendes acknowledged the other nominees in the category and said: \"We are not great as an industry or a culture for patting ourselves on the back, but perhaps we should.\" Elsewhere, period vampire horror Sinners, starring Michael B Jordan, picked up three awards, including best supporting actress for British star Wunmi Mosaku, and the prizes for original screenplay and score. Frankenstein, starring Jacob Elordi, also won three - for costume, make-up and hair, and production design."
    },
    {
        "title": "Prince William pays tribute to TikToker army medic following her death aged 25",
        "description": "Prince William has told of his \"immense sadness\" at the death of an army medic who had become a TikTok star.",
        "url": "https://news.sky.com/story/prince-william-pays-tribute-to-tiktoker-army-medic-following-her-death-aged-25-13510714",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-prince-william-welsh-guards_7171863.jpg?20260222153218",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-22 11:36:00",
        "Headline": "Corporal Lucy Wilde was reportedly found dead at her barracks in Warminster, Wiltshire, earlier this month.",
        "Content": "Prince William has told of his \"immense sadness\" at the death of an army medic who had become a TikTok star. Corporal Lucy Wilde, 25, who documented her fitness routines and daily life on the social media platform, was reportedly found dead at her barracks in Warminster, Wiltshire, on 5 February. The Prince of Wales, colonel of the Welsh Guards, was struck by the \"warmth and compassion\" of Cpl Wilde, of the Royal Yorkshire Regiment, when he met her in 2024. \"It was with immense sadness that I learned of Cpl Lucy Wilde's death,\" said the prince. \"I remember our meeting during her time with the Welsh Guards, where her warmth and compassion were unmistakable.\" \"She served with courage and distinction as a medic and sought always to help others. I send my heartfelt condolences to her family and friends.\" The Ministry of Defence said the circumstances surrounding Cpl Wilde's death were being investigated, it was reported. Cpl Wilde was previously attached to the Welsh Guards. In a statement, the regiment said: \"It is with deep sadness that the Welsh Guards mark the passing of Corporal Lucy Wilde. \"Lucy was attached to the battalion until Christmas, before moving on to her next posting with the 2nd Battalion, Royal Yorkshire Regiment. \"In the short time she spent with us, she quickly became part of the Welsh Guards family - not just as an exceptional medic, but through the bonds of friendship she formed in the Welsh Guards, along with the warmth, humour and professionalism she brought to all who worked with her. \"She was known for her calmness under pressure, tireless care for others, and unwavering commitment to her role.\" Read more from Sky News:Bodies found in North Wales mountain rangeCharles Bronson vows to 'expose unlawful sentence' Cpl Wilde was commended after being first on the scene of a \"mass casualty\" incident in the Falklands when a vehicle overturned, injuring a number of Welsh Guards. \"Lucy was first on the scene, and worked relentlessly to treat casualties and ensure every Guardsman was accounted for and safe,\" the statement added. \"Her actions that day were nothing short of outstanding, and she was rightly commended for her courage and professionalism. \"Lucy had a rare ability to lift those around her. She was popular, genuine and deeply respected. Her loss is felt across the battalion and far beyond.\""
    },
    {
        "title": "The pressure is building on government to reform student loan repayments",
        "description": "It's a debate that's gaining momentum, and ministers could score some political points among millions of graduates in England if they choose to reform the student loans system.",
        "url": "https://news.sky.com/story/the-pressure-is-building-on-government-to-reform-student-loan-repayments-13510747",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-graduates-students_6989170.jpg?20250812173038",
        "type": "UK",
        "Author": "Lucy McDaid, political correspondent",
        "Date Published": "2026-02-22 13:39:00",
        "Headline": "Labour faces another backbench rebellion over the repayment threshold for student loans in England, which is being frozen for three years, meaning some workers will be dragged into making larger payments.",
        "Content": "By Lucy McDaid, political correspondent   It's a debate that's gaining momentum, and ministers could score some political points among millions of graduates in England if they choose to reform the student loans system. According to one Labour MP, it's \"the next welfare waiting to happen\", implying the government could have another rebellion on its hands if it doesn't act quickly. So, will it act? Well, Education Secretary Bridget Phillipson hasn't ruled out any changes and government sources aren't steering away from the idea that they are putting their heads together. Explainer: How to avoid crippling student debt That's despite refusing suggestions to lower repayments when speaking to Sky News on Sunday Morning with Trevor Phillips. Also, they're all too aware of the changing political landscape, with the Greens and Your Party increasingly positioning themselves as the alternatives to Labour. What exactly is the row about? It centres around Plan 2 loans. These were issued to undergraduate students who started uni from 2012, when fees went up to £9,000 a year, up until 2023. Graduates currently pay back 9% of their income when they earn above the current £28,470 threshold, and then interest is charged at the rate of Retail Prices Index (RPI) plus up to 3%, depending on salary. It's led to many seeing their debt increase years after leaving university, despite already having paid off thousands of pounds. The issue has been debated for a long time, but erupted again after the chancellor's budget last November. In it, Rachel Reeves said the repayment threshold in England will be frozen for three years from April 2027. The Welsh government has decided not to follow suit. This means that workers earning more than the threshold will be dragged into making larger repayments than they would be if the threshold rises with inflation. Analysis: Uni is not what it once was Parties pile pressure on Labour What's not helpful for Labour is that other parties are now piling on the pressure. The Conservatives have said they'd cut the amount of interest on the loans, while the Liberal Democrats are more generally promising to review the fairness of the system. Meanwhile, Green MP, Dr Ellie Chowns, said in a statement that the current system for student loans was \"clearly unfair\" and the \"Greens want to see tuition fees scrapped entirely and ultimately would write off existing undergraduate and PCDL [Professional Career and Development Loan] debts\". She added the party would support a series of immediate measures, including reversing the adjustment to repayment thresholds, reducing interest on loans and lowering the repayment rate. Read more:Call for change to loan paymentsInvestigation into student loans fraudUniversity tuition fees to increase But - as the government keeps reminding us - cash is in short supply, and all this comes at a time of renewed calls to increase spending on defence, in the face of global volatility. Charities and opposition parties also want to see how the Department for Education plans to fund its much-anticipated reforms to SEND provision, for example. Bridget Phillipson speaks about having to identify 'priorities' in government, but we could see ministers having to change course quickly on this issue if it unravels further into a political pile-on."
    },
    {
        "title": "Mainstream schools to receive extra funding for SEND pupils as part of £4bn package",
        "description": "Mainstream schools will receive direct funding to support children with special educational needs and disabilities (SEND) as part of a &#163;4bn package to make the system more inclusive.",
        "url": "https://news.sky.com/story/mainstream-schools-to-receive-extra-funding-for-send-pupils-as-part-of-1634bn-package-13510934",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-pupils-school_7172318.jpg?20260222204726",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-22 20:22:00",
        "Headline": "Education Secretary Bridget Phillipson said the government is \"fiercely ambitious for children and young people with SEND\", who deserve a system that \"lifts them up\".",
        "Content": "Mainstream schools will receive direct funding to support children with special educational needs and disabilities (SEND) as part of a £4bn package to make the system more inclusive. Targeted interventions such as small-group language work will receive funding, and there will be help for staff to introduce adaptive teaching styles, as part of a major government overhaul to be announced on Monday. Some £1.6bn over three years will be provided to early years, schools and colleges through an \"inclusive mainstream fund\". Another £1.8bn over the same period will go towards creating an \"experts at hand\" service, made up of specialists such as SEND teachers and speech and language therapists in every area. Schools will be able to draw from this bank on demand regardless of whether pupils have education, health and care plans (EHCPs) - legal documents setting out the support children with SEND are entitled to - the Department for Education (DfE) said. A further £200m will be invested in SEND outreach teams for communities, and another £200m for local authorities to \"transform how they operate in line with our reforms while maintaining current SEND services\", the DfE said. Unions broadly welcomed the commitment to reform but warned they would be scrutinising the detail when the Schools White Paper is released to see whether the changes are enough. Prime Minister Sir Keir Starmer promised \"tailored support\" for families and an end to the \"one size fits all system\". \"I've heard first hand the struggles and exhaustion faced by too many parents who feel they have to fight the system to get their child the support they need,\" he said. \"But getting the right support should never be a battle - it should be a given.\" Read more from Sky News:BAFTAs red carpet: All the fashion from the starsCall for 'treason' probe into Andrew's Epstein links  Education Secretary Bridget Phillipson said the government was \"fiercely ambitious for children and young people with SEND\", who deserve a system that \"lifts them up, and that puts no limit on what they can go on to achieve\". She said: \"These reforms are a watershed moment for a generation of young people and generations to come, and a major milestone in this government's mission to make sure opportunity is for each and every child.\" But public service union Unison said the money \"has to go where it's needed\" and \"exactly how that will happen under these new plans is not clear\". Head of education at the union Mike Short said: \"The broad themes in the White Paper are encouraging and cutting the disadvantage gap is key if every child is to achieve and thrive. \"Any reforms must ensure there's enough funding to support all children and pay staff properly for the work they do.\" He added: \"Ministers and schools must properly recognise and reward the vital role support staff play in delivering for children with SEND.\" The National Association of Headteachers welcomed the \"principle\" of more support for pupils in mainstream schools and said \"along with this significant investment, we will be scrutinising the details closely and speaking to school leaders to weigh up whether it is sufficient\". \"There will always be some pupils whose needs are so great that they require support in a special school, and it's crucial the government's plans ensure all children get the support they need at the right time in the right setting,\" Paul Whiteman, general secretary of the union, said. Jon Sparkes, chief executive of learning disability charity Mencap, said: \"The move to make mainstream schools more inclusive is welcome news. \"Families must have their children's needs identified early and for them to be given the right help straight away, backed by services fully funded to do the job, and rights underpinned by law.\" The Institute for Public Policy Research think tank said \"no plan will be perfect\" but that reforms to the system should not become the next \"political flashpoint\" in Westminster. \"The costs of delay are already being felt,\" associate director Avnee Morjaria said. \"This must now be a moment for everyone to get behind a serious programme of reform.\""
    },
    {
        "title": "Call for 'treason' probe into Andrew's Epstein links - as searches at ex-duke's former home continue",
        "description": "Searches of Andrew Mountbatten-Windsor's former home have continued for a fourth day - as a Conservative former security minister called for a \"treason\" probe into Andrew's links to disgraced financier Jeffrey Epstein. ",
        "url": "https://news.sky.com/story/inconceivable-andrews-guards-didnt-see-anything-says-ex-head-of-uk-royal-protection-13510640",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-andrew-mountbatten-windsor_7170540.jpg?20260220200932",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-22 03:11:00",
        "Headline": "Conservative former security minister Tom Tugendhat is calling for a parliamentary investigation into Andrew and Peter Mandelson's links to Epstein.",
        "Content": "Searches of Andrew Mountbatten-Windsor's former home have continued for a fourth day - as a Conservative former security minister called for a \"treason\" probe into Andrew's links to disgraced financier Jeffrey Epstein.  Tom Tugendhat has suggested a parliamentary probe into Andrew and Peter Mandelson's links to Epstein, telling The Sun on Sunday: \"This goes beyond what a court could reasonably consider. Parliament must consider what it means for the country. \"If the worst is proved, do we need to revisit treason laws written 700 years ago?\" Education Secretary Bridget Phillipson suggested the UK government is open to taking further steps regarding the fallout from Andrew's arrest. \"We're not ruling anything out around this,\" she told Sunday Morning with Trevor Phillips. She also said the government would look \"at any sensible proposals\" when asked about the possibility of an independent judge-led inquiry. But, Ms Phillipson added, the government would not be setting out further steps until police \"have been able to do their work\", with a live investigation under way. Ms Phillipson confirmed the government will \"keep available\" the option of removing Andrew from the royal line of succession, plans which had emerged on Friday. Reform UK's Treasury spokesman Robert Jenrick will support a possible government bill to remove Andrew from the line of succession, he told Sunday Morning with Trevor Phillips. \"If the government brings forward this bill with the support of the King, then we will back it,\" Mr Jenrick said. He also said he was open to a parliamentary probe into both Andrew and Mr Mandelson, who is being investigated for potential misconduct in public office. \"The King serves this country extremely well,\" Mr Jenrick said but added that Andrew had \"disgraced the Royal Family, and he's disgraced our country in the process\". \"And whatever happens, whether he's ultimately prosecuted or not, he should now just go off, lead a private life and allow the King and the rest of the Royal Family to continue doing the good job that they do for us.\" Read more: What exactly is misconduct in public office? The Sunday Times reported Metropolitan Police officers assigned to Andrew were instructed to provide security for a dinner party at Epstein's residence in New ‌York in 2010. The newspaper cited emails from the Epstein files that appear to detail arrangements for Andrew to stay with the ​late paedophile financier in December 2010, along ‌with his two protection officers from the Met Police. Police ‌said they have not identified any wrongdoing by the protection officers at this stage. Asked to respond to Sunday's reports, the Met Police said it had no further comment. Read more from Sky News:Three dead and four others injured in crashTrump sending 'great hospital boat' to Greenland Royal biographer and historian Andrew Morton told Sunday Morning with Trevor Phillips the fallout surrounding Andrew could have particularly grave consequences for the Royal Family because there is \"no end in sight\". Mr Morton, who wrote a biography of the late Princess Diana, said there was very little the King could do to stop the fallout, as he publicly let the police lead on the matter, and there was now \"blood seeping under the doorway on a regular basis\". Mr Morton said he expected police investigating Andrew would have looked at \"the money trail\" - including Sarah Ferguson borrowing money from Epstein. \"The money side of things will be, I would have thought, front and central in this investigation,\" he said. Mr Morton added: \"This is a turning moment for the monarchy.\" Thames Valley Police has said the searches at Royal Lodge in Windsor would continue until Monday. On Sunday, images showed cars with police officers still moving in and out of Royal Lodge, a few miles from Windsor Castle. The former prince was arrested on Thursday, with Thames Valley Police later releasing a statement saying it had \"arrested a man in his sixties from Norfolk on suspicion of misconduct in public office\". Andrew was released from the Aylsham police station after 11 hours of questioning. Andrew has always strenuously denied any wrongdoing."
    },
    {
        "title": "Man, 20, stabbed to death at Northampton skate park named",
        "description": "A 20-year-old man who was stabbed to death at a skate park has been named.",
        "url": "https://news.sky.com/story/man-20-stabbed-to-death-at-skate-park-named-13509118",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mason-miller-skate-park-stabbing_7171736.jpg?20260222115548",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-22 00:01:00",
        "Headline": "Mason Miller died and a 17-year-old boy suffered life-threatening injuries following the stabbing in Northampton on Wednesday.",
        "Content": "A 20-year-old man who was stabbed to death at a skate park has been named. Mason Miller died and a 17-year-old boy suffered life-threatening injuries following the stabbing in Northampton on Wednesday afternoon. The boy remains in hospital and a murder investigation has been launched into Mr Miller's death. Police were called to the skate park in Ringway in the Briar Hill area of Northampton at about 3.30pm on Wednesday. As part of the wider police investigation, two 15-year-old boys and a 14-year-old youth appeared before Northampton Magistrates Court on Saturday charged with violent disorder and possession of an offensive weapon. They were granted conditional bail and placed into the care of the local authority. Northamptonshire Police said in a statement that dozens of detectives, officers and staff had been carrying out house-to-house enquiries following the stabbing. There is an increased police presence in the area, including high-visibility patrols intended to offer reassurance and support the community. Read more from Sky News:Trump sending 'great hospital boat' to GreenlandTeam GB win record-equalling medal haul at Winter Olympics Detective Inspector Matt Bly said that the case remained a \"fast-moving investigation\" in which a number of lines of inquiry were being pursued by detectives. He said: \"This remains a murder investigation, and our thoughts first and foremost remain with Mason's family at this difficult time. \"The family understandably are still trying to come to terms with Wednesday's tragic events and, as such, have asked for complete privacy at this time.\" Police have urged anyone with information to come forward."
    },
    {
        "title": "Girl, 7, and woman die in crash in Hampshire",
        "description": "A seven-year-old girl and a 43-year-old woman have died in a crash in Hampshire.",
        "url": "https://news.sky.com/story/girl-7-and-woman-die-in-crash-in-hampshire-13509119",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hindhead-tunnel-hampshire_7171776.jpg?20260222123935",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-22 00:01:00",
        "Headline": "Emergency crews were called to the A3 southbound carriageway after it was reported a red Ford Fiesta had left the road.",
        "Content": "A seven-year-old girl and a 43-year-old woman have died in a crash in Hampshire. Emergency services were called just after 10am on Thursday following a single-vehicle collision on the southbound carriageway of the A3, police said. It was reported that a red Ford Fiesta had left the road. The incident happened just after Hindhead Tunnel. Hampshire and Isle of Wight Constabulary said the two people in the car, a 43-year-old woman and a seven-year-old girl, who were both from Portsmouth, died at the scene. The road was closed for several hours following the crash. Read more from Sky News:Bodies found in Eryri mountain rangeBishop of Lincoln arrested on suspicion of sexual assault The force has appealed for witnesses and anyone with dashcam footage around the incident to come forward."
    },
    {
        "title": "Mexican drug lord 'El Mencho' killed in military operation - sparking retaliatory violence",
        "description": "One of Mexico's most notorious drug lords, \"El Mencho\", has been killed in a military operation carried out by Mexican special forces &#8204;with \"intelligence\" support from the US.",
        "url": "https://news.sky.com/story/mexican-drug-lord-el-mencho-killed-in-military-operation-official-says-13510875",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-el-mencho-nemesio-ruben_7172145.jpg?20260222174359",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-22 17:37:00",
        "Headline": "Nemesio Ruben Oseguera Cervantes was the leader of the Jalisco New Generation Cartel, one of the nation's most powerful criminal organisations.",
        "Content": "One of Mexico's most notorious drug lords, \"El Mencho\", has been killed in a military operation carried out by Mexican special forces ‌with \"intelligence\" support from the US. The leader of the Jalisco New Generation Cartel, whose real name is Nemesio Ruben Oseguera Cervantes, was wounded in an operation to capture him in Tapalpa, Jalisco state, on Sunday. He later died while being flown to Mexico City, the country's defence department said. Jalisco is the base of the cartel known for trafficking large quantities of fentanyl and other drugs to the US. The cartel was designated as a foreign terrorist organisation by Donald Trump's administration earlier this month. During the operation, the defence department said troops came under fire and killed four people. Three others, including Oseguera Cervantes, were wounded and later died. Two more people were arrested, and armoured vehicles, rocket launchers and other firearms were seized. Three members of the armed forces were also wounded. The US Embassy in Mexico said on X that Mexican special forces carried out the operation \"within the framework of bilateral cooperation, with U.S. authorities providing complementary intelligence\". US deputy secretary of state Christopher Landau, previously ambassador to Mexico, said Oseguera Cervantes' killing was a \"great development\" for the US and Mexico, as well as the rest of Latin America. Roads blocked and cars set on fire After news of Oseguera Cervantes' death, cartel henchmen blockaded highways with burning cars and torched businesses in several states, paralysing parts of the country. Such tactics are commonly used by the cartels to block military operations. In Jalisco's popular beach resort of Puerto Vallarta, frightened tourists on social media described a \"war zone\" as plumes ​of smoke billowed into the sky. Air Canada, United Airlines, Aeromexico and American Airlines suspended flight operations on Sunday. Read more from Sky News:Iran's regime may be ready to strike a deal with TrumpVirtual reality offers escape to Gaza's children The US State Department warned US citizens in Jalisco, Tamaulipas, Michoacan, Guerrero and Nuevo Leon states to remain in safe places while security operations are carried out. Jalisco governor Pablo Lemus told residents to stay at home and suspended public transportation. Schools in the state have also been closed on Monday. Reaction to operation In a post on X, President Claudia Sheinbaum said: \"There is full coordination with the governments of all states; we must remain informed and calm... in most parts of the country, activities are proceeding normally. \"My recognition goes to the Mexican Army, the National Guard, the Armed Forces, and the Security Cabinet. We work every day for the peace, security, justice, and well-being of Mexico.\" She said she would ​strengthen efforts to cooperate with the US to fight cartels, but vowed to uphold Mexico's sovereignty and warned against any unilateral military action ​by the US in Mexico. In January after the US capture of Venezuelan President Nicolas Maduro, President Trump said \"the cartels are running Mexico\", and warned \"we are ⁠going to start now hitting land with regard to the cartels\". The US State Department had offered a reward of up to $15m for information leading to the arrest of El Mencho. Oseguera Cervantes was heavily involved in drug trafficking since the 1990s. He was convicted of conspiracy to distribute heroin in the US District Court for the Northern District of California in 1994 and spent almost three years in prison. Following his release from custody, Oseguera Cervantes returned to Mexico and continued drug trafficking operations. Since 2017, he was indicted several times in the United States District Court for the District of Columbia. One of Mexico's most powerful criminal organisations  The Jalisco New Generation Cartel is one of the most powerful and fastest-growing criminal organisations in Mexico. The cartel carried out a daring assassination attempt in 2020 with grenades and high-powered rifles against the then-head of the capital's police force, who is now head of federal security, in the heart of Mexico City. The US Drug Enforcement Administration considers it to be as powerful as the Sinaloa cartel, one of Mexico's most notorious criminal groups. The cartel has a presence in all 50 US states and is believed to be one of the leading suppliers of cocaine to the US market. Like the Sinaloa cartel, it earns billions of dollars from the production of methamphetamines and fentanyl."
    },
    {
        "title": "As protests resume in Tehran, Iran's regime may be ready to strike a deal with Trump",
        "description": "Student-led protests have taken place in Iran this weekend, coinciding with the start of the new university term and the 40th day of mourning for many of the thousands of people killed by security forces in early January.",
        "url": "https://news.sky.com/story/as-protests-resume-in-tehran-irans-regime-may-be-ready-to-strike-a-deal-with-trump-13510831",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-ayatollah-khamenei_7172050.jpg?20260222163812",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2026-02-22 16:22:00",
        "Headline": "Ayatollah Khamenei, who called some protesters 'naive and inexperienced', has signalled his country is prepared to work towards an agreement - but also willing to fight.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Student-led protests have taken place in Iran this weekend, coinciding with the start of the new university term and the 40th day of mourning for many of the thousands of people killed by security forces in early January. Pro-and anti-regime activists protested at five universities in Tehran on Saturday, in some instances facing off against each other. At the Ferdowsi University in Mashhad, Iran's second city and birthplace of Ayatollah Khamenei, video shows a large gathering of anti-regime protestors chanting \"so much crime all these years\" and \"death to this rule\". These demonstrations are nowhere near the scale of the protests six weeks ago which saw uprisings in towns and cities across all Iran's 31 provinces, but it is brave to be coming out at all given the authorities' crackdown in January. The numbers killed then are still unclear, but the US-based Human Rights Activists Agency (HRANA) says they have verified at least 7,015 fatalities and have thousands more cases under review.The government has admitted to 3,117 deaths including around 200 security personnel. Donald Trump has said he believes 32,000 people were killed. The 40th day is an important moment in the mourning process in Iran. During the revolution in 1979, 40th day commemorations became flashpoints for fresh protest, sparking renewed crackdowns and killings and further cycles of unrest. As a result, the Iranian regime has been wary of allowing mourners to gather for commemorative rituals. Last week, clashes around the 40th day took place in Abdanan, a city near the border with Iraq. Videos show people chanting \"death to Khamenei\" as they remembered Alireza Seydi, a 16-year-old boy killed on January 8th. In another video from the city, the sound of gunfire echoes across the valley. It is difficult to tell what exactly the response of the authorities has been to this latest unrest. Internet is back but it is patchy. On Tuesday, the Ayatollah gave a speech saying some of those who took part in the January protests had been \"naive and inexperienced\" and were deceived by the rioters, but that they were still \"part of us, they were our children\". Given the US military build-up across the Middle East, the Iranian authorities appear not to want to provoke Donald Trump by being heavy-handed with protesters - but, instead, to focus minds on further negotiations on Iran's nuclear programme which they say could take place next week. Read more:How Iran might be preparing for a potential US strikeUK has not agreed to let US strike Iran from British bases They are signalling that they are prepared to work towards a deal but that they stand ready to fight should the US strike. Now it is up to Donald Trump to decide whether and how long he is prepared to wait for a deal, and what he does if he fails to get one."
    },
    {
        "title": "'She started to forget, little by little': Virtual reality offers escape to Gaza's children",
        "description": "In a small office space in Gaza City, a child stands still, wearing a virtual reality headset.",
        "url": "https://news.sky.com/story/the-nightmares-still-come-back-inside-gaza-city-a-virtual-reality-escape-for-the-children-caught-in-war-13510034",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-razan-virtual-reality_7170374.png?20260220171114",
        "type": "World",
        "Author": "Adam Parsons, Middle East correspondent, and Celine Alkhaldi, Middle East producer, in Jerusalem",
        "Date Published": "2026-02-22 00:01:00",
        "Headline": "In Gaza City, Palestinian children in displacement camps have been given some virtual reality headsets. For a few minutes, they are somewhere else. Then they step back into Gaza as it is.",
        "Content": "By Adam Parsons, Middle East correspondent, and Celine Alkhaldi, Middle East producer, in Jerusalem  In a small office space in Gaza City, a child stands still, wearing a virtual reality headset. A therapist asks seven-year-old Razan what she can see. She names objects as they appear in front of her: a train, toys, animals, the sea. The prompts are gentle: reach for the cube, use the hand you can, tell me what you are feeling. It is therapy, but it looks like play. Razan was injured last year when she went outside to get water for her family. A shell landed nearby, the shrapnel careering into her leg. A series of surgeries followed, including one reconstruction attempt that failed. The injury is still impossible to miss - Razan's leg is misshapen where a chunk of her flesh and muscle has gone. Doctors told the family there was little more they could do for her inside Gaza, where medical facilities have been so badly affected by two years of war. Only by leaving the Strip and seeking treatment abroad was there hope of a proper recovery, they said. For a young child, the news felt like a second attack. \n                  Epstein files see to arrest of Andrew Mountbatten-Windsor\n                 \n                  Donald Trump's Board of Peace pledges billions of dollars to rebuild Gaza\n                 \n                  Donald Trump makes misleading peace claims as he addressed first Board of Peace meeting\n                 Her mother, Rana Abu Harbid, says the trauma was so severe that Razan stopped eating for days, surviving only on water before collapsing and being taken back to hospital. Nightmares still wake her. Now, after months of support from this team, Razan's mental health is improving. But it is slow progress, with no guarantees. \"She slowly began to improve, and she started to forget, little by little,\" says Rana. \"But the nightmares still come back, and she wakes terrified, shaking, feeling like the ground is moving.\" During the sessions, a group of children sit in a circle and are given headsets to wear along with hand-operated controllers. Virtual reality allows them to feel like they are entering new places, without moving out of the chair. Suddenly, from Gaza's grey world of rubble, dust and destruction, a child can find themselves watching animals roam, fish swim, or cartoon characters cavort happily. In the same office, two brothers, Ahmad and Amjad, 17 and 13, talk about what the VR sessions give them. Ahmad says that when the pressure of the war closes in on him, the headset helps him feel able to breathe again. Amjad says it takes him from war and destruction into a world of nature. Theirs, too, is a story of lives that were ripped apart in a moment when an Israeli airstrike hit their home. Ahmad says he was thrown into the air \"like a piece of paper\". Shrapnel hit him, some going into his face. He's now blind in one of his eyes. He says he thought he was going to die because his twin brother had been killed earlier that year, and death felt close. Amjad's injuries were even more severe. He was taken straight into surgery. Later, he was wrapped in a blanket and taken toward the hospital mortuary, assumed to be dead, until he was able to move his hand to show he was alive. Their mother, Nissma, describes waking up to dust and rubble. The place where the boys had been sleeping was buried under stones. She found Ahmad covered in blood and realised his eye was gone. She then went looking for Amjad, believing he was trapped beneath the debris. Months later, both boys are still being treated. Shrapnel remains in their bodies. Amjad says there is nothing more doctors in Gaza can do for some of his injuries and that he needs to travel outside the Strip for surgery. For many families here, that possibility feels distant. Only a very small number of people are allowed to leave Gaza to seek medical treatment each day, and thousands upon thousands want that opportunity. The VR sessions are part of a project run by TechMed Gaza. A staff member, Lama Abu Dalal, explains that the idea began after a child injured in the war showed severe psychological symptoms, refusing to eat or drink, avoiding people, crying constantly. VR was tried as a way to reduce those symptoms, with positive results. Since then, the project has worked with around 180 cases, using structured sessions inside the headset, breathing exercises, walking exercises, and natural environments. Lama says they have seen children who could not walk because of fear take their first steps while wearing the headset, showing that the barrier was psychological, not physical. The work is limited by what they have. There are only a few headsets. When one breaks, there are no replacement parts. With crossings closed, no new equipment comes in. Fewer headsets means fewer children can be seen. All of this is happening against a backdrop of ongoing instability. A ceasefire announced late last year is still officially in place, but it is fragile. Read more from Sky News:Trump's message as billions of dollars pledged to GazaAirstrikes in Gaza kill 11 people, locals say Strikes have continued. People are still being killed. Life in the camps remains precarious. In the office, Razan takes off the headset. The forest and the sea disappear. Outside, the camp is still there. For a few minutes, the children here are somewhere else. Then they step back into Gaza as it is."
    },
    {
        "title": "Trump sending 'great hospital boat' to Greenland to 'take care of the sick'",
        "description": "Donald Trump has said he is sending a \"great hospital boat\" to Greenland, the semi-autonomous Danish territory he wants to acquire.",
        "url": "https://news.sky.com/story/trump-sending-great-hospital-boat-to-greenland-to-take-care-of-the-sick-13510664",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-white-house_7171621.jpg?20260222083020",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-22 08:09:00",
        "Headline": "The US president, who wants to acquire the semi-autonomous Danish territory, says a vessel is \"on the way\", though it is unclear if the help was requested.",
        "Content": "Donald Trump has said he is sending a \"great hospital boat\" to Greenland, the semi-autonomous Danish territory he wants to acquire. The US president threatened, at one point, to take the Arctic island by force in the interests of \"national security\". However, in late January he announced \"the framework of a future deal\" on Greenland and its security following talks with NATO secretary general Mark Rutte. Now, Mr Trump has claimed he is sending a boat to \"take care of the many people who are sick\" in Greenland, which has a universal public healthcare system. He announced the plan at a dinner for Republican governors at the White House. Mr Trump posted on Truth Social: \"Working with ‌the fantastic Governor of Louisiana, Jeff Landry, we are going to send a ​great hospital boat to Greenland to take care of the many people who are sick, and not being taken care ​of there. It's on the way!!!\" Louisiana Governor Jeff Landry reposted Mr Trump's message on X - and added: \"Thank you, President [Trump]! Proud to work with you on this important issue!\" The US Navy has two hospital ships, the Mercy and the Comfort, which support forces on deployments and provide disaster and humanitarian relief. The White House and ⁠Mr Landry's office have not made any further comment on the post - or revealed whether the ship had been requested by Denmark ‌or Greenland. Denmark's prime minister, Mette Frederiksen, said in a Facebook post on Sunday that she was \"happy to live in a country where there is free and equal access to health for all. Where it's not insurance and wealth that determine whether you get proper treatment\". \"You have the same approach in Greenland.\" Aaja Chemnitz, one of the two Greenlandic politicians in the Danish parliament, wrote on Facebook: \"Donald Trump wants to send a hospital ship to Greenland. \"It seems rather desperate, and does not contribute to the permanent and sustainable strengthening of the healthcare system that we need.\" Read more:NATO starts mission to strengthen presence in ArcticWhy Trump has insisted the US 'needs' Greenland Denmark maintains control of the territory's foreign affairs and defence. Troels Lund Poulsen, the country's defence minister, told Danish broadcaster DR on Sunday that the ship was not needed. \"The Greenlandic population receives the healthcare it needs,\" said Mr Poulsen. Mr Trump's post came hours after Denmark's Joint Arctic ​Command said it had evacuated a crew member of a US submarine off the coast of Greenland after the person needed medical treatment. The submariner was retrieved by a Danish Seahawk helicopter that had been deployed on an inspection ship."
    },
    {
        "title": "Iranian students clash with security forces during protests amid Donald Trump warning over military strikes",
        "description": "Protesters commemorating people killed during a deadly government crackdown in Iran last month have clashed with security forces at a university in Tehran.",
        "url": "https://news.sky.com/story/iranian-students-clash-with-security-forces-during-protests-amid-donald-trump-warning-over-military-strikes-13510644",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-tehran_7171632.jpg?20260222090207",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-22 06:09:00",
        "Headline": "The USS Gerald Ford passed Gibraltar on Saturday en route to the Middle East as police faced off with protesters at a Tehran university.",
        "Content": "Protesters commemorating people killed during a deadly government crackdown in Iran last month have clashed with security forces at a university in Tehran. Students chanted anti-regime slogans, including \"death to [Supreme Leader Ayatollah Ali] Khamenei\". They faced off with members of the Basij, a volunteer internal police force which is a branch of the Islamic Revolutionary Guard Corps, according to anti-government media. Footage shows violent clashes at the Sharif University of Technology on Saturday, while other clips on social media showed protesters with bloody head injuries. There were also reported demonstrations at the Amir Kabir University of Technology and the University of Tehran. The protests followed a brutal crackdown on dissent in January which saw thousands of people killed. Meanwhile, US President Donald Trump is considering military action against Iran. \n                  Mexican drug lord 'El Mencho' killed in military operation - sparking retaliatory violence\n                 \n                  As protests resume in Tehran, Iran's regime may be ready to strike a deal with Trump\n                 \n                  USS Gerald R Ford spotted passing through the Mediterranean amid rising tensions with Iran\n                 Mr Trump warned on Friday that strikes were possible even as Iran's top diplomat said Tehran expected to have a proposed deal ready in the next few days. It follows talks with the US over Iran's nuclear programme. America has scaled up its military presence in the Middle East in recent weeks. The aircraft carrier USS Abraham Lincoln and its strike group will shortly be joined by the USS Gerald Ford, which passed Gibraltar on Saturday en route to the region. \"I guess I can say I am considering that,\" said Mr Trump when asked by a reporter at the White House on Friday about a limited strike on Iran. Steve Witkoff, Mr Trump's special envoy to the Middle East, said the president was \"curious\" as to why Iran had not \"capitulated\" amid the naval build-up in the region. \"I don't want to ‌use the word 'frustrated', because he understands he has plenty of alternatives, but he's curious as to why ​they haven't... I don't want to use the word 'capitulated', but why they haven't capitulated,\" Mr Witkoff told Fox News. \"Why, under this pressure, with the amount of sea power and naval ‌power over there, haven't they come to us and said, 'we profess we don't want a weapon, ​so here's what we're prepared to do'? And yet it's sort of hard to get them to that place.\" What Iran's president has said Masoud Pezeshkian, Iran's president, sounded a defiant tone during a meeting with Paralympic athletics on Saturday. \"We will not bow our heads in the face of these problems,\" he said. \"We will try to bring honour and pride to our country. \"As long as we are alive, and we can breathe, we will sacrifice our lives for our country. \"By God's grace and strength, we will not lower our heads in the face of these difficulties. Even though the outside world and global powers are unfairly pressing us to submit, we will not bow our heads, just as you [athletes] refused to bow to difficulties.\" Read more:How US military is assembling within striking distance of IranUK has not agreed to let US strike Iran from British bases Mr Trump talked up regime change in Iran on 13 February when he revealed that a second aircraft carrier was heading to the Middle East. \"It seems like that would be the best thing that could happen,\" Mr Trump said. \"For 47 years, they've been talking and talking and talking. \"In the meantime, we've lost a lot of lives while they talk. Legs ‌blown off, arms blown off, faces blown off. We've been going on for a long time.\""
    },
    {
        "title": "US ambassador Mike Huckabee sparks backlash from Arab nations with Israel remarks",
        "description": "Multiple Arab nations have condemned the US ambassador to Israel after he said \"it would be fine\" if Tel Aviv took control of almost all of the Middle East.",
        "url": "https://news.sky.com/story/us-ambassador-mike-huckabee-sparks-backlash-from-arab-nations-with-israel-remarks-13510686",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-huckabee-israel-us_7171669.jpg?20260222094500",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-22 09:30:00",
        "Headline": "Mike Huckabee said \"it would be fine\" if Israel took control of land that would include a huge swathe of the Middle East. ",
        "Content": "Multiple Arab nations have condemned the US ambassador to Israel after he said \"it would be fine\" if Tel Aviv took control of almost all of the Middle East. In an interview published on Friday, former Fox News host Tucker Carlson pressed Mike Huckabee on his interpretation of Bible verses, where he said God promised Abraham and his descendants land that would today include \"basically the entire Middle East\". \"That would be the Levant, so that would be Israel, Jordan, Syria, Lebanon,\" Carlson said. \"It would also be big parts of Saudi Arabia and Iraq.\" The ambassador replied: \"I'm not sure we'd go that far. I mean, it would be a big piece of land.\" Carlson then asked if Israel had a right to control that entire area, to which Mr Huckabee responded: \"It would be fine if they took it all.\" The Donald Trump-appointed ambassador added, however, that Israel was not looking to expand its territory and that it has a right to security in the land it legitimately holds. The comments sparked an immediate backlash from Egypt, Jordan, Saudi Arabia, Kuwait and Oman, as well as the Organization of Islamic Cooperation and the League of Arab States. Egypt's foreign ministry called Mr Huckabee's remarks a \"blatant violation\" of international law, adding: \"Israel has no sovereignty over the occupied Palestinian territory or other Arab lands.\" Meanwhile, Saudi Arabia's foreign ministry labelled the comments as \"extremist rhetoric\" and \"unacceptable\", and has called for the US state department to clarify its position on them. The League of Arab States, a confederation of 22 countries, said: \"Statements of this nature - extremist and lacking any sound basis - serve only to inflame sentiments and stir religious and national emotions.\" There was no immediate comment from Israel or the United States. Since being established in 1948, Israel has not had fully recognised borders, and its frontiers with Arab neighbours have often shifted after wars, annexations, ceasefires and peace agreements. Israel has encroached on more land since the start of its war in Gaza, which was sparked by the Hamas-led attack on 7 October 2023. Read more:Virtual reality offers escape to Gaza's childrenTrump's message as billions of dollars pledged to Gaza Under the current ceasefire, Israel has withdrawn its troops in Gaza to a buffer zone, but it still controls more than half of the enclave. Israeli forces are supposed to withdraw further, but there is currently no timeline for this. In Syria, Israel's military seized control of a demilitarised buffer zone after President Bashar al-Assad was ousted from power at the end of 2024. Israel said the move was temporary and meant to secure its border. It has also attempted to deepen control of the occupied West Bank in recent months by greatly expanding construction in Jewish settlements and legalising outposts. Mr Huckabee, an evangelical Christian and strong supporter of Israel and the West Bank settlement movement, has long opposed a two-state solution for Israel and the Palestinian people. In an interview last year, he said he does not believe in referring to the Arab descendants of people who had lived in British-controlled Palestine as \"Palestinians\"."
    },
    {
        "title": "Weight loss jabs could be banned by next Olympics",
        "description": "As the Winter Olympics end, the World Anti-Doping Agency (WADA) is investigating whether to add weight loss jabs to the banned list for the next Summer Olympics in 2028.",
        "url": "https://news.sky.com/story/weight-loss-jabs-could-be-banned-by-next-olympics-13510642",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-semaglutide-weight-loss-jab_7171561.jpg?20260222053946",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2026-02-22 05:27:00",
        "Headline": "The World Anti-Doping Agency would need to find that athletes are using the drugs to boost performances and that their health is being risked or the spirit of fair sport is being violated.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n As the Winter Olympics end, the World Anti-Doping Agency (WADA) is investigating whether to add weight loss jabs to the banned list for the next Summer Olympics in 2028. The agency is monitoring Semaglutide, which is the active ingredient in popular GLP-1 medication, including Ozempic, to see if it is being abused by athletes to cheat. \"We want to see whether we detect patterns of abuse of this drug or this class of substances in sport,\" Dr Olivier Rabin, WADA's senior director of science and medicine, told Sky News. \"So we keep an eye on them because there's been a change in paradigm in the way weight can be controlled because of those drugs. So there is an interest from all sides, from the performance enhancing aspects and health protection of the athletes with this class of substances [and] will they end up being on the [banned] list.\" WADA would need to find that athletes are using the drugs to boost performances and that their health is being risked or the spirit of fair sport is being violated. Dr Rabin said in a recent interview that a decision could be taken by the end of this year or in 2027, adding: \"Possibly before the Olympic Games in Los Angeles.\" Experts say endurance athletes could benefit most. \n                  Mykhaylo Mudryk: Chelsea winger could face four-year ban after being charged over alleged doping\n                 \n                  Russian athlete in 1,500m race at London 2012 disqualified - bringing total to five\n                 \n                  Kamila Valieva: Russian figure skater qualifies for free skate at Winter Olympics in gold medal position - despite failed drugs test\n                 The drugs make you feel fuller, so you want to eat less, and that can cause energy deficiency. It means muscles might not absorb enough nutrients and other necessary drugs. But there are welfare issues too, with athletes facing pressure to take the drugs. Kate Seary, co-founder of the Kyniska Advocacy for safe sport, said: \"In many ways a more invisible issue is GLP-1s being used to control the weight of athletes. \"There are toxic environments where the idea that thin equals fast, thin equals powerful, or even thin equals beautiful in sport are still really present. \"And that is because they're under a number of wider pressures within the sport system. I think I would always go along the lines of banning it until we know the long-term consequences.\" Read more:Women dominate weight loss jab take-upWeight loss drugs 'may need to be continued for life' The jabs are also a concern for Dr Ian Beasley, the former medical chief for England football teams and a Team GB Olympics physician. \"When you're trying to look for minimal gains and try to get up to the next step, you might try it,\" he said. \"If you wanted to cheat, could you take it during a close season and then reap the benefits during the season? And how would you be able to measure that? I think these are the questions that WADA are grappling with that make life very difficult.\" Exemptions could be granted for athletes really needing anti-obesity jabs, for example, in cases of diabetics to control weight issues. But the fear is that the authorities are playing catch-up with athletes potentially already using the medication."
    },
    {
        "title": "Trump bumps up global tariffs - creating more mess and uncertainty for the world",
        "description": "So Trump and tariffs - what's going on? Let's start with the latest development and work backwards.&#160;",
        "url": "https://news.sky.com/story/trump-bumps-up-global-tariffs-creating-more-mess-and-uncertainty-for-the-world-13510596",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-tariffs_7171455.jpg?20260221214654",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2026-02-22 00:01:00",
        "Headline": "Donald Trump said on Saturday that he was raising worldwide tariffs on imported goods to the US to 15% - up from 10% he had announced a day earlier.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n So Trump and tariffs - what's going on? Let's start with the latest development and work backwards.  The president has announced a tariff of 15% globally. Now you might be thinking \"didn't he set it at 10% on Friday?\" Yes he did. But now he's raised it to 15%. The latest pronouncement came - on Truth Social, of course - just before lunchtime on Saturday. Here's the full post and we've highlighted the key bits: What does all this mean? It's a good question and one which governments globally are asking themselves, not for the first time. The president is using a new statute - a new avenue effectively - to levy duties on foreign goods temporarily, because the old statute, which he'd been using since Liberation Day last April, was deemed illegal. That happened on Friday when the Supreme Court (the highest court in the land) ruled by a majority of six to three that the president's methods to impose tariffs were unconstitutional. Six of the justices ruled the tariffs exceed the powers given to the president by Congress under a 1977 law providing him the authority to regulate commerce during national emergencies created by foreign threats. So the president and his team are looking for new ways - new statutes - to recoup some of his losses (should he have to repay the tariffs - the Supreme Court, unhelpfully, did not pass judgment on this) and to replace his tariff system. Remember this vital point: so much of Trump's policies, his power, his ability to call the world to heel has been based on his ability to strike any country he wants with crippling tariffs. So, his immediate response to the Supreme Court decision was to use a different mechanism - Section 122 of the Trade Act of 1974 to be precise - to impose 10% global tariffs. He had the option to impose 15%, not 10%, and on Saturday, just a day after setting it at 10, he raised it to 15. Read more from Sky News:Vitali Klitschko tells Sky News his message to Donald TrumpHouston, NASA's next moon mission has a problem That can only last 150 days. That's why he says in his social media post that he will look for new ways of levying duties. As ever with all this, nothing is clear-cut. There are exemptions, including on agricultural products, steel and cars, but there is confusion over this as governments seek clarity. It's a whole world of mess and uncertainty, again, for the whole world."
    },
    {
        "title": "Armed man shot and killed after entering perimeter of Trump's Mar-a-Lago residence",
        "description": "A man has been shot dead by Secret Service agents after trying to unlawfully enter Donald Trump's Mar-a-Lago estate, authorities in the US have said.",
        "url": "https://news.sky.com/story/armed-man-shot-and-killed-after-entering-perimeter-of-mar-a-lago-13510785",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-austin-tucker-martin_7172174.jpg?20260222175631",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-22 15:09:00",
        "Headline": "The suspect has been identified by US media as a 21-year-old who was reported missing by his family a few days ago.",
        "Content": "A man has been shot dead by Secret Service agents after trying to unlawfully enter Donald Trump's Mar-a-Lago estate, authorities in the US have said. The man was seen by the north gate of the Florida property at around 1.30am local time (6.30am UK time) on Sunday. He was carrying what appeared to be a shotgun and a fuel can, officials added. US media have identified the suspect as Austin Tucker Martin - a 21-year-old who was reported missing by his family a few days ago. Rick Bradshaw, the sheriff of Palm Beach County, said the man made it into Mar-a-Lago's inner perimeter. He is believed to have driven through the north gate of the estate as another vehicle was exiting. The man raised his shotgun to a shooting position after being confronted by a deputy and two Secret Service agents, who then \"fired their weapons and neutralised the threat\", the sheriff added. Secret Service spokesman Anthony Guglielmi said the suspect was in his early 20s and from North Carolina. According to Mr Guglielmi, investigators believe he left North Carolina and headed south, picking up a shotgun along the way. The box for the gun was recovered in his vehicle. \n                  As protests resume in Tehran, Iran's regime may be ready to strike a deal with Trump\n                 \n                  Trump sending 'great hospital boat' to Greenland to 'take care of the sick'\n                 \n                  Trump bumps up global tariffs - creating more mess and uncertainty for the world\n                 Investigators are working to compile a psychological profile while the motive is still under investigation. Suspect 'from family of Trump supporters', says relative The suspect's cousin, Braeden Fields, 19, spoke with a reporter from the Associated Press, stating: \"We are big Trump supporters, all of us. Everybody.\" But he said his relative didn't discuss politics and was \"real quiet, never really talked about anything\". \"He's a good kid,\" Mr Fields said, adding that Martin sent part of every pay cheque from his job at a local golf course to charity. \"I wouldn't believe he would do something like this. It's mind-blowing.\" While Mr Trump often spends the weekends at Mar-a-Lago, he was at the White House with his wife Melania when the incident took place. White House praises Secret Service White House press secretary Karoline Leavitt said the Secret Service had acted \"quickly and decisively to neutralise a crazy person\" who had intruded into Mr Trump's home. She wrote on X: \"Federal law enforcement are working 24/7 to keep our country safe and protect all Americans. It's shameful and reckless that Democrats have chosen to shut down their Department.\" Earlier this month, Democrats in the US Senate blocked a funding package for the Department of Homeland Security, which includes the Secret Service, over their opposition to an immigration crackdown that has triggered widespread protests and seen two people killed in Minneapolis. The FBI has asked residents who live near Mar-a-Lago to check any security cameras as they may have footage that could help investigators. Five days ago, US Capitol Police arrested a Georgia gunman armed with a shotgun as he sprinted towards the west side of the Capitol. Read more on Sky News:Trump sending 'great hospital boat' to GreenlandUS president announces new global tariffs Mr Trump previously faced a threat to his life when he was wounded during an assassination attempt during a campaign rally in Butler, Pennsylvania, on 13 July 2024. On 15 September 2024, a man with a rifle was captured after waiting near Mr Trump's golf course in West Palm Beach while the president played a round. He was sentenced to life in prison earlier this month."
    },
    {
        "title": "Trump sending 'great hospital boat' to Greenland to 'take care of the sick'",
        "description": "Donald Trump has said he is sending a \"great hospital boat\" to Greenland, the semi-autonomous Danish territory he wants to acquire.",
        "url": "https://news.sky.com/story/trump-sending-great-hospital-boat-to-greenland-to-take-care-of-the-sick-13510664",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-white-house_7171621.jpg?20260222083020",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-22 08:09:00",
        "Headline": "The US president, who wants to acquire the semi-autonomous Danish territory, says a vessel is \"on the way\", though it is unclear if the help was requested.",
        "Content": "Donald Trump has said he is sending a \"great hospital boat\" to Greenland, the semi-autonomous Danish territory he wants to acquire. The US president threatened, at one point, to take the Arctic island by force in the interests of \"national security\". However, in late January he announced \"the framework of a future deal\" on Greenland and its security following talks with NATO secretary general Mark Rutte. Now, Mr Trump has claimed he is sending a boat to \"take care of the many people who are sick\" in Greenland, which has a universal public healthcare system. He announced the plan at a dinner for Republican governors at the White House. Mr Trump posted on Truth Social: \"Working with ‌the fantastic Governor of Louisiana, Jeff Landry, we are going to send a ​great hospital boat to Greenland to take care of the many people who are sick, and not being taken care ​of there. It's on the way!!!\" Louisiana Governor Jeff Landry reposted Mr Trump's message on X - and added: \"Thank you, President [Trump]! Proud to work with you on this important issue!\" The US Navy has two hospital ships, the Mercy and the Comfort, which support forces on deployments and provide disaster and humanitarian relief. The White House and ⁠Mr Landry's office have not made any further comment on the post - or revealed whether the ship had been requested by Denmark ‌or Greenland. Denmark's prime minister, Mette Frederiksen, said in a Facebook post on Sunday that she was \"happy to live in a country where there is free and equal access to health for all. Where it's not insurance and wealth that determine whether you get proper treatment\". \"You have the same approach in Greenland.\" Aaja Chemnitz, one of the two Greenlandic politicians in the Danish parliament, wrote on Facebook: \"Donald Trump wants to send a hospital ship to Greenland. \"It seems rather desperate, and does not contribute to the permanent and sustainable strengthening of the healthcare system that we need.\" Read more:NATO starts mission to strengthen presence in ArcticWhy Trump has insisted the US 'needs' Greenland Denmark maintains control of the territory's foreign affairs and defence. Troels Lund Poulsen, the country's defence minister, told Danish broadcaster DR on Sunday that the ship was not needed. \"The Greenlandic population receives the healthcare it needs,\" said Mr Poulsen. Mr Trump's post came hours after Denmark's Joint Arctic ​Command said it had evacuated a crew member of a US submarine off the coast of Greenland after the person needed medical treatment. The submariner was retrieved by a Danish Seahawk helicopter that had been deployed on an inspection ship."
    },
    {
        "title": "Trump bumps up global tariffs - creating more mess and uncertainty for the world",
        "description": "So Trump and tariffs - what's going on? Let's start with the latest development and work backwards.&#160;",
        "url": "https://news.sky.com/story/trump-bumps-up-global-tariffs-creating-more-mess-and-uncertainty-for-the-world-13510596",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-tariffs_7171455.jpg?20260221214654",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2026-02-22 00:01:00",
        "Headline": "Donald Trump said on Saturday that he was raising worldwide tariffs on imported goods to the US to 15% - up from 10% he had announced a day earlier.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n So Trump and tariffs - what's going on? Let's start with the latest development and work backwards.  The president has announced a tariff of 15% globally. Now you might be thinking \"didn't he set it at 10% on Friday?\" Yes he did. But now he's raised it to 15%. The latest pronouncement came - on Truth Social, of course - just before lunchtime on Saturday. Here's the full post and we've highlighted the key bits: What does all this mean? It's a good question and one which governments globally are asking themselves, not for the first time. The president is using a new statute - a new avenue effectively - to levy duties on foreign goods temporarily, because the old statute, which he'd been using since Liberation Day last April, was deemed illegal. That happened on Friday when the Supreme Court (the highest court in the land) ruled by a majority of six to three that the president's methods to impose tariffs were unconstitutional. Six of the justices ruled the tariffs exceed the powers given to the president by Congress under a 1977 law providing him the authority to regulate commerce during national emergencies created by foreign threats. So the president and his team are looking for new ways - new statutes - to recoup some of his losses (should he have to repay the tariffs - the Supreme Court, unhelpfully, did not pass judgment on this) and to replace his tariff system. Remember this vital point: so much of Trump's policies, his power, his ability to call the world to heel has been based on his ability to strike any country he wants with crippling tariffs. So, his immediate response to the Supreme Court decision was to use a different mechanism - Section 122 of the Trade Act of 1974 to be precise - to impose 10% global tariffs. He had the option to impose 15%, not 10%, and on Saturday, just a day after setting it at 10, he raised it to 15. Read more from Sky News:Vitali Klitschko tells Sky News his message to Donald TrumpHouston, NASA's next moon mission has a problem That can only last 150 days. That's why he says in his social media post that he will look for new ways of levying duties. As ever with all this, nothing is clear-cut. There are exemptions, including on agricultural products, steel and cars, but there is confusion over this as governments seek clarity. It's a whole world of mess and uncertainty, again, for the whole world."
    },
    {
        "title": "Eric Dane: Fundraiser for family of late Grey's Anatomy actor surpasses £200,000",
        "description": "A fundraiser has secured more than $275,000 (&#163;200,000) for the family of the late Grey's Anatomy actor Eric Dane, who died on Thursday at the age of 53.",
        "url": "https://news.sky.com/story/fundraiser-for-family-of-late-greys-anatomy-actor-surpasses-163200000-13510660",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-rebecca-gayheart-eric-dane_7171640.jpg?20260222090655",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-22 07:54:00",
        "Headline": "Euphoria creator Sam Levinson and his wife Ashley appeared to have donated $27,000 (£20,000) to the GoFundMe platform.",
        "Content": "A fundraiser has secured more than $275,000 (£200,000) for the family of the late Grey's Anatomy actor Eric Dane, who died on Thursday at the age of 53. The US star, also known for his role in the HBO series Euphoria, had the condition amyotrophic lateral sclerosis (ALS), also known as Lou Gehrig's disease. Dane announced he had developed the progressive neurodegenerative disease last year. A fundraiser was set up by friends of Dane and his family to raise $500,000 (£370,000) for his two teenage daughters \"who were the centre of his world\". Euphoria creator Sam Levinson and his wife Ashley appeared to have donated $27,000 (£20,000) to the GoFundMe platform. Brad Falchuck, Glee co-creator and husband of Gwyneth Paltrow, donated $10,000 (£7,400). The US actor's death was confirmed on Friday by his representatives, who said he had been surrounded by wife, actress Rebecca Gayheart, daughters Billie and Georgia, and friends. \n                  British rising star Robert Aramayo beats Timothee Chalamet and Leonardo DiCaprio to acting BAFTA - as One Battle After Another named best film\n                 \n                  BAFTAs red carpet 2026: All the fashion from British and Hollywood stars\n                 \n                  BAFTA Film Awards 2026: The full list of winning films and stars\n                 Hollywood actors have been paying tribute, including co-star Patrick Dempsey, Ashton Kutcher, Alyssa Milano, John Stamos, Nina Dobrev, Maria Shriver, Grey's Anatomy boss Shonda Rhimes and Euphoria creator Levinson. Dane is best known for playing the fan favourite Dr Mark 'McSteamy' Sloan on the long-running medical drama Grey's Anatomy from 2006 until 2012, with a guest appearance in 2021. He more recently starred in the HBO hit drama Euphoria alongside Jacob Elordi and Zendaya, playing the conflicted antagonist Cal Jacobs. Dane and Gayheart married in 2004, and separated in September 2017. Gayheart filed for divorce in 2018, but later filed to have the petition dismissed. She described their dynamic as \"very complicated\" in a December essay she wrote for New York magazine's The Cut, adding: \"Our love may not be romantic, but it's a familial love.\" The model and photographer Janell Shirtcliff also shared her memories of Dane in a series of Instagram posts on Saturday. Read more from Sky News:Full list: BAFTA nominations 2026Abbey Road opens doors for a raveStars discuss The Ballad Of Wallis Island The GoFundMe fundraising page, described as supporting \"his girls and their future needs\", described Dane's battle with the condition. \"Following his diagnosis, Eric became a passionate spokesperson for the ALS community, using his voice and platform to advocate for fellow patients and to push for greater awareness. \"Even as his own health declined, he remained deeply committed to helping others facing the same devastating disease,\" it read. Gayheart shared a photo of the GoFundMe on her Instagram stories at its launch, captioning it: \"Thank-you everyone.\" Dane is also known for his roles in Charmed, Burlesque, Marley & Me and Valentine's Day and between 2014 and 2018 he played Tom Chandler in post-apocalyptic action series The Last Ship."
    },
    {
        "title": "US ambassador Mike Huckabee sparks backlash from Arab nations with Israel remarks",
        "description": "Multiple Arab nations have condemned the US ambassador to Israel after he said \"it would be fine\" if Tel Aviv took control of almost all of the Middle East.",
        "url": "https://news.sky.com/story/us-ambassador-mike-huckabee-sparks-backlash-from-arab-nations-with-israel-remarks-13510686",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-huckabee-israel-us_7171669.jpg?20260222094500",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-22 09:30:00",
        "Headline": "Mike Huckabee said \"it would be fine\" if Israel took control of land that would include a huge swathe of the Middle East. ",
        "Content": "Multiple Arab nations have condemned the US ambassador to Israel after he said \"it would be fine\" if Tel Aviv took control of almost all of the Middle East. In an interview published on Friday, former Fox News host Tucker Carlson pressed Mike Huckabee on his interpretation of Bible verses, where he said God promised Abraham and his descendants land that would today include \"basically the entire Middle East\". \"That would be the Levant, so that would be Israel, Jordan, Syria, Lebanon,\" Carlson said. \"It would also be big parts of Saudi Arabia and Iraq.\" The ambassador replied: \"I'm not sure we'd go that far. I mean, it would be a big piece of land.\" Carlson then asked if Israel had a right to control that entire area, to which Mr Huckabee responded: \"It would be fine if they took it all.\" The Donald Trump-appointed ambassador added, however, that Israel was not looking to expand its territory and that it has a right to security in the land it legitimately holds. The comments sparked an immediate backlash from Egypt, Jordan, Saudi Arabia, Kuwait and Oman, as well as the Organization of Islamic Cooperation and the League of Arab States. Egypt's foreign ministry called Mr Huckabee's remarks a \"blatant violation\" of international law, adding: \"Israel has no sovereignty over the occupied Palestinian territory or other Arab lands.\" Meanwhile, Saudi Arabia's foreign ministry labelled the comments as \"extremist rhetoric\" and \"unacceptable\", and has called for the US state department to clarify its position on them. The League of Arab States, a confederation of 22 countries, said: \"Statements of this nature - extremist and lacking any sound basis - serve only to inflame sentiments and stir religious and national emotions.\" There was no immediate comment from Israel or the United States. Since being established in 1948, Israel has not had fully recognised borders, and its frontiers with Arab neighbours have often shifted after wars, annexations, ceasefires and peace agreements. Israel has encroached on more land since the start of its war in Gaza, which was sparked by the Hamas-led attack on 7 October 2023. Read more:Virtual reality offers escape to Gaza's childrenTrump's message as billions of dollars pledged to Gaza Under the current ceasefire, Israel has withdrawn its troops in Gaza to a buffer zone, but it still controls more than half of the enclave. Israeli forces are supposed to withdraw further, but there is currently no timeline for this. In Syria, Israel's military seized control of a demilitarised buffer zone after President Bashar al-Assad was ousted from power at the end of 2024. Israel said the move was temporary and meant to secure its border. It has also attempted to deepen control of the occupied West Bank in recent months by greatly expanding construction in Jewish settlements and legalising outposts. Mr Huckabee, an evangelical Christian and strong supporter of Israel and the West Bank settlement movement, has long opposed a two-state solution for Israel and the Palestinian people. In an interview last year, he said he does not believe in referring to the Arab descendants of people who had lived in British-controlled Palestine as \"Palestinians\"."
    },
    {
        "title": "Trump bumps up global tariffs - creating more mess and uncertainty for the world",
        "description": "So Trump and tariffs - what's going on? Let's start with the latest development and work backwards.&#160;",
        "url": "https://news.sky.com/story/trump-bumps-up-global-tariffs-creating-more-mess-and-uncertainty-for-the-world-13510596",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-tariffs_7171455.jpg?20260221214654",
        "type": "Business",
        "Author": "Mark Stone",
        "Date Published": "2026-02-22 00:01:00",
        "Headline": "Donald Trump said on Saturday that he was raising worldwide tariffs on imported goods to the US to 15% - up from 10% he had announced a day earlier.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n So Trump and tariffs - what's going on? Let's start with the latest development and work backwards.  The president has announced a tariff of 15% globally. Now you might be thinking \"didn't he set it at 10% on Friday?\" Yes he did. But now he's raised it to 15%. The latest pronouncement came - on Truth Social, of course - just before lunchtime on Saturday. Here's the full post and we've highlighted the key bits: What does all this mean? It's a good question and one which governments globally are asking themselves, not for the first time. The president is using a new statute - a new avenue effectively - to levy duties on foreign goods temporarily, because the old statute, which he'd been using since Liberation Day last April, was deemed illegal. That happened on Friday when the Supreme Court (the highest court in the land) ruled by a majority of six to three that the president's methods to impose tariffs were unconstitutional. Six of the justices ruled the tariffs exceed the powers given to the president by Congress under a 1977 law providing him the authority to regulate commerce during national emergencies created by foreign threats. So the president and his team are looking for new ways - new statutes - to recoup some of his losses (should he have to repay the tariffs - the Supreme Court, unhelpfully, did not pass judgment on this) and to replace his tariff system. Remember this vital point: so much of Trump's policies, his power, his ability to call the world to heel has been based on his ability to strike any country he wants with crippling tariffs. So, his immediate response to the Supreme Court decision was to use a different mechanism - Section 122 of the Trade Act of 1974 to be precise - to impose 10% global tariffs. He had the option to impose 15%, not 10%, and on Saturday, just a day after setting it at 10, he raised it to 15. Read more from Sky News:Vitali Klitschko tells Sky News his message to Donald TrumpHouston, NASA's next moon mission has a problem That can only last 150 days. That's why he says in his social media post that he will look for new ways of levying duties. As ever with all this, nothing is clear-cut. There are exemptions, including on agricultural products, steel and cars, but there is confusion over this as governments seek clarity. It's a whole world of mess and uncertainty, again, for the whole world."
    },
    {
        "title": "The pressure is building on government to reform student loan repayments",
        "description": "It's a debate that's gaining momentum, and ministers could score some political points among millions of graduates in England if they choose to reform the student loans system.",
        "url": "https://news.sky.com/story/the-pressure-is-building-on-government-to-reform-student-loan-repayments-13510747",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-graduates-students_6989170.jpg?20250812173038",
        "type": "Politics",
        "Author": "Lucy McDaid, political correspondent",
        "Date Published": "2026-02-22 13:39:00",
        "Headline": "Labour faces another backbench rebellion over the repayment threshold for student loans in England, which is being frozen for three years, meaning some workers will be dragged into making larger payments.",
        "Content": "By Lucy McDaid, political correspondent   It's a debate that's gaining momentum, and ministers could score some political points among millions of graduates in England if they choose to reform the student loans system. According to one Labour MP, it's \"the next welfare waiting to happen\", implying the government could have another rebellion on its hands if it doesn't act quickly. So, will it act? Well, Education Secretary Bridget Phillipson hasn't ruled out any changes and government sources aren't steering away from the idea that they are putting their heads together. Explainer: How to avoid crippling student debt That's despite refusing suggestions to lower repayments when speaking to Sky News on Sunday Morning with Trevor Phillips. Also, they're all too aware of the changing political landscape, with the Greens and Your Party increasingly positioning themselves as the alternatives to Labour. What exactly is the row about? It centres around Plan 2 loans. These were issued to undergraduate students who started uni from 2012, when fees went up to £9,000 a year, up until 2023. Graduates currently pay back 9% of their income when they earn above the current £28,470 threshold, and then interest is charged at the rate of Retail Prices Index (RPI) plus up to 3%, depending on salary. It's led to many seeing their debt increase years after leaving university, despite already having paid off thousands of pounds. The issue has been debated for a long time, but erupted again after the chancellor's budget last November. In it, Rachel Reeves said the repayment threshold in England will be frozen for three years from April 2027. The Welsh government has decided not to follow suit. This means that workers earning more than the threshold will be dragged into making larger repayments than they would be if the threshold rises with inflation. Analysis: Uni is not what it once was Parties pile pressure on Labour What's not helpful for Labour is that other parties are now piling on the pressure. The Conservatives have said they'd cut the amount of interest on the loans, while the Liberal Democrats are more generally promising to review the fairness of the system. Meanwhile, Green MP, Dr Ellie Chowns, said in a statement that the current system for student loans was \"clearly unfair\" and the \"Greens want to see tuition fees scrapped entirely and ultimately would write off existing undergraduate and PCDL [Professional Career and Development Loan] debts\". She added the party would support a series of immediate measures, including reversing the adjustment to repayment thresholds, reducing interest on loans and lowering the repayment rate. Read more:Call for change to loan paymentsInvestigation into student loans fraudUniversity tuition fees to increase But - as the government keeps reminding us - cash is in short supply, and all this comes at a time of renewed calls to increase spending on defence, in the face of global volatility. Charities and opposition parties also want to see how the Department for Education plans to fund its much-anticipated reforms to SEND provision, for example. Bridget Phillipson speaks about having to identify 'priorities' in government, but we could see ministers having to change course quickly on this issue if it unravels further into a political pile-on."
    },
    {
        "title": "British rising star Robert Aramayo beats Timothee Chalamet and Leonardo DiCaprio to acting BAFTA - as One Battle After Another named best film",
        "description": "British film newcomer Robert Aramayo has been named best actor at the BAFTAs - beating favourite Timothee Chalamet and other A-listers including Leonardo DiCaprio to win the prize.",
        "url": "https://news.sky.com/story/british-rising-star-robert-aramayo-beats-timothee-chalamet-and-leonardo-dicaprio-to-acting-bafta-as-one-battle-after-another-named-best-film-13510746",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-robert-aramayo-baftas_7172288.jpg?20260222195807",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-22 13:40:00",
        "Headline": "Robert Aramayo won the award for his performance in I Swear, which tells the real-life story of Tourette's campaigner John Davidson, while Irish actress Jessie Buckley was named best actress for her performance in Shakespeare biopic Hamnet.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n British film newcomer Robert Aramayo has been named best actor at the BAFTAs - beating favourite Timothee Chalamet and other A-listers including Leonardo DiCaprio to win the prize. Aramayo won the award for his performance in I Swear, which tells the real-life story of Tourette's campaigner John Davidson, while Irish actress Jessie Buckley was named best actress for her performance in the Shakespeare biopic Hamnet. Paul Thomas Anderson's comedy-thriller One Battle After Another, starring DiCaprio, Teyana Taylor, Chase Infiniti and Sean Penn, was the biggest winner of the night, picking up six BAFTAs including best film, best director, and supporting actor for Penn. Accepting the best film award, Anderson - who had earlier almost dropped his BAFTA for best adapted screenplay - said it was a \"tremendous honour\", adding: \"Anybody who says that movies aren't good any more can piss right off because this is a great f***ing year.\" Prince William, who is president of BAFTA, and Kate were in the room to cheer the winners on, alongside other stars including nominees Emma Stone and Kate Hudson, music stars Little Simz, Stormzy and Jessie Ware, and Kylie Jenner - here in the UK to support her boyfriend Chalamet. Snacks for the stars Host Alan Cumming brought some humour to the show, offering snacks to the A-listers - Jammie Dodgers for Chalamet and Jenner, Twiglets for Rose Byrne, and an oaty flapjack for DiCaprio (who said it sounded \"fantastic\"). During his speech, Aramayo was cheered on by his dad, and became emotional as he told the BAFTAs audience: \"I honestly cannot believe that I have won this award.\" The 33-year-old, who grew up in Hull, thanked fellow nominee Ethan Hawke, and said: \"Everyone in this category blows me away. \"When I was in school, Ethan Hawke came in to speak to us in Julliard and he gave an amazing talk on longevity as an actor, about protecting your instrument and avoiding self-destructive behaviours, and it had a great impact on everyone in the room. \"So to be in this category with you tonight is incredible. Thank you, Ethan.\" The award was his second of the night, coming not long after he had accepted the rising star prize - the only one to be chosen by a public vote - and I Swear also picked up a third award for its casting. 'Nuclear bad fake tan' In contrast to Aramayo, Buckley was the favourite to win the best actress award after picking up the prize at the Critics Choice Awards and Golden Globes earlier this year. She is the first Irish star to take home the prize. \"As a little girl, I never in a million years thought I would get to make a film,\" she said in her speech. Recalling her early days as an actress, she said: \"I had nuclear bad fake tan on, white hoop earrings, a polka-dot red skirt and had the audacity to say one day I wanted to be like Judi Dench.\" Buckley, who rose to fame on the talent show I'd Do Anything, coming runner-up in the series' search to find a lead to play Nancy in the 2009 West End revival of the British musical Oliver, said it was \"nuts\" to be on stage, winning a BAFTA, and paid tribute to the \"women past, present and future who taught me and continue to teach me how to do it differently\". Addressing her fellow nominees, the Irish actress said: \"You are all just radical and you are doing it for the naughty girls, and I'm in awe of all your incredible performances.\" She also dedicated the award to her daughter, saying: \"It's the best role of my life being your mum and I promise to continue to be disobedient so you can belong to a world in all your complete wildness as a young woman. I am very grateful for this.\" Read more on the BAFTAs:The full list of winnersThe best red carpet fashion Wins for Sinners and Frankenstein Paul Mescal plays Shakespeare alongside Buckley, who plays his wife, Agnes, in Hamnet. The film tells the story of the death of their son, Hamnet, from the plague, and how Shakespeare was inspired to write Hamlet. Buckley's win was one of two for the film, which also picked up the prize for outstanding British film. Arts and entertainment correspondent Hugging his dad as his name was called, Robert Aramayo was the big BAFTA surprise this year - a relative unknown beating the likes of favourite Timothee Chalamet and awards veteran Leonardo DiCaprio. BAFTA has form for going its own way, especially when it comes to recognising British films that may not break through in Hollywood, and Aramayo's performance in I Swear stopped critics in their tracks. This was also a night that saw the big American films rising to the top. Vampire horror Sinners took home three gongs, including best supporting actress for British star Wunmi Mosaku, as did Frankenstein. But One Battle After Another - a film that has felt increasingly timely, with authority seen as unpredictable, militarised and with the power to destabilise entire neighbourhoods - was the night's big winner. As he accepted the award for best film, Anderson said: \"I know what freedom is - it's filmmaking without fear... See you at the bar.\" A sentiment worth celebrating. Producer Sir Sam Mendes acknowledged the other nominees in the category and said: \"We are not great as an industry or a culture for patting ourselves on the back, but perhaps we should.\" Elsewhere, period vampire horror Sinners, starring Michael B Jordan, picked up three awards, including best supporting actress for British star Wunmi Mosaku, and the prizes for original screenplay and score. Frankenstein, starring Jacob Elordi, also won three - for costume, make-up and hair, and production design."
    },
    {
        "title": "BAFTAs red carpet 2026: All the fashion from British and Hollywood stars",
        "description": "As well as the film prizes, red carpet fashion is also a huge part of any awards ceremony.",
        "url": "https://news.sky.com/story/baftas-red-carpet-2026-all-the-fashion-as-hollywood-stars-arrive-for-ceremony-13510744",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bafta-2026-baftas-kpop-demon-hunters_7171851.jpg?20260222142457",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-22 13:25:00",
        "Headline": "Emma Stone, Kate Hudson, Leonardo DiCaprio, Jessie Buckley, Teyana Taylor, Timothee Chalamet, Michael B Jordan, Carey Mulligan and Rose Byrne were among the stars on the red carpet.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n As well as the film prizes, red carpet fashion is also a huge part of any awards ceremony. Emma Stone, Kate Hudson, Leonardo DiCaprio, Jessie Buckley, Teyana Taylor, Timothee Chalamet, Michael B Jordan, Carey Mulligan and Rose Byrne were among the stars on the BAFTA Film Awards red carpet this year. One Battle After Another was the big winner, with acting prizes for Buckley and British rising star Robert Aramayo. Here are all the outfits as the stars arrived ahead of the ceremony."
    },
    {
        "title": "BAFTA Film Awards 2026: The full list of winning films and stars",
        "description": "Here are all the nominees and winners of this year's BAFTA Film Awards.",
        "url": "https://news.sky.com/story/bafta-film-awards-2026-the-full-list-of-winning-films-and-stars-13510740",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-bafta-michael-b-jordan_7147251.jpg?20260127123655",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-22 13:17:00",
        "Headline": "One Battle After Another has taken home six awards at this year's BAFTAs, with big wins for Sinners, Hamnet, Frankenstein and I Swear as well.",
        "Content": "Here are all the nominees and winners of this year's BAFTA Film Awards. One Battle After Another took home six awards, but the best acting prizes went to British and Irish stars. Here are all the winners from this year's BAFTA Film Awards. Best film - One Battle After AnotherHamnetMarty SupremeSentimental ValueSinners Best actor - Robert Aramayo, I SwearTimothee Chalamet - Marty SupremeLeonardo DiCaprio - One Battle After AnotherEthan Hawke - Blue MoonMichael B Jordan - SinnersJesse Plemons - Bugonia Best actress - Jessie Buckley, HamnetRose Byrne - If I Had Legs I'd Kick YouKate Hudson - Song Sung BlueChase Infiniti - One Battle After AnotherRenate Reinsve - Sentimental ValueEmma Stone - Bugonia Outstanding British film - Hamnet28 Years LaterThe Ballad Of Wallis IslandBridget Jones: Mad About The BoyDie My LoveH Is For HawkI SwearMr BurtonPillionSteve Outstanding debut by a British writer, director or producer - My Father's Shadow - Akinola Davies Jr (director), Wale Davies (writer)The Ceremony - Jack King (director, writer), Hollie Bryan (producer), Lucy Meer (producer)Pillion - Harry Lighton (director, writer)A Want In Her - Myrid Carten (director)Wasteman - Cal McMau (director), Hunter Andrews (writer), Eoin Doran (writer) Best adapted screenplay - One Battle After Another - Paul Thomas AndersonThe Ballad Of Wallis Island - Tom Basden, Tim KeyBugonia - Will TracyHamnet - Chloé Zhao, Maggie O'FarrellPillion - Harry Lighton Best original screenplay - Sinners, Ryan CooglerI Swear - Kirk JonesMarty Supreme - Ronald Bronstein, Josh SafdieThe Secret Agent - Kleber Mendonca FilhoSentimental Value - Eskil Vogt, Joachim Trier Non-English language film - Sentimental ValueIt Was Just An AccidentThe Secret AgentSiratThe Voice Of Hind Rajab Best director - One Battle After Another, Paul Thomas AndersonBugonia - Yorgos LanthimosHamnet - Chloe ZhaoMarty Supreme - Josh SafdieSentimental Value - Joachim TrierSinners - Ryan Coogler Best supporting actress - Wunmi Mosaku, SinnersOdessa A'Zion - Marty SupremeInga Ibsdotter Lilleaas - Sentimental ValueCarey Mulligan - The Ballad of Wallis IslandTeyana Taylor - One Battle After AnotherEmily Watson - Hamnet Best supporting actor - Sean Penn, One Battle After AnotherBenicio Del Toro - One Battle After AnotherJacob Elordi - FrankensteinPaul Mescal - HamnetPeter Mullan - I SwearStellan Skarsgard - Sentimental Value Best children's and family film - BoongArcoLilo & StitchZootropolis 2 Best costume - FrankensteinHamnetMarty SupremeSinnersWicked: For Good Special visual effects - Avatar: Fire And AshF1FrankensteinHow To Train Your DragonThe Lost Bus Production design - FrankensteinHamnetMarty SupremeOne Battle After AnotherSinners Sound - F1FrankensteinOne Battle After AnotherSinnersWarfare Make-up and hair - FrankensteinHamnetMarty SupremeSinnersWicked: For Good Best original score - SinnersBugoniaFrankensteinHamnetOne Battle After Another Best animated film - Zootropolis 2ElioLittle Amelie British short animation - Two Black Boys In ParadiseCardboardSolstice Best British short film - This Is EndometriosisMagid/ ZafarNostalgieTerenceWelcome Home Freckles Casting - I SwearMarty SupremeOne Battle After AnotherSentimental ValueSinners Cinematography - One Battle After AnotherFrankensteinMarty SupremeSinnersTrain Dreams Editing - One Battle After AnotherF1A House Of DynamiteMarty SupremeSinners Best documentary - Mr Nobody Against Putin2000 Meters to AndriivkaApocalypse In The TropicsCover-UpThe Perfect Neighbor Rising star, voted for by the public - Robert Aramayo, I SwearArchie Madekwe - LurkerChase Infiniti - One Battle After AnotherMiles Caton - SinnersPosy Sterling - Lollipop"
    },
    {
        "title": "Eric Dane: Fundraiser for family of late Grey's Anatomy actor surpasses £200,000",
        "description": "A fundraiser has secured more than $275,000 (&#163;200,000) for the family of the late Grey's Anatomy actor Eric Dane, who died on Thursday at the age of 53.",
        "url": "https://news.sky.com/story/fundraiser-for-family-of-late-greys-anatomy-actor-surpasses-163200000-13510660",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-rebecca-gayheart-eric-dane_7171640.jpg?20260222090655",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-22 07:54:00",
        "Headline": "Euphoria creator Sam Levinson and his wife Ashley appeared to have donated $27,000 (£20,000) to the GoFundMe platform.",
        "Content": "A fundraiser has secured more than $275,000 (£200,000) for the family of the late Grey's Anatomy actor Eric Dane, who died on Thursday at the age of 53. The US star, also known for his role in the HBO series Euphoria, had the condition amyotrophic lateral sclerosis (ALS), also known as Lou Gehrig's disease. Dane announced he had developed the progressive neurodegenerative disease last year. A fundraiser was set up by friends of Dane and his family to raise $500,000 (£370,000) for his two teenage daughters \"who were the centre of his world\". Euphoria creator Sam Levinson and his wife Ashley appeared to have donated $27,000 (£20,000) to the GoFundMe platform. Brad Falchuck, Glee co-creator and husband of Gwyneth Paltrow, donated $10,000 (£7,400). The US actor's death was confirmed on Friday by his representatives, who said he had been surrounded by wife, actress Rebecca Gayheart, daughters Billie and Georgia, and friends. \n                  British rising star Robert Aramayo beats Timothee Chalamet and Leonardo DiCaprio to acting BAFTA - as One Battle After Another named best film\n                 \n                  BAFTAs red carpet 2026: All the fashion from British and Hollywood stars\n                 \n                  BAFTA Film Awards 2026: The full list of winning films and stars\n                 Hollywood actors have been paying tribute, including co-star Patrick Dempsey, Ashton Kutcher, Alyssa Milano, John Stamos, Nina Dobrev, Maria Shriver, Grey's Anatomy boss Shonda Rhimes and Euphoria creator Levinson. Dane is best known for playing the fan favourite Dr Mark 'McSteamy' Sloan on the long-running medical drama Grey's Anatomy from 2006 until 2012, with a guest appearance in 2021. He more recently starred in the HBO hit drama Euphoria alongside Jacob Elordi and Zendaya, playing the conflicted antagonist Cal Jacobs. Dane and Gayheart married in 2004, and separated in September 2017. Gayheart filed for divorce in 2018, but later filed to have the petition dismissed. She described their dynamic as \"very complicated\" in a December essay she wrote for New York magazine's The Cut, adding: \"Our love may not be romantic, but it's a familial love.\" The model and photographer Janell Shirtcliff also shared her memories of Dane in a series of Instagram posts on Saturday. Read more from Sky News:Full list: BAFTA nominations 2026Abbey Road opens doors for a raveStars discuss The Ballad Of Wallis Island The GoFundMe fundraising page, described as supporting \"his girls and their future needs\", described Dane's battle with the condition. \"Following his diagnosis, Eric became a passionate spokesperson for the ALS community, using his voice and platform to advocate for fellow patients and to push for greater awareness. \"Even as his own health declined, he remained deeply committed to helping others facing the same devastating disease,\" it read. Gayheart shared a photo of the GoFundMe on her Instagram stories at its launch, captioning it: \"Thank-you everyone.\" Dane is also known for his roles in Charmed, Burlesque, Marley & Me and Valentine's Day and between 2014 and 2018 he played Tom Chandler in post-apocalyptic action series The Last Ship."
    }
]