[
    {
        "title": "Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'",
        "description": "The home secretary has admitted the UK's illegal immigrant numbers are \"too high\" - but said Nigel Farage can \"sod off\" after he claimed she sounded like a Reform supporter.",
        "url": "https://news.sky.com/story/home-secretary-admits-illegal-immigration-numbers-still-too-high-under-labour-but-says-farage-can-sod-off-13471963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mahmood-shabana_7084566.jpg?20251117221723",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 22:15:00",
        "Headline": "Shabana Mahmood has announced sweeping changes to the UK's asylum system, including rowing back on guarantees of financial support. The tough proposals have been welcomed by the Tories and Reform, and left some Labour MPs feeling uneasy.",
        "Content": " The home secretary has admitted the UK's illegal immigrant numbers are \"too high\" - but said Nigel Farage can \"sod off\" after he claimed she sounded like a Reform supporter. Shabana Mahmood, speaking just after announcing a major policy change on migration, said she was \"horrified\" by the 27% increase of irregular arrivals in the year to June. Speaking to Sky News' political editor Beth Rigby, the home secretary said: \"I acknowledge the numbers are too high, and they've gone up, and I want to bring them down. \"I'm impatient to bring those numbers down.\" She refused to \"set arbitrary numbers\" on how much she wanted to bring illegal migration down to.  Earlier on Monday, Ms Mahmood announced a new direction in Labour's plan to crack down on asylum seekers. The \"restoring order and control\" plan includes: • The removal of more families with children - either voluntarily through cash incentives up to £3,000, or by force;• Quadrupling the time successful asylum seekers must wait to claim permanent residency in the UK, from five years to 20;• Removing the legal obligation to provide financial support to asylum seekers, so those with the right to work but choose not to will receive no support;• Setting up a new appeals body to significantly speed up the time it takes to decide whether to refuse an asylum application;• Reforming how the European Convention on Human Rights (ECHR) is interpreted in immigration cases;• Banning visas for countries refusing to accept deportees;• And the establishment of new safe and legal refugee routes. Read more: Everything you need to know about Labour's plans  Reform UK leader Nigel Farage said the plan was much like something his party would put forward, and said Ms Mahmood sounded like a Reform supporter. The home secretary responded with her usual frankness, telling Rigby: \"Nigel Farage can sod off. I'm not interested in anything he's got to say. \"He's making mischief. So I'm not going to let him live forever in my head.\" You might need our support, says Badenoch Her plans have also been tentatively welcomed by the Conservatives, with Kemi Badenoch suggesting the home secretary work with her in case of a rebellion by Labour MPs. The backing of Tory MPs could \"come in handy\", Ms Badenoch said. The government's attempts to cut the welfare bill earlier this year were thwarted by its own backbenchers, and the proposals announced on Monday have already attracted backlash from some on the left of the Labour Party. Nadia Whittome MP called Ms Mahmood's plans \"dystopian\" and \"shameful\", while Richard Burgon MP said she should change course now rather than be forced into a U-turn later. Read more:How the UK and Denmark's immigration policies compare Mahmood's warning to Labour MPs But Ms Mahmood has warned her colleagues that disrupting her bid to reform the asylum system - thus hoping to bring down the number of small boat crossings - risks \"dark forces\" coming to prominence. Speaking in the House of Commons on Monday evening, Ms Mahmood said: \"If we fail to deal with this crisis, we will draw more people down a path that starts with anger and ends in hatred.\" She later told Beth Rigby that Reform wanted to \"rip up\" indefinite leave to remain altogether, which she called \"immoral\" and \"deeply shameful\". The home secretary, who is a practising Muslim, was born in Birmingham to her Pakistani parents. Earlier, in the House of Commons, she said she sees the division that migration and the asylum system are creating across the country. She told MPs she regularly endures racial slurs."
    },
    {
        "title": "Why women are being forced to go abroad to help heal from a lifetime of trauma",
        "description": "Female genital mutilation (FGM) survivors in the UK have been told they have to wait for \"more research into the effectiveness\" of reconstruction surgery, forcing many to fund their own travel and treatment abroad.",
        "url": "https://news.sky.com/story/why-women-are-being-forced-to-go-abroad-to-help-heal-from-a-lifetime-of-trauma-13471703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-fgm-surgery_7084582.png?20251117223621",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-11-17 14:37:00",
        "Headline": "The World Health Organisation-approved FGM reconstruction surgery is freely available on public health services in countries like Switzerland, but for now such treatment remains unavailable on the NHS.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  Female genital mutilation (FGM) survivors in the UK have been told they have to wait for \"more research into the effectiveness\" of reconstruction surgery, forcing many to fund their own travel and treatment abroad. This article contains descriptions of FGM and reconstructive surgery some readers may find distressing. The World Health Organisation-approved FGM reconstruction surgery is freely available on public health services in European countries like Switzerland. Professor Jasmine Abdulcadir, one of the world's leading experts in FGM reconstruction surgery, sees up to 30 survivors a month at Geneva's University Hospital. \"Not all of them will need or opt for surgery,\" she told Sky News. \"There are several types of FGM, so the tissues involved might be diverse. It can be the labia, the clitoris, and the cutting might be more or less severe. So there are different types of surgeries. \"If we talk about clitoral reconstruction, this is for patients that have been cut on the clitoris. And the surgery aims at removing the scar, and making the clitoris more accessible and more sensitive.\" In cases of infibulation, which is when a woman's vulva has been closed, Prof Abdulcadir described a procedure called deinfibulation, which allows surgeons to open up the scar. \"When the vulva is closed, there are major obstructive complications,\" she explained. \"It's difficult to have penetrative sex, to deliver normally. \"Deinfibulation allows us to open the scar. We can also reconstruct the inner labia.\" 'All the girls were crying' Jamilla, not her real name, is one of Prof Abdulcadir's patients. She had FGM reconstruction surgery a little over a month ago. Jamilla is still traumatised about what happened to her as a child in West Africa. Even now, more than 30 years later. \"Every girl who came in came out crying, screaming,\" Jamilla told Sky News. \"I didn't want to go in, but they forced me and when I went in, she cut me with a blade. I jumped from the pain. All the girls were crying. I didn't want to, but they forced me.\" 'It's something that never leaves you' Jamilla's mother was against her daughter being cut but was tricked by one of her father's three wives. She was told she was going out to buy some sweets, but was instead forced into the cutter's house where she was brutalised. \"I was angry because I was just a child. She had already made the decision, but I was angry… furious with her. When I was growing up, she was always around, and I asked her this question: why? She said: 'No, it's our culture, we have to do that for the girls.' \"For me, honestly, it was exhausting. I didn't want to have to heal from it. Afterwards, they said that after one or two weeks they would have a celebration, but I wasn't feeling well at all. \"Physically, mentally. I always think about it. It's something that never leaves you. You think about it all the time.\" Read more: Why I stopped carrying out FGM 137,000 living with FGM in England and Wales The WHO estimates more than 230 million women and girls alive today have undergone FGM across 30 countries in Africa, Asia, and the Middle East. It's mostly carried out on girls under 15. In 2015, it was estimated 137,000 women and girls were living with FGM in England and Wales. And between that report's publication and 2023, FGM was identified in a total of 87,575 attendances at NHS Trusts and GP practices. The true numbers are thought to be much higher and the latest government data is expected to be published soon. But even these will not give a true figure of this unimaginable cruelty and violence deliberately perpetrated against young girls. But while FGM survivors across Europe can access reconstruction surgery through their country's public healthcare system, it is still not available in the UK. Growing demand for surgery Juliet Albert is a specialist midwife who runs a busy FGM clinic in west London. She said demand in the UK continues to grow. She said: \"We do find women coming to our clinic saying they want reconstruction surgery, and we have to say 'sorry, we don't offer it here'. \"Some of them will seek it out by going to have it done in another country perhaps, which is obviously very costly, and some of them don't manage to get any support for that. \"It may be because they've got long-term genital pain, or it might be a body image concern. Women say things like, 'I just want to be whole', or 'I want to put back what was taken away'.\" Government agrees to prioritise research These women now have some hope. Following a highly critical report by the Women and Equalities Committee into inadequate care for FGM survivors, the government has agreed to prioritise research into reconstruction surgery to make it available on the NHS. Committee chair Sarah Owen MP told Sky News: \"In an ideal situation, it would be available to everybody on everybody's doorstep. But FGM isn't a problem in every part of our country. \"But it is a problem in certain parts of our country, and I think we need to be able to prioritise those areas where the need is highest to ensure people get the surgery and the support they need as quickly as possible. \"The research isn't into the merits of reconstructive surgery. The research is into where the need is greatest.\" She hopes it will be available on the NHS \"as soon as possible\", and in the meantime that women who are struggling receive support \"sooner rather than later\". \"I want GPs to have better understanding of FGM and reconstructive surgery,\" she added. \"I want people to know that this is still an issue for so many women within our communities.\" The Labour MP thinks it's an issue the government is now taking seriously, but wants \"some action behind the words\". \"It's been an issue other countries have tackled successfully in the last 20 years,\" she said. \"I think this country can actually get to grips with this, and this is a very good start.\" But the Department of Health and Social Care told Sky News more understanding of the process was still required. \"The NHS runs FGM clinics which provide healthcare services and emotional and psychological support for victims,\" a statement said. \"We are also facilitating further research into the effectiveness of reconstructive surgery for FGM survivors through the National Institute for Health and Care Research.\" FGM reconstruction surgery cannot erase the violence or the pain. But it can offer something many survivors feared they would never have: the chance to reclaim their bodies after a lifetime of trauma."
    },
    {
        "title": "UN Security Council backs Trump peace plan for Gaza",
        "description": "The United Nations Security Council has passed a US resolution which endorses Donald Trump's peace plan for Gaza.",
        "url": "https://news.sky.com/story/un-security-council-backs-trump-peace-plan-for-gaza-13471971",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-city-israel-gaza_7084606.jpg?20251117230541",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 22:20:00",
        "Headline": "US ambassador Mike Waltz said the resolution - calling for a yet-to-be-established Board of Peace as a transitional authority in Gaza - was \"historic and constructive\" but was \"just the beginning\".",
        "Content": "The United Nations Security Council has passed a US resolution which endorses Donald Trump's peace plan for Gaza. Russia, which had circulated a rival resolution, abstained along with China on the 13-0 vote. The resolution endorses the US president's 20-point ceasefire plan, which calls for a yet-to-be-established Board of Peace as a transitional authority that Mr Trump would head. Read more: What does Trump's Gaza peace plan look like? US ambassador Mike Waltz said the resolution was \"historic and constructive\", but it was \"just the beginning\". \"Today's resolution represents another significant step towards a stable Gaza that will be able to prosper and an environment that will allow Israel to live in security,\" he added. The proposal gives no timeline or guarantee for an independent Palestinian state, only saying \"the conditions may finally be in place\" after advances in the reconstruction of Gaza and reforms of the Palestinian Authority - now governing parts of the West Bank. It also says that the US \"will establish a dialogue between Israel and the Palestinians to agree on a political horizon for peaceful and prosperous co-existence\". The language on statehood was strengthened after Arab nations and Palestinians pressured the US over nearly two weeks of negotiations, but it has also angered Israeli Prime Minister Benjamin Netanyahu. He has vowed to oppose any attempt to establish a Palestinian state, and on Sunday pledged to demilitarise Gaza \"the easy way or the hard way\".  Hamas: International force is 'in favour of' Israel In a statement rejecting the resolution's passing, a Hamas spokesperson said it \"falls far short of the political and humanitarian demands and rights of our Palestinian people\". \"The effects and repercussions of this war continue to this day, despite the declared end of the war according to President Trump's plan,\" they added. \"The resolution imposes an international trusteeship mechanism on the Gaza Strip, which our people, their forces, and factions reject.\" The spokesperson then said that \"assigning the international force with tasks and roles inside the Gaza Strip, including disarming the resistance, strips it of its neutrality, and turns it into a party to the conflict in favour of the occupation\". Read more:Trump asks Israeli president to 'fully pardon' NetanyahuInside Jordan warehouse holding Gaza aid 'refused entry by Israel' The Palestinian Authority, however, issued a statement welcoming the resolution and said it is ready to take part in its implementation."
    },
    {
        "title": "Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans",
        "description": "People travelling to the United States for the football World Cup next year will be able to get interviews for visas more quickly, Donald Trump has announced.",
        "url": "https://news.sky.com/story/trump-unveils-fifa-pass-scheme-to-give-priority-visa-appointment-access-to-world-cup-fans-13471895",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-fifa_7084543.jpg?20251117215856",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 20:55:00",
        "Headline": "The pass will allow those with tickets for the 2026 event, purchased through FIFA, to get expedited visa appointments.",
        "Content": "People travelling to the United States for the football World Cup next year will be able to get interviews for visas more quickly, Donald Trump has announced. The US president announced the FIFA Prioritised Appointment Scheduling System, or FIFA PASS, in a news conference in the Oval Office. \"I've directed my administration to do everything within their power to make the 2026 World Cup an unprecedented success,\" he said. Trump latest: President threatens strikes on World Cup co-host to stop drugs The pass will allow those with World Cup tickets purchased through FIFA to get expedited visa appointments. Speaking alongside FIFA president Gianni Infantino, Mr Trump said he \"strongly\" encourages World Cup travellers to the US to apply for their visas \"right away\". US Secretary of State Marco Rubio said the administration had added 400 consular officers around the world to deal with increased demand for visas. He said in about 80% of the globe, travellers to the US can get a visa appointment within 60 days. Under the new system, those who have bought tickets through FIFA will be allowed to go through a \"FIFA portal\" to help get their visa application and interview prioritised at the State Department, Mr Rubio said. \"We're going to do the same vetting as anybody else would get,\" he added. \"The only difference here is, we're moving them up in the queue.\" Read more from Sky News:US aircraft carrier arrives close to Venezuela amid military build-upTrump ally 'open to moving forward' after row with US president After the announcement, Mr Infantino said: \"America welcomes the world. We have always said that this will be the greatest and most inclusive FIFA World Cup in history - and the FIFA PASS service is a very concrete example of that.\" He added: \"The United States is set to welcome fans from around the world on an unprecedented scale, and we are preparing to ensure that football unites the world when the tournament kicks off in North America next June.\" Over six million tickets will be available for the 104 World Cup games, which will be held across 16 host cities in Canada, Mexico as well as the United States. It has been easier for fans to travel to recent men's World Cups. In 2018, the visa process could be circumvented, with Russia requiring only fan IDs gained by submitting a photo, passport data and other personal information along with a match ticket reference. Instead of visas for Qatar 2022, fans only had to obtain a Hayya Card through a website in order to enter the Gulf nation."
    },
    {
        "title": "How a grassy Oxfordshire field became an illegal mountain of waste in just months",
        "description": "Satellite images reveal how a grassy field in Oxfordshire was transformed into an illegal waste site in just a few months. ",
        "url": "https://news.sky.com/story/how-a-grassy-oxfordshire-field-became-an-illegal-mountain-of-waste-in-just-months-13471715",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-data-forensics_7084211.jpg?20251117155154",
        "type": "Home",
        "Author": "Adam Parker, OSINT editor and Rachael Venables, correspondent",
        "Date Published": "2025-11-17 14:56:00",
        "Headline": "Hidden in plain sight - Sky News is investigating the boom in waste crime in the UK, a lucrative trade dubbed ‘the new narcotics’. ",
        "Content": "By Adam Parker, OSINT editor and Rachael Venables, correspondent   Satellite images reveal how a grassy field in Oxfordshire was transformed into an illegal waste site in just a few months.  The site is next to the A34, a busy road running through cities including Oxford and Birmingham. The land is just over three acres in size and is largely hidden by trees on all sides. The River Cherwell runs along its west side. A satellite image from the end of March this year shows the site largely covered in grass. By 13 June, it has completely transformed. The grass is replaced by dirt, and an excavator is caught in a satellite image. On 17 August, the site remains largely unchanged apart from what appears to be a single lorry load of rubbish. Five weeks later on 22 September, a 150-metre long and 15-metre wide area is piled with waste. Use the slider below to see how much the site has changed. \n                  Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'\n                 \n                  Why women are being forced to go abroad to help heal from a lifetime of trauma\n                 \n                  Weather latest: Amber cold health alert now issued for parts of UK until Saturday\n                 Drone footage filmed by Sky News shows that the waste dump is at least 10 metres high. It would have taken tens of lorry loads to pile up this much waste in so little time. News correspondent You can’t see the waste from the dual-carriageway, but across a fence, and just past the rushing River Cherwell - a mountain of rubbish rises above you. \n It’s an undulating, continuous stream of shredded waste. When the wind is right the smell makes you gag. People who’ve gotten closer than us to the rubbish say the waste even feels warm in places, sparking fears it’s already decomposing - with a growing risk of fires starting underneath. There’s no way of knowing what the rubbish is made up off - but there’s clearly a huge amount of plastic in these mounds. The working assumption is a mixture of building and household waste. At the edges I spot an old DVD churned in the mud, tooth floss and AA batteries. We don’t yet know what sort of chemicals might also be in the mix, which risk leeching into the surrounding environment and water.  The illegal dump is staggering in its size; and there's a brazenness in the way this has been left here. Metres from a busy road, but hidden by trees - it’s the perfect location to hide a crime that’s costing us so much every year; from financial to environmental damage. Yet the authorities always seem to be scrambling to play catch up with the criminals. Calum Miller, Liberal Democrat MP for Bicester and Woodstock, told Sky News it was the first time he had seen anything on this scale, questioning whether the Environmental Agency had the resources to deal with it. He said it's the work of an organised crime group. The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m.  With the site on a floodplain, Mr Miller listed what he saw as the three major environmental risks - waste being washed into the waterways, rain seeping through the waste and carrying toxins into the water and the danger of decomposing chemicals presenting a fire risk. He said the police had used a helicopter with a heat-seeking camera and could see that some of the waste was indeed starting to decompose. Sky News has been investigating how, across the country, waste crime is a growing scourge and a booming business being exploited by criminal gangs.  Being paid to remove rubbish only to dump it illegally without sorting it or paying tax is an easy way of making huge amounts of money, with poorly enforced legal repercussions and a huge cost to the environment.  It's something the previous head of the Environment Agency called \"the new narcotics\". - It's thought a fifth of all waste in England is being illegally managed - That's around 34 million tonnes a year, enough to fill about four million skips - It costs the economy around a billion pounds a year, with legitimate operators thought to be losing a further £3bn from missed business In July,  we tracked down a group of suspected organised fly-tippers who waved wads of cash on TikTok after dumping waste in the countryside.\n The Environment Agency told Sky News, \"This is a sickening case of large-scale illegal waste dumping and we share the public's disgust.\" A spokesperson said: \"we took immediate action - issuing a cease and desist order in July. When the risk of further dumping emerged we subsequently secured a court order to close the site to prevent more waste from being illegally tipped. \"We have launched a major investigation and are working closely with the police and other partners to find those responsible and bring them to justice.\" Dr Amani Maalouf, a senior waste management researcher at the University of Oxford, told Sky News that the site is a \"significant environment incident\". \"Once mixed waste interacts with a watercourse, microplastics, packaging residues, and other contaminants can disperse widely and persist in the environment,\" she said. If you have been affected by fly-tipping, email news@skynews.com or send us a message on Whatsapp The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Weather latest: Amber cold health alert now issued for parts of UK until Saturday",
        "description": "Cold health alerts have been issued for large parts of the UK from midday on Monday until Saturday morning.",
        "url": "https://news.sky.com/story/weather-latest-amber-cold-health-alert-now-issued-for-parts-of-uk-until-saturday-13471658",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-scottish-highlands_7084124.jpg?20251117140126",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 12:44:00",
        "Headline": "The most serious alert covers the North East, North West and Yorkshire and the Humber, but the rest of England is also going to feel the chill over the coming week, forecasters say.",
        "Content": "Cold health alerts have been issued for large parts of the UK from midday on Monday until Saturday morning. The UK Health Security Agency (UKHSA) issued an amber cold health alert for the North East, North West and Yorkshire and the Humber on Monday. A yellow cold health alert affects the rest of England. Check the weather forecast where you are  Multiple yellow weather warnings for snow and ice have been issued by the Met Office for parts of Scotland and northern England from Monday to Thursday. Sub-zero temperatures are expected during the first cold snap of the year, as a spell of above-average temperatures comes to an end. Temperatures dropped as low as -7C (19F) in Tulloch Bridge in the Highlands on Saturday, the UK's coldest night since March. Arctic air heads southwards on Monday, the forecasters said, and by Wednesday, the whole of the UK will be under its spell. Sky weather presenter Jo Wheeler said the UK and Ireland can expect \"quite a dramatic change\" and warned the expected cold snap, following a mild start to autumn, will feel \"shocking\". She said the current yellow weather warnings for ice cover northern and eastern parts of the country over the next few days \"with the potential for snow or wind warnings\" later this week. The potential impacts \"would appear to be small and confined to northern and elevated areas familiar with such winter hazards\". An area of rain, sleet and snow will move across the country from Monday into Tuesday and stronger winds toward the end of the week will bring significant windchill, \"making it feel much colder than temperatures would suggest\". Milder conditions should move in by the weekend, she said. Met Office deputy chief meteorologist Dan Holley said: \"As Storm Claudia retreats to the South, high pressure to the North West will drive a cold northerly flow from the Arctic across the UK.\" A major incident had been declared in Monmouth, southeast Wales, over the weekend as people were rescued from flooded homes after the storm.  Looking forward, Mr Holley predicted \"much colder conditions than of late and, whilst generally drier than recent days, there will also be a risk of wintry hazards, such as snow and ice\". Widespread frosts are likely across the UK, he said, with temperatures dipping \"as low as -7C in places\". Single-figure daytime temperatures, coupled with a brisk northerly wind, will mean \"a marked wind chill\". The Met Office's chief forecaster Paul Gundersen said rain expected over western Scotland on Tuesday morning could turn to snow as it moves inland. He said details are sketchy, but \"a period of snow is likely over high ground, with accumulations of 2-5cm (0.8-1.9ins) possible above about 150m (492ft) in elevation, and as much as 5-10cm (1.9-3.9ins) above 400m (1,312ft)\". Mr Gundersen said that \"some disruption to travel and infrastructure across higher parts of Scotland\" is possible and, by Wednesday, a \"strong and very cold northerly flow\" will make temperatures feel even colder. Deputy chief forecaster Tom Crabtree warned that Wednesday to Friday \"will be the coldest part of the week\" as overnight temperatures \"could get down to -10C (14F)\". He predicted \"a significant wind chill\" from the strong northerly wind, making things feel even colder. \"Wintry snow showers are expected to extend south through Wednesday and into Thursday, mainly affecting north-facing coastal areas,\" he said. Read more on Sky News:How Claudia devastated PortugalUK suffers flooding as storm hits  An amber warning means the weather is likely to cause \"significant impacts across health and social care services\" including an increase in demand for health services; temperatures inside places like hospitals, care homes and clinics dropping below the levels recommended for assessing health risks; and a rise in deaths, particularly among those aged 65 and over or with health conditions. The British Heart Foundation (BHF) has warned people with heart conditions to take extra care. Ruth Goss, senior cardiac nurse at the foundation, said cold temperatures can \"increase the risk of heart attacks and strokes, and people with cardiovascular disease are also more at risk of serious illness if they get seasonal respiratory infections like flu\". She advised anyone with such a condition to wrap up warm and have their free flu jab."
    },
    {
        "title": "Investigation launched after man dies on North Sea drilling rig",
        "description": "An investigation has been launched into the death of an offshore worker on a drilling rig in the North Sea.",
        "url": "https://news.sky.com/story/investigation-launched-after-man-dies-on-north-sea-drilling-rig-13471772",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lee-hulse-scotland_7084306.jpg?20251117172704",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 16:38:00",
        "Headline": "Lee Hulse, 32, died while working on the Valaris 121 oil platform off the coast of Aberdeen.",
        "Content": "An investigation has been launched into the death of an offshore worker on a drilling rig in the North Sea. Lee Hulse, 32, died while working on the Valaris 121 oil platform off the coast of Aberdeen. Police Scotland were called to a report of a death around 4:40am on Friday. \"The death is not being treated as suspicious,\" a spokesperson for the force said. \"The Health and Safety Executive has been informed and a report has been submitted to the Procurator Fiscal.\" A spokesperson for Scotland's Health and Safety Executive (HSE) said: \"We are aware of the incident and will be investigating alongside Police Scotland.\" Local media said Mr Hulse died after falling from a crane. A GoFundMe campaign to give Mr Hulse \"the send off he deserves\" had raised nearly £15,000 by Monday night. \"Tragically and very suddenly Lee has lost his life,\" the organiser of the fundraiser said. \"Leaving behind his family that loved him the most. \"No family partner or friends are ever prepared for this type of loss. \"Lee always looked after his family and all his friends, so this is our turn to make sure we look after him and give him the best send-off that he deserves and make sure his daughter is well looked after.\" A spokesperson for Valaris told local media: \"Valaris regrets to inform that a crew member onboard its Valaris 121 jack up drilling rig has sadly died as a result of an incident in the early hours of Friday November 14. \"Their next of kin has been informed and Valaris is offering support to them at this difficult time. \"All remaining personnel onboard the V121 at the time of the incident have been safely accounted for.\" It said operations on the Valaris 121 had been temporarily halted."
    },
    {
        "title": "'I'm about to break the internet over Jake Paul's face'",
        "description": "Boxer Anthony Joshua is set to mark his comeback to the ring with a surprise heavyweight bout against Jake Paul in Miami.",
        "url": "https://news.sky.com/story/im-about-to-break-the-internet-over-jake-pauls-face-13471710",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anthony-joshua-jake-paul_7084187.jpg?20251117152300",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 14:46:00",
        "Headline": "The fight on 19 December will mark the former world heavyweight champion's first since losing to Daniel Dubois in September 2024.",
        "Content": " Boxer Anthony Joshua is set to mark his comeback to the ring with a surprise heavyweight bout against Jake Paul in Miami. The former world heavyweight champion and YouTuber-turned-boxer will face off in a match consisting of eight three-minute rounds, with both boxers using 10oz gloves. The 36-year-old hasn't fought since September 2024, when he suffered a shock loss to British compatriot Daniel Dubois at Wembley in the fifth round of their IBF world heavyweight title fight. Joshua, who goes in with a record of 28 wins and four losses, promised the American \"no mercy\" ahead of his comeback. \"I took some time out, and I'm coming back with a mega show. It's a big opportunity for me. Whether you like it or not, I'm here to do massive numbers, have big fights and break every record whilst keeping cool, calm and collected,\" he said. \"Mark my words, you'll see a lot more fighters take these opportunities in the future. I'm about to break the internet over Jake Paul's face.\" If Jake Paul wins, he'll be in the running for a title, according to his manager, Nakisa Bidarian, chief executive of Most Valuable Promotions. \n                  Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'\n                 \n                  Why women are being forced to go abroad to help heal from a lifetime of trauma\n                 \n                  Weather latest: Amber cold health alert now issued for parts of UK until Saturday\n                 He said: \"For Jake it's doing the impossible, silencing the doubters and putting himself in a position to be in conversation for a belt, and he gets that if he beats Anthony Joshua. \"And for Joshua it's pretty simple: he's been out for quite a bit of time, he comes back and does one of the biggest events in the world, and if he knocks out Jake Paul he will be idolised by many within boxing.\" He continued: \"What we've accomplished in four years with Jake, with no amateur background, with no Olympic pedigree, makes everyone kind of take a step back and say, 'What is going on here? How is this possible?' \"It angers people in boxing that we can come in and get as much attention and notoriety as we have, as quickly as we have.\"  Paul was due to face Gervonta Davis this month, but the bout was cancelled after a civil lawsuit was filed against the WBA lightweight champion. The 28-year-old, who has a 12-1 record, last fought at heavyweight when he beat Mike Tyson by unanimous decision in November last year, in what was the then 58-year-old's first fight in 19 years, before following that up in June with another unanimous decision victory over Julio Cesar Chavez Jr. Read more from Sky News:Anthony Joshua could return to ring to fight ex-YouTuberTyson reveals he 'almost died' ahead of fight with Paul Paul labelled the fight in Miami as \"Judgement Day.\" \"A professional heavyweight fight against an elite world champion in his prime. When I beat Anthony Joshua, every doubt disappears and no one can deny me the opportunity to fight for a world title. \"To all my haters, this is what you wanted. To the people of the United Kingdom, I am sorry. On Friday, December 19, under the lights in Miami, live globally only on Netflix, the torch gets passed and Britain's Goliath gets put to sleep.\""
    },
    {
        "title": "School ban put us in 'ridiculous position', says father in WhatsApp row after police admit unlawful arrest ",
        "description": "A mum and dad who were detained by police after complaining about their daughter's school on WhatsApp, have said they feel 'vindicated' after the force agreed to pay them &#163;20,000 in compensation.",
        "url": "https://news.sky.com/story/school-ban-put-us-in-ridiculous-position-says-father-in-whatsapp-row-after-police-admit-unlawful-arrest-13471559",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-family-children_7084265.jpg?20251117165450",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-17 08:49:00",
        "Headline": "Maxie Allen, 50, and Rosalind Levine, 47, from Borehamwood, were detained in January by Hertfordshire Police and held in a police cell for eight hours following the dispute. ",
        "Content": "A mum and dad who were detained by police after complaining about their daughter's school on WhatsApp, have said they feel 'vindicated' after the force agreed to pay them £20,000 in compensation. Maxie Allen, 50, and Rosalind Levine, 47, of Borehamwood, Hertfordshire, were detained in January by Hertfordshire Police and held in a police cell for eight hours following the dispute. They were questioned on suspicion of harassment, malicious communications and causing a nuisance on school property, with the case leading to a national debate about police overreach. The row with the school started after Mr Allen complained about the recruitment process for a new head teacher. The school then contacted police, which led to the arrests, after it objected to the parents sending several emails and criticising staff on a private parents' WhatsApp group. The school claimed the couple were making \"disparaging and inflammatory\" remarks. They were also blocked from attending parents' evening and banned from entering the premises. Hertfordshire Constabulary originally defended the arrest, but after a five-week investigation has now agreed to pay out £10,000 each to Mr Allen and Ms Levine. The force said the amount was \"significantly above that required by the case law and reflects the constabulary's desire to bring matters to a conclusion\". After officers arrested the couple in front of their other daughter, aged three, their home was searched. CCTV footage shared widely online showed six uniformed officers approach the home before leading the couple away. Commenting on the admission of wrongful arrest, Mr Allen told Sky News the decision was a \"relief\". He added it was a \"vindication\" and gives them the chance to get some closure. The force admitted the legal criteria for arrest were \"not made out\" and formally accepted liability for wrongful arrest and detention. It maintained that it was the right decision to investigate, due to a large number of emails and negative WhatsApp messages sent by Mr Allen and Ms Levine to Cowley Hill Primary School, which their daughter, Sascha, 10, attended. Read more from Sky News:Home secretary threatens visa ban on three countriesJansen ready for take-off as next chairman of Heathrow Airport The couple had taken Sascha out of school five days before they were arrested, Mr Allen added. He said: \"We'd given in and walked away, and then five days later the police turned up.\" Sascha suffers from epilepsy and is neurodivergent, but the couple said in March they were not allowed to meet teachers to discuss her medical conditions. Mr Allen told Sky News on Monday the ban meant they couldn't have any \"normal contact with anybody at the school\". He said: \"We weren't allowed to call. We weren't allowed to go on the school site. We weren't allowed to have meetings, or a Zoom. We had to kind of navigate our own way through the education and care of our daughter, who has a disability.\" He said the ban put them in an \"impossible position where we couldn't have any more contact with our daughter's school,\" adding that they could only email. They also used email to go through the formal complaints process, he said, due to the ban. Mr Allen added that his daughter is now at a different school, where she is happy. He said: \"I stand by the view that trying to stick up for your daughter's education, health and welfare, being able to speak your mind freely about how an organisation is being run, and having the right to have private conversations does not justify six police officers turning up at our house.\" In April, Andy Prophet, chief constable of Hertfordshire, defended the arrests, but added that \"with the benefit of hindsight we could have achieved the same ends in a different way\". He said that the inspector who had approved them did not believe the couple would consent to a voluntary interview and also had to preserve electronic devices. However, Hertfordshire Constabulary's lawyers this month admitted that the criteria for arrest under the Police and Criminal Evidence Act were not made out, \"rendering the arrest unlawful\". A spokesperson for Hertfordshire Constabulary told Sky News on Monday: \"Whilst there are no issues of misconduct involving any officer in relation to this matter, Hertfordshire Constabulary has accepted liability solely on the basis that the legal test around necessity of arrest was not met in this instance. \"Therefore, Mr Allen and Ms Levine were wrongfully arrested and detained in January 2025. It would be inappropriate to make further comment at this stage.\" A spokesperson for Cowley Hill Primary School said: \"As previously stated in March 2025 we contacted the police following a very high volume of direct email correspondence and what we considered upsetting and derogatory social media posts, on Facebook and WhatsApp, from two parents. \"As a school, we welcome dialogue with parents, however the nature and large volume of the communication and public posts meant that the school were no longer able to manage using normal internal procedures. As a result we sought advice from the police. \"Cowley Hill School continues to put its focus on providing an excellent education for its pupils and will not be commenting any further on this matter.\""
    },
    {
        "title": "Report claims almost 100 Palestinian prisoners have died in Israeli jails since October 2023",
        "description": "Nearly a hundred Palestinian prisoners have died in custody since the start of the war in Gaza, according to a human rights group that claims prisoners are being denied medical care and are the victims of systematic and brutal violence.",
        "url": "https://news.sky.com/story/report-claims-almost-100-palestinian-prisoners-have-died-in-israeli-jails-since-october-2023-13471875",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-israel-palestine-prison_7084473.jpg?20251117202640",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-17 20:14:00",
        "Headline": "The highest number of deaths are alleged to have happened at the Sde Teiman detention centre.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n Nearly a hundred Palestinian prisoners have died in custody since the start of the war in Gaza, according to a human rights group that claims prisoners are being denied medical care and are the victims of systematic and brutal violence. The report, from Physicians for Human Rights - Israel (PHRI), tracked deaths due to a variety of causes, including violence, malnutrition and untreated injuries. Its data came partly from Israeli authorities, and also from lawyers, relatives and witnesses. The report says that at least 98 Palestinian prisoners have died over the past two years. However, the PHRI adds that the figure is likely to be a significant underestimate, citing claims of \"enforced disappearances\" and allegations of prisoners being shot shortly after they were released from detention.  In one case, the report claims that a prisoner died because the insulin, which they needed to treat diabetes, was withheld. The report claims that just under half of these deaths - 46 - occurred in the Israeli prison service while the remaining 52 deaths involved people being held in military facilities. The highest number of fatalities are alleged to have happened at the Sde Teiman detention centre, a facility located in the Negev Desert and notorious for its brutality. It has recently become the focus of huge attention after Israel's chief military advocate, Yifat Tomer-Yerushalmi, admitted leaking a video that appears to show a Palestinian prisoner being severely beaten in Sde Teiman. Tomer-Yerushalmi is now under house arrest while the leak is investigated. Critics of the Israeli justice system say that her arrest contrasts with the reluctance of authorities to investigate the original, and widespread, allegations of violence carried out on prisoners in the Sde Teiman centre. The report's allegations come at a time when questions of crime and punishment are receiving plenty of attention. Itamar Ben-Gvir, the minister responsible for national security, has demanded even harsher conditions, visited jails to taunt prisoners and also called for the death penalty to be introduced for anyone convicted of terrorism. The Israeli military told us \"individuals in Gaza are detained when there is reasonable suspicion of their involvement in terrorist activities…and [if deemed necessary] are detained in designated facilities within Israeli territory\". Read more:Trump asks for pardon for Netanyahu in corruption trialFreed prisoner alleges torture and deaths in Israeli detention The PHRI report concludes that there is \"little doubt that the deaths of many detained Palestinians were the result of systematic actions by soldiers and prison guards, carried out with the encouragement, or at the very least the tacit approval, of their superiors\". It further alleges that \"the sharp rise in the number of Palestinians who have died in Israeli incarceration facilities since October 7, 2023, compared to previous years, demonstrates that the killing of Palestinians in custody has become an additional instrument of state against Palestinians oppression since the onset of the war\". Israel's prison service insists it operates within the confines of the law. The Israeli military said its rules around detention are \"in full alignment with Israeli law and the Geneva Conventions\". Its statement continued: \"The IDF is aware of incidents of deaths of detainees, including detainees who were detained with a pre-existing illness or injury as a result of the hostilities. As per standard protocol, an investigation is conducted for each death of a detainee by the military police. \"According to the law, every detainee held under a detention order is subject to judicial review. Every detainee has the right to be represented by a lawyer.\""
    },
    {
        "title": "Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'",
        "description": "The home secretary has admitted the UK's illegal immigrant numbers are \"too high\" - but said Nigel Farage can \"sod off\" after he claimed she sounded like a Reform supporter.",
        "url": "https://news.sky.com/story/home-secretary-admits-illegal-immigration-numbers-still-too-high-under-labour-but-says-farage-can-sod-off-13471963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mahmood-shabana_7084566.jpg?20251117221723",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-17 22:15:00",
        "Headline": "Shabana Mahmood has announced sweeping changes to the UK's asylum system, including rowing back on guarantees of financial support. The tough proposals have been welcomed by the Tories and Reform, and left some Labour MPs feeling uneasy.",
        "Content": " The home secretary has admitted the UK's illegal immigrant numbers are \"too high\" - but said Nigel Farage can \"sod off\" after he claimed she sounded like a Reform supporter. Shabana Mahmood, speaking just after announcing a major policy change on migration, said she was \"horrified\" by the 27% increase of irregular arrivals in the year to June. Speaking to Sky News' political editor Beth Rigby, the home secretary said: \"I acknowledge the numbers are too high, and they've gone up, and I want to bring them down. \"I'm impatient to bring those numbers down.\" She refused to \"set arbitrary numbers\" on how much she wanted to bring illegal migration down to.  Earlier on Monday, Ms Mahmood announced a new direction in Labour's plan to crack down on asylum seekers. The \"restoring order and control\" plan includes: • The removal of more families with children - either voluntarily through cash incentives up to £3,000, or by force;• Quadrupling the time successful asylum seekers must wait to claim permanent residency in the UK, from five years to 20;• Removing the legal obligation to provide financial support to asylum seekers, so those with the right to work but choose not to will receive no support;• Setting up a new appeals body to significantly speed up the time it takes to decide whether to refuse an asylum application;• Reforming how the European Convention on Human Rights (ECHR) is interpreted in immigration cases;• Banning visas for countries refusing to accept deportees;• And the establishment of new safe and legal refugee routes. Read more: Everything you need to know about Labour's plans  Reform UK leader Nigel Farage said the plan was much like something his party would put forward, and said Ms Mahmood sounded like a Reform supporter. The home secretary responded with her usual frankness, telling Rigby: \"Nigel Farage can sod off. I'm not interested in anything he's got to say. \"He's making mischief. So I'm not going to let him live forever in my head.\" You might need our support, says Badenoch Her plans have also been tentatively welcomed by the Conservatives, with Kemi Badenoch suggesting the home secretary work with her in case of a rebellion by Labour MPs. The backing of Tory MPs could \"come in handy\", Ms Badenoch said. The government's attempts to cut the welfare bill earlier this year were thwarted by its own backbenchers, and the proposals announced on Monday have already attracted backlash from some on the left of the Labour Party. Nadia Whittome MP called Ms Mahmood's plans \"dystopian\" and \"shameful\", while Richard Burgon MP said she should change course now rather than be forced into a U-turn later. Read more:How the UK and Denmark's immigration policies compare Mahmood's warning to Labour MPs But Ms Mahmood has warned her colleagues that disrupting her bid to reform the asylum system - thus hoping to bring down the number of small boat crossings - risks \"dark forces\" coming to prominence. Speaking in the House of Commons on Monday evening, Ms Mahmood said: \"If we fail to deal with this crisis, we will draw more people down a path that starts with anger and ends in hatred.\" She later told Beth Rigby that Reform wanted to \"rip up\" indefinite leave to remain altogether, which she called \"immoral\" and \"deeply shameful\". The home secretary, who is a practising Muslim, was born in Birmingham to her Pakistani parents. Earlier, in the House of Commons, she said she sees the division that migration and the asylum system are creating across the country. She told MPs she regularly endures racial slurs."
    },
    {
        "title": "Why women are being forced to go abroad to help heal from a lifetime of trauma",
        "description": "Female genital mutilation (FGM) survivors in the UK have been told they have to wait for \"more research into the effectiveness\" of reconstruction surgery, forcing many to fund their own travel and treatment abroad.",
        "url": "https://news.sky.com/story/why-women-are-being-forced-to-go-abroad-to-help-heal-from-a-lifetime-of-trauma-13471703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-fgm-surgery_7084582.png?20251117223621",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-11-17 14:37:00",
        "Headline": "The World Health Organisation-approved FGM reconstruction surgery is freely available on public health services in countries like Switzerland, but for now such treatment remains unavailable on the NHS.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  Female genital mutilation (FGM) survivors in the UK have been told they have to wait for \"more research into the effectiveness\" of reconstruction surgery, forcing many to fund their own travel and treatment abroad. This article contains descriptions of FGM and reconstructive surgery some readers may find distressing. The World Health Organisation-approved FGM reconstruction surgery is freely available on public health services in European countries like Switzerland. Professor Jasmine Abdulcadir, one of the world's leading experts in FGM reconstruction surgery, sees up to 30 survivors a month at Geneva's University Hospital. \"Not all of them will need or opt for surgery,\" she told Sky News. \"There are several types of FGM, so the tissues involved might be diverse. It can be the labia, the clitoris, and the cutting might be more or less severe. So there are different types of surgeries. \"If we talk about clitoral reconstruction, this is for patients that have been cut on the clitoris. And the surgery aims at removing the scar, and making the clitoris more accessible and more sensitive.\" In cases of infibulation, which is when a woman's vulva has been closed, Prof Abdulcadir described a procedure called deinfibulation, which allows surgeons to open up the scar. \"When the vulva is closed, there are major obstructive complications,\" she explained. \"It's difficult to have penetrative sex, to deliver normally. \"Deinfibulation allows us to open the scar. We can also reconstruct the inner labia.\" 'All the girls were crying' Jamilla, not her real name, is one of Prof Abdulcadir's patients. She had FGM reconstruction surgery a little over a month ago. Jamilla is still traumatised about what happened to her as a child in West Africa. Even now, more than 30 years later. \"Every girl who came in came out crying, screaming,\" Jamilla told Sky News. \"I didn't want to go in, but they forced me and when I went in, she cut me with a blade. I jumped from the pain. All the girls were crying. I didn't want to, but they forced me.\" 'It's something that never leaves you' Jamilla's mother was against her daughter being cut but was tricked by one of her father's three wives. She was told she was going out to buy some sweets, but was instead forced into the cutter's house where she was brutalised. \"I was angry because I was just a child. She had already made the decision, but I was angry… furious with her. When I was growing up, she was always around, and I asked her this question: why? She said: 'No, it's our culture, we have to do that for the girls.' \"For me, honestly, it was exhausting. I didn't want to have to heal from it. Afterwards, they said that after one or two weeks they would have a celebration, but I wasn't feeling well at all. \"Physically, mentally. I always think about it. It's something that never leaves you. You think about it all the time.\" Read more: Why I stopped carrying out FGM 137,000 living with FGM in England and Wales The WHO estimates more than 230 million women and girls alive today have undergone FGM across 30 countries in Africa, Asia, and the Middle East. It's mostly carried out on girls under 15. In 2015, it was estimated 137,000 women and girls were living with FGM in England and Wales. And between that report's publication and 2023, FGM was identified in a total of 87,575 attendances at NHS Trusts and GP practices. The true numbers are thought to be much higher and the latest government data is expected to be published soon. But even these will not give a true figure of this unimaginable cruelty and violence deliberately perpetrated against young girls. But while FGM survivors across Europe can access reconstruction surgery through their country's public healthcare system, it is still not available in the UK. Growing demand for surgery Juliet Albert is a specialist midwife who runs a busy FGM clinic in west London. She said demand in the UK continues to grow. She said: \"We do find women coming to our clinic saying they want reconstruction surgery, and we have to say 'sorry, we don't offer it here'. \"Some of them will seek it out by going to have it done in another country perhaps, which is obviously very costly, and some of them don't manage to get any support for that. \"It may be because they've got long-term genital pain, or it might be a body image concern. Women say things like, 'I just want to be whole', or 'I want to put back what was taken away'.\" Government agrees to prioritise research These women now have some hope. Following a highly critical report by the Women and Equalities Committee into inadequate care for FGM survivors, the government has agreed to prioritise research into reconstruction surgery to make it available on the NHS. Committee chair Sarah Owen MP told Sky News: \"In an ideal situation, it would be available to everybody on everybody's doorstep. But FGM isn't a problem in every part of our country. \"But it is a problem in certain parts of our country, and I think we need to be able to prioritise those areas where the need is highest to ensure people get the surgery and the support they need as quickly as possible. \"The research isn't into the merits of reconstructive surgery. The research is into where the need is greatest.\" She hopes it will be available on the NHS \"as soon as possible\", and in the meantime that women who are struggling receive support \"sooner rather than later\". \"I want GPs to have better understanding of FGM and reconstructive surgery,\" she added. \"I want people to know that this is still an issue for so many women within our communities.\" The Labour MP thinks it's an issue the government is now taking seriously, but wants \"some action behind the words\". \"It's been an issue other countries have tackled successfully in the last 20 years,\" she said. \"I think this country can actually get to grips with this, and this is a very good start.\" But the Department of Health and Social Care told Sky News more understanding of the process was still required. \"The NHS runs FGM clinics which provide healthcare services and emotional and psychological support for victims,\" a statement said. \"We are also facilitating further research into the effectiveness of reconstructive surgery for FGM survivors through the National Institute for Health and Care Research.\" FGM reconstruction surgery cannot erase the violence or the pain. But it can offer something many survivors feared they would never have: the chance to reclaim their bodies after a lifetime of trauma."
    },
    {
        "title": "Weather latest: Amber cold health alert now issued for parts of UK until Saturday",
        "description": "Cold health alerts have been issued for large parts of the UK from midday on Monday until Saturday morning.",
        "url": "https://news.sky.com/story/weather-latest-amber-cold-health-alert-now-issued-for-parts-of-uk-until-saturday-13471658",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-scottish-highlands_7084124.jpg?20251117140126",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-17 12:44:00",
        "Headline": "The most serious alert covers the North East, North West and Yorkshire and the Humber, but the rest of England is also going to feel the chill over the coming week, forecasters say.",
        "Content": "Cold health alerts have been issued for large parts of the UK from midday on Monday until Saturday morning. The UK Health Security Agency (UKHSA) issued an amber cold health alert for the North East, North West and Yorkshire and the Humber on Monday. A yellow cold health alert affects the rest of England. Check the weather forecast where you are  Multiple yellow weather warnings for snow and ice have been issued by the Met Office for parts of Scotland and northern England from Monday to Thursday. Sub-zero temperatures are expected during the first cold snap of the year, as a spell of above-average temperatures comes to an end. Temperatures dropped as low as -7C (19F) in Tulloch Bridge in the Highlands on Saturday, the UK's coldest night since March. Arctic air heads southwards on Monday, the forecasters said, and by Wednesday, the whole of the UK will be under its spell. Sky weather presenter Jo Wheeler said the UK and Ireland can expect \"quite a dramatic change\" and warned the expected cold snap, following a mild start to autumn, will feel \"shocking\". She said the current yellow weather warnings for ice cover northern and eastern parts of the country over the next few days \"with the potential for snow or wind warnings\" later this week. The potential impacts \"would appear to be small and confined to northern and elevated areas familiar with such winter hazards\". An area of rain, sleet and snow will move across the country from Monday into Tuesday and stronger winds toward the end of the week will bring significant windchill, \"making it feel much colder than temperatures would suggest\". Milder conditions should move in by the weekend, she said. Met Office deputy chief meteorologist Dan Holley said: \"As Storm Claudia retreats to the South, high pressure to the North West will drive a cold northerly flow from the Arctic across the UK.\" A major incident had been declared in Monmouth, southeast Wales, over the weekend as people were rescued from flooded homes after the storm.  Looking forward, Mr Holley predicted \"much colder conditions than of late and, whilst generally drier than recent days, there will also be a risk of wintry hazards, such as snow and ice\". Widespread frosts are likely across the UK, he said, with temperatures dipping \"as low as -7C in places\". Single-figure daytime temperatures, coupled with a brisk northerly wind, will mean \"a marked wind chill\". The Met Office's chief forecaster Paul Gundersen said rain expected over western Scotland on Tuesday morning could turn to snow as it moves inland. He said details are sketchy, but \"a period of snow is likely over high ground, with accumulations of 2-5cm (0.8-1.9ins) possible above about 150m (492ft) in elevation, and as much as 5-10cm (1.9-3.9ins) above 400m (1,312ft)\". Mr Gundersen said that \"some disruption to travel and infrastructure across higher parts of Scotland\" is possible and, by Wednesday, a \"strong and very cold northerly flow\" will make temperatures feel even colder. Deputy chief forecaster Tom Crabtree warned that Wednesday to Friday \"will be the coldest part of the week\" as overnight temperatures \"could get down to -10C (14F)\". He predicted \"a significant wind chill\" from the strong northerly wind, making things feel even colder. \"Wintry snow showers are expected to extend south through Wednesday and into Thursday, mainly affecting north-facing coastal areas,\" he said. Read more on Sky News:How Claudia devastated PortugalUK suffers flooding as storm hits  An amber warning means the weather is likely to cause \"significant impacts across health and social care services\" including an increase in demand for health services; temperatures inside places like hospitals, care homes and clinics dropping below the levels recommended for assessing health risks; and a rise in deaths, particularly among those aged 65 and over or with health conditions. The British Heart Foundation (BHF) has warned people with heart conditions to take extra care. Ruth Goss, senior cardiac nurse at the foundation, said cold temperatures can \"increase the risk of heart attacks and strokes, and people with cardiovascular disease are also more at risk of serious illness if they get seasonal respiratory infections like flu\". She advised anyone with such a condition to wrap up warm and have their free flu jab."
    },
    {
        "title": "How a grassy Oxfordshire field became an illegal mountain of waste in just months",
        "description": "Satellite images reveal how a grassy field in Oxfordshire was transformed into an illegal waste site in just a few months. ",
        "url": "https://news.sky.com/story/how-a-grassy-oxfordshire-field-became-an-illegal-mountain-of-waste-in-just-months-13471715",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-data-forensics_7084211.jpg?20251117155154",
        "type": "UK",
        "Author": "Adam Parker, OSINT editor and Rachael Venables, correspondent",
        "Date Published": "2025-11-17 14:56:00",
        "Headline": "Hidden in plain sight - Sky News is investigating the boom in waste crime in the UK, a lucrative trade dubbed ‘the new narcotics’. ",
        "Content": "By Adam Parker, OSINT editor and Rachael Venables, correspondent   Satellite images reveal how a grassy field in Oxfordshire was transformed into an illegal waste site in just a few months.  The site is next to the A34, a busy road running through cities including Oxford and Birmingham. The land is just over three acres in size and is largely hidden by trees on all sides. The River Cherwell runs along its west side. A satellite image from the end of March this year shows the site largely covered in grass. By 13 June, it has completely transformed. The grass is replaced by dirt, and an excavator is caught in a satellite image. On 17 August, the site remains largely unchanged apart from what appears to be a single lorry load of rubbish. Five weeks later on 22 September, a 150-metre long and 15-metre wide area is piled with waste. Use the slider below to see how much the site has changed. \n                  Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'\n                 \n                  Why women are being forced to go abroad to help heal from a lifetime of trauma\n                 \n                  Weather latest: Amber cold health alert now issued for parts of UK until Saturday\n                 Drone footage filmed by Sky News shows that the waste dump is at least 10 metres high. It would have taken tens of lorry loads to pile up this much waste in so little time. News correspondent You can’t see the waste from the dual-carriageway, but across a fence, and just past the rushing River Cherwell - a mountain of rubbish rises above you. \n It’s an undulating, continuous stream of shredded waste. When the wind is right the smell makes you gag. People who’ve gotten closer than us to the rubbish say the waste even feels warm in places, sparking fears it’s already decomposing - with a growing risk of fires starting underneath. There’s no way of knowing what the rubbish is made up off - but there’s clearly a huge amount of plastic in these mounds. The working assumption is a mixture of building and household waste. At the edges I spot an old DVD churned in the mud, tooth floss and AA batteries. We don’t yet know what sort of chemicals might also be in the mix, which risk leeching into the surrounding environment and water.  The illegal dump is staggering in its size; and there's a brazenness in the way this has been left here. Metres from a busy road, but hidden by trees - it’s the perfect location to hide a crime that’s costing us so much every year; from financial to environmental damage. Yet the authorities always seem to be scrambling to play catch up with the criminals. Calum Miller, Liberal Democrat MP for Bicester and Woodstock, told Sky News it was the first time he had seen anything on this scale, questioning whether the Environmental Agency had the resources to deal with it. He said it's the work of an organised crime group. The cost of removing the waste is estimated to be more than the entire annual budget of the local council, which is around £25m.  With the site on a floodplain, Mr Miller listed what he saw as the three major environmental risks - waste being washed into the waterways, rain seeping through the waste and carrying toxins into the water and the danger of decomposing chemicals presenting a fire risk. He said the police had used a helicopter with a heat-seeking camera and could see that some of the waste was indeed starting to decompose. Sky News has been investigating how, across the country, waste crime is a growing scourge and a booming business being exploited by criminal gangs.  Being paid to remove rubbish only to dump it illegally without sorting it or paying tax is an easy way of making huge amounts of money, with poorly enforced legal repercussions and a huge cost to the environment.  It's something the previous head of the Environment Agency called \"the new narcotics\". - It's thought a fifth of all waste in England is being illegally managed - That's around 34 million tonnes a year, enough to fill about four million skips - It costs the economy around a billion pounds a year, with legitimate operators thought to be losing a further £3bn from missed business In July,  we tracked down a group of suspected organised fly-tippers who waved wads of cash on TikTok after dumping waste in the countryside.\n The Environment Agency told Sky News, \"This is a sickening case of large-scale illegal waste dumping and we share the public's disgust.\" A spokesperson said: \"we took immediate action - issuing a cease and desist order in July. When the risk of further dumping emerged we subsequently secured a court order to close the site to prevent more waste from being illegally tipped. \"We have launched a major investigation and are working closely with the police and other partners to find those responsible and bring them to justice.\" Dr Amani Maalouf, a senior waste management researcher at the University of Oxford, told Sky News that the site is a \"significant environment incident\". \"Once mixed waste interacts with a watercourse, microplastics, packaging residues, and other contaminants can disperse widely and persist in the environment,\" she said. If you have been affected by fly-tipping, email news@skynews.com or send us a message on Whatsapp The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "HMS Prince of Wales is ready for war and available to allies - 'if NATO provides escorts'",
        "description": "The UK's flagship aircraft carrier is ready for war after deploying across the world in a demonstration to Vladimir Putin of NATO's \"hard power\", the defence secretary has said.",
        "url": "https://news.sky.com/story/hms-prince-of-wales-is-ready-for-war-and-available-to-allies-if-nato-provides-escorts-13471752",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-royal-navy-hms-prince-of-wales_7084263.jpg?20251117165156",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-17 16:15:00",
        "Headline": "John Healey said the UK's flagship aircraft carrier is ready to mobilise within five to 10 days' notice in a crisis, but sources tell Sky News it will need assistance from allies.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK's flagship aircraft carrier is ready for war after deploying across the world in a demonstration to Vladimir Putin of NATO's \"hard power\", the defence secretary has said. John Healey said HMS Prince of Wales, armed with F-35 stealth jets and defended by a group of British and other allied warships, is on five to 10 days' notice to mobilise in a crisis. He also said that Britain was making the carrier available to be used in NATO operations. However, defence sources pointed out that the UK can only deploy the £3.1bn vessel - the Royal Navy's largest and most expensive class of ship - with help from allies because it lacks enough British warships, support vessels, stores and sailors to be able to assemble a carrier strike group solo. One source put it to Sky News, in other words, that the strike group \"can only support NATO if NATO provides escorts!\" \"It doesn't come as a complete organic UK-only package - like the US could - not without turning off other UK commitments,\" they added. In a demonstration of its capabilities, the defence secretary said F-35B warplanes conducted 36 sorties from the deck of the 65,000-tonne carrier within a 24-hour period on Friday in the Mediterranean. \n                  Trump's sanctions are no slap on the wrist - they're a punch to the gut of Moscow's war economy \n                 \n                  US defence secretary Pete Hegseth's jet makes unscheduled landing in UK after in-air issue\n                 \n                  Russia's clear warning that it can easily chip away at Europe's defences\n                 He said this was the highest rate of sorties by a British aircraft carrier since the Falklands War in 1982. Read more from Deborah Haynes:UK tests response to discovery of deadly biological toxin'Shamima Begum should be repatriated', review says Aircraft carrier 'sends a message to Putin' Mr Healey was speaking as he visited the warship off the coast of Naples on Monday, where he declared that the carrier was fully operational. \"This today sends a message to Putin and any would-be adversaries,\" he said. \"The UK and the 20 nations that have been part of the carrier strike group over the last eight months, we are ready together to stand up and reinforce global security and global deterrence.\" HMS Prince of Wales joins HMS Queen Elizabeth, the navy's other carrier, as being declared ready for operations. It means, provided there are no problems with maintenance or repairs, one of them can be on standby to deploy on an operation while the other is being serviced. With a crew of 800, the Prince of Wales carrier left Portsmouth in April on a deployment to the other side of the world that tested three of the UK's main threats. It also had hundreds of additional personnel on board to support the airwing of jets and helicopters. The warship, accompanied by a Royal Navy destroyer and a frigate as well as a Norwegian vessel, initially travelled through the Red Sea - a moment of high tension because of the threat from Iranian-backed Houthi militants in Yemen. It also passed about 200 miles from the coast of Russia during a visit to Japan. In addition, the carrier strike group passed through the South China Sea, along with HMS Richmond, the Royal Navy frigate, transiting the Taiwan Strait - a move that can be seen as provocative by China. China, Russia and Iran will doubtless have tracked the movement of the carrier, though it did not encounter any direct challenges. Read more from Sky News:How hidden card service could save you hundredsAmber cold health alert issued for parts of UK Commander: Carrier group 'absolutely' ready for war A total of 20 ships from 10 nations operated with HMS Prince of Wales during nearly eight months at sea. The F-35 jets carried out more than 1,000 sorties during this time. Commodore James Blackmore, commander of the carrier strike group, said that his ships and jets were \"absolutely\" ready for war. \"We have returned to the Mediterranean and the Euro-Atlantic stronger than we departed for NATO, having declared full operating capability,\" the commander told Sky News. \"We have two aircraft carriers so that we always have one available. I am really, really confident on everything I've seen from the last eight months that this carrier strike group is ready.\" The programme to procure two carriers was first agreed in 1998, but delays in the delivery are why they are both only finally operational now."
    },
    {
        "title": "School ban put us in 'ridiculous position', says father in WhatsApp row after police admit unlawful arrest ",
        "description": "A mum and dad who were detained by police after complaining about their daughter's school on WhatsApp, have said they feel 'vindicated' after the force agreed to pay them &#163;20,000 in compensation.",
        "url": "https://news.sky.com/story/school-ban-put-us-in-ridiculous-position-says-father-in-whatsapp-row-after-police-admit-unlawful-arrest-13471559",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-family-children_7084265.jpg?20251117165450",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-17 08:49:00",
        "Headline": "Maxie Allen, 50, and Rosalind Levine, 47, from Borehamwood, were detained in January by Hertfordshire Police and held in a police cell for eight hours following the dispute. ",
        "Content": "A mum and dad who were detained by police after complaining about their daughter's school on WhatsApp, have said they feel 'vindicated' after the force agreed to pay them £20,000 in compensation. Maxie Allen, 50, and Rosalind Levine, 47, of Borehamwood, Hertfordshire, were detained in January by Hertfordshire Police and held in a police cell for eight hours following the dispute. They were questioned on suspicion of harassment, malicious communications and causing a nuisance on school property, with the case leading to a national debate about police overreach. The row with the school started after Mr Allen complained about the recruitment process for a new head teacher. The school then contacted police, which led to the arrests, after it objected to the parents sending several emails and criticising staff on a private parents' WhatsApp group. The school claimed the couple were making \"disparaging and inflammatory\" remarks. They were also blocked from attending parents' evening and banned from entering the premises. Hertfordshire Constabulary originally defended the arrest, but after a five-week investigation has now agreed to pay out £10,000 each to Mr Allen and Ms Levine. The force said the amount was \"significantly above that required by the case law and reflects the constabulary's desire to bring matters to a conclusion\". After officers arrested the couple in front of their other daughter, aged three, their home was searched. CCTV footage shared widely online showed six uniformed officers approach the home before leading the couple away. Commenting on the admission of wrongful arrest, Mr Allen told Sky News the decision was a \"relief\". He added it was a \"vindication\" and gives them the chance to get some closure. The force admitted the legal criteria for arrest were \"not made out\" and formally accepted liability for wrongful arrest and detention. It maintained that it was the right decision to investigate, due to a large number of emails and negative WhatsApp messages sent by Mr Allen and Ms Levine to Cowley Hill Primary School, which their daughter, Sascha, 10, attended. Read more from Sky News:Home secretary threatens visa ban on three countriesJansen ready for take-off as next chairman of Heathrow Airport The couple had taken Sascha out of school five days before they were arrested, Mr Allen added. He said: \"We'd given in and walked away, and then five days later the police turned up.\" Sascha suffers from epilepsy and is neurodivergent, but the couple said in March they were not allowed to meet teachers to discuss her medical conditions. Mr Allen told Sky News on Monday the ban meant they couldn't have any \"normal contact with anybody at the school\". He said: \"We weren't allowed to call. We weren't allowed to go on the school site. We weren't allowed to have meetings, or a Zoom. We had to kind of navigate our own way through the education and care of our daughter, who has a disability.\" He said the ban put them in an \"impossible position where we couldn't have any more contact with our daughter's school,\" adding that they could only email. They also used email to go through the formal complaints process, he said, due to the ban. Mr Allen added that his daughter is now at a different school, where she is happy. He said: \"I stand by the view that trying to stick up for your daughter's education, health and welfare, being able to speak your mind freely about how an organisation is being run, and having the right to have private conversations does not justify six police officers turning up at our house.\" In April, Andy Prophet, chief constable of Hertfordshire, defended the arrests, but added that \"with the benefit of hindsight we could have achieved the same ends in a different way\". He said that the inspector who had approved them did not believe the couple would consent to a voluntary interview and also had to preserve electronic devices. However, Hertfordshire Constabulary's lawyers this month admitted that the criteria for arrest under the Police and Criminal Evidence Act were not made out, \"rendering the arrest unlawful\". A spokesperson for Hertfordshire Constabulary told Sky News on Monday: \"Whilst there are no issues of misconduct involving any officer in relation to this matter, Hertfordshire Constabulary has accepted liability solely on the basis that the legal test around necessity of arrest was not met in this instance. \"Therefore, Mr Allen and Ms Levine were wrongfully arrested and detained in January 2025. It would be inappropriate to make further comment at this stage.\" A spokesperson for Cowley Hill Primary School said: \"As previously stated in March 2025 we contacted the police following a very high volume of direct email correspondence and what we considered upsetting and derogatory social media posts, on Facebook and WhatsApp, from two parents. \"As a school, we welcome dialogue with parents, however the nature and large volume of the communication and public posts meant that the school were no longer able to manage using normal internal procedures. As a result we sought advice from the police. \"Cowley Hill School continues to put its focus on providing an excellent education for its pupils and will not be commenting any further on this matter.\""
    },
    {
        "title": "Investigation launched after man dies on North Sea drilling rig",
        "description": "An investigation has been launched into the death of an offshore worker on a drilling rig in the North Sea.",
        "url": "https://news.sky.com/story/investigation-launched-after-man-dies-on-north-sea-drilling-rig-13471772",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lee-hulse-scotland_7084306.jpg?20251117172704",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-17 16:38:00",
        "Headline": "Lee Hulse, 32, died while working on the Valaris 121 oil platform off the coast of Aberdeen.",
        "Content": "An investigation has been launched into the death of an offshore worker on a drilling rig in the North Sea. Lee Hulse, 32, died while working on the Valaris 121 oil platform off the coast of Aberdeen. Police Scotland were called to a report of a death around 4:40am on Friday. \"The death is not being treated as suspicious,\" a spokesperson for the force said. \"The Health and Safety Executive has been informed and a report has been submitted to the Procurator Fiscal.\" A spokesperson for Scotland's Health and Safety Executive (HSE) said: \"We are aware of the incident and will be investigating alongside Police Scotland.\" Local media said Mr Hulse died after falling from a crane. A GoFundMe campaign to give Mr Hulse \"the send off he deserves\" had raised nearly £15,000 by Monday night. \"Tragically and very suddenly Lee has lost his life,\" the organiser of the fundraiser said. \"Leaving behind his family that loved him the most. \"No family partner or friends are ever prepared for this type of loss. \"Lee always looked after his family and all his friends, so this is our turn to make sure we look after him and give him the best send-off that he deserves and make sure his daughter is well looked after.\" A spokesperson for Valaris told local media: \"Valaris regrets to inform that a crew member onboard its Valaris 121 jack up drilling rig has sadly died as a result of an incident in the early hours of Friday November 14. \"Their next of kin has been informed and Valaris is offering support to them at this difficult time. \"All remaining personnel onboard the V121 at the time of the incident have been safely accounted for.\" It said operations on the Valaris 121 had been temporarily halted."
    },
    {
        "title": "'It does save people's lives': Bleed kits rolled out across Sheffield schools after push from knife safety campaigners",
        "description": "Bleed kits, commonly used by paramedics and in hostile environments like war zones, are being distributed across schools in Sheffield today.&#160;",
        "url": "https://news.sky.com/story/it-does-save-peoples-lives-bleed-kits-rolled-out-across-sheffield-schools-after-push-from-knife-safety-campaigners-13471728",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bleed-kit-sheffield_7084207.jpg?20251117154545",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-11-17 15:19:00",
        "Headline": "Campaigners, including the parents of murdered Sheffield schoolboy Harvey Willgoose, believe the \"affordable\" kits should be introduced to all UK schools to \"save\" lives.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  Bleed kits, commonly used by paramedics and in hostile environments like war zones, are being distributed across schools in Sheffield today.  Essentially an advanced first-aid kit, the lightweight packs contain items like a tourniquet and trauma bandages. Knife safety campaigners, including the parents of murdered Sheffield schoolboy Harvey Willgoose, believe the \"affordable\" kits should be introduced to all UK schools to \"save\" lives. \"We don't know the answer to if there had been one in place [at Harvey's school] whether that would have saved Harvey,\" his mother Caroline Willgoose told Sky News' Katerina Vittozzi, \"but it's affordable and it does save people's lives.\" Harvey, who was 15 when he was killed, was stabbed by a fellow pupil at All Saints Catholic High School in February this year. Mohammed Umar Khan, also 15, had brought a 13cm hunting knife into school with him that day. He was found guilty of Harvey's murder and sentenced to a minimum of 16 years in prison following a trial at Sheffield Crown Court.  The Willgoose family, along with other knife safety campaigners, gathered at Hind House School in Sheffield on Monday to present a bleed kit to staff and pupils. Harvey's school have also agreed to have a bleed kit on site. \"I think people know that there is a problem with knives now,\" Mrs Willgoose adds, \"and it's been more and more, and parents are wanting knife arches and bleed kits in schools.\" Although it is not within official Department of Education guidance to have a bleed kit on school grounds, and a fatal stabbing on school grounds is rare, Hind House headteacher Daniel Cross told Sky News that \"we absolutely have to be on board with it\" if the kits can \"help save a child's life.\" \"Harvey's tragic death is something that had echoes of sadness across the city,\" he added, \"and if his legacy can save one child's life... then it's a legacy well lived, really, and we're really proud to be part of that movement.\" Both staff and some students at this school will be given first-aid training on how to use the bleed kit, which also advises anyone who needs to use it to call 999 where an operator will talk them through its use. Pupil Harry Billard, 14, said that \"some people are stupid enough to make the dumb decision to bring a knife into school, and if someone did get stabbed, then that bleed kit could potentially save their life.\" Read more from Sky News:Amber cold health alert now issued for parts of UK until SaturdayBBC 'determined to fight' any Trump legal action, chairman tells staff Fellow student Hellen Ngoako, 12, said she felt \"a bit nervous\" when she first heard that her school was getting a bleed kit. \"Obviously, it's really big,\" she added, \"people are bringing knives into school.\" She believes that \"Harvey's story has spread awareness around Sheffield about what could happen in schools\" - but that having the bleed kit \"makes me feel safe\"."
    },
    {
        "title": "Birmingham bin strikes to continue for months, union warns, as industrial dispute deepens",
        "description": "Rubbish will continue rotting in the streets of Birmingham for months, union chiefs have warned, after more workers voted to join industrial action.",
        "url": "https://news.sky.com/story/birmingham-bin-strikes-to-continue-for-months-union-warns-as-industrial-dispute-deepens-13471725",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-birmingham-bin-strikes_7019897.jpg?20251117151718",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-17 15:13:00",
        "Headline": "Workers have been locked in a standoff with the city council for most of the year.",
        "Content": "Rubbish will continue rotting in the streets of Birmingham for months, union chiefs have warned, after more workers voted to join industrial action. Agency workers employed by Job&Talent are now joining the dispute for the first time, with the Unite union blaming \"an epidemic of bullying, harassment and intimidation\". And with workers voting to extend the already months-long strike, the union says bins could go uncollected beyond next year's local elections in May. It comes after footage obtained by Sky News captured a manager from Job&Talent warning agency staff that those who join the strike would be blacklisted by the council. In the clip, he says: \"Those people that do decide to join the picket line, then the council have confirmed to us that they are not going to get a permanent job.\" Unite general secretary Sharon Graham added: \"This is a real escalation in the dispute with agency workers now joining picket lines due to the terrible way they have been treated by Job&Talent and Birmingham council. \"The council is spending a fortune it doesn't have on a dispute that could easily be resolved by agreeing a fair deal for workers. \n                  Family of Katie Fox, who was fatally stabbed in neck in Birmingham, pay tribute to her\n                 \n                  Woman, 34, has died after being stabbed in the neck in Birmingham\n                 \n                  Djeison Rafael: Man charged with attempted murder after woman stabbed in the neck in centre of Birmingham\n                 \"Unite does what it says on the trade union tin; we are totally committed to fighting for the jobs, pay and conditions of all members. \"Agency and directly-employed workers alike in Birmingham council's refuse service have the union's complete and utter support.\" A spokesperson for Birmingham City Council said: \"While we are disappointed the dispute has not been resolved as Unite has rejected all our offers, we are continuing to make regular waste collections and our contingency plan is working. \"We have been collecting an average of approximately 1,330 tonnes of kerbside waste every day, more than we did prior to industrial action, and over the last six months we have collected over 100,000 tonnes of kerbside waste. \"There has been a 22 per cent increase in tonnage of waste collected per employee and a 52 per cent improvement regarding missed collections. \"A small number of agency staff are in a separate dispute with Job&Talent. The city council has contingency plans and will continue to look to maintain residents with a minimum of one collection a week. \"Meanwhile we continue to move forward with the service improvements that are long overdue and that our residents need.\" The council also said it would not tolerate blacklisting, and had investigated the matter, but concluded no blacklisting had taken place. In a statement last week, Job&Talent responded to the leaked footage. Read more:No end in sight for bin strike after six monthsBirmingham bin strikes: How residents are taking action The statement read: \"Job&Talent is aware of a short video clip circulating online which shows a Job&Talent manager speaking to agency workers at one of the city's refuse depots. \"The comments made in the recording were part of a longer discussion and do not reflect the position of Job&Talent. \"We do not engage in or condone any form of blacklisting, and no worker is or would be denied employment opportunities on the basis of lawful participation in industrial action.\" Unite said Job&Talent workers would be able to join the picket line from 1 December. Bin workers have been locked in a standoff with the council over proposed pay cuts for most of the year. Union bosses say council plans will leave 171 workers £8,000 worse off a year. Collections have been disrupted since January, but the row descended into an all-out strike in March. The council soon declared a major incident and rubbish has continued to pile up across the city as the dispute continues. Unite claims there have been no formal negotiations over ending the dispute since May. The union's lead officer, Onay Kasab, said: \"Residents of Birmingham will be rightly concerned to see that the misery of bin strikes can continue through Christmas, New Year and beyond May's local elections but the council is solely responsible for the ongoing dispute. \"Unite remains fully committed to return to meaningful negotiations to secure a fair deal for affected workers while also ensuring the endemic bullying culture and threats of blacklisting are stamped out.\" In a statement, Job&Talent said: \"We acknowledge the ballot outcome and will continue working closely with our workers to address any concerns. \"The result reflects only a small portion of our overall workforce. \"As addressed previously, Job&Talent remains firmly committed to operating with transparency, integrity, and full compliance with employment laws.\""
    },
    {
        "title": "Reform council repaints road markings for school which closed in 2016",
        "description": "A Reform UK-run council has been criticised for wasting money after repainting road markings outside a school which closed nine years ago.",
        "url": "https://news.sky.com/story/reform-council-repaints-road-markings-for-school-which-closed-in-2016-13471668",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reform-council-kent-county-council_7084077.jpg?20251117131509",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-17 13:06:00",
        "Headline": "Kent County Council sold the disused school site to a government agency in March, but has repainted yellow zigzags and \"School Keep Clear\" warnings.",
        "Content": "A Reform UK-run council has been criticised for wasting money after repainting road markings outside a school which closed nine years ago. Kent County Council (KCC) has apologised and admitted it made an \"error\" after repainting yellow zigzags and \"School Keep Clear\" warnings outside the former site of Halfway Houses Primary School in Sheerness. The school moved to another location in October 2016. The council sold the disused school buildings and grounds to government agency Homes England in March. KCC is one of the local authorities won by Reform in local elections earlier this year and is seen as a key test of the party's governing ability. Mike Whiting, an independent councillor for Swale Borough Council, described the road repainting as \"a farce\". He wrote on Facebook: \"What on earth is going on at cash-strapped Kent County Council? \"Rather than saving money, they have just repainted the yellow 'School Keep Clear' lines in Southdown Road, Halfway, almost 10 years after the school closed. \"How many times are we told there's not enough money for really important projects, yet they waste money like this, painting irrelevant signs, both sides of the road.\" Peter Osborne, cabinet member for highways and transport for KCC, said: \"The repainting of the 'School Keep Clear' markings on Southdown Road was carried out in error, and we're sorry for any confusion this may have caused.\" He said the cost of painting the lines was £350. \"We take our financial responsibilities seriously to ensure public money is spent carefully and mistakes like these are exceedingly rare,\" he added. Read more from Sky News:Amber cold health alert issued for parts of UKFootage shows mountain of waste dumped next to river  Last month, Reform suspended four of its councillors in Kent \"following evidence that they brought the party into disrepute\". It comes after a video was leaked to The Guardian in which councillors at the local authority were seen arguing over decision-making relating to the council's finances."
    },
    {
        "title": "UN Security Council backs Trump peace plan for Gaza",
        "description": "The United Nations Security Council has passed a US resolution which endorses Donald Trump's peace plan for Gaza.",
        "url": "https://news.sky.com/story/un-security-council-backs-trump-peace-plan-for-gaza-13471971",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-city-israel-gaza_7084606.jpg?20251117230541",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-17 22:20:00",
        "Headline": "US ambassador Mike Waltz said the resolution - calling for a yet-to-be-established Board of Peace as a transitional authority in Gaza - was \"historic and constructive\" but was \"just the beginning\".",
        "Content": "The United Nations Security Council has passed a US resolution which endorses Donald Trump's peace plan for Gaza. Russia, which had circulated a rival resolution, abstained along with China on the 13-0 vote. The resolution endorses the US president's 20-point ceasefire plan, which calls for a yet-to-be-established Board of Peace as a transitional authority that Mr Trump would head. Read more: What does Trump's Gaza peace plan look like? US ambassador Mike Waltz said the resolution was \"historic and constructive\", but it was \"just the beginning\". \"Today's resolution represents another significant step towards a stable Gaza that will be able to prosper and an environment that will allow Israel to live in security,\" he added. The proposal gives no timeline or guarantee for an independent Palestinian state, only saying \"the conditions may finally be in place\" after advances in the reconstruction of Gaza and reforms of the Palestinian Authority - now governing parts of the West Bank. It also says that the US \"will establish a dialogue between Israel and the Palestinians to agree on a political horizon for peaceful and prosperous co-existence\". The language on statehood was strengthened after Arab nations and Palestinians pressured the US over nearly two weeks of negotiations, but it has also angered Israeli Prime Minister Benjamin Netanyahu. He has vowed to oppose any attempt to establish a Palestinian state, and on Sunday pledged to demilitarise Gaza \"the easy way or the hard way\".  Hamas: International force is 'in favour of' Israel In a statement rejecting the resolution's passing, a Hamas spokesperson said it \"falls far short of the political and humanitarian demands and rights of our Palestinian people\". \"The effects and repercussions of this war continue to this day, despite the declared end of the war according to President Trump's plan,\" they added. \"The resolution imposes an international trusteeship mechanism on the Gaza Strip, which our people, their forces, and factions reject.\" The spokesperson then said that \"assigning the international force with tasks and roles inside the Gaza Strip, including disarming the resistance, strips it of its neutrality, and turns it into a party to the conflict in favour of the occupation\". Read more:Trump asks Israeli president to 'fully pardon' NetanyahuInside Jordan warehouse holding Gaza aid 'refused entry by Israel' The Palestinian Authority, however, issued a statement welcoming the resolution and said it is ready to take part in its implementation."
    },
    {
        "title": "Former Bangladesh PM Sheikh Hasina sentenced to death after lethal crackdown on uprising",
        "description": "Bangladesh's ousted prime minister Sheikh Hasina has been sentenced to death.",
        "url": "https://news.sky.com/story/former-bangladesh-pm-sheikh-hasina-sentenced-to-death-after-hundreds-killed-in-crackdown-13471521",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sheikh-hasina-bangladesh_7083797.jpg?20251117161830",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-17 08:01:00",
        "Headline": "Exiled in India, the former leader was tried in absentia after the United Nations said up to 1,400 people may have been killed in a deadly clampdown on a student-led uprising.",
        "Content": " Bangladesh's ousted prime minister Sheikh Hasina has been sentenced to death. It comes after the 78-year-old was found guilty of ordering lethal force in a crackdown on a student-led uprising that ended her 15-year rule. The former leader, who is now exiled in India, was tried in absentia by the Dhaka-based International Crimes Tribunal (ICT) after the United Nations said up to 1,400 people may have been killed in last year's violence. Bangladesh's health adviser in the interim government said more than 800 people were killed and about 14,000 were injured. Following a months-long trial, Hasina got a life sentence under charges for crimes against humanity and the death sentence for the killing of several people during the uprising. Ruling 'biased and politically motivated' In a statement released after the verdict, Hasina said the ruling was \"biased and politically motivated\" and \"neither I nor other political leaders ordered the killing of protesters\". \"I am not afraid to face my accusers in a proper tribunal where evidence can be weighed and tested fairly,\" she added. \"I wholly deny the accusations that have been made against me in the ICT. I mourn all of the deaths that occurred in July and August of last year, on both sides of the political divide. But neither I nor other political leaders ordered the killing of protesters.\" She also said: \"Despite their lurid claims, the ICT's prosecutors produced no persuasive evidence to show that I ordered the use of lethal force against the people.\" The students initially started protesting over the way government jobs were being allocated, but clashes with police and pro-government activists quickly escalated into violence.  The court revealed conversations of Hasina directing security officers to drop bombs from helicopters on the protesters. But speaking to Sky News, her son Sajeeb Wazed Joy said the tape was taken out of context. He told The World with Yalda Hakim: \"This claim of her issuing an order was based on a short clip of a recording, which the full clip was never played. \"We have put the full clip online where she is ordering the arrest of violent protesters, she is expressing concern for the lives of civilians.\" He said he was unsurprised by the outcome of the trial. \"It was very much expected,\" he said. \"The trials were rushed... a trial of such significance was completed within about 100 days which is unprecedented in Bangladesh. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 \"In order to expedite the trials the government had to amend the laws to enable the trial in this court, however there is no parliament and only parliament can amend laws, so that in itself was illegal. \"And not to mention that this regime itself is unelected, illegal, undemocratic... none of this has a legal basis. \"But the worst part is they would not allow my mother to appoint her own defence lawyers. They were not allowed into the court at all, and she was represented by a public defender assigned by the regime, so it's a mockery.\" He also cast doubts on the death toll of 1,400 attributed to the July Massacre by the Office of the United Nations High Commissioner for Human Rights, and demanded justice for the police and party activists killed in the unrest. The court was told that Hasina permitted the use of lethal weapons, including shotguns at close range for maximum harm. She had previously called the tribunal a \"kangaroo court\" and fled to India in August 2024 at the height of the uprising. She is the daughter of Sheikh Mujibur Rahman, who led the country to independence. Read more from Sky News:Hundreds of tonnes of 'revolting' waste dumped next to riverArctic air to bring risk of ice and snow to the UK this week Hasina is also the aunt of former UK government minister, Tulip Saddiq, who resigned from her Treasury job at the start of this year. Ms Siddiq had faced calls to step down over links to her aunt and was also said to be facing a corruption trial in Bangladesh. She told Sky News in August the accusations were \"nothing more than a farce\" and said she had never been contacted by the Bangladeshi authorities. The ICT, Bangladesh's domestic war crimes court located in the capital, delivered its four-hour verdict on Monday amid tight security.  The packed courtroom cheered and clapped when the sentence was read out. The tribunal also sentenced former home minister Asaduzzaman Khan - also exiled in India - to death. A third suspect, a former police chief, was sentenced to five years in prison as he became a state witness against Hasina and pleaded guilty. The ruling is the most dramatic legal action against a former Bangladeshi leader since independence and comes ahead of parliamentary elections expected to be held in February.  Foreign ministry officials in Bangladesh have called on India to hand over the former prime minister, adding it was obligated to do so under an existing treaty between the two nations. India's foreign ministry said it had noted the verdict concerning Hasina and \"remained committed\" to the people of Bangladesh. \"We will always engage constructively with all stakeholders to that end,\" the ministry added in a statement. During the verdict, protesters had gathered outside the former home-turned-museum of Hasina's late father demanding the building be demolished. Police used batons and stun grenades to disperse the crowd. Paramilitary border guards and police have been deployed in Dhaka and many other parts of the country, while the interim government warned any attempt to create disorder will be \"strictly\" dealt with. Hasina's Awami League party called for a nationwide shutdown in protest at the verdict. The mood in the country had been described as tense ahead of Monday's ruling. At least 30 crude bomb explosions and 26 vehicles were set on fire across Bangladesh during the past few days. Local media said two people were killed in the arson attacks, according to the Associated Press."
    },
    {
        "title": "Report claims almost 100 Palestinian prisoners have died in Israeli jails since October 2023",
        "description": "Nearly a hundred Palestinian prisoners have died in custody since the start of the war in Gaza, according to a human rights group that claims prisoners are being denied medical care and are the victims of systematic and brutal violence.",
        "url": "https://news.sky.com/story/report-claims-almost-100-palestinian-prisoners-have-died-in-israeli-jails-since-october-2023-13471875",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-israel-palestine-prison_7084473.jpg?20251117202640",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-17 20:14:00",
        "Headline": "The highest number of deaths are alleged to have happened at the Sde Teiman detention centre.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n Nearly a hundred Palestinian prisoners have died in custody since the start of the war in Gaza, according to a human rights group that claims prisoners are being denied medical care and are the victims of systematic and brutal violence. The report, from Physicians for Human Rights - Israel (PHRI), tracked deaths due to a variety of causes, including violence, malnutrition and untreated injuries. Its data came partly from Israeli authorities, and also from lawyers, relatives and witnesses. The report says that at least 98 Palestinian prisoners have died over the past two years. However, the PHRI adds that the figure is likely to be a significant underestimate, citing claims of \"enforced disappearances\" and allegations of prisoners being shot shortly after they were released from detention.  In one case, the report claims that a prisoner died because the insulin, which they needed to treat diabetes, was withheld. The report claims that just under half of these deaths - 46 - occurred in the Israeli prison service while the remaining 52 deaths involved people being held in military facilities. The highest number of fatalities are alleged to have happened at the Sde Teiman detention centre, a facility located in the Negev Desert and notorious for its brutality. It has recently become the focus of huge attention after Israel's chief military advocate, Yifat Tomer-Yerushalmi, admitted leaking a video that appears to show a Palestinian prisoner being severely beaten in Sde Teiman. Tomer-Yerushalmi is now under house arrest while the leak is investigated. Critics of the Israeli justice system say that her arrest contrasts with the reluctance of authorities to investigate the original, and widespread, allegations of violence carried out on prisoners in the Sde Teiman centre. The report's allegations come at a time when questions of crime and punishment are receiving plenty of attention. Itamar Ben-Gvir, the minister responsible for national security, has demanded even harsher conditions, visited jails to taunt prisoners and also called for the death penalty to be introduced for anyone convicted of terrorism. The Israeli military told us \"individuals in Gaza are detained when there is reasonable suspicion of their involvement in terrorist activities…and [if deemed necessary] are detained in designated facilities within Israeli territory\". Read more:Trump asks for pardon for Netanyahu in corruption trialFreed prisoner alleges torture and deaths in Israeli detention The PHRI report concludes that there is \"little doubt that the deaths of many detained Palestinians were the result of systematic actions by soldiers and prison guards, carried out with the encouragement, or at the very least the tacit approval, of their superiors\". It further alleges that \"the sharp rise in the number of Palestinians who have died in Israeli incarceration facilities since October 7, 2023, compared to previous years, demonstrates that the killing of Palestinians in custody has become an additional instrument of state against Palestinians oppression since the onset of the war\". Israel's prison service insists it operates within the confines of the law. The Israeli military said its rules around detention are \"in full alignment with Israeli law and the Geneva Conventions\". Its statement continued: \"The IDF is aware of incidents of deaths of detainees, including detainees who were detained with a pre-existing illness or injury as a result of the hostilities. As per standard protocol, an investigation is conducted for each death of a detainee by the military police. \"According to the law, every detainee held under a detention order is subject to judicial review. Every detainee has the right to be represented by a lawyer.\""
    },
    {
        "title": "Gunmen abduct 25 schoolgirls from boarding school",
        "description": "Gunmen have abducted 25 girls from a boarding school in northwestern Nigeria, according to police. ",
        "url": "https://news.sky.com/story/armed-men-abduct-25-schoolgirls-in-nigerias-northern-kebbi-state-13471667",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nigeria-stock-nigeria_7084208.jpg?20251117155029",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-17 13:08:00",
        "Headline": "Armed groups in Nigeria have been targeting schoolchildren for more than a decade, but there has been an uptick in attacks this year.  ",
        "Content": "Gunmen have abducted 25 girls from a boarding school in northwestern Nigeria, according to police.  The attack took place at 4am on Monday local time (3am UK time), leaving one staff member dead and another injured. Police spokesperson Nafi'u Abubakar Kotarkoshi said the assailants were armed with \"sophisticated weapons\" and exchanged fire with guards before abducting the girls. He said teams were searching suspected escape routes and surrounding forests to find the abducted students and perpetrators. The boarding school is in Maga, in Kebbi state's Danko-Wasagu area. No group has claimed responsibility for the abductions. Previous attacks \n                  Donald Trump warns Nigeria that US troops or airstrikes 'could be' used to prevent killing of Christians\n                 \n                  Nigeria responds to Donald Trump's threat of military action due to 'slaughter' of Christians\n                 \n                  Kemi Badenoch says she no longer identifies as Nigerian\n                 The incident is the latest school abduction in Nigeria's northern region, where armed groups have been targeting schoolchildren for more than a decade. But there has been an uptick in attacks by different armed groups in northern Nigeria this year. Read more on Sky News:British hacker ordered to pay back over £4m in BitcoinUS aircraft carrier nears Venezuela  The most infamous case was in 2014 when militant group Boko Haram abducted 276 students from a secondary school in Chibok. Many remain missing. Sometimes children are released by their abductors or rescued by authorities. Last year, authorities managed to rescue 137 hostages more than two weeks after they were taken. Yet even in this case, more than half of those taken were presumed to still be held by the captors."
    },
    {
        "title": "Zelenskyy to buy 100 fighter jets from France in bid to create 'one of the greatest' air defences in the world",
        "description": "Ukrainian President Volodymyr Zelenskyy has signed a letter of intent with France to obtain 100 Rafale fighter jets as he seeks to bolster the country's long-term air defence capacity against Russia.",
        "url": "https://news.sky.com/story/zelenskyy-to-buy-100-fighter-jets-from-france-in-bid-to-create-one-of-the-greatest-air-defences-in-the-world-13471659",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-emmanuel-macron-volodymyr-zelenskyy_7083905.jpg?20251117144732",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-17 12:51:00",
        "Headline": "Volodymyr Zelenskyy said the deal will also open the door for future air defence purchases, amid an increase in Russian drone and missile attacks.",
        "Content": "Ukrainian President Volodymyr Zelenskyy has signed a letter of intent with France to obtain 100 Rafale fighter jets as he seeks to bolster the country's long-term air defence capacity against Russia. He said the letter would also open the door for Ukraine to buy SAMP-T air defence systems, radars, air-to-air missiles and aerial bombs. \"It will be the greatest air defence, one of the greatest in the world,\" Zelenskyy said after signing the letter with French counterpart Emmanuel Macron at Villacoublay air base, near Paris. But Zelenskyy's visit comes amid an increase in Russian drone and missile attacks on Ukraine, with Moscow's defence ministry saying forces have captured five villages in the Kharkiv, Donetsk, Dnipropetrovsk and Zaporizhzhia regions. At least six people have been killed overnight. Read more from Sky News: Ukraine war live: Bombing on Polish railway was 'sabotage', says PMHundreds of Russian troops roll into key frontline Ukrainian city 'Mad Max-style', video appears to show France wouldn't give details on whether the Dassault-made jets would be transfers from existing French stocks or purchases of new jets, but two officials told Reuters they would be part of a 10-year aviation deal between the two countries. They said the bulk of the jets would be longer-term, and part of Ukraine's efforts to increase its fleet to 250 warplanes, which also includes jets from the US and Sweden. Talks between the two countries have been ongoing for several weeks to see how France could provide more support for Ukraine's air defences, after President Macron pledged to offer more Mirage fighter jets and a new batch of surface-to-air missiles. The officials said deals for further air defence systems would also either come from existing stock or through long-term next-generation orders, including surface-to-air missiles and anti-drone systems. Ahead of Zelenskyy's visit, Macron's office said the aim of the letter was to \"put French excellence in the arms industry at the service of Ukraine's defence\" and \"enable it to acquire the systems it needs to respond to Russian aggression\"."
    },
    {
        "title": "Wilmer Chavarria: Ecuadorian drug lord who faked his own death and ordered assassinations is captured, says president",
        "description": "One of Ecuador's most wanted drug lords, who faked his own death and moved to Spain, has been captured in Malaga, the Ecuadorian president has said.",
        "url": "https://news.sky.com/story/wilmer-chavarria-ecuadorian-drug-lord-who-faked-his-own-death-and-ordered-assassinations-is-captured-says-president-13471533",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wilmer-chavarria-ecuador_7083872.jpg?20251117091213",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-17 07:26:00",
        "Headline": "Chavarria, who is believed to be the leader of drug trafficking group Los Lobos, had moved to Spain after obtaining a new identity.",
        "Content": "One of Ecuador's most wanted drug lords, who faked his own death and moved to Spain, has been captured in Malaga, the Ecuadorian president has said. Wilmer Chavarria, believed to be the leader of drug trafficking group Los Lobos, was arrested on Sunday in the popular holiday destination in a joint operation with Spanish police, according to Daniel Noboa. Chavarria, also known as \"Pipo\", faked his death in 2021 during the COVID-19 pandemic and moved to Spain after obtaining a new identity, President Noboa said. While in Spain, he coordinated drug shipments, ordered assassinations and ran extortion rackets against gold mines in Ecuador, the president added. Hunted 'in his very own hell' On social media, Mr Noboa said Chavarria had \"hid in Europe while ordering murders in Ecuador\", adding: \"Some gave him up for dead; we searched for him in his very own hell.\" Interior minister John Reimberg said Chavarria was responsible for at least 400 deaths, and had managed criminal operations from prison between 2011 and 2019. \n                  Trump's declared war on drug cartels. Thousands of miles away, Ecuador is taking action\n                 \n                  Notorious Ecuador gang boss Fito extradited to the US\n                 \n                  Fito - Ecuador's most-wanted fugitive - found hiding under kitchen counter after a year on the run\n                 Los Lobos, which has around 8,000 fighters, was recently declared a terrorist organisation by US authorities. The group has been linked to political assassinations in Ecuador and has also been accused of working closely with Mexico's Jalisco New Generation Cartel. Key transit point for cocaine Ecuador used to be one of the most peaceful countries in South America, but after becoming a key transit point for cocaine produced in neighbouring Colombia and Peru, violent crimes and murders have spiked. Between January and September, Ecuadorian authorities seized more than 146 tonnes of drugs, down from 208 tonnes during the same period in 2024. Violent deaths increased by more than 36% year-on-year in the first nine months of 2025. Drug trafficking gangs have attacked presidential candidates, civil officials and journalists as they fight for control over ports and coastal cities. Read more on Sky News:Trump's war on drugs affects EcuadorUS aircraft carrier in show of military power Chavarria's capture came as Ecuadorians looked set to vote against changing the constitution to allow foreign countries to run military bases in the country. The measure, which was backed by Mr Noboa, was rejected by nearly two-thirds of voters in a national referendum, with around 90% of votes counted. The president had argued it would help increase anti-drug cooperation with countries like the US and put further pressure on drug traffickers. In June, another Ecuadorian drug trafficker, Jose Adolfo Macias, also known as \"Fito\", was arrested after a year on the run. Last year, five men, including two who were alleged to be Los Lobos members, were jailed for a total of more than 100 years for murdering presidential candidate Fernando Villavicencio."
    },
    {
        "title": "Railway bombing an 'unprecedented act of sabotage', Poland's PM says",
        "description": "An explosion on a key Polish railway line used to transport weapons to Ukraine was caused by an \"unprecedented act of sabotage\", according to the country's prime minister.",
        "url": "https://news.sky.com/story/railway-bombing-an-unprecedented-act-of-sabotage-polands-pm-says-13471586",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-tusk-poland_7083971.jpg?20251117123024",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-17 09:51:00",
        "Headline": "The blast on a key railway line used to transport weapons to Ukraine is the latest in a wave of attacks that have hit Poland and other European countries.",
        "Content": " An explosion on a key Polish railway line used to transport weapons to Ukraine was caused by an \"unprecedented act of sabotage\", according to the country's prime minister. Donald Tusk said an investigation was under way and vowed to catch those responsible for the attack, which has partially destroyed the line that connects Warsaw and Lublin. No injuries have been reported, with Mr Tusk saying that \"fortunately\" tragedy had been avoided. The blast is the latest in a wave of arson, sabotage and cyberattacks that have hit Poland and other European countries since the start of the war in Ukraine.  Poland has previously blamed Russia for such attacks, saying it has become one of Moscow's biggest targets due to its role as a hub for aid to Kyiv. Mr Tusk, who visited the site on Monday, said the line was \"crucially important for delivering aid to Ukraine\". He wrote on X: \"Just like in previous cases of this kind, we will catch the perpetrators, regardless of who their backers are.\" Russia has repeatedly denied being responsible for acts of sabotage. Train track irregularities Local police said reports of track irregularities on the Warsaw-Lublin line were raised by a train driver at around 7:40am on Sunday. Inspections were carried out which found damage to the track near the village of Mika, 62 miles southeast of Warsaw. Damaged track was also found at another location on the route. Mr Tusk blamed the damage on a detonated explosive device. It was not immediately clear whether the explosion and damage occurred late on Saturday or early on Sunday. Poland's defence minister said the army plans to examine about 75 miles of the Warsaw-Lublin-Hrubieszów line, which links Warsaw to Ukraine by rail and road. A second train on the Swinoujscie to Rzeszow route carrying 475 passengers was also damaged. That train was forced to stop 31 miles from Lublin on Sunday night when the overhead electrical cables that powered the train were damaged. The incident is also under investigation. The line is also used for passenger trains travelling between the two cities. The deputy interior minister appealed against jumping to conclusions about the identity of the perpetrators \"because Russia isn't so powerful that every arson, every situation of this kind, is provoked by Russia\". However, he added that Russia's involvement also could not be ruled out. Rising levels of sabotage Authorities in Poland and across Europe have been on alert after a spate of high-profile sabotage events. Warsaw said in October that Poland and Romania had detained eight people suspected of planning sabotage on behalf of Russia. Three of those were detained over an alleged new plan to send exploding parcels to Ukraine. In the same month, a British judge sentenced five men for their roles in an arson attack in London, which damaged a warehouse in March 2024 that contained satellite communication devices destined for Ukraine. Authorities say the incident was masterminded by Russian intelligence.  Read more from Sky News:Why UK's undersea cables are vulnerableBriton who volunteered as spy for Russia jailed In November of last year, security officials said parcels that exploded at logistics depots across Europe were part of a test run for a Russian plot to trigger explosions on cargo flights to the US. Meanwhile, European capitals have been alarmed by recent and repeated damage to undersea cables. In December, Finland seized the Eagle S oil ship which was suspected of damaging the Estlink 2 undersea power cable in the Baltic Sea by dragging its anchor across it. Western officials have accused Russia and its proxies of staging dozens of attacks across Europe since the invasion of Ukraine in a coordinated campaign of grey zone activity. Russia has consistently denied that it engages in sabotage, damaging undersea infrastructure or arson attacks."
    },
    {
        "title": "Joseph James O'Connor ordered to pay back over £4m in Bitcoin after hacking celebrity X accounts",
        "description": "A British man who hacked the X accounts of celebrities in a bid to con people out of Bitcoin, has been ordered to repay &#163;4.1m-worth of the cryptocurrency, prosecutors say.",
        "url": "https://news.sky.com/story/joseph-james-oconnor-ordered-to-pay-back-16341m-in-bitcoin-after-hacking-celebrity-x-accounts-13471601",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-joseph-oconnor-twitter-hack_6150648.jpg?20251117124050",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-17 09:58:00",
        "Headline": "The CPS said it had obtained a civil recovery order to seize 42 Bitcoin and other crypto assets linked to the scam, in which O'Connor used hijacked accounts to solicit digital currency and threaten celebrities.",
        "Content": "A British man who hacked the X accounts of celebrities in a bid to con people out of Bitcoin, has been ordered to repay £4.1m-worth of the cryptocurrency, prosecutors say. Joseph James O'Connor, 26, was jailed in the United States for five years in 2023 after he pleaded guilty to charges including computer intrusion, wire fraud and extortion. He was arrested in Spain in 2021 and extradited after the country's high court ruled the US was best placed to prosecute because the evidence and victims were there. The Crown Prosecution Service (CPS) said on Monday it had obtained a civil recovery order to seize 42 Bitcoin and other crypto assets linked to the scam, in which O'Connor used hijacked accounts to solicit digital currency and threaten celebrities. The July 2020 hack compromised accounts of high-profile figures including former US presidents Barack Obama and Joe Biden, and Amazon founder Jeff Bezos. O'Connor and his co-conspirators stole more than $794,000 (£629,000) of cryptocurrency after using the hacked accounts to ask people to send $1,000 in Bitcoin to receive double back. Prosecutor Adrian Foster said the civil recovery order showed that \"even when someone is not convicted in the UK, we are still able to ensure they do not benefit from their criminality\". The order, which valued O'Connor's assets at around £4.1m, was made last week, following a freeze placed on the hacker's property, which prosecutors secured during extradition proceedings. Read more on Sky News:'Wealth goddess' jailed over Bitcoin billionsArrests over alleged crypto scam A court-appointed trustee will liquidate his assets, the CPS said. The attack also compromised the X (then Twitter) accounts of other high-profile figures including Tesla chief executive Elon Musk, investor Warren Buffett, and media personality and businesswoman Kim Kardashian. The hack prompted the social media platform to temporarily freeze some accounts. X said 130 accounts were targeted, with 45 used to send tweets."
    },
    {
        "title": "'I'm about to break the internet over Jake Paul's face'",
        "description": "Boxer Anthony Joshua is set to mark his comeback to the ring with a surprise heavyweight bout against Jake Paul in Miami.",
        "url": "https://news.sky.com/story/im-about-to-break-the-internet-over-jake-pauls-face-13471710",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anthony-joshua-jake-paul_7084187.jpg?20251117152300",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-17 14:46:00",
        "Headline": "The fight on 19 December will mark the former world heavyweight champion's first since losing to Daniel Dubois in September 2024.",
        "Content": " Boxer Anthony Joshua is set to mark his comeback to the ring with a surprise heavyweight bout against Jake Paul in Miami. The former world heavyweight champion and YouTuber-turned-boxer will face off in a match consisting of eight three-minute rounds, with both boxers using 10oz gloves. The 36-year-old hasn't fought since September 2024, when he suffered a shock loss to British compatriot Daniel Dubois at Wembley in the fifth round of their IBF world heavyweight title fight. Joshua, who goes in with a record of 28 wins and four losses, promised the American \"no mercy\" ahead of his comeback. \"I took some time out, and I'm coming back with a mega show. It's a big opportunity for me. Whether you like it or not, I'm here to do massive numbers, have big fights and break every record whilst keeping cool, calm and collected,\" he said. \"Mark my words, you'll see a lot more fighters take these opportunities in the future. I'm about to break the internet over Jake Paul's face.\" If Jake Paul wins, he'll be in the running for a title, according to his manager, Nakisa Bidarian, chief executive of Most Valuable Promotions. \n                  Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'\n                 \n                  Why women are being forced to go abroad to help heal from a lifetime of trauma\n                 \n                  Weather latest: Amber cold health alert now issued for parts of UK until Saturday\n                 He said: \"For Jake it's doing the impossible, silencing the doubters and putting himself in a position to be in conversation for a belt, and he gets that if he beats Anthony Joshua. \"And for Joshua it's pretty simple: he's been out for quite a bit of time, he comes back and does one of the biggest events in the world, and if he knocks out Jake Paul he will be idolised by many within boxing.\" He continued: \"What we've accomplished in four years with Jake, with no amateur background, with no Olympic pedigree, makes everyone kind of take a step back and say, 'What is going on here? How is this possible?' \"It angers people in boxing that we can come in and get as much attention and notoriety as we have, as quickly as we have.\"  Paul was due to face Gervonta Davis this month, but the bout was cancelled after a civil lawsuit was filed against the WBA lightweight champion. The 28-year-old, who has a 12-1 record, last fought at heavyweight when he beat Mike Tyson by unanimous decision in November last year, in what was the then 58-year-old's first fight in 19 years, before following that up in June with another unanimous decision victory over Julio Cesar Chavez Jr. Read more from Sky News:Anthony Joshua could return to ring to fight ex-YouTuberTyson reveals he 'almost died' ahead of fight with Paul Paul labelled the fight in Miami as \"Judgement Day.\" \"A professional heavyweight fight against an elite world champion in his prime. When I beat Anthony Joshua, every doubt disappears and no one can deny me the opportunity to fight for a world title. \"To all my haters, this is what you wanted. To the people of the United Kingdom, I am sorry. On Friday, December 19, under the lights in Miami, live globally only on Netflix, the torch gets passed and Britain's Goliath gets put to sleep.\""
    },
    {
        "title": "Trump unveils FIFA PASS scheme to give priority visa appointment access to World Cup fans",
        "description": "People travelling to the United States for the football World Cup next year will be able to get interviews for visas more quickly, Donald Trump has announced.",
        "url": "https://news.sky.com/story/trump-unveils-fifa-pass-scheme-to-give-priority-visa-appointment-access-to-world-cup-fans-13471895",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-fifa_7084543.jpg?20251117215856",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-17 20:55:00",
        "Headline": "The pass will allow those with tickets for the 2026 event, purchased through FIFA, to get expedited visa appointments.",
        "Content": "People travelling to the United States for the football World Cup next year will be able to get interviews for visas more quickly, Donald Trump has announced. The US president announced the FIFA Prioritised Appointment Scheduling System, or FIFA PASS, in a news conference in the Oval Office. \"I've directed my administration to do everything within their power to make the 2026 World Cup an unprecedented success,\" he said. Trump latest: President threatens strikes on World Cup co-host to stop drugs The pass will allow those with World Cup tickets purchased through FIFA to get expedited visa appointments. Speaking alongside FIFA president Gianni Infantino, Mr Trump said he \"strongly\" encourages World Cup travellers to the US to apply for their visas \"right away\". US Secretary of State Marco Rubio said the administration had added 400 consular officers around the world to deal with increased demand for visas. He said in about 80% of the globe, travellers to the US can get a visa appointment within 60 days. Under the new system, those who have bought tickets through FIFA will be allowed to go through a \"FIFA portal\" to help get their visa application and interview prioritised at the State Department, Mr Rubio said. \"We're going to do the same vetting as anybody else would get,\" he added. \"The only difference here is, we're moving them up in the queue.\" Read more from Sky News:US aircraft carrier arrives close to Venezuela amid military build-upTrump ally 'open to moving forward' after row with US president After the announcement, Mr Infantino said: \"America welcomes the world. We have always said that this will be the greatest and most inclusive FIFA World Cup in history - and the FIFA PASS service is a very concrete example of that.\" He added: \"The United States is set to welcome fans from around the world on an unprecedented scale, and we are preparing to ensure that football unites the world when the tournament kicks off in North America next June.\" Over six million tickets will be available for the 104 World Cup games, which will be held across 16 host cities in Canada, Mexico as well as the United States. It has been easier for fans to travel to recent men's World Cups. In 2018, the visa process could be circumvented, with Russia requiring only fan IDs gained by submitting a photo, passport data and other personal information along with a match ticket reference. Instead of visas for Qatar 2022, fans only had to obtain a Hayya Card through a website in order to enter the Gulf nation."
    },
    {
        "title": "Budget 2025: Ex-Bank of England rate setter Andy Haldane criticises 'repeated mistakes'",
        "description": "A former Bank of England chief economist has told Sky News that \"repeated mistakes\" by the government have been \"sucking all life\" from the economy ahead of the budget.",
        "url": "https://news.sky.com/story/budget-2025-ex-rate-setter-slams-repeated-mistakes-13471555",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-podcast-pasaa-reeves_7010044.jpg?20250903122506",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-17 08:31:00",
        "Headline": "Andy Haldane makes the case for new rules to prevent economic self-harm ahead of UK budget speeches after the build-up turmoil of recent months.",
        "Content": " A former Bank of England chief economist has told Sky News that \"repeated mistakes\" by the government have been \"sucking all life\" from the economy ahead of the budget. Andy Haldane said the country had to find a new way of treating the build-up to the annual fiscal event, as budget rumour and speculation - initiated in part by ministers and via leaks - had fed acts of self-harm for the past two years. \"It's been a bad hand played, in truth, pretty poorly,\" he said of the chancellor's stewardship during his appearance on Mornings with Ridge and Frost. \"So mistakes have been made and repeated mistakes. And the worst of that, I would say, is it's repeated mistakes.\"  Money latest: 7 signs your mechanic is ripping you off The build up to this budget, and Rachel Reeves's first speech last October, have each been dominated by talk of crisis for the public finances. Mr Haldane told Sophy Ridge: \"The black hole narrative that you and I discussed a year ago, sucking all life or energy and light from the economy, has been a mistake repeated this time as well. \"So not enough has been done to give growth a chance to create that stability. It's only 16 months since Keir Starmer said I want to tread more lightly on our lives. That has singularly not happened. That speculation is proof positive of that.\" Mr Haldane, who served on the Bank's rate-setting committee for seven years, was speaking after official figures last week showed a bigger than expected climb in the UK's unemployment rate to 5% - a level not seen since the COVID pandemic.  The Office for National Statistics (ONS) also reported weaker than forecast economic growth during the third quarter of the year, slowing to 0.1%. He argued there was a clear link between the data and the looming budget, which takes place next week. \"If you speak to businesses, speak to consumers, their fearfulness about where the axe will fall is causing them, not unreasonably, to save rather than spend, to not put their balance sheet to work and that has taken the legs from beneath growth in the economy,\" he said. Asked if that was the government's fault or inevitable, he replied: \"The process has become far too elongated and far too leaky, to be honest. \"You know, we have this pretty much daily speculation about the next tax rise... we need to re-engineer that process to either make it watertight, like the Bank of England's monetary policy decisions or a genuinely open consultation. \"Right now, we have this halfway house of leaks and speculation which serves absolutely no one. Least of all the economy.\"  Read more:What taxes could go up now?Is Starmer 'in office but not in power'?Budget income tax U-turn. What happened? He made his remarks after the events of last Friday that saw the chancellor apparently rule out a Labour manifesto-breaking hike to income tax. That was despite Ms Reeves using a speech earlier this month to prepare the ground for such a move - to the horror of many Labour MPs. Treasury sources insisted the U-turn could be explained by better than expected economic forecasts by the Office for Budget Responsibility (OBR). The PM's official spokesman said of Mr Haldane's remarks that it was right for the chancellor to speak to the public on the principles she will take on delivering the budget and clear on the need to deliver stability in the public finances. "
    },
    {
        "title": "Inside the town where 6 out of 7 children grow up in poverty - and live in fear of homelessness",
        "description": "The cobbled streets of Newport in Middlesbrough survive from the Victorian era.",
        "url": "https://news.sky.com/story/inside-the-town-where-6-out-of-7-children-grow-up-in-poverty-and-live-in-fear-of-homelessness-13470171",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-poverty-middlesbrough_7081885.jpg?20251114175242",
        "type": "Business",
        "Author": "Greg Milam",
        "Date Published": "2025-11-17 00:01:00",
        "Headline": "As ministers prepare to act on child poverty, families in the area are backing calls for the two-child cap on benefits to be scrapped, and even local children say they are worried about becoming homeless.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  The cobbled streets of Newport in Middlesbrough survive from the Victorian era. The staggering levels of child poverty here also feel like they belong in a different time. Six out of every seven children in Newport are classified as living in poverty. The measure is defined by the Child Poverty Action Group as a household with an income less than 60% of the national average. More than half of children across the whole of the constituency of Middlesbrough and Thornaby East are growing up in poverty. As a long-awaited new strategy on child poverty is expected from the government, much of the focus on tackling the problem has been placed on lifting the two-child cap on benefits for families. Researchers say there is direct link between areas with the highest rates of child poverty and those with the highest proportion of children affected by that two-child cap. \n                  Tesco no longer cheapest traditional supermarket - and there's bad news for Aldi too\n                 \n                  Sainsbury's recalls own-brand hummus over potentially deadly E.coli warning\n                 \n                  Wes Streeting pushes forward with ban on high caffeine energy drinks for under-16s\n                 Mother-of-three Gemma Grafton said: \"Maybe if families do have more than two children, give them that little bit of extra help because it would make a difference.\" Three months ago, she and partner Lee welcomed baby Ivie into the world. With two daughters already, the cap means they receive no additional universal credit. \"You don't seem to have enough money some months to cover the basics,\" said Lee. \"Having to tell the kids to take it easy, that's not nice, when they're just wanting to help themselves to get what they want and we've got to say 'Try and calm down on what you're eating' because we haven't got the money to go and get shopping in,\" added Gemma. The couple had to resort to paying half of the rent one month, something they say is stressful and puts their home at risk. Those who work in the area of child poverty say they are engaged in a battle with child exploitation gangs who will happily step in and offer children a lucrative life of crime. \"Parents are crying that they're failing because they can't provide for their children,\" said Tracey Godfrey-Harrison, project manager at the Middlesbrough Food Bank. \"In today's society, it's disgraceful that anyone should have to cry because they don't have enough.\" In the shadow of a former steelworks, Dormanstown Primary Academy serves pupils in a community hit hard by the economic collapse that followed. The school works with charities and businesses to increase opportunities for pupils now and in the future. Katrina Morley, the academy's chief executive, said: \"A child who hasn't been able to sleep properly can't concentrate. They're tired. We know that the brain doesn't work in the same way. A child who is hungry can't access the whole of life. \"When you face hardship, it affects not just your physiology but your emotional sense, your brain development, your sense of worth. They don't get today back and their tomorrow is our tomorrow.\" The school's year six pupils see the value of things like the on-site farm shop for families in need. They are open about their own worries, too. Bonnie, 10, said: \"I think that's very important because it ensures all the people in our community have options if they're struggling. \"It can be life-changing for families in poverty or who have a disadvantage in life because they don't have enough money and they're really struggling to get their necessities.\" Mark, also 10, said: \"I worry about if we have nowhere to live and if we haven't got enough money to pay for our home. But at least we have our family.\" They also see the homelessness in the area as the impact of poverty. \"I think it actually happens more often than most people think,\" said Leo, \"because near the town, there's people on the streets and they have nowhere to go.\" The school is one of many calling for the lifting of the two-child cap. The need for life's essentials has prompted more than 50 families to register for help at Barney's Baby Bank in the last 11 months. Nappies, wipes, clothing, shoes, toys, are a lifeline for those who call in. Founder Debbie Smith said local people \"are struggling with food. They're obviously struggling to clothe their babies as well. It's low wages, high unemployment, job insecurity and that two-child benefit cap\". \"Middlesbrough does feel ignored,\" she added. A government spokesperson said: \"Every child, no matter their background, deserves the best start in life. That's why our Child Poverty Taskforce will publish an ambitious strategy to tackle the structural and root causes of child poverty. \"We are investing £500m in children's development through the rollout of Best Start Family Hubs, extending free school meals and ensuring the poorest don't go hungry in the holidays through a new £1bn crisis support package.\" Read more on Sky News:Progress 'being made' on povertyWarning over 'great poverty distraction' But what is the message to those making the decisions from the North East? \"Come and do my job for a week and see the need and the desperation the people are in,\" said Ms Godfrey-Harrison. \"There needs to be more done for people in Middlesbrough.\""
    },
    {
        "title": "Jansen ready for take-off as next chairman of Heathrow Airport",
        "description": "Heathrow Airport will this month name Philip Jansen as its next chairman as Britain's biggest aviation hub presses ahead with plans for a &#163;50bn expansion.",
        "url": "https://news.sky.com/story/jansen-ready-for-take-off-as-next-chairman-of-heathrow-airport-13471588",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport-london_6851757.jpg?20250310075137",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-17 09:51:00",
        "Headline": "Philip Jansen, the former BT boss, is to be named as the successor to Lord Deighton later this month as it seeks the go-ahead for a controversial £50bn expansion, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Heathrow Airport will this month name Philip Jansen as its next chairman as Britain's biggest aviation hub presses ahead with plans for a £50bn expansion. Sky News understands that Mr Jansen, the former chief executive of BT Group and now chairman of WPP, has held talks in recent weeks with some of Heathrow's major airline customers about the role. Sources close to the airport said that Heathrow's board and shareholders expected to announce his appointment as Lord Deighton's successor as soon as this week. Mr Jansen, whose candidacy was revealed by Sky News last month, has been picked partly as a result of his experience running a regulated utility in the form of BT. Money latest: 7 signs your mechanic is ripping you off He has also run companies including MyTravel, which was once one of Britain's biggest tour operators, and Worldpay, the payments processor. His appointment will come at a critical time for Heathrow. \n                  Heathrow puts Jansen on runway as next chairman\n                 \n                  Man arrested in connection with airports cyber attack\n                 \n                  Heathrow among major airports hit by delays after cyber attack\n                 In August, the airport submitted a revised expansion plan consisting of a third runway costing £21bn, £12bn for a new terminal and stand capacity, and £15bn to modernise the current airport through the expansion of Terminal 2. The existing Terminal 3 would ultimately be closed. Heathrow handled a record 83.9 million passengers last year and is adamant that a third runway is essential to the growth of Britain's economy given the volume of exports which pass through the site. \"It has never been more important or urgent to expand Heathrow,\" the airport's chief executive, Thomas Woldbye, said in August. \"We are effectively operating at capacity to the detriment of trade and connectivity. \"With a green light from government and the correct policy support underpinned by a fit for purpose regulatory model, we are ready to mobilise and start investing this year in our supply chain across the country. \"We are uniquely placed to do this for the country; it is time to clear the way for take-off.\"  The expansion remains opposed by airlines alarmed by the prospective increase in charges to use the airport, as well as environmental campaigners. It also faces a rival proposal from Surinder Arora, the businessman, who on Monday published further details of his Heathrow West blueprint, which he argues would cost nearly a third less than that of Heathrow Airport Limited. \"This is a once in a generation moment to finally deliver the expanded Heathrow that many in the airline and airport community have called for,\" Mr Arora said. \"As set out by the secretary of state, expansion cannot mean turning 'the M25 into Europe's largest car park' and Heathrow West clearly demonstrates that it doesn't need to. \"We are especially delighted to also now confirm we can avoid disrupting the M4 as well as the M25 which further makes the case for our scheme when compared to the alternative. \"Now is the time for the government to consider the two schemes and we look forward to further engagement.\" Heathrow's expansion has been backed by the government, with Rachel Reeves, the chancellor, saying that a third runway \"could unlock further growth, boost investment, increase exports, and make the UK more open and more connected as part of our Plan for Change\". Mr Jansen will lead a board dominated by representatives of the airport's principal shareholders. Mr Woldbye apologised in May for being asleep during the power outage in March which forced Heathrow's temporary closure. The airport said it would implement the recommendations of a review conducted by former transport secretary Ruth Kelly. Heathrow's appointment of a new chairman comes months after the most significant changes to its ownership structure in years. Ardian, a French investment group, now owns 32.6% of the company following a series of transactions over the last 12 months. Saudi Arabia's Public Investment Fund has also become an investor. A Heathrow spokesperson declined to comment on Monday."
    },
    {
        "title": "Joseph James O'Connor ordered to pay back over £4m in Bitcoin after hacking celebrity X accounts",
        "description": "A British man who hacked the X accounts of celebrities in a bid to con people out of Bitcoin, has been ordered to repay &#163;4.1m-worth of the cryptocurrency, prosecutors say.",
        "url": "https://news.sky.com/story/joseph-james-oconnor-ordered-to-pay-back-16341m-in-bitcoin-after-hacking-celebrity-x-accounts-13471601",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-joseph-oconnor-twitter-hack_6150648.jpg?20251117124050",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-17 09:58:00",
        "Headline": "The CPS said it had obtained a civil recovery order to seize 42 Bitcoin and other crypto assets linked to the scam, in which O'Connor used hijacked accounts to solicit digital currency and threaten celebrities.",
        "Content": "A British man who hacked the X accounts of celebrities in a bid to con people out of Bitcoin, has been ordered to repay £4.1m-worth of the cryptocurrency, prosecutors say. Joseph James O'Connor, 26, was jailed in the United States for five years in 2023 after he pleaded guilty to charges including computer intrusion, wire fraud and extortion. He was arrested in Spain in 2021 and extradited after the country's high court ruled the US was best placed to prosecute because the evidence and victims were there. The Crown Prosecution Service (CPS) said on Monday it had obtained a civil recovery order to seize 42 Bitcoin and other crypto assets linked to the scam, in which O'Connor used hijacked accounts to solicit digital currency and threaten celebrities. The July 2020 hack compromised accounts of high-profile figures including former US presidents Barack Obama and Joe Biden, and Amazon founder Jeff Bezos. O'Connor and his co-conspirators stole more than $794,000 (£629,000) of cryptocurrency after using the hacked accounts to ask people to send $1,000 in Bitcoin to receive double back. Prosecutor Adrian Foster said the civil recovery order showed that \"even when someone is not convicted in the UK, we are still able to ensure they do not benefit from their criminality\". The order, which valued O'Connor's assets at around £4.1m, was made last week, following a freeze placed on the hacker's property, which prosecutors secured during extradition proceedings. Read more on Sky News:'Wealth goddess' jailed over Bitcoin billionsArrests over alleged crypto scam A court-appointed trustee will liquidate his assets, the CPS said. The attack also compromised the X (then Twitter) accounts of other high-profile figures including Tesla chief executive Elon Musk, investor Warren Buffett, and media personality and businesswoman Kim Kardashian. The hack prompted the social media platform to temporarily freeze some accounts. X said 130 accounts were targeted, with 45 used to send tweets."
    },
    {
        "title": "How hidden card service could save you hundreds",
        "description": "If a retailer hasn't provided the goods or services you paid for, chargeback is a hidden way to get your money back.",
        "url": "https://news.sky.com/story/how-hidden-card-service-could-save-you-hundreds-13471709",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-credit-card-debit-card_7084153.jpg?20251117144637",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-17 14:39:00",
        "Headline": "If you buy something that turns out to be defective or never ends up being delivered, chargeback could be your ticket to a refund. But there are a number of criteria to meet.",
        "Content": "If a retailer hasn't provided the goods or services you paid for, chargeback is a hidden way to get your money back. It's a mechanism whereby banks can reverse transactions made on a credit, debit or charge card if there is a breach of contract. You can make a request for a chargeback if the company is refusing to offer a refund. But bear in mind, this is a voluntary scheme that card providers subscribe to - not a legal right. When does chargeback come in handy? Chargeback can be requested if the goods you purchased were defective or not as described, or if they simply never arrive, even if the company has gone bust. This is because your bank is requesting the money back from the company's bank, not the company itself. Find latest tips and deals in the Money blog Chargeback is also useful if there is an error, such as being charged multiple times or after cancelling a subscription, or if someone fraudulently bought the item with your money. The retailer will be given the opportunity to dispute your claim, but if you're unsuccessful, you can appeal to the financial ombudsman. What cards are covered? Debit: Visa Debit, Visa Electron, Maestro and Mastercard Prepaid: Visa and Mastercard Credit cards: Visa Credit, Mastercard and American Express How does it work? Claims can be made via email, online form or written letter, but a good place to start is your bank's website, which may have a link for \"disputed transactions\" or \"chargeback claims\". The claim should include the name of the retailer, the date of your purchase and how you paid, a detailed description of the goods and expected delivery dates. Describe what went wrong, and if this includes returning faulty goods, provide proof. More evidence may be requested, including invoices, receipts, correspondence and the retailer's terms and conditions. \"You need to cite 'breach of contract' relating to your consumer rights,\" consumer champion Scott Dixon, aka The Complaints Resolver, says. \"You need to push hard on chargebacks as they are often rejected on the first attempt. \"Your bank or credit card provider will reverse the payment and give the retailer an opportunity to present their case. \"Retailers don't like dealing with chargebacks as they are problematic and costly to resolve.\" Under American Express rules, the retailer has 20 days to dispute the claim, while under Visa and MasterCard rules they have 45 days. Must-read caveats Time limit: You must request a chargeback within 120 days of the date you were due to receive the product. Future events, like plane tickets, are covered by this policy from the date they would be used. Deposits: Because you are refunded what you paid by card, you won't get your money back if you just put down the deposit via plastic and paid the rest by a different method. Credit cards: If your credit card purchase is worth more than £100, you are entitled to legal protection under Section 75, which will pay out the full cost of an item even if you only deposit a single penny. Mastercard minimum: There's a £10 minimum spend. This does not apply to Visa or American Express. PayPal: Chargeback cannot usually be used when paying via PayPal. But it is possible if you have an empty account and pay using your registered debit card because it is easier to prove the amount you paid corresponds with the price of the purchase, according to MoneySavingExpert."
    },
    {
        "title": "Seven red flags your mechanic is ripping you off - and what you can do about it",
        "description": "Mechanic anxiety: it's a thing, and you're not alone.",
        "url": "https://news.sky.com/story/seven-red-flags-your-mechanic-is-ripping-you-off-and-what-you-can-do-about-it-13471724",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mechanic-car_7084199.jpg?20251117153908",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-17 15:10:00",
        "Headline": "Around a quarter of motorists feel taken advantage of by garage workers, according to a recent survey. But there are several simple things you can do to help banish mechanic anxiety and ensure you get a fair deal.",
        "Content": "Mechanic anxiety: it's a thing, and you're not alone. Millions of us face the daunting trip to the garage to get our cars fixed at least once a year, and for many it can be a moment of serious worry. There's nothing easy about stepping into a minefield of confusing words and constantly fearing that you're being ripped off. Money blog: Get the latest updates One survey of UK drivers found that 23% felt they were taken advantage of when getting their car serviced, while another 25% felt anxious just entering a garage. Ovoko, an online marketplace for used car parts, has compiled a list of seven red flags that scream \"dodgy mechanic\". 1. Failure to explain the problem simply If a mechanic can't explain a problem in language that you can understand, that's a red flag. Using overly technical jargon without breaking it down, or seeming evasive when you ask for clarification, is a big no-no. Watch out for super patronising phrases such as \"it's complicated\" or \"you wouldn't understand\" when you ask for details about a repair. 2. Refusing to provide a written estimate Big red flag! Any reputable mechanic should provide written estimates for work costing more than a basic service. Verbal quotes leave room for \"misunderstandings\" that always seem to favour the garage. 3. Estimates vary wildly between visits If you return to the same garage for a similar issue and receive a drastically different quote, question why. While parts prices can fluctuate, dramatic variations in labour costs or repair approaches suggest inconsistent pricing practices. \"Professional shops maintain consistent pricing structures,\" Kazimieras Urbonas, supplier excellence manager at Ovoko, explains. \"If they're quoting you £200 for a service one month and £500 for the same work the next, something isn't right.\" Keep records of previous repairs and quotes to help identify these discrepancies. 4. Pushing for immediate repairs Legitimate urgent repairs do exist, but be wary of high-pressure tactics that don't allow you time to think or get a second opinion. Dishonest mechanics often create false urgency to prevent you from shopping around. Be especially cautious if they claim your car is \"dangerous to drive\" but still let you drive it off the lot after paying for their expensive fix. 5. Not showing you the parts When you're paying for replacement parts, you have every right to see what's being removed from your car. Mechanics who refuse this request or claim they've already disposed of the parts might not have replaced anything at all. 6. Finding 'urgent' problems in a routine service \"A good practice is to ask them to show you each problem they've found,\" advises Urbonas. \"Take photos if possible, and don't feel pressured to authorise everything immediately.\" Consider getting a second opinion, especially if the additional work costs more than your car's value. 7. Expensive parts While mechanics deserve fair profit margins on parts, some inflate prices to unreasonable levels. Research common part costs online to get a baseline understanding of fair pricing. Ask for itemised estimates that separate parts costs from labour, and don't hesitate to question prices that seem excessive. Been ripped off? Here's what to do about it There's a template available via the Citizens Advice website to formally complain to the garage - but if you've read this far, we're guessing you're looking for more clout than that. It's important to note that if you're in a dispute, the garage can keep your car until the bill is paid. To avoid this, you can \"pay under protest\" and continue the dispute by writing those words clearly on the garage's copy of the repair order sheet and any copies of receipts it makes. If you don't, the garage could later argue you accepted the charges by paying the bill. Dispute resolution services Your next port of call could be to contact the garage's trade association, if it is a member of one, which may offer free dispute resolution services. Failing that, you can ask the garage if they are a member of an alternative dispute resolution (ADR) scheme, in which a third party will decide the outcome. Keep hold of the garage's response - or lack of - if it won't use an ADR and you intend to go to small claims court. Going to court (England and Wales) If you get the car repaired at a new garage, you can try to go to court for the cost of carrying out extra repairs, though this can be risky. First, check your eligibility, such as the upper monetary limit for claims, £10,000, or the time limit since the incident, six years. Evidence is vital, and without the likes of letters, receipts, photos and estimates, it may not be a good idea to start a court claim, according to Citizens Advice. Review the court fees - if you win your case, you might get these back. If you lose, you might have to pay them. If you want to go ahead, you'll need to write a formal claim letter to the garage and fill in a claim form, as well as deal with the defendant's response. Further details and help with these steps can be found here. Before your case goes to court for a hearing, you'll have an appointment with the free court mediation service to try to reach an agreement. Going to court (Scotland) The process differs slightly in Scotland, where you can use the \"simple procedure\" to apply to the sheriff court for claims of £5,000 or less. You can apply here and, just like in England and Wales, you'll have to pay a fee: £22 for claims under £300, £123 for any more valuable claims. If your claim is for more than £5,000, it would usually fall under ordinary procedure rules. The procedure is quite complex and the Scottish Courts and Tribunals Service advises applicants to seek legal advice. Rules can be found here."
    },
    {
        "title": "Home secretary admits illegal immigration numbers still 'too high' under Labour - but says Farage can 'sod off'",
        "description": "The home secretary has admitted the UK's illegal immigrant numbers are \"too high\" - but said Nigel Farage can \"sod off\" after he claimed she sounded like a Reform supporter.",
        "url": "https://news.sky.com/story/home-secretary-admits-illegal-immigration-numbers-still-too-high-under-labour-but-says-farage-can-sod-off-13471963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mahmood-shabana_7084566.jpg?20251117221723",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-17 22:15:00",
        "Headline": "Shabana Mahmood has announced sweeping changes to the UK's asylum system, including rowing back on guarantees of financial support. The tough proposals have been welcomed by the Tories and Reform, and left some Labour MPs feeling uneasy.",
        "Content": " The home secretary has admitted the UK's illegal immigrant numbers are \"too high\" - but said Nigel Farage can \"sod off\" after he claimed she sounded like a Reform supporter. Shabana Mahmood, speaking just after announcing a major policy change on migration, said she was \"horrified\" by the 27% increase of irregular arrivals in the year to June. Speaking to Sky News' political editor Beth Rigby, the home secretary said: \"I acknowledge the numbers are too high, and they've gone up, and I want to bring them down. \"I'm impatient to bring those numbers down.\" She refused to \"set arbitrary numbers\" on how much she wanted to bring illegal migration down to.  Earlier on Monday, Ms Mahmood announced a new direction in Labour's plan to crack down on asylum seekers. The \"restoring order and control\" plan includes: • The removal of more families with children - either voluntarily through cash incentives up to £3,000, or by force;• Quadrupling the time successful asylum seekers must wait to claim permanent residency in the UK, from five years to 20;• Removing the legal obligation to provide financial support to asylum seekers, so those with the right to work but choose not to will receive no support;• Setting up a new appeals body to significantly speed up the time it takes to decide whether to refuse an asylum application;• Reforming how the European Convention on Human Rights (ECHR) is interpreted in immigration cases;• Banning visas for countries refusing to accept deportees;• And the establishment of new safe and legal refugee routes. Read more: Everything you need to know about Labour's plans  Reform UK leader Nigel Farage said the plan was much like something his party would put forward, and said Ms Mahmood sounded like a Reform supporter. The home secretary responded with her usual frankness, telling Rigby: \"Nigel Farage can sod off. I'm not interested in anything he's got to say. \"He's making mischief. So I'm not going to let him live forever in my head.\" You might need our support, says Badenoch Her plans have also been tentatively welcomed by the Conservatives, with Kemi Badenoch suggesting the home secretary work with her in case of a rebellion by Labour MPs. The backing of Tory MPs could \"come in handy\", Ms Badenoch said. The government's attempts to cut the welfare bill earlier this year were thwarted by its own backbenchers, and the proposals announced on Monday have already attracted backlash from some on the left of the Labour Party. Nadia Whittome MP called Ms Mahmood's plans \"dystopian\" and \"shameful\", while Richard Burgon MP said she should change course now rather than be forced into a U-turn later. Read more:How the UK and Denmark's immigration policies compare Mahmood's warning to Labour MPs But Ms Mahmood has warned her colleagues that disrupting her bid to reform the asylum system - thus hoping to bring down the number of small boat crossings - risks \"dark forces\" coming to prominence. Speaking in the House of Commons on Monday evening, Ms Mahmood said: \"If we fail to deal with this crisis, we will draw more people down a path that starts with anger and ends in hatred.\" She later told Beth Rigby that Reform wanted to \"rip up\" indefinite leave to remain altogether, which she called \"immoral\" and \"deeply shameful\". The home secretary, who is a practising Muslim, was born in Birmingham to her Pakistani parents. Earlier, in the House of Commons, she said she sees the division that migration and the asylum system are creating across the country. She told MPs she regularly endures racial slurs."
    },
    {
        "title": "New campaign backs introduction of Graduated Driving Licences",
        "description": "MPs and bereaved families have launched a new campaign urging the government to re-think its position on introducing Graduated Driving Licences.",
        "url": "https://news.sky.com/story/new-campaign-backs-introduction-of-graduated-driving-licences-13471768",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-car-finance_6981997.jpg?20250803173726",
        "type": "Politics",
        "Author": "Dan Whitehead",
        "Date Published": "2025-11-17 16:26:00",
        "Headline": "Supporters of the campaign say the new rules could \"save people's lives\".",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n  MPs and bereaved families have launched a new campaign urging the government to re-think its position on introducing Graduated Driving Licences. The event, in Parliament, came at the start of Road Safety Week and ahead of the government's highly anticipated new road safety strategy, the first in a decade, which could be published next month. Kim Leadbeater MP told the gathering that the idea for tougher rules for new drivers \"transcends party politics\" and could leave to \"saving people's lives\". Organisations, including fire services, police and crime commissioners, motoring organisations as well as road safety charities, are behind a new website, \"Protect Young Drivers: Time for Change\", which documents the case for introducing stronger measures. Graduated Driving Licences (GDLs) is a system designed to give new drivers a staggered approach to gaining full privileges on the road, such as driving at night or with a full car of passengers. The system has been successful in countries including Canada and Australia at reducing the number of young people killed or seriously injured. \"I feel as a bereaved parent we are very easily dismissed\" \n                  Seven red flags your mechanic is ripping you off - and what you can do about it\n                 \n                  Reform council repaints road markings for school which closed in 2016\n                 \n                  Worst areas for uninsured driving revealed - as hit-and-run victim says he was 'left for dead'\n                 Last year 22% of fatalities on Britain's roads involved a young person behind the wheel. Data released by the Department for Transport also shows that male drivers aged 17-24 are four times more likely to be killed or seriously injured than all drivers aged over 25. At the start of the launch a one minute silence was held to remember victims of road traffic accidents - including five young adults who died in a crash in Ireland on Saturday night. Chris Taylor, who lost his 18-year-old daughter Rebecca in a road traffic collision in 2008, said the grief doesn't go away. \"I feel as a bereaved parent we are very easily dismissed,\" he said. \"We've got an opportunity. Together we are a movement that can create real change.\" The Department for Transport has previously told Sky News it is not considering GDLs. \"Every death on our roads is a tragedy and our thoughts are with everyone who has lost a loved one in this way,\" said a spokesperson. \"Whilst we are not considering Graduated Driving Licences, we absolutely recognise that young people are disproportionately victims of tragic incidents on our roads and continue to tackle this through our THINK! campaign. \"We are considering other measures to address this problem and protect young drivers, as part of our upcoming strategy for road safety - the first in over a decade.\""
    },
    {
        "title": "Joseph James O'Connor ordered to pay back over £4m in Bitcoin after hacking celebrity X accounts",
        "description": "A British man who hacked the X accounts of celebrities in a bid to con people out of Bitcoin, has been ordered to repay &#163;4.1m-worth of the cryptocurrency, prosecutors say.",
        "url": "https://news.sky.com/story/joseph-james-oconnor-ordered-to-pay-back-16341m-in-bitcoin-after-hacking-celebrity-x-accounts-13471601",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-joseph-oconnor-twitter-hack_6150648.jpg?20251117124050",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-17 09:58:00",
        "Headline": "The CPS said it had obtained a civil recovery order to seize 42 Bitcoin and other crypto assets linked to the scam, in which O'Connor used hijacked accounts to solicit digital currency and threaten celebrities.",
        "Content": "A British man who hacked the X accounts of celebrities in a bid to con people out of Bitcoin, has been ordered to repay £4.1m-worth of the cryptocurrency, prosecutors say. Joseph James O'Connor, 26, was jailed in the United States for five years in 2023 after he pleaded guilty to charges including computer intrusion, wire fraud and extortion. He was arrested in Spain in 2021 and extradited after the country's high court ruled the US was best placed to prosecute because the evidence and victims were there. The Crown Prosecution Service (CPS) said on Monday it had obtained a civil recovery order to seize 42 Bitcoin and other crypto assets linked to the scam, in which O'Connor used hijacked accounts to solicit digital currency and threaten celebrities. The July 2020 hack compromised accounts of high-profile figures including former US presidents Barack Obama and Joe Biden, and Amazon founder Jeff Bezos. O'Connor and his co-conspirators stole more than $794,000 (£629,000) of cryptocurrency after using the hacked accounts to ask people to send $1,000 in Bitcoin to receive double back. Prosecutor Adrian Foster said the civil recovery order showed that \"even when someone is not convicted in the UK, we are still able to ensure they do not benefit from their criminality\". The order, which valued O'Connor's assets at around £4.1m, was made last week, following a freeze placed on the hacker's property, which prosecutors secured during extradition proceedings. Read more on Sky News:'Wealth goddess' jailed over Bitcoin billionsArrests over alleged crypto scam A court-appointed trustee will liquidate his assets, the CPS said. The attack also compromised the X (then Twitter) accounts of other high-profile figures including Tesla chief executive Elon Musk, investor Warren Buffett, and media personality and businesswoman Kim Kardashian. The hack prompted the social media platform to temporarily freeze some accounts. X said 130 accounts were targeted, with 45 used to send tweets."
    },
    {
        "title": "BBC 'determined to fight' any Trump legal action, chairman tells staff",
        "description": "BBC chair Samir Shah has said there is \"no basis for a defamation case and we are determined to fight this\" - after Donald Trump said he would sue the corporation for between $1bn and $5bn.",
        "url": "https://news.sky.com/story/bbc-determined-to-fight-any-trump-legal-action-chairman-tells-staff-13471613",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bbc-security-guard_7078871.jpg?20251111082806",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-17 10:52:00",
        "Headline": "It comes after the US president confirmed on Saturday he would be taking legal action against the broadcaster over the editing of his speech on Panorama - despite an apology from the BBC.",
        "Content": " BBC chair Samir Shah has said there is \"no basis for a defamation case and we are determined to fight this\" - after Donald Trump said he would sue the corporation for between $1bn and $5bn. It comes after the  US president confirmed on Saturday he would be taking legal action against the broadcaster over the editing of his speech on Panorama - despite an apology from the BBC. In an email to staff, Mr Shah said: \"There is a lot being written, said and speculated upon about the possibility of legal action, including potential costs or settlements. \"In all this we are, of course, acutely aware of the privilege of our funding and the need to protect our licence fee payers, the British public. \"I want to be very clear with you - our position has not changed. There is no basis for a defamation case and we are determined to fight this.\" 👉 Listen to Sky News Daily on your podcast app 👈 On Saturday, President Trump told reporters legal action would come in the following days. \"We'll sue them. We'll sue them for anywhere between a billion (£792m) and five billion dollars (£3.79bn), probably sometime next week,\" he said. \"We have to do it, they've even admitted that they cheated. Not that they couldn't have not done that. They cheated. They changed the words coming out of my mouth.\"Read more from Sky News:Amber cold health alert now issued for parts of UK until SaturdaySheikh Hasina sentenced to death for crimes against humanity The BBC on Thursday said the edit of Mr Trump's speech on 6 January 2021 had given the \"mistaken impression that President Trump had made a direct call for violent action\". The broadcaster apologised and said the splicing of the speech was an \"error of judgment\" but refused to pay financial compensation after the US leader's lawyers threatened to sue for one billion dollars in damages unless a retraction and apology were published. The Panorama scandal prompted the resignations of two of the BBC's most senior executives - director-general Tim Davie and news chief Deborah Turness. The broadcaster has said it will not air the Panorama episode Trump: A Second Chance? again, and published a retraction on the show's webpage on Thursday."
    }
]