[
    {
        "title": "Shocking allegations of bullying, racism, and undignified births revealed in damning maternity report",
        "description": "An interim report into maternity and neonatal services across England has uncovered shocking allegations of racism, bullying, crumbling infrastructure, and births in undignified circumstances.",
        "url": "https://news.sky.com/story/shocking-allegations-of-bullying-racism-and-undignified-births-revealed-in-damning-maternity-report-13512175",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maternity-baby-birth_7106785.jpg?20251210192007",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-25 17:19:00",
        "Headline": "Maternity and neonatal services in England \"are failing too many women, babies, families and staff\", the chair Baroness Amos says.",
        "Content": "An interim report into maternity and neonatal services across England has uncovered shocking allegations of racism, bullying, crumbling infrastructure, and births in undignified circumstances. Some families said that baby deaths were being misclassified to prevent further investigation. Baroness Amos, who is leading a national investigation into maternity care, said: \"Maternity and neonatal services in England are failing too many women, babies, families, and staff.\" Investigators spoke to hundreds of harmed families and staff across 12 NHS trusts in England, many of whom shared shocking accounts of their experiences. Some families alleged in the report that their babies were designated stillborn instead of dying after birth. \"They felt the system incentivised the recording of deaths as stillbirths as this prevents the case from being investigated by a coroner,\" the report said. Jack and Sarah Hawkins, whose daughter Harriet was stillborn, were not part of the Amos investigation, but have fought to get a separate inquiry launched for bereaved and harmed families in Nottingham. Jack said: \"We have met a number of people and heard reports from a number of people whose babies they say were born alive and who the hospital say were born dead. \"And that is a horrific position, a horrific thing to say, and yet of course we believe the victims, not the NHS, who have shown themselves to be sparing with the truth around some of these issues.\" Neither supported Baroness Amos' inquiry. Sarah said it \"isn't going to change anything\". 'There needs to be a public inquiry' \"Families just want accountability and this report is not going to bring accountability,\" she said. \"There needs to be a statutory public inquiry and some form of justice. Because if your child died in any other circumstance in life, you would get justice. People would be held to account. \"Yet in maternity services, it doesn't happen like that and that is so unfair.\" Royal correspondent The flaws highlighted in this report are depressingly familiar. Racism, bullying, cover-ups. And a burnt out workforce delivering babies in dilapidated buildings with a lack of compassion and care. Little surprise Baroness Amos asks how this can be regarded as acceptable in 2026. She knows how bad things are. She's spent the last six months speaking to hundreds of families including those bereaved and harmed. She's met MPs, visited hospitals at the centre of scandals, and spoken to staff. Her interim findings paint a picture of persistent failings. But it’s the details that are most disturbing. Shocking stereotypes with Asian women deemed \"princesses\", and black women as having \"tough skin\" and \"able to tolerate pain\". How one woman was told she was too fat to have children. And when things go wrong, there's a lack of transparency compounding parents’ suffering, leaving litigation often their only option. Maternity units have become toxic environments for some staff with \"racist and bullying behaviour\" from colleagues that isn't dealt with by managers.  And in one hospital staff on a labour ward include weather reports in their handover, because of leaks when it rains. This report says a lot about the state of maternity services. But for many, it's nothing new. We already know what's going wrong, as numerous investigations have uncovered.  The real test will come with the publication of Baroness Amos's final report and whether her recommendations can bring the lasting change that's so desperately needed. Read more on Sky News:Trust fined over baby deathsBirth stories - mothers ignored and neglected The National Maternity and Neonatal Investigation (NMNI) in England was set up by Health Secretary Wes Streeting in June after he met families harmed by poor maternity care. In her initial report released in December, Ms Amos said \"nothing prepared her\" for the amount of \"unacceptable care\" families currently receive. Investigators have met more than 400 family members and heard from over 8,000 people, including NHS staff."
    },
    {
        "title": "Epstein blamed 'Charles' on day Andrew lost UK trade envoy job",
        "description": "Jeffrey Epstein blamed \"Charles\" on the day Andrew Mountbatten-Windsor lost his UK trade envoy job.",
        "url": "https://news.sky.com/story/epstein-blamed-charles-on-day-andrew-lost-uk-trade-envoy-job-13512177",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-andrew-mountbatten-windsor_7174997.jpg?20260225184244",
        "type": "Home",
        "Author": "Sarah Hajibagheri, news editor",
        "Date Published": "2026-02-25 17:39:00",
        "Headline": "On 21 July 2011 Epstein wrote, \"I assume he knows that this is Charles' doing\".",
        "Content": "By Sarah Hajibagheri, news editor  Jeffrey Epstein blamed \"Charles\" on the day Andrew Mountbatten-Windsor lost his UK trade envoy job. On 21 July 2011, the day it was announced that the former prince would step down from the role, Epstein wrote, \"I assume he knows that this is Charles doing\". The email was in response to a message from an associate, who said: \"Lots of TV coverage on PA and always big feature on you. Insane.\" Sky News believes PA refers to Prince Andrew. The former prince served as the UK's special representative for international trade and investment between 2001 and 2011. The role gave him access to senior government and business contacts around the world. He stepped back from the role amid increasing scrutiny and criticism about his continued relationship with the US financier and convicted sex offender. A photo of the two men walking in New York made headlines in the months ahead of him stepping down. Read more from Sky News:UK records hottest day of the year so farAI developing so fast it is becoming hard to measure The three million files released by the US Department of Justice provide a glimpse into fragments of personal conversations that were occurring when Andrew and Epstein's relationship was making headlines 15 years ago. The convicted sex offender had been emailing friends about the news Andrew had lost his official trade role all day. Epstein said, in another email about the news, \"I'm sure this is good for him, he will now be free\". He also sent a news article about Andrew stepping down to Ghislaine Maxwell, who asked, \"why?\" Epstein responded, \"I think he wants to make money\". Andrew Mountbatten-Windsor was arrested on suspicion of misconduct in public office on his 66th birthday. After 11 hours of questioning, he was released under investigation. Last week in a statement, the King stressed that Buckingham Palace would help the police if it was approached as part of the investigation. He wrote: \"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities. \"In this, as I have said before, they have our full and wholehearted support and co-operation. Let me state clearly: the law must take its course. \"As this process continues, it would not be right for me to comment further on this matter.\" Andrew Mountbatten-Windsor has always denied any wrongdoing."
    },
    {
        "title": "Met Police apologises to Commons Speaker over Lord Mandelson tip-off",
        "description": "The Metropolitan Police has apologised to the Commons Speaker for revealing he was the source of a tip-off relating to the arrest of Lord Mandelson.",
        "url": "https://news.sky.com/story/met-police-apologises-to-commons-speaker-over-lord-mandelson-tip-off-13512284",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsay-hoyle-speaker_7175217.jpg?20260225231852",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-25 23:01:00",
        "Headline": "Lord Mandelson was arrested on Monday on suspicion of misconduct in public office and has been released under investigation. He denies any wrongdoing regarding his relationship with Jeffrey Epstein.",
        "Content": "The Metropolitan Police has apologised to the Commons Speaker for revealing he was the source of a tip-off relating to the arrest of Lord Mandelson. The force said it had \"inadvertently\" revealed information about why the ex-business secretary had been taken into custody on Monday. Lawyers for Lord Mandelson had claimed the arrest was due to the \"baseless\" claim that he was preparing to flee the country for the British Virgin Islands. Sky News understands officers had originally planned to interview him under caution, without arrest, next month. Some media reports named the source of the flight risk claim as the Lord Speaker, Lord Forsyth. But addressing the Commons before PMQs on Wednesday, Speaker Sir Lindsay Hoyle revealed it was him, saying he had done so \"in good faith, as is my duty and responsibility\". A statement from the Met said it had since apologised to him \"for inadvertently revealing information during an investigation into allegations of misconduct in public office\". Read more from Sky News:Epstein blamed 'Charles' when Andrew lost job Lord Forsyth is to meet the Met on Thursday to ask how he was incorrectly named as the source. Sky News understands he wants to know why the Met didn't correct the reporting and issue an apology. The Met has been approached for comment. Meanwhile, the investigation into Lord Mandelson continues after he was bailed in the early hours of Tuesday. The misconduct in public office probe relates to allegations he passed market-sensitive government information to Jeffrey Epstein when he was in Gordon Brown's government. Lord Mandelson has repeatedly denied any wrongdoing."
    },
    {
        "title": "Cuba says its forces have killed four on US-registered speedboat",
        "description": "The Cuban government says its forces have shot and killed four people on a US-registered speedboat that entered its waters and opened fire on a patrol boat.",
        "url": "https://news.sky.com/story/cuba-says-its-forces-have-killed-four-on-us-registered-speedboat-13512228",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cuba-coast-guard_7175112.jpg?20260225210833",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-25 20:53:00",
        "Headline": "None of the dead or wounded on the speedboat were identified, but Cuba said it was registered in Florida.",
        "Content": "The Cuban government says its forces have shot and killed four people on a US-registered speedboat that entered its waters and opened fire on a patrol boat. It added that six others on the speedboat were injured. The Cuban commander of the border patrol boat was also wounded, according to Cuba's interior ministry. It said the injured were evacuated and are receiving medical attention. The ministry said the incident is under investigation to establish exactly what happened. US secretary of state Marco Rubio said no US government personnel were involved. He added he was awaiting confirmation about whether those in the incident were US citizens, saying: \"We're going to verify information independently and reach our own conclusions.\" The Florida-registered speedboat came within one nautical mile of a channel on Falcones Cay, on Cuba's north coast, when it was approached by five members of a Cuban patrol unit, the interior ministry also said. The crew of the speedboat then opened fire, wounding the commander of the Cuban vessel, the statement added. Florida's attorney general James Uthmeier said he was ordering prosecutors to open a separate investigation with other state and federal law enforcement partners. \"The Cuban government cannot be trusted, and we will do everything in our power to hold these communists accountable,\" he wrote on X. Read more from Sky News:UK records warmest day of the year so farAI is developing so fast it is becoming hard to measure Florida congressman Carlos Gimenez, a Cuban-American former mayor of Miami, demanded an \"urgent\" investigation into what he called a \"massacre\", adding US authorities \"must determine whether any of the victims were US citizens or legal residents\". \"This regime must be relegated to the dustbin of history!\" he wrote on X. None of the dead or wounded on the speedboat were identified, but Cuba said it was registered in Florida and provided the boat's registration number. \"Faced with the current challenges, Cuba reaffirms its commitment ⁠to protecting its territorial waters, based ​on the principle that national defence is a fundamental pillar for ​the Cuban state in safeguarding its sovereignty and stability in the region,\" the interior ministry statement said. It comes amid a time of heightened tensions between the US and Cuba following increased pressure from Donald Trump's administration. The two countries previously collaborated on combating drug smuggling and other crimes, but have ceased to do so. The US has also blocked virtually all oil shipments to the island, piling pressure on its Communist-run government."
    },
    {
        "title": "UK records hottest day of the year so far",
        "description": "The UK has recorded its highest temperature of the year so far - and its hottest February day since 2019.",
        "url": "https://news.sky.com/story/uk-records-hottest-day-of-the-year-so-far-13512122",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-uk-weather-weather_7174853.jpg?20260225155007",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-25 15:40:00",
        "Headline": "Temperatures at Kew Gardens in London hit a 2026 record of 18.6C on Wednesday afternoon.",
        "Content": "The UK has recorded its highest temperature of the year so far - and its hottest February day since 2019. Temperatures at Kew Gardens in London hit 18.6C on Wednesday afternoon, with thermometers in Kent and Suffolk also topping 18C. High Beach in Essex, Northolt in London, and Neatishead in Norfolk all saw temperatures rise above 17C. Some areas experienced higher temperatures than in Barcelona, Spain, and Malta. The sunnier weather comes following a wet start to the year. However, Sky News meteorologist Dr Christopher England said: \"It'll turn cooler from tomorrow, although temperatures will remain above average for most, as a strengthening and increasingly westerly wind brings cloud and rain to most, although the South East looks dry until after dark.\" The mild conditions have been caused by a \"generally southerly flow\" due to low pressure to the west and high pressure to the east, he added. Read more from Sky News:Ex-DJ sold fake plane parts to airlinesHow UK's travel system is changing today The Met Office also said the higher temperatures \"do not signal a sustained shift into genuinely settled spring weather\". Overnight frost and fog are still possible while the overall outlook \"remains changeable\", it added. Recent figures from the UK Centre for Ecology and Hydrology revealed Northern Ireland and the southwest of England had their wettest January on record."
    },
    {
        "title": "What Rachel Reeves could announce in spring statement",
        "description": "Rachel Reeves has insisted her spring statement will be a quiet affair as she wants the autumn budget to be the sole major fiscal event of the year.",
        "url": "https://news.sky.com/story/when-is-rachel-reeves-spring-statement-and-what-will-be-in-it-13512202",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092412.jpg?20251126115927",
        "type": "Home",
        "Author": "Alix Culbertson",
        "Date Published": "2026-02-25 19:25:00",
        "Headline": "The budget last autumn was preceded by a lot of speculation, then large tax rises - but the chancellor is hoping this announcement will be more low-key.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Rachel Reeves has insisted her spring statement will be a quiet affair as she wants the autumn budget to be the sole major fiscal event of the year. The chancellor will deliver her financial update on the afternoon of 3 March in the House of Commons. An exact time has yet to be confirmed, but she is only expected to speak for about 20 minutes, compared with an hour for a budget. Last November's budget was preceded by much speculation, followed by announcements of large tax rises, bringing tax as a share of GDP to an all-time high. But Ms Reeves and the Treasury have said the spring statement - rebranded from the spring budget - will be low-key and no major announcements will be made. She is not even expected to carry her statement in her famous red box. Despite it not being a \"major\" event, the spring statement can influence the government over whether to raise or cut future taxes and spending. Will the OBR be involved in the spring statement? Ms Reeves will outline the latest economic forecasts from the Office for Budget Responsibility (OBR) - which will then be published after the chancellor has delivered her speech. So, despite it being \"low-key\", it will still be a critical moment as it will show what effect the last budget and the government's policies have had. The OBR produces two forecasts a year, which indicate how the economy is expected to perform and if the government is likely to meet the tax and spending rules it has set. The OBR was thrown into the spotlight at the last budget when it accidentally leaked its assessment, therefore revealing the budget - about 40 minutes before Ms Reeves stood up to deliver her announcement. This time, following a security review, the Treasury will publish the OBR's forecast on gov.uk, instead of on the OBR's own website. It will be the first time in the OBR's 16-year history it will not publish a formal assessment of the government's progress towards meeting its fiscal rules. However, this will be enough for economists to figure out the size of the chancellor's headroom, which could have an impact on the economy. Read more:Record-breaking budget surplus as tax income risesBudget 2025 - the key points at a glance Will Rachel Reeves raise taxes? The chancellor has said she will not be making any major announcements, but she could make minor changes to tax policy. However, this could be politically risky as she could then be accused of deploying stealth taxes. It would also open her up to attacks from opposition parties - and, as seen before, potentially from her own party. What is the current state of the UK economy? Despite inflation falling sharply, the UK economy remains fragile, and inflation (currently at 3%) is still above the Bank of England's target of 2%. There are also concerns about growth, with the UK's GDP growing just 0.1% in the last three months of 2025 - but it grew by 1.3% over the whole of 2025. Unemployment has reached its highest level since 2021, increasing to 5.2% in the three months to December 2025. The unemployment rate among 16 to 24-year-olds across that period was 16.1%, the highest since 2014, according to ONS data. But when it comes to wages, they are continuing to grow, with annual growth in weekly earnings in the last quarter of 2025, excluding bonuses, rising by 4.2%. There was an increase in tax receipts due to the government previously raising taxes, which created a £30.4bn government budget surplus in January - £15.9bn more than the year before and the highest (without adjustment for inflation) since monthly records began in 1993."
    },
    {
        "title": "EU not doing enough to stop Russian shadow fleet, European Parliament president says",
        "description": "The EU is not doing enough to stop Russia's shadow fleet from transporting sanctioned oil, the president of the European Parliament admitted.",
        "url": "https://news.sky.com/story/eu-not-doing-enough-to-stop-russian-shadow-fleet-european-parliament-president-says-13512277",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/cd2b1d6be3c48dd2d184b48099c555f4d4cbbc141f8a9091289d377af8c12a70_7175195.jpg?20260225223636",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-25 22:17:00",
        "Headline": "Roberta Metsola told Sky News the bloc needs to cooperate more to make sure ships carrying illegal goods do not continue to sail through European waters.",
        "Content": "The EU is not doing enough to stop Russia's shadow fleet from transporting sanctioned oil, the president of the European Parliament admitted. Roberta Metsola told Sky News's The World With Yalda Hakim the bloc needs to cooperate more to make sure ships carrying illegal goods do not continue to sail through European waters. \"We still have to do more on the shadow fleet, with more vessels that need to be impounded,\" she said. Russia uses its shadow fleet to export large quantities of crude oil despite Western sanctions. Ms Metsola said while the EU had hit Russia with 19 packages of sanctions, more were needed. She admitted European countries are continuing to fund Russia's war by buying oil and gas, saying it was \"unacceptable\". \"For us, any possibility for Russia to continue to wage its war against Ukraine and against Europe as a whole, by using funds that could inadvertently or overtly come from the European Union, is unacceptable,\" she added. Ms Metsola said the EU placed sanctions to prevent Russian gas from being bought inside the EU or imported via other countries in cheaper or different forms, and is edging closer to banning oil to the same extent. Read more:On the trail of Putin's 'shadow fleet'Russia killed Alexei Navalny with frog poison Asked if there was a plan to seize vessels operating in Russia's shadow fleet, Ms Metsola said: \"We have seen a lot of work, jointly, on this shadow fleet. It's not solved yet. There are a lot of vessels that continue to operate.\" She said ships had been identified quickly changing their flags, changing their registration from one jurisdiction to another \"in an illegal manner\" - but admitted \"we need to be faster\". \"I think we are doing well, but we need to do better,\" she said. Sky News tracked dozens of Russian tankers loaded with sanctioned oil sailing between Britain and France. The vessels carrying Russian oil worth around $100m (£74.1m) cruised through the Channel in defiance of Western sanctions. Tankers the Rigel, the Hyperion and the Kousai were followed from the Gulf of Finland, where they had been loaded with oil at Russian Baltic ports, as they passed the narrowest point of the Dover Straits. These ships were part of a \"shadow fleet\" of up to 800 vessels that kept the oil revenues funding the war in Ukraine. This week marked the fourth anniversary of Vladimir Putin's full-scale invasion of Ukraine. Peace talks between negotiators from Russia, Ukraine and the US are being held in Abu Dhabi."
    },
    {
        "title": "Shocking allegations of bullying, racism, and undignified births revealed in damning maternity report",
        "description": "An interim report into maternity and neonatal services across England has uncovered shocking allegations of racism, bullying, crumbling infrastructure, and births in undignified circumstances.",
        "url": "https://news.sky.com/story/shocking-allegations-of-bullying-racism-and-undignified-births-revealed-in-damning-maternity-report-13512175",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maternity-baby-birth_7106785.jpg?20251210192007",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-25 17:19:00",
        "Headline": "Maternity and neonatal services in England \"are failing too many women, babies, families and staff\", the chair Baroness Amos says.",
        "Content": "An interim report into maternity and neonatal services across England has uncovered shocking allegations of racism, bullying, crumbling infrastructure, and births in undignified circumstances. Some families said that baby deaths were being misclassified to prevent further investigation. Baroness Amos, who is leading a national investigation into maternity care, said: \"Maternity and neonatal services in England are failing too many women, babies, families, and staff.\" Investigators spoke to hundreds of harmed families and staff across 12 NHS trusts in England, many of whom shared shocking accounts of their experiences. Some families alleged in the report that their babies were designated stillborn instead of dying after birth. \"They felt the system incentivised the recording of deaths as stillbirths as this prevents the case from being investigated by a coroner,\" the report said. Jack and Sarah Hawkins, whose daughter Harriet was stillborn, were not part of the Amos investigation, but have fought to get a separate inquiry launched for bereaved and harmed families in Nottingham. Jack said: \"We have met a number of people and heard reports from a number of people whose babies they say were born alive and who the hospital say were born dead. \"And that is a horrific position, a horrific thing to say, and yet of course we believe the victims, not the NHS, who have shown themselves to be sparing with the truth around some of these issues.\" Neither supported Baroness Amos' inquiry. Sarah said it \"isn't going to change anything\". 'There needs to be a public inquiry' \"Families just want accountability and this report is not going to bring accountability,\" she said. \"There needs to be a statutory public inquiry and some form of justice. Because if your child died in any other circumstance in life, you would get justice. People would be held to account. \"Yet in maternity services, it doesn't happen like that and that is so unfair.\" Royal correspondent The flaws highlighted in this report are depressingly familiar. Racism, bullying, cover-ups. And a burnt out workforce delivering babies in dilapidated buildings with a lack of compassion and care. Little surprise Baroness Amos asks how this can be regarded as acceptable in 2026. She knows how bad things are. She's spent the last six months speaking to hundreds of families including those bereaved and harmed. She's met MPs, visited hospitals at the centre of scandals, and spoken to staff. Her interim findings paint a picture of persistent failings. But it’s the details that are most disturbing. Shocking stereotypes with Asian women deemed \"princesses\", and black women as having \"tough skin\" and \"able to tolerate pain\". How one woman was told she was too fat to have children. And when things go wrong, there's a lack of transparency compounding parents’ suffering, leaving litigation often their only option. Maternity units have become toxic environments for some staff with \"racist and bullying behaviour\" from colleagues that isn't dealt with by managers.  And in one hospital staff on a labour ward include weather reports in their handover, because of leaks when it rains. This report says a lot about the state of maternity services. But for many, it's nothing new. We already know what's going wrong, as numerous investigations have uncovered.  The real test will come with the publication of Baroness Amos's final report and whether her recommendations can bring the lasting change that's so desperately needed. Read more on Sky News:Trust fined over baby deathsBirth stories - mothers ignored and neglected The National Maternity and Neonatal Investigation (NMNI) in England was set up by Health Secretary Wes Streeting in June after he met families harmed by poor maternity care. In her initial report released in December, Ms Amos said \"nothing prepared her\" for the amount of \"unacceptable care\" families currently receive. Investigators have met more than 400 family members and heard from over 8,000 people, including NHS staff."
    },
    {
        "title": "Epstein blamed 'Charles' on day Andrew lost UK trade envoy job",
        "description": "Jeffrey Epstein blamed \"Charles\" on the day Andrew Mountbatten-Windsor lost his UK trade envoy job.",
        "url": "https://news.sky.com/story/epstein-blamed-charles-on-day-andrew-lost-uk-trade-envoy-job-13512177",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-andrew-mountbatten-windsor_7174997.jpg?20260225184244",
        "type": "UK",
        "Author": "Sarah Hajibagheri, news editor",
        "Date Published": "2026-02-25 17:39:00",
        "Headline": "On 21 July 2011 Epstein wrote, \"I assume he knows that this is Charles' doing\".",
        "Content": "By Sarah Hajibagheri, news editor  Jeffrey Epstein blamed \"Charles\" on the day Andrew Mountbatten-Windsor lost his UK trade envoy job. On 21 July 2011, the day it was announced that the former prince would step down from the role, Epstein wrote, \"I assume he knows that this is Charles doing\". The email was in response to a message from an associate, who said: \"Lots of TV coverage on PA and always big feature on you. Insane.\" Sky News believes PA refers to Prince Andrew. The former prince served as the UK's special representative for international trade and investment between 2001 and 2011. The role gave him access to senior government and business contacts around the world. He stepped back from the role amid increasing scrutiny and criticism about his continued relationship with the US financier and convicted sex offender. A photo of the two men walking in New York made headlines in the months ahead of him stepping down. Read more from Sky News:UK records hottest day of the year so farAI developing so fast it is becoming hard to measure The three million files released by the US Department of Justice provide a glimpse into fragments of personal conversations that were occurring when Andrew and Epstein's relationship was making headlines 15 years ago. The convicted sex offender had been emailing friends about the news Andrew had lost his official trade role all day. Epstein said, in another email about the news, \"I'm sure this is good for him, he will now be free\". He also sent a news article about Andrew stepping down to Ghislaine Maxwell, who asked, \"why?\" Epstein responded, \"I think he wants to make money\". Andrew Mountbatten-Windsor was arrested on suspicion of misconduct in public office on his 66th birthday. After 11 hours of questioning, he was released under investigation. Last week in a statement, the King stressed that Buckingham Palace would help the police if it was approached as part of the investigation. He wrote: \"What now follows is the full, fair and proper process by which this issue is investigated in the appropriate manner and by the appropriate authorities. \"In this, as I have said before, they have our full and wholehearted support and co-operation. Let me state clearly: the law must take its course. \"As this process continues, it would not be right for me to comment further on this matter.\" Andrew Mountbatten-Windsor has always denied any wrongdoing."
    },
    {
        "title": "Met Police apologises to Commons Speaker over Lord Mandelson tip-off",
        "description": "The Metropolitan Police has apologised to the Commons Speaker for revealing he was the source of a tip-off relating to the arrest of Lord Mandelson.",
        "url": "https://news.sky.com/story/met-police-apologises-to-commons-speaker-over-lord-mandelson-tip-off-13512284",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsay-hoyle-speaker_7175217.jpg?20260225231852",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-25 23:01:00",
        "Headline": "Lord Mandelson was arrested on Monday on suspicion of misconduct in public office and has been released under investigation. He denies any wrongdoing regarding his relationship with Jeffrey Epstein.",
        "Content": "The Metropolitan Police has apologised to the Commons Speaker for revealing he was the source of a tip-off relating to the arrest of Lord Mandelson. The force said it had \"inadvertently\" revealed information about why the ex-business secretary had been taken into custody on Monday. Lawyers for Lord Mandelson had claimed the arrest was due to the \"baseless\" claim that he was preparing to flee the country for the British Virgin Islands. Sky News understands officers had originally planned to interview him under caution, without arrest, next month. Some media reports named the source of the flight risk claim as the Lord Speaker, Lord Forsyth. But addressing the Commons before PMQs on Wednesday, Speaker Sir Lindsay Hoyle revealed it was him, saying he had done so \"in good faith, as is my duty and responsibility\". A statement from the Met said it had since apologised to him \"for inadvertently revealing information during an investigation into allegations of misconduct in public office\". Read more from Sky News:Epstein blamed 'Charles' when Andrew lost job Lord Forsyth is to meet the Met on Thursday to ask how he was incorrectly named as the source. Sky News understands he wants to know why the Met didn't correct the reporting and issue an apology. The Met has been approached for comment. Meanwhile, the investigation into Lord Mandelson continues after he was bailed in the early hours of Tuesday. The misconduct in public office probe relates to allegations he passed market-sensitive government information to Jeffrey Epstein when he was in Gordon Brown's government. Lord Mandelson has repeatedly denied any wrongdoing."
    },
    {
        "title": "UK records hottest day of the year so far",
        "description": "The UK has recorded its highest temperature of the year so far - and its hottest February day since 2019.",
        "url": "https://news.sky.com/story/uk-records-hottest-day-of-the-year-so-far-13512122",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-uk-weather-weather_7174853.jpg?20260225155007",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-25 15:40:00",
        "Headline": "Temperatures at Kew Gardens in London hit a 2026 record of 18.6C on Wednesday afternoon.",
        "Content": "The UK has recorded its highest temperature of the year so far - and its hottest February day since 2019. Temperatures at Kew Gardens in London hit 18.6C on Wednesday afternoon, with thermometers in Kent and Suffolk also topping 18C. High Beach in Essex, Northolt in London, and Neatishead in Norfolk all saw temperatures rise above 17C. Some areas experienced higher temperatures than in Barcelona, Spain, and Malta. The sunnier weather comes following a wet start to the year. However, Sky News meteorologist Dr Christopher England said: \"It'll turn cooler from tomorrow, although temperatures will remain above average for most, as a strengthening and increasingly westerly wind brings cloud and rain to most, although the South East looks dry until after dark.\" The mild conditions have been caused by a \"generally southerly flow\" due to low pressure to the west and high pressure to the east, he added. Read more from Sky News:Ex-DJ sold fake plane parts to airlinesHow UK's travel system is changing today The Met Office also said the higher temperatures \"do not signal a sustained shift into genuinely settled spring weather\". Overnight frost and fog are still possible while the overall outlook \"remains changeable\", it added. Recent figures from the UK Centre for Ecology and Hydrology revealed Northern Ireland and the southwest of England had their wettest January on record."
    },
    {
        "title": "Stepdad jailed for killing partner's five-month-old baby after argument with his ex-girlfriend",
        "description": "A stepdad has been jailed for life for shaking his partner's baby to death after flying into a rage while arguing with a previous ex-girlfriend.",
        "url": "https://news.sky.com/story/stepdad-jailed-for-killing-partners-five-month-old-baby-after-argument-with-his-ex-girlfriend-13512017",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jensen-lee-dougal-thomas-morgan_7174770.jpg?20260225140736",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-25 13:04:00",
        "Headline": "Thomas Morgan had been in a relationship with Jensen-Lee's mother when he launched his \"extremely violent attack\" while she was at work.",
        "Content": "A stepdad has been jailed for life for shaking his partner's baby to death after flying into a rage while arguing with a previous ex-girlfriend. Thomas Morgan, 29, left little Jensen-Lee Dougal with \"catastrophic\" brain damage at the family home in Swansea after a row with his ex-girlfriend while the baby's mother was at work. At Swansea Crown Court on Wednesday, Judge Mary Stacey said Morgan had shaken Jensen-Lee in a violent attack that left him with extensive injuries, then lied about what happened. Jailing him for at least 19 years, she said: \"The violent shaking with Jensen-Lee's head moving back and forward quickly accelerating and decelerating may have been very brief but it was hard enough to cause his extensive internal head injuries that caused his death.\" The court previously heard the baby died in hospital after suffering severe brain damage, numerous fractures and extensive retinal bleeding to both of his eyes. Morgan had been in a relationship with Jensen-Lee's mother, Jordan Dougal, and was treated as the baby's stepfather at the time of the murder. Caroline Rees KC, prosecuting, said Morgan \"seriously abused the trust placed in him\" when he carried out the \"extremely violent attack\" on Jensen-Lee on 30 March 2024, the day before he died. \n                  Ex-techno DJ jailed for selling £7m worth of fake plane parts to airlines\n                 \n                  British cousins charged with attempted murder over Venice Valentine's Day stabbing\n                 \n                  'Britain's youngest female double murderer' approved for open prison move\n                 Morgan had a heated dispute with his former partner, Georgia Griffiths, earlier that day and was left alone with the infant while the baby's mother went to work. Ms Rees told the jury Morgan was \"full of rage\" following the row with Ms Griffiths over text message. She told the court: \"It is clear that this abusive exchange had flipped some kind of switch in Thomas Morgan. \"By the time he was alone with Jenson-Lee, he was angry and aggressive and in no state of mind to be caring for a young baby on his own.\" Read more from Sky News:The Ukrainian who swapped Wall Street for the frontlineStarmer concerned after 'serious incident' at Manchester mosque While at work, Ms Dougal got a call from Morgan telling her the baby was choking and had stopped breathing.The five-month-old was rushed to hospital but found to have a \"devastating\" brain injury and was taken off life support the following day. Morgan denied inflicting serious injuries on Jensen-Lee and said he tried to save the baby after he fell ill in his care, believing he had choked on his own sick. But he was found guilty of murder and causing grievous bodily harm with intent after a trial at Swansea Crown Court. Mrs Justice Stacey sentenced Morgan, of Gorseinon, Swansea, to life imprisonment, with a minimum term of 19 years. In a statement after the sentencing, Jensen-Lee's mother Jordan said: \"Since Jensen-Lee's death, my life has been permanently changed. I live with overwhelming grief, trauma and emotional pain. \"I never had the chance to hear Jensen-Lee say he loved me. I will never hear him call me 'mammy'. I will never see him take his first steps, speak his first words, start school, or grow into the person he was meant to be. \"Due to what Thomas Morgan did, I have also received a life sentence, but mine is one of grief.\""
    },
    {
        "title": "Man with axe arrested at mosque in 'serious security incident'",
        "description": "A man has been arrested after allegedly entering a mosque in Manchester with an axe in his bag during Ramadan prayers.",
        "url": "https://news.sky.com/story/starmer-concerned-after-serious-incident-at-manchester-mosque-13511949",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mosque-manchester_7174804.jpg?20260225145324",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-25 11:33:00",
        "Headline": "Police said no one was hurt and there was no suggestion of any threats being made following the incident at Manchester Central Mosque on Tuesday night.",
        "Content": "A man has been arrested after allegedly entering a mosque in Manchester with an axe in his bag during Ramadan prayers. The suspect, a white man in his 50s, went into Manchester Central Mosque in the Victoria Park area around 8.30pm on Tuesday, police said. He was wearing hi-vis clothing and was said to have had an axe, a knife and a hammer with him. Greater Manchester Police (GMP) said no one was injured and no threats were made. The force said it had not declared it a terrorist incident, but was working with counter-terrorism police to investigate. The suspect is being held on suspicion of possessing an offensive weapon and class B drugs. Police are searching for a second man, a black male, who is believed to have been with the suspect but left before officers arrived. The chairman of the mosque said volunteers had kept the suspect talking until police arrived and arrested him. Hammad Khan said the man was \"very calm\" and had been spotted visiting the mosque before. However, after entering the building on Tuesday, an axe was spotted in his bag, and he was ushered into an office by volunteers and the police were called. Mr Khan said: \"His demeanour was very calm. \"He wasn't under the influence of anything at all. I also understand he was also carrying some other materials with him relating to World War Two, also some newspaper cuttings, which the police have. \"The volunteers obviously kept the conversation going in a very amenable way to ensure the situation did not escalate in any way.\" The mosque described it as a \"serious security incident\". Police said an off-duty special constable, who was part of the congregation, phoned police and officers responded within 15 minutes. 'Worrying for Muslim communities' In a post on X, Sir Keir Starmer said: \"I am concerned to hear of the incident at Manchester Central Mosque last night. I know this will be worrying for Muslim communities, especially during Ramadan, a time of peace and reflection. \"My thanks go to the volunteers and emergency services for their quick response. \"We have provided up to £40m funding for additional security at mosques, Muslim schools and community centres, and will continue to act to ensure communities are able to live without fear.\" 'Concerning incident' Speaking outside the mosque on Wednesday evening, GMP's Assistant Chief Constable John Webster said: \"Last night, a concerning incident took place here at Manchester Central Mosque. \"A man with a bag containing an axe was acting suspiciously, during a congregation involving hundreds of worshippers... \"There was no suggestion of verbal threats or confrontation, but it's really important the security staff here and volunteers acted on their suspicions, on their instincts, to call us. I thank them for their actions.\" He added: \"This is a time where Muslims come together to observe Ramadan. They should feel safe in their place of worship. We do give places of worship increased attention during this period, as we do with all religious festivals.\" Mr Webster said officers were increasing patrols \"to offer security and reassurance to our Muslim community\" and said officers would be on 12-hour shifts to do so. He added: \"There is an ongoing police investigation, and we are working to locate the second suspicious man to understand who he is and what he was doing at the mosque. \"We're still questioning the detained man to understand what he was doing here with an axe in his bag.\" Read more from Sky News:Ex-DJ sold fake plane parts to airlinesUK to be warmer than Malta and BarcelonaHow UK's travel system is changing today Volunteers 'played crucial role in containing situation' In a statement, the mosque said the UK's Muslim community had \"experienced a notable rise in threats and hostility over recent years\". It added: \"The increase in Islamophobic incidents is a serious concern, and greater resources are urgently needed to address this growing and real risk. \"Congregants are advised to travel in groups where possible and to ensure that children are not left unattended. \"The swift and responsible actions of our volunteers played a crucial role in containing the situation. Without their intervention, the consequences could have been far more serious.\" Afzal Khan, the local MP for Rusholme, also said he was \"deeply concerned\" about the incident. He said: \"Just this week, the chancellor and home secretary announced more funding for protecting mosques, and this incident demonstrates once again why this funding is so vital.\" Police are appealing for witnesses to help with their enquiries."
    },
    {
        "title": "First migrants reach UK in two weeks after crossing Channel",
        "description": "Migrants have crossed the English Channel and reached the UK for the first time in two weeks.",
        "url": "https://news.sky.com/story/first-migrants-reach-uk-after-crossing-channel-in-two-weeks-13512119",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ramsgate-kent-migrants_7174823.jpg?20260225151908",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-25 15:38:00",
        "Headline": "People in lifejackets and coats were seen disembarking a Border Force boat in Ramsgate, Kent, on Wednesday.",
        "Content": "Migrants have crossed the English Channel and reached the UK for the first time in two weeks. People in life jackets and coats were seen disembarking a Border Force boat in Ramsgate, Kent, on Wednesday. A break in the recent bout of poor weather allowed for the launching of several crossing attempts, reports have suggested. Some 74 migrants arrived on Tuesday, according to Home Office data. It was the first crossing since 9 February, which saw 322 people reach the UK. So far this month 597 migrants have crossed the Channel. Read more from Sky News:On the trail of Putin's 'shadow fleet' in the English ChannelStarmer 'concerned' after man with axe arrested at mosque It comes after an inquiry into the deadliest Channel crossing on record said small boat crossings \"must end\" in order to prevent further deaths. A crowded inflatable boat had capsized overnight on 23/24 November 2021, leaving just two survivors who were found in French waters nearly 12 hours after the first mayday. The independent probe, led by Sir Ross Cranston and costing more than £7m, identified 27 men, women and children among the dead, while four are still missing, and said \"some of those deaths were avoidable\". The inquiry found \"systemic failures, missed opportunities\" and \"chronic staff shortages\" in the UK's maritime response contributed directly to the failure to rescue people."
    },
    {
        "title": "Cuba says its forces have killed four on US-registered speedboat",
        "description": "The Cuban government says its forces have shot and killed four people on a US-registered speedboat that entered its waters and opened fire on a patrol boat.",
        "url": "https://news.sky.com/story/cuba-says-its-forces-have-killed-four-on-us-registered-speedboat-13512228",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cuba-coast-guard_7175112.jpg?20260225210833",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 20:53:00",
        "Headline": "None of the dead or wounded on the speedboat were identified, but Cuba said it was registered in Florida.",
        "Content": "The Cuban government says its forces have shot and killed four people on a US-registered speedboat that entered its waters and opened fire on a patrol boat. It added that six others on the speedboat were injured. The Cuban commander of the border patrol boat was also wounded, according to Cuba's interior ministry. It said the injured were evacuated and are receiving medical attention. The ministry said the incident is under investigation to establish exactly what happened. US secretary of state Marco Rubio said no US government personnel were involved. He added he was awaiting confirmation about whether those in the incident were US citizens, saying: \"We're going to verify information independently and reach our own conclusions.\" The Florida-registered speedboat came within one nautical mile of a channel on Falcones Cay, on Cuba's north coast, when it was approached by five members of a Cuban patrol unit, the interior ministry also said. The crew of the speedboat then opened fire, wounding the commander of the Cuban vessel, the statement added. Florida's attorney general James Uthmeier said he was ordering prosecutors to open a separate investigation with other state and federal law enforcement partners. \"The Cuban government cannot be trusted, and we will do everything in our power to hold these communists accountable,\" he wrote on X. Read more from Sky News:UK records warmest day of the year so farAI is developing so fast it is becoming hard to measure Florida congressman Carlos Gimenez, a Cuban-American former mayor of Miami, demanded an \"urgent\" investigation into what he called a \"massacre\", adding US authorities \"must determine whether any of the victims were US citizens or legal residents\". \"This regime must be relegated to the dustbin of history!\" he wrote on X. None of the dead or wounded on the speedboat were identified, but Cuba said it was registered in Florida and provided the boat's registration number. \"Faced with the current challenges, Cuba reaffirms its commitment ⁠to protecting its territorial waters, based ​on the principle that national defence is a fundamental pillar for ​the Cuban state in safeguarding its sovereignty and stability in the region,\" the interior ministry statement said. It comes amid a time of heightened tensions between the US and Cuba following increased pressure from Donald Trump's administration. The two countries previously collaborated on combating drug smuggling and other crimes, but have ceased to do so. The US has also blocked virtually all oil shipments to the island, piling pressure on its Communist-run government."
    },
    {
        "title": "'We are not out of the woods': Why democracy in the US is being tested",
        "description": "<a href=' https://podfollow.com/the-world-with-richard-and-yalda'>👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈</a>",
        "url": "https://news.sky.com/story/we-are-not-out-of-the-woods-why-democracy-in-the-us-is-being-tested-13512157",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yalda-hakim-the-world_7085303.jpg?20251118182005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 16:38:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Ken Burns is one of America's most successful documentary filmmakers. Ahead of the 250th anniversary of American independence later this year, he sits down with Yalda in this extra episode to reflect on where the US has come from, as well as the current state of the nation. Burns has been making films for more than 40 years, winning Emmys and Grammys, and has even had a film effect named after him - \"the Ken Burns\". His most recent project is a six-part series on the American Revolution that took Burns and his team at PBS 10 years to make. He also talks to Yalda about why he chose this project, the process of making it and why he fears for the current state of America under Donald Trump. You can also watch the podcast on our YouTube channel here. Do you have a question for Richard and Yalda? Write to them at theworld@sky.uk "
    },
    {
        "title": "Pair charged with alleged murder of 'mistakenly-kidnapped' pensioner Chris Baghsarian in Sydney",
        "description": "Two men have been charged with the alleged kidnap and murder of a pensioner in Sydney.",
        "url": "https://news.sky.com/story/pair-charged-with-alleged-murder-of-mistakenly-kidnapped-pensioner-chris-baghsarian-in-sydney-13512123",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kenthurst-castle-hill_7174952.png?20260225174126",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 15:47:00",
        "Headline": "Detectives in New South Wales have been searching for Chris Baghsarian, 85, since his alleged kidnap on 13 February from his home in North Ryde, a suburb in the northwest of Sydney.",
        "Content": "Two men have been charged with the alleged kidnap and murder of a pensioner in Sydney. Police said the pair are due in court on Thursday in connection with the disappearance of Chris Baghsarian, 85, whose remains were discovered on Tuesday. The New South Wales (NSW) Police Force said that just after 5am on 13 February, they received a report that Mr Baghsarian had been kidnapped from his home in the suburb of North Ryde, around 9 miles (15km) northwest of Sydney city centre. In a statement on Wednesday, police said: \"Early inquiries established that Chris Baghsarian was not the intended target of the kidnapping and had been taken in a case of mistaken identity.\" \"Human remains confirmed as being Mr Baghsarian were located about 8am yesterday (Tuesday 24 February 2026) near a golf club in Pitt Town,\" the force added. At about 6.30am on Wednesday, detectives supported by the Raptor Squad, which targets serious and organised crime, carried out three search warrants in Kenthurst, Castle Hill and Lake Macquarie. Footage of the operation shows officers forcing their way into two properties and two men being arrested. \n                  Palace unlikely to push back against calls to remove Andrew from line of succession\n                 \n                  Andrew Mountbatten-Windsor: Australia and New Zealand back plans to remove him from line of succession\n                 \n                  'We won't repatriate them': Australia's PM refuses to accept IS-linked families from Syria\n                 A 29-year-old man was shown in handcuffs leaving a house in Kenthurst, and in Castle Hill, police detained a 24-year-old man. Officers also seized vehicles, electronics and clothing. Read more from Sky News:Man jailed after stabbing girlPayouts for Swiss bar fire victimsTracking Putin's 'shadow fleet' Police from the State Crime Command's Robbery and Serious Crime Squad carried out the investigation. Officers established Strike Force Chobat, specifically to coordinate the response to recover the 85-year-old. Both men were charged with murder and kidnapping and refused bail. They are due to appear in Blacktown Local Court on Thursday."
    },
    {
        "title": "World Cup fans visiting Mexico face 'no risk' after cartel violence, says president",
        "description": "Mexico's president has insisted there is \"no risk\" to fans coming to the country for the 2026 FIFA World Cup, after the killing of a cartel boss sparked days of violence.",
        "url": "https://news.sky.com/story/world-cup-fans-visiting-mexico-face-no-risk-after-cartel-violence-says-president-13511873",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-claudia-scheinbaum_7127280.jpg?20260105152705",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 09:20:00",
        "Headline": "Guadalajara is due to host four of the 2026 World Cup matches, with Mexico City and Monterrey hosting nine others.",
        "Content": "Mexico's president has insisted there is \"no risk\" to fans coming to the country for the 2026 FIFA World Cup, after the killing of a cartel boss sparked days of violence. Claudia Sheinbaum said on Tuesday that \"all the guarantees\" for safety were in place for the tournament, which will see Mexico host 13 of 104 World Cup matches. Nemesio Ruben Oseguera Cervantes, the head and founder of the Jalisco New Generation Cartel, was killed in the state of Jalisco on Sunday by Mexico's military as they tried to detain him. His death led to widespread retaliatory violence by Oseguera Cervantes loyalists, especially in Jalisco state, where the group is based and derives its name. Some 70 people died in the operation and violence that erupted after it, which led to multiple airlines suspending flights to parts of the country. Guadalajara, the state's capital, is due to host four of the 2026 World Cup matches, with Mexico City and Monterrey hosting the others. Jalisco's governor Pablo Lemus said: \"There is absolutely no intention on FIFA's part to remove any venues from Mexico. The three venues remain completely firm.\" \n                  Mexico's President Claudia Sheinbaum presses charges after groping incident\n                 \n                  Mexico election: Claudia Sheinbaum set to become country's first woman president\n                 FIFA President Gianni Infantino told reporters on Tuesday he was feeling \"very calm\" about Mexico's hosting this summer's tournament. \"Everything is going to be spectacular,\" he said. A spokesperson for FIFA said the organisation was closely monitoring the situation and was in close contact with the authorities. Mexico's leader said during her daily morning press conference that the situation was normalising, with security forces working to safeguard the public. Read more from Sky News:Trump's three options for IranFamily of Nancy Guthrie offer $1m reward Ms Sheinbaum, Mexico's first female president, is widely seen as the political protege of former Mexican President Andres Manuel Lopez Obrador. Until now, she has largely followed his so-called \"hugs not bullets\" non-confrontational security strategy, which prioritises alleviating poverty and other root causes of violence. Asked whether the killing of Oseguera Cervantes marked a break from that policy, Sheinbaum said this would never be the case. \"The detention of a suspected criminal with an arrest warrant can generate this type of circumstance, but we are looking for peace, not war,\" she said. The arrests of other top cartel figures in Sinaloa state have, in recent years, also triggered cartel retaliation, including shootouts and vehicles set on fire."
    },
    {
        "title": "Inside the Mexican villa where feared drug lord 'El Mencho' spent final hours",
        "description": "The notorious Mexican drug lord \"El Mencho\" spent his final hours in a luxury villa with spacious rooms and manicured gardens - before being killed in an operation to capture him.",
        "url": "https://news.sky.com/story/inside-the-mexican-villa-where-feared-drug-lord-el-mencho-spent-final-hours-13511954",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-el-mencho-nemesio-oseguera_7174468.jpg?20260225083843",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 11:45:00",
        "Headline": "Nemesio Ruben Oseguera Cervantes was the leader of the Jalisco New Generation Cartel, one of Mexico's most powerful criminal organisations.",
        "Content": "The notorious Mexican drug lord \"El Mencho\" spent his final hours in a luxury villa with spacious rooms and manicured gardens - before being killed in an operation to capture him. The feared drug trafficker, whose real name is Nemesio Ruben Oseguera Cervantes, was injured in a military operation carried out by Mexican special forces on Sunday. The 59-year-old leader of the Jalisco New Generation Cartel, which is one of the nation's most powerful criminal organisations, later died while being flown to Mexico City. Pictures have emerged showing inside the villa located at the exclusive Tapalpa Country Club of weekend holiday homes, in the hills of Mexico's western state of Jalisco. 'El Mencho' killing - as it happened  The exclusive gated area was where Oseguera Cervantes was spending time at the moment he was ambushed. The two-floor home at number 39 has stone walls and a red-tiled roof, which provided a discreet hideout. The images give a hint of the lifestyle of Oseguera Cervantes, showing rooms with sleek modern finishes and large windows - but also a messy kitchen, medicines and religious items. In the kitchen, there are takeaway containers, mugs and other food items abandoned across the surface. There are bottles and cartons of sriracha hot sauce, milk and water. A wardrobe in a large bedroom has some neatly folded clothes and there are skincare products and perfume on a shelf. Several containers of baby wipes were in a lower drawer. Cabinets in one room were packed with treatments for a number of health conditions. They included medicines for migraines, insomnia, acid reflux and fungal infections. Vials of Tationil Plus, an antioxidant marketed for cellular protection, were found next to a dosage schedule in a freezer. There was a cloth with a logo of Mayorquin, a high-end jewellery boutique based in Jalisco's capital, Guadalajara. Religious items were pictured on a makeshift altar. Figurines of Catholic saints included Mexico's patroness, the Virgin of Guadalupe, and the patron of lost causes, Saint Jude Thaddeus. A Bible passage asserting trust in God was handwritten on a white sheet of paper. Oseguera Cervantes had tried to escape through the back garden of his home to a wooded hillside. He was hit by gunfire during the pursuit and died of his injuries while being airlifted away, Mexican authorities said."
    },
    {
        "title": "Switzerland bar fire victims to receive one-off payment",
        "description": "Switzerland said it would make a one-off payment of 50,000 Swiss francs (&#163;47,755) to severely injured survivors and bereaved families of the New Year bar fire in Crans-Montana. ",
        "url": "https://news.sky.com/story/switzerland-to-make-one-off-payment-to-bar-fire-victims-13512004",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-switzerland-fire_7174731.jpg?20260225132710",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 12:53:00",
        "Headline": "The blaze killed 41 people and injured 115 more, according to Swiss authorities.",
        "Content": "Switzerland said it would make a one-off payment of 50,000 Swiss francs (£47,755) to severely injured survivors and bereaved families of the New Year bar fire in Crans-Montana.  The blaze killed 41 people and injured 115 more, according to Swiss authorities. The fire appeared to have been started by the use of sparkling candles that ignited foam soundproofing on the bar's basement ceiling, witnesses and prosecutors said. Most of those who died were teenagers, and many were foreigners, including several from France and Italy. The so-called solidarity contribution aims to provide swift financial support to victims and serve as a gesture of compassion, Switzerland's governing Federal Council said. In principle, the payment should apply to each individual who lost their life, as well as every person who was taken to hospital, the Federal Council said in a statement. \"The Federal Council shares with the victims and their families the desire for truth and justice,\" Swiss President Guy Parmelin said at a news conference. \"We too want to know what happened, why, and how it could have been prevented.\" Read more from Sky News: Trump's plan for Iran isn't working - he has three optionsMeet the Ukrainian who swapped Wall Street for the frontline The Federal Council said it will also convene a roundtable to help victims, insurers and authorities reach out-of-court settlements, potentially avoiding lengthy legal battles. It aims to contribute up to 20m francs to such settlements. The Federal Council said it hoped parliament would swiftly expedite the legislation it had drafted to help victims. The government also aims to set aside 8.5 million francs to help affected cantons cover the huge costs. The government said it had taken the steps following Federal Office of Justice analysis that found gaps in existing support systems, which are mostly designed for individual cases and struggle with large-scale disasters."
    },
    {
        "title": "AI is developing so fast it is becoming hard to measure, experts say",
        "description": "Some days it can seem as if the whole of the tech world is hanging on the latest update to one graph.",
        "url": "https://news.sky.com/story/ai-is-developing-so-fast-it-is-becoming-hard-to-measure-experts-say-13512068",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ai-artificial-intelligence_7174797.jpg?20260225144459",
        "type": "World",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-02-25 14:08:00",
        "Headline": "Results show AI is getting twice as good at the rate of about every seven months and experts say the trend is speeding up.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n Some days it can seem as if the whole of the tech world is hanging on the latest update to one graph. The graph in question is made by a non-profit research institute called METR and it assesses the software development capacities of different AI models. For many months now, this chart has been provoking excitement and unease in anyone who watches artificial intelligence because it shows a striking exponential trend - that is, a doubling in growth. According to METR, or Model Evaluation and Threat Research, AI is getting twice as good at the startling rate of roughly every seven months. The latest results turned the dial from feverish to panicked, because it showed the trend not just continuing, but actually speeding up. METR tests AIs by assessing their ability to complete longer and longer human software tasks. The latest model it analysed, Anthropic's Claude Opus 4.6, broke all previous records. 'Monstrous leaps' Many in tech compare the situation to the COVID pandemic because of the deceptive way doubling turns from apparently small increases to monstrous leaps. \"Nothing, nothing, nothing, everything,\" was how a UK tech entrepreneur and AI researcher described the situation to me a few months ago, at a time when the METR chart was already looking fairly vertiginous (although, in retrospect, it feels as if we were barely approaching the foothills). The progress since then makes many feel like we are rapidly approaching \"everything\". After the chart's release, one METR researcher sent a note to his old college friends, which he posted on social media, saying: \"I feel very confident now that it's going to be totally insane and chaotic, like many orders of magnitude more chaotic than anything the world has experienced in our lifetimes.\" This isn't even an unusual sentiment in tech right now. The chief executives of leading AI companies make similar statements all the time. 'Ten times the impact of Industrial Revolution' Even Demis Hassabis, the most measured of the AI leaders, regularly says that AI will have 10 times the impact of the Industrial Revolution, in a tenth of the timespan. A widely-shared newsletter responding to the METR chart put it more simply: \"When must I start kicking and screaming at you that it is… happening.\" But what exactly is \"it\"? On closer inspection, it becomes harder to tell. For a start, look at what the METR chart actually measures. Read more:If you have an AI-generated password, you should change it'Humanity is cooked': AIs now have their own social network  The details are technical, but roughly speaking it measures the length of a task that an AI can complete 50% of the time - meaning they fail as often as they succeed. Some way off full automation A business which turned its operations over to an AI which could complete a task half the time wouldn't last very long. Even 80% success - which METR also measures - wouldn't be close enough for anything approaching full automation in a corporate environment. Then there is the precise location of the dots on the chart, which even METR researchers admit they are unsure about. \"We're increasingly nervous about the measurements that we're putting out there,\" said Joel Becker, a member of METR's technical staff, referring to the extremely large range of possible values - the confidence interval - on the group's Claude Opus 4.6 evaluation. \"We don't want to hide behind that. I think that's real uncertainty.\" A key reason behind the uncertainty is that it is increasingly difficult for organisations like METR to find tasks that are hard enough to test the AI properly. That, in itself, tells a story. Nevertheless, with markets moving based on small changes in AI assessments, it is important to remember that a few small tweaks in METR's tests might have changed the result in a meaningful way. The rate of AI progress might be speeding up, but it could just as easily be slowing down. Becker, who said he had stopped paying into a pension since understanding the trend in AI development, told Sky News he believed that AI was not yet able to improve itself, triggering the science fiction fear of an explosion of AI capabilities. Nevertheless, he said that \"it probably is the case today that AI tools are meaningfully speeding up the degree to which AI professionals are able to make progress on building better and better AIs\", which is significant in its own right. \"I want to communicate that the situation is serious, that it's fast-moving, that it appears not to be slowing down, that it is accelerating,\" Becker told Sky News. \"It could be associated with extraordinarily positive possibilities... and on the other side, there may be extraordinary, dangerous things that might follow.\" How is AI affecting employment? At present, employment statistics in the UK and the US show little sign of any impact from AI. Adverts for software engineering jobs on the job search platform Indeed are actually rising. Becker said he thought coders had a future, for a while at least. \"There's all these AI professionals inside the labs, you know, they're doing real work. I imagine they'll keep doing not so similar work for the next year to maybe many more years than that.\" But he cautioned: \"Economic statistics are referring to what happens some number of months ago and not what's happening exactly today. \"And I think some of the extraordinary progress that we've seen, especially in software engineering, but also in other fields, from AIs becoming more capable, has happened only in the past few months.\" The speed of development in AI is so fast now it's becoming extremely hard to measure. That fact alone is extremely significant."
    },
    {
        "title": "King Harald of Norway taken to Tenerife hospital after falling ill on holiday",
        "description": "Norway's King Harald has been taken to hospital after falling ill during a trip to the Canary Islands.",
        "url": "https://news.sky.com/story/king-of-norway-taken-to-tenerife-hospital-after-falling-ill-during-holiday-13511906",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-harald-king_7174568.jpg?20260225105221",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-25 09:42:00",
        "Headline": "The 89-year-old king, the oldest living monarch in Europe, was on a trip with his wife, Queen Sonja, when he became unwell.",
        "Content": "Norway's King Harald has been taken to hospital after falling ill during a trip to the Canary Islands. The 89-year-old, who is the oldest living monarch in Europe, was on holiday in Tenerife with his wife Queen Sonja when he became unwell. The king, who celebrated his birthday on Saturday, was taken to hospital on Tuesday evening suffering from an infection and dehydration. A spokesperson for Norway's Royal Palace said the monarch, who has been the country's ceremonial head of ‌state since 1991, was in a good condition. Norwegian Prime Minister ‌Jonas Gahr Stoere told public broadcaster NRK: \"I wish our king a speedy recovery.\" An update on the king's health is expected to be issued on Wednesday after he is assessed by his personal doctor. Read more from Sky News:Best and worst NHS trusts for cancer revealedHow UK's travel system is changing today King Harald was hospitalised ​in 2024 for an infection ⁠while on holiday in Malaysia, and received a temporary pacemaker at ⁠a hospital there. He was ​later transferred to Norway, where ​a permanent device was implanted."
    },
    {
        "title": "Cuba says its forces have killed four on US-registered speedboat",
        "description": "The Cuban government says its forces have shot and killed four people on a US-registered speedboat that entered its waters and opened fire on a patrol boat.",
        "url": "https://news.sky.com/story/cuba-says-its-forces-have-killed-four-on-us-registered-speedboat-13512228",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-cuba-coast-guard_7175112.jpg?20260225210833",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-25 20:53:00",
        "Headline": "None of the dead or wounded on the speedboat were identified, but Cuba said it was registered in Florida.",
        "Content": "The Cuban government says its forces have shot and killed four people on a US-registered speedboat that entered its waters and opened fire on a patrol boat. It added that six others on the speedboat were injured. The Cuban commander of the border patrol boat was also wounded, according to Cuba's interior ministry. It said the injured were evacuated and are receiving medical attention. The ministry said the incident is under investigation to establish exactly what happened. US secretary of state Marco Rubio said no US government personnel were involved. He added he was awaiting confirmation about whether those in the incident were US citizens, saying: \"We're going to verify information independently and reach our own conclusions.\" The Florida-registered speedboat came within one nautical mile of a channel on Falcones Cay, on Cuba's north coast, when it was approached by five members of a Cuban patrol unit, the interior ministry also said. The crew of the speedboat then opened fire, wounding the commander of the Cuban vessel, the statement added. Florida's attorney general James Uthmeier said he was ordering prosecutors to open a separate investigation with other state and federal law enforcement partners. \"The Cuban government cannot be trusted, and we will do everything in our power to hold these communists accountable,\" he wrote on X. Read more from Sky News:UK records warmest day of the year so farAI is developing so fast it is becoming hard to measure Florida congressman Carlos Gimenez, a Cuban-American former mayor of Miami, demanded an \"urgent\" investigation into what he called a \"massacre\", adding US authorities \"must determine whether any of the victims were US citizens or legal residents\". \"This regime must be relegated to the dustbin of history!\" he wrote on X. None of the dead or wounded on the speedboat were identified, but Cuba said it was registered in Florida and provided the boat's registration number. \"Faced with the current challenges, Cuba reaffirms its commitment ⁠to protecting its territorial waters, based ​on the principle that national defence is a fundamental pillar for ​the Cuban state in safeguarding its sovereignty and stability in the region,\" the interior ministry statement said. It comes amid a time of heightened tensions between the US and Cuba following increased pressure from Donald Trump's administration. The two countries previously collaborated on combating drug smuggling and other crimes, but have ceased to do so. The US has also blocked virtually all oil shipments to the island, piling pressure on its Communist-run government."
    },
    {
        "title": "Trump's popularity has plummeted in polls - this explains what we saw",
        "description": "He took a long time to say a little.&#160;&#160;",
        "url": "https://news.sky.com/story/the-us-presidents-state-of-the-union-address-was-vintage-trump-but-told-us-very-little-13511876",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-donald_7174480.jpg?20260225085227",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2026-02-25 08:05:00",
        "Headline": "At times, the event resembled a TV game show, peppered with tributes and awards to deserving attendees, complete with a reunion between Venezuelan politician Enrique Marquez and his niece.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n He took a long time to say a little.   Donald Trump was on his feet for 1 hour and 48 minutes but, ultimately, this state of the union address was a news event lacking a news line. We heard a lot of what we'd heard before. He spoke of a golden age, America first, \"drill baby drill\" and success on border immigration. It was vintage Trump, the vintage that performed so effectively on the campaign trail, 2024. He needs it to be. Trump's popularity has plummeted in the polls and he has to shore up Republican deserters, this in a mid-term election year. \n                  'We are not out of the woods': Why democracy in the US is being tested\n                 \n                  The State of Donald Trump \n                 \n                  Trump's plan for Iran isn't working - he has three options\n                 It would explain the back-to-basics stage routine on Capitol Hill. The difference is that he's now judged on his record, not his promises, and for all he touts a \"roaring economy\", Americans aren't feeling it in the numbers he needs. He is a president seemingly on the brink of bombing Iran and everyone in the chamber would have been listening for clues on what comes next. In the event, he offered a holding position that didn't advance his public position, although he still beats the drums of war. Read more:Trump sending 'great hospital boat' to Greenland to 'take care of the sick'Trump directs US government to release files on 'alien and extraterrestrial life' Iran, he revealed, is working on missiles that could reach the United States. We saw the showbiz president, comfortable in his own skin and on stage. At times, the event resembled a TV game show, peppered with tributes and awards to deserving attendees, complete with a reunion between Venezuelan politician Enrique Marquez and his niece. There was a tribute to the late Charlie Kirk and the president condemned political violence. Then there was the introduction of the US men's ice hockey team, Trump's invitees who were universally acclaimed. It was the populism with the politics and there was plenty of both. There's less certainty around progress for a party looking to its president to put wind in its sails ahead of this year's mid-terms."
    },
    {
        "title": "AI bubble remains intact for now as Nvidia continues to defy expectations",
        "description": "The world's most valuable company has reported another series of expectation-defying results, lessening fears, for now, of an AI bubble bursting. ",
        "url": "https://news.sky.com/story/ai-bubble-remains-intact-for-now-as-nvidia-continues-to-defy-expectations-13512207",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-jensen-huang-nvidia_7128716.jpg?20260107093638",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-02-25 19:40:00",
        "Headline": "Nvidia smashed through its own records and continued to confound AI demand and spending fears as it forecasts even greater sales to come. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The world's most valuable company has reported another series of expectation-defying results, lessening fears, for now, of an AI bubble bursting.  Nvidia said its revenue reached another all-time high, hitting more than $200bn (£147bn) in its 2026 financial year, far outpacing Wall Street estimates and the company's own guidance. Money blog: Bank customers to be moved to Nationwide It also recorded the greatest growth from one three-month period to the next in the company's history. The set of results was described as \"absolutely stellar\" by Kyle Rodda, the senior financial market analyst at trading platform Capital.com and \"monster\" by Kathleen Brooks, research director at brokerage firm XTB. Across many metrics, Nvidia posted remarkable growth: gross profit surpassed $150bn (£110bn) in the 12 months to the end of January. Data centre revenue hit $62bn (£45.7bn) in the most recent three-month period alone as the company said it saw demand from a diverse client base. Its demand is \"broad, diverse and expanding\", the company said in a call with investors, while its chief executive Jensen Huang said there was an \"exponential\" need for computing and therefore demand for his company's chips. \n                  AI is developing so fast it is becoming hard to measure, experts say\n                 \n                  Police still using AI tool despite inaccurate evidence in Israeli football fan ban\n                 \n                  Tech firms must take down abusive images in 48 hours - or face being blocked from UK\n                 Nvidia also said it expects revenue to go even higher, to $78bn (£57.5bn) during the current three-month period that runs to the end of April. Why the focus on Nvidia? These results matter as Nvidia is a major company behind the artificial intelligence (AI) boom, both the skyrocketing tech company valuations and the increasing use and capability of AI in recent years. The expansion of AI into daily life is being powered by Nvidia computer chips. They are key parts in AI chatbots such as ChatGPT. Nvidia customers are the world's biggest tech companies. For more information about how we use your data and your rights, you can visit our Privacy Centre. Its financial performance acts as a good proxy for whether demand for AI products is holding up and if the tens of billions of dollars invested in AI by firms are paying off. As its share price reached stratospheric highs, it boosted the performance of the US's major stock indexes to new records. In October, it became the first company worth $5trn (£3.83trn), about the same size as the German economy, Europe's largest, and double the UK's benchmark stock index, the FTSE 100. Why does the AI boom matter? Building AI infrastructure, through data centre construction, has been a significant contributor to US economic growth, as measured by gross domestic product (GDP). Faltering AI expansion, therefore, would impact the US economy, the world's largest, which in turn affects the UK and global economies. What next? Regardless of the market figures, moves were anticipated, given the attention paid to the results and the significance of the company. Nvidia shares rose as much as 2% in after-hours trading. Company executives did strike a note of caution as they warned about some supply chain issues which could stymy delivery. For now, the AI bubble remains intact but Nvidia results alone may not be enough to calm fears."
    },
    {
        "title": "Energy price cap to fall in April but threat of war hangs over outlook",
        "description": "This week has seen the fourth anniversary of Russia's invasion of Ukraine.",
        "url": "https://news.sky.com/story/energy-price-cap-to-fall-in-april-but-threat-of-war-hangs-over-outlook-13511831",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-energy-money-gfx_7008555.jpg?20250901182947",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-02-25 06:00:00",
        "Headline": "Sky's James Sillars writes that while some policy costs have been stripped from bills, we're still paying for them elsewhere at a time when we continue to rely on gas for our power and heating. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n This week has seen the fourth anniversary of Russia's invasion of Ukraine. That's four years of war and continuous suffering for the people of Ukraine. The ramifications have been felt far and wide and it would appear crass to moan from these shores about higher energy bills since. The link, however, can not be dismissed and neither can the impact in the UK. The war triggered unprecedented spikes in gas and electricity prices and millions have faced choices over heating and eating to this day, four years on. We learned on Wednesday that the energy price cap - the variable tariff set by the regulator Ofgem - is to fall by £117, or 7%, over the three months from April to an average annual figure of £1,641. Money latest: How can I save on my energy bill? That level is £400 higher than the pre-war average. It tells us a few things when compared with the peak of £4,279 witnessed almost a year after Russia's invasion. \n                  Big fall in household energy bills predicted from April\n                 \n                  Trump's major breakaway from climate science\n                 \n                  Ovo to compensate vulnerable customers 'left without support'\n                 Yes, wholesale gas costs - which drove UK inflation above 11% in late 2022 - are down substantially but they remain volatile at a time when there are a host of other costs complicating the outlook for bills ahead. Policy costs are a great example of these competing forces. While the chancellor is taking £150 away from energy bills (including fixed-rate deals) per year by removing green levies and some other costs, they are now being reflected in general taxation. It's important to note that the price of the race to net zero, including investment in new nuclear, being undertaken by the government remains a major component within household energy costs. It's also worth bearing in mind that families are footing a big bill for making the UK's grids and networks fit for the renewables-led future. It's still a long way off. There were days this winter when natural gas was producing more than half the country's power needs. Infrastructure upgrades will add approximately £108 to typical annual household energy bills by 2031, according to Ofgem. Read more:Wind power prices up as UK moves away from gasMinister: No shortcut to bringing down energy bills So, is the price cap on track to come down further to limit these pressures? No. Not according to the energy consultancy Cornwall Insight, anyway. \"While policy - and network - costs will continue to play a significant role in shaping household bills, wholesale [gas] markets have become increasingly volatile since the beginning of the year,\" it noted. \"Unlike the April cap, which benefited from comparatively lower wholesale prices near the end of 2025, the July cap is being set against more turbulent market conditions.\" Those include markets pricing in the risk that another war will disrupt flows, particularly of crucial liquified natural gas (LNG), if the US attacks Iran. Given that Europe has lost most of its Russian oil and gas, any threat to supplies through the Strait of Hormuz has the potential for history to repeat itself through a renewed energy-driven cost-of-living crisis. It's a risk our economy, still damaged by high prices, could well do without."
    },
    {
        "title": "What Rachel Reeves could announce in spring statement",
        "description": "Rachel Reeves has insisted her spring statement will be a quiet affair as she wants the autumn budget to be the sole major fiscal event of the year.",
        "url": "https://news.sky.com/story/when-is-rachel-reeves-spring-statement-and-what-will-be-in-it-13512202",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092412.jpg?20251126115927",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2026-02-25 19:25:00",
        "Headline": "The budget last autumn was preceded by a lot of speculation, then large tax rises - but the chancellor is hoping this announcement will be more low-key.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Rachel Reeves has insisted her spring statement will be a quiet affair as she wants the autumn budget to be the sole major fiscal event of the year. The chancellor will deliver her financial update on the afternoon of 3 March in the House of Commons. An exact time has yet to be confirmed, but she is only expected to speak for about 20 minutes, compared with an hour for a budget. Last November's budget was preceded by much speculation, followed by announcements of large tax rises, bringing tax as a share of GDP to an all-time high. But Ms Reeves and the Treasury have said the spring statement - rebranded from the spring budget - will be low-key and no major announcements will be made. She is not even expected to carry her statement in her famous red box. Despite it not being a \"major\" event, the spring statement can influence the government over whether to raise or cut future taxes and spending. Will the OBR be involved in the spring statement? Ms Reeves will outline the latest economic forecasts from the Office for Budget Responsibility (OBR) - which will then be published after the chancellor has delivered her speech. So, despite it being \"low-key\", it will still be a critical moment as it will show what effect the last budget and the government's policies have had. The OBR produces two forecasts a year, which indicate how the economy is expected to perform and if the government is likely to meet the tax and spending rules it has set. The OBR was thrown into the spotlight at the last budget when it accidentally leaked its assessment, therefore revealing the budget - about 40 minutes before Ms Reeves stood up to deliver her announcement. This time, following a security review, the Treasury will publish the OBR's forecast on gov.uk, instead of on the OBR's own website. It will be the first time in the OBR's 16-year history it will not publish a formal assessment of the government's progress towards meeting its fiscal rules. However, this will be enough for economists to figure out the size of the chancellor's headroom, which could have an impact on the economy. Read more:Record-breaking budget surplus as tax income risesBudget 2025 - the key points at a glance Will Rachel Reeves raise taxes? The chancellor has said she will not be making any major announcements, but she could make minor changes to tax policy. However, this could be politically risky as she could then be accused of deploying stealth taxes. It would also open her up to attacks from opposition parties - and, as seen before, potentially from her own party. What is the current state of the UK economy? Despite inflation falling sharply, the UK economy remains fragile, and inflation (currently at 3%) is still above the Bank of England's target of 2%. There are also concerns about growth, with the UK's GDP growing just 0.1% in the last three months of 2025 - but it grew by 1.3% over the whole of 2025. Unemployment has reached its highest level since 2021, increasing to 5.2% in the three months to December 2025. The unemployment rate among 16 to 24-year-olds across that period was 16.1%, the highest since 2014, according to ONS data. But when it comes to wages, they are continuing to grow, with annual growth in weekly earnings in the last quarter of 2025, excluding bonuses, rising by 4.2%. There was an increase in tax receipts due to the government previously raising taxes, which created a £30.4bn government budget surplus in January - £15.9bn more than the year before and the highest (without adjustment for inflation) since monthly records began in 1993."
    },
    {
        "title": "Met Police apologises to Commons Speaker over Lord Mandelson tip-off",
        "description": "The Metropolitan Police has apologised to the Commons Speaker for revealing he was the source of a tip-off relating to the arrest of Lord Mandelson.",
        "url": "https://news.sky.com/story/met-police-apologises-to-commons-speaker-over-lord-mandelson-tip-off-13512284",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lindsay-hoyle-speaker_7175217.jpg?20260225231852",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-25 23:01:00",
        "Headline": "Lord Mandelson was arrested on Monday on suspicion of misconduct in public office and has been released under investigation. He denies any wrongdoing regarding his relationship with Jeffrey Epstein.",
        "Content": "The Metropolitan Police has apologised to the Commons Speaker for revealing he was the source of a tip-off relating to the arrest of Lord Mandelson. The force said it had \"inadvertently\" revealed information about why the ex-business secretary had been taken into custody on Monday. Lawyers for Lord Mandelson had claimed the arrest was due to the \"baseless\" claim that he was preparing to flee the country for the British Virgin Islands. Sky News understands officers had originally planned to interview him under caution, without arrest, next month. Some media reports named the source of the flight risk claim as the Lord Speaker, Lord Forsyth. But addressing the Commons before PMQs on Wednesday, Speaker Sir Lindsay Hoyle revealed it was him, saying he had done so \"in good faith, as is my duty and responsibility\". A statement from the Met said it had since apologised to him \"for inadvertently revealing information during an investigation into allegations of misconduct in public office\". Read more from Sky News:Epstein blamed 'Charles' when Andrew lost job Lord Forsyth is to meet the Met on Thursday to ask how he was incorrectly named as the source. Sky News understands he wants to know why the Met didn't correct the reporting and issue an apology. The Met has been approached for comment. Meanwhile, the investigation into Lord Mandelson continues after he was bailed in the early hours of Tuesday. The misconduct in public office probe relates to allegations he passed market-sensitive government information to Jeffrey Epstein when he was in Gordon Brown's government. Lord Mandelson has repeatedly denied any wrongdoing."
    },
    {
        "title": "Man with axe arrested at mosque in 'serious security incident'",
        "description": "A man has been arrested after allegedly entering a mosque in Manchester with an axe in his bag during Ramadan prayers.",
        "url": "https://news.sky.com/story/starmer-concerned-after-serious-incident-at-manchester-mosque-13511949",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-mosque-manchester_7174804.jpg?20260225145324",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-25 11:33:00",
        "Headline": "Police said no one was hurt and there was no suggestion of any threats being made following the incident at Manchester Central Mosque on Tuesday night.",
        "Content": "A man has been arrested after allegedly entering a mosque in Manchester with an axe in his bag during Ramadan prayers. The suspect, a white man in his 50s, went into Manchester Central Mosque in the Victoria Park area around 8.30pm on Tuesday, police said. He was wearing hi-vis clothing and was said to have had an axe, a knife and a hammer with him. Greater Manchester Police (GMP) said no one was injured and no threats were made. The force said it had not declared it a terrorist incident, but was working with counter-terrorism police to investigate. The suspect is being held on suspicion of possessing an offensive weapon and class B drugs. Police are searching for a second man, a black male, who is believed to have been with the suspect but left before officers arrived. The chairman of the mosque said volunteers had kept the suspect talking until police arrived and arrested him. Hammad Khan said the man was \"very calm\" and had been spotted visiting the mosque before. However, after entering the building on Tuesday, an axe was spotted in his bag, and he was ushered into an office by volunteers and the police were called. Mr Khan said: \"His demeanour was very calm. \"He wasn't under the influence of anything at all. I also understand he was also carrying some other materials with him relating to World War Two, also some newspaper cuttings, which the police have. \"The volunteers obviously kept the conversation going in a very amenable way to ensure the situation did not escalate in any way.\" The mosque described it as a \"serious security incident\". Police said an off-duty special constable, who was part of the congregation, phoned police and officers responded within 15 minutes. 'Worrying for Muslim communities' In a post on X, Sir Keir Starmer said: \"I am concerned to hear of the incident at Manchester Central Mosque last night. I know this will be worrying for Muslim communities, especially during Ramadan, a time of peace and reflection. \"My thanks go to the volunteers and emergency services for their quick response. \"We have provided up to £40m funding for additional security at mosques, Muslim schools and community centres, and will continue to act to ensure communities are able to live without fear.\" 'Concerning incident' Speaking outside the mosque on Wednesday evening, GMP's Assistant Chief Constable John Webster said: \"Last night, a concerning incident took place here at Manchester Central Mosque. \"A man with a bag containing an axe was acting suspiciously, during a congregation involving hundreds of worshippers... \"There was no suggestion of verbal threats or confrontation, but it's really important the security staff here and volunteers acted on their suspicions, on their instincts, to call us. I thank them for their actions.\" He added: \"This is a time where Muslims come together to observe Ramadan. They should feel safe in their place of worship. We do give places of worship increased attention during this period, as we do with all religious festivals.\" Mr Webster said officers were increasing patrols \"to offer security and reassurance to our Muslim community\" and said officers would be on 12-hour shifts to do so. He added: \"There is an ongoing police investigation, and we are working to locate the second suspicious man to understand who he is and what he was doing at the mosque. \"We're still questioning the detained man to understand what he was doing here with an axe in his bag.\" Read more from Sky News:Ex-DJ sold fake plane parts to airlinesUK to be warmer than Malta and BarcelonaHow UK's travel system is changing today Volunteers 'played crucial role in containing situation' In a statement, the mosque said the UK's Muslim community had \"experienced a notable rise in threats and hostility over recent years\". It added: \"The increase in Islamophobic incidents is a serious concern, and greater resources are urgently needed to address this growing and real risk. \"Congregants are advised to travel in groups where possible and to ensure that children are not left unattended. \"The swift and responsible actions of our volunteers played a crucial role in containing the situation. Without their intervention, the consequences could have been far more serious.\" Afzal Khan, the local MP for Rusholme, also said he was \"deeply concerned\" about the incident. He said: \"Just this week, the chancellor and home secretary announced more funding for protecting mosques, and this incident demonstrates once again why this funding is so vital.\" Police are appealing for witnesses to help with their enquiries."
    },
    {
        "title": "Sir Keir Starmer hints at changing student loans system",
        "description": "Sir Keir Starmer has said the government is to look at ways of making the student loans system \"fairer\".",
        "url": "https://news.sky.com/story/sir-keir-starmer-hints-at-changing-student-loans-system-13512086",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-students-university_7174828.jpg?20260225152331",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-25 14:57:00",
        "Headline": "The prime minister said the government would look at ways of making the loans \"fairer\" after being quizzed over the issue by Tory leader Kemi Badenoch.",
        "Content": "Sir Keir Starmer has said the government is to look at ways of making the student loans system \"fairer\". He made the pledge as he blamed rising loan costs on the Conservatives - after being asked about the issue by Tory leader Kemi Badenoch at Prime Minister's Questions (PMQs) on Wednesday. Speaking to reporters, Sir Keir's spokesman also suggested that ministers may consider reforms such as slashing interest rates and changing the repayment threshold. Earlier this week, Ms Badenoch promised to cut the interest paid on some student loans if elected, amid growing concern about the impact on graduates' finances. Politics latest: Commons Speaker gave Mandelson info to police It comes after Chancellor Rachel Reeves announced in November's budget that the salary threshold at which students have to start repaying the loans would be frozen at £29,385 for three years, leaving many having to pay more. Interest on Plan 2 student loans - lent to students in England who started their courses between 2012 and 2022 - is charged at a rate of the Retail Price Index (RPI) of inflation plus up to 3%, depending on how much a graduate earns. But Ms Badenoch said the Conservatives would restrict this to RPI only, as she said this would help more graduates pay off their debt. At PMQs, she pressed Sir Keir on the issue, asking if he would cut interest rates on student loans. He replied: \"I have to say, I was glad to learn that the leader of the Opposition has finally admitted that they [the Conservatives] scammed the country on this, and that applies to everything they did in government. \"We inherited their broken student loans system. We've already introduced maintenance grants to improve the situation, which they scrapped, and we will look at ways to make it fairer, and we will do other things within the economy to help students.\" Read more from Sky News:Ex-DJ sold fake plane parts to airlinesUK to be warmer than Malta and BarcelonaHow UK's travel system is changing today When Ms Badenoch asked if graduates were paying more or less under Labour, the prime minister did not directly answer. He said under the previous government, \"inflation was at 11%, which crippled the state of finances for students as their loan rates went up\". Ms Badenoch said: \"The fact is, graduates are paying more, not less,\" as she accused Sir Keir of \"taking from students to give to Benefit Street\". Sir Keir replied: \"What a nerve. Under their government, student loan thresholds were frozen for 10 years. \"They broke the system, they did it with a bloke over there when they were in coalition together, and we're fixing it.\" Sir Keir's spokesman would not confirm if student loans would be included in the chancellor's spring statement next month and refused to provide any more details. But he said the government was keeping \"under review the ways in which we can make life better for graduates\"."
    },
    {
        "title": "First migrants reach UK in two weeks after crossing Channel",
        "description": "Migrants have crossed the English Channel and reached the UK for the first time in two weeks.",
        "url": "https://news.sky.com/story/first-migrants-reach-uk-after-crossing-channel-in-two-weeks-13512119",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ramsgate-kent-migrants_7174823.jpg?20260225151908",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-25 15:38:00",
        "Headline": "People in lifejackets and coats were seen disembarking a Border Force boat in Ramsgate, Kent, on Wednesday.",
        "Content": "Migrants have crossed the English Channel and reached the UK for the first time in two weeks. People in life jackets and coats were seen disembarking a Border Force boat in Ramsgate, Kent, on Wednesday. A break in the recent bout of poor weather allowed for the launching of several crossing attempts, reports have suggested. Some 74 migrants arrived on Tuesday, according to Home Office data. It was the first crossing since 9 February, which saw 322 people reach the UK. So far this month 597 migrants have crossed the Channel. Read more from Sky News:On the trail of Putin's 'shadow fleet' in the English ChannelStarmer 'concerned' after man with axe arrested at mosque It comes after an inquiry into the deadliest Channel crossing on record said small boat crossings \"must end\" in order to prevent further deaths. A crowded inflatable boat had capsized overnight on 23/24 November 2021, leaving just two survivors who were found in French waters nearly 12 hours after the first mayday. The independent probe, led by Sir Ross Cranston and costing more than £7m, identified 27 men, women and children among the dead, while four are still missing, and said \"some of those deaths were avoidable\". The inquiry found \"systemic failures, missed opportunities\" and \"chronic staff shortages\" in the UK's maritime response contributed directly to the failure to rescue people."
    },
    {
        "title": "What Rachel Reeves could announce in spring statement",
        "description": "Rachel Reeves has insisted her spring statement will be a quiet affair as she wants the autumn budget to be the sole major fiscal event of the year.",
        "url": "https://news.sky.com/story/when-is-rachel-reeves-spring-statement-and-what-will-be-in-it-13512202",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092412.jpg?20251126115927",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2026-02-25 19:25:00",
        "Headline": "The budget last autumn was preceded by a lot of speculation, then large tax rises - but the chancellor is hoping this announcement will be more low-key.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Rachel Reeves has insisted her spring statement will be a quiet affair as she wants the autumn budget to be the sole major fiscal event of the year. The chancellor will deliver her financial update on the afternoon of 3 March in the House of Commons. An exact time has yet to be confirmed, but she is only expected to speak for about 20 minutes, compared with an hour for a budget. Last November's budget was preceded by much speculation, followed by announcements of large tax rises, bringing tax as a share of GDP to an all-time high. But Ms Reeves and the Treasury have said the spring statement - rebranded from the spring budget - will be low-key and no major announcements will be made. She is not even expected to carry her statement in her famous red box. Despite it not being a \"major\" event, the spring statement can influence the government over whether to raise or cut future taxes and spending. Will the OBR be involved in the spring statement? Ms Reeves will outline the latest economic forecasts from the Office for Budget Responsibility (OBR) - which will then be published after the chancellor has delivered her speech. So, despite it being \"low-key\", it will still be a critical moment as it will show what effect the last budget and the government's policies have had. The OBR produces two forecasts a year, which indicate how the economy is expected to perform and if the government is likely to meet the tax and spending rules it has set. The OBR was thrown into the spotlight at the last budget when it accidentally leaked its assessment, therefore revealing the budget - about 40 minutes before Ms Reeves stood up to deliver her announcement. This time, following a security review, the Treasury will publish the OBR's forecast on gov.uk, instead of on the OBR's own website. It will be the first time in the OBR's 16-year history it will not publish a formal assessment of the government's progress towards meeting its fiscal rules. However, this will be enough for economists to figure out the size of the chancellor's headroom, which could have an impact on the economy. Read more:Record-breaking budget surplus as tax income risesBudget 2025 - the key points at a glance Will Rachel Reeves raise taxes? The chancellor has said she will not be making any major announcements, but she could make minor changes to tax policy. However, this could be politically risky as she could then be accused of deploying stealth taxes. It would also open her up to attacks from opposition parties - and, as seen before, potentially from her own party. What is the current state of the UK economy? Despite inflation falling sharply, the UK economy remains fragile, and inflation (currently at 3%) is still above the Bank of England's target of 2%. There are also concerns about growth, with the UK's GDP growing just 0.1% in the last three months of 2025 - but it grew by 1.3% over the whole of 2025. Unemployment has reached its highest level since 2021, increasing to 5.2% in the three months to December 2025. The unemployment rate among 16 to 24-year-olds across that period was 16.1%, the highest since 2014, according to ONS data. But when it comes to wages, they are continuing to grow, with annual growth in weekly earnings in the last quarter of 2025, excluding bonuses, rising by 4.2%. There was an increase in tax receipts due to the government previously raising taxes, which created a £30.4bn government budget surplus in January - £15.9bn more than the year before and the highest (without adjustment for inflation) since monthly records began in 1993."
    },
    {
        "title": "Searches concluded at Andrew's former residence - as MPs back release of files relating to his trade envoy appointment",
        "description": "Searches at Andrew Mountbatten-Windsor's former Windsor residence in relation to an investigation into alleged misconduct in public office have concluded, police have said.&#160;",
        "url": "https://news.sky.com/story/searches-concluded-at-andrews-former-residence-as-mps-back-release-of-files-relating-to-his-trade-envoy-appointment-13511816",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-royal-andrew_7169620.jpg?20260221154841",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-25 00:33:00",
        "Headline": "Officers said their \"investigation remains ongoing\" following the arrest and subsequent release of the former prince on suspicion of misconduct in public office.",
        "Content": "Searches at Andrew Mountbatten-Windsor's former Windsor residence in relation to an investigation into alleged misconduct in public office have concluded, police have said.  Thames Valley Police (TVP) began searches of Royal Lodge in Windsor Great Park, Berkshire, following the arrest of the former prince at Sandringham on what was his 66th birthday last Thursday. Andrew was released under investigation after spending 11 hours in custody on suspicion he shared sensitive information with late sex offender Jeffrey Epstein when he served as UK trade envoy between 2001 and 2011. He has always vigorously denied any allegations of wrongdoing in connection with Epstein. Read more from Sky News:What is misconduct in public office? TVP assistant chief constable Oliver Wright said: \"Officers have now left the location we have been searching in Berkshire. This concludes the search activity that commenced following our arrest of a man in his sixties from Norfolk on Thursday. \"We understand the significant public interest in this case and our investigation remains ongoing. \"It is important that our investigators are given the time and space to progress their work. We will provide updates when it is appropriate to do so, but this is unlikely to be for some time.\" 'Rude, arrogant and entitled' It comes after MPs officially backed the release of files relating to Andrew's appointment as UK trade envoy. On Tuesday, MPs unanimously agreed on the release without needing for it to go to a vote. Trade minister Sir Chris Bryant insisted the government would release the files \"as soon as is practicable and possible within the law\" but said that any documents relating to the offence of misconduct in public office may be held back on the advice of prosecutors. In a critique of Andrew, he called the former Duke of York \"rude, arrogant and entitled\" and described him as \"a man on a constant self-aggrandising and self-enriching hustle\". Sir Chris spoke of his own experience of Andrew visiting his constituency, claiming the King's brother had insisted on travelling to an event there via helicopter, \"unlike his mother [Queen Elizabeth II], who came twice to the Rhondda and always came by car\". \"That is, of course, Mr Speaker, not a crime, nor is arrogance,\" he added. Earlier this week, the governments of Australia and New Zealand backed plans to remove Andrew from the royal line of succession. Changing the line of succession would require the agreement of all 15 realms of the Commonwealth where the British monarch is also the head of state. Only New Zealand and Australia have so far backed the move."
    },
    {
        "title": "AI is developing so fast it is becoming hard to measure, experts say",
        "description": "Some days it can seem as if the whole of the tech world is hanging on the latest update to one graph.",
        "url": "https://news.sky.com/story/ai-is-developing-so-fast-it-is-becoming-hard-to-measure-experts-say-13512068",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ai-artificial-intelligence_7174797.jpg?20260225144459",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-02-25 14:08:00",
        "Headline": "Results show AI is getting twice as good at the rate of about every seven months and experts say the trend is speeding up.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n Some days it can seem as if the whole of the tech world is hanging on the latest update to one graph. The graph in question is made by a non-profit research institute called METR and it assesses the software development capacities of different AI models. For many months now, this chart has been provoking excitement and unease in anyone who watches artificial intelligence because it shows a striking exponential trend - that is, a doubling in growth. According to METR, or Model Evaluation and Threat Research, AI is getting twice as good at the startling rate of roughly every seven months. The latest results turned the dial from feverish to panicked, because it showed the trend not just continuing, but actually speeding up. METR tests AIs by assessing their ability to complete longer and longer human software tasks. The latest model it analysed, Anthropic's Claude Opus 4.6, broke all previous records. 'Monstrous leaps' Many in tech compare the situation to the COVID pandemic because of the deceptive way doubling turns from apparently small increases to monstrous leaps. \"Nothing, nothing, nothing, everything,\" was how a UK tech entrepreneur and AI researcher described the situation to me a few months ago, at a time when the METR chart was already looking fairly vertiginous (although, in retrospect, it feels as if we were barely approaching the foothills). The progress since then makes many feel like we are rapidly approaching \"everything\". After the chart's release, one METR researcher sent a note to his old college friends, which he posted on social media, saying: \"I feel very confident now that it's going to be totally insane and chaotic, like many orders of magnitude more chaotic than anything the world has experienced in our lifetimes.\" This isn't even an unusual sentiment in tech right now. The chief executives of leading AI companies make similar statements all the time. 'Ten times the impact of Industrial Revolution' Even Demis Hassabis, the most measured of the AI leaders, regularly says that AI will have 10 times the impact of the Industrial Revolution, in a tenth of the timespan. A widely-shared newsletter responding to the METR chart put it more simply: \"When must I start kicking and screaming at you that it is… happening.\" But what exactly is \"it\"? On closer inspection, it becomes harder to tell. For a start, look at what the METR chart actually measures. Read more:If you have an AI-generated password, you should change it'Humanity is cooked': AIs now have their own social network  The details are technical, but roughly speaking it measures the length of a task that an AI can complete 50% of the time - meaning they fail as often as they succeed. Some way off full automation A business which turned its operations over to an AI which could complete a task half the time wouldn't last very long. Even 80% success - which METR also measures - wouldn't be close enough for anything approaching full automation in a corporate environment. Then there is the precise location of the dots on the chart, which even METR researchers admit they are unsure about. \"We're increasingly nervous about the measurements that we're putting out there,\" said Joel Becker, a member of METR's technical staff, referring to the extremely large range of possible values - the confidence interval - on the group's Claude Opus 4.6 evaluation. \"We don't want to hide behind that. I think that's real uncertainty.\" A key reason behind the uncertainty is that it is increasingly difficult for organisations like METR to find tasks that are hard enough to test the AI properly. That, in itself, tells a story. Nevertheless, with markets moving based on small changes in AI assessments, it is important to remember that a few small tweaks in METR's tests might have changed the result in a meaningful way. The rate of AI progress might be speeding up, but it could just as easily be slowing down. Becker, who said he had stopped paying into a pension since understanding the trend in AI development, told Sky News he believed that AI was not yet able to improve itself, triggering the science fiction fear of an explosion of AI capabilities. Nevertheless, he said that \"it probably is the case today that AI tools are meaningfully speeding up the degree to which AI professionals are able to make progress on building better and better AIs\", which is significant in its own right. \"I want to communicate that the situation is serious, that it's fast-moving, that it appears not to be slowing down, that it is accelerating,\" Becker told Sky News. \"It could be associated with extraordinarily positive possibilities... and on the other side, there may be extraordinary, dangerous things that might follow.\" How is AI affecting employment? At present, employment statistics in the UK and the US show little sign of any impact from AI. Adverts for software engineering jobs on the job search platform Indeed are actually rising. Becker said he thought coders had a future, for a while at least. \"There's all these AI professionals inside the labs, you know, they're doing real work. I imagine they'll keep doing not so similar work for the next year to maybe many more years than that.\" But he cautioned: \"Economic statistics are referring to what happens some number of months ago and not what's happening exactly today. \"And I think some of the extraordinary progress that we've seen, especially in software engineering, but also in other fields, from AIs becoming more capable, has happened only in the past few months.\" The speed of development in AI is so fast now it's becoming extremely hard to measure. That fact alone is extremely significant."
    },
    {
        "title": "The energy habits that cause the most family arguments",
        "description": "On a day when energy bills are making headlines, we thought we'd share new research on the energy habits that lead to the most household arguments.",
        "url": "https://news.sky.com/story/the-energy-habits-that-cause-the-most-family-arguments-13511997",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-energy-bills-electricity_7057830.jpg?20251021222054",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2026-02-25 12:40:00",
        "Headline": "A new study lifts the lid on the energy habits most likely to start an argument in UK households. ",
        "Content": "On a day when energy bills are making headlines, we thought we'd share new research on the energy habits that lead to the most household arguments. According to a survey by Uswitch.com, leaving lights on in empty rooms is the most contentious issue, with 44% of households saying they've argued about this. Find tips and personal finance news in the Money blog Four in 10 households argue over leaving gadgets on, and leaving the TV blaring while no one is watching, while the cost of heating and temperature of the thermostat causes arguments in 39% of homes. When it comes to couples, the price comparison site says more than a third (36%) who live together argue over the temperature the thermostat is set to. Read more from Money:Rosa's phone kept going missing just as she was leaving for work...How to pick out a good steak - as top chef shouts out supermarket rangeThere are more railcards than you think - how you can benefit Around 19% have admitted to sneakily changing the thermostat while their partner is not looking, according to the survey. Energy bills are a common source of arguments among couples, with 31% saying they argue over the amount they pay for gas and electricity."
    }
]