[
    {
        "title": "PM in 'precarious position' after MPs force climbdown over Mandelson files release",
        "description": "Sir Keir Starmer is facing growing anger among Labour MPs and renewed speculation about his future after being forced to publish files about his decision to appoint Peter Mandelson as the UK's US ambassador.",
        "url": "https://news.sky.com/story/mps-force-sir-keir-starmer-to-publish-files-about-peter-mandelsons-appointment-as-us-ambassador-13503373",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-keir-starmer_7155468.jpg?20260204132631",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-04 20:24:00",
        "Headline": "After Labour MPs refused to back the government, the PM will be forced to share documents with parliament amid a Metropolitan Police investigation into Lord Mandelson's conduct.",
        "Content": "Sir Keir Starmer is facing growing anger among Labour MPs and renewed speculation about his future after being forced to publish files about his decision to appoint Peter Mandelson as the UK's US ambassador. The government had signalled it would release most of the documents following revelations about Lord Mandelson's relationship with convicted paedophile Jeffrey Epstein. Tap here for the latest on the Epstein files But the prime minister's original plan was for his top civil servant to determine whether any should remain secret on national security grounds, or because they could prejudice international relations. He was forced into a climbdown after interventions from senior Labour MPs during a dramatic Commons session on Wednesday, including former deputy prime minister Angela Rayner, while Conservative leader Kemi Badenoch accused Sir Keir of an attempted \"cover-up\". MPs eventually backed a compromise that will see parliament's Intelligence and Security Committee determine what should be done with the more sensitive files - but it leaves Sir Keir in the most perilous position of his premiership. Sky News political editor Beth Rigby described the mood in parliament as a \"tinderbox\", with one senior ally of the prime minister unwilling to rule out resignations from government. \"Temperatures are running high,\" they said. Police probe delays release of files Despite the Commons drama, it is unclear when any documents will be shared with parliament and published by the government amid a police investigation into Lord Mandelson for misconduct in public office. The Metropolitan Police said it had advised the government \"the release of specific documents could undermine our current investigation\". \"We therefore asked them not to release certain documents at this time,\" the force added. Rigby said there is \"deep frustration\" inside Number 10 about the situation, as it's hoped the release of the files will support the prime minister's assertion that Lord Mandelson repeatedly lied to him about the depths of his relationship with Epstein. \"But with their hands tied, and the mood this febrile, the prime minister is in a precarious position,\" she added. Starmer: I regret appointing Mandelson Downing Street has conceded that the prime minister was aware of Lord Mandelson's links to Epstein when his appointment as US ambassador was confirmed early last year. Speaking at Prime Minister's Questions, Sir Keir insisted a due diligence process had taken place, but said: \"What was not known was the depth, the sheer depth, and the extent of the relationship.\" \"He lied about that to everyone for years, and new information was published in September showing the relationship was materially different from what we'd been led to believe,\" he told MPs. \"When the new information came to light, I sacked him.\" He added: \"I regret appointing him. If I knew then what I know now, he would never have been anywhere near government.\" Sir Keir is set to face questions from the media today about the crisis engulfing his administration, after he gives a speech about plans for investment in the UK's most deprived communities. How did we get here? The scandal erupted again last Friday when the US Department of Justice published a tranche of over three million Epstein files documents, which included emails that appear to show Lord Mandelson shared sensitive internal government information with the financier while serving in Gordon Brown's government. It led to the Metropolitan Police opening its investigation into Lord Mandelson for alleged misconduct in public office, which followed referrals from both the Cabinet Office and Mr Brown. Lord Mandelson resigned his membership of the Labour Party on Sunday. He denied any record or recollection of the payments, but said he did \"not wish to cause further embarrassment\" to the party. Sky News has approached representatives for Lord Mandelson for comment. Being named in the Epstein files is not a sign of wrongdoing, and Lord Mandelson has expressed regret about his past ties to the paedophile, saying in a statement: \"I was wrong to believe Epstein following his conviction, and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" Lord Mandelson has not responded to the latest allegations. However, in an interview with The Times carried out last week, but published on Monday, he referred to a \"handful of misguided historical emails, which I deeply regret sending\", and described Epstein as \"muck that you can't get off your shoe\"."
    },
    {
        "title": "Beth Rigby: Even Starmer's allies are unsure about his future",
        "description": "By my reckoning, yesterday will be remembered as perhaps the most difficult of Sir Keir Starmer's premiership yet, with even close allies telling me they are not sure where it will end.",
        "url": "https://news.sky.com/story/beth-rigby-even-starmers-allies-are-unsure-about-his-future-13503409",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starmer-pmqs_7156040.jpg?20260204235154",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-04 21:57:00",
        "Headline": "Some Labour MPs consider Sir Keir Starmer's decision to appoint Peter Mandelson as US ambassador an unforgivable lapse of judgement.",
        "Content": "\n          Political editor\n              @BethRigby\n By my reckoning, yesterday will be remembered as perhaps the most difficult of Sir Keir Starmer's premiership yet, with even close allies telling me they are not sure where it will end. His admission at Prime Minister's Questions that he knew of the friendship between Peter Mandelson and Jeffrey Epstein when he appointed him as US ambassador hardened the sentiment of many a Labour MP who was willing to give him the benefit of the doubt. Insiders tell me that changed when Starmer told the Commons that security vetting had confirmed the continued friendship between Mandelson and Epstein after the financier was jailed for child prostitution offences, leaving MPs furious at the prime minister and his aides for allowing the ex-Labour minister back into the heart of government. Some MPs consider this an unforgivable lapse of judgement. Number 10 has compromised on the release of files relating to Mandelson's appointment. It will now be for the independent Intelligence and Security Committee, and not the PM's top civil servant, as was planned, to decide what should be held back in the interests of national security and international relations. But that Number 10 had to cave to backbenchers - led by Angela Rayner - concerned about a \"cover-up\" (as the Conservative leader Kemi Badenoch put it) is symbolic of the breakdown of trust. A tinderbox that could erupt There were rumours flying around that Morgan McSweeney, Starmer's chief of staff, was about to resign - as a few MPs publicly called for him to do so over the decision to reinsert Mandelson into government in 2025. I'd describe the mood in parliament yesterday evening as a tinderbox, with even some of the PM's allies unsure about whether the situation is about to erupt. When I asked one senior ally whether there could be a challenge or resignations that could predicate a challenge, there was a long pause. \"Temperatures are running high,\" said the figure, acknowledging that when the mood is as it is, and Sir Keir is where he is in the polls, someone moving against him is a risk. Another senior figure told me many MPs felt deeply compromised over the scandal, including some ministers. Read more from Sky News:Murder investigation launched after student stabbedSix Palestine Action activists cleared of aggravated burglary As for the No 10 end, there is deep frustration that the government has been blocked by the Metropolitan Police from releasing information about what Mandelson told the PM and others about his relationship with Epstein. The intention had been to release this information straight away in order to back up what the PM said in the Commons, but Downing Street has been thwarted as it stands. There is a view that the release would have been helpful because it would have perhaps led to MPs directing their anger at Mandelson. The PM's team are in a bind because they want the information out, but they don't want to do anything that would affect a criminal investigation with the Met. One option for Downing Street now could be to go back to the Met and see what they can release. But with their hands tied, and the mood this febrile, the prime minister is in a precarious position as the Mandelson crisis raises MPs' anger and leadership speculation all over again."
    },
    {
        "title": "Mandelson-Epstein files: Keir Starmer may be facing his very own Profumo scandal",
        "description": "Is the Mandelson-Epstein crisis Sir Keir Starmer's Profumo scandal?",
        "url": "https://news.sky.com/story/the-sex-and-secrets-scandal-which-could-bring-down-another-prime-minister-more-than-60-years-on-from-profumo-13503392",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-john-profumo-christine-keeler_7156032.jpg?20260204232411",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2026-02-04 21:22:00",
        "Headline": "After a chaotic Commons showdown, some MPs are predicting that the Peter Mandelson scandal will bring down Sir Keir Starmer.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Is the Mandelson-Epstein crisis Sir Keir Starmer's Profumo scandal? Both involved sex, call girls, lurid revelations and a police investigation. Tap here for the latest on the Epstein files The Profumo scandal brought down Tory prime minister Harold Macmillan in the early 1960s. Secretary of state for war John Profumo had an affair with call girl Christine Keeler, who was also involved with a Soviet naval attache. Profumo lied to parliament about his affair, Macmillan's handling of the crisis was seen as hopeless - and he failed to confront Profumo about the affair. Months later, Macmillan was gone. Could it happen again? Now, after an excruciating Prime Minister's Questions, followed by a chaotic Commons showdown on Mandelson, senior MPs are predicting the current scandal will bring down Starmer. 'It's absolutely inevitable' \"The Profumo affair brought down Harold Macmillan,\" SNP Westminster leader Stephen Flynn told Sky News. \"This will bring down Keir Starmer. \"It's absolutely inevitable. Today he chose to be clear, and revealed to the nation what he knew and when. And in doing so he showed a clear lack of judgement, which has broken trust with the people of these isles. \"That's unforgivable for a prime minister, and it's ultimately going to lead to his departure from No 10.\" But Flynn isn't alone with his astonishing prediction. His ally Liz Saville-Roberts, Plaid Cymru's Westminster leader, told Sky News: \"A number of people are comparing this to the Profumo scandal. \"And, of course, these scandals start slowly and then they speed up. We're seeing it speed up now.\" Read more:What is misconduct in a public office?Mandelson had no alternative but to resignEpstein files: Key findings so far That's the view from the prime minister's opponents, of course. And it must be said that the Commons debate on a Tory demand for the release of a Mandelson \"paper trail\" ended with the government's last-minute compromise being approved \"on the nod\", and MPs of all parties claiming it was a good outcome. A last-minute government amendment on a scrap of paper gave parliament's Intelligence and Security Committee (ISC) the power to vet which sensitive documents about Mandelson should be released, and which shouldn't. Rayner's ominous intervention The government's previous position, that \"papers prejudicial to UK national security or international relations\" should be kept secret, incensed MPs of all parties, and the PM was heading for a humiliating rebellion and possible defeat. Ominously for the PM, it was Angela Rayner, his former deputy now banished to the back benches after her stamp duty dodge, that forced him into a U-turn. There was a sharp intake of breath from MPs as the rose to her feet and made what sounded like a perfectly sensible proposal. The ISC should look at the papers, in \"keeping public confidence in the process\", she said. But MPs are nothing if not conspiracy theorists. Was she signalling she might vote with the Tories? Was she twisting the knife? Or was she being helpful? Probably all three. By the end of the debate, many gloomy Labour MPs were in despair at Sir Keir's faltering and unconvincing performance at PMQs, and the shambolic government U-turn on publishing the Mandelson files. Was the red queen serving notice that she's ready to seize Starmer's crown? Certainly, his terrible judgement in appointing Mandelson as US ambassador has left him even more vulnerable than ever to a leadership challenge. And the Mandelson-Epstein furore is suddenly being compared by MPs to another sex and secrets scandal that brought down a prime minister more than 60 years ago."
    },
    {
        "title": "Trump orders 700 immigration officers to leave Minnesota",
        "description": "President Trump has said he's ordered hundreds of immigration officers to leave Minnesota - although around 2,000 will remain in the state.",
        "url": "https://news.sky.com/story/trump-orders-700-immigration-officers-to-leave-minnesota-13503441",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-minneapolis-ice_7156008.jpg?20260204225539",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-04 22:36:00",
        "Headline": "The president confirms the pullout, which comes after the deaths of two protesters, but 2,000 will remain in the state.",
        "Content": "President Trump has said he's ordered hundreds of immigration officers to leave Minnesota - although around 2,000 will remain in the state. The pullback comes amid fury over the deaths of two protesters in altercations with federal officials. The president's border czar, Tom Homan, announced the move on Wednesday and said about 700 would leave the state immediately after local officials agreed to hand over arrested immigrants. Renee Good and Alex Pretti were shot dead in separate incidents last month in Minneapolis, Minnesota's biggest city, as they protested against the actions of masked agents ordered in by the Trump administration. Local officials have attacked heavy-handed tactics that have seen ICE (Immigration and Customs Enforcement) officers grab some people off the street and have made it clear they want them out. President Trump confirmed to Sky's US partner, NBC News, he had approved the order to cut numbers, adding: \"But it didn't come from me because I just wanted to do it. \"We have - we are waiting for them to release prisoners, give us the murderers that they're holding and all of the bad people, drug dealers, all of the bad people.\" \n                  ICE agents in Minneapolis to be issued with body-worn cameras after fatal shootings\n                 \n                  Nicki Minaj and Donald Trump - what's that about?\n                 \n                  Trump endorses deal struck with Democrats to avert government shutdown\n                 Mr Trump added: \"We allowed in our country, I say, 25 million people with an open-border policy for four years under Biden, and that group the autopen group, I call them. \"We allowed to come into our country people the likes of which no country would accept. And we're getting 'em out.\" However, Mr Trump also continued a recent slight softening in some of his language, telling NBC News \"maybe we can use a little bit of a softer touch - but you still have to be tough\". Minnesota governor Tim Walz and Minneapolis mayor Jacob Frey said the cut in numbers was a start - but that the whole operation needed to end quickly. \"We need a faster and larger drawdown of forces, state-led investigations into the killings of Alex Pretti and Renee Good, and an end to this campaign of retribution,\" the Democrat governor posted on social media. Such a hope currently looks unrealistic however. In his announcement on Wednesday, border chief Mr Homan stressed the effort to remove illegal aliens would continue at pace. \"Let me be clear, ​President Trump fully intends to achieve mass deportations during this administration, and immigration enforcement actions will continue every day throughout this country,\" he said. Vice president JD Vance also said the officers being pulled out were mainly protecting those carrying out arrests. \"We're not drawing down the immigration enforcement,\" he said in an interview on The Megyn Kelly Show. The operation in Minnesota - Operation Metro Surge - ramped up in January as President Trump looked to fulfill election promises to deport illegal immigrants and people without proper documentation. ICE, part of the Department of Homeland Security, have also been deployed in cities such as Los Angeles and Chicago, where their presence has also attracted anger from officials and significant protests."
    },
    {
        "title": "'Real danger' of fresh nuclear arms race as US-Russia treaty expires",
        "description": "We're about to enter a world without nuclear arms control.",
        "url": "https://news.sky.com/story/real-danger-of-fresh-nuclear-arms-race-as-us-russia-treaty-expires-13503267",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-missile-weapons-us_7155597.jpg?20260204153614",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2026-02-04 14:53:00",
        "Headline": "For the first time in more than half a century, there will be no legal limits on American and Russian missiles and warheads.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n We're about to enter a world without nuclear arms control. The last remaining treaty capping the arsenals of Russia and the US will expire on Thursday. It means, for the first time in more than half a century, there will be no legal limits on their missiles and warheads, and there are fears we are on the brink of a new arms race. \"It's a serious situation,\" Vasily Kashin, a research fellow at Moscow's Higher School of Economics, told Sky News. \"Probably now we can witness a lot of developments, especially in the US nuclear policy, and the situation will be quite unpredictable. \"There is a real danger of a nuclear arms race in the coming years.\" The first agreement on arms control between the world's nuclear superpowers was in 1972, signed by US president Richard Nixon and Soviet leader Leonid Brezhnev. The aim was to slow the arms race and prevent a catastrophic misunderstanding. Even at the height of the Cold War, these two rivals could agree on that. In 1991, as the Soviet Union fell, George Bush senior and Mikhail Gorbachev signed the START treaty. It was the first time both sides had to reduce their arsenals and it marked the start of an inspection framework, so that each side could check the other was complying with the limits. The most recent treaty - the New START - was signed in 2010, by Barack Obama and Dmitry Medvedev, before being extended for five years in 2021. On each side, the number of deployed strategic warheads are capped at 1,550, and the number of delivery vehicles are limited to 700. That's more than enough for Russia and the US to destroy each other but it's a cap nonetheless. And when this treaty expires on Thursday, that cap will no longer exist, ending decades of arms control cooperation. So how have we reached this point? The Kremlin's invasion of Ukraine in 2022 saw a breakdown in Russia-US relations, to the point where talks to negotiate a new treaty were never even scheduled. The terms of the current treaty allow only for one formal extension. Vladimir Putin has proposed an informal rollover for 12 months, but Donald Trump so far hasn't agreed. Some believe he's crazy not to, fearing the US will be the one that loses out if there is an arms race. Read more: Doomsday Clock closer to midnight than ever But others believe it's a good move, leaving America free to compete with the nuclear build-up of other countries like China. And China's clearly on the US president's mind - he says he wants a new trilateral treaty that includes Beijing. But those who've worked on these things warn that it's wishful thinking. \"We never tried trilateral [talks] actually,\" Nikolai Sokov, a former Soviet and Russian arms control negotiator, told Sky News. \"Who says it's going to be trilateral? The official Russian position and the official Chinese position is that negotiations can be bilateral between the United States and Russia, or they can be five-party, including the United Kingdom and France.\" So barring any last-minute deal, we're entering unchartered territory and who knows for how long. The strategic stability won't change overnight but the absence of any agreement shows how far US-Russia relations have fallen. And it could make the world a much more dangerous place."
    },
    {
        "title": "Washington Post: Sports section eliminated ahead of Olympic Winter Games",
        "description": "US newspaper The Washington Post is making a third of its staff redundant, bosses at the title have said.",
        "url": "https://news.sky.com/story/washington-post-sports-section-eliminated-ahead-of-olympic-winter-games-13503365",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-washington-post_7155813.jpg?20260204194145",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-04 19:43:00",
        "Headline": "Layoffs see the sports section, several foreign bureaus and the newspaper's books coverage all scrapped as the executive editor tells staff it \"can't be everything to everyone\".",
        "Content": "US newspaper The Washington Post is making a third of its staff redundant, bosses at the title have said. The long-rumoured layoffs, affecting almost all areas of the newsroom, were confirmed to employees in a video conference on Wednesday. Afterwards, they received emails with one of two subject lines - telling them their role was either going or being kept. Among the departments being scrapped is the sports section, along with several foreign bureaus and the newspaper's books coverage. In a note to staff, executive editor Matt Murray called the move painful but necessary to put it on a stronger footing and weather changes in technology and user habits, telling them the Post \"can't be everything to everyone\". Mr Murray said: \"Significantly, our daily story output has substantially fallen in the last five years\", adding: \"And even as we produce much excellent work, we too often write from one perspective, for one slice of the audience.\" The layoff comes days after the more than 145-year-old newspaper scaled back its coverage of the 2026 Winter Olympics amid mounting financial losses. \n                  'No space for Bezos': Hundreds protest against billionaire's wedding on final day of Venice celebrations\n                 \n                  Lauren Sanchez shares picture with Jeff Bezos as they tie the knot in star-studded ceremony in Venice\n                 \n                  Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests\n                 Claire Parker, the paper's Cairo bureau chief, announced her redundancy on X, along with all of the newspaper's Middle East correspondents and editors, saying it was \"hard to understand the logic\". Some, including former editor Martin Baron, criticised owner Jeff Bezos. Mr Baron, the Post's first editor under the Amazon founder, said his former boss was guilty of \"a case study in near-instant, self-inflicted brand destruction\". Margaret Sullivan, a journalism professor and former columnist at the Post and The New York Times, said the layoffs were \"devastating news for anyone who cares about journalism in America and, in fact, the world. \"The Washington Post has been so important in so many ways, in news coverage, sports and cultural coverage.\" Mr Bezos, who has not commented, has typically had a hands-off approach to the paper's editorial policy since he bought the Post in 2013. But this appeared to change during last year's US presidential election when he blocked the Post's editorial board from publishing an endorsement for Donald Trump's rival Kamala Harris. Read more on Sky News:Winter Olympics - all you need to knowInternet watchdog investigates Grok At 8pm UK time (3pm, Washington time), there was no mention of the layoffs on the paper's home page or media index page, nor had they been announced on the title's X account. The Post is renowned for its coverage of the Watergate Scandal in the early 1970s, leading to the resignation of US President Richard Nixon."
    },
    {
        "title": "Murder investigation launched after student stabbed in Leicester",
        "description": "An 18-year-old man has been arrested on suspicion of murder after a university student was stabbed in Leicester&#160;city centre.",
        "url": "https://news.sky.com/story/murder-investigation-launched-after-student-stabbed-in-leicester-13503196",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-de-montfort-university_7155275.jpg?20260204110518",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-04 12:28:00",
        "Headline": "Police were called to the scene just after 5pm on Tuesday following a report a man had collapsed near De Montfort University.",
        "Content": "An 18-year-old man has been arrested on suspicion of murder after a university student was stabbed in Leicester city centre. Police were called just after 5pm on Tuesday following a report a man had collapsed in Oxford Street, close to the junction with Bonners Lane, near De Montfort University. While officers were on their way to the scene, it was reported the victim - aged in his 20s - had been stabbed, Leicestershire Police said. He was taken to Leicester Royal Infirmary where he died a short time later, the force added. De Montfort University said the victim was one of its students. The university's vice-chancellor, Professor Katie Normington, said: \"We are devastated to confirm the tragic death of one of our students. \"Our thoughts are with everyone who is affected by what has happened. \"We are offering direct support to students, staff and the family of the victim.\" Police said it is believed the victim was involved in an altercation with another man in the street, who left the scene before officers arrived. Read more from Sky News:Snooker legend John Virgo diesBaby formula recalled due to toxin Detective Inspector Lorna Granville said: \"CCTV in the area is currently being reviewed and officers are speaking to potential witnesses to assist with our investigation. \"We know a lot of people came to the aid of the victim before emergency services arrived and we want to thank them for their help. \"If you were one of these people and you haven't yet spoken to police, please make contact with us. \"We know the area was also busy with motorists driving along Oxford Street. \"If you saw anything or captured footage on dash cam as you drove past the area we would also like to hear from you.\""
    },
    {
        "title": "Saturday Night Live UK comedians revealed ahead of series launch",
        "description": "Saturday Night Live has announced the comedians cast for the first UK incarnation of the hit late-night US series.",
        "url": "https://news.sky.com/story/saturday-night-live-uk-comedians-revealed-ahead-of-series-launch-13503170",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-saturday-night-live_7155316.jpg?20260204120838",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-04 17:00:00",
        "Headline": "SNL, broadcast on NBC in the US, is a pop culture institution which launched the careers of stars including Bill Murray, Tina Fey and Eddie Murphy. The first UK incarnation launches on Sky next month.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Saturday Night Live has announced the comedians cast for the first UK incarnation of the hit late-night US series. They include Taskmaster stars Ania Magliano and Emma Sidi, Black Ops star Hammed Animashaun, and Ayoade Bamgboye, who was named best newcomer at the Edinburgh Comedy Awards last year. Larry Dean, who has appeared on Live At The Apollo, and Celeste Dring, whose credits include This Country and Lazy Susan, also feature in the SNL UK cast of 11, along with Paddy Young (Everyone Else Burns and Mitchell & Webb Are Not Helping) and \"Instagram heartthrob\" Al Nash. George Fouracres (Steve), Jack Shep (Big Boys) and Annabel Marlow (Six The Musical) complete the line-up, billed as the \"new generation\" of British comedians. SNL, broadcast on NBC in the US, is an American pop culture institution which has been running for 50 years, and launched the careers of stars including Bill Murray, Tina Fey, Eddie Murphy, Pete Davidson, Kristen Wiig and Will Ferrell. The first UK version is set to launch on Sky in March, with a guest host helming the show each week. Star hosts in the US last year included Sabrina Carpenter, Ariana Grande, Josh O'Connor, Glen Powell, Golden Globes presenter Nikki Glaser and recent Grammy winner Bad Bunny. \"I just love sketch comedy,\" said Dean, on why he wanted to join the show. \"There have been so many people who have appeared on Saturday Night Live, either as hosts or part of the cast, that are my comedy heroes - like Jim Carrey, Richard Pryor, Mike Myers, Dana Carvey.\" Fouracres said he had often watched clips of the US show and thought, \"I wish we had that. Why don't we have something like that?\" Being part of the new show \"blows my tiny mind\", he added. Producers announced the UK show's creative team in November and have said writers will also be revealed soon. Written, rehearsed and performed in the week of each show, every episode will be staged in front of a live studio audience and feature an opening monologue, topical sketches, live music, and a UK take on SNL's famous news satire, Weekend Update. Lead producer James Longman said the UK cast members represent \"the freshest voices we have\" and are \"bold, exciting and of course, incredibly funny\". Read more:The Ozzy tape found in an attic after 46 yearsKPop Demon Hunters singers to perform at BAFTAs The UK show will be overseen by US producer Lorne Michaels. Phil Edgar Jones, executive director for unscripted originals at Sky, said the time is right for the show as \"we all need a laugh like never before\". \"The show's long-standing legacy of discovering and nurturing outstanding comedy talent speaks for itself, and this UK version will build on that legacy with the support of Lorne Michaels, a brilliant local production team, and an exciting new generation of voices,\" he said. Saturday Night Live UK will be broadcast on Sky and streaming service NOW from 21 March."
    },
    {
        "title": "PM in 'precarious position' after MPs force climbdown over Mandelson files release",
        "description": "Sir Keir Starmer is facing growing anger among Labour MPs and renewed speculation about his future after being forced to publish files about his decision to appoint Peter Mandelson as the UK's US ambassador.",
        "url": "https://news.sky.com/story/mps-force-sir-keir-starmer-to-publish-files-about-peter-mandelsons-appointment-as-us-ambassador-13503373",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-keir-starmer_7155468.jpg?20260204132631",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-04 20:24:00",
        "Headline": "After Labour MPs refused to back the government, the PM will be forced to share documents with parliament amid a Metropolitan Police investigation into Lord Mandelson's conduct.",
        "Content": "Sir Keir Starmer is facing growing anger among Labour MPs and renewed speculation about his future after being forced to publish files about his decision to appoint Peter Mandelson as the UK's US ambassador. The government had signalled it would release most of the documents following revelations about Lord Mandelson's relationship with convicted paedophile Jeffrey Epstein. Tap here for the latest on the Epstein files But the prime minister's original plan was for his top civil servant to determine whether any should remain secret on national security grounds, or because they could prejudice international relations. He was forced into a climbdown after interventions from senior Labour MPs during a dramatic Commons session on Wednesday, including former deputy prime minister Angela Rayner, while Conservative leader Kemi Badenoch accused Sir Keir of an attempted \"cover-up\". MPs eventually backed a compromise that will see parliament's Intelligence and Security Committee determine what should be done with the more sensitive files - but it leaves Sir Keir in the most perilous position of his premiership. Sky News political editor Beth Rigby described the mood in parliament as a \"tinderbox\", with one senior ally of the prime minister unwilling to rule out resignations from government. \"Temperatures are running high,\" they said. Police probe delays release of files Despite the Commons drama, it is unclear when any documents will be shared with parliament and published by the government amid a police investigation into Lord Mandelson for misconduct in public office. The Metropolitan Police said it had advised the government \"the release of specific documents could undermine our current investigation\". \"We therefore asked them not to release certain documents at this time,\" the force added. Rigby said there is \"deep frustration\" inside Number 10 about the situation, as it's hoped the release of the files will support the prime minister's assertion that Lord Mandelson repeatedly lied to him about the depths of his relationship with Epstein. \"But with their hands tied, and the mood this febrile, the prime minister is in a precarious position,\" she added. Starmer: I regret appointing Mandelson Downing Street has conceded that the prime minister was aware of Lord Mandelson's links to Epstein when his appointment as US ambassador was confirmed early last year. Speaking at Prime Minister's Questions, Sir Keir insisted a due diligence process had taken place, but said: \"What was not known was the depth, the sheer depth, and the extent of the relationship.\" \"He lied about that to everyone for years, and new information was published in September showing the relationship was materially different from what we'd been led to believe,\" he told MPs. \"When the new information came to light, I sacked him.\" He added: \"I regret appointing him. If I knew then what I know now, he would never have been anywhere near government.\" Sir Keir is set to face questions from the media today about the crisis engulfing his administration, after he gives a speech about plans for investment in the UK's most deprived communities. How did we get here? The scandal erupted again last Friday when the US Department of Justice published a tranche of over three million Epstein files documents, which included emails that appear to show Lord Mandelson shared sensitive internal government information with the financier while serving in Gordon Brown's government. It led to the Metropolitan Police opening its investigation into Lord Mandelson for alleged misconduct in public office, which followed referrals from both the Cabinet Office and Mr Brown. Lord Mandelson resigned his membership of the Labour Party on Sunday. He denied any record or recollection of the payments, but said he did \"not wish to cause further embarrassment\" to the party. Sky News has approached representatives for Lord Mandelson for comment. Being named in the Epstein files is not a sign of wrongdoing, and Lord Mandelson has expressed regret about his past ties to the paedophile, saying in a statement: \"I was wrong to believe Epstein following his conviction, and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" Lord Mandelson has not responded to the latest allegations. However, in an interview with The Times carried out last week, but published on Monday, he referred to a \"handful of misguided historical emails, which I deeply regret sending\", and described Epstein as \"muck that you can't get off your shoe\"."
    },
    {
        "title": "Beth Rigby: Even Starmer's allies are unsure about his future",
        "description": "By my reckoning, yesterday will be remembered as perhaps the most difficult of Sir Keir Starmer's premiership yet, with even close allies telling me they are not sure where it will end.",
        "url": "https://news.sky.com/story/beth-rigby-even-starmers-allies-are-unsure-about-his-future-13503409",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starmer-pmqs_7156040.jpg?20260204235154",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-04 21:57:00",
        "Headline": "Some Labour MPs consider Sir Keir Starmer's decision to appoint Peter Mandelson as US ambassador an unforgivable lapse of judgement.",
        "Content": "\n          Political editor\n              @BethRigby\n By my reckoning, yesterday will be remembered as perhaps the most difficult of Sir Keir Starmer's premiership yet, with even close allies telling me they are not sure where it will end. His admission at Prime Minister's Questions that he knew of the friendship between Peter Mandelson and Jeffrey Epstein when he appointed him as US ambassador hardened the sentiment of many a Labour MP who was willing to give him the benefit of the doubt. Insiders tell me that changed when Starmer told the Commons that security vetting had confirmed the continued friendship between Mandelson and Epstein after the financier was jailed for child prostitution offences, leaving MPs furious at the prime minister and his aides for allowing the ex-Labour minister back into the heart of government. Some MPs consider this an unforgivable lapse of judgement. Number 10 has compromised on the release of files relating to Mandelson's appointment. It will now be for the independent Intelligence and Security Committee, and not the PM's top civil servant, as was planned, to decide what should be held back in the interests of national security and international relations. But that Number 10 had to cave to backbenchers - led by Angela Rayner - concerned about a \"cover-up\" (as the Conservative leader Kemi Badenoch put it) is symbolic of the breakdown of trust. A tinderbox that could erupt There were rumours flying around that Morgan McSweeney, Starmer's chief of staff, was about to resign - as a few MPs publicly called for him to do so over the decision to reinsert Mandelson into government in 2025. I'd describe the mood in parliament yesterday evening as a tinderbox, with even some of the PM's allies unsure about whether the situation is about to erupt. When I asked one senior ally whether there could be a challenge or resignations that could predicate a challenge, there was a long pause. \"Temperatures are running high,\" said the figure, acknowledging that when the mood is as it is, and Sir Keir is where he is in the polls, someone moving against him is a risk. Another senior figure told me many MPs felt deeply compromised over the scandal, including some ministers. Read more from Sky News:Murder investigation launched after student stabbedSix Palestine Action activists cleared of aggravated burglary As for the No 10 end, there is deep frustration that the government has been blocked by the Metropolitan Police from releasing information about what Mandelson told the PM and others about his relationship with Epstein. The intention had been to release this information straight away in order to back up what the PM said in the Commons, but Downing Street has been thwarted as it stands. There is a view that the release would have been helpful because it would have perhaps led to MPs directing their anger at Mandelson. The PM's team are in a bind because they want the information out, but they don't want to do anything that would affect a criminal investigation with the Met. One option for Downing Street now could be to go back to the Met and see what they can release. But with their hands tied, and the mood this febrile, the prime minister is in a precarious position as the Mandelson crisis raises MPs' anger and leadership speculation all over again."
    },
    {
        "title": "Mandelson-Epstein files: Keir Starmer may be facing his very own Profumo scandal",
        "description": "Is the Mandelson-Epstein crisis Sir Keir Starmer's Profumo scandal?",
        "url": "https://news.sky.com/story/the-sex-and-secrets-scandal-which-could-bring-down-another-prime-minister-more-than-60-years-on-from-profumo-13503392",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-john-profumo-christine-keeler_7156032.jpg?20260204232411",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2026-02-04 21:22:00",
        "Headline": "After a chaotic Commons showdown, some MPs are predicting that the Peter Mandelson scandal will bring down Sir Keir Starmer.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Is the Mandelson-Epstein crisis Sir Keir Starmer's Profumo scandal? Both involved sex, call girls, lurid revelations and a police investigation. Tap here for the latest on the Epstein files The Profumo scandal brought down Tory prime minister Harold Macmillan in the early 1960s. Secretary of state for war John Profumo had an affair with call girl Christine Keeler, who was also involved with a Soviet naval attache. Profumo lied to parliament about his affair, Macmillan's handling of the crisis was seen as hopeless - and he failed to confront Profumo about the affair. Months later, Macmillan was gone. Could it happen again? Now, after an excruciating Prime Minister's Questions, followed by a chaotic Commons showdown on Mandelson, senior MPs are predicting the current scandal will bring down Starmer. 'It's absolutely inevitable' \"The Profumo affair brought down Harold Macmillan,\" SNP Westminster leader Stephen Flynn told Sky News. \"This will bring down Keir Starmer. \"It's absolutely inevitable. Today he chose to be clear, and revealed to the nation what he knew and when. And in doing so he showed a clear lack of judgement, which has broken trust with the people of these isles. \"That's unforgivable for a prime minister, and it's ultimately going to lead to his departure from No 10.\" But Flynn isn't alone with his astonishing prediction. His ally Liz Saville-Roberts, Plaid Cymru's Westminster leader, told Sky News: \"A number of people are comparing this to the Profumo scandal. \"And, of course, these scandals start slowly and then they speed up. We're seeing it speed up now.\" Read more:What is misconduct in a public office?Mandelson had no alternative but to resignEpstein files: Key findings so far That's the view from the prime minister's opponents, of course. And it must be said that the Commons debate on a Tory demand for the release of a Mandelson \"paper trail\" ended with the government's last-minute compromise being approved \"on the nod\", and MPs of all parties claiming it was a good outcome. A last-minute government amendment on a scrap of paper gave parliament's Intelligence and Security Committee (ISC) the power to vet which sensitive documents about Mandelson should be released, and which shouldn't. Rayner's ominous intervention The government's previous position, that \"papers prejudicial to UK national security or international relations\" should be kept secret, incensed MPs of all parties, and the PM was heading for a humiliating rebellion and possible defeat. Ominously for the PM, it was Angela Rayner, his former deputy now banished to the back benches after her stamp duty dodge, that forced him into a U-turn. There was a sharp intake of breath from MPs as the rose to her feet and made what sounded like a perfectly sensible proposal. The ISC should look at the papers, in \"keeping public confidence in the process\", she said. But MPs are nothing if not conspiracy theorists. Was she signalling she might vote with the Tories? Was she twisting the knife? Or was she being helpful? Probably all three. By the end of the debate, many gloomy Labour MPs were in despair at Sir Keir's faltering and unconvincing performance at PMQs, and the shambolic government U-turn on publishing the Mandelson files. Was the red queen serving notice that she's ready to seize Starmer's crown? Certainly, his terrible judgement in appointing Mandelson as US ambassador has left him even more vulnerable than ever to a leadership challenge. And the Mandelson-Epstein furore is suddenly being compared by MPs to another sex and secrets scandal that brought down a prime minister more than 60 years ago."
    },
    {
        "title": "Murder investigation launched after student stabbed in Leicester",
        "description": "An 18-year-old man has been arrested on suspicion of murder after a university student was stabbed in Leicester&#160;city centre.",
        "url": "https://news.sky.com/story/murder-investigation-launched-after-student-stabbed-in-leicester-13503196",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-de-montfort-university_7155275.jpg?20260204110518",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-04 12:28:00",
        "Headline": "Police were called to the scene just after 5pm on Tuesday following a report a man had collapsed near De Montfort University.",
        "Content": "An 18-year-old man has been arrested on suspicion of murder after a university student was stabbed in Leicester city centre. Police were called just after 5pm on Tuesday following a report a man had collapsed in Oxford Street, close to the junction with Bonners Lane, near De Montfort University. While officers were on their way to the scene, it was reported the victim - aged in his 20s - had been stabbed, Leicestershire Police said. He was taken to Leicester Royal Infirmary where he died a short time later, the force added. De Montfort University said the victim was one of its students. The university's vice-chancellor, Professor Katie Normington, said: \"We are devastated to confirm the tragic death of one of our students. \"Our thoughts are with everyone who is affected by what has happened. \"We are offering direct support to students, staff and the family of the victim.\" Police said it is believed the victim was involved in an altercation with another man in the street, who left the scene before officers arrived. Read more from Sky News:Snooker legend John Virgo diesBaby formula recalled due to toxin Detective Inspector Lorna Granville said: \"CCTV in the area is currently being reviewed and officers are speaking to potential witnesses to assist with our investigation. \"We know a lot of people came to the aid of the victim before emergency services arrived and we want to thank them for their help. \"If you were one of these people and you haven't yet spoken to police, please make contact with us. \"We know the area was also busy with motorists driving along Oxford Street. \"If you saw anything or captured footage on dash cam as you drove past the area we would also like to hear from you.\""
    },
    {
        "title": "Snooker player and popular broadcaster and commentator John Virgo dies aged 79",
        "description": "Former player and broadcaster John Virgo has died at the age of 79, World Snooker has announced.",
        "url": "https://news.sky.com/story/snooker-legend-john-virgo-dies-aged-79-13503060",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-john-virgo-snooker_7155176.jpg?20260204093253",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-04 07:40:00",
        "Headline": "Tributes have been paid to the iconic player - whose larger-than-life personality made him beloved by TV audiences.",
        "Content": "Former player and broadcaster John Virgo has died at the age of 79, World Snooker has announced. He died at his home in Spain, World Seniors Snooker chairman Jason Francis said on social media. In a touching tribute, Mr Francis described the star on X as \"an amazingly loyal friend to me, and someone you felt was sat with you at the match when he was commentating on TV\". He added: \"JV was doing what he loved to do right up until the end, entertaining everyone. \"Such an important person in my life, but in our sport in general.\" Virgo's most notable victory was in the final of the 1979 UK Championship, where he defeated Terry Griffiths. Other key career wins include the 1980 Bombay International, 1980 Pontins Professional and the 1984 Professional Snooker League. \n                  PM in 'precarious position' after MPs force climbdown over Mandelson files release\n                 \n                  Beth Rigby: Even Starmer's allies are unsure about his future\n                 \n                  Mandelson-Epstein files: Keir Starmer may be facing his very own Profumo scandal\n                 He was inducted into the World Snooker Tour Hall of Fame in 2023 in recognition of his contributions to the sport as a player and broadcaster Born in Salford, Greater Manchester, he came to attention in the late 1970s. Read more from Sky News:Teen swims four hours to save familyAir India flight grounded after 'possible defect' In 1979 he surprised fans by reaching the semi-finals of the World Championship. An unfancied bet pre-tournament, Virgo beat former champion Alex Higgins in the quarter-finals before losing 16-15 to Terry Griffiths, who went on to win the championship, in the semis. But his biggest moment came later that year when he won the UK Championship, again beating Griffiths in a tight match, this time in the final, 14-13 at the Guild Hall in Preston. Following his retirement in 1994, he went on to have a successful broadcasting career with the BBC. He co-hosted the snooker-themed BBC TV show Big Break with comedian Jim Davidson during the 1990s. During his time on the show, he earned a comedic reputation for his impressions of snooker stars. In retirement, he also began playing exhibition games - where he became known for pulling off trick shots. Virgo also lent his hand at acting - playing himself in a radio play, Sunk, which follows an aspiring snooker player. He also spoke candidly about his gambling addiction, with reports quoting him as admitting he borrowed £200,000 against his mortgage. He is survived by his wife, publishing executive Rosie Ries, and his two children, Gary and Brook-Leah Virgo. Former snooker player Mike Dunn described Virgo as a \"great human being\" in a social media post. He said: \"Very sadly I've just woke to the news that the great John Virgo has passed away. \"'I'm speechless and don't know what to say. \"I loved working with him, he was a great human being.\""
    },
    {
        "title": "Saturday Night Live UK comedians revealed ahead of series launch",
        "description": "Saturday Night Live has announced the comedians cast for the first UK incarnation of the hit late-night US series.",
        "url": "https://news.sky.com/story/saturday-night-live-uk-comedians-revealed-ahead-of-series-launch-13503170",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-saturday-night-live_7155316.jpg?20260204120838",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-04 17:00:00",
        "Headline": "SNL, broadcast on NBC in the US, is a pop culture institution which launched the careers of stars including Bill Murray, Tina Fey and Eddie Murphy. The first UK incarnation launches on Sky next month.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Saturday Night Live has announced the comedians cast for the first UK incarnation of the hit late-night US series. They include Taskmaster stars Ania Magliano and Emma Sidi, Black Ops star Hammed Animashaun, and Ayoade Bamgboye, who was named best newcomer at the Edinburgh Comedy Awards last year. Larry Dean, who has appeared on Live At The Apollo, and Celeste Dring, whose credits include This Country and Lazy Susan, also feature in the SNL UK cast of 11, along with Paddy Young (Everyone Else Burns and Mitchell & Webb Are Not Helping) and \"Instagram heartthrob\" Al Nash. George Fouracres (Steve), Jack Shep (Big Boys) and Annabel Marlow (Six The Musical) complete the line-up, billed as the \"new generation\" of British comedians. SNL, broadcast on NBC in the US, is an American pop culture institution which has been running for 50 years, and launched the careers of stars including Bill Murray, Tina Fey, Eddie Murphy, Pete Davidson, Kristen Wiig and Will Ferrell. The first UK version is set to launch on Sky in March, with a guest host helming the show each week. Star hosts in the US last year included Sabrina Carpenter, Ariana Grande, Josh O'Connor, Glen Powell, Golden Globes presenter Nikki Glaser and recent Grammy winner Bad Bunny. \"I just love sketch comedy,\" said Dean, on why he wanted to join the show. \"There have been so many people who have appeared on Saturday Night Live, either as hosts or part of the cast, that are my comedy heroes - like Jim Carrey, Richard Pryor, Mike Myers, Dana Carvey.\" Fouracres said he had often watched clips of the US show and thought, \"I wish we had that. Why don't we have something like that?\" Being part of the new show \"blows my tiny mind\", he added. Producers announced the UK show's creative team in November and have said writers will also be revealed soon. Written, rehearsed and performed in the week of each show, every episode will be staged in front of a live studio audience and feature an opening monologue, topical sketches, live music, and a UK take on SNL's famous news satire, Weekend Update. Lead producer James Longman said the UK cast members represent \"the freshest voices we have\" and are \"bold, exciting and of course, incredibly funny\". Read more:The Ozzy tape found in an attic after 46 yearsKPop Demon Hunters singers to perform at BAFTAs The UK show will be overseen by US producer Lorne Michaels. Phil Edgar Jones, executive director for unscripted originals at Sky, said the time is right for the show as \"we all need a laugh like never before\". \"The show's long-standing legacy of discovering and nurturing outstanding comedy talent speaks for itself, and this UK version will build on that legacy with the support of Lorne Michaels, a brilliant local production team, and an exciting new generation of voices,\" he said. Saturday Night Live UK will be broadcast on Sky and streaming service NOW from 21 March."
    },
    {
        "title": "'Real danger' of fresh nuclear arms race as US-Russia treaty expires",
        "description": "We're about to enter a world without nuclear arms control.",
        "url": "https://news.sky.com/story/real-danger-of-fresh-nuclear-arms-race-as-us-russia-treaty-expires-13503267",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-missile-weapons-us_7155597.jpg?20260204153614",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2026-02-04 14:53:00",
        "Headline": "For the first time in more than half a century, there will be no legal limits on American and Russian missiles and warheads.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n We're about to enter a world without nuclear arms control. The last remaining treaty capping the arsenals of Russia and the US will expire on Thursday. It means, for the first time in more than half a century, there will be no legal limits on their missiles and warheads, and there are fears we are on the brink of a new arms race. \"It's a serious situation,\" Vasily Kashin, a research fellow at Moscow's Higher School of Economics, told Sky News. \"Probably now we can witness a lot of developments, especially in the US nuclear policy, and the situation will be quite unpredictable. \"There is a real danger of a nuclear arms race in the coming years.\" The first agreement on arms control between the world's nuclear superpowers was in 1972, signed by US president Richard Nixon and Soviet leader Leonid Brezhnev. The aim was to slow the arms race and prevent a catastrophic misunderstanding. Even at the height of the Cold War, these two rivals could agree on that. In 1991, as the Soviet Union fell, George Bush senior and Mikhail Gorbachev signed the START treaty. It was the first time both sides had to reduce their arsenals and it marked the start of an inspection framework, so that each side could check the other was complying with the limits. The most recent treaty - the New START - was signed in 2010, by Barack Obama and Dmitry Medvedev, before being extended for five years in 2021. On each side, the number of deployed strategic warheads are capped at 1,550, and the number of delivery vehicles are limited to 700. That's more than enough for Russia and the US to destroy each other but it's a cap nonetheless. And when this treaty expires on Thursday, that cap will no longer exist, ending decades of arms control cooperation. So how have we reached this point? The Kremlin's invasion of Ukraine in 2022 saw a breakdown in Russia-US relations, to the point where talks to negotiate a new treaty were never even scheduled. The terms of the current treaty allow only for one formal extension. Vladimir Putin has proposed an informal rollover for 12 months, but Donald Trump so far hasn't agreed. Some believe he's crazy not to, fearing the US will be the one that loses out if there is an arms race. Read more: Doomsday Clock closer to midnight than ever But others believe it's a good move, leaving America free to compete with the nuclear build-up of other countries like China. And China's clearly on the US president's mind - he says he wants a new trilateral treaty that includes Beijing. But those who've worked on these things warn that it's wishful thinking. \"We never tried trilateral [talks] actually,\" Nikolai Sokov, a former Soviet and Russian arms control negotiator, told Sky News. \"Who says it's going to be trilateral? The official Russian position and the official Chinese position is that negotiations can be bilateral between the United States and Russia, or they can be five-party, including the United Kingdom and France.\" So barring any last-minute deal, we're entering unchartered territory and who knows for how long. The strategic stability won't change overnight but the absence of any agreement shows how far US-Russia relations have fallen. And it could make the world a much more dangerous place."
    },
    {
        "title": "'More than 170' killed in suspected Islamist attack in Nigeria",
        "description": "At least 170 people have been killed by a mob of gunmen in Nigeria, a local lawmaker has told the Reuters news agency.",
        "url": "https://news.sky.com/story/more-than-170-killed-in-suspected-islamist-attack-in-nigeria-13503252",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigeria-church-kidnapping_7139894.jpg?20260119174606",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-04 14:40:00",
        "Headline": "Villagers had their hands bound behind their backs and were executed, officials claimed.",
        "Content": "At least 170 people have been killed by a mob of gunmen in Nigeria, a local lawmaker has told the Reuters news agency. The attack on the remote village of Woro on Tuesday is among the deadliest of the year so far in a country currently rocked by sectarian violence. The jihadist raiders had demanded villagers embrace Sharia law, survivors told Reuters. When they pushed back the militants opened fire. Residents were rounded up, with their hands bound behind their backs before being executed, local lawmaker Saidu Baba Ahmed claimed. He added that authorities are still combing through the bushland to find survivors. He told Reuters: \"As I'm speaking to you ​now, I'm in the village along with military personnel, sorting dead bodies and combing the surrounding areas for more.\" \n                  Anthony Joshua pays tribute to friends killed in Nigeria crash\n                 \n                  Nigerian bandits who kidnapped 150 churchgoers demand motorbikes in return\n                 \n                  Nigerian troops rescue 62 hostages in crackdown on armed gangs, army says\n                 The attackers also torched homes and shops before fleeing. Read more from Sky News:Teen swims four hours to save familyAir India flight grounded after 'possible defect' Woro sits in the central region of Kwara - an area increasingly targeted by gunmen who raid ​villages, kidnap residents and loot livestock. Kwara police spokesperson Adetoun Ejire-Adeyem said the police and ‌military have been mobilised to the area for a search-and-rescue ‍operation. He declined to provide exact casualty details. Just last month around 150 churchgoers were kidnapped by a group of bandits in Nigeria. Nigeria has become a focal point for the United States in recent months, after President Donald Trump accused it last year of failing to protect Christians. It led to American forces striking what they described as terrorist targets on Christmas Day."
    },
    {
        "title": "Norwegian royal's son Marius Borg Hoiby cries in court and denies videos on his phone show rape",
        "description": "The eldest son of Norway's crown princess has denied that videos on his phone showed acts of rape as he broke down during his first day of testimony in his trial for rape and domestic violence.",
        "url": "https://news.sky.com/story/norwegian-royals-son-marius-borg-hoiby-cries-in-court-and-denies-videos-on-his-phone-show-rape-13503283",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-crown-princess-norway_7154801.jpg?20260204163304",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-04 16:06:00",
        "Headline": "The 29-year-old said the position of his mother,  Crown Princess Mette-Marit, meant that he had \"an extreme need for affirmation\".",
        "Content": "The eldest son of Norway's crown princess has denied that videos on his phone showed acts of rape as he broke down during his first day of testimony in his trial for rape and domestic violence. Marius Borg Hoiby, 29, son of Crown Princess Mette-Marit and stepson ⁠to Crown Prince Haakon, could face years in prison if found guilty of the most serious of the 38 charges against him. The case has shaken the Norwegian royal family, which has historically enjoyed high favourability ratings. On Tuesday, the first day of his trial, he pleaded not guilty to the most serious charges of rape and domestic violence, but admitted some lesser charges, including driving too fast. He also said he was partially guilty - a plea allowed under Norwegian law - of aggravated assault and reckless behaviour. On Wednesday, Hoiby broke down in tears during his first day on the witness stand, saying: \"It is very difficult for me to speak in front of so many people. \"I have been surrounded by the press since I was three. I have been harassed ever ‌since.\" \n                  Son of Norway's crown princess denies rape as trial begins in Oslo\n                 \n                  Trump's extraordinary letter to Norway about Greenland - in full and fact-checked\n                 \n                  'Cheap ceasefire' between Ukraine and Russia would create 'expensive peace' for Europe, Norway's foreign minister warns\n                 He said he had received \"heavy medication\", and would try to do as much as he could. Hoiby spoke about growing up as the son of a crown princess. He said: \"I have an extreme need for affirmation. A lot of sex, a lot of alcohol. Few can relate to the life I have led. A lot of parties, alcohol, some drugs.\" Hoiby wore jeans and a dark blue jumper over a beige shirt, and spoke with his arms crossed, occasionally consulting handwritten notes from a notebook. Some of the most serious charges against Hoiby are one count of rape ‍with sexual intercourse, and three counts of rape without intercourse, some of which the prosecution says he filmed on his telephone. He denied the videos on his phone show acts of rape, and noted that he had never shared them with anyone. \"If I had thought I had material that showed an assault, I would never have kept that material,\" he said. Read more from Sky News:Murder investigation launched after student stabbed in LeicesterTeenage boy swims for four hours to save family Hoiby's trial is scheduled to run until 19 March, and prosecutors have said that he could face up to 10 years in prison if convicted. The crown prince and princess do not plan to attend the trial of Hoiby, who is outside the line of royal succession and has no title. A monarchy under pressure The trial comes as the Norwegian royal family is facing challenges on multiple fronts. Hoiby's mother, Crown Princess Mette-Marit, is under intense scrutiny over her ties with the late sex offender Jeffrey Epstein. An opinion poll conducted on ‍Monday for daily newspaper Verdens Gang, showed only 61% of Norwegians were in favour of keeping the monarchy - a drop of 11%."
    },
    {
        "title": "How Irish police tackled Dublin's drug gangs after fake SWAT team besieged hotel during bitter feud",
        "description": "A decade on from Ireland's most notorious gangland hit, Irish police say they have had \"unprecedented\" success in tackling Dublin's drug gangs - and ending a bitter feud that claimed at least 18 lives.",
        "url": "https://news.sky.com/story/how-irish-police-tackled-dublins-drug-gangs-after-fake-swat-team-besieged-hotel-during-bitter-feud-13503315",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-regency-dublin-regency-hotel_7155719.jpg?20260204173039",
        "type": "World",
        "Author": "Stephen Murphy",
        "Date Published": "2026-02-04 16:56:00",
        "Headline": "In 2025, the Gardai recorded a total of zero gangland gun murders \"for the first time in modern times\".",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n A decade on from Ireland's most notorious gangland hit, Irish police say they have had \"unprecedented\" success in tackling Dublin's drug gangs - and ending a bitter feud that claimed at least 18 lives. In 2025, the Gardai recorded a total of zero gangland gun murders \"for the first time in modern times\" - believed to be at least 30 years. Ninety-eight members of the two most infamous organised crime groups - the Hutch and Kinahan gangs - have been jailed, and 51 attempted hits have been foiled. It was the Hollywood-style attack on the Regency Hotel that changed Ireland's crime landscape forever. On 5 February 2016, a hit squad of assassins disguised as a police SWAT team besieged a boxing weigh-in at the hotel, near Dublin Airport. AK47-style assault rifles were fired as hundreds of panicked attendees fled. Several were injured in the chaos, and one man - Kinahan associate David Byrne - was killed in the lobby. The attack, Gardai say, was carried out by the Hutch gang - their target was Daniel Kinahan, head of their bitter rivals. \n                  Summer camp leader, 76, drugged wife while he sexually assaulted children, stepson raised concerns\n                 \n                  Albanian burglars chased by ex-Aston Villa and Brentford player jailed for break-in spree\n                 \n                  Snapchat predator coerced boys to perform sex acts in exchange for Xbox and PlayStation codes\n                 It accelerated a feud that shocked Ireland with its ferocity, and ultimately backfired on both gangs as the police backlash strengthened. The Garda National Drugs and Organised Crime Bureau, only a year old, led the way. Dubliners became accustomed to heavily-armed police checkpoints in the inner city, as politicians promised all the resources necessary. The Regency Hotel shooting \"was not just an attack on a sporting event, and the murder of Mr Byrne, but an attack on our state and and an affront to all right-minded and peaceful citizens\", according to Garda Assistant Commissioner Angela Willis. The gardai responded \"with a sustained and relentless campaign to disrupt, degrade and dismantle the Hutch and Kinahan criminal organisations and their criminal activity\", she said. At a press conference in Dublin today, Detective Chief Superintendent Seamus Boland vowed that the force would not become \"complacent\" in combatting organised crime. Read more from Sky News:Son of Muammar Gaddafi shot deadEpstein files: The key findings so far \"We don't live in Nirvana\", he said, warning the continued demand for illegal drugs could fuel potential upsurge in gang violence. Now, he says, the Kinahan cartel \"no longer exists as it did in 2016\", although the Hutch group remains active and a target of investigation. Its alleged leader, Gerry \"The Monk\" Hutch, was acquitted of Mr Byrne's murder in a well-publicised trial in April 2023. Against a backdrop of policing success, Boland says he does not regard that the absence of a murder conviction a decade on as a policing failure, or a regret. \"We're not emotional about these things\", he says. \"There are no regrets.\""
    },
    {
        "title": "Son of former Libyan dictator Muammar Gaddafi shot dead",
        "description": "Saif al Islam Gaddafi, the son of Libya's late dictator Muammar Gaddafi, has been shot dead by gunmen who broke into his home, officials have said.",
        "url": "https://news.sky.com/story/son-of-former-libyan-dictator-muammar-gaddafi-shot-dead-13503083",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-saif-al-islam-gaddafi_7155205.jpg?20260204111156",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-04 08:53:00",
        "Headline": "Despite holding no official position, Saif al Islam Gaddafi was once seen as the most powerful figure in the ⁠oil-rich North African country after his father, who ruled for more than four decades.",
        "Content": "Saif al Islam Gaddafi, the son of Libya's late dictator Muammar Gaddafi, has been shot dead by gunmen who broke into his home, officials have said. The 53-year-old was killed during a \"direct confrontation\" with four armed men in the Libyan town of Zintan, south-west of the capital Tripoli, his office said in a statement on Tuesday. His lawyer, Khaled al Zaidi, and separately his adviser Abdullah Othman Abdurrahim, both confirmed his death on Facebook, without providing details. Despite holding no official position, the second son of the longtime dictator, was once seen as the most powerful figure in the ⁠oil-rich North African country after his father, who ruled for more than four decades. Saif al Islam Gaddafi shaped policy and was involved in high-profile diplomacy, including talks on weapons of mass destruction and compensation for the families of those killed in the bombing of Pan Am Flight 103 over Lockerbie in Scotland in 1988. Educated at the London School of ​Economics and a fluent English speaker, he was once seen by many governments as the acceptable, Western-friendly face of Libya. But when a rebellion broke out against his father's regime in 2011, he became an architect of ‍a brutal crackdown on rebels. After fighters took over the capital, he was captured attempting to flee to neighbouring Niger - about a month after his father was hunted down and shot dead by rebels. In 2015, a Libyan court sentenced him to death for war crimes. He was also wanted by the International Criminal Court, accused of crimes against humanity. He spent six years detained in the town of Zintan. It was a far cry from the charmed life he had lived during his father's rule when he had pet tigers and mingled with high society on trips abroad. He was released by the militia in 2017 under an amnesty. Read more from Sky News:Boy swims for four hours to save familyDeadly heavy snowfall in Japan In 2021, he attempted to run for president, but was opposed by many who had suffered at the hands of his father's rule. He was also disqualified from the election because of his 2015 conviction. His candidacy became a point of contention and the election process stalled amid arguments between powerful armed groups. In an interview with The New York Times Magazine in 2021, he discussed his political ​strategy. \"I've been away from the Libyan people for 10 years,\" he said. \"You need to come back slowly, slowly. Like a striptease. You need to play with their minds a little.\" Libya remains deeply divided, with rival administrations in the east and west, after the nation descended into anarchy following the fall of Muammar Gaddafi's regime. The former dictator was killed by opposition fighters during the uprising, which turned into a civil war. Most of his eight children had significant roles in government."
    },
    {
        "title": "At least 35 killed after weeks of heavy snowfall in Japan",
        "description": "Weeks of heavy snowfall in Japan has killed at least 35 people,  government officials have said.",
        "url": "https://news.sky.com/story/at-least-35-killed-after-weeks-of-heavy-snowfall-in-japan-13503063",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-snow-japan_7155100.jpg?20260204073707",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-04 07:29:00",
        "Headline": "Nearly 400 more have been injured, 126 people seriously - with officials warning that more severe weather is yet to come. ",
        "Content": "Weeks of heavy snowfall in Japan has killed at least 35 people,  government officials have said. And there are fears the worst is yet to come - with more heavy snowfall expected this weekend. Nearly 400 more have been injured, 126 people seriously, primarily around the northern and central regions of the country - and more than a dozen properties damaged. As of Wednesday, 15 prefectures were affected, with snow in some areas estimated to have reached up to 2m (6.5ft). Task forces have been set up and deployed to some of the worst-hit regions. Most of the fatalities and injuries reported across the country were caused by falls as people tried to clear the snow from around their homes. There have also been reports of people suffering sudden heart attacks. In the northern city of Uonuma in Niigata prefecture, a rice-growing region, a man in his 50s was found collapsed on the roof of his home. In Nagaoka city, a man in his 70s is believed to have died after falling from the roof of his house. The weather is getting warmer, but officials have warned melting snow could cause landslides. \"Please do pay close attention to your safety, wearing a helmet or using a lifeline rope, especially when working on clearing snow,\" chief cabinet secretary Minoru Kihara told reporters. Read more from Sky News:Teen swims four hours to save familyAir India flight grounded after 'possible defect' The reason behind the heavy snowfall is unclear - however snow-related deaths and accidents are not uncommon in Japan. During the six winter months last year 68 people were killed, according to the country's Fire and Disaster Management Agency."
    },
    {
        "title": "Wave of emotion as first Gazans use Rafah Crossing to return home to loved ones",
        "description": "First came the cars of the United Nations, then two coaches with blue paintwork. And then came a wave of emotion - proof that the heart has a power that the head can't always match.",
        "url": "https://news.sky.com/story/wave-of-emotion-as-first-gazans-use-rafah-crossing-to-return-home-to-loved-ones-13503288",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-rafah-gaza-parsons_7155671.png?20260204165846",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-02-04 16:19:00",
        "Headline": "People torn from friends and relatives describe the \"indescribable feeling\" of returning to Gaza as Israeli airstrikes claim more lives.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n First came the cars of the United Nations, then two coaches with blue paintwork. And then came a wave of emotion - proof that the heart has a power that the head can't always match. How to explain the logic of people desperate to return to the shattered ruins of Gaza? To leave behind the safety and sanctuary of life in Egypt, and to rush back to a place where you search for running water, dream of functioning hospitals and fear the effects of airstrikes, collapsing buildings and unexploded bombs. The only explanation is the profound sense of longing that can affect us all when we are separated from family, friends and the place we consider our home. And so it is in Gaza. The people who came out of those coaches were among the first to have crossed the Rafah Crossing to pursue their dream of returning to Gaza. It's estimated that more than 40,000 people fled the Strip during the war. These were the first to come back. Foreign journalists are banned from entering Gaza, but our Gazan colleagues have been reporting on our behalf ever since the war began. As they filmed, they saw a stream of emotional reunions and outpourings of joy. \n                  Reopening the Rafah crossing was, inevitably, not straightforward\n                 \n                  Israeli strikes kill at least 30 Palestinians in Gaza, hospital officials say\n                 \n                  Gazans face question of returning to devastated homeland as Rafah crossing reopens\n                 Kariza Bahloul, 48, was one of those to have come home. She told our colleagues in Khan Younis that it was \"an indescribable feeling\" to return: \"I am very happy that I came back to my husband, my sons, my family, my loved ones, and also to my homeland. And the homeland feeling is the most important.\" A few feet away, Amati Othman Omran was also soaking up the feeling of homecoming. She had left Gaza to accompany her husband, Adel, to Egypt so he could have heart surgery. But her love for Gaza never diminished. \"When the road back was blocked, and I could not come back, I spent two years without a single day of peace, thinking of my sons, my brother, sisters. My family,\" she said. \"I thank God that I have come back to Gaza. I smelled its scent and its air from far away.\" Read more:Reopening the Rafah crossing was, inevitably, not straightforwardIslamic countries condemn deaths as Israel prepares to open crossing Huda Abu Abed had left during the first ceasefire, traumatised by the death of her son. Then, she said, there were still houses and olive trees. \"Everything was not destroyed, as it is now,\" she said. So how, she was asked, did she feel about coming back to a land where she will be destined to live in a tent, surrounded by rubble? \"It is better than living in a villa,\" came the reply. \"If I sit under a tree, it is better than being away from home. I am happy to get back to a tent, because that tent will contain my family.\" It is an intoxicating strain of both optimism and loyalty. But it also feels so discordant to the reality of life. Not only is everyday existence still unpredictable and fragile, but the danger of sudden violence lingers over everything. Just hours after these people were joyously reunited with their families, more than 20 Gazans were killed by a combination of Israeli tank and airstrikes. Among them, a paramedic who had come to help. The Israeli military later issued a statement saying it had targeted one of the leaders of the 7 October massacre, and offered its regret for any harm done to \"uninvolved civilians\". It was near as the Israel Defence Forces (IDF) normally comes to an apology. A little while later came a separate IDF statement, accusing \"Hamas terrorists\" of \"systematically using ambulances in Gaza by transporting terrorists and weapons\". The effect, whether deliberate or not, was to dilute their own words of regret. In Gaza, the place where some are desperate to flee, and others are desperate to return, nothing is ever sure."
    },
    {
        "title": "Migrant speedboat collides with coastguard off Greek coast, killing at least 15",
        "description": "At least 15 people have been killed in a collision between a speedboat carrying migrants and a coastguard vessel off the coast of Greece,  authorities have said. ",
        "url": "https://news.sky.com/story/at-least-15-dead-after-migrant-boast-collides-with-greek-coastguard-13503012",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-greece-migrant-crisis_7155014.jpg?20260204011832",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-04 01:06:00",
        "Headline": "The bodies of 11 men and three women were recovered off the coast of Chios, while a woman later died in hospital, coastguard officials said.",
        "Content": "At least 15 people have been killed in a collision between a speedboat carrying migrants and a coastguard vessel off the coast of Greece,  authorities have said.  The bodies of 11 men and three women were recovered from the sea near the eastern Aegean island of Chios, while a woman later died in hospital, according to coastguard officials. A search and rescue operation is under way in the area, involving patrol boats, divers and a helicopter. The coastguard said 25 migrants, including 11 children, had been rescued and taken to a hospital on Chios, along with two coastguard officers injured in the incident on Tuesday. It was not immediately clear how many people had been on the speedboat, the coastguard said. Video footage from a local news outlet showed at least one person being carried in a blanket from a coastguard boat into a waiting coastguard vehicle, as others appear to lead two children toward the car. It remains unclear how the collision occurred. \n                  Greek farmers have forced shutdown of Crete airport\n                 \n                  How one punch killed a young British father - but did an attacker evade justice?\n                 \n                  European wildfires kill at least three as British bar worker joins emergency efforts on Greek island\n                 The head of Greece's public hospital workers' union, Michalis Giannakos, said staff at the hospital in Chios were preparing for a sudden influx of injured people. Speaking on Greek television, Mr Giannakos said several of those injured required surgery. Read more from Sky News:'Aggressive' Iranian drone downed by USTeenage boy swims for four hours to save family It comes less than three years after hundreds of people are believed to have died when a fishing boat carrying migrants from Africa and the Middle East sank off the coast of Greece in 2023. Greek officials said the vessel capsized about 50 miles from the southern coastal town of Pylos after the boat got into difficulties when its engine stopped and it began veering from side to side. According to the UN's migration agency, more than 33,000 migrants died or went missing in the Mediterranean Sea between 2014 and the end of 2025 - making it the deadliest migration corridor in the world."
    },
    {
        "title": "Ryan Routh jailed for life for trying to assassinate Donald Trump on golf course",
        "description": "A man has been jailed for life without parole for trying to assassinate Donald Trump as he played golf in 2024.",
        "url": "https://news.sky.com/story/man-jailed-for-life-for-trying-to-assassinate-donald-trump-13503278",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-ryan-routh-donald-trump_6687107.png?20240916004708",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-04 15:28:00",
        "Headline": "The judge rejected a plea for a 27-year sentence and said a rambling statement read by Routh was irrelevant.",
        "Content": "A man has been jailed for life without parole for trying to assassinate Donald Trump as he played golf in 2024. Secret Service agents spotted Ryan Routh in bushes a few hundred metres from Mr Trump at his golf course in West Palm Beach, Florida, on 15 September. Routh, 59, fled and left behind an assault-style rifle but was arrested the same day. The incident came two months after Mr Trump survived another assassination attempt in Pennsylvania in which the gunman was shot dead. Routh was convicted in September of five charges, included attempted assassination, after declining a lawyer and mounting his own defence. Routh tried to stab himself in the neck with a pen after the verdict was announced but was quickly surrounded and did not hurt himself. A Secret Service agent told the jury he had spotted Routh in the bushes before Mr Trump was in sight. The gunman aimed at the agent but they opened fire and Routh dropped his weapon and ran. \n                  Is Donald Trump about to defy the US Constitution?\n                 \n                  US aircraft carrier scrambles fighter jet to down 'aggressive' Iranian drone as tensions rise ahead of talks\n                 \n                  Donald Trump seeks $1bn in damages from Harvard University\n                 The trial heard Routh had waited in thick bushes for nearly 10 hours and also left behind body armour-like metal plates and a video camera pointed at the course. Prosecutors said he spent weeks plotting how to kill Mr Trump and arrived in Florida about a month before as he tracked Trump's movements and schedule. They said the president would have been killed were it not for the Secret Service agent's intervention. Read more from Sky News:Trump seeks $1bn in damages from HarvardEpstein survivors condemn handling of files Judge Aileen Cannon rejected a plea for a 27-year sentence and said a rambling statement by Routh, in which he spoke about foreign wars and said he wanted to be swapped with prisoners abroad, was irrelevant. \"I have given every drop of who I am every day ‌for the betterment of my community and this nation,\" Routh said in his comments. The judge ultimately handed down a life sentence without parole at the Fort Pierce courtroom, telling him: \"It's clear to me that you engaged in a premeditated, calculated plot to take a human life.\" Routh's lawyer, Martin Roth, said his client cared deeply about others and had a \"very good core\" and told reporters he would appeal."
    },
    {
        "title": "Trump orders 700 immigration officers to leave Minnesota",
        "description": "Donald Trump has said he's ordered hundreds of immigration officers to leave Minnesota - although around 2,000 will remain in the state.",
        "url": "https://news.sky.com/story/trump-orders-700-immigration-officers-to-leave-minnesota-13503441",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-minneapolis-ice_7156008.jpg?20260204225539",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-04 22:36:00",
        "Headline": "The president confirms the pullout, which comes after the deaths of two protesters, but 2,000 will remain in the state.",
        "Content": "President Trump has said he's ordered hundreds of immigration officers to leave Minnesota - although around 2,000 will remain in the state. The pullback comes amid fury over the deaths of two protesters in altercations with federal officials. The president's border czar, Tom Homan, announced the move on Wednesday and said about 700 would leave the state immediately after local officials agreed to hand over arrested immigrants. Renee Good and Alex Pretti were shot dead in separate incidents last month in Minneapolis, Minnesota's biggest city, as they protested against the actions of masked agents ordered in by the Trump administration. Local officials have attacked heavy-handed tactics that have seen ICE (Immigration and Customs Enforcement) officers grab some people off the street and have made it clear they want them out. President Trump confirmed to Sky's US partner, NBC News, he had approved the order to cut numbers, adding: \"But it didn't come from me because I just wanted to do it. \"We have - we are waiting for them to release prisoners, give us the murderers that they're holding and all of the bad people, drug dealers, all of the bad people.\" \n                  ICE agents in Minneapolis to be issued with body-worn cameras after fatal shootings\n                 \n                  Nicki Minaj and Donald Trump - what's that about?\n                 \n                  Trump endorses deal struck with Democrats to avert government shutdown\n                 Mr Trump added: \"We allowed in our country, I say, 25 million people with an open-border policy for four years under Biden, and that group the autopen group, I call them. \"We allowed to come into our country people the likes of which no country would accept. And we're getting 'em out.\" However, Mr Trump also continued a recent slight softening in some of his language, telling NBC News \"maybe we can use a little bit of a softer touch - but you still have to be tough\". Minnesota governor Tim Walz and Minneapolis mayor Jacob Frey said the cut in numbers was a start - but that the whole operation needed to end quickly. \"We need a faster and larger drawdown of forces, state-led investigations into the killings of Alex Pretti and Renee Good, and an end to this campaign of retribution,\" the Democrat governor posted on social media. Such a hope currently looks unrealistic however. In his announcement on Wednesday, border chief Mr Homan stressed the effort to remove illegal aliens would continue at pace. \"Let me be clear, ​President Trump fully intends to achieve mass deportations during this administration, and immigration enforcement actions will continue every day throughout this country,\" he said. Vice president JD Vance also said the officers being pulled out were mainly protecting those carrying out arrests. \"We're not drawing down the immigration enforcement,\" he said in an interview on The Megyn Kelly Show. The operation in Minnesota - Operation Metro Surge - ramped up in January as President Trump looked to fulfill election promises to deport illegal immigrants and people without proper documentation. ICE, part of the Department of Homeland Security, have also been deployed in cities such as Los Angeles and Chicago, where their presence has also attracted anger from officials and significant protests."
    },
    {
        "title": "Is Donald Trump about to defy the US Constitution?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/is-donald-trump-about-to-defy-the-us-constitution-13503014",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-100-donald-trump_7008873.jpg?20250902062852",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-04 02:41:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   The president, citing widespread corruption, wants Republicans to be in control of elections. It would be a major violation of Article I of the US Constitution. There is no evidence of any electoral fraud. Could he really be about to defy the very foundations America is built upon? Plus - Donald Trump greets Colombian president, and longtime foe, Gustavo Petro at the White House. What happened when they met? Meanwhile, a US fighter jet shoots down an Iranian drone over the Arabian sea - are we one step closer to US-Iran conflict? Former US ambassador Peter Mandelson resigns from the House of Lords over the brewing Epstein scandal. \n                  Colombia plane crash kills 15 including politician\n                 \n                  Colombian rebels must unite to fight US, guerrilla leader says\n                 \n                  Colombia, Cuba, Mexico, Greenland or Iran - where could Trump strike next? \n                 You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Washington Post: Sports section eliminated ahead of Olympic Winter Games",
        "description": "US newspaper The Washington Post is making a third of its staff redundant, bosses at the title have said.",
        "url": "https://news.sky.com/story/washington-post-sports-section-eliminated-ahead-of-olympic-winter-games-13503365",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-washington-post_7155813.jpg?20260204194145",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-04 19:43:00",
        "Headline": "Layoffs see the sports section, several foreign bureaus and the newspaper's books coverage all scrapped as the executive editor tells staff it \"can't be everything to everyone\".",
        "Content": "US newspaper The Washington Post is making a third of its staff redundant, bosses at the title have said. The long-rumoured layoffs, affecting almost all areas of the newsroom, were confirmed to employees in a video conference on Wednesday. Afterwards, they received emails with one of two subject lines - telling them their role was either going or being kept. Among the departments being scrapped is the sports section, along with several foreign bureaus and the newspaper's books coverage. In a note to staff, executive editor Matt Murray called the move painful but necessary to put it on a stronger footing and weather changes in technology and user habits, telling them the Post \"can't be everything to everyone\". Mr Murray said: \"Significantly, our daily story output has substantially fallen in the last five years\", adding: \"And even as we produce much excellent work, we too often write from one perspective, for one slice of the audience.\" The layoff comes days after the more than 145-year-old newspaper scaled back its coverage of the 2026 Winter Olympics amid mounting financial losses. \n                  'No space for Bezos': Hundreds protest against billionaire's wedding on final day of Venice celebrations\n                 \n                  Lauren Sanchez shares picture with Jeff Bezos as they tie the knot in star-studded ceremony in Venice\n                 \n                  Jeff Bezos's Venice wedding celebrations begin with star-studded party after fresh protests\n                 Claire Parker, the paper's Cairo bureau chief, announced her redundancy on X, along with all of the newspaper's Middle East correspondents and editors, saying it was \"hard to understand the logic\". Some, including former editor Martin Baron, criticised owner Jeff Bezos. Mr Baron, the Post's first editor under the Amazon founder, said his former boss was guilty of \"a case study in near-instant, self-inflicted brand destruction\". Margaret Sullivan, a journalism professor and former columnist at the Post and The New York Times, said the layoffs were \"devastating news for anyone who cares about journalism in America and, in fact, the world. \"The Washington Post has been so important in so many ways, in news coverage, sports and cultural coverage.\" Mr Bezos, who has not commented, has typically had a hands-off approach to the paper's editorial policy since he bought the Post in 2013. But this appeared to change during last year's US presidential election when he blocked the Post's editorial board from publishing an endorsement for Donald Trump's rival Kamala Harris. Read more on Sky News:Winter Olympics - all you need to knowInternet watchdog investigates Grok At 8pm UK time (3pm, Washington time), there was no mention of the layoffs on the paper's home page or media index page, nor had they been announced on the title's X account. The Post is renowned for its coverage of the Watergate Scandal in the early 1970s, leading to the resignation of US President Richard Nixon."
    },
    {
        "title": "Shell paves way for multimillion-pound pay hike for boss Sawan",
        "description": "The FTSE-100 oil giant Shell is close to unveiling a revamped boardroom pay policy which would see its boss handed a multimillion-pound annual pay incentive.",
        "url": "https://news.sky.com/story/shell-paves-way-for-multimillion-pound-pay-hike-for-boss-sawan-13503109",
        "image_url": "https://e3.365dm.com/21/05/1920x1080/skynews-shell-oil_5371304.jpg?20210505233400",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-04 09:49:00",
        "Headline": "The oil giant is to hand CEO Wael Sawan a long-term incentive award worth £13.8m, taking his total maximum pay package to over £19m, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The FTSE-100 oil giant Shell is close to unveiling a revamped boardroom pay policy which would see its boss handed a multimillion-pound annual pay incentive. Sky News has learnt that Shell has concluded a consultation with its largest shareholders which could result in Wael Sawan, chief executive, earning at least £4.5m more every year. Investor sources said that Shell, which will report fourth-quarter and full-year results on Thursday, had drawn up plans to grant Mr Sawan a long-term incentive stock award worth up to nine times his base salary of £1.535m. Money blog: Asda loses place as cheapest big shop supermarket for first time in 2 years That would be a 50pc increase on the current remuneration policy, under which the Shell chief is eligible for an LTIP award of up to six times his salary. Although the target award is significantly lower, in years of significant outperformance, it would mean Mr Sawan being handed an annual long-term stock award worth £13.815m - assuming his salary remains fixed at the current level. In addition to an annual bonus worth up to £3.837m, or 250% of his salary, that would make his total pay package, excluding pension contributions, worth up to £19.2m. \n                  Shell's new strategy is good news for your savings\n                 \n                  Shell to install Jackdaw gas platform in North Sea despite being blocked from drilling, Sky News understands\n                 \n                  Shell and Greenpeace settle climate protest case\n                 That would continue to rank among the largest such pay deals for a FTSE-100, although as a constant fixture among the London stock market's biggest companies, institutional shareholders are generally said to have expressed support for the move. One said they backed the Shell board's move so long as there was \"clear evidence of pay for performance\". Shell's pay policy revamp comes during a period when FTSE-100 boards are seeking permission to elevate their CEOs' pay amid concerns that they risk losing executives to US-based rivals. There have also been a string of companies, led by the gambling group Flutter Entertainment, which have shifted their primary listings to New York with the objective of attaining a higher valuation. This week, shares in AstraZeneca, the drugs giant, began trading in the US. Sky News recently revealed plans drawn up by Rolls-Royce to significantly increase chief executive Tufan Erginbilgic's potential pay package after overseeing a stellar turnaround of the aircraft engine maker. Shell has a market value of just over £158bn, which is still significantly smaller than American peers ExxonMobil and Chevron. Last year, Mr Sawan was paid £8.6m, while chief financial officer Sinead Gorman received a package worth £7.25m. On Wednesday, Shell's London-listed shares were trading at around 2833p. They are up about 6% over the last year. In June, the company denied a Wall Street Journal report that it was in talks to buy troubled British rival BP, with Mr Sawan having said he saw greater value in buying back his own company's stock. In response to an enquiry from Sky News, a Shell spokesperson said: \"Every three years, Shell seeks shareholder approval for a new Executive Director remuneration policy as a standard part of regulations for UK-listed companies. \"The last vote was in 2023, so this is part of the usual cycle.\" The company declined to comment on the specific details of its new pay policy. Read more from Sky News:FX risk manager Bound lands $25m funding boostNew batch of Nestle baby formula recalled due to toxin One source said the new plans would be set out in its annual report next month."
    },
    {
        "title": "London-listed tungsten miner in talks about £50m share sale",
        "description": "The London-listed company which wants to extract one of the world's largest tungsten deposits from a site in Devon is in talks with investors to raise tens of millions of pounds from a share sale.",
        "url": "https://news.sky.com/story/london-listed-tungsten-miner-in-talks-about-16350m-share-sale-13503345",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hemerdon-mine-tungsten_6862151.jpg?20250320131647",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-04 18:32:00",
        "Headline": "Tungsten West, which wants to extract one of the world's largest tungsten deposits from a Devon mine, is finalising plans for a share sale which could raise more than £40m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The London-listed company which wants to extract one of the world's largest tungsten deposits from a site in Devon is in talks with investors to raise tens of millions of pounds from a share sale. Sky News has learnt that Tungsten West is close to finalising the terms of an equity-raise aimed at providing additional financing for the tin and tungsten project at Hemerdon in Devon. Industry sources suggested the capital-raising, which is likely to secure between £40m and £50m of new funding, was likely to be confirmed this week. Money latest: The 32 NatWest branches due to close The fundraising comes as global demand for critical minerals soars amid rising geopolitical tensions. Tungsten is a key mineral used by manufacturers in a variety of industries, most notably in defence, energy and automotive. China is currently responsible for producing about 80% of the world's supply of tungsten, but export controls have raised profound concerns in Western economies, particularly the US. \n                  Shell paves way for multimillion-pound pay hike for boss Sawan\n                 \n                  The 32 NatWest branches that will close; blow for Asda as rival judged cheaper | Money blog\n                 \n                  Barclays and NatWest to table rival bids for £2bn wealth manager Evelyn\n                 Only this week it emerged that the US planned to invest $12bn in stockpiling critical minerals such as rare earths, copper and lithium. Tungsten West believes that over time it can produce roughly a quarter of the world's non-Chinese tungsten. The company floated on London's junior AIM market in 2021 with the aim of restarting tin and tungsten production at the Devon site. In an update to the stock market earlier this week, the company said it was making good progress on raising debt finance for the project. \"The structural shift in the tungsten market that we have seen since the end of 2024 reflects the ever growing need to provide critical mineral diversification and supply chain resilience to Western economies,\" Jeff Court, the chief executive of Tungsten West, said in the statement. \"In the relatively short time since releasing the Updated Feasibility Study, tungsten prices have increased over 200% and tin prices over 70%. \"As the company is fully leveraged to market prices, the Project's economics have vastly improved, underlining the importance of advancing the Project rapidly.\" Read more:How Trump tariffs are harming UK metal industry Shares in Tungsten West closed on Wednesday at 29.9p, a rise of close to 13%. It has a market value of just over £205m. The price at which the new shares would be issued was unclear. Tungsten West declined to comment on Wednesday evening."
    },
    {
        "title": "Barclays and NatWest to table rival bids for £2bn wealth manager Evelyn",
        "description": "Barclays and NatWest will this week fire the next shots in the battle to acquire Evelyn Partners, one of the UK's biggest wealth managers.",
        "url": "https://news.sky.com/story/barclays-and-natwest-to-table-rival-bids-for-1632bn-wealth-manager-evelyn-13503212",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-evelyn-finance_7118534.jpg?20251223203949",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-04 13:05:00",
        "Headline": "The high street banking giants both intend to table formal bids on Thursday for private equity-backed Evelyn Partners as an auction nears its conclusion, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Barclays and NatWest will this week fire the next shots in the battle to acquire Evelyn Partners, one of the UK's biggest wealth managers. Sky News understands that the two high street banks will both submit formal offers for Evelyn on Thursday, when a deadline has been set by the advisers to its owner. Barclays and NatWest will both offer more than £2bn for the wealth management group, which has about £65bn in assets under management. It was unclear on Wednesday whether offers would reach as high as £2bn, although one insider expressed confidence that the business would ultimately change hands at around that level. Speculation has also linked Royal Bank of Canada, the owner of Brewin Dolphin, to the auction, although there remains uncertainty about whether it intends to lodge a formal offer. For Barclays and NatWest, an acquisition of Evelyn would bolster an area of their businesses where both already have a strong presence - the latter through its Coutts division. The sale process comes at a time of sustained corporate activity in the wealth management sector. \n                  Contactless card £100 limit to rise\n                 \n                  WTW in talks to buy NatWest pensions unit Cushon\n                 \n                  JPMorgan Chase unveils plans to build new £10bn 'landmark tower' in London - double the size of The Shard\n                 Canaccord Genuity's wealth arm is also on the block and could fetch a price of over £1bn. Evelyn is owned by the private equity firms Permira and Warburg Pincus, having merged their respective firms Tilney and Smith & Williamson in 2020. Last year, Evelyn's professional services arm was sold to the buyout firm Apax Partners. The auction of the wealth management business is being handled by bankers at Evercore. Barclays and NatWest declined to comment."
    },
    {
        "title": "FX risk manager Bound lands $25m funding boost",
        "description": "An automated foreign exchange risk management platform which protects clients against volatile currency markets will this week announce a funding injection of almost $25m.",
        "url": "https://news.sky.com/story/fx-risk-manager-bound-lands-25m-funding-boost-13503067",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-london-city-of-london_7094273.jpg?20251128092708",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-04 08:10:00",
        "Headline": "London-based Bound, which aims to protect corporate clients against volatile currency markets, has concluded a Series A funding led by prominent early-stage investor AlbionVC, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An automated foreign exchange risk management platform which protects clients against volatile currency markets will this week announce a funding injection of almost $25m. Sky News understands that Bound, which was founded in 2021 by Seth Phillips and Dan Kindler, has landed the new backing in a Series A round led by AlbionVC, a prominent venture capital investor. The round will also include participation from Notion Capital and GoHub, as well as existing investors in the company. Bound says it offers fast, transparent and automated FX hedging technology solutions which it claims \"empower finance teams to perform like currency trading experts\". The perils of turbulent currency markets were underlined last year when London-listed FX group Argentex collapsed amid the turmoil triggered by President Trump's global tariffs war. Bound, which traded close to $2bn last year, said it would use its new funding to pursue regulatory authorisation in the EU as the prelude to expansion on the Continent. \"The world is in a genuinely volatile state, and we don't believe we're heading back into a period of stability anytime soon,\" Mr Phillips, Bound's chief executive, said. \n                  Shell paves way for multimillion-pound pay hike for boss Sawan\n                 \n                  The 32 NatWest branches that will close; blow for Asda as rival judged cheaper | Money blog\n                 \n                  London-listed tungsten miner in talks about £50m share sale\n                 \"Exchange rate volatility has never been higher, and most businesses feel that whether they realise it or not. \"One of the most immediate ways that instability shows up is through currency markets. \"You can be running a healthy UK business with U.S. customers, and overnight, a social media post can cause currencies to fluctuate and significantly impact your business's margins.\" Bound cited fashion retailers with large global purchasing requirements, venture capitalists investing across regions or production companies with global location needs as examples of the types of businesses susceptible to currency risk. \"Currency volatility has become a structural challenge for modern businesses, not a short-term anomaly,\" said Jay Wilson, a partner at AlbionVC. \"What impressed us about Bound is its clear understanding that FX risk management shouldn't be reserved for multinational corporates with specialist treasury teams. \"FX risk management is an industry reliant on many legacy systems and is therefore ripe for disruption.\" Bound, which is based in London, did not disclose the valuation secured in its new funding round."
    },
    {
        "title": "New batch of Nestle baby formula recalled due to toxin",
        "description": "Food and drink giant Nestle has recalled a further batch of its SMA baby formula due to concerns about the presence of a vomit-inducing toxin.",
        "url": "https://news.sky.com/story/new-batch-of-nestle-baby-formula-recalled-due-to-toxin-13503068",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-baby-formula-formula_7127632.jpg?20260106045837",
        "type": "Business",
        "Author": "Katerina Vittozzi",
        "Date Published": "2026-02-04 08:12:00",
        "Headline": "The products range from powders and pre-mixed formula amid fears of a heat-resistant toxin that can cause vomiting, diarrhoea and stomach cramps.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n Food and drink giant Nestle has recalled a further batch of its SMA baby formula due to concerns about the presence of a vomit-inducing toxin. It joins a list of more than 60 batches of SMA formula recalled last month due to the possible presence of cereulide, a heat-resistant toxin that can cause vomiting, diarrhoea and stomach cramps. The full recall covers several SMA products, ranging from powders and pre-mixed formula for newborns and toddlers. \"We want parents and caregivers to know Nestle are updating their recall to include one more batch of infant formula,\" investigators at the Food Standards Agency said in a statement. \"This additional batch has been supplied in Northern Ireland. \"If you have any of the affected products, stop using them and switch to an alternative formula. \"If your baby's formula was prescribed, speak to a pharmacist or doctor before changing. \"If you have already fed the formula to your baby and are concerned, contact your GP or call NHS 111.\" The latest batch to be recalled is 800g packs of SMA First Infant Milk with a best before date of December 2027 and marked 53390346AB. Read more: Father 'wants answers' over now-recalled formula At the time of the original recall, Nestle said it was due to the \"potential presence\" of cereulide and that the move was out of \"an abundance of caution\". But last week, the FSA confirmed to Sky News that its ongoing investigation had confirmed the presence of cereulide in batches of SMA formula, as well as within one batch of Aptamil formula, produced by Danone. The issue, the FSA said, stemmed from an ingredient made by a third-party supplier and shared by the brands. Read more from Sky News:National Cancer Plan being launchedHow gangs control airspace over UK jails Contacted by Sky News regarding this latest recall, a Nestle spokesperson said: \"These products were sold to customers in Ireland and may have been made available in Northern Ireland. \"They have not been distributed to mainland UK. \"This is, again, due to the possible presence of cereulide because of a contaminated ingredient. \"This batch has been reassessed against an updated methodology, and we are recalling it to be consistent with other batches recalled previously. \"All batches have now been assessed against this standard and there will be no need for any further recalls.\" A full list of affected batch numbers can be found here."
    },
    {
        "title": "Top chef on what Brexit has done for UK fishing and the question you should always ask when buying fish",
        "description": "Our Money team interview top chefs from around the UK every month,  hearing about their cheap food hacks, views on the industry and more.",
        "url": "https://news.sky.com/story/top-chef-on-what-brexit-has-done-for-uk-fishing-and-the-question-you-should-always-ask-when-buying-fish-13503061",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-fish-chef-mitch-tonks_7154545.jpg?20260203150316",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-04 07:45:00",
        "Headline": "TV regular Mitch Tonks reveals his most underrated cheap fish, why Brexit hasn't made any positive changes for UK fishermen, and his top tip for buying seafood. ",
        "Content": "Our Money team interview top chefs from around the UK every month,  hearing about their cheap food hacks, views on the industry and more. Today, we speak to TV regular Mitch Tonks, founder and chief executive of the Rockfish restaurants. Tinned seafood is like a time capsule... perfectly preserved fish that are bursting with flavour. A very good budget-friendly recipe is tinned sardines with tomatoes and tagliatelle - you don't need many ingredients, and it's super quick to make (and still incredibly tasty). Another favourite of mine is tinned mackerel shawarma: you shred cabbage, red onion and some green chilli and mix together, before grating garlic into some yoghurt and tossing the lot together. Lay out a flour tortilla and bread with some hummus, place the cabbage on top, then top with mackerel, a sprinkling of zaatar or cumin, a squeeze of lemon and wrap the whole thing up like a shawarma. Read all the latest Money tips and news here The best place in the world for seafood... is northern Spain. It is always somewhere that inspires me. I love the culture of eating in Sidrerias (cider bars), and they've actually had a huge influence on the interior design of our two newest Rockfish restaurants, in Salcombe and Lyme Regis. Porto in Portugal has also always stirred something in me - I love the outside grills where seafood gets the simple treatment, cooked over charcoal and served with seasonal vegetables and cold beer. Beautiful. As a chef with a 25-year career in seafood, Brexit has done... nothing good for UK fishing. Our fishermen have lost access to key 12-mile limits, while French fleets continue to fish in our waters under extended rights. Exporting to Europe has become more expensive and tangled in red tape. And at the heart of it all is this uncomfortable truth: we don't eat our own fish. As long as we rely on Europe to buy what we land, we're always going to be on the back foot. The only real answer is simple: we need to start eating more of our own seafood, especially the primary species landed right here in the UK. An underrated and cheap fish I love is... sardines! They're great pickled, fantastic grilled, wonderful on toast, and delicious in oils. That's why we've tinned them, it's a real art form. They're so versatile and incredibly affordable with immediate flavour. \n                  Cheap Eats: Tommy Banks on his train station debate over a toastie, weight loss drugs and why you're using salt wrong\n                 \n                  Cheap Eats: 'I'm a head chef - this is what you should tip and one thing I hate that some customers do'\n                 \n                  Cheap Eats: Top chef on spag bol hack, the Burger King item you can't beat, and two things customers should stop doing\n                 One thing I always find fascinating about the seafood we eat is... how many incredible local species are underappreciated. As an island, we should be celebrating British seafood more - yet so many delicious fish, such as red mullet, gurnard and cuttlefish, rarely get the attention they deserve. They're incredibly versatile, and the best way to cook and enjoy them? Keep it simple. Don't overpower the fish - let it shine. A tip for anyone buying seafood is... always ask where it comes from and make sure it's sustainably caught. Be curious about what's on your plate - it makes all the difference for flavour and for the future of our oceans. Restaurateurs or chefs should stop... putting food on square plates, covering things in foam and producing overly-long tasting menus. If I were prime minister for one day, I would... lower VAT to give businesses more oxygen. I would reverse seasonal national insurance. I would forget the introduction of the new employers' bill, which adds extra burden and complexity to doing business. If the government were to give businesses a level playing field, there would be more investment, more profits and ultimately more tax revenues. One shop-bought item that can never be beaten by home cooks is... kewpie mayonnaise. It cannot be beaten. Whenever I fancy a cheap eats place for a £15 meal or less, I go for a... fresh umami hit at Goto Japanese in Exeter. I can get four or five pieces of sushi or a bowl of their seafood ramen plus a tea for under £15 and it always feels like I've had something of great quality."
    },
    {
        "title": "PM in 'precarious position' after MPs force climbdown over Mandelson files release",
        "description": "Sir Keir Starmer is facing growing anger among Labour MPs and renewed speculation about his future after being forced to publish files about his decision to appoint Peter Mandelson as the UK's US ambassador.",
        "url": "https://news.sky.com/story/mps-force-sir-keir-starmer-to-publish-files-about-peter-mandelsons-appointment-as-us-ambassador-13503373",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-keir-starmer_7155468.jpg?20260204132631",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-04 20:24:00",
        "Headline": "After Labour MPs refused to back the government, the PM will be forced to share documents with parliament amid a Metropolitan Police investigation into Lord Mandelson's conduct.",
        "Content": "Sir Keir Starmer is facing growing anger among Labour MPs and renewed speculation about his future after being forced to publish files about his decision to appoint Peter Mandelson as the UK's US ambassador. The government had signalled it would release most of the documents following revelations about Lord Mandelson's relationship with convicted paedophile Jeffrey Epstein. Tap here for the latest on the Epstein files But the prime minister's original plan was for his top civil servant to determine whether any should remain secret on national security grounds, or because they could prejudice international relations. He was forced into a climbdown after interventions from senior Labour MPs during a dramatic Commons session on Wednesday, including former deputy prime minister Angela Rayner, while Conservative leader Kemi Badenoch accused Sir Keir of an attempted \"cover-up\". MPs eventually backed a compromise that will see parliament's Intelligence and Security Committee determine what should be done with the more sensitive files - but it leaves Sir Keir in the most perilous position of his premiership. Sky News political editor Beth Rigby described the mood in parliament as a \"tinderbox\", with one senior ally of the prime minister unwilling to rule out resignations from government. \"Temperatures are running high,\" they said. Police probe delays release of files Despite the Commons drama, it is unclear when any documents will be shared with parliament and published by the government amid a police investigation into Lord Mandelson for misconduct in public office. The Metropolitan Police said it had advised the government \"the release of specific documents could undermine our current investigation\". \"We therefore asked them not to release certain documents at this time,\" the force added. Rigby said there is \"deep frustration\" inside Number 10 about the situation, as it's hoped the release of the files will support the prime minister's assertion that Lord Mandelson repeatedly lied to him about the depths of his relationship with Epstein. \"But with their hands tied, and the mood this febrile, the prime minister is in a precarious position,\" she added. Starmer: I regret appointing Mandelson Downing Street has conceded that the prime minister was aware of Lord Mandelson's links to Epstein when his appointment as US ambassador was confirmed early last year. Speaking at Prime Minister's Questions, Sir Keir insisted a due diligence process had taken place, but said: \"What was not known was the depth, the sheer depth, and the extent of the relationship.\" \"He lied about that to everyone for years, and new information was published in September showing the relationship was materially different from what we'd been led to believe,\" he told MPs. \"When the new information came to light, I sacked him.\" He added: \"I regret appointing him. If I knew then what I know now, he would never have been anywhere near government.\" Sir Keir is set to face questions from the media today about the crisis engulfing his administration, after he gives a speech about plans for investment in the UK's most deprived communities. How did we get here? The scandal erupted again last Friday when the US Department of Justice published a tranche of over three million Epstein files documents, which included emails that appear to show Lord Mandelson shared sensitive internal government information with the financier while serving in Gordon Brown's government. It led to the Metropolitan Police opening its investigation into Lord Mandelson for alleged misconduct in public office, which followed referrals from both the Cabinet Office and Mr Brown. Lord Mandelson resigned his membership of the Labour Party on Sunday. He denied any record or recollection of the payments, but said he did \"not wish to cause further embarrassment\" to the party. Sky News has approached representatives for Lord Mandelson for comment. Being named in the Epstein files is not a sign of wrongdoing, and Lord Mandelson has expressed regret about his past ties to the paedophile, saying in a statement: \"I was wrong to believe Epstein following his conviction, and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" Lord Mandelson has not responded to the latest allegations. However, in an interview with The Times carried out last week, but published on Monday, he referred to a \"handful of misguided historical emails, which I deeply regret sending\", and described Epstein as \"muck that you can't get off your shoe\"."
    },
    {
        "title": "Beth Rigby: Even Starmer's allies are unsure about his future",
        "description": "By my reckoning, yesterday will be remembered as perhaps the most difficult of Sir Keir Starmer's premiership yet, with even close allies telling me they are not sure where it will end.",
        "url": "https://news.sky.com/story/beth-rigby-even-starmers-allies-are-unsure-about-his-future-13503409",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-starmer-pmqs_7156040.jpg?20260204235154",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-04 21:57:00",
        "Headline": "Some Labour MPs consider Sir Keir Starmer's decision to appoint Peter Mandelson as US ambassador an unforgivable lapse of judgement.",
        "Content": "\n          Political editor\n              @BethRigby\n By my reckoning, yesterday will be remembered as perhaps the most difficult of Sir Keir Starmer's premiership yet, with even close allies telling me they are not sure where it will end. His admission at Prime Minister's Questions that he knew of the friendship between Peter Mandelson and Jeffrey Epstein when he appointed him as US ambassador hardened the sentiment of many a Labour MP who was willing to give him the benefit of the doubt. Insiders tell me that changed when Starmer told the Commons that security vetting had confirmed the continued friendship between Mandelson and Epstein after the financier was jailed for child prostitution offences, leaving MPs furious at the prime minister and his aides for allowing the ex-Labour minister back into the heart of government. Some MPs consider this an unforgivable lapse of judgement. Number 10 has compromised on the release of files relating to Mandelson's appointment. It will now be for the independent Intelligence and Security Committee, and not the PM's top civil servant, as was planned, to decide what should be held back in the interests of national security and international relations. But that Number 10 had to cave to backbenchers - led by Angela Rayner - concerned about a \"cover-up\" (as the Conservative leader Kemi Badenoch put it) is symbolic of the breakdown of trust. A tinderbox that could erupt There were rumours flying around that Morgan McSweeney, Starmer's chief of staff, was about to resign - as a few MPs publicly called for him to do so over the decision to reinsert Mandelson into government in 2025. I'd describe the mood in parliament yesterday evening as a tinderbox, with even some of the PM's allies unsure about whether the situation is about to erupt. When I asked one senior ally whether there could be a challenge or resignations that could predicate a challenge, there was a long pause. \"Temperatures are running high,\" said the figure, acknowledging that when the mood is as it is, and Sir Keir is where he is in the polls, someone moving against him is a risk. Another senior figure told me many MPs felt deeply compromised over the scandal, including some ministers. Read more from Sky News:Murder investigation launched after student stabbedSix Palestine Action activists cleared of aggravated burglary As for the No 10 end, there is deep frustration that the government has been blocked by the Metropolitan Police from releasing information about what Mandelson told the PM and others about his relationship with Epstein. The intention had been to release this information straight away in order to back up what the PM said in the Commons, but Downing Street has been thwarted as it stands. There is a view that the release would have been helpful because it would have perhaps led to MPs directing their anger at Mandelson. The PM's team are in a bind because they want the information out, but they don't want to do anything that would affect a criminal investigation with the Met. One option for Downing Street now could be to go back to the Met and see what they can release. But with their hands tied, and the mood this febrile, the prime minister is in a precarious position as the Mandelson crisis raises MPs' anger and leadership speculation all over again."
    },
    {
        "title": "Mandelson-Epstein files: Keir Starmer may be facing his very own Profumo scandal",
        "description": "Is the Mandelson-Epstein crisis Sir Keir Starmer's Profumo scandal?",
        "url": "https://news.sky.com/story/the-sex-and-secrets-scandal-which-could-bring-down-another-prime-minister-more-than-60-years-on-from-profumo-13503392",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-john-profumo-christine-keeler_7156032.jpg?20260204232411",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2026-02-04 21:22:00",
        "Headline": "After a chaotic Commons showdown, some MPs are predicting that the Peter Mandelson scandal will bring down Sir Keir Starmer.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Is the Mandelson-Epstein crisis Sir Keir Starmer's Profumo scandal? Both involved sex, call girls, lurid revelations and a police investigation. Tap here for the latest on the Epstein files The Profumo scandal brought down Tory prime minister Harold Macmillan in the early 1960s. Secretary of state for war John Profumo had an affair with call girl Christine Keeler, who was also involved with a Soviet naval attache. Profumo lied to parliament about his affair, Macmillan's handling of the crisis was seen as hopeless - and he failed to confront Profumo about the affair. Months later, Macmillan was gone. Could it happen again? Now, after an excruciating Prime Minister's Questions, followed by a chaotic Commons showdown on Mandelson, senior MPs are predicting the current scandal will bring down Starmer. 'It's absolutely inevitable' \"The Profumo affair brought down Harold Macmillan,\" SNP Westminster leader Stephen Flynn told Sky News. \"This will bring down Keir Starmer. \"It's absolutely inevitable. Today he chose to be clear, and revealed to the nation what he knew and when. And in doing so he showed a clear lack of judgement, which has broken trust with the people of these isles. \"That's unforgivable for a prime minister, and it's ultimately going to lead to his departure from No 10.\" But Flynn isn't alone with his astonishing prediction. His ally Liz Saville-Roberts, Plaid Cymru's Westminster leader, told Sky News: \"A number of people are comparing this to the Profumo scandal. \"And, of course, these scandals start slowly and then they speed up. We're seeing it speed up now.\" Read more:What is misconduct in a public office?Mandelson had no alternative but to resignEpstein files: Key findings so far That's the view from the prime minister's opponents, of course. And it must be said that the Commons debate on a Tory demand for the release of a Mandelson \"paper trail\" ended with the government's last-minute compromise being approved \"on the nod\", and MPs of all parties claiming it was a good outcome. A last-minute government amendment on a scrap of paper gave parliament's Intelligence and Security Committee (ISC) the power to vet which sensitive documents about Mandelson should be released, and which shouldn't. Rayner's ominous intervention The government's previous position, that \"papers prejudicial to UK national security or international relations\" should be kept secret, incensed MPs of all parties, and the PM was heading for a humiliating rebellion and possible defeat. Ominously for the PM, it was Angela Rayner, his former deputy now banished to the back benches after her stamp duty dodge, that forced him into a U-turn. There was a sharp intake of breath from MPs as the rose to her feet and made what sounded like a perfectly sensible proposal. The ISC should look at the papers, in \"keeping public confidence in the process\", she said. But MPs are nothing if not conspiracy theorists. Was she signalling she might vote with the Tories? Was she twisting the knife? Or was she being helpful? Probably all three. By the end of the debate, many gloomy Labour MPs were in despair at Sir Keir's faltering and unconvincing performance at PMQs, and the shambolic government U-turn on publishing the Mandelson files. Was the red queen serving notice that she's ready to seize Starmer's crown? Certainly, his terrible judgement in appointing Mandelson as US ambassador has left him even more vulnerable than ever to a leadership challenge. And the Mandelson-Epstein furore is suddenly being compared by MPs to another sex and secrets scandal that brought down a prime minister more than 60 years ago."
    },
    {
        "title": "Sir Keir Starmer pledges to 'reverse devastating decline' with £800m extra investment in 40 communities",
        "description": "Sir Keir Starmer is to announce a cash injection of &#163;800m to rejuvenate the most deprived communities, which he admits have been \"undermined by political neglect\". ",
        "url": "https://news.sky.com/story/sir-keir-starmer-pledges-to-reverse-devastating-decline-with-163800m-extra-investment-in-40-communities-13503269",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sir-keir-starmer-labour-party-conference_7155668.jpg?20260204165142",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-04 15:09:00",
        "Headline": "In a speech on Thursday, the prime minister will attack what he calls the \"scorched earth of Tory austerity\", while recognising the threat from Reform UK, comparing it to a \"contest between renewal and grievance\".",
        "Content": "Sir Keir Starmer is to announce a cash injection of £800m to rejuvenate the most deprived communities, which he admits have been \"undermined by political neglect\".  The extra investment forms part of the existing Pride in Place programme, aimed at addressing the sense of isolation in deprived communities, which Labour insiders believe is feeding the rise of Reform UK. The new money will benefit 40 communities with up to £20m of support for projects like cleaning up town centres and boosting youth services or sports facilities. Politics latest: Labour MPs rebel over Mandelson files In a speech on Thursday, the prime minister will say it is part of a renewal of communities across the country. \"We've got to reverse the devastating decline in our communities.\" Sir Keir will say. \"We've got to give power, agency and control to the very people who want to improve their community. \"This is what our Pride in Place programme is about - because pride is the social glue, the force that holds together a community and a country.\" \n                  Sir Keir Starmer's China trip 'failed' - as Jimmy Lai remains in prison, says Kemi Badenoch \n                 \n                  UK citizens to get visa-free travel to China after Xi-Starmer meeting\n                 \n                  'Talk to me, Goose': Starmer teases Macron with Top Gun mock up\n                 Sir Keir will also argue that, amid a cost-of-living crisis, a strong society is vital. \"Any country that cannot keep its high streets alive, it's bills down and it's people feeling respected, will struggle to meet the test of our times,\" he will add. \"So we must strengthen our society, because it is vital for the future of this country.\" Sir Keir will argue that Britain, the \"greatest country in the world\", is \"stronger as a tolerant, decent and respectful country\", but he will also admit that the country has been \"undermined by those who seek to sow division\". \"Britain has been undermined by political neglect, the scorched earth of Tory austerity,\" Sir Keir will say. \"In towns across Britain, the same story, high streets, youth clubs - the places that shape a life - that bring different people together, that create the bonds of memory and pride - they were just abandoned.\" Sir Keir will describe, in what some will see as recognition of the threat from Reform UK, that \"politics in this dangerous era is no longer about left and right, but a contest between renewal and grievance\". \"We are bound by values, by common endeavour and by responsibilities we owe to one another as partners in the project of this great nation. \"I believe in our way of doing things. That in a world that increasingly preys on weakness, I believe Britain is stronger as a tolerant, decent and respectful country.\" A Conservative spokesperson said in response: \"It's hard to overstate the absurdity of Keir Starmer making a speech about values and decency the day after he admitted appointing an ambassador who had remained friends with a convicted paedophile. \"The prime minister's authority is shot. He no longer speaks for the Labour Party, let alone the country. Only the Conservatives have a plan to sort out our country, and the team and experience to ensure we get Britain working again.\""
    },
    {
        "title": "Can Starmer keep Mandelson vetting secret?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/can-starmer-keep-mandelson-vetting-secret-13502864",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-04 08:00:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 Another day and another podcast dominated by Peter Mandelson - but as the political pressure ramps up across parliament, how will Number 10 react and is the carnage over? In a frantic 24 hours, Lord Mandelson gave up his peerage and the Metropolitan Police announced it is reviewing reports of alleged misconduct in public office over accusations he leaked sensitive government information to convicted paedophile Jeffrey Epstein. Facing a key Conservative vote in the House of Commons later today - can Sir Keir Starmer bury his associations with Lord Mandelson and his decision to appoint him as the UK's ambassador to the United States? Plus, Sam explains the significance of the battle ahead in parliament between the prime minister, his own MPs and opposition parties on whether he will be forced to disclose confidential vetting documents from Peter Mandelson's appointment as US ambassador."
    },
    {
        "title": "Saturday Night Live UK comedians revealed ahead of series launch",
        "description": "Saturday Night Live has announced the comedians cast for the first UK incarnation of the hit late-night US series.",
        "url": "https://news.sky.com/story/saturday-night-live-uk-comedians-revealed-ahead-of-series-launch-13503170",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-saturday-night-live_7155316.jpg?20260204120838",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-04 17:00:00",
        "Headline": "SNL, broadcast on NBC in the US, is a pop culture institution which launched the careers of stars including Bill Murray, Tina Fey and Eddie Murphy. The first UK incarnation launches on Sky next month.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Saturday Night Live has announced the comedians cast for the first UK incarnation of the hit late-night US series. They include Taskmaster stars Ania Magliano and Emma Sidi, Black Ops star Hammed Animashaun, and Ayoade Bamgboye, who was named best newcomer at the Edinburgh Comedy Awards last year. Larry Dean, who has appeared on Live At The Apollo, and Celeste Dring, whose credits include This Country and Lazy Susan, also feature in the SNL UK cast of 11, along with Paddy Young (Everyone Else Burns and Mitchell & Webb Are Not Helping) and \"Instagram heartthrob\" Al Nash. George Fouracres (Steve), Jack Shep (Big Boys) and Annabel Marlow (Six The Musical) complete the line-up, billed as the \"new generation\" of British comedians. SNL, broadcast on NBC in the US, is an American pop culture institution which has been running for 50 years, and launched the careers of stars including Bill Murray, Tina Fey, Eddie Murphy, Pete Davidson, Kristen Wiig and Will Ferrell. The first UK version is set to launch on Sky in March, with a guest host helming the show each week. Star hosts in the US last year included Sabrina Carpenter, Ariana Grande, Josh O'Connor, Glen Powell, Golden Globes presenter Nikki Glaser and recent Grammy winner Bad Bunny. \"I just love sketch comedy,\" said Dean, on why he wanted to join the show. \"There have been so many people who have appeared on Saturday Night Live, either as hosts or part of the cast, that are my comedy heroes - like Jim Carrey, Richard Pryor, Mike Myers, Dana Carvey.\" Fouracres said he had often watched clips of the US show and thought, \"I wish we had that. Why don't we have something like that?\" Being part of the new show \"blows my tiny mind\", he added. Producers announced the UK show's creative team in November and have said writers will also be revealed soon. Written, rehearsed and performed in the week of each show, every episode will be staged in front of a live studio audience and feature an opening monologue, topical sketches, live music, and a UK take on SNL's famous news satire, Weekend Update. Lead producer James Longman said the UK cast members represent \"the freshest voices we have\" and are \"bold, exciting and of course, incredibly funny\". Read more:The Ozzy tape found in an attic after 46 yearsKPop Demon Hunters singers to perform at BAFTAs The UK show will be overseen by US producer Lorne Michaels. Phil Edgar Jones, executive director for unscripted originals at Sky, said the time is right for the show as \"we all need a laugh like never before\". \"The show's long-standing legacy of discovering and nurturing outstanding comedy talent speaks for itself, and this UK version will build on that legacy with the support of Lorne Michaels, a brilliant local production team, and an exciting new generation of voices,\" he said. Saturday Night Live UK will be broadcast on Sky and streaming service NOW from 21 March."
    },
    {
        "title": "Sky News nominated for nine Royal Television Society TV journalism awards",
        "description": "Sky News has been nominated for nine Royal Television Society TV journalism awards, including for news channel of the year.",
        "url": "https://news.sky.com/story/sky-news-nominated-for-nine-royal-television-society-tv-journalism-awards-13503262",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-alex-crawford-background_7004313.jpg?20250829102912",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-04 14:54:00",
        "Headline": "A number of Sky News journalists have been acknowledged for outstanding work in their field, including lead world presenter Yalda Hakim, special correspondent Alex Crawford, Africa correspondent Yousra Elbagir and data and forensics correspondent Tom Cheshire.",
        "Content": "Sky News has been nominated for nine Royal Television Society TV journalism awards, including for news channel of the year. A number of Sky News journalists have been acknowledged for outstanding work in their field, including Yalda Hakim, who hosts the international news show, The World With Yalda Hakim, and has been recognised in the network presenter of the year category. Special correspondent Alex Crawford and Africa correspondent Yousra Elbagir take two of the three slots in the network television journalist of the year group, Crawford, who travels the world covering major stories, often from war zones, reported from countries including Syria, Libya and Somalia in 2025. She stars in our Hotspots series, which takes viewers straight into some of the world's most hostile environments. Elbagir has reported extensively on the war in Sudan, including an investigation into the \"killing fields\" where thousands have been targeted. Elsewhere, data and forensics correspondent Tom Cheshire is nominated for specialist journalist of the year, deputy political editor Sam Coates is shortlisted in the politics category, and news correspondent Mollie Malone is recognised in the emerging talent shortlist. Cheshire's work in 2025 included reporting from a far-right \"whites only\" settlement in Arkansas, while Malone has reported on a number of exclusives on UK prisons. As well as exclusive interviews and analysis from Westminster, Coates is also co-host of our Politics At Sam And Anne's podcast, alongside Politico's Anne McElvoy. In the news channel of the year category, Sky News - which has won the award for eight consecutive years - is up against BBC News and Al Jazeera English. Our international coverage has been recognised in multiple categories - as well as nods to Hakim, Crawford amd Elbagir, international correspondent John Sparks is up for a digital award for 24 Hours In The Kill Zone - for which he joined Ukrainian troops in an area targeted by explosive-carrying drones. He is up against BBC News' reporting on militia in Sudan, and ITV's political coverage on TikTok. Our reporting on life in Syria following the downfall of Bashar al Assad is in the running for the RTS international news coverage award, alongside Channel 4 News, which has also been recognised for its coverage on Syria, and Associated Press' reporting on famine in Gaza. Adrian Wells, chair of the RTS Television Journalism Awards, said it had been \"an exceptional year of very high-quality submissions\". He continued: \"UK-based broadcasters and content producers have demonstrated their skill, endeavour and bravery in pursuing the most important stories both on domestic and international fronts. \"Despite many other challenges in the media industry, the calibre of journalism demonstrated across the news categories has been extraordinary.'' The RTS awards will take place on 4 March, hosted by journalist and broadcaster Jeremy Vine. There will also be an outstanding contribution award and an RTS special award, which will also be presented during the ceremony."
    },
    {
        "title": "Snooker player and popular broadcaster and commentator John Virgo dies aged 79",
        "description": "Former player and broadcaster John Virgo has died at the age of 79, World Snooker has announced.",
        "url": "https://news.sky.com/story/snooker-legend-john-virgo-dies-aged-79-13503060",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-john-virgo-snooker_7155176.jpg?20260204093253",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-04 07:40:00",
        "Headline": "Tributes have been paid to the iconic player - whose larger-than-life personality made him beloved by TV audiences.",
        "Content": "Former player and broadcaster John Virgo has died at the age of 79, World Snooker has announced. He died at his home in Spain, World Seniors Snooker chairman Jason Francis said on social media. In a touching tribute, Mr Francis described the star on X as \"an amazingly loyal friend to me, and someone you felt was sat with you at the match when he was commentating on TV\". He added: \"JV was doing what he loved to do right up until the end, entertaining everyone. \"Such an important person in my life, but in our sport in general.\" Virgo's most notable victory was in the final of the 1979 UK Championship, where he defeated Terry Griffiths. Other key career wins include the 1980 Bombay International, 1980 Pontins Professional and the 1984 Professional Snooker League. \n                  PM in 'precarious position' after MPs force climbdown over Mandelson files release\n                 \n                  Beth Rigby: Even Starmer's allies are unsure about his future\n                 \n                  Mandelson-Epstein files: Keir Starmer may be facing his very own Profumo scandal\n                 He was inducted into the World Snooker Tour Hall of Fame in 2023 in recognition of his contributions to the sport as a player and broadcaster Born in Salford, Greater Manchester, he came to attention in the late 1970s. Read more from Sky News:Teen swims four hours to save familyAir India flight grounded after 'possible defect' In 1979 he surprised fans by reaching the semi-finals of the World Championship. An unfancied bet pre-tournament, Virgo beat former champion Alex Higgins in the quarter-finals before losing 16-15 to Terry Griffiths, who went on to win the championship, in the semis. But his biggest moment came later that year when he won the UK Championship, again beating Griffiths in a tight match, this time in the final, 14-13 at the Guild Hall in Preston. Following his retirement in 1994, he went on to have a successful broadcasting career with the BBC. He co-hosted the snooker-themed BBC TV show Big Break with comedian Jim Davidson during the 1990s. During his time on the show, he earned a comedic reputation for his impressions of snooker stars. In retirement, he also began playing exhibition games - where he became known for pulling off trick shots. Virgo also lent his hand at acting - playing himself in a radio play, Sunk, which follows an aspiring snooker player. He also spoke candidly about his gambling addiction, with reports quoting him as admitting he borrowed £200,000 against his mortgage. He is survived by his wife, publishing executive Rosie Ries, and his two children, Gary and Brook-Leah Virgo. Former snooker player Mike Dunn described Virgo as a \"great human being\" in a social media post. He said: \"Very sadly I've just woke to the news that the great John Virgo has passed away. \"'I'm speechless and don't know what to say. \"I loved working with him, he was a great human being.\""
    }
]