[
    {
        "title": "Europe tried to starve Putin's war machine with sanctions - but something else has happened",
        "description": "Why is Donald Trump threatening to impose sanctions, or tariffs, or maybe both, on India in relation to the Ukraine war?",
        "url": "https://news.sky.com/story/europes-sanctions-on-russia-were-to-starve-putins-funds-instead-something-else-has-happened-13415218",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-conway-oil_6996304.jpg?20250820160043",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-08-20 12:42:00",
        "Headline": "Sanctions imposed so far have made a marginal difference in clamping down on Russia and limiting its revenues. But Donald Trump's targeting of India, one of Moscow's biggest customers, may change things.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Why is Donald Trump threatening to impose sanctions, or tariffs, or maybe both, on India in relation to the Ukraine war? The short answer is that India has established itself as one of the single most important customers for one of the single most important products made in Russia: crude oil. You only have to glance at the data on Russian fossil fuel exports to see what I mean. Nor is it just India. China has raised its imports of Russian fossil fuels by 44% since the imposition of sanctions. Back before the invasion of Ukraine in 2022, by far and away the biggest recipient of Russian energy exports was Europe. Then Europe imposed sanctions on various different Russian products, most notably oil. The idea was to starve Vladimir Putin of the revenues he is using to fund the Russian war machine. Instead, something else happened: those Russian tankers which previously delivered oil to Europe instead started sending it to Indian oil refineries. The Middle Eastern oil tankers that had previously served those Russian refineries began sending their oil to Europe. Nothing, fundamentally, really changed. And while Europeans are no longer taking direct shipments of Russian oil, they are taking plenty of shipments of oil products - from diesel and petrol to kerosene - made from Russian oil in Indian refineries. In the face of this, Europe and its G7 allies have subsequently begun to try to prevent those tankers from taking Russian oil at all. A price cap was imposed on legitimate shipping companies, limiting the amount of revenue Russia could derive from its exports. That, in turn, created another step-shift: Russia began to build up its own \"shadow fleet\" of tankers which it used to carry on sending oil to India and China. And so, in the latest episode of sanctions \"whack-a-mole\", the G7 has begun to implement a separate round of bans on that shadow fleet. Now, the point is not that any of these measures were pointless. Each has made a marginal difference in clamping down on Russia and limiting its revenues. But the whole exercise has proved far harder than expected. Read more from Sky News:Key moments revealing Putin's hold on TrumpTrump sets red line on Ukraine peace deal support All of which is why Donald Trump is now talking about raising tariffs or imposing sanctions on India. He has discussed imposing secondary sanctions on countries continuing to do business with Russia. For all that he is being painted as one of Vladimir Putin's closest allies, in reality, these are dramatic economic levers that even Joe Biden stopped short of pulling. The question is whether they do indeed get activated - and what happens next in the game of sanctions \"whack-a-mole\"."
    },
    {
        "title": "Two Labour-run councils 'considering all options' to challenge migrant hotel use",
        "description": "Two Labour-run councils are considering legal action to stop the use of hotels to house migrants in their areas after Epping council won a temporary injunction.",
        "url": "https://news.sky.com/story/two-labour-run-councils-considering-all-options-to-challenge-migrant-hotel-use-13415299",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-starmer-cooper-epping_6996531.jpg?20250820233746",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-20 15:35:00",
        "Headline": "Wirral and Tamworth council leaders say they are exploring their options after a Conservative-run council in Essex won an interim High Court injunction to stop migrants being accommodated at a local hotel.",
        "Content": " Two Labour-run councils are considering legal action to stop the use of hotels to house migrants in their areas after Epping council won a temporary injunction. The leaders of Wirral and Tamworth councils both say they are considering their legal options in the wake of the Epping case, citing similar concerns about the impact of the hotels on their local communities. Politics latest: Judge in Epping hotel case was Tory candidate four times Epping Forest District Council won an interim High Court injunction on Tuesday to stop migrants being housed at The Bell Hotel, after arguing its owners did not have planning permission to do so. Paula Basnett, the Labour leader of Wirral council, said: \"We are actively considering all options available to us to ensure that any use of hotels or other premises in Wirral is lawful and does not ride roughshod over planning regulations or the wishes of our communities.\" She added: \"If necessary, we will not hesitate to challenge such decisions in order to protect both residents and those seeking refuge.\" Carol Dean, the Labour leader of Tamworth Borough Council, said she understands the \"strong feelings\" of residents about the use of a local hotel to house asylum seekers. She pointed out that under the Labour government, the use of hotels has halved from 402 to 210, with the aim of stopping the use of any hotels by 2029. But in light of the Epping case, she said \"we are closely monitoring developments and reviewing our legal position\". Badenoch backs more council rebellions Other Tory councils are also being encouraged to follow Epping's lead by party leader Kemi Badenoch. She has sent a letter to all the councils they control, pledging her support for them to fight migrant hotels. She wrote: \"The Epping hotel injunction is a victory for local people led by a good Conservative council working hard for their community. This is the difference Conservatives in local government deliver. Real plans. Real action.\" Conservative-run Broxbourne Council has announced it is exploring its legal options. The Reform UK leader of Kent County Council has also said she was writing to fellow leaders in Kent to explore whether they could potentially take legal action. Read more:Asylum seekers face being removed from Epping hotelLabour smell dirty tricks over asylum hotel court ruling Government under pressure The prospect of more rulings in favour of councils will leave ministers asking where else they might be able to house asylum seekers. Other options may include flats and ex-army bases. The prime minister and the home secretary are under huge pressure to clear the asylum backlog and stop using hotels across the country to house those waiting for their applications to be processed. Protests have sprung up at migrant hotels across the country. But The Bell Hotel in Epping became a focal point in recent weeks after an asylum seeker housed there was charged with sexually assaulting a 14-year-old girl. The council sought an interim High Court injunction to stop migrants from being accommodated at the hotel, owned by Somani Hotels Limited, on the basis that using it for that purpose contravened local planning regulations. The interim injunction demanded that the hotel be cleared of its occupants within 14 days, but in his ruling on Tuesday, Mr Justice Eyre granted the temporary block, while extending the time limit by which it must stop housing asylum seekers to 12 September. Somani Hotels said it intended to appeal the decision. Its barrister, Piers Riley-Smith, argued it would set a precedent that could affect \"the wider strategy\" of housing asylum seekers in hotels.  Epping hotel 'sidestepped public scrutiny' A government attempt to delay the application was rejected by the High Court judge. Home Office barristers had argued the case had a \"substantial impact\" on the government performing its legal duties to asylum seekers. But Mr Justice Eyre dismissed the Home Office's bid, stating that the department's involvement was \"not necessary\". The judge said the hotel's owners \"sidestepped the public scrutiny and explanation which would otherwise have taken place if an application for planning permission or for a certificate of lawful use had been made\". Reacting to Tuesday's judgment, border security minister Dame Angela Eagle said the government will \"continue working with local authorities and communities to address legitimate concerns\". She added: \"Our work continues to close all asylum hotels by the end of this parliament.\""
    },
    {
        "title": "Police watchdog closes investigations over decision to charge Caroline Flack",
        "description": "The police watchdog has closed its investigations into the circumstances leading up to the decision to charge TV presenter Caroline Flack with assaulting her boyfriend.",
        "url": "https://news.sky.com/story/police-watchdog-closes-investigations-over-decision-to-charge-caroline-flack-13415235",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-caroline-flack-brit-awards_6996234.jpg?20250820141734",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-20 13:00:00",
        "Headline": "Caroline Flack, best known for presenting ITV's Love Island, died in February 2020. A coroner ruled the star - who also won Strictly Come Dancing - took her own life after discovering she was definitely going to face a trial.",
        "Content": "The police watchdog has closed its investigations into the circumstances leading up to the decision to charge TV presenter Caroline Flack with assaulting her boyfriend. Flack died in February 2020, with a coroner ruling that she took her own life after discovering she was definitely going to face a trial. The Crown Prosecution Service (CPS) initially recommended a caution after the alleged assault in December 2019 - but London's Metropolitan Police appealed and the Love Island host was charged with assault by beating. Various reviews into the way the case was handled have been carried out by the CPS, the Met, and the Independent Office for Police Conduct (IOPC) since Flack's death. In April 2024, the star's mother told Sky News she believes her daughter's celebrity status likely contributed towards the decision to charge her. It has now emerged that the IOPC closed its latest investigation, relating to the actions of officers in appealing to the CPS, in January 2025 - finding the outcome was \"reasonable and proportionate\". An IOPC spokesperson said it received a complaint referral from the Met, which contained \"a number of allegations about the force's investigation\" into the alleged assault, in March 2024. The majority of the allegations had already been investigated by the force and reviewed by the IOPC, the watchdog said, so it found no further action was required. However, the Met was directed to investigate one aspect of the complaint \"on the basis there may be new witness evidence available\". This related to the actions of officers in appealing the initial CPS decision, and five allegations were returned to the force's Directorate of Professional Standards (DPS) to \"resolve in a proportionate manner\", the IOPC spokesperson told Sky News. In June 2024, the Met found there was \"no new evidence that would alter any previous outcomes\", the spokesperson added, and the complainant asked the IOPC to review once again. \"Following that review, in January 2025 we found that outcome to be reasonable and proportionate.\" A Met Police spokesperson said DPS officers made further enquiries and examined the evidence last year. \"It did not change the original outcome that the service provided by officers was acceptable,\" the spokesperson said. \"The family were advised of the outcome in June [2024] and then appealed that outcome to the IOPC. The IOPC carried out a review and, in January 2025, found no new evidence that would alter any of the previous outcomes.\" Both the Met and the IOPC have closed their investigations. The IOPC said another review could be considered in light of any new evidence. At the end of Flack's inquest, coroner Mary Hassell said the alleged assault had \"played out in the national press\" following her arrest and had a serious impact on her mental health. In April 2024, her mother Christine Flack told Sky News: \"This wasn't domestic violence. This was an accident. But she was portrayed in the court and in the newspapers as a domestic abuser, and that's what hurts. That's what I want got rid of - because she wasn't.\" She said she believed her daughter was treated differently due to her celebrity status. \"And that's not on. She shouldn't be treated better, but she shouldn't be treated worse.\" This was not the first investigation into the handling of Flack's case, with the Met initially referring itself to the watchdog just a few days after her death. The DPS found there was no misconduct, prompting another complaint from Flack's family to the IOPC. In 2023, the IOPC ordered the force to apologise for not recording its reason for appealing against the caution, but said it had not identified any misconduct. In the days after the TV presenter's death, the CPS also reviewed its handling of the case. Flack's boyfriend, Lewis Burton, had said he did not support the prosecution, and following her death her management released a statement criticising the decision. Read more from Sky News:Grange Hill creator calls for radical TV mergerPaul Weller suing accountants over his Gaza comments At the time, a CPS spokesperson said it was normal practice for prosecutors to hold a debriefing after complex or sensitive cases have ended. \"This has taken place and found that the case was handled appropriately and in line with our published legal guidance,\" they said. Flack, 40, presented shows including spin-offs I'm A Celebrity... Get Me Out Of Here! NOW! and The Xtra Factor, as well as one season of the main X Factor show with former contestant Olly Murs, before becoming best known as the host of Love Island. She also won Strictly Come Dancing in 2014. Sky News has contacted Flack's family for comment. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Israel begins first stages of Gaza City takeover operation - as UK condemns settlement plan",
        "description": "Israel has said it has begun the first stages of its takeover of Gaza City - as the UK condemned the approval of plans for a new West Bank settlement.",
        "url": "https://news.sky.com/story/israel-begins-first-stages-of-gaza-city-takeover-as-uk-condemns-approval-of-west-bank-settlement-plan-13415376",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-city-israel_6996533.jpg?20250820234704",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-20 18:54:00",
        "Headline": "An Israeli military spokesperson said troops currently hold the outskirts of the city. It comes after tens of thousands of reservists were called up to help seize Gaza's biggest urban centre.",
        "Content": "Israel has said it has begun the first stages of its takeover of Gaza City - as the UK condemned the approval of plans for a new West Bank settlement. Brigadier General Effie Defrin, Israel's military spokesperson, said on Wednesday that \"IDF forces are holding the outskirts of Gaza City\" after preliminary operations to take the entire area. An estimated 60,000 reserve soldiers have also been called up to help seize Gaza's biggest urban centre, but will not report for duty until September, according to a military official. Israeli troops are already operating in the Zeitoun neighbourhood of Gaza City, and the Jabaliya refugee camp in northern Gaza. Prime Minister Benjamin Netanyahu's war cabinet approved the plans last month, which include an eventual full security takeover of all of Gaza, despite growing international criticism that it will likely lead to the displacement of many more Palestinians. He is said to have sped up the timeline for taking control of Hamas strongholds after both sides clashed near Khan Younis, south of Gaza City, on Wednesday. Israel claims it will help any civilians evacuate before any assault begins. Ceasefire proposal being considered Israeli officials said they are also considering a new ceasefire proposal put forward by Qatar and Egypt. The deal, which involves a 60-day ceasefire and the release of some of the remaining Israeli hostages and Palestinian prisoners, has already been accepted by Hamas. Thousands of Israeli civilians have called for the government to accept a ceasefire and reverse its decision to take over Gaza City, but Mr Netanyahu is thought to be under pressure from some far-right members of his coalition to reject the deal and continue to pursue the annexation of the territory. West Bank settlement plan approved One of those is Bezalel Smotrich, Israel's finance minister, who announced on Wednesday that a controversial plan for a settlement project in the occupied West Bank had been approved after they received the final go-ahead from Israel's higher planning committee. Mr Smotrich, an ultranationalist in the ruling right-wing coalition, said in a statement that the government was delivering with the settlement what it had promised for years: \"The Palestinian state is being erased from the table, not with slogans but with actions.\" He said last week that the settlement would \"finally bury the idea of a Palestinian state, because there is nothing to recognise and no one to recognise\". 'A stake through the heart of two-state solution' British Foreign Secretary David Lammy condemned the plan, saying it \"would divide a Palestinian state in two\". In a post on the X social media platform, Mr Lammy called the settlement in the West Bank \"a flagrant breach of international law\", which \"critically undermines the two-state solution\", and urged the Israeli government to reverse the decision. The UN also condemned the decision, with spokesperson Stephane Dujarric saying that it \"will drive a stake through the heart of the two-state solution\". Read more:Inside the conflict forcing Palestinians from their homesThe city where what was law now has no place in reality Where is the settlement? The settlement is set to be built in E1, an open tract of land east of Jerusalem, and includes around 3,500 apartments to expand the existing settlement of Maale Adumim. E1 has been eyed for Israeli development for more than two decades, but plans were halted due to pressure from the US during previous administrations. A two-state solution to the decades-old Israeli-Palestinian conflict would see a Palestinian state in East Jerusalem, the West Bank and Gaza existing side by side with Israel. Today, an estimated 700,000 Israeli settlers live in the West Bank and East Jerusalem. There is also a growing movement of Israelis wanting to build settlements in Gaza. Settlers make up around 5% of Israel's population and 15% of the West Bank's population, according to data from Peace Now. Settlements are illegal under international law and have been condemned by the UN. They are, however, authorised by the Israeli government."
    },
    {
        "title": "Fresh call for UK-wide smacking ban as NSPCC says more young adults believe it's wrong",
        "description": "Campaigners have issued a fresh call to ban smacking across the UK after a poll found more young adults think it's unacceptable.",
        "url": "https://news.sky.com/story/fresh-call-for-uk-wide-smacking-ban-as-nspcc-says-more-young-adults-believe-its-wrong-13415184",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-smacking-child_6996352.jpg?20250820170640",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-20 11:26:00",
        "Headline": "Health experts have urged a smacking ban across the UK, with doctors and psychiatrists saying research shows the \"detrimental effects of physical punishment\".",
        "Content": "Campaigners have issued a fresh call to ban smacking across the UK after a poll found more young adults think it's unacceptable. All corporal punishment of children, including shaking, slapping and hitting, became illegal in Wales in 2022. Scotland brought in a similar ban in 2020. However, in England and Northern Ireland, it's unlawful to hit your child except where it's \"reasonable punishment\" - something that's judged on a case-by-case basis. New NSPCC research suggests 82% of 18-24-year-olds believe any force whatsoever by a parent is unacceptable - an increase on 64% in 2023. For parents specifically, the latest figure is 81%, up from 80% last year and 76% in 2022. Some 3,800 adults were surveyed in England for the latest research; 749 of these were parents with a child under 18, and 198 of them were 18 to 24 years old. When it comes to adults of all ages, 71% said physically punishing a child was wrong - up from 67% in 2023. Health experts have urged parliament to bring in a smacking ban across the UK, with doctors and psychiatrists saying research shows the \"detrimental effects of physical punishment\". The UK's four children's commissioners also came together in the wake of the Sara Sharif murder to call for a blanket ban, calling the reasonable chastisement defence \"outdated and morally repugnant\".  'Wake-up call' However, Tory peer Lord Jackson of Peterborough has warned a ban in England would be \"disproportionate and heavy-handed\". He told a parliamentary debate in June that removing the reasonable chastisement clause in the Children's Act could criminalise \"good and caring parents, as well as overloading children's services departments\". NSPCC chief executive Chris Sherwood said its research was a \"wake-up call\" and showed parents and young adults \"don't want physical punishment to be a part of anyone's childhood\". \"As parliamentarians continue to debate the Children's Wellbeing and Schools Bill, we urge them to change the law to better reflect public attitudes to violence against children and ensure no childhood has to be tainted by physical punishment again,\" he said. Read more from Sky News:Probe launched into 'horrifying' death of online streamerInside ISIS resurgence - and the former Briton heading it Children's charity Barnado's also said the law must change as \"children continue to have less legal protection against physical assault than adults\". \"Physical punishment like smacking is harmful to a child's health and development, and there's strong evidence that it influences their attitudes toward violence,\" said chief executive Lynn Perry. Professor Andrew Rowland, from the Royal College of Paediatrics and Child Health, added: \"Health professionals stand firmly with parents and young people in recognising that physical punishment is not only outdated and unjust, but also harmful to children's health and wellbeing. \"We urge the government to listen to parents, young people, health professionals and the wider public and to finally remove the outdated and unfair 'reasonable punishment' defence.\" A Department for Education spokesperson said: \"While we are looking closely at the legal changes made in Wales and Scotland in relation to smacking, we have no plans to legislate at this stage.\""
    },
    {
        "title": "Did Robert Jenrick really 'boast' about opening hotels for asylum seekers?",
        "description": "A row has broken out between the Tories and Reform about previous comments on migrant hotels, so who said what and when?",
        "url": "https://news.sky.com/story/did-robert-jenrick-really-boast-about-opening-hotels-for-asylum-seekers-13415335",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-robert-jenrick-breakfast_6914722.jpg?20250513072312",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-08-20 16:59:00",
        "Headline": "The shadow justice secretary has faced criticism for his record as immigration minister - but the truth is a bit more murky.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n A row has broken out between the Tories and Reform about previous comments on migrant hotels, so who said what and when? At the centre of the argument is an interview Robert Jenrick did with Sky News back in November 2022, one week after he was appointed immigration minister in Rishi Sunak's government. His appearance came amid a crisis at an asylum seeker processing centre in Kent, which had become severely overcrowded - with migrants sleeping on the floor and families being housed in marquees. Politics latest: Councils plan legal challenges to migrant hotels The home secretary at the time, Suella Braverman, had also been accused of allowing the situation to develop by failing to procure sufficient alternative accommodation - such as hotels - for migrants to be taken to.  Asked about this by Sky News in 2022, Robert Jenrick said: \"More hotels have been coming online almost every month throughout the whole of this year. \"So, Suella Braverman and her predecessor, Priti Patel, were procuring more hotels. What I have done in my short tenure is ramp that up and procure even more because November, historically, has been one of the highest months of the year for migrants illegally crossing the Channel.\"  Fast-forward almost three years, and this clip has been seized on by Reform UK as evidence that Mr Jenrick \"boasted\" about how many migrant hotels he had opened. That's a potentially damaging accusation, given the now shadow justice secretary recently joined protests outside a migrant hotel in Essex. Mr Jenrick responded by accusing Reform of posting a \"selectively clipped\" video that didn't include the context about the Kent processing centre. To an extent, he has a point. At the time, the government was fighting accusations that they were risking an expensive court action from migrants claiming they were being detained unlawfully. The minister's response was to point out that they were sourcing alternative options to make sure this didn't happen and to prevent order breaking down in Kent. Mr Jenrick has also pointed to other comments he made at the time saying, \"it is essential we exit the hotels altogether\" and describing the expensive hotel bill as \"disgraceful\". But that's not to say Robert Jenrick hasn't undergone quite a pronounced shift in both language and substance when it comes to migration. For instance, in the same Sky News interview in 2022, he said: \"I would never demonise people coming to this country in pursuit of a better life. And I understand and appreciate our obligation to refugees.\" At the time, this wasn't a surprising view from a minister commonly considered to be in the centre of the Tory party. But Mr Jenrick's time as immigration minister saw him move further to the right. As he has since said himself: \"I could see the breakdown of the British state was doing immense damage. It angered me, and it motivated me to do absolutely everything to fix the problem.\" The following months saw Mr Jenrick significantly harden his position, to the point that he resigned over the government's approach. But the bigger contradiction Reform is trying to get at by picking this fight is around the Tory record. It is a fact that the use of hotels to house asylum seekers peaked at just over 55,000 while the Conservatives were in power. Similarly, it's a fact that legal migration reached record levels on the Tories watch. Mr Jenrick can fairly claim that - in the final year of his front-bench career - he did go further than most to try to change this. But he can't change the data from the time. Reform knows that - just as it also knows the Tory record on migration is one of the big pull factors bringing their voters over to them. Read more from Sky News:US-mexico border wall to be painted black, US saysBBC should be 'put beyond reach of politicians'"
    },
    {
        "title": "Former priest Chris Brain found guilty of 17 counts of indecent assault",
        "description": "A former Church of England priest who ran a rave-inspired \"cult\" group has been found guilty of indecently assaulting nine women. ",
        "url": "https://news.sky.com/story/former-priest-chris-brain-found-guilty-of-17-counts-of-indecent-assault-13415276",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-christopher-brain-sheffield_6954281.jpg?20250701095655",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-20 15:07:00",
        "Headline": "No subtitle found",
        "Content": "A former Church of England priest who ran a rave-inspired \"cult\" group has been found guilty of indecently assaulting nine women.  Chris Brain, 68, led the Nine O'Clock Service (NOS) in the 1980s and 1990s in Sheffield, with services aimed at 18 to 30-year-olds featuring multimedia, scantily-dressed women, and a live band. The movement was initially seen by the church as a \"ground-breaking\" success story and attracted between 500 to 600 people to worship at 9pm on Sundays after NOS moved from St Thomas Church to The Rotunda in Ponds Forge. Brain, from Wilmslow, Cheshire, denied committing sexual offences against 13 women, including one count of rape and 36 counts of indecent assault between 1981 and 1995. Today he was found guilty of 17 counts of indecent assault relating to nine women and acquitted of 15 similar charges. The jury is still deliberating on five outstanding counts, including the rape charge. Inner London Crown Court heard Brain's ordination was \"fast-tracked\", including claims he cheated in his exams, and he wore the same cassock as Robert De Niro in The Mission for the ceremony in 1991. \n                  Chris Brain: Leader of 'cult-like' Nine O'Clock Service denies brainwashing members to satisfy sexual desires\n                 \n                  Archbishop of Canterbury job advert goes live – and for the first time they could be a woman\n                 \n                  Justin Welby was 'overwhelmed' by number of child abuse allegations - as he admits he 'got it wrong'\n                 But prosecutors said NOS became a \"closed and controlled group\", in which Brain \"dominated and abused his position\" to sexually assault a \"staggering number of women from his congregation\". NOS collapsed in 1994 after women made allegations about Brain, who resigned from his holy orders in 1995 amid \"enormous media interest\", the court heard. 'Allegations destroyed my life'  Giving evidence, Brain admitted receiving back massages from some NOS members, which he said started as a way to relieve tension headaches, but would \"very rarely\" lead to sexual activity. \"With some of my closest friends, it would be kissing sometimes, occasionally massaging, stroking. Anything more than that, we would back off,\" he said. He told the jury any touching was done with \"100%\" consent, and he would've \"instantly stopped\" if anyone had indicated they were uncomfortable. Brain said the allegations had \"basically destroyed my life\" and suggested the women had \"to exaggerate these things to make it either sexual or controlling\" in order \"to make a criminal case\". Brain said he became involved in the dotcom boom in the late 1990s before setting up a business helping smaller firms transition into big companies, which folded once he was charged."
    },
    {
        "title": "Police officer describes moment he was shot with crossbow - as attacker jailed",
        "description": "A police officer has described the moment he was shot with a crossbow - as his \"extremely dangerous\" attacker was sentenced to nine years in jail.",
        "url": "https://news.sky.com/story/police-officer-describes-moment-he-was-shot-with-crossbow-as-attacker-jailed-13414581",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jason-king-crossbow_6995303.jpg?20250819162255",
        "type": "Home",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-08-20 12:50:00",
        "Headline": "Jason King, 54, shot PC Curtis Foster with a crossbow after stabbing a neighbour following an altercation in Downley, Wycombe, in May last year.",
        "Content": "By Miriam Kuepper, news reporter   A police officer has described the moment he was shot with a crossbow - as his \"extremely dangerous\" attacker was sentenced to nine years in jail. Jason King, 54, fired the weapon at PC Curtis Foster after stabbing a neighbour, a man in his 60s, following an altercation in Downley, Wycombe, on 10 May last year. PC Foster was struck in the leg by a crossbow bolt while King chased after him and his fellow unarmed officer. \"I knew something had impacted me, but my adrenaline was so high that the pain wasn't really there,\" PC Foster said. \"I first realised I was bleeding quite a lot when I could feel it running down my leg, and then I touched my leg with above my trousers, and my whole hand was red where it'd gone through my trousers already.\" PC Foster and his colleague cleared the area of civilians, while armed officers chased King to a local park. King also fired the crossbow at a police dog but missed. He was ordered to drop the weapon, but instead started running with it in hand towards the exit of the park to where PC Foster had escaped. An armed officer fired one shot at King, striking him in the abdomen, to stop him. 'Covered in my blood' As King was apprehended, paramedics and his fellow officers treated the seriously injured PC Foster. \"There was a lot of blood. My two colleagues that turned up initially on scene were covered in my blood - that's how much blood I'd lost,\" PC Foster said. \"When we got to the hospital, the doctor had a feel of it and said that I was really lucky it didn't strike an artery. It was a couple of centimetres away from hitting an artery in the back of my leg.\" PC Foster has since made a full recovery, as did the neighbour King stabbed. King himself was taken to hospital under police supervision with potentially life-changing injuries and was discharged 10 days later, when he was arrested and taken into police custody. On Wednesday, King was jailed at Aylesbury Crown Court for nine years with a further three years on extended licence having previously pleaded guilty to unlawful wounding, having an article with a blade or point, having an offensive weapon, wounding with intent and affray regarding the incident. \"Jason King will now serve a substantial prison sentence as a result of his violent actions on 10 May 2024. The community and residents of Downley are much safer for it,\" said senior investigating officer Detective Inspector Nick Hind. He added: \"The courage of our officers in dealing with this incident was second to none.\" Read more from Sky News:Councillor jailed for sexually abusing girlUK set for hottest summer on record 'Significant threat to police' DI Hind explained that the impact the incident had in the local community couldn't be underestimated as King was \"an extremely dangerous man, who posed a significant threat to police, other emergency services and members of the community\". A mandatory referral to the Independent Office for Police Conduct was made after the police shooting of King. The IOPC, which concluded its investigation in November, commended \"everybody involved in this incident\", according to DI Hind."
    },
    {
        "title": "Two Labour-run councils 'considering all options' to challenge migrant hotel use",
        "description": "Two Labour-run councils are considering legal action to stop the use of hotels to house migrants in their areas after Epping council won a temporary injunction.",
        "url": "https://news.sky.com/story/two-labour-run-councils-considering-all-options-to-challenge-migrant-hotel-use-13415299",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-starmer-cooper-epping_6996531.jpg?20250820233746",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-20 15:35:00",
        "Headline": "Wirral and Tamworth council leaders say they are exploring their options after a Conservative-run council in Essex won an interim High Court injunction to stop migrants being accommodated at a local hotel.",
        "Content": " Two Labour-run councils are considering legal action to stop the use of hotels to house migrants in their areas after Epping council won a temporary injunction. The leaders of Wirral and Tamworth councils both say they are considering their legal options in the wake of the Epping case, citing similar concerns about the impact of the hotels on their local communities. Politics latest: Judge in Epping hotel case was Tory candidate four times Epping Forest District Council won an interim High Court injunction on Tuesday to stop migrants being housed at The Bell Hotel, after arguing its owners did not have planning permission to do so. Paula Basnett, the Labour leader of Wirral council, said: \"We are actively considering all options available to us to ensure that any use of hotels or other premises in Wirral is lawful and does not ride roughshod over planning regulations or the wishes of our communities.\" She added: \"If necessary, we will not hesitate to challenge such decisions in order to protect both residents and those seeking refuge.\" Carol Dean, the Labour leader of Tamworth Borough Council, said she understands the \"strong feelings\" of residents about the use of a local hotel to house asylum seekers. She pointed out that under the Labour government, the use of hotels has halved from 402 to 210, with the aim of stopping the use of any hotels by 2029. But in light of the Epping case, she said \"we are closely monitoring developments and reviewing our legal position\". Badenoch backs more council rebellions Other Tory councils are also being encouraged to follow Epping's lead by party leader Kemi Badenoch. She has sent a letter to all the councils they control, pledging her support for them to fight migrant hotels. She wrote: \"The Epping hotel injunction is a victory for local people led by a good Conservative council working hard for their community. This is the difference Conservatives in local government deliver. Real plans. Real action.\" Conservative-run Broxbourne Council has announced it is exploring its legal options. The Reform UK leader of Kent County Council has also said she was writing to fellow leaders in Kent to explore whether they could potentially take legal action. Read more:Asylum seekers face being removed from Epping hotelLabour smell dirty tricks over asylum hotel court ruling Government under pressure The prospect of more rulings in favour of councils will leave ministers asking where else they might be able to house asylum seekers. Other options may include flats and ex-army bases. The prime minister and the home secretary are under huge pressure to clear the asylum backlog and stop using hotels across the country to house those waiting for their applications to be processed. Protests have sprung up at migrant hotels across the country. But The Bell Hotel in Epping became a focal point in recent weeks after an asylum seeker housed there was charged with sexually assaulting a 14-year-old girl. The council sought an interim High Court injunction to stop migrants from being accommodated at the hotel, owned by Somani Hotels Limited, on the basis that using it for that purpose contravened local planning regulations. The interim injunction demanded that the hotel be cleared of its occupants within 14 days, but in his ruling on Tuesday, Mr Justice Eyre granted the temporary block, while extending the time limit by which it must stop housing asylum seekers to 12 September. Somani Hotels said it intended to appeal the decision. Its barrister, Piers Riley-Smith, argued it would set a precedent that could affect \"the wider strategy\" of housing asylum seekers in hotels.  Epping hotel 'sidestepped public scrutiny' A government attempt to delay the application was rejected by the High Court judge. Home Office barristers had argued the case had a \"substantial impact\" on the government performing its legal duties to asylum seekers. But Mr Justice Eyre dismissed the Home Office's bid, stating that the department's involvement was \"not necessary\". The judge said the hotel's owners \"sidestepped the public scrutiny and explanation which would otherwise have taken place if an application for planning permission or for a certificate of lawful use had been made\". Reacting to Tuesday's judgment, border security minister Dame Angela Eagle said the government will \"continue working with local authorities and communities to address legitimate concerns\". She added: \"Our work continues to close all asylum hotels by the end of this parliament.\""
    },
    {
        "title": "Fresh call for UK-wide smacking ban as NSPCC says more young adults believe it's wrong",
        "description": "Campaigners have issued a fresh call to ban smacking across the UK after a poll found more young adults think it's unacceptable.",
        "url": "https://news.sky.com/story/fresh-call-for-uk-wide-smacking-ban-as-nspcc-says-more-young-adults-believe-its-wrong-13415184",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-smacking-child_6996352.jpg?20250820170640",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-20 11:26:00",
        "Headline": "Health experts have urged a smacking ban across the UK, with doctors and psychiatrists saying research shows the \"detrimental effects of physical punishment\".",
        "Content": "Campaigners have issued a fresh call to ban smacking across the UK after a poll found more young adults think it's unacceptable. All corporal punishment of children, including shaking, slapping and hitting, became illegal in Wales in 2022. Scotland brought in a similar ban in 2020. However, in England and Northern Ireland, it's unlawful to hit your child except where it's \"reasonable punishment\" - something that's judged on a case-by-case basis. New NSPCC research suggests 82% of 18-24-year-olds believe any force whatsoever by a parent is unacceptable - an increase on 64% in 2023. For parents specifically, the latest figure is 81%, up from 80% last year and 76% in 2022. Some 3,800 adults were surveyed in England for the latest research; 749 of these were parents with a child under 18, and 198 of them were 18 to 24 years old. When it comes to adults of all ages, 71% said physically punishing a child was wrong - up from 67% in 2023. Health experts have urged parliament to bring in a smacking ban across the UK, with doctors and psychiatrists saying research shows the \"detrimental effects of physical punishment\". The UK's four children's commissioners also came together in the wake of the Sara Sharif murder to call for a blanket ban, calling the reasonable chastisement defence \"outdated and morally repugnant\".  'Wake-up call' However, Tory peer Lord Jackson of Peterborough has warned a ban in England would be \"disproportionate and heavy-handed\". He told a parliamentary debate in June that removing the reasonable chastisement clause in the Children's Act could criminalise \"good and caring parents, as well as overloading children's services departments\". NSPCC chief executive Chris Sherwood said its research was a \"wake-up call\" and showed parents and young adults \"don't want physical punishment to be a part of anyone's childhood\". \"As parliamentarians continue to debate the Children's Wellbeing and Schools Bill, we urge them to change the law to better reflect public attitudes to violence against children and ensure no childhood has to be tainted by physical punishment again,\" he said. Read more from Sky News:Probe launched into 'horrifying' death of online streamerInside ISIS resurgence - and the former Briton heading it Children's charity Barnado's also said the law must change as \"children continue to have less legal protection against physical assault than adults\". \"Physical punishment like smacking is harmful to a child's health and development, and there's strong evidence that it influences their attitudes toward violence,\" said chief executive Lynn Perry. Professor Andrew Rowland, from the Royal College of Paediatrics and Child Health, added: \"Health professionals stand firmly with parents and young people in recognising that physical punishment is not only outdated and unjust, but also harmful to children's health and wellbeing. \"We urge the government to listen to parents, young people, health professionals and the wider public and to finally remove the outdated and unfair 'reasonable punishment' defence.\" A Department for Education spokesperson said: \"While we are looking closely at the legal changes made in Wales and Scotland in relation to smacking, we have no plans to legislate at this stage.\""
    },
    {
        "title": "Police watchdog closes investigations over decision to charge Caroline Flack",
        "description": "The police watchdog has closed its investigations into the circumstances leading up to the decision to charge TV presenter Caroline Flack with assaulting her boyfriend.",
        "url": "https://news.sky.com/story/police-watchdog-closes-investigations-over-decision-to-charge-caroline-flack-13415235",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-caroline-flack-brit-awards_6996234.jpg?20250820141734",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-20 13:00:00",
        "Headline": "Caroline Flack, best known for presenting ITV's Love Island, died in February 2020. A coroner ruled the star - who also won Strictly Come Dancing - took her own life after discovering she was definitely going to face a trial.",
        "Content": "The police watchdog has closed its investigations into the circumstances leading up to the decision to charge TV presenter Caroline Flack with assaulting her boyfriend. Flack died in February 2020, with a coroner ruling that she took her own life after discovering she was definitely going to face a trial. The Crown Prosecution Service (CPS) initially recommended a caution after the alleged assault in December 2019 - but London's Metropolitan Police appealed and the Love Island host was charged with assault by beating. Various reviews into the way the case was handled have been carried out by the CPS, the Met, and the Independent Office for Police Conduct (IOPC) since Flack's death. In April 2024, the star's mother told Sky News she believes her daughter's celebrity status likely contributed towards the decision to charge her. It has now emerged that the IOPC closed its latest investigation, relating to the actions of officers in appealing to the CPS, in January 2025 - finding the outcome was \"reasonable and proportionate\". An IOPC spokesperson said it received a complaint referral from the Met, which contained \"a number of allegations about the force's investigation\" into the alleged assault, in March 2024. The majority of the allegations had already been investigated by the force and reviewed by the IOPC, the watchdog said, so it found no further action was required. However, the Met was directed to investigate one aspect of the complaint \"on the basis there may be new witness evidence available\". This related to the actions of officers in appealing the initial CPS decision, and five allegations were returned to the force's Directorate of Professional Standards (DPS) to \"resolve in a proportionate manner\", the IOPC spokesperson told Sky News. In June 2024, the Met found there was \"no new evidence that would alter any previous outcomes\", the spokesperson added, and the complainant asked the IOPC to review once again. \"Following that review, in January 2025 we found that outcome to be reasonable and proportionate.\" A Met Police spokesperson said DPS officers made further enquiries and examined the evidence last year. \"It did not change the original outcome that the service provided by officers was acceptable,\" the spokesperson said. \"The family were advised of the outcome in June [2024] and then appealed that outcome to the IOPC. The IOPC carried out a review and, in January 2025, found no new evidence that would alter any of the previous outcomes.\" Both the Met and the IOPC have closed their investigations. The IOPC said another review could be considered in light of any new evidence. At the end of Flack's inquest, coroner Mary Hassell said the alleged assault had \"played out in the national press\" following her arrest and had a serious impact on her mental health. In April 2024, her mother Christine Flack told Sky News: \"This wasn't domestic violence. This was an accident. But she was portrayed in the court and in the newspapers as a domestic abuser, and that's what hurts. That's what I want got rid of - because she wasn't.\" She said she believed her daughter was treated differently due to her celebrity status. \"And that's not on. She shouldn't be treated better, but she shouldn't be treated worse.\" This was not the first investigation into the handling of Flack's case, with the Met initially referring itself to the watchdog just a few days after her death. The DPS found there was no misconduct, prompting another complaint from Flack's family to the IOPC. In 2023, the IOPC ordered the force to apologise for not recording its reason for appealing against the caution, but said it had not identified any misconduct. In the days after the TV presenter's death, the CPS also reviewed its handling of the case. Flack's boyfriend, Lewis Burton, had said he did not support the prosecution, and following her death her management released a statement criticising the decision. Read more from Sky News:Grange Hill creator calls for radical TV mergerPaul Weller suing accountants over his Gaza comments At the time, a CPS spokesperson said it was normal practice for prosecutors to hold a debriefing after complex or sensitive cases have ended. \"This has taken place and found that the case was handled appropriately and in line with our published legal guidance,\" they said. Flack, 40, presented shows including spin-offs I'm A Celebrity... Get Me Out Of Here! NOW! and The Xtra Factor, as well as one season of the main X Factor show with former contestant Olly Murs, before becoming best known as the host of Love Island. She also won Strictly Come Dancing in 2014. Sky News has contacted Flack's family for comment. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Did Robert Jenrick really 'boast' about opening hotels for asylum seekers?",
        "description": "A row has broken out between the Tories and Reform about previous comments on migrant hotels, so who said what and when?",
        "url": "https://news.sky.com/story/did-robert-jenrick-really-boast-about-opening-hotels-for-asylum-seekers-13415335",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-robert-jenrick-breakfast_6914722.jpg?20250513072312",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-08-20 16:59:00",
        "Headline": "The shadow justice secretary has faced criticism for his record as immigration minister - but the truth is a bit more murky.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n A row has broken out between the Tories and Reform about previous comments on migrant hotels, so who said what and when? At the centre of the argument is an interview Robert Jenrick did with Sky News back in November 2022, one week after he was appointed immigration minister in Rishi Sunak's government. His appearance came amid a crisis at an asylum seeker processing centre in Kent, which had become severely overcrowded - with migrants sleeping on the floor and families being housed in marquees. Politics latest: Councils plan legal challenges to migrant hotels The home secretary at the time, Suella Braverman, had also been accused of allowing the situation to develop by failing to procure sufficient alternative accommodation - such as hotels - for migrants to be taken to.  Asked about this by Sky News in 2022, Robert Jenrick said: \"More hotels have been coming online almost every month throughout the whole of this year. \"So, Suella Braverman and her predecessor, Priti Patel, were procuring more hotels. What I have done in my short tenure is ramp that up and procure even more because November, historically, has been one of the highest months of the year for migrants illegally crossing the Channel.\"  Fast-forward almost three years, and this clip has been seized on by Reform UK as evidence that Mr Jenrick \"boasted\" about how many migrant hotels he had opened. That's a potentially damaging accusation, given the now shadow justice secretary recently joined protests outside a migrant hotel in Essex. Mr Jenrick responded by accusing Reform of posting a \"selectively clipped\" video that didn't include the context about the Kent processing centre. To an extent, he has a point. At the time, the government was fighting accusations that they were risking an expensive court action from migrants claiming they were being detained unlawfully. The minister's response was to point out that they were sourcing alternative options to make sure this didn't happen and to prevent order breaking down in Kent. Mr Jenrick has also pointed to other comments he made at the time saying, \"it is essential we exit the hotels altogether\" and describing the expensive hotel bill as \"disgraceful\". But that's not to say Robert Jenrick hasn't undergone quite a pronounced shift in both language and substance when it comes to migration. For instance, in the same Sky News interview in 2022, he said: \"I would never demonise people coming to this country in pursuit of a better life. And I understand and appreciate our obligation to refugees.\" At the time, this wasn't a surprising view from a minister commonly considered to be in the centre of the Tory party. But Mr Jenrick's time as immigration minister saw him move further to the right. As he has since said himself: \"I could see the breakdown of the British state was doing immense damage. It angered me, and it motivated me to do absolutely everything to fix the problem.\" The following months saw Mr Jenrick significantly harden his position, to the point that he resigned over the government's approach. But the bigger contradiction Reform is trying to get at by picking this fight is around the Tory record. It is a fact that the use of hotels to house asylum seekers peaked at just over 55,000 while the Conservatives were in power. Similarly, it's a fact that legal migration reached record levels on the Tories watch. Mr Jenrick can fairly claim that - in the final year of his front-bench career - he did go further than most to try to change this. But he can't change the data from the time. Reform knows that - just as it also knows the Tory record on migration is one of the big pull factors bringing their voters over to them. Read more from Sky News:US-mexico border wall to be painted black, US saysBBC should be 'put beyond reach of politicians'"
    },
    {
        "title": "Former priest Chris Brain found guilty of 17 counts of indecent assault",
        "description": "A former Church of England priest who ran a rave-inspired \"cult\" group has been found guilty of indecently assaulting nine women. ",
        "url": "https://news.sky.com/story/former-priest-chris-brain-found-guilty-of-17-counts-of-indecent-assault-13415276",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-christopher-brain-sheffield_6954281.jpg?20250701095655",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-20 15:07:00",
        "Headline": "No subtitle found",
        "Content": "A former Church of England priest who ran a rave-inspired \"cult\" group has been found guilty of indecently assaulting nine women.  Chris Brain, 68, led the Nine O'Clock Service (NOS) in the 1980s and 1990s in Sheffield, with services aimed at 18 to 30-year-olds featuring multimedia, scantily-dressed women, and a live band. The movement was initially seen by the church as a \"ground-breaking\" success story and attracted between 500 to 600 people to worship at 9pm on Sundays after NOS moved from St Thomas Church to The Rotunda in Ponds Forge. Brain, from Wilmslow, Cheshire, denied committing sexual offences against 13 women, including one count of rape and 36 counts of indecent assault between 1981 and 1995. Today he was found guilty of 17 counts of indecent assault relating to nine women and acquitted of 15 similar charges. The jury is still deliberating on five outstanding counts, including the rape charge. Inner London Crown Court heard Brain's ordination was \"fast-tracked\", including claims he cheated in his exams, and he wore the same cassock as Robert De Niro in The Mission for the ceremony in 1991. \n                  Chris Brain: Leader of 'cult-like' Nine O'Clock Service denies brainwashing members to satisfy sexual desires\n                 \n                  Archbishop of Canterbury job advert goes live – and for the first time they could be a woman\n                 \n                  Justin Welby was 'overwhelmed' by number of child abuse allegations - as he admits he 'got it wrong'\n                 But prosecutors said NOS became a \"closed and controlled group\", in which Brain \"dominated and abused his position\" to sexually assault a \"staggering number of women from his congregation\". NOS collapsed in 1994 after women made allegations about Brain, who resigned from his holy orders in 1995 amid \"enormous media interest\", the court heard. 'Allegations destroyed my life'  Giving evidence, Brain admitted receiving back massages from some NOS members, which he said started as a way to relieve tension headaches, but would \"very rarely\" lead to sexual activity. \"With some of my closest friends, it would be kissing sometimes, occasionally massaging, stroking. Anything more than that, we would back off,\" he said. He told the jury any touching was done with \"100%\" consent, and he would've \"instantly stopped\" if anyone had indicated they were uncomfortable. Brain said the allegations had \"basically destroyed my life\" and suggested the women had \"to exaggerate these things to make it either sexual or controlling\" in order \"to make a criminal case\". Brain said he became involved in the dotcom boom in the late 1990s before setting up a business helping smaller firms transition into big companies, which folded once he was charged."
    },
    {
        "title": "Police officer describes moment he was shot with crossbow - as attacker jailed",
        "description": "A police officer has described the moment he was shot with a crossbow - as his \"extremely dangerous\" attacker was sentenced to nine years in jail.",
        "url": "https://news.sky.com/story/police-officer-describes-moment-he-was-shot-with-crossbow-as-attacker-jailed-13414581",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jason-king-crossbow_6995303.jpg?20250819162255",
        "type": "UK",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-08-20 12:50:00",
        "Headline": "Jason King, 54, shot PC Curtis Foster with a crossbow after stabbing a neighbour following an altercation in Downley, Wycombe, in May last year.",
        "Content": "By Miriam Kuepper, news reporter   A police officer has described the moment he was shot with a crossbow - as his \"extremely dangerous\" attacker was sentenced to nine years in jail. Jason King, 54, fired the weapon at PC Curtis Foster after stabbing a neighbour, a man in his 60s, following an altercation in Downley, Wycombe, on 10 May last year. PC Foster was struck in the leg by a crossbow bolt while King chased after him and his fellow unarmed officer. \"I knew something had impacted me, but my adrenaline was so high that the pain wasn't really there,\" PC Foster said. \"I first realised I was bleeding quite a lot when I could feel it running down my leg, and then I touched my leg with above my trousers, and my whole hand was red where it'd gone through my trousers already.\" PC Foster and his colleague cleared the area of civilians, while armed officers chased King to a local park. King also fired the crossbow at a police dog but missed. He was ordered to drop the weapon, but instead started running with it in hand towards the exit of the park to where PC Foster had escaped. An armed officer fired one shot at King, striking him in the abdomen, to stop him. 'Covered in my blood' As King was apprehended, paramedics and his fellow officers treated the seriously injured PC Foster. \"There was a lot of blood. My two colleagues that turned up initially on scene were covered in my blood - that's how much blood I'd lost,\" PC Foster said. \"When we got to the hospital, the doctor had a feel of it and said that I was really lucky it didn't strike an artery. It was a couple of centimetres away from hitting an artery in the back of my leg.\" PC Foster has since made a full recovery, as did the neighbour King stabbed. King himself was taken to hospital under police supervision with potentially life-changing injuries and was discharged 10 days later, when he was arrested and taken into police custody. On Wednesday, King was jailed at Aylesbury Crown Court for nine years with a further three years on extended licence having previously pleaded guilty to unlawful wounding, having an article with a blade or point, having an offensive weapon, wounding with intent and affray regarding the incident. \"Jason King will now serve a substantial prison sentence as a result of his violent actions on 10 May 2024. The community and residents of Downley are much safer for it,\" said senior investigating officer Detective Inspector Nick Hind. He added: \"The courage of our officers in dealing with this incident was second to none.\" Read more from Sky News:Councillor jailed for sexually abusing girlUK set for hottest summer on record 'Significant threat to police' DI Hind explained that the impact the incident had in the local community couldn't be underestimated as King was \"an extremely dangerous man, who posed a significant threat to police, other emergency services and members of the community\". A mandatory referral to the Independent Office for Police Conduct was made after the police shooting of King. The IOPC, which concluded its investigation in November, commended \"everybody involved in this incident\", according to DI Hind."
    },
    {
        "title": "'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls",
        "description": "The shadow minister for safeguarding has written to the government demanding action on child sexual exploitation after being \"alarmed\" by a Sky News story revealing plans to exclude it from their Violence Against Women and Girls strategy.",
        "url": "https://news.sky.com/story/alarm-over-exclusion-of-child-sexual-exploitation-from-strategy-to-tackle-violence-against-women-and-girls-13415353",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-malone-vawg_6990586.png?20250814124037",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-08-20 17:43:00",
        "Headline": "Alicia Kearns tells safeguarding minister, Jess Phillips, that \"survivors of sexual violence have been left bereft\" by the decision to omit child sexual abuse and exploitation from its upcoming strategy to tackle Violence Against Women and Girls (VAWG).",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n The shadow minister for safeguarding has written to the government demanding action on child sexual exploitation after being \"alarmed\" by a Sky News story revealing plans to exclude it from their Violence Against Women and Girls strategy. Last week, Sky News reported on a leaked Home Office document which stated that child sexual abuse and exploitation was not \"explicitly within the scope\" of their upcoming strategy to tackle Violence Against Women and Girls (VAWG). Shadow minister for safeguarding, Alicia Kearns, has written to safeguarding minister, Jess Phillips, saying that \"survivors of sexual violence have been left bereft\" by the decision. The government insists that its strategy, due to be published next month, will include action to tackle child sexual abuse, but that a distinctive programme will also be announced to address the specifics of the crime. In her letter \"demanding answers,\" Ms Kearns urged the minister to \"be transparent and explain why sexual violence has been purposefully excluded\" and to \"set out when a separate strategy on tackling sexual violence will be published\". Poppy Eyre was sexually abused and raped by her grandfather when she was four. Her grandfather was later convicted and died in prison. She told Sky News on Friday: \"VAWG is violence against women and girls. If you take child sexual abuse out of it, where are the girls?\"  The Centre of Expertise on Child Sexual Abuse, which is funded by the Home Office, estimates that 500,000 children will experience some form of sexual abuse every year in England and Wales, Rape Crisis told Sky News ministers have failed victims of abuse if they don't consider the \"scale of child sexual abuse and exploitation\" within their strategy. The campaign group said, \"for any strategy to be effective,\" that the plans \"must include all forms of gender-based violence against all women and girls\", suggesting there is a \"danger\" in having a separate plan for child sexual abuse. Read more from Sky News:Councillor jailed for sexually abusing girlUK set for hottest summer on recordEx-priest guilty of sexual assault A Home Office spokesperson said the department was \"working tirelessly to tackle the scourges of violence against women and girls and child sexual abuse\". In a statement, the spokeperson said: \"These issues are complex and run deep within the fabric of society. \"The government wholly recognises that they overlap. \"But it also recognises that concerted action is needed to tackle child sexual abuse, which is why we have set out a range of actions... and why we are launching a national inquiry into grooming gangs.\""
    },
    {
        "title": "Observer editor-in-chief James Harding says BBC should be 'put beyond reach of politicians'",
        "description": "The Observer's editor-in-chief has called for the BBC to be \"put beyond the reach of politicians\" - and has compared the fight for survival within television to the zombie fungus in The Last Of Us.",
        "url": "https://news.sky.com/story/observer-editor-in-chief-james-harding-says-bbc-should-be-put-beyond-reach-of-politicians-13415300",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bbc-workplace-culture_6900033.jpg?20250428173222",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-20 18:00:00",
        "Headline": "Editor-in-chief of The Observer, James Harding, a former head of the BBC's news and current affairs programming, says establishing the corporation's independence is critical \"if we want to build confidence in shared facts and respect for the truth\".",
        "Content": "\n          Arts and entertainment correspondent\n        The Observer's editor-in-chief has called for the BBC to be \"put beyond the reach of politicians\" - and has compared the fight for survival within television to the zombie fungus in The Last Of Us. Speaking to Sky News about his James MacTaggart Memorial Lecture at the Edinburgh TV Festival on Wednesday, James Harding said it \"is not the golden age of TV, it's more like The Last Of Us… just trying to stay alive as the fungus of new things eats through all of us\". The co-founder of Tortoise Media - which bought The Observer from the Scott Trust and Guardian Media Group in December - said he believes establishing the independence of the BBC is critical \"if we want to build confidence in shared facts and respect for the truth\". \"At the moment politicians choose the chairman, they choose the licence fee, they have enormous influence over it,\" he said. \"Let's face it, there's a suspicion that there's a certain worldview attached to the BBC. Let's make sure that it's obvious to people that actually different points of view are really welcome.\" Mr Harding, who ran the BBC's news and current affairs programming from 2013 up until the beginning of 2018, said the government must consider separating itself from the institution.  He explained: \"When the government established the independence of the Bank of England in 1997, it put confidence in the central institution of the economy ahead of politics; the government today can and should do the same for the shared institution in our society by giving real independence to the BBC.\" The BBC has been criticised for a number of incidents in recent months, including breaching its own accuracy editorial guidelines and livestreaming the controversial Bob Vylan Glastonbury set, where there were chants of: \"Death to the IDF [Israel Defence Forces]\". Following the incident, Culture Secretary Lisa Nandy said ministers expected \"accountability at the highest levels\" for the BBC's decision to screen the performance. In his lecture, Mr Harding said the BBC is \"not institutionally antisemitic\" and that: \"Whatever your view of the hate speech versus freedom of speech issues, an overbearing government minister doesn't help anyone. \"The hiring and firing of the editor-in-chief of the country's leading newsroom and cultural organisation should not be the job of a politician. It's chilling.\" Ahead of the BBC charter renewal in 2027, he said the corporation's \"survival is at stake\". He argued that the BBC chair and board of directors should be \"chosen, not by the prime minister, but by the board itself and then, like other such organisations, with the approval of Ofcom. \"The charter should be open-ended. And the licence fee - or any future funding arrangement - should not be decided behind closed doors by the culture secretary and the chancellor, but, as in Germany, set transparently and rationally by an independent commission that impartially advises government and is scrutinised by parliament.\" He also said the BBC should lead the way in striking deals with generative AI companies by taking advantage of the \"meaningful pricing of its reliable, ceaselessly renewed library of content.  Read more on Sky News:BBC and C4 'should merge to survive'Rock star dropped over Gaza commentsTake That stars working on new song \"That would help set the terms for other UK news and media companies that don't get a hearing from the new generation of tech giants,\" he said. Mr Harding suggested that the BBC should look to work with AI developers to provide a \"BBC GPT\" that could enable the public to utilise AI \"without handing over every last detail of what's on their minds to US tech corporations that have proved obstinately unaccountable in the UK.\" He said it's \"about more than the BBC, it's a national investment in our future that will come back to reap multi-platform rewards that an investment in no other UK organisation can.\" Edinburgh TV Festival runs from 19 - 22 August."
    },
    {
        "title": "'Ice cream seller stabbed eight times' as police arrest two in Wembley",
        "description": "Two people have been arrested in north-west London after a local ice cream seller was reportedly stabbed eight times and died.",
        "url": "https://news.sky.com/story/ice-cream-seller-stabbed-eight-times-as-police-arrest-two-in-wembley-13415287",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-shazad-khan-wembley_6996458.jpg?20250820201051",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-20 15:12:00",
        "Headline": "A 41-year-old man was found with stab wounds and died at the scene in Monks Park, Wembley, shortly after 6pm on Tuesday.",
        "Content": "Two people have been arrested in north-west London after a local ice cream seller was reportedly stabbed eight times and died. Metropolitan Police said they were called to a stabbing in Monks Park, Wembley, shortly after 6pm on Tuesday. Shazad Khan, 41, was found with stab wounds and died at the scene. His family have been informed. Police arrested a 26-year-old man on suspicion of murder early Wednesday, and a 31-year-old woman was arrested for conspiracy to murder at the scene. Both remain in custody, police said. Local resident Asim Mahmood Butt, 39, said he was a childhood friend of the victim, adding that the man was a \"famous ice cream guy\" in the area. Mr Butt said the victim started selling ice cream \"about a year ago\". \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 \n                  Virgin Atlantic flight attendant removed from plane after turning up four times over alcohol limit, court told\n                 \n                  The Turkish gang war behind the shooting of a nine-year-old girl\n                 The ice cream van, which was known locally for featuring a large teddy bear, had been parked on the road at the time of the stabbing, according to Mr Butt. A witness, who does not want to be named, said the ice cream van was towed away from the scene in the early hours of Wednesday. Read more from Sky News:Former priest found guilty of indecent assaultHurricane Erin makes for uncertain forecast A blue forensics tent and several Met Police officers were later seen inside a police cordon in Monks Park, with police saying residents can expect an increased number of officers in the area as the investigation continues. Detective Chief Inspector Paul Waller said: \"Our thoughts remain with the victim's family and friends at this hugely difficult time.\" Police urged anyone with information to get in touch, asking residents in the area to look at any doorbell or camera footage around Monks Parks for anything they feel would assist police."
    },
    {
        "title": "Israel begins first stages of Gaza City takeover operation - as UK condemns settlement plan",
        "description": "Israel has said it has begun the first stages of its takeover of Gaza City - as the UK condemned the approval of plans for a new West Bank settlement.",
        "url": "https://news.sky.com/story/israel-begins-first-stages-of-gaza-city-takeover-as-uk-condemns-approval-of-west-bank-settlement-plan-13415376",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-city-israel_6996533.jpg?20250820234704",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-20 18:54:00",
        "Headline": "An Israeli military spokesperson said troops currently hold the outskirts of the city. It comes after tens of thousands of reservists were called up to help seize Gaza's biggest urban centre.",
        "Content": "Israel has said it has begun the first stages of its takeover of Gaza City - as the UK condemned the approval of plans for a new West Bank settlement. Brigadier General Effie Defrin, Israel's military spokesperson, said on Wednesday that \"IDF forces are holding the outskirts of Gaza City\" after preliminary operations to take the entire area. An estimated 60,000 reserve soldiers have also been called up to help seize Gaza's biggest urban centre, but will not report for duty until September, according to a military official. Israeli troops are already operating in the Zeitoun neighbourhood of Gaza City, and the Jabaliya refugee camp in northern Gaza. Prime Minister Benjamin Netanyahu's war cabinet approved the plans last month, which include an eventual full security takeover of all of Gaza, despite growing international criticism that it will likely lead to the displacement of many more Palestinians. He is said to have sped up the timeline for taking control of Hamas strongholds after both sides clashed near Khan Younis, south of Gaza City, on Wednesday. Israel claims it will help any civilians evacuate before any assault begins. Ceasefire proposal being considered Israeli officials said they are also considering a new ceasefire proposal put forward by Qatar and Egypt. The deal, which involves a 60-day ceasefire and the release of some of the remaining Israeli hostages and Palestinian prisoners, has already been accepted by Hamas. Thousands of Israeli civilians have called for the government to accept a ceasefire and reverse its decision to take over Gaza City, but Mr Netanyahu is thought to be under pressure from some far-right members of his coalition to reject the deal and continue to pursue the annexation of the territory. West Bank settlement plan approved One of those is Bezalel Smotrich, Israel's finance minister, who announced on Wednesday that a controversial plan for a settlement project in the occupied West Bank had been approved after they received the final go-ahead from Israel's higher planning committee. Mr Smotrich, an ultranationalist in the ruling right-wing coalition, said in a statement that the government was delivering with the settlement what it had promised for years: \"The Palestinian state is being erased from the table, not with slogans but with actions.\" He said last week that the settlement would \"finally bury the idea of a Palestinian state, because there is nothing to recognise and no one to recognise\". 'A stake through the heart of two-state solution' British Foreign Secretary David Lammy condemned the plan, saying it \"would divide a Palestinian state in two\". In a post on the X social media platform, Mr Lammy called the settlement in the West Bank \"a flagrant breach of international law\", which \"critically undermines the two-state solution\", and urged the Israeli government to reverse the decision. The UN also condemned the decision, with spokesperson Stephane Dujarric saying that it \"will drive a stake through the heart of the two-state solution\". Read more:Inside the conflict forcing Palestinians from their homesThe city where what was law now has no place in reality Where is the settlement? The settlement is set to be built in E1, an open tract of land east of Jerusalem, and includes around 3,500 apartments to expand the existing settlement of Maale Adumim. E1 has been eyed for Israeli development for more than two decades, but plans were halted due to pressure from the US during previous administrations. A two-state solution to the decades-old Israeli-Palestinian conflict would see a Palestinian state in East Jerusalem, the West Bank and Gaza existing side by side with Israel. Today, an estimated 700,000 Israeli settlers live in the West Bank and East Jerusalem. There is also a growing movement of Israelis wanting to build settlements in Gaza. Settlers make up around 5% of Israel's population and 15% of the West Bank's population, according to data from Peace Now. Settlements are illegal under international law and have been condemned by the UN. They are, however, authorised by the Israeli government."
    },
    {
        "title": "Europe tried to starve Putin's war machine with sanctions - but something else has happened",
        "description": "Why is Donald Trump threatening to impose sanctions, or tariffs, or maybe both, on India in relation to the Ukraine war?",
        "url": "https://news.sky.com/story/europes-sanctions-on-russia-were-to-starve-putins-funds-instead-something-else-has-happened-13415218",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-conway-oil_6996304.jpg?20250820160043",
        "type": "World",
        "Author": "Ed Conway",
        "Date Published": "2025-08-20 12:42:00",
        "Headline": "Sanctions imposed so far have made a marginal difference in clamping down on Russia and limiting its revenues. But Donald Trump's targeting of India, one of Moscow's biggest customers, may change things.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Why is Donald Trump threatening to impose sanctions, or tariffs, or maybe both, on India in relation to the Ukraine war? The short answer is that India has established itself as one of the single most important customers for one of the single most important products made in Russia: crude oil. You only have to glance at the data on Russian fossil fuel exports to see what I mean. Nor is it just India. China has raised its imports of Russian fossil fuels by 44% since the imposition of sanctions. Back before the invasion of Ukraine in 2022, by far and away the biggest recipient of Russian energy exports was Europe. Then Europe imposed sanctions on various different Russian products, most notably oil. The idea was to starve Vladimir Putin of the revenues he is using to fund the Russian war machine. Instead, something else happened: those Russian tankers which previously delivered oil to Europe instead started sending it to Indian oil refineries. The Middle Eastern oil tankers that had previously served those Russian refineries began sending their oil to Europe. Nothing, fundamentally, really changed. And while Europeans are no longer taking direct shipments of Russian oil, they are taking plenty of shipments of oil products - from diesel and petrol to kerosene - made from Russian oil in Indian refineries. In the face of this, Europe and its G7 allies have subsequently begun to try to prevent those tankers from taking Russian oil at all. A price cap was imposed on legitimate shipping companies, limiting the amount of revenue Russia could derive from its exports. That, in turn, created another step-shift: Russia began to build up its own \"shadow fleet\" of tankers which it used to carry on sending oil to India and China. And so, in the latest episode of sanctions \"whack-a-mole\", the G7 has begun to implement a separate round of bans on that shadow fleet. Now, the point is not that any of these measures were pointless. Each has made a marginal difference in clamping down on Russia and limiting its revenues. But the whole exercise has proved far harder than expected. Read more from Sky News:Key moments revealing Putin's hold on TrumpTrump sets red line on Ukraine peace deal support All of which is why Donald Trump is now talking about raising tariffs or imposing sanctions on India. He has discussed imposing secondary sanctions on countries continuing to do business with Russia. For all that he is being painted as one of Vladimir Putin's closest allies, in reality, these are dramatic economic levers that even Joe Biden stopped short of pulling. The question is whether they do indeed get activated - and what happens next in the game of sanctions \"whack-a-mole\"."
    },
    {
        "title": "New Zealand: Family's plea to fugitive dad on the run with children for nearly four years",
        "description": "The family of a father who disappeared with his three children nearly four years ago in New Zealand have broken their silence to appeal for him to return home.",
        "url": "https://news.sky.com/story/new-zealand-familys-plea-to-fugitive-dad-on-the-run-with-children-for-nearly-four-years-13415251",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-missing-family-tom-phillips_6711046.jpg?20241009072023",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-20 13:32:00",
        "Headline": "Tom Phillips vanished into the New Zealand wilderness with his two daughters and son in 2021 - but his family hope he will see their plea for him and the children to return.",
        "Content": "The family of a father who disappeared with his three children nearly four years ago in New Zealand have broken their silence to appeal for him to return home. In December 2021, Tom Phillips vanished into the wilderness with his two daughters and son - but his family have said they still remain hopeful \"today will be the day you all come home\". Phillips, along with Jayda, now aged 12, Maverick, 10, and Ember, nine, were last believed to have been seen in a \"credible sighting\" last October hiking through a bush area near Marokopa on the country's North Island. For the first time, his family have directly appealed to Phillips in the hope that \"just maybe, he's going to see this\" and \"that we are here for him\". In an interview with New Zealand journalist Paddy Gower, his sister Rozzi Phillips said she missed being part of her brother's life, adding \"I really want to see you\" and \"you're very special to me\". She also read out a handwritten message from Phillips' mother, Julia, which came from her \"heart, just to her son\". \"Tom, I feel really sad that you thought you had to do this, not considering how much we love you and could support you,\" she said. \"It hurts every time I see photos of the children and of you and see some of your stuff that is still here, thinking what could have been if you'd not gone away.\" According to New Zealand news site, Stuff, the letter ended with a message for the three children. \"We love you so much and really miss being part of your lives,\" it read. \"Every day we wake up and hope that today will be the day you all come home.\" Read more from Sky News:Swedish church being moved three milesHurricane Erin makes for uncertain UK weather forecast  Ms Phillips said her brother is a skilled builder and would have constructed a shelter. Police believe his actions could be linked to a custody battle. There have been numerous reported sightings since December 2021. The most recent last October was said to be from a distance when the group were seen wearing camouflage gear and carrying large camping backpacks."
    },
    {
        "title": "Labubu maker's profits soar by nearly 400% in six months as ugly-cute toys become global sensation",
        "description": "The makers of Labubu dolls - popular with celebrities including Rihanna, David Beckham and Paris Hilton - reported a near 400% increase in profits in the first half of this year after demand for the ugly-cute toys soared.",
        "url": "https://news.sky.com/story/labubu-makers-profits-soar-by-nearly-400-in-six-months-as-ugly-cute-toys-become-global-sensation-13414995",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-labubu-figures_6995968.jpg?20250820090200",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-20 06:10:00",
        "Headline": "Pop Mart, the Chinese company which makes the toothy-grinned toys, is reported to be worth more than industry giants Mattel, Sanrio and Hasbro combined.",
        "Content": " The makers of Labubu dolls - popular with celebrities including Rihanna, David Beckham and Paris Hilton - reported a near 400% increase in profits in the first half of this year after demand for the ugly-cute toys soared. The dolls' makers, Pop Mart, has released its half-year results as shares in the company have risen more than 230% since the beginning of 2025 - reportedly making the Chinese company more valuable than Barbie-maker Mattel, Hello Kitty parent company Sanrio and Transformers makers Hasbro combined. The Chinese toy company's sales tripled to 13.9bn yuan (£1.4bn), while net profit soared almost 400% to 4.6bn yuan (£474m) during the first six months of the year, according to the Financial Times. Around 40% of the sales are said to have come from outside China. Labubu, a toothy-grinned member of \"The Monsters\" series of toys designed by illustrator Kasing Lung, has become a favourite of celebrities including David Beckham, Rihanna and Paris Hilton. They have also proved difficult to get hold of for consumers after selling out at various places across the world. Pop Mart boss Wang Ning said on Wednesday that his toy company was on track to meet its targeted revenue goal of 20bn yuan (£2.06bn) in 2025, and that \"30 billion (£3.10bn) this year should also be quite easy\". The 38-year-old chief executive's net worth has skyrocketed since 2024, according to Forbes - from $1.8bn (£1.3bn) to $26.3bn (£19.5bn). He was named China's 10th richest person in June. Read more: How did the toys get so popular? And his company is hoping to grow further, with executives saying on Wednesday that expansion in emerging markets in the Middle East, Central Europe and Central and South America was being explored. \"I think for overseas markets we're still very positive, and we also believe there's still very broad space for growth,\" Mr Wang said, adding that sales from North America and Asia Pacific this year would together equal China sales in 2024. In the United States, where Pop Mart currently has about 40 stores, Mr Wang said the company will begin a phase of \"relatively rapid store openings\" over the next year or two, with 10 more US shops expected to open by the end of this year. The company has stores in Manchester and London in the UK - as well as having pop-ups in Harrods and Hamleys. The toys can also be bought online and in vending machines called \"Robo Shops\" in other parts of the UK. Pop Mart's primary business is producing and selling collectible toys, many of them developed with artists and sold in \"blind boxes\". The packages, which tend to cost around £14 in the UK, mean consumers don't know exactly which iteration of the toy is inside. This has helped drive repeat purchases, especially from collectors who want to own complete sets of each range of toys. A collector reportedly paid 1.2m yuan (£124,000) for a human-sized limited edition Labubu at an auction in Beijing in June. Until now they have been popular as a charm that can be fastened to handbags, Pop Mart says it will this week launch a mini version of Labubu that can be attached to phones. Read more from Sky News:Choke warning over fake LabubusSurprise rise in inflation to highest in a yearEnergy bills expected to rise from October Monster profits Pop Mart said on Tuesday \"The Monsters\" brought in 4.81bn yuan (£496m) in the first half of this year - accounting for 34.7% of total revenue. Four other Pop Mart toy series' earned more than 1bn yuan (£1m) during the period, including \"Molly\" and \"Crybaby\", the company said. \"We expect more restocking of existing series and launch of new editions to drive earnings expansion in the second half.That said, shares likely remain overpriced as investors are overlooking the high business risk in the long run, in ourview,\" said Jeff Zhang, an analyst at US financial services firm Morningstar.  Pop Mart was reported to have a market capital - a way of measuring a company's total value - of around £25bn earlier this year. The figure was more than the combined value of toy-making giants Sanrio (£7.5bn), Hasbro (£6.4bn), and Mattel (£4bn), according to the markets news site Sherwood News. Next in Pop Mart's sights is a Disney-esque empire with executives saying the firm is optimistic about opportunities forPop Mart characters to star in animated films and theme park attractions, though these are not expected to contribute a large amount of direct revenue in the short term. Look out for fake Labubus The surge in demand for Labubus led UK council bosses to warn people about the dangers of buying fake versions of the dolls earlier this year. Trading Standards warned that without proper safety checks, the counterfeit toys may contain choking hazards, toxic materials, or faulty components that put children at serious risk. The organisation has seized thousands of unsafe counterfeit Labubu dolls in recent weeks - with over 2,000 confiscated from 13 retailers in North Tyneside in just one month, the Chartered Trading Standards Institute (CTSI) said."
    },
    {
        "title": "Fighters will undergo screening to determine sex before women's World Boxing Championships",
        "description": "Boxers who want to compete in the women's division at next month's&#160;World Boxing Championships in Liverpool will need to undergo tests to determine their sex.",
        "url": "https://news.sky.com/story/fighters-will-undergo-screening-to-determine-sex-before-womens-world-boxing-championships-13415408",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-imane-khelif-boxer_6931512.jpg?20250530182242",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-20 20:49:00",
        "Headline": "All boxers, including Algeria's Imane Khelif, who won Olympic gold last summer amid scrutiny over a disputed failed gender eligibility test conducted by a different body,  will be unable to compete without a test which reveals their biological sex.",
        "Content": "Boxers who want to compete in the women's division at next month's World Boxing Championships in Liverpool will need to undergo tests to determine their sex. The international body, World Boxing, had already announced its plan to require competitors to undergo a polymerase chain reaction test or an equivalent genetic screening test to determine their sex at birth. The rules will be implemented ahead of the World Boxing Championships in Liverpool in early September, the organisation announced on Wednesday. The organisation's tests identify the presence or absence of Y chromosome genetic material to indicate biological sex. All boxers, including Algeria's Imane Khelif, 26, who won Olympic welterweight gold in Paris 2024 in the female category, will be unable to compete in their events until they undergo the test. Khelif's disputed failed gender eligibility test - conducted by a different boxing body - was a major issue at the Olympics before she won gold. She has repeatedly said she was born a woman, and she has competed at all levels of women's amateur boxing for nearly a decade. \"World Boxing respects the dignity of all individuals and is keen to ensure it is as inclusive as possible,\" World Boxing president Boris Van Der Vorst said. \"Yet in a combat sport like boxing, we have a duty of care to deliver safety and competitiveness fairness, which are the key principles that have guided the development and creation of this policy.\" Khelif declined to enter a World Boxing tournament in the Netherlands in June, shortly after the governing body initially announced its plans to introduce sex testing. The debate over the boxers has seen renewed discussion over athletes who may have differences in sexual development (DSD), which covers a group of conditions involving genes, hormones and reproductive organs developing differently than expected. World Boxing said athletes with DSD in which male androgenisation occurs will be eligible to compete only in the men's category. Read more from Sky News:Analysis: Gender boxing rowWorld Boxing apologises to KhelifUK court rules on definition of a woman But the governing body also plans to offer extra analysis and evaluation for athletes with Y chromosome genetic material who wish to compete in the women's categories, as well as an appeals process. National federations are responsible for conducting the tests and submitting the results, World Boxing said. Chromosome testing was previously common in Olympic sports but was largely abandoned in the 1990s because of numerous ambiguities. Many sports switched to hormone testing, but it requires governing bodies to make difficult decisions on the eligibility of women with naturally high testosterone levels. Earlier this year, World Athletics - the governing body for track and field - became the first Olympic sport to reintroduce chromosome testing. Meanwhile, ahead of the 2028 Los Angeles Olympics, US President Donald Trump said there are only two sexes - male and female - while calling on sports to ban transgender women from women's events."
    },
    {
        "title": "Investigation launched into 'horrifying' death of French internet streamer",
        "description": "Several people have been interviewed and equipment seized by police investigating the death of an internet streamer who was known for taking part in extreme online challenges.",
        "url": "https://news.sky.com/story/investigation-launched-into-horrifying-death-of-french-internet-streamer-13414968",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jean-pormanove-raphael-graven_6995865.png?20250820044406",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-20 03:13:00",
        "Headline": "Raphael Graven, who went by Jean Pormanove online, had more than a million followers across social media - but was particularly popular on the Twitch-like streaming platform Kick.",
        "Content": "Several people have been interviewed and equipment seized by police investigating the death of an internet streamer who was known for taking part in extreme online challenges. Raphael Graven, who went by Jean Pormanove, was found dead in Contes, near Nice, on Sunday night. A post-mortem is taking place. Viewers of the Frenchman's last live stream on the Twitch-like platform Kick had reportedly become concerned about him lying lifeless on a mattress, unresponsive to their comments. \"Several interviews with people present at the time of the death have been conducted, but at this stage they have not provided any guidance as to the causes of the death,\" said Nice's public prosecutor Damien Martinelli. \"Numerous seizures of equipment and videos were made in order to clarify the events that occurred prior to the death and which may have contributed to it,\" he added. According to France24, prosecutors said the 46-year-old had been in an accommodation rented for the purpose of broadcasting live internet streams. The broadcast had reportedly been running for 10 days. French newspaper Le Monde said Graven was known for participating in videos in which he suffered apparent violence and humiliation, alongside two colleagues. \n                  Andrew and Dawn Searle: Actor son of 'murder-suicide' victim urges late mother's friends not to attend stepfather's funeral\n                 \n                  Thousands evacuated as deadly wildfires sweep Europe\n                 \n                  'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant\n                 France's digital technology minister, Clara Chappaz, said he had been \"humiliated and abused for months\" and confirmed that \"a judicial investigation is underway\". \"Holding online platforms responsible for the dissemination of illegal content is not an option: it is the law. \"This type of failure can lead to the worst and has no place in France, Europe, or anywhere else.\" Streaming platform Kick has been making waves since it was launched in early 2023.\n Built as a competitor to the Amazon-owned platform Twitch, it hosts livestreaming for everyone from gamers to influencers to gamblers. \n Although Kick's ownership isn't fully public, it is backed by some of the founders of the online casino Stake.com and streamers can currently make more on Kick than on other platforms.\n While Twitch lets creators keep 50% of their profit, and YouTube lets creators keep 70%, Kick lets creators keep 95% of their earnings, according to Internet Matters. \n Those potential earnings have drawn a number of streamers - and their fans - over to the newer platform. \n Kick currently boasts around 57 million users worldwide, according to data reported by Digiday in April. \n Although its community guidelines have been recently updated, Kick is seen as having a more relaxed approach to moderation.\n This approach has led to some influencers who are banned on other platforms making their way over to Kick.\n Sarah El Hairy, France's high commissioner for children, described his death as \"horrifying\". \"Platforms have an immense responsibility to regulate online content so that our children are not exposed to violent content,\" she said. \"I urge parents to be extremely vigilant.\" Read more from Sky News:Trump sets red line on UkraineInside caves at heart of terror network Graven had more than one million followers across social media. He was particularly popular on Kick, which was founded in 2022 as a competitor to Amazon-owned Twitch. It's known for having looser moderation and offers creators a higher share of revenue. A spokesperson for Kick told Sky News: \"We are deeply saddened by the loss of Jean Pormanove and extend our condolences to his family, friends, and community. \"We are urgently reviewing the circumstances and engaging with relevant stakeholders to investigate the situation. \"Kick's community guidelines are designed to protect creators, and we remain committed to upholding these standards across our platform.\""
    },
    {
        "title": "Andrew and Dawn Searle: Actor son of 'murder-suicide' victim urges late mother's friends not to attend stepfather's funeral",
        "description": "An actor and musician whose mother was the victim of a suspected murder-suicide in France has urged her friends not to attend his stepfather's funeral.",
        "url": "https://news.sky.com/story/andrew-and-dawn-searle-actor-son-of-murder-suicide-victim-urges-late-mothers-friends-not-to-attend-stepfathers-funeral-13415023",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-searle-dawn-searle_6822825.jpg?20250820093005",
        "type": "World",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-20 07:40:00",
        "Headline": "The bodies of British couple Andrew and Dawn Searle were discovered on 6 February at their home in the hamlet of Les Pesquies.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n An actor and musician whose mother was the victim of a suspected murder-suicide in France has urged her friends not to attend his stepfather's funeral. Callum Kerr, who starred in Hollyoaks and Netflix's Virgin River, said it would be \"inappropriate\" for the memory of his mum to be associated with a service honouring the man who \"may have been responsible for her death\". The bodies of British couple Andrew and Dawn Searle were discovered on 6 February at their home in the hamlet of Les Pesquies. Mrs Searle's body was found outside the property with a significant head injury, while Mr Searle's body was discovered inside. Prosecutors later ruled the incident to be murder-suicide due to a lack of evidence that someone else was involved. In an Instagram post on behalf of himself and his sister, Amanda Kerr, Mr Kerr said: \"In the absence of any evidence suggesting third-party involvement in the tragic death of our mother, Dawn Kerr, the prevailing hypothesis remains that of a murder-suicide.\" Mr Kerr, a country music singer who is also set to appear in the second season of Netflix's One Piece, said his mother was \"killed by multiple blows to the head\", while \"no defensive wounds\" were found on Mr Searle. \n                  Investigation launched into 'horrifying' death of French internet streamer\n                 \n                  Thousands evacuated as deadly wildfires sweep Europe\n                 \n                  'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant\n                 Mr Kerr said: \"While the official investigation is still ongoing, we cannot ignore the circumstances as they stand. \"For this reason, we must respectfully but firmly request that our mother not be included in any way in the funeral arrangements being made for Andrew. \"Please do not share photographs of them together. Please do not attend Andrew's service if you were a friend of our mother. \"It would be inappropriate for her memory to be associated with a service honouring the man who, based on all available evidence, may have been responsible for her death. \"We ask for understanding, privacy and respect as we continue to grieve and seek justice for our mum.\" Read more from Sky News:Probe launched into 'horrifying' death of online streamerInside ISIS resurgence - and the former Briton heading it Mr and Mrs Searle, who previously lived in Musselburgh in East Lothian, had been living in the Aveyron region for five years. They lived in Les Pesquies and were married in 2023 in the nearby town of Villefranche-de-Rouergue, with Mr Kerr walking his mum down the aisle. Neighbours described them as a happy couple, who had fully integrated into rural French life and held an annual party for villagers. Jean-Sebastien Orcibal, the mayor of Villefranche-de-Rouergue who conducted the couple's wedding, told Sky News they were \"very happy, very friendly and didn't seem to have any problems\". Mrs Searle, 56, grew up in Eyemouth in the Scottish Borders, while Mr Searle, 62, was originally from England. According to his LinkedIn page, Mr Searle retired in 2015 after previously working in financial crime prevention at companies including Standard Life and Barclays. Following the deaths, investigators were said to be following several lines of inquiry - including whether the couple were killed during a burglary or potential links to Mr Searle's previous work in the UK."
    },
    {
        "title": "Israel calls up thousands of reservists as it prepares to launch new Gaza offensive",
        "description": "Israel will call up 60,000 reservists as it prepares to launch an expanded military operation in Gaza City.",
        "url": "https://news.sky.com/story/israel-calls-up-thousands-of-reservists-as-it-prepares-to-launch-new-gaza-offensive-13415127",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza_6996102.jpg?20250820120848",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-20 09:48:00",
        "Headline": "The military said the country's defence minister has approved plans to begin a new phase of operations in some of the most densely populated areas of the Gaza Strip.",
        "Content": "Israel will call up 60,000 reservists as it prepares to launch an expanded military operation in Gaza City. The military said the country's defence minister Israel Katz has approved plans to begin a new phase of operations in some of the most densely populated areas of the Gaza Strip. Israeli forces will operate in areas of Gaza City where they have not yet operated and where it believes Hamas is still active, a military official said.  The city is the main military and governing stronghold of Hamas and Israeli troops will target the group's vast underground network, the official added. Although Israel has targeted and killed much of Hamas' senior leadership, parts of the group are actively regrouping and carrying out attacks, including launching rockets towards Israel, the official said. It remains unclear when the operation will begin, but it could be a matter of days. The official said 60,000 reservists will be called up in the coming month and the service of an additional 20,000 reservists currently serving will be lengthened. Israeli Prime Minister Benjamin Netanyahu has said the objectives of the war are to secure the release of the remaining hostages and destroy Hamas.  International criticism of Israel increased after the planned offensive was announced earlier this month amid fears of another mass displacement of Palestinians. The families of the hostages and former army and intelligence chiefs oppose an expanded operation in Gaza City, with most of the families of hostages wanting an immediate ceasefire. They worry an expanded assault could threaten prospects of bringing the 50 remaining hostages home. Israel believes 20 of those are still alive. Read more:Tents abandoned as Palestinians flee Israeli advanceGaza ceasefire proposal agreed by Hamas The war began when Hamas-led militants attacked Israel on 7 October 2023, killing some 1,200 people and abducting 251. Many of the hostages have been released in ceasefires and other deals, with Hamas saying it will only free the remainder in exchange of a lasting ceasefire and Israeli withdrawal. More than 62,000 people have been killed during Israel's 22-month counteroffensive, according to Gaza's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says women and children make up around half of those killed. Earlier this week, the ministry said 154 adults had died of malnutrition-related causes since the ministry began counting such deaths in late June, and 112 children have died of malnutrition-related causes since the war began."
    },
    {
        "title": "US says entire southern border wall with Mexico to be painted black to deter migrants",
        "description": "The US is to paint the entire southern border wall with Mexico black to make the metal hotter and make it harder for migrants to climb.",
        "url": "https://news.sky.com/story/us-says-entire-southern-border-wall-with-mexico-to-be-painted-black-to-deter-migrants-13415326",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kristi-noem-new-mexico_6996392.jpg?20250820181833",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-20 16:38:00",
        "Headline": "Amid falling numbers of migrants being detained at the US-Mexico border, the US Homeland Security Secretary Kristi Noem says the border crisis \"isn't just under control - it's been obliterated\" under Donald Trump.",
        "Content": "The US is to paint the entire southern border wall with Mexico black to make the metal hotter and make it harder for migrants to climb. US Homeland Security Secretary Kristi Noem visited Santa Teresa, New Mexico, on Tuesday to announce the measure. She said the black paint idea was specifically at the request of the US President, \"who understands that in the hot temperatures down here, when something is painted black, it gets even warmer and it will make it even harder for people to climb,\" she said. \"We are going to be painting the entire southern border wall black,\" she added. Later, she picked up a roller brush to help out. She later posted on X that since Donald Trump began his second term in office \"we got to work\" to tackle the \"worst border crisis in history\". \"Today, that crisis isn't just under control - it's been obliterated. This wall is part of the difference. Too high to climb. Too narrow to squeeze through. \"And now, at the President's direction, it will be painted black - so hot to the touch that criminal illegal aliens won't even try.\" As part of Mr Trump's \"big, beautiful bill\", his signature spending and tax policy, $46bn (£33bn) has been allocated for completing the border wall. According to the US Customs and Border Protection (CBP), the length of the southern border with Mexico is approximately 1,954 miles (3,144km) and uses a range of construction materials, including an 18-30ft high steel bollard wall, metal fencing and concrete walls. Read more from Sky News:Trump's deportations explainedLA immigration raids and protestsTrump's immigration crackdown The president has made mass deportations one of his main priorities since assuming office and pledging a crackdown on people crossing the southern border. In July, illegal crossings dropped to the lowest level ever recorded, according to the CBP. Nationwide, the number of suspected migrants detained fell 90% compared with the same month in 2024, while on the southern border, the figure was down 92%. \"CBP shut down illegal crossings again this month, setting enforcement records and collecting billions in tariffs. This is what making America great and safe again looks like,\" said CBP Commissioner Rodney Scott in a statement."
    },
    {
        "title": "Surprise rise in inflation as summer travel pushes up air fares",
        "description": "Prices in the UK rose even faster than expected last month, reaching the highest level in 18 months, according to official figures.",
        "url": "https://news.sky.com/story/inflation-rises-again-in-uk-official-figures-show-13414981",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-airport-air-passenger_6996001.jpg?20250820095854",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-20 05:12:00",
        "Headline": "Train tickets could become 5.8% more expensive next year, affecting about half of rail journeys, after the Retail Prices Index (RPI) measure of inflation for July came in higher than expected. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Prices in the UK rose even faster than expected last month, reaching the highest level in 18 months, according to official figures. Inflation hit 3.8% in July, data from the Office for National Statistics (ONS) showed. The last time prices rose that fast was in January 2024. The Consumer Prices Index (CPI) rate is up from 3.6% in June and is anticipated to reach 4% by the end of the year. Economists polled by Reuters had only been expecting a 3.6% rise. More unwelcome news is contained elsewhere in the ONS's data. Train tickets \n                  Energy bills expected to rise from October - despite previous forecasts\n                 \n                  People spend less time cooking dinner as convenience food sales rise - Worldpanel data\n                 \n                  Sheer joy as kids see the sea for the first time, as cost of living's impact on school trips revealed\n                 Another metric of inflation used by the government to set rail fare rises, the Retail Prices Index (RPI), came in at 4.8%. It means train tickets could go up 5.8% next year, depending on how the government calculates the increase. This year, the rise was one percentage point above the RPI measure of inflation. These regulated fares account for about half of rail journeys.  Why? Inflation rose so much due to higher transport costs, mostly from air fares due to the school holidays, as well as from fuel and food. Petrol and diesel were more expensive in July this year compared to last, which made journeys pricier. Read more:Energy bills expected to rise from October - despite previous forecastsSomething odd is happening in the markets - with no compelling explanation Coffee, orange juice, meat and chocolate were among the items with the highest price rises, the ONS said. It contributed to food inflation of 4.9%. What does it mean for interest rates? Another measure of inflation that's closely watched by rate setters at the Bank of England rose above expectations. Core inflation - which measures price rises without volatile food and energy costs - rose to 3.8%. It had been forecast to remain at 3.7%. It's not good news for interest rates and for anyone looking to refix their mortgage, as the Bank's target for inflation is 2%. Whether or not there'll be another cut this year is unclear, but at present, traders expect no more this year, according to data from the London Stock Exchange Group (LSEG). Economists at Capital Economics anticipate a reduction in November, while the National Institute of Economic and Social Research (NIESR) expects one more by the end of the year. Analysts at Pantheon Macroeconomics forecast no change in the base interest rate. Political response Responding to the news, Chancellor Rachel Reeves said: \"We have taken the decisions needed to stabilise the public finances, and we're a long way from the double-digit inflation we saw under the previous government, but there's more to do to ease the cost of living.\" Shadow chancellor and Conservative Mel Stride said, \"Labour's choices to tax jobs and ramp up borrowing are pushing up costs and stoking inflation. And the chancellor is gearing up to do it all over again in the autumn.\""
    },
    {
        "title": "Gupta pledges UK steel arm to family in bid for Liberty",
        "description": "The metals tycoon Sanjeev Gupta is plotting to hand control of his remaining UK steel operations to his family in a bid to stave off their collapse into compulsory liquidation and a government-orchestrated fire-sale.",
        "url": "https://news.sky.com/story/gupta-pledges-uk-steel-arm-to-family-in-bid-for-liberty-13415310",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liberty-steel-sanjeev-gupta_6996353.jpg?20250820171224",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-20 16:06:00",
        "Headline": "Sanjeev Gupta is proposing to create an independent structure to house Liberty Steel's UK operations as he seeks to avert a government-orchestrated fire-sale of the UK's third-biggest steel producer, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The metals tycoon Sanjeev Gupta is plotting to hand control of his remaining UK steel operations to his family in a bid to stave off their collapse into compulsory liquidation and a government-orchestrated fire-sale. Sky News has learnt that Mr Gupta is proposing to refinance the business through a pre-pack administration that would result in Liberty Steel's Speciality Steels UK (SSUK) being owned by a trust-like structure set up for the benefit of his family. The disclosure comes amid deepening uncertainty about the fate of SSUK, which employs nearly 1,500 people at sites in Rotherham and several other locations across South Yorkshire. Behind Tata Steel and British Steel, it is the third-largest steel producer in the country. At a hearing at the High Court in London on Wednesday, it was confirmed that the government was preparing to step in and oversee an insolvency of Mr Gupta's remaining UK steel business, as Sky News reported last weekend. The connected pre-pack administration of SSUK planned by Mr Gupta would result in it ridding itself of hundreds of millions of pounds of tax and other liabilities. Begbies Traynor, the accountancy firm, is working on efforts to progress the pre-pack deal. \n                  Surprise rise in inflation as summer travel pushes up air fares\n                 \n                  Money latest: Tesco to raise the price of its meal deal from tomorrow\n                 \n                  Why we're seeing double digit price rises in food shop staples\n                 If the petition to have SSUK placed into compulsory liquidation is made, a special manager would be appointed by the Official Receiver to run the operations. A letter from the Department for Business and Trade, which was referred to in court on Wednesday, stated that \"the Official Receiver is prepared, should SSUK enter into compulsory liquidation, to take control of SSUK's affairs\". \"[His Majesty's Government] has been approached by independent third parties who have expressed an interest in returning some or all of the sites to steelmaking,\" the letter said. One source close to the situation claimed that the ownership structure devised by Mr Gupta would be independent, ring-fenced from him and have \"robust standards of governance\" - although that suggestion is likely to be viewed with extreme suspicion by observers of his once-sprawling global operations. The source added that Mr Gupta could also use that structure to seek to buy back SSUK from the Official Receiver, with the steelmaking operations' fate expected to be determined at a second court hearing in as many days, scheduled for Thursday. Mr Gupta is understood to have referred in a witness statement to the court on Wednesday to being in \"advanced\" equity funding talks with Fidera Group, a London-based investment firm which specialises in distressed corporate and asset-backed deals. Fidera declined to comment, although a source close to the firm played down suggestions that it would participate in Mr Gupta's bid to retain his grip on SSUK. Earlier this week, Sky News revealed that BlackRock, the world's largest asset manager, had provided a financing support letter with a commitment believed to be up to £75m to Liberty Steel UK in the form of an asset-based loan. Mr Gupta's pre-pack plan faced stiff opposition in court from the petitioner, the collapsed invoice financing firm Greensill Capital UK, which had financed billions of pounds of loans to Liberty Steel's parent, GFG Alliance. UBS, the investment bank which rescued Credit Suisse, a major backer of Greensill Capital, is also a creditor of the company. A Liberty Steel spokesperson said on Wednesday: \"Liberty's shareholder has invested nearly £200m, recognising the vital role steel plays in supplying the UK's strategic defence, aerospace and energy industries. \"We continue to believe our commercial solution, backed by major private capital, provides the best outcome for the business, its employees and all stakeholders concerned without cost to UK taxpayers or unnecessary uncertainty.\" The Department for Business and Trade said following Wednesday's hearing: \"We continue to closely monitor developments around Liberty Steel, including any public hearings, which are a matter for the company. \"We are supporting the Official Receiver so that they are prepared to take the necessary steps should the company enter into compulsory liquidation.\" Other parts of Mr Gupta's empire have been showing signs of financial stress for years. Mr Gupta is said to have explored whether he could persuade the government to step in and support SSUK using the legislation enacted to take control of British Steel's operations. Whitehall insiders told Sky News in May that Mr Gupta's overtures had been rebuffed. He had previously sought government aid during the pandemic, but that plea was also rejected by ministers. SSUK, which also operates from a site in Bolton, Lancashire, makes highly engineered steel products for use in sectors such as aerospace, automotive and oil and gas. The company said earlier this year that it had faced \"significant challenges due to soaring energy costs and an over-reliance on cheap imports, negatively impacting the performance of all UK steel companies\"."
    },
    {
        "title": "Why we're seeing double digit price rises in food shop staples",
        "description": "Inflation is the economic phenomenon that consumers and politicians feel most directly, which makes news of a 3.8% increase in consumer price inflation (CPI) in July no surprise to shoppers, and unwelcome confirmation of a trend for the chancellor of the exchequer.",
        "url": "https://news.sky.com/story/why-were-seeing-double-digit-price-rises-in-food-shop-staples-13415063",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-strawberry-strawberries_6780091.jpg?20241219075453",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-20 08:55:00",
        "Headline": "Wage rises have been cited as a major reason why costs have been going up, with hopes of an interest rate cut dashed by above-target inflation and rising unemployment.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Inflation is the economic phenomenon that consumers and politicians feel most directly, which makes news of a 3.8% increase in consumer price inflation (CPI) in July no surprise to shoppers, and unwelcome confirmation of a trend for the chancellor of the exchequer. If there is good news, it is that the increase was fairly narrow, confined to a few \"divisions\" of spending. The bad news is that one of them was food and drink inflation, which at 4.9% continues to rise at a faster rate than overall CPI. After the rampant price rises that followed Russia's invasion of Ukraine, food inflation had actually fallen below the headline rate this time last year. Since the spring, however, it has crept back above CPI, and the gap is widening. A few staples jump out from the underlying data: beef and veal up 24%, butter almost 18%, coffee the same, milk by more than 11% and bakery goods more than 7%. Ask growers and the supermarkets why, and you get a similar explanation: employment costs. The rise in employers' national insurance and the threshold at which it is paid, allied to a 6% increase in the minimum wage, has pushed up the cost of production and sales. A major strawberry grower told Sky News his wage bill has risen 11%, and those labour costs make up two-thirds of the price of his crop. That leaves him with no choice but to pass it on to his customers. \n                  Surprise rise in inflation as summer travel pushes up air fares\n                 \n                  People spend less time cooking dinner as convenience food sales rise - Worldpanel data\n                 \n                  Trade war uncertainty prompts halt to eurozone rate cuts\n                 Read more:Energy bills expected to rise from OctoberSomething odd is happening in the markets Consumers have some protection from the robust competition in the supermarket sector, with discounters Lidl and Aldi holding down prices that bigger players have to follow, but they all face the same wage pressures. The other drivers of high prices were restaurants and hotels, also affected by labour costs, and airfares, which had a disproportionate impact on the overall figure, thanks to a change in the timing of school holidays. What about interest rates?  Inflation is forecast to continue to rise to 4% - double the Bank of England target - in the autumn before falling back next year. The question in the meantime is what the Bank will do with interest rates. The combination of above-target inflation and rising unemployment is not classically a formula for interest rate cuts, but that is what happened earlier this month when another quarter of a percentage point was shaved from the base rate. Following these inflation numbers, the odds of a further cut at the next meeting in September have lengthened, but another may come before the year is out if the Bank believes its inflation forecast, and that a faltering economy needs some help. Also coming in the autumn, a budget that gives Rachel Reeves a chance to demonstrate that her twin goals - growth and stable public finances - are not incompatible."
    },
    {
        "title": "Labubu maker's profits soar by nearly 400% in six months as ugly-cute toys become global sensation",
        "description": "The makers of Labubu dolls - popular with celebrities including Rihanna, David Beckham and Paris Hilton - reported a near 400% increase in profits in the first half of this year after demand for the ugly-cute toys soared.",
        "url": "https://news.sky.com/story/labubu-makers-profits-soar-by-nearly-400-in-six-months-as-ugly-cute-toys-become-global-sensation-13414995",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-labubu-figures_6995968.jpg?20250820090200",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-20 06:10:00",
        "Headline": "Pop Mart, the Chinese company which makes the toothy-grinned toys, is reported to be worth more than industry giants Mattel, Sanrio and Hasbro combined.",
        "Content": " The makers of Labubu dolls - popular with celebrities including Rihanna, David Beckham and Paris Hilton - reported a near 400% increase in profits in the first half of this year after demand for the ugly-cute toys soared. The dolls' makers, Pop Mart, has released its half-year results as shares in the company have risen more than 230% since the beginning of 2025 - reportedly making the Chinese company more valuable than Barbie-maker Mattel, Hello Kitty parent company Sanrio and Transformers makers Hasbro combined. The Chinese toy company's sales tripled to 13.9bn yuan (£1.4bn), while net profit soared almost 400% to 4.6bn yuan (£474m) during the first six months of the year, according to the Financial Times. Around 40% of the sales are said to have come from outside China. Labubu, a toothy-grinned member of \"The Monsters\" series of toys designed by illustrator Kasing Lung, has become a favourite of celebrities including David Beckham, Rihanna and Paris Hilton. They have also proved difficult to get hold of for consumers after selling out at various places across the world. Pop Mart boss Wang Ning said on Wednesday that his toy company was on track to meet its targeted revenue goal of 20bn yuan (£2.06bn) in 2025, and that \"30 billion (£3.10bn) this year should also be quite easy\". The 38-year-old chief executive's net worth has skyrocketed since 2024, according to Forbes - from $1.8bn (£1.3bn) to $26.3bn (£19.5bn). He was named China's 10th richest person in June. Read more: How did the toys get so popular? And his company is hoping to grow further, with executives saying on Wednesday that expansion in emerging markets in the Middle East, Central Europe and Central and South America was being explored. \"I think for overseas markets we're still very positive, and we also believe there's still very broad space for growth,\" Mr Wang said, adding that sales from North America and Asia Pacific this year would together equal China sales in 2024. In the United States, where Pop Mart currently has about 40 stores, Mr Wang said the company will begin a phase of \"relatively rapid store openings\" over the next year or two, with 10 more US shops expected to open by the end of this year. The company has stores in Manchester and London in the UK - as well as having pop-ups in Harrods and Hamleys. The toys can also be bought online and in vending machines called \"Robo Shops\" in other parts of the UK. Pop Mart's primary business is producing and selling collectible toys, many of them developed with artists and sold in \"blind boxes\". The packages, which tend to cost around £14 in the UK, mean consumers don't know exactly which iteration of the toy is inside. This has helped drive repeat purchases, especially from collectors who want to own complete sets of each range of toys. A collector reportedly paid 1.2m yuan (£124,000) for a human-sized limited edition Labubu at an auction in Beijing in June. Until now they have been popular as a charm that can be fastened to handbags, Pop Mart says it will this week launch a mini version of Labubu that can be attached to phones. Read more from Sky News:Choke warning over fake LabubusSurprise rise in inflation to highest in a yearEnergy bills expected to rise from October Monster profits Pop Mart said on Tuesday \"The Monsters\" brought in 4.81bn yuan (£496m) in the first half of this year - accounting for 34.7% of total revenue. Four other Pop Mart toy series' earned more than 1bn yuan (£1m) during the period, including \"Molly\" and \"Crybaby\", the company said. \"We expect more restocking of existing series and launch of new editions to drive earnings expansion in the second half.That said, shares likely remain overpriced as investors are overlooking the high business risk in the long run, in ourview,\" said Jeff Zhang, an analyst at US financial services firm Morningstar.  Pop Mart was reported to have a market capital - a way of measuring a company's total value - of around £25bn earlier this year. The figure was more than the combined value of toy-making giants Sanrio (£7.5bn), Hasbro (£6.4bn), and Mattel (£4bn), according to the markets news site Sherwood News. Next in Pop Mart's sights is a Disney-esque empire with executives saying the firm is optimistic about opportunities forPop Mart characters to star in animated films and theme park attractions, though these are not expected to contribute a large amount of direct revenue in the short term. Look out for fake Labubus The surge in demand for Labubus led UK council bosses to warn people about the dangers of buying fake versions of the dolls earlier this year. Trading Standards warned that without proper safety checks, the counterfeit toys may contain choking hazards, toxic materials, or faulty components that put children at serious risk. The organisation has seized thousands of unsafe counterfeit Labubu dolls in recent weeks - with over 2,000 confiscated from 13 retailers in North Tyneside in just one month, the Chartered Trading Standards Institute (CTSI) said."
    },
    {
        "title": "What are Labubus and how did they get so popular?",
        "description": "Troll-like Labubu dolls have taken over the consumer world. Their creator, Pop Mart, has reported a near 400% net profit so far this year, while some have spent thousands on the toys second-hand.",
        "url": "https://news.sky.com/story/what-are-labubus-and-how-did-they-get-so-popular-13415187",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-china-auction-beijing_6938285.jpg?20250610131831",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-20 11:32:00",
        "Headline": "Some people have paid thousands of pounds to get their hands on furry, mischievous-looking dolls that hang off of handbags. But how did the ugly-cute monsters become such a hot commodity?",
        "Content": " Troll-like Labubu dolls have taken over the consumer world. Their creator, Pop Mart, has reported a near 400% net profit so far this year, while some have spent thousands on the toys second-hand. The frenzy over the furry dolls has led to huge queues outside the Chinese retailer's stores, and even forced the company to stop selling them at its 16 UK locations to avoid fighting among customers. Now, \"dangerous\" knock-offs are being pumped out to try and capitalise on the fact demand is exceeding supply. But how did Labubus get so popular, how long have they been around and how much are they actually worth? What are they? The mischievous looking plush dolls are part of a series by Pop Mart called The Monsters, created by Hong Kong artist and author Kasing Lung. The Labubu and the rest of The Monsters first featured in a Nordic mythology-inspired picture book trilogy in 2015, before Pop Mart turned them into the furry dolls in 2019. It started as one character, which Pop Mart describes as an \"elvish creature\" who is \"kind-hearted and always wants to help,\" but \"often accidentally achieves the opposite\". Now, Labubus are a full-on brand, with different colours, facial expressions and sometimes clothing. The most popular type of Labubu is the roughly-15cm pendant, which is often hooked onto people's bags. These are typically sold in \"blind boxes\" - meaning you pay for a Labubu, but you don't know what type you've got until you open the packaging up after purchasing. Pop Mart releases different series with different themes, and some figures are much rarer collectables than others. But there are all sorts of products for sale, from plush dolls over double that size, to hard figurines, Labubu-themed bags, cups and laptop cases. Mini versions of Labubu pendants designed to hang off of mobile phones are set to be launched at the end of August, promising to propel the hysteria further. How did they get so popular? Despite being around since 2019, the Labubu doll craze really took off last year, largely thanks to K-Pop group Blackpink's Lisa, who started hooking them to her bags and posting photos of their boxes in April 2024. She went on to promote them in interviews, telling Vanity Fair in a November 2024 video that they had become her \"secret obsession\". Many of the top comments under the video, where Lisa unboxes several Labubus, credit it as the moment the craze began. Other celebrity endorsements helped turn the Labubu into not just a toy, but a fashion statement, with British singer Dua Lipa clipping them to her bags towards the end of 2024 and Rihanna being seen doing the same in February 2025. By then, the dolls were plastered over social media, with TikTok unboxing videos getting millions of views. As the toys began to rapidly sell out, videos sharing tips on how to find them also took off. Labubus have become so popular in the UK that in April, Pop Mart was forced to take them off the shelves entirely, saying it was to \"ensure the safety and comfort of everyone\" following reports of customers fighting over them and queuing overnight outside shops. Customers were being told to enter an online raffle on Pop Mart's online store to be in with a chance of getting one. The craze has reached real extremes in the US, where police in California recovered 14 boxes of Labubus worth $30,000 (£22,238) after they were stolen in a series of trips spanning multiple days, and arrested two minors suspected of planning to resell them.  A week prior, a group of masked thieves stole $7,000 (£5,189) worth of the toys from a Los Angeles store. How much are Labubus worth? Pop Mart is currently selling the pendant blind boxes for £18 each on its UK site. Other Labubu collectables can go for more; the most expensive being an angel-themed 58cm doll listed for £215. But if you visit the site now, you'll see that every Labubu item - even the ones marked as new - are completely sold out. Some rare collector's editions of the doll have sold for thousands at auction; the Three Wise Labubu went for $28,300 in (£20,983) in May and the Sacai x Seventeen x Labubu for $31,250 (£23,167) in July. Many customers have resorted to paying for them second-hand. One UK collector, Ashley Bushey, said she spent more than £1,000 on 13 Labubu toys, after spending hours scrolling on TikTok Shop, Vinted and Facebook re-sale groups. In July, a limited edition Labubu made in collaboration with the shoe brand Vans sold for $10,585 (£7,844) on eBay - the highest any had sold on the secondary market, according to Forbes. Fake Labubu monsters could cause real danger Labubu knock-offs labelled \"Lafufus\" have started being produced to capitalise on the real toy's popularity, but both the UK's Trading Standards and the US government have warned that they could be dangerous. They have said that without proper safety checks, the counterfeit toys may contain choking hazards, toxic materials, or faulty components that put children at serious risk. The Trading Standards has seized thousands of unsafe counterfeit Labubu dolls in recent weeks - with over 2,000 confiscated from 13 retailers in North Tyneside in just one month, the Chartered Trading Standards Institute (CTSI) said."
    },
    {
        "title": "AI 'immune system' Phoebe lands backing from Google arm",
        "description": "An AI start-up which claims to act as an 'immune system' for software has landed $17m (&#163;12.6m) in initial funding from backers including the ventures arm of Alphabet-owned Google.",
        "url": "https://news.sky.com/story/ai-immune-system-phoebe-lands-backing-from-google-arm-13415005",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-phoebe-james-summerfield_6995908.jpg?20250820073253",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-20 06:29:00",
        "Headline": "Founded by a pair of former Stripe executives, Phoebe aims to slash the remediation time for software glitches and has landed $17m in seed funding led by GV and Cherry Ventures, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An AI start-up which claims to act as an 'immune system' for software has landed $17m (£12.6m) in initial funding from backers including the ventures arm of Alphabet-owned Google. Sky News has learnt that Phoebe, which uses AI agents to continuously monitor and respond to live system data in order to identify and fix software glitches, will announce this week one of the largest seed funding rounds for a UK-based company this year. The funding is led by GV - formerly Google Ventures - and Cherry Ventures, and will be announced to coincide with the public launch of Phoebe's platform. It is expected to be announced publicly on Thursday. Phoebe was founded by Matt Henderson and James Summerfield, the former chief executive and chief information officer of Stripe Europe, last year. The duo sold their first start-up, Rangespan, to Google a decade earlier. Their latest venture is motivated by data suggesting that the world's roughly 40 million software developers spend up to 30% of their time reacting to bugs and errors. \n                  Publishers issue warning on AI-created books imitating sports autobiographies\n                 \n                  NHS to use AI technology to help free up hospital beds\n                 \n                  AI used to design antibiotics that can combat drug-resistant superbugs gonorrhoea and MRSA\n                 Financial losses to companies from software outages are said to have reached $400bn globally last year, according to the company. Phoebe's swarms of AI agents sift through siloed data to identify errors in real time, which it says reduces the time it takes to resolve them by up to 90%. \"High-severity incidents can make or break big customer relationships, and numerous smaller problems drain engineering productivity,\" Mr Henderson said. \"Software monitoring tools exist, but they aren't very intelligent and require people to spend a lot of time working out what is wrong and what to do about it.\" The backing from blue-chip investors such as GV and Cherry Ventures underlines the level of interest in AI-powered software remediation businesses. Roni Hiranand, an executive at GV, said: \"AI has transformed how code is written, but software reliability has not kept pace. \"Phoebe is building a missing layer of contextual intelligence that can help both human and AI engineers avoid software failures. \"We love the boldness of the team's vision for a software immune system that pre-emptively fixes problems.\" Phoebe has signed up customers including Trainline, the rail booking app. Jay Davies, head of engineering for reliability and operations at Trainline, said Phoebe had \"already had a real impact on how we investigate and remediate incidents\". \"Work that used to take us hours to piece together can now take minutes and that matters when you're running critical services at our scale.\""
    },
    {
        "title": "Two Labour-run councils 'considering all options' to challenge migrant hotel use",
        "description": "Two Labour-run councils are considering legal action to stop the use of hotels to house migrants in their areas after Epping council won a temporary injunction.",
        "url": "https://news.sky.com/story/two-labour-run-councils-considering-all-options-to-challenge-migrant-hotel-use-13415299",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-starmer-cooper-epping_6996531.jpg?20250820233746",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-20 15:35:00",
        "Headline": "Wirral and Tamworth council leaders say they are exploring their options after a Conservative-run council in Essex won an interim High Court injunction to stop migrants being accommodated at a local hotel.",
        "Content": " Two Labour-run councils are considering legal action to stop the use of hotels to house migrants in their areas after Epping council won a temporary injunction. The leaders of Wirral and Tamworth councils both say they are considering their legal options in the wake of the Epping case, citing similar concerns about the impact of the hotels on their local communities. Politics latest: Judge in Epping hotel case was Tory candidate four times Epping Forest District Council won an interim High Court injunction on Tuesday to stop migrants being housed at The Bell Hotel, after arguing its owners did not have planning permission to do so. Paula Basnett, the Labour leader of Wirral council, said: \"We are actively considering all options available to us to ensure that any use of hotels or other premises in Wirral is lawful and does not ride roughshod over planning regulations or the wishes of our communities.\" She added: \"If necessary, we will not hesitate to challenge such decisions in order to protect both residents and those seeking refuge.\" Carol Dean, the Labour leader of Tamworth Borough Council, said she understands the \"strong feelings\" of residents about the use of a local hotel to house asylum seekers. She pointed out that under the Labour government, the use of hotels has halved from 402 to 210, with the aim of stopping the use of any hotels by 2029. But in light of the Epping case, she said \"we are closely monitoring developments and reviewing our legal position\". Badenoch backs more council rebellions Other Tory councils are also being encouraged to follow Epping's lead by party leader Kemi Badenoch. She has sent a letter to all the councils they control, pledging her support for them to fight migrant hotels. She wrote: \"The Epping hotel injunction is a victory for local people led by a good Conservative council working hard for their community. This is the difference Conservatives in local government deliver. Real plans. Real action.\" Conservative-run Broxbourne Council has announced it is exploring its legal options. The Reform UK leader of Kent County Council has also said she was writing to fellow leaders in Kent to explore whether they could potentially take legal action. Read more:Asylum seekers face being removed from Epping hotelLabour smell dirty tricks over asylum hotel court ruling Government under pressure The prospect of more rulings in favour of councils will leave ministers asking where else they might be able to house asylum seekers. Other options may include flats and ex-army bases. The prime minister and the home secretary are under huge pressure to clear the asylum backlog and stop using hotels across the country to house those waiting for their applications to be processed. Protests have sprung up at migrant hotels across the country. But The Bell Hotel in Epping became a focal point in recent weeks after an asylum seeker housed there was charged with sexually assaulting a 14-year-old girl. The council sought an interim High Court injunction to stop migrants from being accommodated at the hotel, owned by Somani Hotels Limited, on the basis that using it for that purpose contravened local planning regulations. The interim injunction demanded that the hotel be cleared of its occupants within 14 days, but in his ruling on Tuesday, Mr Justice Eyre granted the temporary block, while extending the time limit by which it must stop housing asylum seekers to 12 September. Somani Hotels said it intended to appeal the decision. Its barrister, Piers Riley-Smith, argued it would set a precedent that could affect \"the wider strategy\" of housing asylum seekers in hotels.  Epping hotel 'sidestepped public scrutiny' A government attempt to delay the application was rejected by the High Court judge. Home Office barristers had argued the case had a \"substantial impact\" on the government performing its legal duties to asylum seekers. But Mr Justice Eyre dismissed the Home Office's bid, stating that the department's involvement was \"not necessary\". The judge said the hotel's owners \"sidestepped the public scrutiny and explanation which would otherwise have taken place if an application for planning permission or for a certificate of lawful use had been made\". Reacting to Tuesday's judgment, border security minister Dame Angela Eagle said the government will \"continue working with local authorities and communities to address legitimate concerns\". She added: \"Our work continues to close all asylum hotels by the end of this parliament.\""
    },
    {
        "title": "Did Robert Jenrick really 'boast' about opening hotels for asylum seekers?",
        "description": "A row has broken out between the Tories and Reform about previous comments on migrant hotels, so who said what and when?",
        "url": "https://news.sky.com/story/did-robert-jenrick-really-boast-about-opening-hotels-for-asylum-seekers-13415335",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-robert-jenrick-breakfast_6914722.jpg?20250513072312",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-08-20 16:59:00",
        "Headline": "The shadow justice secretary has faced criticism for his record as immigration minister - but the truth is a bit more murky.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n A row has broken out between the Tories and Reform about previous comments on migrant hotels, so who said what and when? At the centre of the argument is an interview Robert Jenrick did with Sky News back in November 2022, one week after he was appointed immigration minister in Rishi Sunak's government. His appearance came amid a crisis at an asylum seeker processing centre in Kent, which had become severely overcrowded - with migrants sleeping on the floor and families being housed in marquees. Politics latest: Councils plan legal challenges to migrant hotels The home secretary at the time, Suella Braverman, had also been accused of allowing the situation to develop by failing to procure sufficient alternative accommodation - such as hotels - for migrants to be taken to.  Asked about this by Sky News in 2022, Robert Jenrick said: \"More hotels have been coming online almost every month throughout the whole of this year. \"So, Suella Braverman and her predecessor, Priti Patel, were procuring more hotels. What I have done in my short tenure is ramp that up and procure even more because November, historically, has been one of the highest months of the year for migrants illegally crossing the Channel.\"  Fast-forward almost three years, and this clip has been seized on by Reform UK as evidence that Mr Jenrick \"boasted\" about how many migrant hotels he had opened. That's a potentially damaging accusation, given the now shadow justice secretary recently joined protests outside a migrant hotel in Essex. Mr Jenrick responded by accusing Reform of posting a \"selectively clipped\" video that didn't include the context about the Kent processing centre. To an extent, he has a point. At the time, the government was fighting accusations that they were risking an expensive court action from migrants claiming they were being detained unlawfully. The minister's response was to point out that they were sourcing alternative options to make sure this didn't happen and to prevent order breaking down in Kent. Mr Jenrick has also pointed to other comments he made at the time saying, \"it is essential we exit the hotels altogether\" and describing the expensive hotel bill as \"disgraceful\". But that's not to say Robert Jenrick hasn't undergone quite a pronounced shift in both language and substance when it comes to migration. For instance, in the same Sky News interview in 2022, he said: \"I would never demonise people coming to this country in pursuit of a better life. And I understand and appreciate our obligation to refugees.\" At the time, this wasn't a surprising view from a minister commonly considered to be in the centre of the Tory party. But Mr Jenrick's time as immigration minister saw him move further to the right. As he has since said himself: \"I could see the breakdown of the British state was doing immense damage. It angered me, and it motivated me to do absolutely everything to fix the problem.\" The following months saw Mr Jenrick significantly harden his position, to the point that he resigned over the government's approach. But the bigger contradiction Reform is trying to get at by picking this fight is around the Tory record. It is a fact that the use of hotels to house asylum seekers peaked at just over 55,000 while the Conservatives were in power. Similarly, it's a fact that legal migration reached record levels on the Tories watch. Mr Jenrick can fairly claim that - in the final year of his front-bench career - he did go further than most to try to change this. But he can't change the data from the time. Reform knows that - just as it also knows the Tory record on migration is one of the big pull factors bringing their voters over to them. Read more from Sky News:US-mexico border wall to be painted black, US saysBBC should be 'put beyond reach of politicians'"
    },
    {
        "title": "Where can asylum seekers go if they can't be housed in hotels?",
        "description": "A High Court judge ruled that ministers can't use a hotel to house asylum seekers in Epping on Tuesday. The question now is where else the government can place them.",
        "url": "https://news.sky.com/story/where-can-asylum-seekers-go-if-they-cant-be-housed-in-hotels-13415282",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bell-hotel-epping_6978336.png?20250819164714",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-08-20 14:47:00",
        "Headline": "Ministers have been told they can't house migrants at the Bell Hotel in Epping, so what other options do they have?",
        "Content": "\n          Political reporter\n              @WillCharley1\n A High Court judge ruled that ministers can't use a hotel to house asylum seekers in Epping on Tuesday. The question now is where else the government can place them. The ruling, which centred on planning laws and found in favour of the local council, said that The Bell Hotel, in Essex, is not an appropriate place for asylum seekers to live. The judge, Mr Justice Eyre, has granted Epping Forest District Council a temporary injunction, blocking the hotel from being used to house migrants and requiring all of them to leave by 4pm on 12 September. Politics latest: Council plan legal challenges to migrant hotels But the ruling has much larger ramifications than just this one site, with other councils now stating publicly that they hope to follow suit in challenging the use of hotels in court. That will leave ministers asking where else they might be able to house asylum seekers, especially if judges order multiple hotels to close. Hotels \n                  Labour smell dirty tricks over asylum hotel court ruling - but the risks are clear\n                 \n                  Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court\n                 \n                  What do Ukrainians think of Trump-Putin Alaska summit?\n                 It's worth addressing just how many asylum seekers are currently in hotels. The latest figures from the Home Office show there were 32,345 asylum seekers in hotels in the UK at the end of March, down 15% from the end of December. At its peak, there were 56,042 asylum seekers being housed in hotels at the end of September 2023.  According to the National Audit Office (NAO), those in hotels make up around 35% of all people in asylum accommodation, with a report in April stating the government is now housing around 110,000 people as of December 2024. Hotels are also disproportionately expensive. While those in hotels made up just 35%, they also made up around 76% of the costs of Home Office contracts for accommodation. But the number of hotels housing asylum seekers is down, with the government pledging to end the use of hotels entirely by 2029. The number in use has already fallen from a high of more than 400 in the summer of 2023, to fewer than 210 now. Houses and flats The most obvious alternative to housing asylum seekers in hotels is to place them in ordinary flats and houses. This could include properties rented from private landlords and others from social housing providers. According to the NAO, around 66,000 people were being housed in flats and houses by the end of December 2024, which the Home Office calls 'dispersed accommodation'.  By contrast, there were around 38,000 people in hotels during the same period. The problem with moving more asylum seekers into houses and flats is that this will put added pressure on already high rents in the private sector, and lead to angry accusations that migrants are being given homes ahead of UK citizens, also on council waiting lists for accommodation. One recent example is the plan to house 35 people in flats above shops in Waterlooville in Hampshire. The local MP, former home secretary Suella Braverman, campaigned against the proposals and clashed with the leader of the local council over them. But the government has since announced it is not going ahead with the plans. Military bases or camps Another place asylum seekers could be housed is in former military bases or in specially-constructed camps. Senior Reform UK politician Zia Yusuf suggested to Sky News on Wednesday that migrants should be housed in \"modular accommodation at military bases\". Meanwhile, Conservative leader Kemi Badenoch called on the government to \"build proper camps where we keep people safe\" last week. She likened these camps to the pop-up Nightingale hospitals erected at short notice during the Coronavirus pandemic.  The problem is that military bases have been tried before - and largely discontinued, due to a lack of success. In 2022, the then-Conservative government announced plans to use ex-military facilities to house asylum seekers. Some asylum seekers have been housed at sites such as Wethersfield Airfield in Essex and at the former Napier barracks in Folkestone, Kent. Plans to use a former RAF base at Scampton were scrapped by the Labour government in September 2024. But the Home Office has since ruled out plans to use \"large sites other than Wethersfield\" because of high costs and a recognition that \"accommodating large numbers of people near small communities is difficult to manage\", according to the NAO report published this April. The previous Conservative government also tried using alternative forms of accommodation, introducing the Bibby Stockholm barge and refitting it to house migrants, before mooring it off Portland, in Dorset. But safety concerns, protests and high costs saw the use of the barge discontinued in November 2024 by the Labour government. The NAO said the barge, which could house 400 men a night, cost the taxpayer at least £34.8m. While the government has previously stated its intention not to use large sites going forward, this may have to change if the courts make housing asylum seekers in hotels unviable. The NAO points out that the Home Office spent £15.4 million buying the Northeye site in Bexhill, East Sussex in September 2023. This was never used as it was deemed unsuitable, and the government was originally looking at transferring or selling the site. Similarly, the Home Office also had a contract to refit former student accommodation in Huddersfield for asylum seekers, and these could now be seen as an option."
    },
    {
        "title": "Observer editor-in-chief James Harding says BBC should be 'put beyond reach of politicians'",
        "description": "The Observer's editor-in-chief has called for the BBC to be \"put beyond the reach of politicians\" - and has compared the fight for survival within television to the zombie fungus in The Last Of Us.",
        "url": "https://news.sky.com/story/observer-editor-in-chief-james-harding-says-bbc-should-be-put-beyond-reach-of-politicians-13415300",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bbc-workplace-culture_6900033.jpg?20250428173222",
        "type": "Politics",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-20 18:00:00",
        "Headline": "Editor-in-chief of The Observer, James Harding, a former head of the BBC's news and current affairs programming, says establishing the corporation's independence is critical \"if we want to build confidence in shared facts and respect for the truth\".",
        "Content": "\n          Arts and entertainment correspondent\n        The Observer's editor-in-chief has called for the BBC to be \"put beyond the reach of politicians\" - and has compared the fight for survival within television to the zombie fungus in The Last Of Us. Speaking to Sky News about his James MacTaggart Memorial Lecture at the Edinburgh TV Festival on Wednesday, James Harding said it \"is not the golden age of TV, it's more like The Last Of Us… just trying to stay alive as the fungus of new things eats through all of us\". The co-founder of Tortoise Media - which bought The Observer from the Scott Trust and Guardian Media Group in December - said he believes establishing the independence of the BBC is critical \"if we want to build confidence in shared facts and respect for the truth\". \"At the moment politicians choose the chairman, they choose the licence fee, they have enormous influence over it,\" he said. \"Let's face it, there's a suspicion that there's a certain worldview attached to the BBC. Let's make sure that it's obvious to people that actually different points of view are really welcome.\" Mr Harding, who ran the BBC's news and current affairs programming from 2013 up until the beginning of 2018, said the government must consider separating itself from the institution.  He explained: \"When the government established the independence of the Bank of England in 1997, it put confidence in the central institution of the economy ahead of politics; the government today can and should do the same for the shared institution in our society by giving real independence to the BBC.\" The BBC has been criticised for a number of incidents in recent months, including breaching its own accuracy editorial guidelines and livestreaming the controversial Bob Vylan Glastonbury set, where there were chants of: \"Death to the IDF [Israel Defence Forces]\". Following the incident, Culture Secretary Lisa Nandy said ministers expected \"accountability at the highest levels\" for the BBC's decision to screen the performance. In his lecture, Mr Harding said the BBC is \"not institutionally antisemitic\" and that: \"Whatever your view of the hate speech versus freedom of speech issues, an overbearing government minister doesn't help anyone. \"The hiring and firing of the editor-in-chief of the country's leading newsroom and cultural organisation should not be the job of a politician. It's chilling.\" Ahead of the BBC charter renewal in 2027, he said the corporation's \"survival is at stake\". He argued that the BBC chair and board of directors should be \"chosen, not by the prime minister, but by the board itself and then, like other such organisations, with the approval of Ofcom. \"The charter should be open-ended. And the licence fee - or any future funding arrangement - should not be decided behind closed doors by the culture secretary and the chancellor, but, as in Germany, set transparently and rationally by an independent commission that impartially advises government and is scrutinised by parliament.\" He also said the BBC should lead the way in striking deals with generative AI companies by taking advantage of the \"meaningful pricing of its reliable, ceaselessly renewed library of content.  Read more on Sky News:BBC and C4 'should merge to survive'Rock star dropped over Gaza commentsTake That stars working on new song \"That would help set the terms for other UK news and media companies that don't get a hearing from the new generation of tech giants,\" he said. Mr Harding suggested that the BBC should look to work with AI developers to provide a \"BBC GPT\" that could enable the public to utilise AI \"without handing over every last detail of what's on their minds to US tech corporations that have proved obstinately unaccountable in the UK.\" He said it's \"about more than the BBC, it's a national investment in our future that will come back to reap multi-platform rewards that an investment in no other UK organisation can.\" Edinburgh TV Festival runs from 19 - 22 August."
    },
    {
        "title": "'Alarm' over exclusion of child sexual exploitation from strategy to tackle violence against women and girls",
        "description": "The shadow minister for safeguarding has written to the government demanding action on child sexual exploitation after being \"alarmed\" by a Sky News story revealing plans to exclude it from their Violence Against Women and Girls strategy.",
        "url": "https://news.sky.com/story/alarm-over-exclusion-of-child-sexual-exploitation-from-strategy-to-tackle-violence-against-women-and-girls-13415353",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-malone-vawg_6990586.png?20250814124037",
        "type": "Politics",
        "Author": "Mollie Malone",
        "Date Published": "2025-08-20 17:43:00",
        "Headline": "Alicia Kearns tells safeguarding minister, Jess Phillips, that \"survivors of sexual violence have been left bereft\" by the decision to omit child sexual abuse and exploitation from its upcoming strategy to tackle Violence Against Women and Girls (VAWG).",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n The shadow minister for safeguarding has written to the government demanding action on child sexual exploitation after being \"alarmed\" by a Sky News story revealing plans to exclude it from their Violence Against Women and Girls strategy. Last week, Sky News reported on a leaked Home Office document which stated that child sexual abuse and exploitation was not \"explicitly within the scope\" of their upcoming strategy to tackle Violence Against Women and Girls (VAWG). Shadow minister for safeguarding, Alicia Kearns, has written to safeguarding minister, Jess Phillips, saying that \"survivors of sexual violence have been left bereft\" by the decision. The government insists that its strategy, due to be published next month, will include action to tackle child sexual abuse, but that a distinctive programme will also be announced to address the specifics of the crime. In her letter \"demanding answers,\" Ms Kearns urged the minister to \"be transparent and explain why sexual violence has been purposefully excluded\" and to \"set out when a separate strategy on tackling sexual violence will be published\". Poppy Eyre was sexually abused and raped by her grandfather when she was four. Her grandfather was later convicted and died in prison. She told Sky News on Friday: \"VAWG is violence against women and girls. If you take child sexual abuse out of it, where are the girls?\"  The Centre of Expertise on Child Sexual Abuse, which is funded by the Home Office, estimates that 500,000 children will experience some form of sexual abuse every year in England and Wales, Rape Crisis told Sky News ministers have failed victims of abuse if they don't consider the \"scale of child sexual abuse and exploitation\" within their strategy. The campaign group said, \"for any strategy to be effective,\" that the plans \"must include all forms of gender-based violence against all women and girls\", suggesting there is a \"danger\" in having a separate plan for child sexual abuse. Read more from Sky News:Councillor jailed for sexually abusing girlUK set for hottest summer on recordEx-priest guilty of sexual assault A Home Office spokesperson said the department was \"working tirelessly to tackle the scourges of violence against women and girls and child sexual abuse\". In a statement, the spokeperson said: \"These issues are complex and run deep within the fabric of society. \"The government wholly recognises that they overlap. \"But it also recognises that concerted action is needed to tackle child sexual abuse, which is why we have set out a range of actions... and why we are launching a national inquiry into grooming gangs.\""
    },
    {
        "title": "AI 'immune system' Phoebe lands backing from Google arm",
        "description": "An AI start-up which claims to act as an 'immune system' for software has landed $17m (&#163;12.6m) in initial funding from backers including the ventures arm of Alphabet-owned Google.",
        "url": "https://news.sky.com/story/ai-immune-system-phoebe-lands-backing-from-google-arm-13415005",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-phoebe-james-summerfield_6995908.jpg?20250820073253",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-20 06:29:00",
        "Headline": "Founded by a pair of former Stripe executives, Phoebe aims to slash the remediation time for software glitches and has landed $17m in seed funding led by GV and Cherry Ventures, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An AI start-up which claims to act as an 'immune system' for software has landed $17m (£12.6m) in initial funding from backers including the ventures arm of Alphabet-owned Google. Sky News has learnt that Phoebe, which uses AI agents to continuously monitor and respond to live system data in order to identify and fix software glitches, will announce this week one of the largest seed funding rounds for a UK-based company this year. The funding is led by GV - formerly Google Ventures - and Cherry Ventures, and will be announced to coincide with the public launch of Phoebe's platform. It is expected to be announced publicly on Thursday. Phoebe was founded by Matt Henderson and James Summerfield, the former chief executive and chief information officer of Stripe Europe, last year. The duo sold their first start-up, Rangespan, to Google a decade earlier. Their latest venture is motivated by data suggesting that the world's roughly 40 million software developers spend up to 30% of their time reacting to bugs and errors. \n                  Publishers issue warning on AI-created books imitating sports autobiographies\n                 \n                  NHS to use AI technology to help free up hospital beds\n                 \n                  AI used to design antibiotics that can combat drug-resistant superbugs gonorrhoea and MRSA\n                 Financial losses to companies from software outages are said to have reached $400bn globally last year, according to the company. Phoebe's swarms of AI agents sift through siloed data to identify errors in real time, which it says reduces the time it takes to resolve them by up to 90%. \"High-severity incidents can make or break big customer relationships, and numerous smaller problems drain engineering productivity,\" Mr Henderson said. \"Software monitoring tools exist, but they aren't very intelligent and require people to spend a lot of time working out what is wrong and what to do about it.\" The backing from blue-chip investors such as GV and Cherry Ventures underlines the level of interest in AI-powered software remediation businesses. Roni Hiranand, an executive at GV, said: \"AI has transformed how code is written, but software reliability has not kept pace. \"Phoebe is building a missing layer of contextual intelligence that can help both human and AI engineers avoid software failures. \"We love the boldness of the team's vision for a software immune system that pre-emptively fixes problems.\" Phoebe has signed up customers including Trainline, the rail booking app. Jay Davies, head of engineering for reliability and operations at Trainline, said Phoebe had \"already had a real impact on how we investigate and remediate incidents\". \"Work that used to take us hours to piece together can now take minutes and that matters when you're running critical services at our scale.\""
    },
    {
        "title": "Investigation launched into 'horrifying' death of French internet streamer",
        "description": "Several people have been interviewed and equipment seized by police investigating the death of an internet streamer who was known for taking part in extreme online challenges.",
        "url": "https://news.sky.com/story/investigation-launched-into-horrifying-death-of-french-internet-streamer-13414968",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jean-pormanove-raphael-graven_6995865.png?20250820044406",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-20 03:13:00",
        "Headline": "Raphael Graven, who went by Jean Pormanove online, had more than a million followers across social media - but was particularly popular on the Twitch-like streaming platform Kick.",
        "Content": "Several people have been interviewed and equipment seized by police investigating the death of an internet streamer who was known for taking part in extreme online challenges. Raphael Graven, who went by Jean Pormanove, was found dead in Contes, near Nice, on Sunday night. A post-mortem is taking place. Viewers of the Frenchman's last live stream on the Twitch-like platform Kick had reportedly become concerned about him lying lifeless on a mattress, unresponsive to their comments. \"Several interviews with people present at the time of the death have been conducted, but at this stage they have not provided any guidance as to the causes of the death,\" said Nice's public prosecutor Damien Martinelli. \"Numerous seizures of equipment and videos were made in order to clarify the events that occurred prior to the death and which may have contributed to it,\" he added. According to France24, prosecutors said the 46-year-old had been in an accommodation rented for the purpose of broadcasting live internet streams. The broadcast had reportedly been running for 10 days. French newspaper Le Monde said Graven was known for participating in videos in which he suffered apparent violence and humiliation, alongside two colleagues. \n                  Andrew and Dawn Searle: Actor son of 'murder-suicide' victim urges late mother's friends not to attend stepfather's funeral\n                 \n                  Thousands evacuated as deadly wildfires sweep Europe\n                 \n                  'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant\n                 France's digital technology minister, Clara Chappaz, said he had been \"humiliated and abused for months\" and confirmed that \"a judicial investigation is underway\". \"Holding online platforms responsible for the dissemination of illegal content is not an option: it is the law. \"This type of failure can lead to the worst and has no place in France, Europe, or anywhere else.\" Streaming platform Kick has been making waves since it was launched in early 2023.\n Built as a competitor to the Amazon-owned platform Twitch, it hosts livestreaming for everyone from gamers to influencers to gamblers. \n Although Kick's ownership isn't fully public, it is backed by some of the founders of the online casino Stake.com and streamers can currently make more on Kick than on other platforms.\n While Twitch lets creators keep 50% of their profit, and YouTube lets creators keep 70%, Kick lets creators keep 95% of their earnings, according to Internet Matters. \n Those potential earnings have drawn a number of streamers - and their fans - over to the newer platform. \n Kick currently boasts around 57 million users worldwide, according to data reported by Digiday in April. \n Although its community guidelines have been recently updated, Kick is seen as having a more relaxed approach to moderation.\n This approach has led to some influencers who are banned on other platforms making their way over to Kick.\n Sarah El Hairy, France's high commissioner for children, described his death as \"horrifying\". \"Platforms have an immense responsibility to regulate online content so that our children are not exposed to violent content,\" she said. \"I urge parents to be extremely vigilant.\" Read more from Sky News:Trump sets red line on UkraineInside caves at heart of terror network Graven had more than one million followers across social media. He was particularly popular on Kick, which was founded in 2022 as a competitor to Amazon-owned Twitch. It's known for having looser moderation and offers creators a higher share of revenue. A spokesperson for Kick told Sky News: \"We are deeply saddened by the loss of Jean Pormanove and extend our condolences to his family, friends, and community. \"We are urgently reviewing the circumstances and engaging with relevant stakeholders to investigate the situation. \"Kick's community guidelines are designed to protect creators, and we remain committed to upholding these standards across our platform.\""
    },
    {
        "title": "Observer editor-in-chief James Harding says BBC should be 'put beyond reach of politicians'",
        "description": "The Observer's editor-in-chief has called for the BBC to be \"put beyond the reach of politicians\" - and has compared the fight for survival within television to the zombie fungus in The Last Of Us.",
        "url": "https://news.sky.com/story/observer-editor-in-chief-james-harding-says-bbc-should-be-put-beyond-reach-of-politicians-13415300",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bbc-workplace-culture_6900033.jpg?20250428173222",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-20 18:00:00",
        "Headline": "Editor-in-chief of The Observer, James Harding, a former head of the BBC's news and current affairs programming, says establishing the corporation's independence is critical \"if we want to build confidence in shared facts and respect for the truth\".",
        "Content": "\n          Arts and entertainment correspondent\n        The Observer's editor-in-chief has called for the BBC to be \"put beyond the reach of politicians\" - and has compared the fight for survival within television to the zombie fungus in The Last Of Us. Speaking to Sky News about his James MacTaggart Memorial Lecture at the Edinburgh TV Festival on Wednesday, James Harding said it \"is not the golden age of TV, it's more like The Last Of Us… just trying to stay alive as the fungus of new things eats through all of us\". The co-founder of Tortoise Media - which bought The Observer from the Scott Trust and Guardian Media Group in December - said he believes establishing the independence of the BBC is critical \"if we want to build confidence in shared facts and respect for the truth\". \"At the moment politicians choose the chairman, they choose the licence fee, they have enormous influence over it,\" he said. \"Let's face it, there's a suspicion that there's a certain worldview attached to the BBC. Let's make sure that it's obvious to people that actually different points of view are really welcome.\" Mr Harding, who ran the BBC's news and current affairs programming from 2013 up until the beginning of 2018, said the government must consider separating itself from the institution.  He explained: \"When the government established the independence of the Bank of England in 1997, it put confidence in the central institution of the economy ahead of politics; the government today can and should do the same for the shared institution in our society by giving real independence to the BBC.\" The BBC has been criticised for a number of incidents in recent months, including breaching its own accuracy editorial guidelines and livestreaming the controversial Bob Vylan Glastonbury set, where there were chants of: \"Death to the IDF [Israel Defence Forces]\". Following the incident, Culture Secretary Lisa Nandy said ministers expected \"accountability at the highest levels\" for the BBC's decision to screen the performance. In his lecture, Mr Harding said the BBC is \"not institutionally antisemitic\" and that: \"Whatever your view of the hate speech versus freedom of speech issues, an overbearing government minister doesn't help anyone. \"The hiring and firing of the editor-in-chief of the country's leading newsroom and cultural organisation should not be the job of a politician. It's chilling.\" Ahead of the BBC charter renewal in 2027, he said the corporation's \"survival is at stake\". He argued that the BBC chair and board of directors should be \"chosen, not by the prime minister, but by the board itself and then, like other such organisations, with the approval of Ofcom. \"The charter should be open-ended. And the licence fee - or any future funding arrangement - should not be decided behind closed doors by the culture secretary and the chancellor, but, as in Germany, set transparently and rationally by an independent commission that impartially advises government and is scrutinised by parliament.\" He also said the BBC should lead the way in striking deals with generative AI companies by taking advantage of the \"meaningful pricing of its reliable, ceaselessly renewed library of content.  Read more on Sky News:BBC and C4 'should merge to survive'Rock star dropped over Gaza commentsTake That stars working on new song \"That would help set the terms for other UK news and media companies that don't get a hearing from the new generation of tech giants,\" he said. Mr Harding suggested that the BBC should look to work with AI developers to provide a \"BBC GPT\" that could enable the public to utilise AI \"without handing over every last detail of what's on their minds to US tech corporations that have proved obstinately unaccountable in the UK.\" He said it's \"about more than the BBC, it's a national investment in our future that will come back to reap multi-platform rewards that an investment in no other UK organisation can.\" Edinburgh TV Festival runs from 19 - 22 August."
    },
    {
        "title": "Police watchdog closes investigations over decision to charge Caroline Flack",
        "description": "The police watchdog has closed its investigations into the circumstances leading up to the decision to charge TV presenter Caroline Flack with assaulting her boyfriend.",
        "url": "https://news.sky.com/story/police-watchdog-closes-investigations-over-decision-to-charge-caroline-flack-13415235",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-caroline-flack-brit-awards_6996234.jpg?20250820141734",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-20 13:00:00",
        "Headline": "Caroline Flack, best known for presenting ITV's Love Island, died in February 2020. A coroner ruled the star - who also won Strictly Come Dancing - took her own life after discovering she was definitely going to face a trial.",
        "Content": "The police watchdog has closed its investigations into the circumstances leading up to the decision to charge TV presenter Caroline Flack with assaulting her boyfriend. Flack died in February 2020, with a coroner ruling that she took her own life after discovering she was definitely going to face a trial. The Crown Prosecution Service (CPS) initially recommended a caution after the alleged assault in December 2019 - but London's Metropolitan Police appealed and the Love Island host was charged with assault by beating. Various reviews into the way the case was handled have been carried out by the CPS, the Met, and the Independent Office for Police Conduct (IOPC) since Flack's death. In April 2024, the star's mother told Sky News she believes her daughter's celebrity status likely contributed towards the decision to charge her. It has now emerged that the IOPC closed its latest investigation, relating to the actions of officers in appealing to the CPS, in January 2025 - finding the outcome was \"reasonable and proportionate\". An IOPC spokesperson said it received a complaint referral from the Met, which contained \"a number of allegations about the force's investigation\" into the alleged assault, in March 2024. The majority of the allegations had already been investigated by the force and reviewed by the IOPC, the watchdog said, so it found no further action was required. However, the Met was directed to investigate one aspect of the complaint \"on the basis there may be new witness evidence available\". This related to the actions of officers in appealing the initial CPS decision, and five allegations were returned to the force's Directorate of Professional Standards (DPS) to \"resolve in a proportionate manner\", the IOPC spokesperson told Sky News. In June 2024, the Met found there was \"no new evidence that would alter any previous outcomes\", the spokesperson added, and the complainant asked the IOPC to review once again. \"Following that review, in January 2025 we found that outcome to be reasonable and proportionate.\" A Met Police spokesperson said DPS officers made further enquiries and examined the evidence last year. \"It did not change the original outcome that the service provided by officers was acceptable,\" the spokesperson said. \"The family were advised of the outcome in June [2024] and then appealed that outcome to the IOPC. The IOPC carried out a review and, in January 2025, found no new evidence that would alter any of the previous outcomes.\" Both the Met and the IOPC have closed their investigations. The IOPC said another review could be considered in light of any new evidence. At the end of Flack's inquest, coroner Mary Hassell said the alleged assault had \"played out in the national press\" following her arrest and had a serious impact on her mental health. In April 2024, her mother Christine Flack told Sky News: \"This wasn't domestic violence. This was an accident. But she was portrayed in the court and in the newspapers as a domestic abuser, and that's what hurts. That's what I want got rid of - because she wasn't.\" She said she believed her daughter was treated differently due to her celebrity status. \"And that's not on. She shouldn't be treated better, but she shouldn't be treated worse.\" This was not the first investigation into the handling of Flack's case, with the Met initially referring itself to the watchdog just a few days after her death. The DPS found there was no misconduct, prompting another complaint from Flack's family to the IOPC. In 2023, the IOPC ordered the force to apologise for not recording its reason for appealing against the caution, but said it had not identified any misconduct. In the days after the TV presenter's death, the CPS also reviewed its handling of the case. Flack's boyfriend, Lewis Burton, had said he did not support the prosecution, and following her death her management released a statement criticising the decision. Read more from Sky News:Grange Hill creator calls for radical TV mergerPaul Weller suing accountants over his Gaza comments At the time, a CPS spokesperson said it was normal practice for prosecutors to hold a debriefing after complex or sensitive cases have ended. \"This has taken place and found that the case was handled appropriately and in line with our published legal guidance,\" they said. Flack, 40, presented shows including spin-offs I'm A Celebrity... Get Me Out Of Here! NOW! and The Xtra Factor, as well as one season of the main X Factor show with former contestant Olly Murs, before becoming best known as the host of Love Island. She also won Strictly Come Dancing in 2014. Sky News has contacted Flack's family for comment. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Robbie Williams reveals Gary Barlow collaboration on new album Britpop",
        "description": "Robbie Williams has revealed details of several star collaborations on his upcoming album, Britpop - including a track with Gary Barlow.",
        "url": "https://news.sky.com/story/robbie-williams-reveals-gary-barlow-collaboration-on-new-album-britpop-13415040",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-robbie-williams-britpop-album-launch_6996012.jpg?20250820102031",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-08-20 08:28:00",
        "Headline": "Britpop, out in October, will be Robbie Williams's first album of original songs in almost 10 years - and comes following the biopic Better Man, in which he was portrayed as a monkey, released in 2024.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Robbie Williams has revealed details of several star collaborations on his upcoming album, Britpop - including a track with Gary Barlow. The former Take That singer teased details at a launch event for the record, which will be his first studio album of original songs in almost a decade. He also announced he will play his \"smallest-ever ticketed gig\" as an intimate show for 500 fans, performing both his debut album Life Thru A Lens and Britpop in their entirety, following his current European stadium tour. Williams listed some of the artists he has collaborated with on the new album, including Black Sabbath's Tony Iommi, Coldplay's Chris Martin, Supergrass frontman Gaz Coombes, and Barlow. The relationship between the Take That stars famously deteriorated after Williams left the group, but the pair fixed their friendship in later years - and the Angels star reunited with the band for their Progress tour in 2011. Their song on Britpop is called Morrissey, about the singer-songwriter and former frontman of The Smiths. Answering questions from comedian Joe Lycett, who hosted the event, Williams said the song was written from the point of view of \"somebody that is stalking Morrissey and is completely obsessed and in love with him\", but did not give any further detail. Another track, Human, is about AI. \"We are being told that we're all about to be replaced, and we need clothes and we need food, so there's a chance that we will be removed,\" Williams said. \"Whether it's a prophecy, we shall see. But, yeah. It's a song about what we've been told about AI.\" The singer rose to fame in Take That in the early 1990s before quitting and going on to have huge success as a solo star, with hit songs including Let Me Entertain You, Angels, Feel, No Regrets and She's The One. In 2023, he reflected on his life and career in a documentary series, in which he spoke about his struggles with the limelight and his mental health at the height of his fame. Last year's Better Man - a biopic of his life in which the star was portrayed as a monkey - also tackled those issues. Now, he says he is back with the kind of album he would have loved to have released after he left Take That in 1995 - the \"peak of Britpop\" and the year of Oasis's (What's the Story) Morning Glory?, Pulp's Different Class, and Blur's The Great Escape. \"I've kind of been musically a bit aimless for a little while because I haven't known really what to do,\" Williams said at the Britpop launch. \"I chased yesterday an awful lot. Which happens.\" When you become hugely successful and then \"commercial radio, whatever, stops playing you... you think, shit, what was it that I did?\" he continued. \"I just spent the last 15 years looking backwards. And I think with this album, if I am going to look backwards, I might as well just clear the decks, go back to the start and head off from there.\" Read more from Sky News entertainment:Grange Hill creator calls for radical TV merger'I'm proud': Noel Gallagher praises Liam for Oasis tour Williams also spoke about other projects, including artwork and investment in arts education. \"I want the entertainment industry to be somebody's Plan A and Plan B,\" he said. \"You know when you go to your parents, you say, 'I want to be a singer, I want to be a dancer or be an actor, I want to go into the entertainment industry'. [The response is] 'You better have a Plan B.' I want to create the Plan B for people, too.\" Robbie Williams will play at Dingwalls in Camden on 9 October. Britpop is out the following day."
    },
    {
        "title": "Kneecap rapper greeted by hundreds of supporters at terror charge court hearing",
        "description": "A member of rap trio Kneecap has been released on unconditional bail after appearing in court charged with supporting a proscribed terror organisation - as hundreds turned out to support him outside.",
        "url": "https://news.sky.com/story/kneecap-rapper-greeted-by-hundreds-of-supporters-at-terror-charge-court-hearing-13415120",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kneecap-mo-chara-og-o-hannaidh_6995998.jpg?20250820095826",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-20 09:38:00",
        "Headline": "Liam Og O hAnnaidh, who performs under the name Mo Chara, is accused of displaying a flag in support of Hezbollah on stage at a Kneecap gig in London in November last year.",
        "Content": " A member of rap trio Kneecap has been released on unconditional bail after appearing in court charged with supporting a proscribed terror organisation - as hundreds turned out to support him outside. Liam Og O hAnnaidh, who performs under the name Mo Chara, is accused of displaying a flag in support of Hezbollah at a gig in London in November last year. Demonstrators waving flags and holding banners in support of the rapper greeted him with cheers as he made his way into Westminster Magistrates' Court on Wednesday morning.   Supported by his Kneecap bandmates Naoise O Caireallain and JJ O Dochartaigh, it took O hAnnaidh more than a minute to enter the building as security officers worked to usher him inside through a crowd of photographers and supporters. Fans held signs which read \"Free Mo Chara\", while others waved Irish and Palestinian flags. As the hearing got under way, O hAnnaidh confirmed his name, date of birth and address. An Irish language interpreter was present in court. During a previous hearing, prosecutors said the 27-year-old is \"well within his rights\" to voice his opinions on the Israel-Palestine conflict, but said the alleged incident at the O2 Forum in Kentish Town was a \"wholly different thing\". O hAnnaidh is yet to enter a plea to the charge. The case has been adjourned for legal argument and he will appear in court for a further hearing on 26 September.  Who are Kneecap? Kneecap put out their first single in 2017 and rose to wider prominence in 2024 after the release of their debut album and an eponymously titled film - a fictionalised retelling of how the band came together and their fight to save the Irish language. The film, in which the trio play themselves and co-star alongside starring Oscar nominee Michael Fassbender, won the BAFTA for outstanding debut earlier this year, for director and writer Rich Peppiatt. Last year, Kneecap won a discrimination case against the UK government after Conservative leader Kemi Badenoch tried to refuse them a £14,250 funding award when she was business secretary. They are known for songs including H.O.O.D, Fine Art, and Better Way To Live, featuring Fontaines DC frontman Grian Chatten, with lyrics switching between the Irish language and English."
    },
    {
        "title": "Paul Weller suing former accountants after they stopped working with him over Gaza statements",
        "description": "Paul Weller is suing his former accountants after they stopped working with him after he alleged Israel was committing genocide in Gaza, according to a legal letter.",
        "url": "https://news.sky.com/story/paul-weller-suing-former-accountants-after-they-stopped-working-with-him-over-gaza-statements-13415000",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-paul-weller-london_6902205.jpg?20250430223805",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-20 06:24:00",
        "Headline": "The former frontman of The Jam, 67, has filed a discrimination claim against Harris and Trotter after the firm ended their professional relationship.",
        "Content": "Paul Weller is suing his former accountants after they stopped working with him after he alleged Israel was committing genocide in Gaza, according to a legal letter. The former frontman of The Jam, 67, has filed a discrimination claim against Harris and Trotter after the firm ended their professional relationship. Lawyers for Weller say the singer-songwriter was told in March that the accountants and tax advisers would no longer work with him or his companies.   According to the letter, which was seen by the PA news agency, a WhatsApp message from a partner at the firm said: \"It's well known what your political views are in relation to Israel, the Palestinians and Gaza, but we as a firm are offended at the assertions that Israel is committing any type of genocide. \"Everyone is entitled to their own views, but you are alleging such anti-Israel views that we as a firm with Jewish roots and many Jewish partners are not prepared to work with someone who holds these views.\" Israel has vehemently denied claims of genocide. But lawyers for Weller claim by ending their services, the firm unlawfully discriminated against the singer's protected philosophical beliefs, including that Israel is committing genocide in Gaza and Palestine should be recognised as a nation state. Weller said: \"I've always spoken out against injustice, whether it's apartheid, ethnic cleansing, or genocide. What's happening to the Palestinian people in Gaza is a humanitarian catastrophe. \"I believe they have the right to self-determination, dignity, and protection under international law, and I believe Israel is committing genocide against them. That must be called out. \"Silencing those who speak this truth is not just censorship - it's complicity. \"I'm taking legal action not just for myself, but to help ensure that others are not similarly punished for expressing their beliefs about the rights of the Palestinian people.\" Read more:Tents abandoned as Palestinians flee Israeli advanceGaza ceasefire proposal agreed by Hamas The legal letter says Weller will donate any damages he receives to humanitarian relief efforts in Gaza. Cormac McDonough, a lawyer at Hodge Jones and Allen, which is representing Weller, said his case \"reflects a wider pattern of attempts to silence artists and public figures who speak out in support of Palestinian rights\". Mr McDonough added: \"Within the music industry especially, we are seeing increasing efforts to marginalise those who express solidarity with the people of Gaza.\" Sky News has contacted Harris and Trotter for comment."
    },
    {
        "title": "Andrew and Dawn Searle: Actor son of 'murder-suicide' victim urges late mother's friends not to attend stepfather's funeral",
        "description": "An actor and musician whose mother was the victim of a suspected murder-suicide in France has urged her friends not to attend his stepfather's funeral.",
        "url": "https://news.sky.com/story/andrew-and-dawn-searle-actor-son-of-murder-suicide-victim-urges-late-mothers-friends-not-to-attend-stepfathers-funeral-13415023",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-searle-dawn-searle_6822825.jpg?20250820093005",
        "type": "Entertainment",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-20 07:40:00",
        "Headline": "The bodies of British couple Andrew and Dawn Searle were discovered on 6 February at their home in the hamlet of Les Pesquies.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n An actor and musician whose mother was the victim of a suspected murder-suicide in France has urged her friends not to attend his stepfather's funeral. Callum Kerr, who starred in Hollyoaks and Netflix's Virgin River, said it would be \"inappropriate\" for the memory of his mum to be associated with a service honouring the man who \"may have been responsible for her death\". The bodies of British couple Andrew and Dawn Searle were discovered on 6 February at their home in the hamlet of Les Pesquies. Mrs Searle's body was found outside the property with a significant head injury, while Mr Searle's body was discovered inside. Prosecutors later ruled the incident to be murder-suicide due to a lack of evidence that someone else was involved. In an Instagram post on behalf of himself and his sister, Amanda Kerr, Mr Kerr said: \"In the absence of any evidence suggesting third-party involvement in the tragic death of our mother, Dawn Kerr, the prevailing hypothesis remains that of a murder-suicide.\" Mr Kerr, a country music singer who is also set to appear in the second season of Netflix's One Piece, said his mother was \"killed by multiple blows to the head\", while \"no defensive wounds\" were found on Mr Searle. \n                  Investigation launched into 'horrifying' death of French internet streamer\n                 \n                  Thousands evacuated as deadly wildfires sweep Europe\n                 \n                  'Massive and unpredictable' swarm of jellyfish shuts down nuclear plant\n                 Mr Kerr said: \"While the official investigation is still ongoing, we cannot ignore the circumstances as they stand. \"For this reason, we must respectfully but firmly request that our mother not be included in any way in the funeral arrangements being made for Andrew. \"Please do not share photographs of them together. Please do not attend Andrew's service if you were a friend of our mother. \"It would be inappropriate for her memory to be associated with a service honouring the man who, based on all available evidence, may have been responsible for her death. \"We ask for understanding, privacy and respect as we continue to grieve and seek justice for our mum.\" Read more from Sky News:Probe launched into 'horrifying' death of online streamerInside ISIS resurgence - and the former Briton heading it Mr and Mrs Searle, who previously lived in Musselburgh in East Lothian, had been living in the Aveyron region for five years. They lived in Les Pesquies and were married in 2023 in the nearby town of Villefranche-de-Rouergue, with Mr Kerr walking his mum down the aisle. Neighbours described them as a happy couple, who had fully integrated into rural French life and held an annual party for villagers. Jean-Sebastien Orcibal, the mayor of Villefranche-de-Rouergue who conducted the couple's wedding, told Sky News they were \"very happy, very friendly and didn't seem to have any problems\". Mrs Searle, 56, grew up in Eyemouth in the Scottish Borders, while Mr Searle, 62, was originally from England. According to his LinkedIn page, Mr Searle retired in 2015 after previously working in financial crime prevention at companies including Standard Life and Barclays. Following the deaths, investigators were said to be following several lines of inquiry - including whether the couple were killed during a burglary or potential links to Mr Searle's previous work in the UK."
    },
    {
        "title": "What are Labubus and how did they get so popular?",
        "description": "Troll-like Labubu dolls have taken over the consumer world. Their creator, Pop Mart, has reported a near 400% net profit so far this year, while some have spent thousands on the toys second-hand.",
        "url": "https://news.sky.com/story/what-are-labubus-and-how-did-they-get-so-popular-13415187",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-china-auction-beijing_6938285.jpg?20250610131831",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-08-20 11:32:00",
        "Headline": "Some people have paid thousands of pounds to get their hands on furry, mischievous-looking dolls that hang off of handbags. But how did the ugly-cute monsters become such a hot commodity?",
        "Content": " Troll-like Labubu dolls have taken over the consumer world. Their creator, Pop Mart, has reported a near 400% net profit so far this year, while some have spent thousands on the toys second-hand. The frenzy over the furry dolls has led to huge queues outside the Chinese retailer's stores, and even forced the company to stop selling them at its 16 UK locations to avoid fighting among customers. Now, \"dangerous\" knock-offs are being pumped out to try and capitalise on the fact demand is exceeding supply. But how did Labubus get so popular, how long have they been around and how much are they actually worth? What are they? The mischievous looking plush dolls are part of a series by Pop Mart called The Monsters, created by Hong Kong artist and author Kasing Lung. The Labubu and the rest of The Monsters first featured in a Nordic mythology-inspired picture book trilogy in 2015, before Pop Mart turned them into the furry dolls in 2019. It started as one character, which Pop Mart describes as an \"elvish creature\" who is \"kind-hearted and always wants to help,\" but \"often accidentally achieves the opposite\". Now, Labubus are a full-on brand, with different colours, facial expressions and sometimes clothing. The most popular type of Labubu is the roughly-15cm pendant, which is often hooked onto people's bags. These are typically sold in \"blind boxes\" - meaning you pay for a Labubu, but you don't know what type you've got until you open the packaging up after purchasing. Pop Mart releases different series with different themes, and some figures are much rarer collectables than others. But there are all sorts of products for sale, from plush dolls over double that size, to hard figurines, Labubu-themed bags, cups and laptop cases. Mini versions of Labubu pendants designed to hang off of mobile phones are set to be launched at the end of August, promising to propel the hysteria further. How did they get so popular? Despite being around since 2019, the Labubu doll craze really took off last year, largely thanks to K-Pop group Blackpink's Lisa, who started hooking them to her bags and posting photos of their boxes in April 2024. She went on to promote them in interviews, telling Vanity Fair in a November 2024 video that they had become her \"secret obsession\". Many of the top comments under the video, where Lisa unboxes several Labubus, credit it as the moment the craze began. Other celebrity endorsements helped turn the Labubu into not just a toy, but a fashion statement, with British singer Dua Lipa clipping them to her bags towards the end of 2024 and Rihanna being seen doing the same in February 2025. By then, the dolls were plastered over social media, with TikTok unboxing videos getting millions of views. As the toys began to rapidly sell out, videos sharing tips on how to find them also took off. Labubus have become so popular in the UK that in April, Pop Mart was forced to take them off the shelves entirely, saying it was to \"ensure the safety and comfort of everyone\" following reports of customers fighting over them and queuing overnight outside shops. Customers were being told to enter an online raffle on Pop Mart's online store to be in with a chance of getting one. The craze has reached real extremes in the US, where police in California recovered 14 boxes of Labubus worth $30,000 (£22,238) after they were stolen in a series of trips spanning multiple days, and arrested two minors suspected of planning to resell them.  A week prior, a group of masked thieves stole $7,000 (£5,189) worth of the toys from a Los Angeles store. How much are Labubus worth? Pop Mart is currently selling the pendant blind boxes for £18 each on its UK site. Other Labubu collectables can go for more; the most expensive being an angel-themed 58cm doll listed for £215. But if you visit the site now, you'll see that every Labubu item - even the ones marked as new - are completely sold out. Some rare collector's editions of the doll have sold for thousands at auction; the Three Wise Labubu went for $28,300 in (£20,983) in May and the Sacai x Seventeen x Labubu for $31,250 (£23,167) in July. Many customers have resorted to paying for them second-hand. One UK collector, Ashley Bushey, said she spent more than £1,000 on 13 Labubu toys, after spending hours scrolling on TikTok Shop, Vinted and Facebook re-sale groups. In July, a limited edition Labubu made in collaboration with the shoe brand Vans sold for $10,585 (£7,844) on eBay - the highest any had sold on the secondary market, according to Forbes. Fake Labubu monsters could cause real danger Labubu knock-offs labelled \"Lafufus\" have started being produced to capitalise on the real toy's popularity, but both the UK's Trading Standards and the US government have warned that they could be dangerous. They have said that without proper safety checks, the counterfeit toys may contain choking hazards, toxic materials, or faulty components that put children at serious risk. The Trading Standards has seized thousands of unsafe counterfeit Labubu dolls in recent weeks - with over 2,000 confiscated from 13 retailers in North Tyneside in just one month, the Chartered Trading Standards Institute (CTSI) said."
    }
]