[
    {
        "title": "US President Donald Trump says he 'may or may not' strike Iran as Israel's air war continues",
        "description": "US President Donald Trump says he has yet to decide whether the US will join Israel militarily in its campaign against Iran.",
        "url": "https://news.sky.com/story/us-president-donald-trump-says-he-may-or-may-not-strike-iran-as-israels-air-war-continues-13385686",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-white-house-donald-trump_6945297.jpg?20250618155635",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-18 23:00:00",
        "Headline": "As the world keeps guessing whether the US president will intervene against Iran, Mr Trump has said \"nobody knows\" what he will do, adding Iran has \"got a lot of trouble\".",
        "Content": " US President Donald Trump says he has yet to decide whether the US will join Israel militarily in its campaign against Iran. Asked whether the US was getting closer to striking Iran's nuclear facilities, Mr Trump said: \"I may do it. I may not do it.\" Speaking outside the White House on Wednesday, he added: \"Nobody knows what I'm going to do...Iran's got a lot of trouble, and they want to negotiate. \"And I said, 'why didn't you negotiate with me before all this death and destruction?'\" Mr Trump said Iran had reached out to Washington, a claim Tehran denied, with Iran's mission to the UN responding: \"No Iranian official has ever asked to grovel at the gates of the White House.\" Iran's supreme leader, Ayatollah Ali Khamenei said Iran would not surrender and warned \"any US military intervention will undoubtedly cause irreparable damage\" to US-Iranian relations. Read more:Why did Israel attack Iran? \n                  The speed at which Israel 'took down' Iranian air defences was 'shocking', ex-Mossad intelligence chief claims\n                 \n                  US moving warplanes to Middle East in 'demonstration of force' - this is the aircraft to watch\n                 \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                  Strikes continue Hundreds have reportedly died since Iran and Israel began exchanging strikes last Friday, when Israel launched an air assault after saying it had concluded Iran was on the verge of developing a nuclear weapon, a claim Tehran denies. Israel launched three waves of aerial attacks on Iran in the last 24 hours, military spokesman Brigadier General Effie Defrin has said. Israel deployed dozens of warplanes to strike over 60 targets in Tehran and western Iran, including missile launchers and missile-production sites, he said.  \"The aim of the operation is to eliminate the existential threat to the State of Israel, significantly damage Iran's nuclear programme in all its components, and severely impact its missile array,\" he said. Early on Thursday Israel issued an evacuation warning to residents of the Iranian Arak and Khandab regions where Iran has heavy water reactor facilities. Heavy water is important in controlling chain reactions in the production of weapons grade plutonium. Meanwhile Iran says it has arrested 18 people it describes as \"enemy agents\" who it says were building drones for the Israelis in the northern city of Mashhad. Iran also launched small barrages of missiles at Israel on Wednesday with no reports of casualties. Israel has now eased some restrictions for its civilians. Read more:Trump's words designed to stoke tension, confuse and apply intense pressure on IranMAGA civil war breaks out over Trump's potential decision to join conflict with Iran The US is working to evacuate its citizens from Israel by arranging flights and cruise ship departures, the US ambassador to the country has said. In the UK, Sir Keir Starmer chaired a COBRA emergency meeting on the situation in the Middle East, with a Downing Street spokesperson saying: \"Ministers were updated on efforts to support British nationals in region and protect regional security, as well as ongoing diplomatic efforts\"."
    },
    {
        "title": "Crucial evidence in Post Office scandal found in garage of retired computer expert after 30 years",
        "description": "A damning report into the faulty Post Office IT system that proceeded Horizon has been unearthed after nearly 30 years - and it could help overturn criminal convictions.",
        "url": "https://news.sky.com/story/crucial-evidence-in-post-office-scandal-found-in-garage-of-retired-computer-expert-after-30-years-13385460",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-post-office-robinson_6945431.jpg?20250618183025",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-18 11:21:00",
        "Headline": "Capture was a piece of accounting software, likely to have caused errors, used in more than 2000 branches between 1992 and 1999.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  A damning report into the faulty Post Office IT system that proceeded Horizon has been unearthed after nearly 30 years - and it could help overturn criminal convictions. The document, known about by the Post Office in 1998, is described as \"hugely significant\" and a \"fundamental piece of evidence\" and was found in a garage by a retired computer expert. Capture was a piece of accounting software, likely to have caused errors, used in more than 2,000 branches between 1992 and 1999. It came before the infamous faulty Horizon software scandal, which saw hundreds of sub postmasters wrongfully convicted between 1999 and 2015.  The 'lost long' Capture documents were discovered in a garage by a retired computer expert who came forward after a Sky News report into the case of Patricia Owen, a convicted sub postmistress who used the software. Adrian Montagu was supposed to be a key witness for Pat's defence at her trial in 1998 but her family always believed he had never turned up, despite his computer \"just sitting there\" in court. Mr Montagu, however, insists he did attend. He describes being in the courtroom and adds that \"at some point into the trial\" he was stood down by the barrister for Mrs Owen with \"no reason\" given. Sky News has seen contemporaneous notes proving Mr Montagu did go to Canterbury Crown Court for the first one or two days of the trial in June 1998. \"I went to the court and I set up a computer with a big old screen,\" he says. \"I remember being there, I remember the judge introducing everybody very properly…but the barrister in question for the defence, he went along and said 'I am not going to need you so you don't need to be here any more'. \"I wasn't asked back.\" Sky News has reached out to the barrister in Pat Owen's case who said he had no recollection of it. 'An accident waiting to happen' The report, commissioned by the defence and written by Adrian Montagu and his colleague, describes Capture as \"an accident waiting to happen\", and \"totally discredited\". It concludes that \"reasonable doubt exists as to whether any criminal offence has taken place\". It also states that the software \"is quite capable of producing absurd gibberish\", and describes \"several insidious faults…which would not be necessarily apparent to the user\". All of which produced \"arithmetical or accounting errors\". Sky News has also seen documents suggesting the jury in Pat Owen's case may never have seen the report. What is clear is that they did not hear evidence from its author including his planned \"demonstration\" of how Capture could produce accounting errors. Pat Owen was convicted of stealing from her Post Office branch in 1998 and given a suspended prison sentence. Her family describe how it \"wrecked\" her life, contributing towards her ill health, and she died in 2003 before the wider Post Office scandal came to light. Her daughter Juliet said her mother fought with \"everything she could\". \"To know that in the background there was Adrian with this (report) that would have changed everything, not just for mum but for every Capture victim after that, I think is shocking and really upsetting - really, really upsetting.\" The report itself was served on the Post Office lawyers - who continued to prosecute sub postmasters in the months and years after Pat Owen's trial. 'My blood is boiling'  Steve Marston, who used the Capture software in his branch, was one of them - he was convicted of stealing nearly £80,000 in September 1998. His prosecution took place four months after the Capture report had been served on the Post Office. Steve says he was persuaded to plead guilty with the \"threat of jail\" hanging over him and received a suspended sentence. He describes the discovery of the report as \"incredible\" and says his \"blood is boiling\" and he feels \"betrayed\". \"So they knew that the software was faulty?,\" he says. \"It's in black and white isn't it? And yet they still pressed on doing what they did. \"They used Capture evidence … as the evidence to get me to plead guilty to avoid jail. \"They kept telling us it was safe…They knew the software should never have been used in 1998, didn't they?\" Steve says his family's lives were destroyed and the knowledge of this report could have \"changed everything\". He says he would have fought the case \"instead of giving in\". \"How dare they. And no doubt I certainly wasn't the last one…And yet they knew they were convicting people with faulty software, faulty computers.\" The report is now with the Criminal Cases Review Commission, the body investigating potential miscarriages of justice, which is currently looking into 28 Capture cases. A fundamental piece of evidence Neil Hudgell, the lawyer representing more than 100 victims, describes the report as \"hugely significant\", \"seismic\" and a \"fundamental piece of evidence\". \"I'm as confident as I can be that this is a good day for families like Steve Marston and Mrs Owen's family,\" he says. \"I think (the documents) could be very pivotal in delivering the exoneration that they very badly deserve.\" He also added that \"there's absolutely no doubt\" that the \"entire contents\" of the \"damning\" report \"was under the noses of the Post Office at a very early stage\". He describes it as a \"massive missed opportunity\" and \"early red flag\" for the Post Office which went on to prosecute hundreds who used Horizon in the years that followed. Read more from Sky News:Sir Alan Bates attacks 'kangaroo court' Post Office schemeWidow received compensation letter days after his death \"It is a continuation of a theme that obviously has rolled out over the subsequent 20 plus years in relation to Horizon,\" he says. \"...if this had seen the light of day in its proper sense, and poor Mrs Owen had not been convicted, the domino effect of what followed may not have happened.\" What the Post Office said Sky News approached the former Chief Executive of the Post Office during the Capture years, John Roberts, who said: \"I can't recall any discussion at my level, or that of the board, about Capture at any time while I was CEO.\" A statement from the Post Office said: \"We have been very concerned about the reported problems relating to the use of the Capture software and are sincerely sorry for past failings that have caused suffering to postmasters. \"We are determined that past wrongs are put right and are continuing to support the government's work and fully co-operating with the Criminal Cases Review Commission as it investigates several cases which may be Capture related.\" A Department for Business and Trade spokesperson said: \"Postmasters including Patricia Owen endured immeasurable suffering, and we continue to listen to those who have been sharing their stories on the Capture system. \"Government officials met with postmasters recently as part of our commitment to develop an effective and fair redress process for those affected by Capture, and we will continue to keep them updated.\""
    },
    {
        "title": "I felt I had to go back to help Gaza's hospitals, says British plastic surgeon",
        "description": "Dr Victoria Rose is a consultant plastic surgeon who worked in Gaza hospitals for two separate periods last year. This is her first-hand story of the war in Gaza.",
        "url": "https://news.sky.com/story/i-felt-i-had-to-go-back-to-help-gazas-hospitals-says-british-plastic-surgeon-13385666",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dr-victoria-rose-gaza_6945534.jpg?20250618214244",
        "type": "Home",
        "Author": "Dr Victoria Rose, consultant plastic surgeon",
        "Date Published": "2025-06-18 20:24:00",
        "Headline": "The aim was to deliver essential surgical equipment and assist colleagues with the increasing trauma workload they faced. But as the war progressed, it became apparent that I had a third objective: to bear witness.",
        "Content": "By Dr Victoria Rose, consultant plastic surgeon   Dr Victoria Rose is a consultant plastic surgeon who worked in Gaza hospitals for two separate periods last year. This is her first-hand story of the war in Gaza. The word \"dire\" does not adequately describe the situation in Gaza's hospitals. On a daily basis when I was working there, I had a list of at least 10 patients, and 60% of them were under the age of 15. These were tiny children with life-threatening burns and limbs blown off, often losing significant family members in the attacks and left to cope with their life-changing injuries alone. I first joined the charity IDEALS, which helps medical professionals during crises, in Gaza in 2019. I returned last year, working with orthopaedic surgeons. I felt compelled to go back after becoming aware that a plastic surgeon from Gaza who trained with me in London had been inundated with complex trauma cases since the war broke out in October 2023. Our aim was to deliver essential surgical equipment and assist our colleagues with the increasing trauma workload they faced. But as the war progressed, it became apparent that we had a third objective: to bear witness. I worked at the European Gaza Hospital in March 2024 and then returned in August of that year for a month, working at Nasser Hospital. The transformation of the landscape during these two visits was staggering. The streets were unrecognisable, just pile after pile of dust and rubble. Such a scale of destruction could only be justified if every single building in Gaza was part of Hamas's infrastructure. In February 2024, we were denied entry by COGAT – part of the Israel Defence Forces (IDF) controlling activities in the occupied territories – which, regrettably, has become a standard outcome for 50% of foreign doctors attempting to gain access. However, we managed to regain access in May. This mission was intended to last four weeks at the European Gaza Hospital. However, due to its bombing on the day we arrived and its subsequent decommissioning by the IDF, we were redirected to Nasser for three and a half weeks. The population had now been relentlessly displaced, bombed in their tents, deprived of water and sanitation, and ultimately starved. I remember thinking it couldn't get any worse – and then they cut the internet. We ploughed on without essential equipment such as painkillers and antibiotics, patching the patients up, knowing that they were likely to be bombed again. When we left the hospital we went into the red zone – an area of active fighting that needed to be evacuated. This meant that nothing could enter without the journey being \"deconflicted\" by the IDF. Minimal journeys have thus far been deconflicted. Patients struggle to gain entry, and staff cannot leave, as equipment continues to be depleted. Nasser is the only hospital in the south equipped with a CT scanner, a blood bank, ICU capabilities and an oxygen generator. I work with two orthopaedic surgeons who run the IDEALS charity. They have been travelling to Gaza since 2009. IDEALS started the lower limb reconstruction programme in 2013, visiting Gaza every other month and bringing four orthopaedic surgeons back to the UK for short periods of training. In 2021, I arranged for a plastic surgeon from Gaza to come to London to train with me. He was an incredible trainee and returned to Gaza in February 2023 to take up the post of chief of plastic surgery at Shifa Hospital.  Shortly after the war broke out, I felt compelled to help him. All eyes are now on Israel's next move. Gaza: Doctors On The Frontline will air on Sky News at 9pm on 19 June"
    },
    {
        "title": "Israel's block on international journalists in Gaza should not be allowed to stand",
        "description": "On Sky News this week we're showing a film about Israel's war in Gaza which has now been going on for more than 620 days.",
        "url": "https://news.sky.com/story/israels-block-on-international-journalists-in-gaza-should-not-be-allowed-to-stand-13385627",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-jonathan-levy-sky-news_6071526.jpg?20230227090103",
        "type": "Home",
        "Author": "Jonathan Levy",
        "Date Published": "2025-06-18 17:51:00",
        "Headline": "The ongoing denial of access feels much less about the safety of journalists and more about preventing proper scrutiny and accountability of the desperate situation there.",
        "Content": "\n          Executive Editor and Managing Director\n        On Sky News this week we're showing a film about Israel's war in Gaza which has now been going on for more than 620 days. It is a chastening watch. Swathes of Gaza's medical infrastructure have been razed, many of the territory's buildings have been destroyed, and tens of thousands of Gazans have been killed, maimed and left hungry and malnourished in a war fought mainly from the air with heavy ordinance dropped on crowded civilian areas. These extraordinary eyewitness accounts are not brought to our screens by experienced international war correspondents - they are barred from entering Gaza - but by two British medics whose mission was to save lives not to report on the horrors of war. That visiting surgeons Victoria Rose and Tom Potokar felt compelled to do just that, speaks not only to the tragedy unfolding in Gaza, but to the swingeing restrictions imposed on reporting what is happening there. In the history of modern warfare, the presence of journalists on the battlefield has been essential in holding the combatants to account and ensuring that war crimes and atrocities are uncovered and prevented. And Israel stands accused of egregious crimes in Gaza. Since it launched its war there in response to the Hamas terror attacks of October 7th 2023, in which around 1,200 Israelis and other nationals were murdered and a further 250 taken hostage, more than 55,000 Palestinians have been killed according to the Gazan health authorities. Many of the dead have been women and children. Earlier this month, former US State Department official Matt Miller told the Sky News Trump100 podcast that Israel had committed war crimes in Gaza. Ex-UN humanitarian chief Martin Griffiths went further, telling Sky News presenter Yalda Hakim that Israel is responsible for genocide there. It's an accusation supported by Ireland, Spain, and South Africa which is pursuing Israel for genocide at the International Court of Justice - the UN's highest court. Israel rejects the case against it, claiming that many of the dead are Hamas fighters who have been hiding in tunnels under the hospitals that it has the right to attack in self-defence. Israeli officials and diplomats deny that its military targets women and children and react with outrage to the suggestion that it is responsible for ethnic cleansing or genocide - accusations of crimes against humanity that are taken as particularly loaded given the dark resonance they have for the Jewish people. But Israel's confidence in the integrity of its wartime conduct is not matched by a willingness to allow international journalists into Gaza to witness what is going on there for themselves. Military-organised 'embeds' fall well short of independent journalism For the course of its longest war, no reporters have been permitted entry to Gaza other than on organised and controlled 'embeds' of a few hours alongside Israeli soldiers. These managed opportunities fall well short of independent journalism, for which Sky News and other global news organisations must rely on trusted and heroic local reporting teams who lack the support and infrastructure to provide a complete picture of what is going on. And these Palestinian journalists have paid a heavy price for their work; according to the Committee to Protect Journalists, 185 of them have been killed during the war and 86 imprisoned. The Foreign Press Association, which represents the interests of international journalists operating in Israel, has been petitioning its High Court of Justice to lift the ban on reporting independently from Gaza. So far, that legal action has been unsuccessful and last month the court again postponed a hearing in the case without reason or setting a new date. Israeli officials push back on the need and suitability of allowing journalists to operate independently in Gaza. They say that their military's priority is the rescue of the remaining hostages and the fight against Hamas and that the safety of reporters could not be ensured. But journalists from Sky News and fellow news organisations have operated in Gaza in previous conflicts, providing details of their location and movements to the Israel Defence Forces. 'We accept the risks' Moreover, we have decades of experience of covering conflict zones and our reporters are highly trained at doing so. The risks are real, for sure. But they're risks that we accept. It's what we do. The ongoing denial of access to Gaza feels much less about the safety of journalists and more about preventing proper scrutiny and accountability of the desperate situation there. The barring of international journalists is accompanied by the active delegitimisation of what reporting on the war has been possible which is often shamefully labelled as anti-Semitic and compared to the darkest periods in Jewish history. All together this constitutes a war on truth that is at odds with Israel's proud and oft-repeated claim to be the Middle East's only democracy and it should not be allowed to stand. Gaza: Doctors On The Frontline will air on Sky News at 9pm on 19 June"
    },
    {
        "title": "Why I'm praying assisted dying bill passes major vote - even though it's not going to happen in my lifetime",
        "description": "On Friday, the social fabric of England and Wales might be changed forever.",
        "url": "https://news.sky.com/story/why-im-praying-assisted-dying-bill-passes-major-vote-even-though-its-not-going-to-happen-in-my-lifetime-13385681",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ashish-joshi-assisted-dying_6945579.jpg?20250618231453",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-06-18 21:37:00",
        "Headline": "Supporters are confident they have the numbers to win. However, the hugely controversial legislation polarises opinion. Communities remain divided, and medical colleagues can't agree.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n On Friday, the social fabric of England and Wales might be changed forever. MPs are set to vote on the assisted dying bill and supporters are confident that they have the numbers to win. But the hugely controversial legislation polarises opinion. Communities remain divided, and medical colleagues can't agree. Three royal colleges have withdrawn support for the bill in its current form. They want more time to be given for further scrutiny of the legislation.  Frank Sutton does not have time. When we went to Frank's home in East Dulwich, London, last November to watch the vote unfold she already had terminal liver disease and cancer. As the vote was passed with a majority of 55, Frank broke down in tears and said: \"Finally, I can die in peace.\" Frank is unlikely to live long enough to see assisted dying introduced in England and Wales. If the legislation passes, it will be introduced in four years. \n                  Assisted dying bill does 'not meet needs of patients', says Royal College of Psychiatrists\n                 \n                  Palpable anger as both sides of assisted dying debate gather in Parliament Square\n                 \n                  MPs to vote again on Assisted Dying Bill - will it pass and what has changed?\n                 Frank now suffers from diabetes and fibromyalgia. She said: \"On top of everything I've got, to start developing more comorbidities, I have a massive thought in my head, which I live with every day, which is, is my body, am I on the road to the end, you know, is my body just giving up? \"I mean, I was taking morphine anyway for pain, but now I'm living on morphine, and that's not a life that you want.\" But even as MPs prepare to vote, many important questions remain over who will take responsibility for determining a patient's mental capacity and their prognosis. The Royal College of Psychiatrists said it was approaching Friday \"with trepidation\". Read more:Psychiatrists criticise billPalpable anger as both sides of debate gather Dr Annabel Price, the RCPsych's lead on assisted dying, told Sky News: \"If this bill as it stands proceeds through the rest of the parliamentary process, we as psychiatrists are left in a situation where there are so many unknowns about what is expected of us, about what patients can expect and about the safety of the process. \"We will continue to engage and there may be opportunities for reconsideration at further points in the bill. But yes, I approach this professionally with trepidation.\" The Royal College of GPs says the assisted dying process should happen outside of general practice. Dr Susi Caesar is in favour of the bill being passed and feels it is okay for the medical community to be so divided on the issue. She said: \"I think people have the right to make their own choices and absolutely I would not want to see anybody forced into being part of this process who didn't. Our current system is broken and this law would go a long way towards fixing it, at least for a certain group of people.\"  But the Royal Colleges of Physicians (RCP) also has reservations about the bill in its current form. It says it would be hard for a panel of experts who have no connection to a patient requesting an assisted death to determine if the person is being coerced or has mental capacity. Dr John Dean, clinical vice president at the RCP has concerns, saying: \"Currently decisions clearly are made by patients but agreed by single doctors and then the social worker and psychiatrists are not meeting the patient and those that have been caring for them. \"This has to be done in keeping with modern clinical practice which is complex decisions made with patients and families by teams.\" But for patients like Frank, these concerns have not changed her mind. She said: \"I'm praying for Friday that it still goes through because, like I said, it's not going to happen in my lifetime, but the thought that people like me who still try to look nice, who still tried to have a life and everything, that they can just have some peace of mind and they can have a weight lifted off their shoulders knowing that they're going to be able to do it peacefully with their family.\""
    },
    {
        "title": "Sharing deepfake pornography 'the next sexual violence epidemic facing schools'",
        "description": "Sharing deepfake pornography is \"the next sexual violence epidemic\" facing schools, the author of a book on the spread of online misogyny has told MPs.",
        "url": "https://news.sky.com/story/sharing-deepfake-pornography-the-next-sexual-violence-epidemic-facing-schools-13385659",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-06-18 20:16:00",
        "Headline": "Author Laura Bates tells MPs schools have paid PR firms to deal with the fallout but have not done anything to protect the victims or punish the perpetrator. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sharing deepfake pornography is \"the next sexual violence epidemic\" facing schools, the author of a book on the spread of online misogyny has told MPs. Appearing before the Women and Equalities Committee (WEC), Laura Bates said there needs to be statutory guidance for teachers on how to deal with this \"very significant issue\". She said in every UK case she has investigated, schools have \"paid thousands of pounds hiring PR firms to focus on damage reputation management\". However, in terms of supporting girls and taking action against the perpetrators, \"nothing has happened\". She said of deepfake pornography: \"It is happening, it's significant. Female teachers are affected, which often goes unnoticed, and schools are just not equipped to tackle it. \"My suggestion would be this is the next big sexual violence epidemic facing schools and people don't even know it is going on.\" Deepfakes are pictures, videos or audio clips made with Artificial Intelligence (AI) to look or sound real. While it is illegal to create or share a sexually explicit image of a child, including a deepfake, the technology for making them remains legal. Asked what more could be done to help schools tackle the issue, Ms Bates said in the cases she is aware of \"police investigations are ongoing\" . However, she said she is not suggesting criminalisation of underage boys is the solution and what is needed is education, prevention and regulation. \"It shouldn't be the case that a 12-year-old boy can easily and freely access tools to create these forms of content in the first place,\" she said. Ms Bates is the founder of the Everyday Sexism project and author of: The New Age of Sexism: How the AI Revolution is Reinventing Misogyny. She also called for \"very clear guidance\" on how schools should respond to this challenge. She warned of a repeat of failings that have happened previously with intimate image abuse, where girls have been \"coerced into sending images of themselves\" then punished for taking the image once it has been shared around - but the person spreading the image has not. Calls to ban 'nudifying apps' A government spokesperson told Sky News: \"We are reviewing the relationships, sex and health curriculum to look at all modern-day challenges facing children, including that of deepfake porn, and work to ensure children are taught how to build positive, healthy relationships in an age-appropriate way.\" It comes amid mounting concern among MPs and experts about online safety for children, with many wanting the government to go further with its regulations on big tech firms. Read More:Ofcom sets out new codes of practice to protect children onlineCan Adolescence change the rise of the 'manosphere'? In April, a report by the Children's Commissioner for England found that nudifying apps are disproportionately targeting girls and young women, with many appearing to work only on female bodies. The commissioner, Dame Rachel de Souza, called for an immediate ban on apps that use AI to create naked images of children, saying \"there is no positive reason for these to exist\". Inquiry into the 'manosphere' Ms Bates appeared in front of the WEC as part of their inquiry into how the \"manosphere\" and other online content is fuelling misogyny. The cross-party group has previously heard how the rise of misogyny in young men in particular is not only affecting female pupils but also female staff, with sexual harassment towards teachers described as \"rife\". On Wednesday's session, the committee also heard concerns around the rise of the \"sex tech industry\", including robots and AI girlfriends, with fears this is having a wider impact on attitudes towards women and girls. Sarah Owen, the Labour chair of the WEC, told Sky News she could not pre-empt what recommendations would be made to the government. But she said there was huge concern around the online radicalisation of young men, adding: \"It was a boiling hot room but my blood ran cold at what I was hearing.\""
    },
    {
        "title": "Thousands of deaths in 2025 will be linked to air pollution, report warns",
        "description": "Around 30,000 deaths will be linked to toxic air in the UK in 2025, according to a report from leading doctors, as they urged the government to \"recognise air pollution as a key public health issue\".",
        "url": "https://news.sky.com/story/thousands-of-deaths-in-2025-will-be-linked-to-air-pollution-report-warns-13385661",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-pollution-canary_6945536.jpg?20250618214600",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-18 20:12:00",
        "Headline": "The report by the Royal College of Physicians warned there is \"no safe level\" of air pollutants as it noted how exposure to air pollution can shorten one's life by 1.8years. ",
        "Content": "Around 30,000 deaths will be linked to toxic air in the UK in 2025, according to a report from leading doctors, as they urged the government to \"recognise air pollution as a key public health issue\". The Royal College of Physicians (RCP) warned that around 99% of the population in the UK are breathing \"toxic air\". The report says there is \"no safe level\" of air pollutants while noting how exposure to air pollution can shorten life by 1.8 years on average. That is \"just behind some of the leading causes of death and disease worldwide\", including cancer and smoking, the authors wrote. The college has called on the government to take action to tackle the issue, as it urged ministers to \"recognise air pollution as a key public health issue\". In the forward of the report, England's chief medical officer, Professor Sir Chris Whitty, said: \"Air pollution remains the most important environmental threat to health, with impacts throughout the life course. \"It is an area of health where the UK has made substantial progress in the last three decades with concentrations of many of the main pollutants falling rapidly, but it remains a major cause of chronic ill health as well as premature mortality. \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  ULEZ lowers air pollution most in London boroughs that opposed it, data reveals\n                 \n                  'Rainmakers' and transboundary smog - Thailand's struggling battle against air pollution\n                 \"Further progress in outdoor air pollution will occur if we decide to make it, but will not happen without practical and achievable changes to heating, transport and industry in particular. \"Air pollution affects everybody, and is everybody's business.\" Read more from Sky News:US senator claims Iran is building missiles that can 'murder Americans'Moscow switches to crisis mode after Trump's Iran threats The report also highlights the economic impact of air pollution as it has an estimated cost of £27bn a year in healthcare costs and productivity losses. Dr Mumtaz Patel, president of the RCP, said: \"Air pollution can no longer be seen as just an environmental issue - it's a public health crisis. \"We are losing tens of thousands of lives every year to something that is mostly preventable and the financial cost is a price we simply cannot afford to keep paying. \"We wouldn't accept 30,000 preventable deaths from any other cause. We need to treat clean air with the same seriousness we treat clean water or safe food. It is a basic human right - and a vital investment in our economic future.\""
    },
    {
        "title": "Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow ",
        "description": "Russia is getting nervous about Donald Trump's trigger finger, and it shows.",
        "url": "https://news.sky.com/story/donald-trumps-comments-about-getting-involved-in-israel-iran-conflict-are-raising-alarm-bells-in-moscow-13385508",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6945213.jpg?20250618143945",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-18 12:55:00",
        "Headline": "Russia's ties with Tehran have deepened since the Kremlin's invasion of Ukraine. But now its leadership is switching to crisis mode amid fears about the future of the alliance.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Russia is getting nervous about Donald Trump's trigger finger, and it shows. Comments from deputy foreign minister Sergei Ryabkov – warning the US against joining Israel's military campaign – betray Moscow's growing unease that it could be about to lose its closest Middle Eastern ally. Russia has strong ties with Iran, which have deepened since the Kremlin's invasion of Ukraine. These were formalised in a strategic partnership pact the two countries signed at the start of the year. Israel-Iran conflict - live updates So, at first, Russia seemed to view its ally's conflict with Israel as an opportunity to gain leverage. The Kremlin was quick to offer its services as a potential mediator. If Vladimir Putin could persuade Tehran to back down and return to nuclear talks with Washington, he'd potentially have a favour to cash in with the White House over its military support for Ukraine. But the offers to mediate fell on deaf ears. And with Mr Trump threatening to assassinate Iran's supreme leader, Moscow has switched to crisis mode – fearful of losing its second key regional ally in six months, after the fall of the Assad regime in Syria. So, as well as Ryabkov, other senior figures have taken to the airwaves. Russia's spy chief Sergei Naryshkin called the situation \"critical\".  Read more:Who has been targeted in Iran?How the conflict escalated And, according to ministry of foreign affairs spokeswoman Maria Zakharova, the world is \"millimetres away from catastrophe\" due to Israeli strikes on Iran's nuclear facilities. It's quite the spectacle – a country that's been waging war on its neighbour for more than three years is now urging others to show military restraint. That's because US involvement poses serious consequences, not just for Iran, but for Russia too. But none here would be drawn on what Moscow would do if Trump does bomb Tehran. The notoriously outspoken Ms Zakharova was unusually tight-lipped on that particular question when I caught up with her at the St Petersburg International Economic Forum. She wasn't even able to say whether it would constitute an escalation, when the whole world can see that it would. That's because Russian officials are in an unfamiliar position - caught between a long-time ally and the country whose affections they're courting. Hence the reluctance to directly criticise Trump. I think they're also waiting to see what Russia's president will say, when he addresses news agencies later on Wednesday evening. So far, in public at least, he's remained silent."
    },
    {
        "title": "British woman dies from rabies - as family speak out to 'prevent this happening to others'",
        "description": "A British grandmother has died after contracting rabies from a \"slight scratch\" from a puppy during a holiday in Morocco, her family has said. ",
        "url": "https://news.sky.com/story/person-dies-in-yorkshire-from-rabies-after-contact-with-stray-dog-while-on-holiday-in-morocco-13382055",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-yvonne-ford-rabies_6945249.jpg?20250618151324",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-18 07:00:00",
        "Headline": "There have been six cases of human rabies associated with animal exposure abroad that have been reported in the UK between 2000 and 2024.",
        "Content": " A British grandmother has died after contracting rabies from a \"slight scratch\" from a puppy during a holiday in Morocco, her family has said.  Yvonne Ford's daughter said she travelled to the North African country in February but did not become ill until two weeks ago. Robyn Thomson said in a Facebook post: \"Our family is still processing this unimaginable loss, but we are choosing to speak up in the hope of preventing this from happening to others. \"She was scratched very slightly by a puppy in Morocco in February. At the time, she did not think any harm would come of it and didn't think much of it. \"Two weeks ago she became ill, starting with a headache and resulted in her losing her ability to walk, talk, sleep, swallow. Resulting in her passing.\" Ms Ford, from Barnsley, South Yorkshire, was diagnosed with the virus at Barnsley Hospital. The UK Health Security Agency (UKHSA) said health workers and close contacts were being assessed and offered vaccination when necessary. It said there was no risk to the wider public because there is no evidence rabies can be transmitted between people. Rabies is caused by a virus invading the central nervous system. It is spread by mammals - such as cats, dogs, bats, raccoons and foxes - but in the UK it's only found in some bats, according to the NHS. Once symptoms appear, it is almost always fatal, according to the World Health Organisation (WHO). The first symptoms can mirror a flu, while later symptoms include numbness or tingling in the affected area, hallucinations, anxiety, difficulty swallowing or breathing, nausea, vomiting, agitation, excessive saliva and paralysis. But if seen to promptly after a bite, scratch or lick by an animal that may carry the virus, treatment is usually very effective at preventing the condition. Treatment usually involves two or more doses of the rabies vaccine or a medicine called rabies immunoglobulin, which is a liquid administered to the wound and is only required if the patient has not had the rabies vaccine or has a weakened immune system. The rabies vaccine is recommended if you're travelling to a part of the world where rabies is more common. Around 60,000 people die every year from rabies worldwide, with the majority in Africa and Asia, according to the WHO.  Read more about rabies, and how to avoid getting it, here. Dr Katherine Russell at the UKHSA said: \"I would like to extend my condolences to this individual's family at this time. \"If you are bitten, scratched or licked by an animal in a country where rabies is found then you should wash the wound or site of exposure with plenty of soap and water and seek medical advice without delay in order to get post-exposure treatment to prevent rabies.\" The UKHSA urges travellers to rabies-affected countries, for example in Asia and Africa, to avoid contact with dogs, cats and other animals wherever possible and check whether a vaccination is needed before travelling. Read more from Sky News:Met Office: UK could see temperatures of 46CKneecap rapper appears in court on terror charge There have been six cases of human rabies associated with animal exposure abroad that have been reported in the UK between 2000 and 2024. This includes a case in 2012, when a UK resident died after being bitten by a dog - the most common source of infection in most parts of the world - in South Asia. The latest case was in 2018, when another Briton died after being bitten by a cat in Morocco. Latest World Health Organisation figures show a number of deaths from rabies in Morocco have been reported every year from 2010 to 2022. Rabies does not circulate in either wild or domestic animals in the UK, although some species of bats can carry a rabies-like virus. No human cases of rabies acquired in the UK from animals other than bats have been reported since 1902."
    },
    {
        "title": "British survivor of Air India crash carries brother's coffin after being discharged from hospital",
        "description": "A British man who was the sole survivor of the Air India crash in Ahmedabad has been discharged from hospital, the airline has confirmed.",
        "url": "https://news.sky.com/story/british-survivor-of-air-india-crash-discharged-from-hospital-airline-confirms-13385528",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/03bef406ba37f17955c4b250cd291e088e5b041fafc7dee93adf5148816190bf_6945243.jpg?20250618150931",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-18 13:30:00",
        "Headline": "After leaving hospital, Vishwash Kumar Ramesh attended the funeral of his brother - one of the 241 people killed on Flight AI171 to Gatwick - as UK experts help investigate the cause of the crash.",
        "Content": " A British man who was the sole survivor of the Air India crash in Ahmedabad has been discharged from hospital, the airline has confirmed. Vishwash Kumar Ramesh, 40, has since been seen in video as a pallbearer at the funeral in western India for his brother Ajay - one of the 241 people killed in the crash. At least 30 people also died on the ground as the Boeing 787-8 Dreamliner struck a medical college hostel shortly after take-off from the airport in the state of Gujarat on Thursday. In a statement, Air India said it was \"in mourning for the tragic loss\" of passengers and crew aboard Flight AI171 and is in contact with relatives of those killed, including 52 British nationals. It said it was working to repatriate the deceased to the UK and other parts of the world, adding: \"The sole survivor of the accident, also a British national, has been discharged from hospital.\" \"The investigation is ongoing,\" it said. \"We are cooperating with all parties involved and are committed to sharing verified information and will continue to provide updates wherever we can.\" On Flight AI171 to Gatwick, there were 169 Indians, 53 Britons, seven Portuguese, and one Canadian among the passengers, along with 12 crew. The only survivor, Mr Ramesh, was in seat 11A, near the emergency exit. Speaking from his hospital bed on Friday, he explained how he \"managed to escape by jumping out the emergency door\". British response 'disorganised' The families of three people from Gloucester, who were killed in the crash, have issued a critical attack on the UK government's response, adding to comments on Monday that they \"felt utterly abandoned\". Husband and wife Akeel Nanabawa and Hannaa Vorajee were on a trip to India with their daughter Sara Nanabawa, who was four. The Nanabawa and Vorajee families described their \"immense loss\" and reflected on the \"beautiful memories we shared\". In a joint statement, they also expressed their frustration at British authorities. \"Regrettably, the recovery process itself was marred by a lack of basic coordination and proactive communication,\" they said. \"Rather than being guided with clarity and compassion, our families were left to navigate the process with minimal support... the British response on the ground was disorganised, understaffed, and clearly lacking the training and preparedness required for such a tragic situation,\" the statement said. In a statement, the Foreign Office said: \"Our thoughts are with the Nanabawa and Vorajee families, and all those who have lost loved ones, during this deeply distressing time. \"We continue to provide both families, along with all British nationals who have approached us, with direct assistance at the UK's reception centre in Ahmedabad and are working at pace with the local authorities to provide affected families with the support they need, as we have done every day since the crash.\" Read more:Families 'feel utterly abandoned'Who are some of the victims?Survivor's brother describes horror Dozens of anxious family members are waiting to collect the bodies of loved ones as doctors work to gather dental samples and perform DNA profiling to identify victims. Crash investigation continues Air India and the Indian government are looking at issues linked to engine thrust, flaps, and why the landing gear remained extended, or in the down position, after take-off.  Both the cockpit voice and flight data recorders, also called black boxes, have been recovered. They will be crucial to the crash investigation, in which air accident investigators from the UK and US will be taking part. India's aviation safety watchdog has asked Air India for the training records of the pilots and dispatchers, while an inspection of Air India's 787 fleet did not reveal any major issues. While there has not been an update on the possible cause of the crash, Indian officials have raised concerns about recent maintenance-related issues reported by the airline and advised the carrier to \"strictly adhere to regulations\"."
    },
    {
        "title": "Crucial evidence in Post Office scandal found in garage of retired computer expert after 30 years",
        "description": "A damning report into the faulty Post Office IT system that proceeded Horizon has been unearthed after nearly 30 years - and it could help overturn criminal convictions.",
        "url": "https://news.sky.com/story/crucial-evidence-in-post-office-scandal-found-in-garage-of-retired-computer-expert-after-30-years-13385460",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-post-office-robinson_6945431.jpg?20250618183025",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-18 11:21:00",
        "Headline": "Capture was a piece of accounting software, likely to have caused errors, used in more than 2000 branches between 1992 and 1999.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  A damning report into the faulty Post Office IT system that proceeded Horizon has been unearthed after nearly 30 years - and it could help overturn criminal convictions. The document, known about by the Post Office in 1998, is described as \"hugely significant\" and a \"fundamental piece of evidence\" and was found in a garage by a retired computer expert. Capture was a piece of accounting software, likely to have caused errors, used in more than 2,000 branches between 1992 and 1999. It came before the infamous faulty Horizon software scandal, which saw hundreds of sub postmasters wrongfully convicted between 1999 and 2015.  The 'lost long' Capture documents were discovered in a garage by a retired computer expert who came forward after a Sky News report into the case of Patricia Owen, a convicted sub postmistress who used the software. Adrian Montagu was supposed to be a key witness for Pat's defence at her trial in 1998 but her family always believed he had never turned up, despite his computer \"just sitting there\" in court. Mr Montagu, however, insists he did attend. He describes being in the courtroom and adds that \"at some point into the trial\" he was stood down by the barrister for Mrs Owen with \"no reason\" given. Sky News has seen contemporaneous notes proving Mr Montagu did go to Canterbury Crown Court for the first one or two days of the trial in June 1998. \"I went to the court and I set up a computer with a big old screen,\" he says. \"I remember being there, I remember the judge introducing everybody very properly…but the barrister in question for the defence, he went along and said 'I am not going to need you so you don't need to be here any more'. \"I wasn't asked back.\" Sky News has reached out to the barrister in Pat Owen's case who said he had no recollection of it. 'An accident waiting to happen' The report, commissioned by the defence and written by Adrian Montagu and his colleague, describes Capture as \"an accident waiting to happen\", and \"totally discredited\". It concludes that \"reasonable doubt exists as to whether any criminal offence has taken place\". It also states that the software \"is quite capable of producing absurd gibberish\", and describes \"several insidious faults…which would not be necessarily apparent to the user\". All of which produced \"arithmetical or accounting errors\". Sky News has also seen documents suggesting the jury in Pat Owen's case may never have seen the report. What is clear is that they did not hear evidence from its author including his planned \"demonstration\" of how Capture could produce accounting errors. Pat Owen was convicted of stealing from her Post Office branch in 1998 and given a suspended prison sentence. Her family describe how it \"wrecked\" her life, contributing towards her ill health, and she died in 2003 before the wider Post Office scandal came to light. Her daughter Juliet said her mother fought with \"everything she could\". \"To know that in the background there was Adrian with this (report) that would have changed everything, not just for mum but for every Capture victim after that, I think is shocking and really upsetting - really, really upsetting.\" The report itself was served on the Post Office lawyers - who continued to prosecute sub postmasters in the months and years after Pat Owen's trial. 'My blood is boiling'  Steve Marston, who used the Capture software in his branch, was one of them - he was convicted of stealing nearly £80,000 in September 1998. His prosecution took place four months after the Capture report had been served on the Post Office. Steve says he was persuaded to plead guilty with the \"threat of jail\" hanging over him and received a suspended sentence. He describes the discovery of the report as \"incredible\" and says his \"blood is boiling\" and he feels \"betrayed\". \"So they knew that the software was faulty?,\" he says. \"It's in black and white isn't it? And yet they still pressed on doing what they did. \"They used Capture evidence … as the evidence to get me to plead guilty to avoid jail. \"They kept telling us it was safe…They knew the software should never have been used in 1998, didn't they?\" Steve says his family's lives were destroyed and the knowledge of this report could have \"changed everything\". He says he would have fought the case \"instead of giving in\". \"How dare they. And no doubt I certainly wasn't the last one…And yet they knew they were convicting people with faulty software, faulty computers.\" The report is now with the Criminal Cases Review Commission, the body investigating potential miscarriages of justice, which is currently looking into 28 Capture cases. A fundamental piece of evidence Neil Hudgell, the lawyer representing more than 100 victims, describes the report as \"hugely significant\", \"seismic\" and a \"fundamental piece of evidence\". \"I'm as confident as I can be that this is a good day for families like Steve Marston and Mrs Owen's family,\" he says. \"I think (the documents) could be very pivotal in delivering the exoneration that they very badly deserve.\" He also added that \"there's absolutely no doubt\" that the \"entire contents\" of the \"damning\" report \"was under the noses of the Post Office at a very early stage\". He describes it as a \"massive missed opportunity\" and \"early red flag\" for the Post Office which went on to prosecute hundreds who used Horizon in the years that followed. Read more from Sky News:Sir Alan Bates attacks 'kangaroo court' Post Office schemeWidow received compensation letter days after his death \"It is a continuation of a theme that obviously has rolled out over the subsequent 20 plus years in relation to Horizon,\" he says. \"...if this had seen the light of day in its proper sense, and poor Mrs Owen had not been convicted, the domino effect of what followed may not have happened.\" What the Post Office said Sky News approached the former Chief Executive of the Post Office during the Capture years, John Roberts, who said: \"I can't recall any discussion at my level, or that of the board, about Capture at any time while I was CEO.\" A statement from the Post Office said: \"We have been very concerned about the reported problems relating to the use of the Capture software and are sincerely sorry for past failings that have caused suffering to postmasters. \"We are determined that past wrongs are put right and are continuing to support the government's work and fully co-operating with the Criminal Cases Review Commission as it investigates several cases which may be Capture related.\" A Department for Business and Trade spokesperson said: \"Postmasters including Patricia Owen endured immeasurable suffering, and we continue to listen to those who have been sharing their stories on the Capture system. \"Government officials met with postmasters recently as part of our commitment to develop an effective and fair redress process for those affected by Capture, and we will continue to keep them updated.\""
    },
    {
        "title": "Why I'm praying assisted dying bill passes major vote - even though it's not going to happen in my lifetime",
        "description": "On Friday, the social fabric of England and Wales might be changed forever.",
        "url": "https://news.sky.com/story/why-im-praying-assisted-dying-bill-passes-major-vote-even-though-its-not-going-to-happen-in-my-lifetime-13385681",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ashish-joshi-assisted-dying_6945579.jpg?20250618231453",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-06-18 21:37:00",
        "Headline": "Supporters are confident they have the numbers to win. However, the hugely controversial legislation polarises opinion. Communities remain divided, and medical colleagues can't agree.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n On Friday, the social fabric of England and Wales might be changed forever. MPs are set to vote on the assisted dying bill and supporters are confident that they have the numbers to win. But the hugely controversial legislation polarises opinion. Communities remain divided, and medical colleagues can't agree. Three royal colleges have withdrawn support for the bill in its current form. They want more time to be given for further scrutiny of the legislation.  Frank Sutton does not have time. When we went to Frank's home in East Dulwich, London, last November to watch the vote unfold she already had terminal liver disease and cancer. As the vote was passed with a majority of 55, Frank broke down in tears and said: \"Finally, I can die in peace.\" Frank is unlikely to live long enough to see assisted dying introduced in England and Wales. If the legislation passes, it will be introduced in four years. \n                  Assisted dying bill does 'not meet needs of patients', says Royal College of Psychiatrists\n                 \n                  Palpable anger as both sides of assisted dying debate gather in Parliament Square\n                 \n                  MPs to vote again on Assisted Dying Bill - will it pass and what has changed?\n                 Frank now suffers from diabetes and fibromyalgia. She said: \"On top of everything I've got, to start developing more comorbidities, I have a massive thought in my head, which I live with every day, which is, is my body, am I on the road to the end, you know, is my body just giving up? \"I mean, I was taking morphine anyway for pain, but now I'm living on morphine, and that's not a life that you want.\" But even as MPs prepare to vote, many important questions remain over who will take responsibility for determining a patient's mental capacity and their prognosis. The Royal College of Psychiatrists said it was approaching Friday \"with trepidation\". Read more:Psychiatrists criticise billPalpable anger as both sides of debate gather Dr Annabel Price, the RCPsych's lead on assisted dying, told Sky News: \"If this bill as it stands proceeds through the rest of the parliamentary process, we as psychiatrists are left in a situation where there are so many unknowns about what is expected of us, about what patients can expect and about the safety of the process. \"We will continue to engage and there may be opportunities for reconsideration at further points in the bill. But yes, I approach this professionally with trepidation.\" The Royal College of GPs says the assisted dying process should happen outside of general practice. Dr Susi Caesar is in favour of the bill being passed and feels it is okay for the medical community to be so divided on the issue. She said: \"I think people have the right to make their own choices and absolutely I would not want to see anybody forced into being part of this process who didn't. Our current system is broken and this law would go a long way towards fixing it, at least for a certain group of people.\"  But the Royal Colleges of Physicians (RCP) also has reservations about the bill in its current form. It says it would be hard for a panel of experts who have no connection to a patient requesting an assisted death to determine if the person is being coerced or has mental capacity. Dr John Dean, clinical vice president at the RCP has concerns, saying: \"Currently decisions clearly are made by patients but agreed by single doctors and then the social worker and psychiatrists are not meeting the patient and those that have been caring for them. \"This has to be done in keeping with modern clinical practice which is complex decisions made with patients and families by teams.\" But for patients like Frank, these concerns have not changed her mind. She said: \"I'm praying for Friday that it still goes through because, like I said, it's not going to happen in my lifetime, but the thought that people like me who still try to look nice, who still tried to have a life and everything, that they can just have some peace of mind and they can have a weight lifted off their shoulders knowing that they're going to be able to do it peacefully with their family.\""
    },
    {
        "title": "Thousands of deaths in 2025 will be linked to air pollution, report warns",
        "description": "Around 30,000 deaths will be linked to toxic air in the UK in 2025, according to a report from leading doctors, as they urged the government to \"recognise air pollution as a key public health issue\".",
        "url": "https://news.sky.com/story/thousands-of-deaths-in-2025-will-be-linked-to-air-pollution-report-warns-13385661",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-pollution-canary_6945536.jpg?20250618214600",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-18 20:12:00",
        "Headline": "The report by the Royal College of Physicians warned there is \"no safe level\" of air pollutants as it noted how exposure to air pollution can shorten one's life by 1.8years. ",
        "Content": "Around 30,000 deaths will be linked to toxic air in the UK in 2025, according to a report from leading doctors, as they urged the government to \"recognise air pollution as a key public health issue\". The Royal College of Physicians (RCP) warned that around 99% of the population in the UK are breathing \"toxic air\". The report says there is \"no safe level\" of air pollutants while noting how exposure to air pollution can shorten life by 1.8 years on average. That is \"just behind some of the leading causes of death and disease worldwide\", including cancer and smoking, the authors wrote. The college has called on the government to take action to tackle the issue, as it urged ministers to \"recognise air pollution as a key public health issue\". In the forward of the report, England's chief medical officer, Professor Sir Chris Whitty, said: \"Air pollution remains the most important environmental threat to health, with impacts throughout the life course. \"It is an area of health where the UK has made substantial progress in the last three decades with concentrations of many of the main pollutants falling rapidly, but it remains a major cause of chronic ill health as well as premature mortality. \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  ULEZ lowers air pollution most in London boroughs that opposed it, data reveals\n                 \n                  'Rainmakers' and transboundary smog - Thailand's struggling battle against air pollution\n                 \"Further progress in outdoor air pollution will occur if we decide to make it, but will not happen without practical and achievable changes to heating, transport and industry in particular. \"Air pollution affects everybody, and is everybody's business.\" Read more from Sky News:US senator claims Iran is building missiles that can 'murder Americans'Moscow switches to crisis mode after Trump's Iran threats The report also highlights the economic impact of air pollution as it has an estimated cost of £27bn a year in healthcare costs and productivity losses. Dr Mumtaz Patel, president of the RCP, said: \"Air pollution can no longer be seen as just an environmental issue - it's a public health crisis. \"We are losing tens of thousands of lives every year to something that is mostly preventable and the financial cost is a price we simply cannot afford to keep paying. \"We wouldn't accept 30,000 preventable deaths from any other cause. We need to treat clean air with the same seriousness we treat clean water or safe food. It is a basic human right - and a vital investment in our economic future.\""
    },
    {
        "title": "Sharing deepfake pornography 'the next sexual violence epidemic facing schools'",
        "description": "Sharing deepfake pornography is \"the next sexual violence epidemic\" facing schools, the author of a book on the spread of online misogyny has told MPs.",
        "url": "https://news.sky.com/story/sharing-deepfake-pornography-the-next-sexual-violence-epidemic-facing-schools-13385659",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-06-18 20:16:00",
        "Headline": "Author Laura Bates tells MPs schools have paid PR firms to deal with the fallout but have not done anything to protect the victims or punish the perpetrator. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sharing deepfake pornography is \"the next sexual violence epidemic\" facing schools, the author of a book on the spread of online misogyny has told MPs. Appearing before the Women and Equalities Committee (WEC), Laura Bates said there needs to be statutory guidance for teachers on how to deal with this \"very significant issue\". She said in every UK case she has investigated, schools have \"paid thousands of pounds hiring PR firms to focus on damage reputation management\". However, in terms of supporting girls and taking action against the perpetrators, \"nothing has happened\". She said of deepfake pornography: \"It is happening, it's significant. Female teachers are affected, which often goes unnoticed, and schools are just not equipped to tackle it. \"My suggestion would be this is the next big sexual violence epidemic facing schools and people don't even know it is going on.\" Deepfakes are pictures, videos or audio clips made with Artificial Intelligence (AI) to look or sound real. While it is illegal to create or share a sexually explicit image of a child, including a deepfake, the technology for making them remains legal. Asked what more could be done to help schools tackle the issue, Ms Bates said in the cases she is aware of \"police investigations are ongoing\" . However, she said she is not suggesting criminalisation of underage boys is the solution and what is needed is education, prevention and regulation. \"It shouldn't be the case that a 12-year-old boy can easily and freely access tools to create these forms of content in the first place,\" she said. Ms Bates is the founder of the Everyday Sexism project and author of: The New Age of Sexism: How the AI Revolution is Reinventing Misogyny. She also called for \"very clear guidance\" on how schools should respond to this challenge. She warned of a repeat of failings that have happened previously with intimate image abuse, where girls have been \"coerced into sending images of themselves\" then punished for taking the image once it has been shared around - but the person spreading the image has not. Calls to ban 'nudifying apps' A government spokesperson told Sky News: \"We are reviewing the relationships, sex and health curriculum to look at all modern-day challenges facing children, including that of deepfake porn, and work to ensure children are taught how to build positive, healthy relationships in an age-appropriate way.\" It comes amid mounting concern among MPs and experts about online safety for children, with many wanting the government to go further with its regulations on big tech firms. Read More:Ofcom sets out new codes of practice to protect children onlineCan Adolescence change the rise of the 'manosphere'? In April, a report by the Children's Commissioner for England found that nudifying apps are disproportionately targeting girls and young women, with many appearing to work only on female bodies. The commissioner, Dame Rachel de Souza, called for an immediate ban on apps that use AI to create naked images of children, saying \"there is no positive reason for these to exist\". Inquiry into the 'manosphere' Ms Bates appeared in front of the WEC as part of their inquiry into how the \"manosphere\" and other online content is fuelling misogyny. The cross-party group has previously heard how the rise of misogyny in young men in particular is not only affecting female pupils but also female staff, with sexual harassment towards teachers described as \"rife\". On Wednesday's session, the committee also heard concerns around the rise of the \"sex tech industry\", including robots and AI girlfriends, with fears this is having a wider impact on attitudes towards women and girls. Sarah Owen, the Labour chair of the WEC, told Sky News she could not pre-empt what recommendations would be made to the government. But she said there was huge concern around the online radicalisation of young men, adding: \"It was a boiling hot room but my blood ran cold at what I was hearing.\""
    },
    {
        "title": "British woman dies from rabies - as family speak out to 'prevent this happening to others'",
        "description": "A British grandmother has died after contracting rabies from a \"slight scratch\" from a puppy during a holiday in Morocco, her family has said. ",
        "url": "https://news.sky.com/story/person-dies-in-yorkshire-from-rabies-after-contact-with-stray-dog-while-on-holiday-in-morocco-13382055",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-yvonne-ford-rabies_6945249.jpg?20250618151324",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-18 07:00:00",
        "Headline": "There have been six cases of human rabies associated with animal exposure abroad that have been reported in the UK between 2000 and 2024.",
        "Content": " A British grandmother has died after contracting rabies from a \"slight scratch\" from a puppy during a holiday in Morocco, her family has said.  Yvonne Ford's daughter said she travelled to the North African country in February but did not become ill until two weeks ago. Robyn Thomson said in a Facebook post: \"Our family is still processing this unimaginable loss, but we are choosing to speak up in the hope of preventing this from happening to others. \"She was scratched very slightly by a puppy in Morocco in February. At the time, she did not think any harm would come of it and didn't think much of it. \"Two weeks ago she became ill, starting with a headache and resulted in her losing her ability to walk, talk, sleep, swallow. Resulting in her passing.\" Ms Ford, from Barnsley, South Yorkshire, was diagnosed with the virus at Barnsley Hospital. The UK Health Security Agency (UKHSA) said health workers and close contacts were being assessed and offered vaccination when necessary. It said there was no risk to the wider public because there is no evidence rabies can be transmitted between people. Rabies is caused by a virus invading the central nervous system. It is spread by mammals - such as cats, dogs, bats, raccoons and foxes - but in the UK it's only found in some bats, according to the NHS. Once symptoms appear, it is almost always fatal, according to the World Health Organisation (WHO). The first symptoms can mirror a flu, while later symptoms include numbness or tingling in the affected area, hallucinations, anxiety, difficulty swallowing or breathing, nausea, vomiting, agitation, excessive saliva and paralysis. But if seen to promptly after a bite, scratch or lick by an animal that may carry the virus, treatment is usually very effective at preventing the condition. Treatment usually involves two or more doses of the rabies vaccine or a medicine called rabies immunoglobulin, which is a liquid administered to the wound and is only required if the patient has not had the rabies vaccine or has a weakened immune system. The rabies vaccine is recommended if you're travelling to a part of the world where rabies is more common. Around 60,000 people die every year from rabies worldwide, with the majority in Africa and Asia, according to the WHO.  Read more about rabies, and how to avoid getting it, here. Dr Katherine Russell at the UKHSA said: \"I would like to extend my condolences to this individual's family at this time. \"If you are bitten, scratched or licked by an animal in a country where rabies is found then you should wash the wound or site of exposure with plenty of soap and water and seek medical advice without delay in order to get post-exposure treatment to prevent rabies.\" The UKHSA urges travellers to rabies-affected countries, for example in Asia and Africa, to avoid contact with dogs, cats and other animals wherever possible and check whether a vaccination is needed before travelling. Read more from Sky News:Met Office: UK could see temperatures of 46CKneecap rapper appears in court on terror charge There have been six cases of human rabies associated with animal exposure abroad that have been reported in the UK between 2000 and 2024. This includes a case in 2012, when a UK resident died after being bitten by a dog - the most common source of infection in most parts of the world - in South Asia. The latest case was in 2018, when another Briton died after being bitten by a cat in Morocco. Latest World Health Organisation figures show a number of deaths from rabies in Morocco have been reported every year from 2010 to 2022. Rabies does not circulate in either wild or domestic animals in the UK, although some species of bats can carry a rabies-like virus. No human cases of rabies acquired in the UK from animals other than bats have been reported since 1902."
    },
    {
        "title": "Mykhaylo Mudryk: Chelsea winger could face four-year ban after being charged over alleged doping",
        "description": "Chelsea player Mykhaylo Mudryk is facing a potential ban of up to four years after being charged by the Football Association (FA) with doping offences.",
        "url": "https://news.sky.com/story/mykhaylo-mudryk-chelsea-winger-could-face-four-year-ban-after-being-charged-over-alleged-doping-13385618",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-mykhailo-mudryk-chelsea_6778511.jpg?20241217102603",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-18 17:25:00",
        "Headline": "The 24-year-old previously denied wrongdoing, while his club said he had \"never knowingly used any banned substances\".",
        "Content": "Chelsea player Mykhaylo Mudryk is facing a potential ban of up to four years after being charged by the Football Association (FA) with doping offences. The Ukraine international was provisionally suspended in December after returning a positive drug test, reportedly for the banned substance meldonium. At the time, the 24-year-old said the result came as \"a complete shock\" and stated he had \"not done anything wrong\". Chelsea added that he had \"never knowingly used any banned substances\". On Wednesday, Mudryk's spokesperson said the player's position remains unchanged and he would not be commenting further. The FA released a statement describing details of the charge: \"We can confirm that Mykhailo Mudryk has been charged with anti-doping rule violations alleging the presence and/or use of a prohibited substance, in terms of regulations three and four of the FA's anti-doping regulations.\" The positive result occurred shortly after the winger returned from international duty with Ukraine in November. After being absent from Chelsea for four games, before his suspension was made public, the club's manager Enzo Maresca initially said Mudryk was unavailable through illness. He last played in the Premier League on 10 November as a second-half substitute in a 1-1 draw at home to Arsenal. Since his £88m move from Shakhtar Donetsk in January 2023, Mudryk has scored just 10 goals in 73 appearances in all competitions and has rarely held down a regular place in the team. Read more from Sky News:British woman dies from rabiesUK temperatures 'could hit 46C in future''Murder' may be linked to diamond-encrusted Rolex Since Maresca took over at Chelsea in July 2024, most of Mudryk's games have come in the cup competitions and in Europe, with just a single Premier League start in August's 6-2 win over Wolves. Earlier this month Mudryk's number 10 shirt was allocated to midfielder Cole Palmer for next season, leaving him without a squad number at Stamford Bridge. Mudryk has made no public comment on the case since a statement on Instagram in December in which he denied wrongdoing. The player also said that he remained \"hopeful that I will be back on the pitch soon.\" Chelsea declined to comment."
    },
    {
        "title": "British survivor of Air India crash carries brother's coffin after being discharged from hospital",
        "description": "A British man who was the sole survivor of the Air India crash in Ahmedabad has been discharged from hospital, the airline has confirmed.",
        "url": "https://news.sky.com/story/british-survivor-of-air-india-crash-discharged-from-hospital-airline-confirms-13385528",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/03bef406ba37f17955c4b250cd291e088e5b041fafc7dee93adf5148816190bf_6945243.jpg?20250618150931",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-18 13:30:00",
        "Headline": "After leaving hospital, Vishwash Kumar Ramesh attended the funeral of his brother - one of the 241 people killed on Flight AI171 to Gatwick - as UK experts help investigate the cause of the crash.",
        "Content": " A British man who was the sole survivor of the Air India crash in Ahmedabad has been discharged from hospital, the airline has confirmed. Vishwash Kumar Ramesh, 40, has since been seen in video as a pallbearer at the funeral in western India for his brother Ajay - one of the 241 people killed in the crash. At least 30 people also died on the ground as the Boeing 787-8 Dreamliner struck a medical college hostel shortly after take-off from the airport in the state of Gujarat on Thursday. In a statement, Air India said it was \"in mourning for the tragic loss\" of passengers and crew aboard Flight AI171 and is in contact with relatives of those killed, including 52 British nationals. It said it was working to repatriate the deceased to the UK and other parts of the world, adding: \"The sole survivor of the accident, also a British national, has been discharged from hospital.\" \"The investigation is ongoing,\" it said. \"We are cooperating with all parties involved and are committed to sharing verified information and will continue to provide updates wherever we can.\" On Flight AI171 to Gatwick, there were 169 Indians, 53 Britons, seven Portuguese, and one Canadian among the passengers, along with 12 crew. The only survivor, Mr Ramesh, was in seat 11A, near the emergency exit. Speaking from his hospital bed on Friday, he explained how he \"managed to escape by jumping out the emergency door\". British response 'disorganised' The families of three people from Gloucester, who were killed in the crash, have issued a critical attack on the UK government's response, adding to comments on Monday that they \"felt utterly abandoned\". Husband and wife Akeel Nanabawa and Hannaa Vorajee were on a trip to India with their daughter Sara Nanabawa, who was four. The Nanabawa and Vorajee families described their \"immense loss\" and reflected on the \"beautiful memories we shared\". In a joint statement, they also expressed their frustration at British authorities. \"Regrettably, the recovery process itself was marred by a lack of basic coordination and proactive communication,\" they said. \"Rather than being guided with clarity and compassion, our families were left to navigate the process with minimal support... the British response on the ground was disorganised, understaffed, and clearly lacking the training and preparedness required for such a tragic situation,\" the statement said. In a statement, the Foreign Office said: \"Our thoughts are with the Nanabawa and Vorajee families, and all those who have lost loved ones, during this deeply distressing time. \"We continue to provide both families, along with all British nationals who have approached us, with direct assistance at the UK's reception centre in Ahmedabad and are working at pace with the local authorities to provide affected families with the support they need, as we have done every day since the crash.\" Read more:Families 'feel utterly abandoned'Who are some of the victims?Survivor's brother describes horror Dozens of anxious family members are waiting to collect the bodies of loved ones as doctors work to gather dental samples and perform DNA profiling to identify victims. Crash investigation continues Air India and the Indian government are looking at issues linked to engine thrust, flaps, and why the landing gear remained extended, or in the down position, after take-off.  Both the cockpit voice and flight data recorders, also called black boxes, have been recovered. They will be crucial to the crash investigation, in which air accident investigators from the UK and US will be taking part. India's aviation safety watchdog has asked Air India for the training records of the pilots and dispatchers, while an inspection of Air India's 787 fleet did not reveal any major issues. While there has not been an update on the possible cause of the crash, Indian officials have raised concerns about recent maintenance-related issues reported by the airline and advised the carrier to \"strictly adhere to regulations\"."
    },
    {
        "title": "Father and son drowned during test drive after Mercedes plunged into canal, inquest told",
        "description": "A father and son drowned after a Mercedes they were test driving hit a telegraph pole and plunged into a canal, an inquest has been told.",
        "url": "https://news.sky.com/story/father-and-son-drowned-during-test-drive-after-mercedes-plunged-into-canal-inquest-told-13385633",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-cameron-walsh-david_6945399.jpg?20250618174715",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-18 18:26:00",
        "Headline": "A family statement described David Walsh and son Cameron, who died in January last year, as \"two beautiful people\" who were \"full of life\".",
        "Content": "A father and son drowned after a Mercedes they were test driving hit a telegraph pole and plunged into a canal, an inquest has been told. Footballer Cameron Walsh, 16, was messaging his friends minutes before the car entered the Louth Canal, in Tetney near Grimsby, Greater Lincolnshire Coroner's Court heard. His father, David Walsh, 40, was believed to have been driving the vehicle. A witness who saw the blue Mercedes GLC 300 said it performed a \"snaking action\" and assumed the driver was \"trying to gain control\", the inquest heard. Roberta Smith, who called 999, added that the vehicle \"flew off the road and into the canal\" and appeared to be \"airborne\" before it landed \"roof first\" in the water. Another witness described seeing a blue car being driven \"erratically and at speed\". The inquest heard emergency services were called at 1.38pm on 6 January 2024. Fire crews had to smash a window to gain access to the locked car, which had been collected from a Mercedes dealership. But by that point the pair had been in the water for up to 45 minutes, the inquest was told. They were pronounced dead at 2.58pm. The cause of death for both was recorded as drowning. Assistant coroner for Greater Lincolnshire, Marianne Johnson, concluded that it was likely David Walsh was driving and the pair died in a road traffic collision. She added that she would file a prevention of future deaths report, designed to ensure authorities act on issues uncovered during an inquest. The inquest, attended by friends and relatives of the pair, also heard there were no mechanical defects likely to have contributed to the crash. Forensic collision investigator PC Nick Prestwich told the hearing that \"the collision occurred partly due to the manner of driving\". Speaking about CCTV footage of the car on Tetney Lock Road, Tetney, PC Prestwich said: \"You can see that vehicle is swerving around on the road surface. It's my belief the car was driven too fast for the road conditions.\" The inquest also heard Cameron Walsh messaged his girlfriend saying that the car was \"banging\". He also sent a picture of himself inside the vehicle to a friend via Snapchat one minute before it is believed to have entered the canal. Read more from Sky News:British woman dies from rabiesUK temperatures 'could hit 46C in future''Murder' may be linked to diamond-encrusted Rolex Tetney Lock Road was described to the inquest as a 60mph single-track road with \"no road marks\" and warning signs for an uneven surface. Richard Fenwick, an official from Lincolnshire County Council, said an inspection four days after the incident had identified no safety defects. A family statement, read to the inquest, described the father and son as \"two beautiful people\" who were \"full of life\". It added: \"David was the most selfless person to grace the earth, his kindness was unheard of. He embraced his role as a father figure with unmatched warmth. \"Cameron's personality lit up the darkest of rooms. Cameron was a gentle giant. When you were with Cameron you always knew he was there.\" Cameron Walsh, who played for Grimsby Town Football Club, was called an \"undeniable talent\" and \"much-loved figure\" by the club in a tribute following his death."
    },
    {
        "title": "Princess of Wales pulls out of attending Royal Ascot",
        "description": "The Princess of Wales pulled out of Royal Ascot today - as she continues to find the right balance after her cancer diagnosis.",
        "url": "https://news.sky.com/story/princess-of-wales-pulls-out-of-attending-royal-ascot-13385289",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-princess-kate_6945101.jpg?20250618125320",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-18 11:33:00",
        "Headline": "Kate has been making a gradual return to public duties since it was announced in January she was in remission from cancer.",
        "Content": "The Princess of Wales pulled out of Royal Ascot today - as she continues to find the right balance after her cancer diagnosis. Kate is said to be disappointed at not attending the sporting event in Berkshire with Prince William, and the King and Queen. She had been named in the list of guests joining Charles and Camilla in the carriage procession. But this was quickly amended after Kensington Palace confirmed the princess would not be attending.  William later arrived at the race course with his father and Camilla, and the trio took part in a royal procession before the racing began. Kate has been making a gradual return to public duties since it was announced in January she was in remission from cancer. Her recent appearances have included Trooping the Colour in London on Saturday, where she rode in a carriage in the parade with Prince George, Princess Charlotte and Prince Louis. The Waleses then joined the King, Queen and other senior royals on the Buckingham Palace balcony to watch a Red Arrows flypast. On Sunday, the royals gathered at Windsor Castle's St George's Chapel for the Order of the Garter service, which Kate was forced to miss last year amid her cancer treatment.  The princess shared her cancer diagnosis with the public last March, having started preventative chemotherapy a month earlier. She finished her treatment in September last year. In January, Kate said it was \"a relief to now be in remission\". Read more:King greets D-Day veteransNew Kate waxwork unveiled A message on social media, signed \"C\", said: \"As anyone who has experienced a cancer diagnosis will know, it takes time to adjust to a new normal. \"I am however looking forward to a fulfilling year ahead. There is much to look forward to.\""
    },
    {
        "title": "I felt I had to go back to help Gaza's hospitals, says British plastic surgeon",
        "description": "Dr Victoria Rose is a consultant plastic surgeon who worked in Gaza hospitals for two separate periods last year. This is her first-hand story of the war in Gaza.",
        "url": "https://news.sky.com/story/i-felt-i-had-to-go-back-to-help-gazas-hospitals-says-british-plastic-surgeon-13385666",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dr-victoria-rose-gaza_6945534.jpg?20250618214244",
        "type": "World",
        "Author": "Dr Victoria Rose, consultant plastic surgeon",
        "Date Published": "2025-06-18 20:24:00",
        "Headline": "The aim was to deliver essential surgical equipment and assist colleagues with the increasing trauma workload they faced. But as the war progressed, it became apparent that I had a third objective: to bear witness.",
        "Content": "By Dr Victoria Rose, consultant plastic surgeon   Dr Victoria Rose is a consultant plastic surgeon who worked in Gaza hospitals for two separate periods last year. This is her first-hand story of the war in Gaza. The word \"dire\" does not adequately describe the situation in Gaza's hospitals. On a daily basis when I was working there, I had a list of at least 10 patients, and 60% of them were under the age of 15. These were tiny children with life-threatening burns and limbs blown off, often losing significant family members in the attacks and left to cope with their life-changing injuries alone. I first joined the charity IDEALS, which helps medical professionals during crises, in Gaza in 2019. I returned last year, working with orthopaedic surgeons. I felt compelled to go back after becoming aware that a plastic surgeon from Gaza who trained with me in London had been inundated with complex trauma cases since the war broke out in October 2023. Our aim was to deliver essential surgical equipment and assist our colleagues with the increasing trauma workload they faced. But as the war progressed, it became apparent that we had a third objective: to bear witness. I worked at the European Gaza Hospital in March 2024 and then returned in August of that year for a month, working at Nasser Hospital. The transformation of the landscape during these two visits was staggering. The streets were unrecognisable, just pile after pile of dust and rubble. Such a scale of destruction could only be justified if every single building in Gaza was part of Hamas's infrastructure. In February 2024, we were denied entry by COGAT – part of the Israel Defence Forces (IDF) controlling activities in the occupied territories – which, regrettably, has become a standard outcome for 50% of foreign doctors attempting to gain access. However, we managed to regain access in May. This mission was intended to last four weeks at the European Gaza Hospital. However, due to its bombing on the day we arrived and its subsequent decommissioning by the IDF, we were redirected to Nasser for three and a half weeks. The population had now been relentlessly displaced, bombed in their tents, deprived of water and sanitation, and ultimately starved. I remember thinking it couldn't get any worse – and then they cut the internet. We ploughed on without essential equipment such as painkillers and antibiotics, patching the patients up, knowing that they were likely to be bombed again. When we left the hospital we went into the red zone – an area of active fighting that needed to be evacuated. This meant that nothing could enter without the journey being \"deconflicted\" by the IDF. Minimal journeys have thus far been deconflicted. Patients struggle to gain entry, and staff cannot leave, as equipment continues to be depleted. Nasser is the only hospital in the south equipped with a CT scanner, a blood bank, ICU capabilities and an oxygen generator. I work with two orthopaedic surgeons who run the IDEALS charity. They have been travelling to Gaza since 2009. IDEALS started the lower limb reconstruction programme in 2013, visiting Gaza every other month and bringing four orthopaedic surgeons back to the UK for short periods of training. In 2021, I arranged for a plastic surgeon from Gaza to come to London to train with me. He was an incredible trainee and returned to Gaza in February 2023 to take up the post of chief of plastic surgery at Shifa Hospital.  Shortly after the war broke out, I felt compelled to help him. All eyes are now on Israel's next move. Gaza: Doctors On The Frontline will air on Sky News at 9pm on 19 June"
    },
    {
        "title": "Israel's block on international journalists in Gaza should not be allowed to stand",
        "description": "On Sky News this week we're showing a film about Israel's war in Gaza which has now been going on for more than 620 days.",
        "url": "https://news.sky.com/story/israels-block-on-international-journalists-in-gaza-should-not-be-allowed-to-stand-13385627",
        "image_url": "https://e3.365dm.com/23/02/1920x1080/skynews-jonathan-levy-sky-news_6071526.jpg?20230227090103",
        "type": "World",
        "Author": "Jonathan Levy",
        "Date Published": "2025-06-18 17:51:00",
        "Headline": "The ongoing denial of access feels much less about the safety of journalists and more about preventing proper scrutiny and accountability of the desperate situation there.",
        "Content": "\n          Executive Editor and Managing Director\n        On Sky News this week we're showing a film about Israel's war in Gaza which has now been going on for more than 620 days. It is a chastening watch. Swathes of Gaza's medical infrastructure have been razed, many of the territory's buildings have been destroyed, and tens of thousands of Gazans have been killed, maimed and left hungry and malnourished in a war fought mainly from the air with heavy ordinance dropped on crowded civilian areas. These extraordinary eyewitness accounts are not brought to our screens by experienced international war correspondents - they are barred from entering Gaza - but by two British medics whose mission was to save lives not to report on the horrors of war. That visiting surgeons Victoria Rose and Tom Potokar felt compelled to do just that, speaks not only to the tragedy unfolding in Gaza, but to the swingeing restrictions imposed on reporting what is happening there. In the history of modern warfare, the presence of journalists on the battlefield has been essential in holding the combatants to account and ensuring that war crimes and atrocities are uncovered and prevented. And Israel stands accused of egregious crimes in Gaza. Since it launched its war there in response to the Hamas terror attacks of October 7th 2023, in which around 1,200 Israelis and other nationals were murdered and a further 250 taken hostage, more than 55,000 Palestinians have been killed according to the Gazan health authorities. Many of the dead have been women and children. Earlier this month, former US State Department official Matt Miller told the Sky News Trump100 podcast that Israel had committed war crimes in Gaza. Ex-UN humanitarian chief Martin Griffiths went further, telling Sky News presenter Yalda Hakim that Israel is responsible for genocide there. It's an accusation supported by Ireland, Spain, and South Africa which is pursuing Israel for genocide at the International Court of Justice - the UN's highest court. Israel rejects the case against it, claiming that many of the dead are Hamas fighters who have been hiding in tunnels under the hospitals that it has the right to attack in self-defence. Israeli officials and diplomats deny that its military targets women and children and react with outrage to the suggestion that it is responsible for ethnic cleansing or genocide - accusations of crimes against humanity that are taken as particularly loaded given the dark resonance they have for the Jewish people. But Israel's confidence in the integrity of its wartime conduct is not matched by a willingness to allow international journalists into Gaza to witness what is going on there for themselves. Military-organised 'embeds' fall well short of independent journalism For the course of its longest war, no reporters have been permitted entry to Gaza other than on organised and controlled 'embeds' of a few hours alongside Israeli soldiers. These managed opportunities fall well short of independent journalism, for which Sky News and other global news organisations must rely on trusted and heroic local reporting teams who lack the support and infrastructure to provide a complete picture of what is going on. And these Palestinian journalists have paid a heavy price for their work; according to the Committee to Protect Journalists, 185 of them have been killed during the war and 86 imprisoned. The Foreign Press Association, which represents the interests of international journalists operating in Israel, has been petitioning its High Court of Justice to lift the ban on reporting independently from Gaza. So far, that legal action has been unsuccessful and last month the court again postponed a hearing in the case without reason or setting a new date. Israeli officials push back on the need and suitability of allowing journalists to operate independently in Gaza. They say that their military's priority is the rescue of the remaining hostages and the fight against Hamas and that the safety of reporters could not be ensured. But journalists from Sky News and fellow news organisations have operated in Gaza in previous conflicts, providing details of their location and movements to the Israel Defence Forces. 'We accept the risks' Moreover, we have decades of experience of covering conflict zones and our reporters are highly trained at doing so. The risks are real, for sure. But they're risks that we accept. It's what we do. The ongoing denial of access to Gaza feels much less about the safety of journalists and more about preventing proper scrutiny and accountability of the desperate situation there. The barring of international journalists is accompanied by the active delegitimisation of what reporting on the war has been possible which is often shamefully labelled as anti-Semitic and compared to the darkest periods in Jewish history. All together this constitutes a war on truth that is at odds with Israel's proud and oft-repeated claim to be the Middle East's only democracy and it should not be allowed to stand. Gaza: Doctors On The Frontline will air on Sky News at 9pm on 19 June"
    },
    {
        "title": "US President Donald Trump says he 'may or may not' strike Iran as Israel's air war continues",
        "description": "US President Donald Trump says he has yet to decide whether the US will join Israel militarily in its campaign against Iran.",
        "url": "https://news.sky.com/story/us-president-donald-trump-says-he-may-or-may-not-strike-iran-as-israels-air-war-continues-13385686",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-white-house-donald-trump_6945297.jpg?20250618155635",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-18 23:00:00",
        "Headline": "As the world keeps guessing whether the US president will intervene against Iran, Mr Trump has said \"nobody knows\" what he will do, adding Iran has \"got a lot of trouble\".",
        "Content": " US President Donald Trump says he has yet to decide whether the US will join Israel militarily in its campaign against Iran. Asked whether the US was getting closer to striking Iran's nuclear facilities, Mr Trump said: \"I may do it. I may not do it.\" Speaking outside the White House on Wednesday, he added: \"Nobody knows what I'm going to do...Iran's got a lot of trouble, and they want to negotiate. \"And I said, 'why didn't you negotiate with me before all this death and destruction?'\" Mr Trump said Iran had reached out to Washington, a claim Tehran denied, with Iran's mission to the UN responding: \"No Iranian official has ever asked to grovel at the gates of the White House.\" Iran's supreme leader, Ayatollah Ali Khamenei said Iran would not surrender and warned \"any US military intervention will undoubtedly cause irreparable damage\" to US-Iranian relations. Read more:Why did Israel attack Iran? \n                  The speed at which Israel 'took down' Iranian air defences was 'shocking', ex-Mossad intelligence chief claims\n                 \n                  US moving warplanes to Middle East in 'demonstration of force' - this is the aircraft to watch\n                 \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                  Strikes continue Hundreds have reportedly died since Iran and Israel began exchanging strikes last Friday, when Israel launched an air assault after saying it had concluded Iran was on the verge of developing a nuclear weapon, a claim Tehran denies. Israel launched three waves of aerial attacks on Iran in the last 24 hours, military spokesman Brigadier General Effie Defrin has said. Israel deployed dozens of warplanes to strike over 60 targets in Tehran and western Iran, including missile launchers and missile-production sites, he said.  \"The aim of the operation is to eliminate the existential threat to the State of Israel, significantly damage Iran's nuclear programme in all its components, and severely impact its missile array,\" he said. Early on Thursday Israel issued an evacuation warning to residents of the Iranian Arak and Khandab regions where Iran has heavy water reactor facilities. Heavy water is important in controlling chain reactions in the production of weapons grade plutonium. Meanwhile Iran says it has arrested 18 people it describes as \"enemy agents\" who it says were building drones for the Israelis in the northern city of Mashhad. Iran also launched small barrages of missiles at Israel on Wednesday with no reports of casualties. Israel has now eased some restrictions for its civilians. Read more:Trump's words designed to stoke tension, confuse and apply intense pressure on IranMAGA civil war breaks out over Trump's potential decision to join conflict with Iran The US is working to evacuate its citizens from Israel by arranging flights and cruise ship departures, the US ambassador to the country has said. In the UK, Sir Keir Starmer chaired a COBRA emergency meeting on the situation in the Middle East, with a Downing Street spokesperson saying: \"Ministers were updated on efforts to support British nationals in region and protect regional security, as well as ongoing diplomatic efforts\"."
    },
    {
        "title": "The speed at which Israel 'took down' Iranian air defences was 'shocking', ex-Mossad intelligence chief claims",
        "description": "A former director of intelligence at Israeli spy agency Mossad has told Sky News it was \"shocking\" how quickly Israel \"took down\" Iran's air defences.",
        "url": "https://news.sky.com/story/israels-speed-at-which-it-took-down-iranian-air-defences-was-shocking-ex-mossad-intelligence-chief-claims-13385592",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-zohar-palti-mossad_6945363.jpg?20250618170607",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-18 15:55:00",
        "Headline": "Zohar Palti tells The World With Yalda Hakim that it took his country's air force 36-48 hours to \"dominate completely\" the skies above Iran.",
        "Content": " A former director of intelligence at Israeli spy agency Mossad has told Sky News it was \"shocking\" how quickly Israel \"took down\" Iran's air defences. On 13 June, the Israeli military, in an operation called \"Rising Lion\", started carrying out aerial attacks on Iran, hitting sites including some of its most important nuclear installations. Israel said Iran was on the verge of building a nuclear bomb - something Tehran has always denied seeking from its uranium enrichment programme. Since those air attacks, both countries have been trading daily missile strikes.  Live updates: US prepares evacuation flights from Israel Ex-Mossad boss Zohar Palti told The World With Yalda Hakim that it took his country's air force 36-48 hours to \"dominate completely\" the skies above Iran. \"This is shocking in a way. This is amazing,\" he said. He added: \"We thought that it would be much harder, you know, because I don't want to brag or do things like that. I mean, it was much more fast than we anticipated.\" Israeli ceasefire 'could be in days' Mr Palti said he believes that in two days to a week, Israel \"can call\" a ceasefire. \"We will need of course the international community and when I say the international community, it's basically the Americans in this case and no doubt we will need the support of the E3, meaning the Europeans,\" he added. Iran denies seeking nuclear weapons and points to its right to acquire nuclear technology for peaceful purposes, including enrichment. Mr Palti said the Americans have the ability to \"take all the [Iranian] regime in a couple of hours\". He said Iran's Supreme Leader Ayatollah Ali Khamenei was at a \"crossroads\" and had two options - \"the existence of the regime\" or \"give up his inspiration right now to build a military nuclear bomb. I think it's an easy decision\". Read more:Analysis: Moscow switches to crisis modeAnalysis: Trump's extreme version of maximum pressure diplomacy Some Israeli officials have admitted Israel won't be able to completely destroy Iran's nuclear programme, unless US bombers drop ordnance that can penetrate sites buried deep underground. Ayatollah Ali Khamenei has warned that any US strikes targeting the Islamic Republic will \"result in irreparable damage for them\" and that his country would not bow to Donald Trump's call for surrender. On Wednesday, President Trump would not say whether he has decided to order an American strike on Iran.  Prime Minister Benjamin Netanyahu claimed on Monday that Israel's control of Iranian airspace was \"a game-changer\". And national security adviser Tzachi Hanegbi said pilots could operate \"against countless more targets\" over Tehran, thanks to the destruction of \"dozens and dozens\" of air defence batteries. In the latest bombing, Israel said its air force destroyed the headquarters of Iran's internal security service."
    },
    {
        "title": "Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow ",
        "description": "Russia is getting nervous about Donald Trump's trigger finger, and it shows.",
        "url": "https://news.sky.com/story/donald-trumps-comments-about-getting-involved-in-israel-iran-conflict-are-raising-alarm-bells-in-moscow-13385508",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6945213.jpg?20250618143945",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-18 12:55:00",
        "Headline": "Russia's ties with Tehran have deepened since the Kremlin's invasion of Ukraine. But now its leadership is switching to crisis mode amid fears about the future of the alliance.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Russia is getting nervous about Donald Trump's trigger finger, and it shows. Comments from deputy foreign minister Sergei Ryabkov – warning the US against joining Israel's military campaign – betray Moscow's growing unease that it could be about to lose its closest Middle Eastern ally. Russia has strong ties with Iran, which have deepened since the Kremlin's invasion of Ukraine. These were formalised in a strategic partnership pact the two countries signed at the start of the year. Israel-Iran conflict - live updates So, at first, Russia seemed to view its ally's conflict with Israel as an opportunity to gain leverage. The Kremlin was quick to offer its services as a potential mediator. If Vladimir Putin could persuade Tehran to back down and return to nuclear talks with Washington, he'd potentially have a favour to cash in with the White House over its military support for Ukraine. But the offers to mediate fell on deaf ears. And with Mr Trump threatening to assassinate Iran's supreme leader, Moscow has switched to crisis mode – fearful of losing its second key regional ally in six months, after the fall of the Assad regime in Syria. So, as well as Ryabkov, other senior figures have taken to the airwaves. Russia's spy chief Sergei Naryshkin called the situation \"critical\".  Read more:Who has been targeted in Iran?How the conflict escalated And, according to ministry of foreign affairs spokeswoman Maria Zakharova, the world is \"millimetres away from catastrophe\" due to Israeli strikes on Iran's nuclear facilities. It's quite the spectacle – a country that's been waging war on its neighbour for more than three years is now urging others to show military restraint. That's because US involvement poses serious consequences, not just for Iran, but for Russia too. But none here would be drawn on what Moscow would do if Trump does bomb Tehran. The notoriously outspoken Ms Zakharova was unusually tight-lipped on that particular question when I caught up with her at the St Petersburg International Economic Forum. She wasn't even able to say whether it would constitute an escalation, when the whole world can see that it would. That's because Russian officials are in an unfamiliar position - caught between a long-time ally and the country whose affections they're courting. Hence the reluctance to directly criticise Trump. I think they're also waiting to see what Russia's president will say, when he addresses news agencies later on Wednesday evening. So far, in public at least, he's remained silent."
    },
    {
        "title": "British survivor of Air India crash carries brother's coffin after being discharged from hospital",
        "description": "A British man who was the sole survivor of the Air India crash in Ahmedabad has been discharged from hospital, the airline has confirmed.",
        "url": "https://news.sky.com/story/british-survivor-of-air-india-crash-discharged-from-hospital-airline-confirms-13385528",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/03bef406ba37f17955c4b250cd291e088e5b041fafc7dee93adf5148816190bf_6945243.jpg?20250618150931",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-18 13:30:00",
        "Headline": "After leaving hospital, Vishwash Kumar Ramesh attended the funeral of his brother - one of the 241 people killed on Flight AI171 to Gatwick - as UK experts help investigate the cause of the crash.",
        "Content": " A British man who was the sole survivor of the Air India crash in Ahmedabad has been discharged from hospital, the airline has confirmed. Vishwash Kumar Ramesh, 40, has since been seen in video as a pallbearer at the funeral in western India for his brother Ajay - one of the 241 people killed in the crash. At least 30 people also died on the ground as the Boeing 787-8 Dreamliner struck a medical college hostel shortly after take-off from the airport in the state of Gujarat on Thursday. In a statement, Air India said it was \"in mourning for the tragic loss\" of passengers and crew aboard Flight AI171 and is in contact with relatives of those killed, including 52 British nationals. It said it was working to repatriate the deceased to the UK and other parts of the world, adding: \"The sole survivor of the accident, also a British national, has been discharged from hospital.\" \"The investigation is ongoing,\" it said. \"We are cooperating with all parties involved and are committed to sharing verified information and will continue to provide updates wherever we can.\" On Flight AI171 to Gatwick, there were 169 Indians, 53 Britons, seven Portuguese, and one Canadian among the passengers, along with 12 crew. The only survivor, Mr Ramesh, was in seat 11A, near the emergency exit. Speaking from his hospital bed on Friday, he explained how he \"managed to escape by jumping out the emergency door\". British response 'disorganised' The families of three people from Gloucester, who were killed in the crash, have issued a critical attack on the UK government's response, adding to comments on Monday that they \"felt utterly abandoned\". Husband and wife Akeel Nanabawa and Hannaa Vorajee were on a trip to India with their daughter Sara Nanabawa, who was four. The Nanabawa and Vorajee families described their \"immense loss\" and reflected on the \"beautiful memories we shared\". In a joint statement, they also expressed their frustration at British authorities. \"Regrettably, the recovery process itself was marred by a lack of basic coordination and proactive communication,\" they said. \"Rather than being guided with clarity and compassion, our families were left to navigate the process with minimal support... the British response on the ground was disorganised, understaffed, and clearly lacking the training and preparedness required for such a tragic situation,\" the statement said. In a statement, the Foreign Office said: \"Our thoughts are with the Nanabawa and Vorajee families, and all those who have lost loved ones, during this deeply distressing time. \"We continue to provide both families, along with all British nationals who have approached us, with direct assistance at the UK's reception centre in Ahmedabad and are working at pace with the local authorities to provide affected families with the support they need, as we have done every day since the crash.\" Read more:Families 'feel utterly abandoned'Who are some of the victims?Survivor's brother describes horror Dozens of anxious family members are waiting to collect the bodies of loved ones as doctors work to gather dental samples and perform DNA profiling to identify victims. Crash investigation continues Air India and the Indian government are looking at issues linked to engine thrust, flaps, and why the landing gear remained extended, or in the down position, after take-off.  Both the cockpit voice and flight data recorders, also called black boxes, have been recovered. They will be crucial to the crash investigation, in which air accident investigators from the UK and US will be taking part. India's aviation safety watchdog has asked Air India for the training records of the pilots and dispatchers, while an inspection of Air India's 787 fleet did not reveal any major issues. While there has not been an update on the possible cause of the crash, Indian officials have raised concerns about recent maintenance-related issues reported by the airline and advised the carrier to \"strictly adhere to regulations\"."
    },
    {
        "title": "US President Donald Trump says he 'may or may not' strike Iran as Israel's air war continues",
        "description": "US President Donald Trump says he has yet to decide whether the US will join Israel militarily in its campaign against Iran.",
        "url": "https://news.sky.com/story/us-president-donald-trump-says-he-may-or-may-not-strike-iran-as-israels-air-war-continues-13385686",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-white-house-donald-trump_6945297.jpg?20250618155635",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-18 23:00:00",
        "Headline": "As the world keeps guessing whether the US president will intervene against Iran, Mr Trump has said \"nobody knows\" what he will do, adding Iran has \"got a lot of trouble\".",
        "Content": " US President Donald Trump says he has yet to decide whether the US will join Israel militarily in its campaign against Iran. Asked whether the US was getting closer to striking Iran's nuclear facilities, Mr Trump said: \"I may do it. I may not do it.\" Speaking outside the White House on Wednesday, he added: \"Nobody knows what I'm going to do...Iran's got a lot of trouble, and they want to negotiate. \"And I said, 'why didn't you negotiate with me before all this death and destruction?'\" Mr Trump said Iran had reached out to Washington, a claim Tehran denied, with Iran's mission to the UN responding: \"No Iranian official has ever asked to grovel at the gates of the White House.\" Iran's supreme leader, Ayatollah Ali Khamenei said Iran would not surrender and warned \"any US military intervention will undoubtedly cause irreparable damage\" to US-Iranian relations. Read more:Why did Israel attack Iran? \n                  The speed at which Israel 'took down' Iranian air defences was 'shocking', ex-Mossad intelligence chief claims\n                 \n                  US moving warplanes to Middle East in 'demonstration of force' - this is the aircraft to watch\n                 \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                  Strikes continue Hundreds have reportedly died since Iran and Israel began exchanging strikes last Friday, when Israel launched an air assault after saying it had concluded Iran was on the verge of developing a nuclear weapon, a claim Tehran denies. Israel launched three waves of aerial attacks on Iran in the last 24 hours, military spokesman Brigadier General Effie Defrin has said. Israel deployed dozens of warplanes to strike over 60 targets in Tehran and western Iran, including missile launchers and missile-production sites, he said.  \"The aim of the operation is to eliminate the existential threat to the State of Israel, significantly damage Iran's nuclear programme in all its components, and severely impact its missile array,\" he said. Early on Thursday Israel issued an evacuation warning to residents of the Iranian Arak and Khandab regions where Iran has heavy water reactor facilities. Heavy water is important in controlling chain reactions in the production of weapons grade plutonium. Meanwhile Iran says it has arrested 18 people it describes as \"enemy agents\" who it says were building drones for the Israelis in the northern city of Mashhad. Iran also launched small barrages of missiles at Israel on Wednesday with no reports of casualties. Israel has now eased some restrictions for its civilians. Read more:Trump's words designed to stoke tension, confuse and apply intense pressure on IranMAGA civil war breaks out over Trump's potential decision to join conflict with Iran The US is working to evacuate its citizens from Israel by arranging flights and cruise ship departures, the US ambassador to the country has said. In the UK, Sir Keir Starmer chaired a COBRA emergency meeting on the situation in the Middle East, with a Downing Street spokesperson saying: \"Ministers were updated on efforts to support British nationals in region and protect regional security, as well as ongoing diplomatic efforts\"."
    },
    {
        "title": "US senator Ted Cruz claims Iran is building missiles that can 'murder Americans'",
        "description": "A senior US senator who supports Donald Trump has told Sky News why he believes the US would be right to intervene in Iran.",
        "url": "https://news.sky.com/story/us-senator-ted-cruz-claims-iran-is-building-missiles-that-can-murder-americans-13385635",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ted-cruz-us_6945454.jpg?20250618185743",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-18 18:20:00",
        "Headline": "The former Republican presidential candidate tells Sky's David Blevins that because \"Iran is also building ICBMs\" and \"You don't need an ICBM to go to Israel\", then it indicated Iran's intention \"to take a nuclear weapon to the United States to murder Americans\".",
        "Content": " A senior US senator who supports Donald Trump has told Sky News why he believes the US would be right to intervene in Iran. Senator Ted Cruz, a Republican from Texas who ran against Mr Trump in 2016 but now backs him, told US correspondent David Blevins that Iran is an \"acute threat to the national security of the US\". He went on to claim that because \"Iran is also building ICBMs (intercontinental ballistc missiles)\" and \"You don't need an ICBM to go to Israel\", it indicated Iran's intention \"to take a nuclear weapon to the United States to murder Americans\". \"Nobody is talking about invading Iran,\" Mr Cruz added. \"We're not going to see boots on the ground.\" Middle East latest: Trump says he 'may or may not' strike Iran It comes after the US president said he \"may do it, I may not do it\" when asked if he would launch a strike against Iranian nuclear facilities. So far, Israel has been attacking Iran alone since it ramped up its military action last Friday, launching strikes against what it says are Tehran's facilities for developing a nuclear weapon and also destroying its air defences. \n                  US President Donald Trump says he 'may or may not' strike Iran as Israel's air war continues\n                 \n                  US moving warplanes to Middle East in 'demonstration of force' - this is the aircraft to watch\n                 \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 Iran has always denied seeking the ability to make a nuclear weapon from its uranium enrichment programme. Blevins's fellow US correspondent Mark Stone says that while figures like Mr Cruz back military action, \"a whole host of other figures are saying 'do not do it'\". \"The social media space is absolutely full of MAGA [Make America Great Again] figures from the right... saying 'we absolutely must not go into Iran'.\" If the US were to decide to take military action against Iran, it could have implications for the UK, as America may ask to station refuelling aircraft at a British base in Cyprus and B-2 bombers, which could carry the bunker buster bombs required to attack Iran's Fordow nuclear enrichment facility, could launch from the British base of Diego Garcia. Mr Cruz told Sky News that while many of Mr Trump's support base did not want to see the US involve itself in another war, \"the overwhelming majority of Americans, nearly 80%, support President Trump, and support President Trump defending us against an Iranian nuclear weapon.\""
    },
    {
        "title": "US moving warplanes to Middle East in 'demonstration of force' - this is the aircraft to watch",
        "description": "America is deploying more fighter planes to the Middle East in a \"demonstration of force\" as tensions escalate and speculation about a possible US strike on Iran continues.",
        "url": "https://news.sky.com/story/us-moving-warplanes-to-middle-east-in-demonstration-of-force-this-is-the-aircraft-to-watch-13385510",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-middle-east_6945327.png?20250618162331",
        "type": "US",
        "Author": "Michael Drummond, foreign news reporter; Adam Parker and Lina-Serene, Data &amp; Forensics",
        "Date Published": "2025-06-18 13:02:00",
        "Headline": "Pictures and flight tracking data show F-35 jets and tanker aircraft being moved towards the region, providing options for President Donald Trump. But the movement of one particular aircraft could reveal the most about America's intentions towards Iran...",
        "Content": "By Michael Drummond, foreign news reporter; Adam Parker and Lina-Serene, Data & Forensics  America is deploying more fighter planes to the Middle East in a \"demonstration of force\" as tensions escalate and speculation about a possible US strike on Iran continues. Pictures and flight tracking data show F-35 jets and tanker aircraft being moved towards the region, as well as the tasking of an aircraft carrier, providing options in case President Donald Trump decides to intervene in the conflict. But one particular aircraft that has not been seen just yet - the B-2 stealth bomber - could reveal the most about America's intentions towards Iran... Why is America moving more aircraft to the Middle East? \"It's giving them options,\" says military analyst Michael Clarke. \"They have got four types of aircraft - including fighters, interceptors and fighter-bombers - all in the right region.\"  The new arrivals can be spread around several existing military bases that the US has in the region in Bahrain, Qatar, UAE, Kuwait and Saudi Arabia. \"More is better and also it's a demonstration of force,\" Prof Clarke added. \"There's a political element behind it, to show the Iranians what they can do, but also to other allies. \n                  Why did Ballymena become the latest site of anti-immigration riots?\n                 \n                  Birth rates are plummeting worldwide - but it's not because people don't want kids anymore\n                 \n                  'He was going to kill me': More strangulation cases recorded by police - but many investigations falter\n                 \"The Americans want to be taken seriously in all of this.\" Analysis: What aircraft have moved to the region? Sky News analysis of flight-tracking data shows more than 30 US military planes have been active over parts of Europe and the Mediterranean Sea over the past three days. These include planes used for reconnaissance, refuelling in mid-air as well as carrying cargo. An air-traffic control recording from the US suggests F-22 Raptors are being sent across the Atlantic. Two refuelling tankers are visible on flight tracking data leaving the US east coast, likely escorting the stealth fighter jets. In images taken by photographer Glenn Lockett in Suffolk, three US air tankers were seen flying over England, each accompanied by four F-35 jets. F-35s are one of the most advanced warplanes in the world, known for their ability to evade enemy radar. Flight tracking data shows that the tankers travelled to the Mediterranean and then returned to the UK. Most of the US military planes tracked by Sky News regularly turn off their locations and final destinations, according to the data from Flightradar24. Some of the planes moved from the US to Europe, while others appeared to move closer to the Middle East. At least five of the US military aircraft landed at Chania Airport on the Greek island of Crete. US insists deployments are defensive US defence secretary Pete Hegseth stressed that the deployment of more aircraft was defensive in nature, as Washington looks to safeguard its forces in the region. Fighter aircraft have been used to shoot down drones and projectiles in the past. America already has a substantial force in the Middle East, with nearly 40,000 troops as well as air defence systems, aircraft and warships. But as the conflict between Israel and Iran carries on - and President Trump continues to make threats against Tehran - it's possible that multiple options could be on the table for intervention. B-2 bombers - the ones to watch? Asked what he's looking out for as speculation about whether the US will intervene directly continues, Prof Clarke pointed to one particular aircraft that hasn't been seen moving towards the region yet: The B-2 stealth bomber. Known for its iconic triangle shape and ability to penetrate deep air defences undetected, the B-2 has lesser-known capability that could be crucial for any action over Iran: it can carry 'bunker buster' bombs. So far Israel has not been able to damage Iran's secretive Fordow uranium enrichment plant, which is buried deep beneath a mountain. The only bomb believed to be powerful enough to penetrate the facility is America's GBU-57, a 14-ton bomb that is so heavy it can only be launched from the US fleet of heavy bomber aircraft. Any movement of B-2 bombers to the joint UK-US base on Diego Garcia in the Indian Ocean could \"indicate the likelihood that the Americans are going to use bunker busters in Iran,\" Prof Clarke says."
    },
    {
        "title": "Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates",
        "description": "The US central bank has made no change to interest rates and warned the world's biggest economy will see less growth and higher inflation due to tariffs. ",
        "url": "https://news.sky.com/story/tariffs-hit-us-economy-forecast-but-the-fed-unmoved-by-latest-trump-threats-with-no-change-to-interest-rates-13385626",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-federal-reserve_6945458.jpg?20250618190738",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-18 17:58:00",
        "Headline": "The decision came despite President Trump calling the chair of the Federal Reserve a \"stupid person\".",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The US central bank has made no change to interest rates and warned the world's biggest economy will see less growth and higher inflation due to tariffs.  The Federal Reserve, known as the Fed, held rates despite President Donald Trump calling its chair, Jerome Powell, a \"stupid person\" on Wednesday. \"Maybe I should go to the Fed. Am I allowed to appoint myself at the Fed? I'd do a much better job than these people,\" Mr Trump said. Money blog: 'Uncomfortable reality check' for home buyers Despite appointing Mr Powell himself in 2017, Mr Trump has expressed anger towards the Fed chair at multiple points in the past for not bringing down borrowing costs through interest rate cuts. In his own address to reporters, Mr Powell declined to hit back. The tariff effect  \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                 \n                  Could Trump choose a US strike on Iran?\n                 \n                  Trump's words designed to stoke tension, confuse and apply intense pressure on Iran\n                 But Mr Trump's signature economic policy of tariffs - taxes on imports - was again forecast to cause higher inflation and lower economic growth in the US. The Fed's predictions for inflation were upgraded to 3.1% for 2025 from 2.5% in December, while the outlook for US economic growth was downgraded to 1.4% from 2.1% in December. The effect of those extra taxes on imports will take time to work its way through the system and show up in prices on shelves, the Fed chair said.  An uncertain outlook While the level of uncertainty peaked in April, when Mr Trump announced many of his tariffs, and has since fallen, it remains elevated, Mr Powell said. The exact impact of the levies is unclear and depends on the levels they reach, he added. Many of the country-specific tariffs have been paused for 90 days, which is currently due to end on 8 July. Despite this, the economy is in a \"solid position\", Mr Powell said. Interest rates were kept at 4.25%-4.5%. Unlike the UK, the US interest rate is a range to guide lenders rather than a single percentage. A slowdown in the US economy can have an impact on the UK as the US is its largest trading partner. On Thursday, it's the turn of the UK central bank, the Bank of England, to make its latest interest rate determination, with no change also expected."
    },
    {
        "title": "R Kelly rushed to hospital after prison 'overdose' plot, his lawyers say",
        "description": "R Kelly was hospitalised after prison officials gave him an overdose of medication, his lawyers have claimed &#8211; as part of what they say is an ongoing assassination plot.",
        "url": "https://news.sky.com/story/r-kelly-rushed-to-hospital-after-prison-overdose-plot-his-lawyers-say-13385299",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kelly-court_6944891.jpg?20250618080422",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-18 06:56:00",
        "Headline": "The singer was taken to hospital on Friday after prison staff \"administered an overdose of his medication\", according his lawyer in a court document.",
        "Content": "R Kelly was hospitalised after prison officials gave him an overdose of medication, his lawyers have claimed – as part of what they say is an ongoing assassination plot. Kelly, whose full name is Robert Sylvester Kelly, is currently serving time at the Federal Correctional Institute in Butner, North Carolina, after being convicted of sex trafficking and racketeering in 2021. A year later, he was found guilty on three charges of producing child sexual abuse images and three charges of enticement of minors for sex. The 58-year-old was taken to hospital on Friday after prison staff \"administered an overdose of his medication\", according to a court document filed by his lawyer.  The document, filed on Tuesday, reads: \"Mr. Kelly's life is in danger, and that danger is coming from Bureau of Prisons officials and their actions. \"Mr. Kelly needs this Court's intervention. His life actually depends on it.\" Nicole Blank Becker, one of Kelly's lawyers, said he is in solitary confinement and that she spoke with him on Monday. \"What is happening right now with him is insane,\" she said. \"I hope that this really results in someone, somewhere, somehow getting ahold of him today and getting him back in the hospital.\" A spokesperson for the Bureau of Prisons said in a statement that \"for privacy, safety, and security reasons, we do not discuss the conditions of confinement for any incarcerated individual, including medical and health-related issues\". \"Additionally, the Bureau of Prisons does not comment on pending litigation or matters that are the subject of legal proceedings,\" they added. The allegation is the latest in a line of similar claims from the singer's legal team, who last week filed a motion accusing the Bureau of Prisons of instructing another inmate to kill Kelly. Read more:Musk posts 'drug test results'Juror dismissed from Diddy trial A motion filed by Kelly's legal team claimed Mikeal Glenn Stine, who is alleged to be a member of the Aryan Brotherhood gang and has a terminal cancer diagnosis, was given a chance to \"to live out the last of those months as a free man\" in exchange for killing the singer. The next day, his legal team filed additional material saying he had been moved to solitary confinement and denied access to his lawyer. Prosecutors rejected the claims as \"repugnant\". Their written response said: \"Kelly has never taken responsibility for his years of sexually abusing children, and he probably never will. \"Undeterred, Kelly now asks this Court to release him from incarceration indefinitely under the guise of a fanciful conspiracy.\""
    },
    {
        "title": "Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates",
        "description": "The US central bank has made no change to interest rates and warned the world's biggest economy will see less growth and higher inflation due to tariffs. ",
        "url": "https://news.sky.com/story/tariffs-hit-us-economy-forecast-but-the-fed-unmoved-by-latest-trump-threats-with-no-change-to-interest-rates-13385626",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-federal-reserve_6945458.jpg?20250618190738",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-18 17:58:00",
        "Headline": "The decision came despite President Trump calling the chair of the Federal Reserve a \"stupid person\".",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The US central bank has made no change to interest rates and warned the world's biggest economy will see less growth and higher inflation due to tariffs.  The Federal Reserve, known as the Fed, held rates despite President Donald Trump calling its chair, Jerome Powell, a \"stupid person\" on Wednesday. \"Maybe I should go to the Fed. Am I allowed to appoint myself at the Fed? I'd do a much better job than these people,\" Mr Trump said. Money blog: 'Uncomfortable reality check' for home buyers Despite appointing Mr Powell himself in 2017, Mr Trump has expressed anger towards the Fed chair at multiple points in the past for not bringing down borrowing costs through interest rate cuts. In his own address to reporters, Mr Powell declined to hit back. The tariff effect  \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                 \n                  Could Trump choose a US strike on Iran?\n                 \n                  Trump's words designed to stoke tension, confuse and apply intense pressure on Iran\n                 But Mr Trump's signature economic policy of tariffs - taxes on imports - was again forecast to cause higher inflation and lower economic growth in the US. The Fed's predictions for inflation were upgraded to 3.1% for 2025 from 2.5% in December, while the outlook for US economic growth was downgraded to 1.4% from 2.1% in December. The effect of those extra taxes on imports will take time to work its way through the system and show up in prices on shelves, the Fed chair said.  An uncertain outlook While the level of uncertainty peaked in April, when Mr Trump announced many of his tariffs, and has since fallen, it remains elevated, Mr Powell said. The exact impact of the levies is unclear and depends on the levels they reach, he added. Many of the country-specific tariffs have been paused for 90 days, which is currently due to end on 8 July. Despite this, the economy is in a \"solid position\", Mr Powell said. Interest rates were kept at 4.25%-4.5%. Unlike the UK, the US interest rate is a range to guide lenders rather than a single percentage. A slowdown in the US economy can have an impact on the UK as the US is its largest trading partner. On Thursday, it's the turn of the UK central bank, the Bank of England, to make its latest interest rate determination, with no change also expected."
    },
    {
        "title": "Santander approaches TSB-owner about high street banking merger",
        "description": "Santander has approached its fellow Spanish banking group Sabadell about a takeover of TSB, its British high street bank.",
        "url": "https://news.sky.com/story/santander-approaches-tsb-owner-about-high-street-banking-merger-13385372",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-tsb-banking_6441999.jpg?20240202152041",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-18 09:24:00",
        "Headline": "The approach to Banco Sabadell by Britain's fifth-biggest bank comes months after Santander chair Ana Botin denied that she was looking to sell its network of roughly 350 branches, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Santander has approached its fellow Spanish banking group Sabadell about a takeover of TSB, its British high street bank. Sky News has learnt that Santander is among the parties which have expressed an interest in a potential deal, months after its boss denied that it was seeking to offload the UK's fifth-largest retail bank. City sources said on Wednesday that Santander had not tabled a formal offer for TSB, and was not certain to do so. Money latest: What inflation data means for home buyers However, the fact that it has contacted Sabadell about a possible transaction involving TSB suggests that Ana Botin, the Santander chair, may be open again to expanding its presence in Britain's high street banking market. The extent of the overlap between the two companies' UK branch networks was unclear on Wednesday morning. Santander, which like other banks has been engaged in an extensive branch closure programme for some time, now has roughly 350 UK branches, while TSB operates roughly half that number. \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 \n                  Is the cost of living crisis over? Here's what the data reveals\n                 \n                  Inflation slows to 3.4% but no Bank of England rate cut expected\n                 The value that TSB, which was acquired by Sabadell in 2015 from Lloyds Banking Group, might attract in any takeover is also unclear. Sabadell is in the middle of attempting to thwart a hostile takeover by rival Spanish bank BBVA - a deal revealed by Sky News last year - with a disposal of TSB said to be on the cards regardless of whether or not that bid is successful. Ms Botin insisted that the UK remains a core market for Santander in the wake of speculation that she might sanction a sale of the business. The company recently confirmed a Sky News report that Sir Tom Scholar, the former top Treasury official sacked by Liz Truss during her brief premiership, was joining the bank's UK arm as its next chairman. NatWest Group, which recently returned to full private ownership, was reported to have submitted an offer worth about £11bn for Santander UK. No discussions are ongoing about such a deal. NatWest, Barclays and HSBC have also been touted as potential suitors for TSB, although at least two of those three banks are thought to have little interest in bidding. TSB was effectively created from the ashes of the 2008 financial crisis, when a vehicle set up to acquire assets from distressed banking groups lost out in an auction to a bid from the Co-operative Bank. That deal fell through when it emerged that the Co-operative Bank itself was in a perilous financial state. Sabadell explored a sale of TSB about five years ago, but opted to retain the business. Goldman Sachs is thought to be advising Sabadell on the prospective sale of TSB. Read more from Sky News:Inflation slows but no rate cut likelyWestern goods in Russian shops despite sanctionsCo-op discount offer after cyberattack Responding to a report in the Financial Times on Sunday that TSB had been put up for sale, Banco Sabadell said: \"Banco Sabadell confirms that it has received preliminary non-binding expressions of interest for the acquisition of the entire share capital of TSB Banking Group plc. \"Banco Sabadell will assess any potential binding offer it may receive.\" Santander declined to comment. The TSB process emerged just hours after Sky News had revealed that Metro Bank, the high street lender, had been approached by Pollen Street Capital, the private equity firm, about a possible takeover. The absence of a statement from either party implies that the approach was rejected and that Pollen Street has abandoned its interest, at least temporarily."
    },
    {
        "title": "Is the cost of living crisis over? Here's what the data reveals",
        "description": "Is the cost of living crisis over?",
        "url": "https://news.sky.com/story/no-sign-of-cost-of-living-crisis-end-amid-big-consequential-geopolitical-shifts-13385470",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-cost-of-living-inflation_6194588.jpg?20230621121501",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-06-18 11:39:00",
        "Headline": "While it makes sense to look at yearly inflation rises, the pressure on households makes a lot more sense when you look back at the massive rise over the past four years. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Is the cost of living crisis over? If you're looking purely at the annual inflation data, the numbers us journalists, not to mention politicians and economists, tend to focus on, the answer might seem like: probably, yes. Sure, the rate is, at 3.4% in May, higher than the Bank of England's 2% target. But it's far below the double-digit peaks experienced in 2022. Plus, the Bank itself thinks prices are likely to drop back down towards 2% in the coming year or two, even assuming a few more interest rate cuts. End of story, right? Money blog: Latest inflation data 'uncomfortable reality check' for home buyers Well, not quite. Because look a bit deeper into the numbers and you notice a couple of important things. The first is that whether the cost of living squeeze is over really depends on how you slice up the numbers. Look in a slightly different way and actually this is still an ongoing crisis for millions of families around the country. \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  Tens of thousands to get compensation over forced prepayment meters\n                 \n                  Energy price cap drop is welcome - but eyes will be on Trump, Ukraine and the weather ahead of winter\n                 An ongoing crisis To see what I mean, recall that when economists talk about inflation, they are really referring to something quite specific. The rate at which the average level of prices across the economy (actually, it's a shopping basket of representative goods) has changed over the past year. And the change in that level over the past year is indeed 3.4%. But look back a bit further, say the past four years, and the rate of change is 25%. Why looking back makes sense Both of these numbers are accurate. They are both expressions of inflation, except that one is for a single year and the other is for a four-year period. But when you're going to the supermarket, or buying a big ticket item like a computer or a car, are you really thinking back over a 12-month horizon or, perhaps, thinking back further? For a lot of people, that four-year horizon feels much more representative of their everyday lives and retail decisions than the one-year horizon. True: the fact that it's up 25% is largely because of the enormous rise in prices in 2022 amid the energy price shock and Russia's invasion of Ukraine. But (and one can't emphasise this enough), it's not like prices went up and then went down. The prices went up and stayed up (in fact, they carried on getting more expensive). And when you look at the four-year, \"recent memory\" rate of inflation, it's higher in recent months than any period going back to the early 1990s. Now, economists have very good reasons for focusing on the annual rate of inflation. But by the same token, you can see why so many people scoff when they see the latest inflation data, finding it bears little resemblance to their lived experience. The problem isn't so much the data itself but the way we focus on an annual rate. Expect yo-yoing in the coming months However, even that annual rate might be in for more of a roller coaster than most economists assume. Because the second important underlying issue to remember is that we're living through big, consequential geopolitical shifts that could well be very inflationary but are really hard to model. Consider the events in the Middle East. Military conflict between Israel and Iran has already pushed the oil price up by 18% in June alone. If that price stays elevated, that will feed into higher petrol and other prices in the UK and further afield. And since no one has a clue what will happen next, you can expect that price to yo-yo around quite violently in the coming months. More broadly, it's very hard to know for sure what the impact of tariffs will be on UK inflation. The Bank of England's estimates in its latest set of forecasts suggested a reassuringly small impact on both economic growth and inflation. But no one really knows whether manufacturers will lift prices just for American consumers or for the rest of the world too. Finally, it's worth noting that in much the same way as the past few decades of globalisation were, all else equal, quite deflationary - with prices dropping as manufacturers shifted production to cheaper parts of the world, primarily Asia - the reversal of those forces could be very inflationary. Again, all this stuff is very hard to model and forecast. But we are living through a period of volatility, with significant historical shifts. It would be remarkable if that weren't reflected in the economic data, at some point."
    },
    {
        "title": "Inflation slows to 3.4% but no Bank of England rate cut expected",
        "description": "Inflation eased to an annual rate of 3.4% in May, according to official figures released this morning, but the Bank of England is still widely expected to leave interest rates on hold.",
        "url": "https://news.sky.com/story/inflation-slows-to-34-but-no-bank-of-england-rate-cut-expected-13385276",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-18 04:32:00",
        "Headline": "An easing in air fare and fuel prices is largely offset by higher white goods and food costs, according to the latest official figures.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Inflation eased to an annual rate of 3.4% in May, according to official figures released this morning, but the Bank of England is still widely expected to leave interest rates on hold. The Office for National Statistics (ONS) reported the consumer prices index measure eased from 3.5% the previous month. It said that despite upwards pressure on prices from food and clothing, the decline was driven by falls in airfare prices following Easter. Money latest: What easing inflation means for your money The headline figure also reflected a small downwards correction to ONS inflation data ahead of April related to vehicle excise duty calculations. ONS acting chief economist Richard Heys said: \"A variety of counteracting price movements meant inflation was little changed in May. \"Air fares fell this month, compared with a large rise at the same time last year, as the timing of Easter and school holidays affected pricing. Meanwhile, motor fuel costs also saw a drop. \n                  Is the cost of living crisis over? Here's what the data reveals\n                 \n                  Interest rate cut to 4.25% by Bank of England\n                 \n                  Federal Reserve warns of impact of Trump tariffs as US interest rates held\n                 \"These were partially offset by rising food prices, particularly items such as chocolates and meat products. \"The cost of furniture and household goods, including fridge freezers and vacuum cleaners, also increased.\" Forecasts suggest that inflation will tick up over the second half of the year - with effects from Donald Trump's trade war and rising commodity costs amid events in the Middle East among the concerns ahead for the Bank of England. It has adopted a \"careful\" and \"gradual\" approach to interest rate cuts as a result. That is despite weakening employment data, reported earlier this month, which showed a tick up in the official jobless rate and a 109,000 reduction in payrolled employment. Business and economics reporter Today's headline inflation number suggests a flat picture for price growth overall. But there is one stat that households will already be familiar with after a visit to the supermarket. A jump in some food prices has been noticeable, with the ONS flagging a leap in its food and non-alcoholic drinks measure of inflation to a 15-month high. Why the rise? Chocolate has spiked significantly this year due to a cocoa shortage blamed on poor harvests. Meat, particularly beef, has shot up on high global demand and rising costs. The food and non-alcoholic drinks category has been on the rise for five months in a row. But the good news is that high rates of sales promotions by chains - discounts - are helping keep a lid on overall grocery bills. Other elements of the inflation data are also supportive of an argument for rate cuts. Core CPI inflation - a measure that strips out volatile elements such as energy and food - eased from 3.8% in April to 3.5% while services inflation tumbled sharply to 4.7% from 5.4% the previous month.  Nevertheless, the Bank is widely expected to leave Bank rate on hold on Thursday following the June meeting of its rate-setting committee. LSEG data showed after the inflation data that financial markets currently see two more interest rate cuts by the year's end. Read more from Sky News:Any US intervention 'would be recipe for all-out war', Iran warnsKellogg's and Coca-Cola on Russian shelves despite sanctions Risks to prices ahead will come from a sustained Israel-Iran war pushing up oil and gas prices but there have been different views among policymakers over whether the trade war will result in inflation or not. As such, the minutes of the Bank's meeting will be closely scrutinised for hints on whether rate cut caution is easing."
    },
    {
        "title": "Warm Home Discount extended to 2.7 million more households",
        "description": "Energy bill discounts of &#163;150 will be extended to another 2.7 million households to help with fuel costs this winter.",
        "url": "https://news.sky.com/story/warm-home-discount-extended-to-27-million-more-households-13385639",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gas-energy_6839038.jpg?20250225100236",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-18 21:30:00",
        "Headline": "The number of people eligible for a £150 rebate on their energy bills has increased. ",
        "Content": "Energy bill discounts of £150 will be extended to another 2.7 million households to help with fuel costs this winter. It brings the number of households eligible for the Warm Home Discount up to just over 6 million, including 900,000 families with children, the Department for Energy Security and Net Zero (DESNZ) said. The changes mean every bill payer on means-tested benefits will qualify, removing the high-cost-to-heat threshold in the current regulations. It follows a government consultation on expanding the one-off payment to more people struggling with fuel poverty. Prime Minister Keir Starmer said: \"I know families are still struggling with the cost of living, and I know the fear that comes with not being able to afford your next bill. \"Providing security and peace of mind for working people is deeply personal to me as prime minister and foundational for the Plan for Change. \"I have no doubt that, like rolling out free school meals, breakfast clubs and childcare support, extending this £150 energy bills support to millions more families will make a real difference.\" \n                  Crucial evidence in Post Office scandal found in garage of retired computer expert after 30 years\n                 \n                  Why I'm praying assisted dying bill passes major vote - even though it's not going to happen in my lifetime\n                 \n                  Thousands of deaths in 2025 will be linked to air pollution, report warns\n                 The Conservatives criticised the move, saying the announcement will only cut bills for a quarter of households. Andrew Bowie, the acting shadow energy secretary, criticised Labour's green energy drive, claiming that it would increase bills for most people. \"Kemi Badenoch and I have been clear that net zero by 2050 is impossible without bankrupting Britain and making hard-working families worse off,\" he said. Read More:Battle to convince MPs to back benefit cuts to more than three million householdsEnergy bosses clash over 'postcode pricing' proposals   Typical yearly energy bills are expected to fall by £129 from July, Ofgem has said.  However typical bills under the July to September 2025 price cap will still be 42% higher than in winter 2021/22, according to a House of Commons research briefing. The Warm Home Discount scheme was introduced by the coalition government in 2011 to help people on low incomes with their fuel bills. Adam Scorer, the chief executive of National Energy Action, said today's announcement is \"hugely positive news\" but is \"far from sturdy\". \"The rebate has only increased by a meagre £10 during a period in which energy bills have gone up by £500 a year and there is no clarity on the programme beyond the end of March next year,\" he said. \"This announcement is good news for this winter, but the government needs to come up with a longer-term plan for providing deeper support in future for people who cannot afford a warm and healthy home.\""
    },
    {
        "title": "CVC Capital backs £500m Jersey bid for Manx Telecom",
        "description": "An infrastructure investor owned by the private equity giant CVC Capital Partners is in talks to back a &#163;500m takeover of Manx Telecom in a deal that unites the Crown Dependencies' communications providers.",
        "url": "https://news.sky.com/story/cvc-capital-backs-163500m-jersey-bid-for-manx-telecom-13385587",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-manx-telecom-isle-of-man_6751839.jpg?20241119120527",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-18 15:30:00",
        "Headline": "CVC DIF, the private equity giant's infrastructure arm, is backing the parent company of Jersey Telecom in a bid to acquire the Isle of Man's main telecoms provider, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An infrastructure investor owned by the private equity giant CVC Capital Partners is in talks to back a £500m takeover of Manx Telecom in a deal that unites the Crown Dependencies' communications providers. Sky News has learnt that CVC DIF is being lined up to help finance a takeover of Manx Telecom by JT Group, which owns Jersey Telecom. A deal could be agreed within a matter of weeks, according to telecoms industry sources. CVC DIF's involvement in the prospective deal comes seven months after JT Group was reported to have held an earlier set of talks aimed at taking control of Manx Telecom. Money blog: 'Uncomfortable reality check' for home buyers The Isle of Man's principal telecoms and broadband service provider is owned by Basalt Infrastructure Partners following a deal struck in 2019. Founded in 1888, Jersey Telecom is owned by the island's government. It claims to have been the world's first telecoms company to offer 100% fibre-to-the-home and businesses for every broadband user. The precise details of its financing partnership with CVC DIF were unclear on Wednesday. A spokesman for CVC, whose private equity investments include Six Nations rugby and the insurance company Domestic & General, declined to comment. JT Group and Manx Telecom have both been contacted for comment."
    },
    {
        "title": "Co-op offers 25% off £40 shop as 'thank you' to members after cyberattack",
        "description": "Co-op is offering its members a 25% discount on a &#163;40 shop as a \"thank you\" gesture after a major cyberattack caused disruption in stores.",
        "url": "https://news.sky.com/story/co-op-offers-25-off-16340-shop-as-thank-you-to-members-after-cyberattack-13385290",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-co-op-co-op_6944851.jpg?20250618065149",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-18 05:50:00",
        "Headline": "The major cyberattack in May on the Co-op left shelves bare, with hackers also stealing members' personal data.",
        "Content": "Co-op is offering its members a 25% discount on a £40 shop as a \"thank you\" gesture after a major cyberattack caused disruption in stores. The retailer's stock was affected due to the attack in May, leaving shelves bare, and payments were disrupted. Hackers also stole personal data including members' names and contact details. Co-op was among several retailers like Marks & Spencer (M&S) and Harrods to have been hit by a cyberattack recently, with bosses at M&S saying the incident was likely to cost the business around £300m. Co-op announced the offer to its 6.5 million members who supported the business during the cyberattack as its 2,300 food stores returned to usual trading. The offer runs from 18 to 24 June and can be used by members, including new ones, once. Read more from Sky News:Cole Cooper death: Mum alleges 'third party' involvedLabour MPs threaten rebellion over benefit cuts Co-op managing director of food Matt Hood said: \"I'm very proud that, thanks to the work of our colleagues, we are very near to making a full and complete recovery from the recent cyberattack on our Co-op, and I'm delighted to see our stores looking back to normal and being able to serve our shoppers and communities. \"We are so grateful to our member owners for their support and patience with us during what was a very difficult time and hope this gesture of appreciation goes a little way to showing them our thanks, with more value rewards to come over the summer.\""
    },
    {
        "title": "Is Kemi Badenoch's grooming gangs outrage just politics or does she really care?",
        "description": "Here's a rule I tend to apply across the board in Westminster: If a politician is talking, politics is probably taking place.",
        "url": "https://news.sky.com/story/is-kemi-badenochs-grooming-gangs-outrage-just-politics-or-does-she-really-care-13385313",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kemi-badenoch-grooming_6944231.jpg?20250617114210",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-06-18 07:39:00",
        "Headline": "The Conservative leader insists she is not politicising the grooming gangs scandal after the review author said she was \"disappointed\" with the Tories' approach.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Here's a rule I tend to apply across the board in Westminster: If a politician is talking, politics is probably taking place. Add into that, if the topic of debate is especially grave or serious, be more prepared to apply the rule, not less. Which brings us to the grooming scandal. There is no doubt Tory leader Kemi Badenoch was politicising the issue when she ripped into the government in the Commons on Monday. In fact, she admitted as much.  Asked about it during her news conference, she said: \"When I'm in the Commons, I will do politics. If every time we are pointing things out and doing our job we are accused of politicising something, it makes it a lot harder.\" So the question here is less about whether politics is at play (it almost always is and that's not necessarily a bad thing), and more about whose interests the politics is working towards. In other words, does Ms Badenoch care about the grooming scandal because she cares about victims or because she cares about herself?  To answer that, it's useful to try and pinpoint exactly when the Tory leader started showing such a keen desire for a public inquiry. Was she always harbouring it? Or did it only arrive after Elon Musk and others pushed the scandal back up the news agenda? On this, she's not helped by the record of the governments she served in. Yes, the broader child abuse inquiry was announced under David Cameron, but there was no specific statutory grooming inquiry. As late as 2022, the then Tory safeguarding minister was batting away demands for a public inquiry on the basis that locally-led probes were preferable. That is - as it happens - the same explanation the current Labour safeguarding minister Jess Phillips offered to Oldham Council in the rejection letter that sparked outrage and set us on a path to this eventual outcome. Read more:Officials tried to cover up grooming scandal, says CummingsWhy many victims welcome national inquiry into grooming gangsGrooming gangs scandal timeline  \"If we'd got this right years ago then I doubt we'd be in this place now,\" wrote Baroness Casey in her audit. If Labour can be attacked for acting too slowly, the Tories - and by extension Ms Badenoch - can be too. In response, her aides insist she was bound by collective responsibility while she was a minister, and that the issue was outside her brief. Ms Badenoch also points to her work with patients of the now closed Tavistock Gender Identity Clinic as evidence of her track record campaigning for change in thorny policy areas. In this context, the presence in the grooming scandal of questions around the role of gender and ethnicity mark this as an issue that you'd expect the Tory leader to not only be interested in, but to genuinely care about too. But as previously discussed, just because a politician is somewhat sincere in what they are saying, doesn't mean there isn't a dollop of politics mixed in too. And having dug out a recording of a post-PMQs briefing with Ms Badenoch's media adviser from January, that certainly seems to be the case here. Asked what had changed to trigger the calls for an inquiry, the spokesperson said: \"We can all go back and look at the reasons why this entered the popular discourse. This is something that is of high public salience.\" Or to put it another way, the politics changed."
    },
    {
        "title": "How much does Starmer know about Trump's Iran plan?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>   ",
        "url": "https://news.sky.com/story/how-much-does-starmer-know-about-trumps-iran-plan-13385285",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-18 05:25:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics.  They start by picking over what Sir Keir Starmer had to say about the potential for an American attack on Iran - which sounded rather different from the line his German counterpart was taking. So what was going on there then? Back in Westminster, the details of benefit cuts which will impact millions get published - the government needs to convince dozens of Labour MPs to back the plan. And HS2 slows down - we'll hear today the new line will be delayed beyond 2033."
    },
    {
        "title": "Sharing deepfake pornography 'the next sexual violence epidemic facing schools'",
        "description": "Sharing deepfake pornography is \"the next sexual violence epidemic\" facing schools, the author of a book on the spread of online misogyny has told MPs.",
        "url": "https://news.sky.com/story/sharing-deepfake-pornography-the-next-sexual-violence-epidemic-facing-schools-13385659",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-18 20:16:00",
        "Headline": "Author Laura Bates tells MPs schools have paid PR firms to deal with the fallout but have not done anything to protect the victims or punish the perpetrator. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sharing deepfake pornography is \"the next sexual violence epidemic\" facing schools, the author of a book on the spread of online misogyny has told MPs. Appearing before the Women and Equalities Committee (WEC), Laura Bates said there needs to be statutory guidance for teachers on how to deal with this \"very significant issue\". She said in every UK case she has investigated, schools have \"paid thousands of pounds hiring PR firms to focus on damage reputation management\". However, in terms of supporting girls and taking action against the perpetrators, \"nothing has happened\". She said of deepfake pornography: \"It is happening, it's significant. Female teachers are affected, which often goes unnoticed, and schools are just not equipped to tackle it. \"My suggestion would be this is the next big sexual violence epidemic facing schools and people don't even know it is going on.\" Deepfakes are pictures, videos or audio clips made with Artificial Intelligence (AI) to look or sound real. While it is illegal to create or share a sexually explicit image of a child, including a deepfake, the technology for making them remains legal. Asked what more could be done to help schools tackle the issue, Ms Bates said in the cases she is aware of \"police investigations are ongoing\" . However, she said she is not suggesting criminalisation of underage boys is the solution and what is needed is education, prevention and regulation. \"It shouldn't be the case that a 12-year-old boy can easily and freely access tools to create these forms of content in the first place,\" she said. Ms Bates is the founder of the Everyday Sexism project and author of: The New Age of Sexism: How the AI Revolution is Reinventing Misogyny. She also called for \"very clear guidance\" on how schools should respond to this challenge. She warned of a repeat of failings that have happened previously with intimate image abuse, where girls have been \"coerced into sending images of themselves\" then punished for taking the image once it has been shared around - but the person spreading the image has not. Calls to ban 'nudifying apps' A government spokesperson told Sky News: \"We are reviewing the relationships, sex and health curriculum to look at all modern-day challenges facing children, including that of deepfake porn, and work to ensure children are taught how to build positive, healthy relationships in an age-appropriate way.\" It comes amid mounting concern among MPs and experts about online safety for children, with many wanting the government to go further with its regulations on big tech firms. Read More:Ofcom sets out new codes of practice to protect children onlineCan Adolescence change the rise of the 'manosphere'? In April, a report by the Children's Commissioner for England found that nudifying apps are disproportionately targeting girls and young women, with many appearing to work only on female bodies. The commissioner, Dame Rachel de Souza, called for an immediate ban on apps that use AI to create naked images of children, saying \"there is no positive reason for these to exist\". Inquiry into the 'manosphere' Ms Bates appeared in front of the WEC as part of their inquiry into how the \"manosphere\" and other online content is fuelling misogyny. The cross-party group has previously heard how the rise of misogyny in young men in particular is not only affecting female pupils but also female staff, with sexual harassment towards teachers described as \"rife\". On Wednesday's session, the committee also heard concerns around the rise of the \"sex tech industry\", including robots and AI girlfriends, with fears this is having a wider impact on attitudes towards women and girls. Sarah Owen, the Labour chair of the WEC, told Sky News she could not pre-empt what recommendations would be made to the government. But she said there was huge concern around the online radicalisation of young men, adding: \"It was a boiling hot room but my blood ran cold at what I was hearing.\""
    },
    {
        "title": "Warm Home Discount extended to 2.7 million more households",
        "description": "Energy bill discounts of &#163;150 will be extended to another 2.7 million households to help with fuel costs this winter.",
        "url": "https://news.sky.com/story/warm-home-discount-extended-to-27-million-more-households-13385639",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-gas-energy_6839038.jpg?20250225100236",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-18 21:30:00",
        "Headline": "The number of people eligible for a £150 rebate on their energy bills has increased. ",
        "Content": "Energy bill discounts of £150 will be extended to another 2.7 million households to help with fuel costs this winter. It brings the number of households eligible for the Warm Home Discount up to just over 6 million, including 900,000 families with children, the Department for Energy Security and Net Zero (DESNZ) said. The changes mean every bill payer on means-tested benefits will qualify, removing the high-cost-to-heat threshold in the current regulations. It follows a government consultation on expanding the one-off payment to more people struggling with fuel poverty. Prime Minister Keir Starmer said: \"I know families are still struggling with the cost of living, and I know the fear that comes with not being able to afford your next bill. \"Providing security and peace of mind for working people is deeply personal to me as prime minister and foundational for the Plan for Change. \"I have no doubt that, like rolling out free school meals, breakfast clubs and childcare support, extending this £150 energy bills support to millions more families will make a real difference.\" \n                  Crucial evidence in Post Office scandal found in garage of retired computer expert after 30 years\n                 \n                  Why I'm praying assisted dying bill passes major vote - even though it's not going to happen in my lifetime\n                 \n                  Thousands of deaths in 2025 will be linked to air pollution, report warns\n                 The Conservatives criticised the move, saying the announcement will only cut bills for a quarter of households. Andrew Bowie, the acting shadow energy secretary, criticised Labour's green energy drive, claiming that it would increase bills for most people. \"Kemi Badenoch and I have been clear that net zero by 2050 is impossible without bankrupting Britain and making hard-working families worse off,\" he said. Read More:Battle to convince MPs to back benefit cuts to more than three million householdsEnergy bosses clash over 'postcode pricing' proposals   Typical yearly energy bills are expected to fall by £129 from July, Ofgem has said.  However typical bills under the July to September 2025 price cap will still be 42% higher than in winter 2021/22, according to a House of Commons research briefing. The Warm Home Discount scheme was introduced by the coalition government in 2011 to help people on low incomes with their fuel bills. Adam Scorer, the chief executive of National Energy Action, said today's announcement is \"hugely positive news\" but is \"far from sturdy\". \"The rebate has only increased by a meagre £10 during a period in which energy bills have gone up by £500 a year and there is no clarity on the programme beyond the end of March next year,\" he said. \"This announcement is good news for this winter, but the government needs to come up with a longer-term plan for providing deeper support in future for people who cannot afford a warm and healthy home.\""
    },
    {
        "title": "Is Labour facing big backlash over welfare reforms?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/is-labour-heading-to-war-over-welfare-reforms-13385569",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/2372506180523152207_6945298.png?20250618155656",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-18 14:58:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Work and Pensions Secretary Liz Kendall has announced new protections in a bill which will attempt to cut benefits to more than three million households.  In its current form, the government faces a big rebellion from dozens of Labour MPs over concerns that changes to welfare will drive families into poverty. On today's episode, Matt Barbet is joined by political correspondent Tamara Cohen to discuss the backlash from inside the Labour Party and the wider public. Producer: Emily HulmeEditor: Soila Apparicio"
    },
    {
        "title": "Welfare cuts vote could be the government's biggest parliamentary test to date",
        "description": "Liz Kendall, the welfare secretary, said today that the welfare system was at a crossroads - and that the road she had chosen was the one of \"compassion, opportunity and dignity\".",
        "url": "https://news.sky.com/story/welfare-cuts-vote-could-be-the-governments-biggest-parliamentary-test-to-date-13385646",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-liz-kendall-politics_6860736.jpg?20250318174352",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-18 19:16:00",
        "Headline": "Dozens of Labour MPs feel that what was promised as a plan to support disabled people into work has instead turned into a cost-cutting exercise to shave £5bn off the budget. ",
        "Content": "\n          Political correspondent\n              @tamcohen\n  Liz Kendall, the welfare secretary, said today that the welfare system was at a crossroads - and that the road she had chosen was the one of \"compassion, opportunity and dignity\". Dozens of Labour MPs feel that what was promised as a plan to support disabled people into work has instead turned into a cost-cutting exercise to shave £5bn off the budget. Politics Live: US may ask UK to station refuelling aircraft at key British base Kendall announced the reforms in March, saying that the welfare bill was \"spiralling\" and \"unsustainable\". The figures are striking: nine million working-age people are economically inactive. Personal Independence Payment (PIP) claims per month have doubled in just five years. Many MPs agree the system needs reform, but worry the government is acting without fully thinking through the consequences. Today saw the legislation published - the Universal Credit and Personal Independence Payment Bill - setting out a tightening of criteria for the main disability benefit in England, PIP. It also sets out plans to cut the health element of Universal Credit and delay access to it until age 22. Forty-two Labour MPs have signed a letter saying they cannot support the changes - and the names include newly-elected MPs who have not been critical of the government before. They say concessions, such as a longer grace period before benefits are removed, are not good enough. Cat Eccles, MP for Stourbridge, who spoke to Sky News today, has been on sickness benefits herself - after an unexpected illness saw her forced out of her job. She said she was worried about people who rely on PIP for the costs of working – such as petrol, and those who would lose it, but not be ready for employment. \"It's really not good enough because we know so many people this is going to affect,\" she said. \"We know PIP can be a gateway to getting other benefits like carers allowance which really help families just survive. We're not even talking about people having some great lifestyle, they're literally barely surviving on these payments. It all just doesn't feel very Labour to me.\" Other MPs who have not yet spoken publicly are concerned. \"It seems as if we're getting all the bad stuff first – before we hear about the job schemes and child poverty strategy\", one said. Read more from Sky News:British woman dies from rabiesUK temperatures 'could hit 46C in future''Murder' may be linked to diamond-encrusted Rolex Several MPs say while the £1bn for tailored support in job centres is welcome, they worry it will not help all those losing out; and they worry about the economic outlook and employers being willing to take people on. Government insiders believe the rebellion can be contained. But it poses a challenge, and both Ms Kendall and Stephen Timms have been devoting time to one-on-one meetings to win around individual MPs. PIP – paid at a basic rate of £73.90 a week at the standard rate, and £110.40 at the enhanced rate – would be restricted from people who do not score four points on the daily living criteria. Disability groups say people who struggle to feed and dress themselves could lose out. Read More: Battle to convince MPs to back benefit cuts  Kathy Laprell, from Eastbourne, who suffers pain and mobility problems following a serious car accident, has been receiving PIP for nine years. She currently qualifies for the enhanced rate, but fears she would not meet the new criteria and lose £440 a month if reassessed when these changes take effect next year. \"People are terrified, we're angry, that yet again we're the scapegoat, we had it with the conservatives for 14 years\", she told Sky News. \"I use it to help pay for my carer's expenses because I pay her, I use it for petrol for the car so I can get out and about, and obviously extra winter fuel; the increase in bills since April has been astronomical. Losing it would mean I would be at food banks to actually be able to eat. \"We're not scroungers. If I could work I would work,\" she said.  Yesterday, employment minister Alison McGovern faced down some angry Labour MPs who had called for the money to be taken from the wealthiest instead, saying the government had already put taxes on private schools and private jets, as well as increasing inheritance tax. MPs are also concerned that after spending months defending the decision to slash Winter Fuel Payments from pensioners, the government was forced into a U-turn. With many yet to be convinced, the first vote in two weeks could be the biggest parliamentary test the government has faced yet."
    },
    {
        "title": "Thousands of deaths in 2025 will be linked to air pollution, report warns",
        "description": "Around 30,000 deaths will be linked to toxic air in the UK in 2025, according to a report from leading doctors, as they urged the government to \"recognise air pollution as a key public health issue\".",
        "url": "https://news.sky.com/story/thousands-of-deaths-in-2025-will-be-linked-to-air-pollution-report-warns-13385661",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-pollution-canary_6945536.jpg?20250618214600",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-18 20:12:00",
        "Headline": "The report by the Royal College of Physicians warned there is \"no safe level\" of air pollutants as it noted how exposure to air pollution can shorten one's life by 1.8years. ",
        "Content": "Around 30,000 deaths will be linked to toxic air in the UK in 2025, according to a report from leading doctors, as they urged the government to \"recognise air pollution as a key public health issue\". The Royal College of Physicians (RCP) warned that around 99% of the population in the UK are breathing \"toxic air\". The report says there is \"no safe level\" of air pollutants while noting how exposure to air pollution can shorten life by 1.8 years on average. That is \"just behind some of the leading causes of death and disease worldwide\", including cancer and smoking, the authors wrote. The college has called on the government to take action to tackle the issue, as it urged ministers to \"recognise air pollution as a key public health issue\". In the forward of the report, England's chief medical officer, Professor Sir Chris Whitty, said: \"Air pollution remains the most important environmental threat to health, with impacts throughout the life course. \"It is an area of health where the UK has made substantial progress in the last three decades with concentrations of many of the main pollutants falling rapidly, but it remains a major cause of chronic ill health as well as premature mortality. \n                  Luton Airport expansion plans approved by transport secretary\n                 \n                  ULEZ lowers air pollution most in London boroughs that opposed it, data reveals\n                 \n                  'Rainmakers' and transboundary smog - Thailand's struggling battle against air pollution\n                 \"Further progress in outdoor air pollution will occur if we decide to make it, but will not happen without practical and achievable changes to heating, transport and industry in particular. \"Air pollution affects everybody, and is everybody's business.\" Read more from Sky News:US senator claims Iran is building missiles that can 'murder Americans'Moscow switches to crisis mode after Trump's Iran threats The report also highlights the economic impact of air pollution as it has an estimated cost of £27bn a year in healthcare costs and productivity losses. Dr Mumtaz Patel, president of the RCP, said: \"Air pollution can no longer be seen as just an environmental issue - it's a public health crisis. \"We are losing tens of thousands of lives every year to something that is mostly preventable and the financial cost is a price we simply cannot afford to keep paying. \"We wouldn't accept 30,000 preventable deaths from any other cause. We need to treat clean air with the same seriousness we treat clean water or safe food. It is a basic human right - and a vital investment in our economic future.\""
    },
    {
        "title": "Global sea levels rising twice as fast as they did last century, according to major scientific report",
        "description": "Global sea levels are now rising twice as fast as they did last century, according to a major new scientific report.",
        "url": "https://news.sky.com/story/global-sea-levels-rising-twice-as-fast-as-they-did-last-century-according-to-major-scientific-report-13385409",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-storm-surge-sea-level-rise_6945096.jpg?20250618124518",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-18 22:00:00",
        "Headline": "Every measure of climate change is going in the wrong direction, and some of them faster than ever before, a vast new paper has warned. Emissions should be falling, but are still rising.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Global sea levels are now rising twice as fast as they did last century, according to a major new scientific report. The study - which takes a laser focus on climate change in the 2020s, a critical decade to stop the worst damage - finds all 10 measures are going in the wrong direction. And most of them are doing so at a faster rate. The findings are \"unprecedented\" but \"unsurprising\", given the world continues to pump record levels of planet-warming gases into the atmosphere. \"We see a clear and consistent picture that things are getting worse,\" said lead author Professor Piers Forster. However, the rate by which emissions are increasing has slowed down, offering a ray of hope they will soon reach their peak. Rising seas The new study found sea levels are now rising on average twice as fast, at 4.3mm a year on average since 2019, up from 1.8mm a year at the turn of the 20th century. The acceleration is stark, but within the realms of what scientists expected. That's because the warming atmosphere has sent more melting ice flowing into the sea, and the ocean water expands as it warms. For the island nation of the UK, which risks coastal flooding, cliff falls and damage to homes and buildings, with 100,000 properties expected to be threatened with coastal erosion in England within 50 years. Dr Aimee Slangen, from the NIOZ Royal Netherlands Institute for Sea Research, said: \"The concerning part is that we know that sea-level rise in response to climate change is relatively slow, which means that we have already locked in further increases in the coming years and decades.\" A UK government spokesperson said: \"We owe it to future generations to tackle the climate crisis, by becoming a clean energy superpower.\" They are also spending £7.9bn on flood defences to \"strengthen our resilience\" and protect thousands of \"homes, small businesses, and vital infrastructure from this growing threat\". Meanwhile, the amount of greenhouse gases the world can still emit while limiting warming to safer levels has plummeted by 74% - from 500 billion tonnes of Co2 to 130bn. That leaves just three years' worth of emissions in the budget if the world is to limit warming to no more than 1.5C above pre-industrial levels - the threshold widely agreed to be the best chance of avoiding very severe impacts. The report, involving more than 60 scientists, also warned the world is warming faster than ever before, by an \"unprecedented\" rate of 0.27C per decade. Read more:Endangered rays, sharks and native oysters 'could thrive' despite climate changeWill there be a hosepipe ban in the UK? Professor Forster later told Sky News: \"There is little good news across the entire indicator set.\" \"This is why I don't have my normal optimism.\" He added: \"Greenhouse gas emissions needed to have started dropping significantly in 2024 if we were to keep a chance of keeping long-term warming below 1.5C. \"The world has failed to do this.\" Change is possible Scientists urged leaders to draw up more ambitious national climate plans before the COP30 climate summit in Brazil in November. \"In a rapidly changing climate, evidence-based decision-making benefits from up-to-date and timely information,\" said the study, Indicators of Global Climate Change 2024, published today in Earth System Science Data. Dr Valérie Masson-Delmotte, from Institut Pierre Simon Laplace, said: \"What happens next depends on the choices which will be made: it is possible, by sharply reducing greenhouse gas emissions, to limit the magnitude of future warming, and protect young generations from the intensification of extreme events.\""
    },
    {
        "title": "Endangered rays, sharks and native oysters 'could thrive' despite climate change, report claims",
        "description": "Endangered rays, sharks and native oysters could thrive in seas around the UK in the decades ahead amid changing conditions in the oceans - but other common species could become rare, according to a study.",
        "url": "https://news.sky.com/story/endangered-rays-sharks-and-native-oysters-could-thrive-despite-climate-change-report-claims-13385378",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ray-thornback-thornback-ray_6945005.jpg?20250618105518",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-18 09:32:00",
        "Headline": "Researchers say many species are anticipated to lose habitat with climate change and as species \"move or shift\" to new areas, this will have an impact on how they are managed and protected.",
        "Content": "Endangered rays, sharks and native oysters could thrive in seas around the UK in the decades ahead amid changing conditions in the oceans - but other common species could become rare, according to a study. Researchers looked at 19 threatened marine species in UK seas and the impact they could face from climate change. The results suggested an \"overall increase\" in suitable habitat for the study's selected species, although said any projected change for many was \"relatively small\". Some species will \"move or shift\" to new areas in response to rising ocean temperatures and this will have an impact on how they are managed and protected, the study added.  Many species are anticipated to lose habitat with climate change, researchers said. Maintaining or increasing the numbers of vulnerable animals around the UK might require additional management methods. Projecting habitat changes into the future has \"a number of uncertainties\" and species may find \"favourable\" new areas, but the conditions could then \"move\" to zones which are \"not suitable\" for species to survive. The report, published in the Marine Biology journal, said although rays, sharks and oysters could become less threatened - there were risks for other species. \"Spurdog, thornback and undulate rays and native oyster showed the largest increases in suitable habitat this century, whereas decreases were seen in the slender sea pen, ocean quahog, sea fan and fan mussel,\" said the report. \"The increases were concentrated in the central and northern North Sea and the decreases to the south and west of the UK, as well as in the southern North Sea.\" Some species may thrive in new areas not currently protected from human disturbance, scientists said. But some currently protected sites \"may no longer remain viable in protecting their designated features in the future\". \"Some of these changes may become apparent relatively quickly, with substantial changes in suitable habitat evident from the 2030s and 2040s,\" researchers said. Read more from Sky News:Co-op offers 25% off £40 shop to membersTicket-holder wins 'biggest ever' EuroMillions jackpot  The government is currently consulting on measures for fishing in Marine Protected Areas, which are designated parts of the ocean set up to protect habitats, species and ecosystems. Researchers at the Centre for Environment, Fisheries and Aquaculture Science compiled the report in consultation with the Department for Environment, Food and Rural Affairs, Natural England, and the Joint Nature Conservation Committee."
    },
    {
        "title": "UK could see temperatures of 46C or more in the future, Met Office says",
        "description": "The UK has a 50:50 chance of seeing temperatures of 40C or more again in the next 12 years, the Met Office said.",
        "url": "https://news.sky.com/story/uk-could-see-temperatures-of-46c-or-more-in-the-future-met-office-says-13385305",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-heat-weather_6944920.jpg?20250618091054",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-18 07:13:00",
        "Headline": "Experts said the chance of temperatures hitting 40C is now 20 times more likely than it was in the 1960s, while temperatures soaring to a maximum of 46.6C is also \"plausible\".",
        "Content": "The UK has a 50:50 chance of seeing temperatures of 40C or more again in the next 12 years, the Met Office said. And temperatures of 45C or more \"may be possible\" as the risk of extreme heat continues to rise with climate change, experts warned in a new study. Temperatures first hit 40C in the UK during a record-breaking heatwave in 2022, peaking at 40.3C in Coningsby in Lincolnshire on 19 July. The previous top temperature was 38.7C in Cambridge, recorded in 2019. The extreme heat caused dozens of fires, which ripped through houses, schools, churches and farmland, with fire brigades in London, Leicestershire and South Yorkshire declaring major incidents at the time. There was also widespread disruption to transport and power systems. More than 3,000 heat-related deaths were recorded in England over summer 2022, including more than 1,000 excess deaths among older people around the four-day peak of the heatwave. The risk of 40C temperatures in the UK has been rapidly increasing, according to analysis by the Met Office using global models to create a large number of climate outcomes in current conditions. \n                  UK weather: Yellow heat health alerts issued for most of England, as forecast reveals where it will hit 33C\n                 \n                  UK heatwave: Temperatures could hit 32C - and warm weather could stay until Glastonbury\n                 \n                  Weather warnings: 30,000 lightning strikes hit UK - with roads flooded and landslip disrupting trains\n                 The chance of temperatures hitting 40C is now 20 times more likely than it was in the 1960s, and the odds have almost tripled since 2000. Temperatures soaring to a maximum of 46.6C is also considered \"plausible\". There is a 50:50 chance of temperatures hitting 40C again in the next 12 years as climate change pushes up temperatures, the Met Office said in the study published in Weather Journal. \"Because our climate continues to warm, we can expect the chance [of exceeding 40C] to keep rising,\" Dr Gillian Kay, senior scientist at the Met Office, and lead author of the study, said. Heatwaves could also go on for a month or more in the future, with a climate model showing up to two-thirds of summer days could be above the heatwave threshold of 28C. Read more from Sky News:UK expected to see hottest day of the year so farMet Office: UK set for hotter than usual summer2025 potentially worst year for wildfires, data shows Twelve consecutive days above 35C is also possible, according to the study. Dr Nick Dunstone, Met Office science fellow and co-author of the study, said the findings showed the UK needed to prepare and plan for the impacts of rising temperatures to \"better protect public health, infrastructure, and the environment from the growing threat of extreme heat\"."
    },
    {
        "title": "R Kelly rushed to hospital after prison 'overdose' plot, his lawyers say",
        "description": "R Kelly was hospitalised after prison officials gave him an overdose of medication, his lawyers have claimed &#8211; as part of what they say is an ongoing assassination plot.",
        "url": "https://news.sky.com/story/r-kelly-rushed-to-hospital-after-prison-overdose-plot-his-lawyers-say-13385299",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kelly-court_6944891.jpg?20250618080422",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-18 06:56:00",
        "Headline": "The singer was taken to hospital on Friday after prison staff \"administered an overdose of his medication\", according his lawyer in a court document.",
        "Content": "R Kelly was hospitalised after prison officials gave him an overdose of medication, his lawyers have claimed – as part of what they say is an ongoing assassination plot. Kelly, whose full name is Robert Sylvester Kelly, is currently serving time at the Federal Correctional Institute in Butner, North Carolina, after being convicted of sex trafficking and racketeering in 2021. A year later, he was found guilty on three charges of producing child sexual abuse images and three charges of enticement of minors for sex. The 58-year-old was taken to hospital on Friday after prison staff \"administered an overdose of his medication\", according to a court document filed by his lawyer.  The document, filed on Tuesday, reads: \"Mr. Kelly's life is in danger, and that danger is coming from Bureau of Prisons officials and their actions. \"Mr. Kelly needs this Court's intervention. His life actually depends on it.\" Nicole Blank Becker, one of Kelly's lawyers, said he is in solitary confinement and that she spoke with him on Monday. \"What is happening right now with him is insane,\" she said. \"I hope that this really results in someone, somewhere, somehow getting ahold of him today and getting him back in the hospital.\" A spokesperson for the Bureau of Prisons said in a statement that \"for privacy, safety, and security reasons, we do not discuss the conditions of confinement for any incarcerated individual, including medical and health-related issues\". \"Additionally, the Bureau of Prisons does not comment on pending litigation or matters that are the subject of legal proceedings,\" they added. The allegation is the latest in a line of similar claims from the singer's legal team, who last week filed a motion accusing the Bureau of Prisons of instructing another inmate to kill Kelly. Read more:Musk posts 'drug test results'Juror dismissed from Diddy trial A motion filed by Kelly's legal team claimed Mikeal Glenn Stine, who is alleged to be a member of the Aryan Brotherhood gang and has a terminal cancer diagnosis, was given a chance to \"to live out the last of those months as a free man\" in exchange for killing the singer. The next day, his legal team filed additional material saying he had been moved to solitary confinement and denied access to his lawyer. Prosecutors rejected the claims as \"repugnant\". Their written response said: \"Kelly has never taken responsibility for his years of sexually abusing children, and he probably never will. \"Undeterred, Kelly now asks this Court to release him from incarceration indefinitely under the guise of a fanciful conspiracy.\""
    }
]