[
    {
        "title": "Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk",
        "description": "They've said they are offering him an opportunity to tell them everything, once and for all.",
        "url": "https://news.sky.com/story/deadline-day-for-andrew-to-respond-to-epstein-inquiry-but-its-hard-to-imagine-why-hed-talk-13472817",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-19 14:08:00",
        "Headline": "Andrew Mountbatten-Windsor was summoned by the US Congress to answer questions about his relationship with Jeffrey Epstein - and the deadline to respond is today. But based on how that Newsnight interview went, he may decide not to.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  They've said they are offering him an opportunity to tell them everything, once and for all. But as we hit the two-week deadline set by the US Congress committee investigating Jeffrey Epstein for a reply from Andrew Mountbatten-Windsor, will he agree to their request to open up about the paedophile financier? The letter sent by the House Committee on Oversight and Government Reform said members wanted to talk to him because of the widely reported allegations that have been made against him, which he denies, and because of his relationship with Epstein and what he may have seen. The committee is looking into Epstein's crimes and his wider sex trafficking network. Andrew was given until today, 20 November, to respond. Legally he isn't obliged to talk to them, and to be honest it's hard to imagine why he would. The only time he has spoken at length about the allegations against him and his relationship with Epstein was that Newsnight interview in 2019, and we all know how much of a disaster that was.  Yes, this could be an opportunity for him to publicly apologise for keeping up his links with Epstein, which he has never done before, or show some sympathy towards Epstein's victims, even as he vehemently denies the allegations against him. But while there is the moral argument that he should tell the committee everything he knows, it could also raise more uncomfortable questions for him, and that could feel like too much of a risk for Andrew and the wider Royal Family. However, even saying no won't draw all this to a close. There are other outstanding loose ends. The Metropolitan Police still have to tell us if they intend to take any further action after they said they were looking into claims Andrew had asked one of his officers to dig up dirt on his accuser, Virginia Giuffre. Read more:King formally strips Andrew of prince titleBill to release Epstein files gets all-clear from Congress  There could also still be a debate in parliament about the Andrew problem. The Liberal Democrats have said they want to use their opposition debating time to bring the issue to the floor of the House of Commons, while other MPs on the Public Accounts Committee have signalled their intention to look into Andrew's finances and housing arrangements. And then there are the wider Epstein files over in America, and what information they may hold. From developments this week, it seems we are edging ever closer to seeing those released. All of this may mean Andrew in other ways is forced to say more than he wants to, even without opening up to the Congress committee."
    },
    {
        "title": "'Patchwork of dust and misery': At the Yellow Line dividing Gaza - where all that remains are skeletons of buildings",
        "description": "In front of me, there is a building that has collapsed upon itself, six floors piled upon each other. ",
        "url": "https://news.sky.com/story/patchwork-of-dust-and-misery-at-the-yellow-line-dividing-gaza-where-all-that-remains-are-skeletons-of-buildings-13472870",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-israel-palestine_7086140.jpg?20251119162157",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-19 16:58:00",
        "Headline": "Not so long ago, Shuja'iyya, in the north of Gaza, was a bustling town of around 100,000 people, proud of a history dating back 850 years. Now, it is a wasteland, a patchwork of dust and misery. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  In front of me, there is a building that has collapsed upon itself, six floors piled upon each other.  A wild dog is walking through its ruin, while a military drone buzzes above. In the distance, there is the cackle of machine gun fire. Welcome to Shuja'iyya, in the north of Gaza. Not so long ago, this was a bustling town of around 100,000 people, proud of a history dating back 850 years. Now, it is a wasteland, a patchwork of dust and misery. Israel does not allow news organisations to report independently from Gaza. Today, it took a group of journalists, including Sky News, into the area of the Strip occupied by Israeli forces. The brief visit was highly controlled and offered no access to Palestinians, or other areas of Gaza. Military censorship laws in Israel mean that military personnel were shown all our material before publication. Sky News maintained editorial control of this report at all times. The buildings in front of me have all been wrecked by warfare - at best, the sides blown out and a mere skeleton remaining. Many have simply been reduced to rubble. Over the past two years, more than 68,000 people have been killed in Gaza as a result of Israeli military action. It was a war that started on 7 October 2023, when more than 1,200 people, mostly civilians, were killed by Hamas militants in a devastating surprise attack. Now, an uneasy ceasefire hangs over Gaza, the result of the peace plan drawn up by US President Donald Trump's team and now endorsed by the United Nations. I am standing on a mound of earth at the edge of an Israeli military camp. The only signs of life around me are the Israeli soldiers behind me, a roster of wild dogs who dart around the area, and a single solitary bird that lands on a rock - a gentle counterpoint to the desolation that surrounds it. This is the Israeli side of the line that now divides Gaza into two parts. It's known as the Yellow Line, although there is no actual line running through the whole territory. A series of concrete blocks are gradually being put into place, but they are starting from the edges and working in. From where I'm standing, I can see a tall red and white mast several hundred metres away. This sits exactly on the Yellow Line, so it is a very visible sign that we are near the division. Basically, the land I'm standing on is now run by Israel, and is home to a very small number of Gazans. The vast majority of the two million-strong population is on the other side of the Yellow Line, where control is still held by Hamas. The Israeli military has invited us here. They are in charge of where we go and what we see, and they also have the right to censor the material we broadcast, although we, as journalists, retain complete editorial control over what we write and say. IDF: Hamas 'haven't changed who they are' The message they are keen to project is that, despite two years of attacks on Gaza, Hamas has not gone away and is showing no sign of disarming. And that, they insist, is something that worries all Israelis, and terrifies those who live near the border with Gaza. Some of those towns are very clearly visible through the afternoon haze. \"We're not staying here as a hobby,\" says Lieutenant Colonel Nadav Shoshani, the spokesperson for the Israeli Defence Forces (IDF). \"We're staying here to secure the people of Israel. We see it right there,\" and he points towards a nearby Israeli town. \"It's a two-minute drive to where our civilians live. And we see right here a battlefield where there were tens of thousands of Hamas terrorists. \"They haven't changed who they are. And it's going to need pressure from the international community and maybe also from Israel to make sure they disarm. \"Hamas are rearming, Hamas are killing their opponents on the street. Hamas are trying to reassert dominance, and power, in Gaza.\" Under the peace plan endorsed by the UN, a so-called stabilisation force is expected to enter Gaza to protect civilians and ensure the delivery of humanitarian aid. But we have no details of who those troops will be, when they will arrive, what their legal mandate will be or whether they will be required to disarm Hamas. For the moment, the Strip is simply split between the half where there is a strictly-enforced peace, but almost no residents, and the half where there are millions of people trying to live amid the chaos of post-war devastation. International journalists are now allowed into Gaza, but our colleagues have been there since the start of the war. As I was watching Shuja'iyya from an Israeli army camp, so they were visiting the remains of the town on the other side of the Yellow line. Read more:Trump's Gaza plan looks convincing - but there's more to this storyInside warehouse where Gaza aid held after Israel 'refused entry' 'Everything here is destroyed' What they saw was the same vista of ruin. It is impossible to imagine people living in such a place, but remarkably, some do. Our team met Iman Hasoneh, 48 years old, and ground down by the pain of life. Her husband has internal bleeding from a wound, and her children are exhausted. The family fled Shuja'iyyah months ago, then found nowhere else to live, and ended up returning to the rubble of their home. \"Our home collapsed, and it was a miracle we escaped,\" she says. \"We couldn't find anywhere else. Our struggle was immense. We moved around so much. \"There was a rocket attack over there\" - she beckons towards another collapsed building down the street - \"and the blast knocked us all over. \"I didn't expect to survive. I'm giving up. One day they will just announce that we have all been killed. We are on the edge of the Yellow Line, and there is so much suffering.\" Our team asks here about the effect of the peace plan. \"I want to be optimistic, but I'm not sure what is going to happen. \"They are giving us an anaesthetic to numb the pain. But everything here is destroyed. God willing, the Israelis will pull out and leave here.\" Above her, the drone is buzzing. It is the same drone we heard from the camp, launched from near the place where I stand and watch, now hovering over the ruined home where Iman hopes to live another day."
    },
    {
        "title": "Russia accuses British government of being 'provocative' after spy ship nears UK",
        "description": "Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK.",
        "url": "https://news.sky.com/story/russian-spy-ship-currently-on-edge-of-uk-waters-warns-defence-secretary-13472703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yantar-english-channel_7085832.jpg?20251119105235",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-19 09:43:00",
        "Headline": "Defence Secretary John Healey says the UK has \"military options ready\" if Russian spy ship the Yantar sails closer to British shores.",
        "Content": " Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK. At a news conference in Downing Street on Wednesday, John Healey said the Yantar was on the edge of British waters north of Scotland, having entered wider UK waters over the last few weeks. He said it was the second time this year the ship had been deployed off the UK coast and he claimed it was \"designed for gathering intelligence and mapping our undersea cables\". Politics latest: 'Budget leaks are not acceptable,' says Reeves Mr Healey said the ship had \"directed lasers\" at pilots of surveillance aircraft monitoring its activities - a Russian action he called \"deeply dangerous\". The defence secretary explained: \"We deployed a Royal Navy frigate and RAF planes to monitor and track this vessel's every move, during which the Yantar directed lasers at our pilots.\" He said his message to Moscow and President Vladimir Putin was \"we see you, we know what you're doing, and if the Yantar travels south this week, we are ready\". \n                  Welfare versus warfare: Sir Keir Starmer's unresolved question  - and why the PM's pinned his hopes on economic growth\n                 \n                  Is Trump's America chaos? Or are memories just short?\n                 \n                  Europe must be ready to build 'millions of drones' to defend itself against possible Russian attacks, EU warns\n                 Mr Healey also stated the UK government has \"military options ready\" if the ship sails closer to British shores. Russia's response Responding to Mr Healey's comments, the Russian embassy to the UK said on social media it noted his \"latest provocative statements\" and insisted the ship was an \"oceanographic research vessel... in international waters\". The embassy said the British accusations \"raise a smile\" and Russia's actions were \"not aimed at undermining\" the UK's security. It hit out at the UK government's \"Russophobic course and the escalation of militaristic hysteria\", which it warned creates \"prerequisites for new dangerous situations\", as it urged London to \"refrain from destructive steps\". Read more:Analysis: A Bond-villain ship prowling our waters The defence secretary's remarks come after a report from MPs warned the UK lacks a plan to defend itself from a military attack, despite the government promising to boost readiness with new arms factories. At least 13 sites across the UK have been identified for new factories to make munitions and military explosives, with Mr Healey expecting the arms industry to break ground at the first plant next year. The report, by the Commons Defence Committee, said the UK \"lacks a plan for defending the homeland and overseas territories\" as it urged the government to launch a \"co-ordinated effort to communicate with the public on the level of threat we face\". 'Assertive retaliation' Now the government has been cautioned it may need to be \"more muscular\" in standing up to Russia. The chair of the Joint Committee on National Security Strategy, Matt Western, said Wednesday's development \"demonstrates once again that Russia presents a genuine and immediate threat to the UK's security\". He added that \"the UK needed to be more muscular in tackling Russian aggression\" and \"there is more we can do\". \"More assertive retaliation may be required,\" he concluded. Mr Healey acknowledged the dangers facing the UK, saying the country was in a \"new era of threat\" that \"demands a new era for defence\". Giving more details on the vessel, he said it was \"part of a Russian fleet designed to put and hold our undersea infrastructure and those of our allies at risk\". Read more from Sky News:Briton who volunteered as spy for Russia jailedRail line blast 'initiated by Russian secret services' He said the Yantar wasn't just part of a naval operation but part of a Russian programme driven by Moscow's Main Directorate of Deep-Sea Research, or GUGI, which is \"designed to have capabilities which can undertake surveillance in peacetime and sabotage in conflict\". \"That is why we've been determined, whenever the Yantar comes into British wider waters, we track it, we deter it and we say to Putin we are ready, and we do that alongside allies,\" he added. Asked by Sky News' political correspondent Rob Powell whether this was the first time that lasers had been used by a Russian vessel against pilots, Mr Healey replied: \"This is the first time we've had this action from Yantar directed against the British RAF. \"We take it extremely seriously. I've changed the Navy's rules of engagement so that we can follow more closely, monitor more closely, the activities of the Yantar when it's in our wider waters. We have military options ready.\" Mr Healey added that the last time the Yantar was in UK waters, the British military surfaced a nuclear-powered attack submarine close to the ship \"that they did not know was there\"."
    },
    {
        "title": "A Bond-villain ship prowling our waters: Why the Yantar alarms the West",
        "description": "The Yantar may look scruffy and unthreatening but below the surface it's the kind of ship a Bond villain would be proud of.",
        "url": "https://news.sky.com/story/a-bond-villain-ship-prowling-our-waters-why-the-yantar-alarms-the-west-13472832",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-russian-yantar_7085910.jpg?20251119122923",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-11-19 14:34:00",
        "Headline": "With hidden subs, laser systems and cable-cutting gear, Russia's covert vessel is mapping - and has the potential to target - the vital undersea networks our economies rely on.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Yantar may look scruffy and unthreatening but below the surface it's the kind of ship a Bond villain would be proud of. In hangars below decks lurk submersibles straight out of the Bond film Thunderball. Two Consul Class mini manned subs are on board and a number of remotely operated ones. It can \"undertake surveillance in peacetime and sabotage in conflict\", in the words of Britain's Defence Secretary John Healey. Cable-cutting equipment combined with surveillance and intelligence gathering capabilities make this a vessel to be reckoned with. Most worryingly though, in its most recent tangle with RAF planes sent to stalk it, the Yantar deployed a laser to distract and dazzle the British pilot. Matthew Savill, from the Royal United Services Institute, told Sky News this was potentially a worrying hostile act. He said: \"If this had been used to dazzle the pilot and that aircraft had subsequently crashed, then maybe the case could be made that not only was it hostile but it was fundamentally an armed attack because it had the same impact as if they'd used a weapon.\" \n                  'He must have got this from K': What mistaken tweet tells us about 'secret' plan to end Ukraine war\n                 \n                  Explosion on rail line 'initiated by Russian secret services', Polish government says\n                 \n                  Hundreds of Russian troops roll into key frontline Ukrainian city 'Mad Max-style', video appears to show\n                 The Yantar is off our waters and here to threaten the West's Achilles heel, says our government. Undersea infrastructure is essential to our hyper-connected world. Undersea cables are the vital nervous system of Western civilisation. Through them courses the data that powers our 21st century economies and communications systems. Pipelines are equally important in supplying fuel and gas that are vital to our prosperity. But they stretch for mile after mile along the seabed, exposed and all but undefended. Their vulnerability is enough to keep Western economists and security officials awake at night, and Russia is well aware of that strategic weakness. Read more:What is the mysterious Yantar 'spy ship'?Why UK's undersea cables are vulnerableUK plan to defend from invasion moving at 'glacial' pace That is why some of the most sophisticated kit the Russian military possesses is geared towards mapping and potentially threatening them. The Yantar's concealed capabilities are currently being used to map that underwater network of cables and pipelines, it's thought, but they could in the future be used to sabotage them. Russia has been blamed for mysterious underwater attacks in the recent past. A more kinetic conflict striking at the West's soft underwater underbelly could have a disastrous impact. Enough damage to internet cables could play havoc with Western economies. It is a scenario security experts believe the West is not well enough prepared for. Putting the Yantar and its Russian overseers on watch is one thing; preventing them from readying for such a doomsday outcome in time of war is quite another."
    },
    {
        "title": "'He must have got this from K': What mistaken tweet tells us about 'secret' plan to end Ukraine war",
        "description": "There are developments in the quest for peace in Ukraine.&#160;",
        "url": "https://news.sky.com/story/he-must-have-got-this-from-k-what-mistaken-tweet-tells-us-about-secret-plan-to-end-ukraine-war-13472965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-ternopil-russia_7086367.jpg?20251119230414",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-11-19 22:35:00",
        "Headline": "Donald Trump's special envoy Steve Witkoff clearly thought he was sending a private message given his tweet was swiftly deleted. It's given us an insight into the role he and his equally unlikely Russian counterpart are playing in a plan to end the war.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  There are developments in the quest for peace in Ukraine.  It's been one of those days when different snippets of news have come together to create a picture of sorts. The jigsaw remains complicated, but the suggestion is neither the Ukrainians nor the Europeans have been privy to the developments. As it happened: Russia responds to spy ship claim The most intriguing development came at lunchtime on Thursday. \"He must have got this from K...\" wrote Donald Trump's special envoy Steve Witkoff on X. He clearly thought he was sending a private message. He was replying to a scoop of a story by Axios's Barak Ravid. The story revealed a \"secret\" plan to end the Ukraine war. The report suggested the Americans had been talking secretly to the Russians about a renewed effort to bring the war to an end, which involved Ukraine ceding land it still controls to Russia. Who is \"K\" in Witkoff's message? It's probably Kirill Dmitriev, who has become Putin's unofficial and unlikely envoy to Washington. Kyiv-born and Stanford-educated Dmitriev is, essentially, Witkoff's Russian opposite number. In a sense, they are the yin and yang of this geopolitical puzzle. Witkoff is a real estate mogul. Dmitriev is an economist. They are opposing forces with backgrounds that are, on the face of it, equally unsuited to geopolitical conflict resolution. Yet their two leaders are trusting them with this huge task. 'Territorial concessions' in 28-point plan So, back to the developments to have emerged over the last 24 hours. First, we know senior US Department of War officials, including Army Secretary Dan Driscoll, have arrived in the Ukrainian capital to meet their counterparts there. Their visit was scheduled but the focus shifted. The plan to discuss drone technology and the winter offensive morphed into a discussion about a Russian-presented peace plan Witkoff and Dmitriev had been discussing. This is the second development. The Axios report - which Witkoff seems inadvertently to have suggested came from Dmitriev - claims the two envoys met recently in Florida (Witkoff's base) to discuss a 28-point plan for peace. A defence official told our partners at NBC News that Driscoll has been briefed on the 28-point plan. Driscoll and his military staff are thought to have been presenting an initial brief to the Ukrainian side of this Russian-sponsored plan. Ukrainian sources have suggested to me in clear terms they are not happy with this Witkoff-Dmitriev plan. Sources tell me it includes \"territorial concessions\" and \"reductions in military strength\". The Ukrainian position is the plan represents the latest attempt to \"play the American government\".  What's happening with security guarantees? Ukraine wants security guarantees from the US. Trump signalled during Zelenskyy's last visit to Washington that he was willing to provide those. This was framed by the Europeans as a huge positive development, even though the White House did not spell out the crucial detail - what would these guarantees actually entail? The latest reporting, from Axios, suggests the security guarantees (still undefined, publicly at least) are dependent on Ukraine giving up the whole of the Donbas region - this would include about 15% of territory Russia does not currently hold. Crucially, the areas of the Donbas from which Ukraine would withdraw (the 15%) would be considered a demilitarised zone. The plan is very similar to one floated by Vice President JD Vance in the months before Trump won last year's election, which was roundly rejected as a non-starter at the time. Watch more from Mark Stone:What have we learned from the Epstein files?The prince and president: What happened? Is Gaza plan the model? Another source, from a third country close to the negotiations, has told me the Qataris are playing a role in the talks and were present at the weekend when Steve Witkoff met Ukraine's national security advisor Rustem Umerov last weekend. Qatari and Turkish mediation, along with the multipoint peace plan for Gaza, is being projected as a model transferable to Ukraine despite the conflict, challenges, and root causes being wholly different. Other European sources told me this morning they were not aware of this Russian-American plan. It's worth remembering it's in the interests of the Russians to be seen to be engaged in peace proposals in order to avoid secondary sanctions from the US. Zelenskyy has been in Turkey over the past 24 hours, where he singled out Trump's efforts to find peace. \"Since the beginning of this year, we in Ukraine have supported every decisive step and the leadership of @POTUS, every strong and fair proposal aimed at ending this war.\" Zelenskyy wrote. \"And only President Trump and the United States have sufficient power to make this war come to an end.\" This is the vital language of flattery."
    },
    {
        "title": "UK weather: Amber and new yellow Met Office warnings in place as parts of UK hit by heavy snow",
        "description": "Amber and yellow weather warnings for snow and ice are in place across the UK, with some parts already hit by freezing temperatures and heavy snowfall. ",
        "url": "https://news.sky.com/story/uk-weather-amber-and-yellow-met-office-warnings-in-place-as-parts-of-uk-hit-by-heavy-snow-13472678",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-county-durham-snow_7085722.jpg?20251119100009",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-19 09:13:00",
        "Headline": "The Met Office warned the wintry weather \"could create some particularly tricky travel conditions\" and may leave some vehicles and passengers stranded in some parts of the country as it issues yellow and amber alerts.",
        "Content": " Amber and yellow weather warnings for snow and ice are in place across the UK, with some parts already hit by freezing temperatures and heavy snowfall.  Updated warnings were issued on Wednesday for parts of East Anglia and the South West. Wintry conditions are expected to continue closer to coastal areas after up to 7cm (2.75in) of snow fell in parts of the UK, forecasters said. Snowfall has been recorded in northern areas of the UK, as well as in central parts and as far south as London.  Met Office weather stations in Lake Vyrnwy in Powys, Wales, recorded 7cm of lying snow at 8am. Other weather stations reporting lying snow include Lerwick in Shetland which saw 5cm, 4cm in Loch Glascarnoch and 7cm in Altnaharra, both in the Scottish Highlands, 2cm in Aviemore, and 1cm each in Dyce, Aberdeenshire, Drumalbin in Lanarkshire and at Redesdale Camp in Northumberland. The Met Office warned the wintry weather \"could create some particularly tricky travel conditions\". A spokesman said: \"We will continue to see wintry showers on the windward coasts, so north Scotland as well as the east and west coasts of the UK.\" A yellow warning for ice earlier on Wednesday was later adjusted to potentially impact South Wales, parts of northern England and northern and southeastern Scotland. Most of northern Scotland is under a yellow warning for snow and ice until 9pm on Thursday. A yellow warning for snow and ice has been issued for Northern Ireland, running from 5pm on Wednesday until midday on Thursday. Check the forecast for your area In East Anglia, a yellow warning for snow and ice is in place from 5pm on Wednesday to 11am on Thursday. In Cornwall, parts of Devon, and west Wales, the warning for snow and ice applies from midday on Wednesday to 11.59pm on Thursday. A yellow warning is in place for northern and northeastern England and southeastern Scotland from Hull in the south to Eyemouth in the north, from midnight on Wednesday to 11.59pm on Thursday. Read more: 'Wintry blast could be a dry run for a cold December'  An amber weather warning for snow has been issued for parts of Yorkshire on Thursday between 3am and 9pm - with forecasters warning of significant accumulations of snow. Frequent wintry showers will feed inland from the North Sea, making conditions difficult over the North York Moors and parts of the Yorkshire Wolds. By the end of Thursday, as much as 15-25cm may have accumulated on hills above 100m elevation, which is likely to cause \"substantial disruption\", the Met Office said. It added that power cuts and travel delays on roads were likely, possibly stranding some vehicles and passengers. Temperatures could fall to as low as -11C in some parts of Scotland on Thursday night. Untreated surfaces could become 'instant ice rinks' Sky News weather presenter Jo Wheeler said falling temperatures on Wednesday night could make untreated roads and pavements \"instant ice rinks\". She said: \"Tonight, temperatures will plummet under largely clear skies. \"Rural areas can expect more spectacular sub-zero temperatures with a widespread and penetrating frost by dawn. \"And the ice - that may be a problem. Sub-zero temperatures will render untreated roads and pavements instant ice rinks with great care needed.\" 'Winter hazards are likely through the next few days' Met Office chief forecaster Neil Armstrong said: \"Cold Arctic air from the north is firmly in charge of the UK's weather, bringing the first notable cold snap of this autumn and giving an early taste of winter weather. \"As a result, winter hazards are likely through the next few days, with snow and ice a particular hazard, and the coldest conditions likely on Wednesday and Thursday. \"Wintry showers will affect areas exposed to the brisk northerly wind, in particular Northern Ireland, southwest Wales, southwest England, northeast England and across the northern half of Scotland. \"Whilst not all places will see lying snow, where showers are most frequent accumulations of 2-5cm will be possible. \"On higher ground in Scotland, 15-20cm could accumulate, and potentially as much as 15-25cm over the North York Moors and Yorkshire Wolds.\" Ice will be an ongoing hazard, particularly overnight, in the coming days, warned the Met Office. But conditions will turn drier for many by Friday, with milder temperatures and rain reaching western areas later in the day. Do not be 'caught out', motorists warned Darren Clark, of the National Highways, urged motorists to \"prepare for winter\". \"We have more than 530 gritters available nationally and we can rapidly call on additional reserves when snow hits or conditions demand it,\" he said. \"We work closely with the Met Office, receiving updated forecasts throughout the day and our crews are on duty around the clock, ready to head out whenever they're needed. \"We're also urging drivers to prepare for winter, and not be caught out by it. \"Quick checks, such as topping up fuel and screenwash, checking lights and tyres, and planning ahead, can make all the difference when the weather turns.\""
    },
    {
        "title": "Nvidia beats expectations again in defiance of AI bubble fears",
        "description": "The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now. ",
        "url": "https://news.sky.com/story/nvidia-beats-expectations-again-in-defiance-of-ai-bubble-fears-13472848",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jensen-huang-nvidia_7072665.jpg?20251105113409",
        "type": "Home",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-19 21:36:00",
        "Headline": "The company not only posted another set of record-breaking figures but said it expects those records will be broken again in three months.  ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now.  Nvidia's revenue reached $57bn in the three months to October, higher than Wall Street estimates and the company's own guidance. That's up 62% on the same time last year, and has been described by the business as an \"outstanding\" quarter. Money blog: Ryanair flights to EU banned in 'unprecedented' decision A profit measure called earnings per share was also better than expected at $1.30.  It matters as Nvidia has powered the artificial intelligence (AI) boom through its computer chips, which are key parts in AI chatbots such as ChatGPT. \n                  AI bubble fears take hold of stock markets and bitcoin\n                 \n                  'Agentic AI' is current industry buzzword - but what does it mean and should we be cautious?\n                 \n                  A third of daily music uploads are AI-generated and 97% of people can't tell the difference, says report\n                 Nvidia has major tech companies as clients and acts as a good proxy for whether the tens of billions of dollars invested in AI is paying off.  Its chief executive, Jensen Huang, has been described as the Godfather of AI and watch parties were organised for those looking to follow the Wednesday evening announcement. The company has been a massive beneficiary of the push to put money into AI, with its share price reaching stratospheric highs. In October, it became the first worth $5trn (£3.83trn), about the size of the German economy, Europe's largest, and double the UK's benchmark stock index, the FTSE 100.  What's been announced? Revenue from data centres reached a record high of $51.2bn, more than £10bn higher than the three months previous. The outlook is for continuing strong sales in the final three months of the financial year, as the company forecasts revenue will be roughly $65bn.  Read more:Nvidia boss defends against claims of bubble by 'Big Short' investorInflation slows to 3.6%, but food costs shoot upwards  Demand for Nvidia products continues to surpass expectations, while the business is \"still in the early innings\" of AI transitions, its chief financial officer Colette Kress said. Mr Huang said sales of its blackwell chips are \"off the charts\" and its cloud graphics processing chips (GPUs) are \"sold out\".  Why it matters Developing AI infrastructure, like the construction of data centres, has been a significant contributor to US economic growth, as measured by gross domestic product (GDP). A faltering of AI expansion, therefore, impacts the US economy, the world's largest, which in turn affects the UK and global economies. Anxiety around the massive valuations tech companies have accrued, on the hope of AI revolutionising the world, is likely to be staved off by the results announcement. A fall in these tech company valuations could have meant a drop in the value of pension pots or savings. Just seven dominant tech companies, many of which have borrowed to invest in AI, make up more than a quarter of major US stock index, the S&P 500.  In the last year alone, Nvidia's share price has risen more than 230%. Some, including US trader Michael Burry, famous for being played by Christian Bale in the Hollywood film The Big Short, have effectively bet that Nvidia's share price would fall. Addressing the topic of an AI bubble, Nvidia's founder, Mr Huang, said, \"From our vantage point, we see something very different\".  What next? Regardless of the figures released on Wednesday evening, significant market moves were anticipated, given the attention paid to the results and the significance of the company. Nvidia shares rose as much as 4% in after-hours trading. The results also boosted the share price of its chip-making competitors like Broadcom and Advanced Micro Devices.  For now, the AI bubble remains intact."
    },
    {
        "title": "Olivia Curley: School pays tribute to 11-year-old girl after 'unexplained' death",
        "description": "Tributes have been paid to a schoolgirl who passed away in \"unexplained\" circumstances after she became unwell.",
        "url": "https://news.sky.com/story/olivia-curley-school-pays-tribute-to-11-year-old-girl-after-unexplained-death-13472937",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-olivia-curley-scotland_7086291.jpg?20251119203546",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-19 21:44:00",
        "Headline": "Olivia \"was a cherished friend, full of kindness, laughter, and warmth\" said one tribute.",
        "Content": "Tributes have been paid to a schoolgirl who passed away in \"unexplained\" circumstances after she became unwell. Olivia Curley, 11, was an S1 pupil at Hermitage Academy in Helensburgh, Argyll and Bute. She became unwell at around 11.40am on Sunday and was taken to the Royal Hospital for Children in Glasgow, where she died the following day. Police are treating the death as \"unexplained\" and are investigating the circumstances. Headteacher Douglas Morgan said her loss was felt \"profoundly\". He said: \"We are deeply saddened to hear about the passing of our S1 pupil, Olivia Curley. \"Olivia was a much-loved member of our school community and an important part of the primary seven group at Hermitage Primary, who recently joined us at Hermitage Academy. \"Her loss is felt profoundly by staff, pupils and families alike. \"To support our community, a quiet space has been prepared for any pupil or staff member who may need time to reflect or talk. In addition, our chaplaincy and exchange counselling teams are available in school and will continue to provide care and support in the days and weeks ahead. \"We extend our heartfelt sympathies to Olivia's family and friends during this very difficult time.\" A GoFundMe page set up to support the family described Olivia as a \"bright, loving, and unforgettable soul who touched the hearts of everyone\". It continued: \"She was a cherished friend, full of kindness, laughter, and warmth. \"Her passing has left a hole in the lives of her family, friends, and all who loved her.\" \"Olivia will never be forgotten. Her light, her smile, and her kindness will live on in everyone whose life she touched.\" A Police Scotland spokesperson said: \"The death is being treated as unexplained and enquiries are ongoing to establish the full circumstances.\""
    },
    {
        "title": "Former Olympic snowboarder wanted by US charged with masterminding murder of witness",
        "description": "A Canadian former Olympic snowboarder who is wanted in the US for running a multi-national drug trafficking network is also facing charges in connection with the killing of a federal witness, the US Attorney General, Pam Bondi, has announced.",
        "url": "https://news.sky.com/story/former-olympic-snowboarder-wanted-by-us-charged-with-masterminding-murder-of-witness-13472956",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ryan-wedding-wanted_7086358.jpg?20251119224848",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-19 23:40:00",
        "Headline": "Ryan Wedding is accused of orchestrating the killing of the witness in Colombia to help him avoid extradition to the US in January.",
        "Content": "A Canadian former Olympic snowboarder who is wanted in the US for running a multi-national drug trafficking network is also facing charges in connection with the killing of a federal witness, the US Attorney General, Pam Bondi, has announced. Ryan Wedding is accused of orchestrating the killing of the witness in Colombia to help him avoid extradition to the US in January. Ten other defendants have been arrested on the charges in the federal indictment, which was unsealed in California. US authorities are now offering up to $15m for information leading to the arrest of Wedding, who is on the FBI's 10 Most Wanted list. He is believed to be living in Mexico under the protection of the Sinaloa cartel. Authorities say he is working closely with the cartel to funnel massive quantities of drugs into the US and Canada. \"Whether you are a street-level drug dealer ... or an international drug kingpin, we are coming for you,\" Ms Bondi said. \"We will find you and you will be accountable and held to justice for your crimes.\" Wedding, whose aliases include El Jefe, Public Enemy and James Conrad King, was charged in 2024 with running a drug ring that moves some 60 tons of cocaine a year using long-haul lorries to bring the drugs between Colombia, Mexico, Southern California and Canada. Authorities say he and his co-conspirators used a Canadian website called The Dirty News to post a photograph of the witness so he could be identified and killed. The witness was then followed to a restaurant in Medellin and shot in the head in January. Read more from Sky News:On the ground in Gaza - a landscape of complete devastationRussia accuses government of being 'provocative' after spy ship nears UK \"Wedding placed the bounty on the victim's head, and the erroneous belief that the victim's death would result in the dismissal of criminal charges against him and his international drug trafficking ring, and would further ensure that he was not extradited to the United States,\" said Bill Essayli, the top federal prosecutor for the Central District of California. \"He was wrong.\" The US government is also offering rewards of up to $2m for others involved in the killing."
    },
    {
        "title": "Russia accuses British government of being 'provocative' after spy ship nears UK",
        "description": "Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK.",
        "url": "https://news.sky.com/story/russian-spy-ship-currently-on-edge-of-uk-waters-warns-defence-secretary-13472703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yantar-english-channel_7085832.jpg?20251119105235",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 09:43:00",
        "Headline": "Defence Secretary John Healey says the UK has \"military options ready\" if Russian spy ship the Yantar sails closer to British shores.",
        "Content": " Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK. At a news conference in Downing Street on Wednesday, John Healey said the Yantar was on the edge of British waters north of Scotland, having entered wider UK waters over the last few weeks. He said it was the second time this year the ship had been deployed off the UK coast and he claimed it was \"designed for gathering intelligence and mapping our undersea cables\". Politics latest: 'Budget leaks are not acceptable,' says Reeves Mr Healey said the ship had \"directed lasers\" at pilots of surveillance aircraft monitoring its activities - a Russian action he called \"deeply dangerous\". The defence secretary explained: \"We deployed a Royal Navy frigate and RAF planes to monitor and track this vessel's every move, during which the Yantar directed lasers at our pilots.\" He said his message to Moscow and President Vladimir Putin was \"we see you, we know what you're doing, and if the Yantar travels south this week, we are ready\". \n                  Welfare versus warfare: Sir Keir Starmer's unresolved question  - and why the PM's pinned his hopes on economic growth\n                 \n                  Is Trump's America chaos? Or are memories just short?\n                 \n                  Europe must be ready to build 'millions of drones' to defend itself against possible Russian attacks, EU warns\n                 Mr Healey also stated the UK government has \"military options ready\" if the ship sails closer to British shores. Russia's response Responding to Mr Healey's comments, the Russian embassy to the UK said on social media it noted his \"latest provocative statements\" and insisted the ship was an \"oceanographic research vessel... in international waters\". The embassy said the British accusations \"raise a smile\" and Russia's actions were \"not aimed at undermining\" the UK's security. It hit out at the UK government's \"Russophobic course and the escalation of militaristic hysteria\", which it warned creates \"prerequisites for new dangerous situations\", as it urged London to \"refrain from destructive steps\". Read more:Analysis: A Bond-villain ship prowling our waters The defence secretary's remarks come after a report from MPs warned the UK lacks a plan to defend itself from a military attack, despite the government promising to boost readiness with new arms factories. At least 13 sites across the UK have been identified for new factories to make munitions and military explosives, with Mr Healey expecting the arms industry to break ground at the first plant next year. The report, by the Commons Defence Committee, said the UK \"lacks a plan for defending the homeland and overseas territories\" as it urged the government to launch a \"co-ordinated effort to communicate with the public on the level of threat we face\". 'Assertive retaliation' Now the government has been cautioned it may need to be \"more muscular\" in standing up to Russia. The chair of the Joint Committee on National Security Strategy, Matt Western, said Wednesday's development \"demonstrates once again that Russia presents a genuine and immediate threat to the UK's security\". He added that \"the UK needed to be more muscular in tackling Russian aggression\" and \"there is more we can do\". \"More assertive retaliation may be required,\" he concluded. Mr Healey acknowledged the dangers facing the UK, saying the country was in a \"new era of threat\" that \"demands a new era for defence\". Giving more details on the vessel, he said it was \"part of a Russian fleet designed to put and hold our undersea infrastructure and those of our allies at risk\". Read more from Sky News:Briton who volunteered as spy for Russia jailedRail line blast 'initiated by Russian secret services' He said the Yantar wasn't just part of a naval operation but part of a Russian programme driven by Moscow's Main Directorate of Deep-Sea Research, or GUGI, which is \"designed to have capabilities which can undertake surveillance in peacetime and sabotage in conflict\". \"That is why we've been determined, whenever the Yantar comes into British wider waters, we track it, we deter it and we say to Putin we are ready, and we do that alongside allies,\" he added. Asked by Sky News' political correspondent Rob Powell whether this was the first time that lasers had been used by a Russian vessel against pilots, Mr Healey replied: \"This is the first time we've had this action from Yantar directed against the British RAF. \"We take it extremely seriously. I've changed the Navy's rules of engagement so that we can follow more closely, monitor more closely, the activities of the Yantar when it's in our wider waters. We have military options ready.\" Mr Healey added that the last time the Yantar was in UK waters, the British military surfaced a nuclear-powered attack submarine close to the ship \"that they did not know was there\"."
    },
    {
        "title": "Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk",
        "description": "They've said they are offering him an opportunity to tell them everything, once and for all.",
        "url": "https://news.sky.com/story/deadline-day-for-andrew-to-respond-to-epstein-inquiry-but-its-hard-to-imagine-why-hed-talk-13472817",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-19 14:08:00",
        "Headline": "Andrew Mountbatten-Windsor was summoned by the US Congress to answer questions about his relationship with Jeffrey Epstein - and the deadline to respond is today. But based on how that Newsnight interview went, he may decide not to.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  They've said they are offering him an opportunity to tell them everything, once and for all. But as we hit the two-week deadline set by the US Congress committee investigating Jeffrey Epstein for a reply from Andrew Mountbatten-Windsor, will he agree to their request to open up about the paedophile financier? The letter sent by the House Committee on Oversight and Government Reform said members wanted to talk to him because of the widely reported allegations that have been made against him, which he denies, and because of his relationship with Epstein and what he may have seen. The committee is looking into Epstein's crimes and his wider sex trafficking network. Andrew was given until today, 20 November, to respond. Legally he isn't obliged to talk to them, and to be honest it's hard to imagine why he would. The only time he has spoken at length about the allegations against him and his relationship with Epstein was that Newsnight interview in 2019, and we all know how much of a disaster that was.  Yes, this could be an opportunity for him to publicly apologise for keeping up his links with Epstein, which he has never done before, or show some sympathy towards Epstein's victims, even as he vehemently denies the allegations against him. But while there is the moral argument that he should tell the committee everything he knows, it could also raise more uncomfortable questions for him, and that could feel like too much of a risk for Andrew and the wider Royal Family. However, even saying no won't draw all this to a close. There are other outstanding loose ends. The Metropolitan Police still have to tell us if they intend to take any further action after they said they were looking into claims Andrew had asked one of his officers to dig up dirt on his accuser, Virginia Giuffre. Read more:King formally strips Andrew of prince titleBill to release Epstein files gets all-clear from Congress  There could also still be a debate in parliament about the Andrew problem. The Liberal Democrats have said they want to use their opposition debating time to bring the issue to the floor of the House of Commons, while other MPs on the Public Accounts Committee have signalled their intention to look into Andrew's finances and housing arrangements. And then there are the wider Epstein files over in America, and what information they may hold. From developments this week, it seems we are edging ever closer to seeing those released. All of this may mean Andrew in other ways is forced to say more than he wants to, even without opening up to the Congress committee."
    },
    {
        "title": "Robert Best death: Women in court after man's body found in Inverclyde field",
        "description": "Two women have appeared in court charged with attempting to defeat the ends of justice after a man was found dead in a field in Inverclyde.",
        "url": "https://news.sky.com/story/robert-best-death-women-in-court-after-mans-body-found-in-inverclyde-field-13472727",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-robert-best-police-scotland_7080874.jpg?20251119164343",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-11-19 10:42:00",
        "Headline": "Dorothy Shields, 64, and Nicola Brisland, also known as Nicola Campbell, 41, have been accused of attempting to defeat the ends of justice.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Two women have appeared in court charged with attempting to defeat the ends of justice after a man was found dead in a field in Inverclyde. The body of Robert Best, 50, was discovered near High Mathernock Farm, Kilmacolm, on the morning of 11 November. He had been reported missing from Greenock the same day. Dorothy Shields, 64, and Nicola Brisland, also known as Nicola Campbell, 41, were arrested and charged in connection with Mr Best's death. The pair appeared before Greenock Sheriff Court on Wednesday, where they made no plea to the charge of attempting to defeat the ends of justice. The suspects, both of Port Glasgow, were granted bail ahead of their next court appearance, which is yet to be confirmed. Andrew Brodie, 51, and Stephen Shields, 44, have already appeared in court in connection with the case. \n                  Olivia Curley: School pays tribute to 11-year-old girl after 'unexplained' death\n                 \n                  'One of the greatest nights in Scottish football': A nation revels in World Cup success\n                 \n                  Ex-East Dunbartonshire Council leader Andrew Polson jailed for romance fraud and stealing money from Christian radio station\n                 The pair have each been charged with murder and attempting to defeat the ends of justice. The suspects, both of Greenock, made no plea to the two separate charges last week and were remanded in custody ahead of their next court appearance. A 45-year-old man previously arrested in connection with assault and a 41-year-old man arrested at the same time as the two women have both been released pending further enquiries. Read more from Sky News:Police probe 'unexplained' death of 11-year-old girlEx-Met officer guilty of more sexual offences Police Scotland previously said officers investigating Mr Best's death were carrying out enquiries into a report of a disturbance in Lansbury Street, Greenock, which took place between 11pm on 10 November and 3am on 11 November. A force spokesperson said: \"Enquiries are ongoing.\""
    },
    {
        "title": "Waste mountain branded 'utterly appalling' by PM grew 40 feet high within months",
        "description": "A mountain of waste branded \"utterly appalling\" by Prime Minister Sir Keir Starmer grew so quickly that most of it was in place before the Environment Agency (EA) was even aware of it.",
        "url": "https://news.sky.com/story/waste-mountain-branded-utterly-appalling-by-pm-grew-40-feet-high-within-months-13472792",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-river-cherwell-kidlington_7083471.jpg?20251116165151",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 17:28:00",
        "Headline": "Environment Agency bosses said those responsible would pay for the \"blight on the landscape\" they had left.",
        "Content": " A mountain of waste branded \"utterly appalling\" by Prime Minister Sir Keir Starmer grew so quickly that most of it was in place before the Environment Agency (EA) was even aware of it. Sky News revealed this week how the site in Oxfordshire, next to the A34, went from a grassy field in March to a pile of rubbish 12 metres/40ft thick in September. Sir Keir has called the scene \"utterly appalling\" while the EA says it is \"laser focused\" on pursuing the perpetrators. Anna Burns, the agency's director for the Thames area, said those responsible would pay for the \"blight on the landscape\" they had left. She said: \"Most of the tipping happened before we were aware of it. As soon as we were aware, we acted quickly and decisively. \"We are pursuing this as a criminal investigation and currently following a number of leads, and we are laser focused on pursing that investigation. \"And we are working with partners to understand the risks associated with the site. \"I completely understand why communities want this waste gone, it's a blight on the landscape.\"  She added that the waste appeared to be shredded domestic and commercial waste, like plastic and paper, which is non-hazardous, though it may also include items like batteries. At the site this week, Sky spotted an old DVD, tooth floss and AA batteries at the edge of a waste pile. Read more from Sky News:Weather warnings for snow and ice updatedWhat is the mysterious Yantar 'spy ship'? Ms Burns' remarks come as the EA convenes a meeting about the site with organisations including Thames Valley Police, National Highways, and the local authority. The agency first visited the site at the beginning of July, after it was reported to them, and issued a cease-and-desist letter to stop further tipping. After more dumping was then discovered, officers secured a court order to close down the site in October. Now the EA is monitoring water run-off from the site and has installed a boom there to try to prevent leakage into the nearby River Cherwell. Earlier this week, Calum Miller, Liberal Democrat MP for Bicester and Woodstock, told Sky News that the clean-up operation could exceed the entire yearly budget for Cherwell District Council."
    },
    {
        "title": "Oasis fan fell to his death at Wembley in 'tragic accident', coroner's court hears",
        "description": "An Oasis fan who fell to his death at Wembley Stadium was the victim of a \"tragic accident\", a pre-inquest review has heard.",
        "url": "https://news.sky.com/story/oasis-fan-fell-to-his-death-at-wembley-in-tragic-accident-coroners-court-hears-13472861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lee-claydon-oasis_6983635.jpg?20250805191312",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 15:50:00",
        "Headline": "Police tell a pre-inquest hearing they have completed their investigation into the death of Bournemouth man Lee Claydon, 45, who died at the London stadium on 2 August. The full inquest will take place on 26 February next year.",
        "Content": "An Oasis fan who fell to his death at Wembley Stadium was the victim of a \"tragic accident\", a pre-inquest review has heard. Bournemouth man Lee Claydon, 45, died following the incident at the London venue on 2 August. Detective Sergeant James Raffin, from the Met Police, said there were \"no concerns\" from Mr Claydon's toxicology report.  He also said that while Mr Claydon had drunk alcohol, this was \"expected\" and \"normal for any of the people attending\" the Oasis gig. The force had also ruled out the possibility of suicide, he said. He told Barnet Coroner's Court the police had now completed their investigation into his death He said: \"From a police point of view, this is no longer a criminal prosecution. \n                  Oasis guitarist 'Bonehead' taking break from reunion tour as he reveals prostate cancer diagnosis\n                 \n                  Paul Gallagher: Older brother of Oasis stars Liam and Noel denies rape charge\n                 \n                  Fans to see Ticketmaster changes after Oasis investigation - here's what they are\n                 \"We do not suspect any third party involvement. \"This, from everything we have seen, was a tragic accident. \"From a police point of view, I would say our investigation is complete.\" DS Raffin said he was aware the family had concerns over the \"circumstances on the night\", and said he would pass these on to officials at Brent Council. The deceased's father, Clive Claydon, 75, previously raised questions about barriers at the venue. \"It must have been horrific,\" he said in August. \"All I know is there was beer everywhere, it's slippery, he slipped apparently, we do not know the rest of it, there's questions about the barriers.\" Brent Council will now review the police report. Mr Claydon, a landscape gardener, fell during a gig that formed part of Oasis' sell-out Live '25 reunion tour - their first since splitting in 2009. The inquest opening, which took place in September, heard that the father-of-three was taken to a medical centre in Wembley after the fall, where he was pronounced dead at 10.38pm. A post-mortem examination on 6 August gave his preliminary medical cause of death as \"multiple bodily injuries\". Senior Coroner Andrew Walker told the review hearing the full inquest will take place on 26 February next year. He said: \"It looks like we are going to be in a position next February to have reports from the London Borough of Brent over the circumstances and also we will have by then the police investigation report.\" Oasis previously said in a statement: \"We are shocked and saddened to hear of the tragic death of a fan at the show. \"Oasis would like to extend our sincere condolences to the family and friends of the person involved.\" In a statement at the time of the fall, a Wembley spokesperson said: \"The stadium operates to a very high health and safety standard, fully meeting legal requirements for the safety of spectators and staff, and is certified to and compliant with the ISO 45001 standard. \"We work very closely and collaboratively with all relevant event delivery stakeholders - including event owners, local authorities, the Sports Grounds Safety Authority and the police - to deliver events to high standards of safety, security and service for everyone attending or working in the venue.\""
    },
    {
        "title": "Pro-Palestine activists accused of harassing Labour MP over Israel-Hamas war have convictions thrown out",
        "description": "Two pro-Palestinian activists found guilty of harassing a government minister have had their convictions overturned.",
        "url": "https://news.sky.com/story/pro-palestine-activists-accused-of-harassing-labour-mp-over-israel-hamas-war-have-convictions-thrown-out-13472840",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hiba-ahmed-ayeshah-behit_7086160.jpg?20251119164401",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 15:15:00",
        "Headline": "Ayeshah Behit, 32, and Hiba Ahmed, 26, were found guilty at magistrates' court in June of the offence against Labour MP Alex Davies-Jones. But Judge Tracey Lloyd-Clarke said during a crown court hearing on Wednesday the prosecutions were not necessary. ",
        "Content": "Two pro-Palestinian activists found guilty of harassing a government minister have had their convictions overturned. Ayeshah Behit, 32, and Hiba Ahmed, 26, were in June found guilty of the offence against the Labour MP for Pontypridd, Alex Davies-Jones, at Cardiff Magistrates' Court. The pair challenged the ruling, asking for the verdict to be determined by a crown court, as they denied they harassed Ms Davies-Jones and argued they were exercising their right to free speech. At Cardiff Crown Court on Wednesday, Judge Tracey Lloyd-Clarke said the prosecutions were unnecessary and allowed both appeals. Ms Behit and Ms Ahmed had filmed a confrontation with Ms Davies-Jones, who had been campaigning in Treforest, Rhondda Cynon Taf, in the run-up to the general election, on 26 June last year. As she made her way to the campaign meeting place, she saw Ms Behit and Ms Ahmed with leaflets which suggested she was a \"full-blown supporter of this genocide\" - referring to the Israel-Hamas conflict. Ms Davies-Jones told the court she was aware of what was on the leaflets and had initially approached the defendants in an attempt to defuse the situation. Read more from Sky News: Inflation slows to 3.6%, but food costs shoot upwardsWeather warnings for snow and ice updated She said they asked why she had abstained on a Commons ceasefire vote and she decided to end the conversation when it became \"confrontational\". A video of the interaction was played in court, with the pair shouting as the MP walked away. \"It was becoming quite scary,\" said the MP, who is now parliamentary under-secretary of state for victims. An edited video of her interaction was later posted on social media, with suggestions that she was racist and Islamophobic. Ms Ahmed, who has no previous convictions, was given a 12-month conditional discharge in June. Ms Behit, who had a previous conviction relating to a protest in Cardiff last year, was handed an 18-month conditional discharge. During the three-day appeal hearing, representatives for the pair argued their actions did not amount to harassment and were a reasonable exercise of their rights to freedom of expression. Francesca Cociani, for the appellants, said: \"It was not only in a public place but it was within her constituency... In the middle of a national campaign for the general election.\" Judge Lloyd-Clarke said the actions of the two activists amounted to a \"planned and well-orchestrated campaign\" which had the aim of harming the electoral prospects of Ms Davies-Jones. But she noted that \"less intrusive\" measures such as a police warning or civil action were not pursued before they were prosecuted. \"Nothing in this judgment implies, or should be taken to imply, that there is any truth in the accusations made by the appellants about Ms Davies-Jones,\" the judge added. \"We are not satisfied that a prosecution was necessary... the appeals of both defendants are allowed.\""
    },
    {
        "title": "Princess of Wales says her children were 'very sad' to miss Paddington at Royal Variety Performance",
        "description": "The Princess of Wales has admitted her children were \"very sad\" to miss the Royal Variety Performance in London, which she and the Prince of Wales attended.",
        "url": "https://news.sky.com/story/princess-of-wales-says-her-children-were-very-sad-to-miss-paddington-at-royal-variety-performance-13472933",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-of-wales-prince-william_7086300.jpg?20251119204213",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 20:21:00",
        "Headline": "William and Kate made their first appearance at the event - headlined by the cast of Paddington The Musical - since the princess's recovery from cancer.",
        "Content": "The Princess of Wales has admitted her children were \"very sad\" to miss the Royal Variety Performance in London, which she and the Prince of Wales attended. Prince William and Kate made their first appearance at the event since her recovery from cancer. Wednesday's red carpet show at the Royal Albert Hall was headlined by the cast of Paddington The Musical. After arriving and being presented with posies by nine-year-old twins Emelia and Olivia Edwards, the family of staff at a care home for entertainment industry workers, Kate asked if they were fans of Paddington Bear. The princess, wearing a green velvet gown, then told the girls that her children were \"very sad\" not to attend the show and added she had to tell them children were not allowed to go. \"My kiddies were very sad, we're going to have to keep it a big secret that I saw you guys,\" she said. \"They were very sad not to be joining us.\" It is the sixth time William and Kate have attended the annual charity event. When Olivia told the prince, wearing a tuxedo, her favourite singer was Billie Eilish, he replied she had good taste. He said: \"It's very nice to see you both. You're very smiley, you two.\" The royals were also greeted on the red carpet by ITV board members and representatives from the Royal Variety Charity, of which the King is the royal patron. The Paddington cast were set to take to the stage on Wednesday evening, while pop star Jessie J and Grammy award-winning singer Laufey were also expected to perform. Read more from Sky News:New record for wind-powered electricity in BritainWeather warnings for snow and ice updated Held annually, the Royal Variety Performance was first staged in 1912 for King George V and Queen Mary in support of the charity, which helps those working in the entertainment industry. Ahead of the show, its executive producer Giles Cooper said the charity was \"thrilled\" the prince and princess would \"once again attend the Royal Variety Performance\". Mr Cooper, also chairman of the charity, added: \"This annual great British institution, viewed by a worldwide TV audience of over 150 million, continues to be a crucial fundraising event supporting people in all areas of performance, either on or off stage. \"In this pressurised world of working in the entertainment industry, our mental health initiative, started in 2024, has been a lifeline for many who are experiencing issues such as anxiety, depression or addiction.\" On Tuesday, the princess called on businesses to value \"time and tenderness just as much as productivity and success\" in her first speech since she was diagnosed with cancer at the start of 2024. Speaking at the Future Workforce Summit, Kate told 80 business leaders: \"Every one of you interacts with your own environment; a home, a family, a business, a workforce, a community. \"These are the ecosystems that you yourselves help to weave. Imagine a world where each of these environments were built on valuing time and tenderness just as much as productivity and success. \"As business leaders, you will face the daily challenge of finding the balance between profitability and having a positive impact. But the two are not, and should not be incompatible.\""
    },
    {
        "title": "Olivia Curley: School pays tribute to 11-year-old girl after 'unexplained' death",
        "description": "Tributes have been paid to a schoolgirl who passed away in \"unexplained\" circumstances after she became unwell.",
        "url": "https://news.sky.com/story/olivia-curley-school-pays-tribute-to-11-year-old-girl-after-unexplained-death-13472937",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-olivia-curley-scotland_7086291.jpg?20251119203546",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 21:44:00",
        "Headline": "Olivia \"was a cherished friend, full of kindness, laughter, and warmth\" said one tribute.",
        "Content": "Tributes have been paid to a schoolgirl who passed away in \"unexplained\" circumstances after she became unwell. Olivia Curley, 11, was an S1 pupil at Hermitage Academy in Helensburgh, Argyll and Bute. She became unwell at around 11.40am on Sunday and was taken to the Royal Hospital for Children in Glasgow, where she died the following day. Police are treating the death as \"unexplained\" and are investigating the circumstances. Headteacher Douglas Morgan said her loss was felt \"profoundly\". He said: \"We are deeply saddened to hear about the passing of our S1 pupil, Olivia Curley. \"Olivia was a much-loved member of our school community and an important part of the primary seven group at Hermitage Primary, who recently joined us at Hermitage Academy. \"Her loss is felt profoundly by staff, pupils and families alike. \"To support our community, a quiet space has been prepared for any pupil or staff member who may need time to reflect or talk. In addition, our chaplaincy and exchange counselling teams are available in school and will continue to provide care and support in the days and weeks ahead. \"We extend our heartfelt sympathies to Olivia's family and friends during this very difficult time.\" A GoFundMe page set up to support the family described Olivia as a \"bright, loving, and unforgettable soul who touched the hearts of everyone\". It continued: \"She was a cherished friend, full of kindness, laughter, and warmth. \"Her passing has left a hole in the lives of her family, friends, and all who loved her.\" \"Olivia will never be forgotten. Her light, her smile, and her kindness will live on in everyone whose life she touched.\" A Police Scotland spokesperson said: \"The death is being treated as unexplained and enquiries are ongoing to establish the full circumstances.\""
    },
    {
        "title": "Driving test changes announced - with more focus on faster and rural roads to cut deaths",
        "description": "Fewer driving test candidates in Britain will have to perform emergency stops as focus shifts to spending longer on faster and rural roads during tests.",
        "url": "https://news.sky.com/story/driving-test-changes-announced-with-more-focus-on-faster-and-rural-roads-to-cut-deaths-13472822",
        "image_url": "https://e3.365dm.com/21/04/1920x1080/skynews-learner-driver-driving_5347800.jpg?20210419073956",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 14:10:00",
        "Headline": "The alteration is the latest in a flurry of changes announced recently as the government tries to tackle a driving test backlog of more than 600,000.",
        "Content": "Fewer driving test candidates in Britain will have to perform emergency stops as focus shifts to spending longer on faster and rural roads during tests. The Driver and Vehicle Standards Agency (DVSA) is bringing in the changes from 24 November after a five-month trial of the switch at 20 test centres across Britain earlier this year. Nearly half (48%) of crashes involving car drivers aged 17-24 where someone was killed or seriously injured between 2019 and 2023 took place on rural roads, a House of Commons Library briefing document shows. The alteration is the latest in a flurry of changes announced recently as the government tries to tackle a driving test backlog of over 600,000. - Reducing the number of stops learners must make from four to three. - Decreasing the frequency of emergency stops from one in three tests to one in seven. - Giving examiners the power to increase the length of independent driving - which can involve following a satnav, traffic signs, or both - to between 20 minutes and the full duration of the test. The test changes come amid renewed calls for the introduction of graduated driver licenses (GDLs), a system designed to give new drivers a staggered approach to gaining full privileges on the road, such as motorway use restrictions or driving with a full car of passengers. The DVSA said the need to find slower speed areas to perform stops during a test had limited the distance and number of roads that could be used in tests. It hopes that decreasing the number of stops learners must make from four to three will provide greater flexibility when planning test routes. \n                  New campaign backs introduction of graduated driving licences\n                 \n                  Seven red flags your mechanic is ripping you off - and what you can do about it\n                 \n                  Reform council repaints road markings for school which closed in 2016\n                 Also, the frequency of emergency stops will fall to one in seven tests, from one in three. The changes will not alter the length of driving tests or the number available, said the agency. Read more from Sky News:Inflation slows to 3.6%, but food costs shoot upwardsOne killed and 170 homes damaged in Japan fire Amanda Lane, DVSA head of driver testing and driver training policy, said: \"To keep all road users safe, it's crucial that the practical driving test assesses learners on the skills required to drive in the real world.\" Roads minister Simon Lightwood said by \"focusing more tests on higher speed roads\" the move tackled one of the biggest risks for young motorists and would reduce collisions and save lives. Shake-up to try tackle backlog At the end of October there were 642,000 learner drivers in Britain with a future test booking. The DVSA attributes this to an increase in demand and people booking tests much earlier than before. Some 182,000 tests were conducted last month, an increase of 9% from 168,000 in October 2024. Last week, Transport Secretary Heidi Alexander announced that only learners - not instructors - will be able to book slots. Military driving examiners will also be mobilised to test civilians. The Department for Transport said 36 defence driving examiners will conduct public tests one day a week for 12 months. It said this would mean up to 6,500 more tests would be available over the next year at locations with the highest demand."
    },
    {
        "title": "Former Met Police officer David Carrick found guilty of more sexual offences",
        "description": "David Carrick has been found guilty of sexually abusing a 12-year-old girl and raping a former partner.",
        "url": "https://news.sky.com/story/former-met-police-officer-david-carrick-found-guilty-of-more-sexual-offences-13472819",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-david-carrick-metropolitan-police_6575623.jpg?20240607150638",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-19 14:15:00",
        "Headline": "Carrick, who is one of the UK's worst ever sex offenders, is already serving a life sentence after admitting crimes against 12 women over 17 years. ",
        "Content": "David Carrick has been found guilty of sexually abusing a 12-year-old girl and raping a former partner. Carrick, 50, was found guilty of five counts of indecent assault, two counts of rape, one of sexual assault and one of controlling or coercive behaviour. The ex-armed officer is already serving a life sentence after being unmasked as one of the UK's worst sex offenders when he admitted crimes against 12 women over 17 years. He was further accused of molesting a 12-year-old girl in the late 1980s and raping a woman during the course of a toxic relationship more than 20 years later. The Old Bailey heard he abused the young girl for 18 months before she told her mother what was going on and he confessed in a letter which was signed \"Dave\". He wrote the girl was \"not crazy\" and that it was \"true\" but that he had stopped about four months ago. The second victim met Carrick through a dating website and said she initially found him \"charming, witty, (and) sarcastic\". But during their relationship, he became controlling and raped her on multiple occasions. Carrick pleaded not guilty to two charges of rape, one of sexual assault and coercive and controlling behaviour towards the woman between 2014 and 2019, and five counts of sexual assault relating to the girl in the late 1980s. He didn't give evidence at his trial, but denied the allegations, claiming sex with the woman was consensual and the child accuser had lied. The court heard the latest allegations were made after Carrick pleaded guilty to 71 instances of sexual violence against 12 different women over a period spanning 17 years. Prosecutor Tom Little KC told jurors Carrick must have felt \"invincible\" as a police officer for two decades until everything came \"crashing around his ears\" in 2022. He was sentenced to a minimum term of 32 years in prison in 2023 in a case that caused widespread public anger after it emerged repeated opportunities to stop his offending had been missed while he was serving as a police officer. He joined the Met in 2001 before becoming an armed officer in the Parliamentary and Diplomatic Protection unit in 2009. Carrick was finally brought to justice after one of his victims came forward after another armed Metropolitan Police officer, Wayne Couzens, was sentenced for the rape and murder of Sarah Everard. Offending dates back 35 years The latest convictions show Carrick's offending dates back 35 years, long before he became a police officer. Senior Crown prosecutor Shilpa Shah said the evidence showed Carrick was a child abuser from an early age and that his sexual offending \"escalated\" in adulthood over decades. She said: \"I would describe David Carrick as a manipulative, controlling and abusive man who created a facade for the rest of the world so that no one would realise what he was doing behind closed doors. \"He was aggressive, abusive, violent, and yet he appeared to be charming and charismatic. He didn't count on his victims coming forward and exposing him as they have and I'd like to thank them for doing so.\" Detective Superintendent Iain Moor, of Hertfordshire Constabulary, said the future could have been very different if Carrick's confession was handed to police in 1990. \"Hopefully, people are starting to feel more confident to come forward and report matters to the police. I think there's still more work to do,\" he said."
    },
    {
        "title": "'Patchwork of dust and misery': At the Yellow Line dividing Gaza - where all that remains are skeletons of buildings",
        "description": "In front of me, there is a building that has collapsed upon itself, six floors piled upon each other. ",
        "url": "https://news.sky.com/story/patchwork-of-dust-and-misery-at-the-yellow-line-dividing-gaza-where-all-that-remains-are-skeletons-of-buildings-13472870",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-israel-palestine_7086140.jpg?20251119162157",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-19 16:58:00",
        "Headline": "Not so long ago, Shuja'iyya, in the north of Gaza, was a bustling town of around 100,000 people, proud of a history dating back 850 years. Now, it is a wasteland, a patchwork of dust and misery. ",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  In front of me, there is a building that has collapsed upon itself, six floors piled upon each other.  A wild dog is walking through its ruin, while a military drone buzzes above. In the distance, there is the cackle of machine gun fire. Welcome to Shuja'iyya, in the north of Gaza. Not so long ago, this was a bustling town of around 100,000 people, proud of a history dating back 850 years. Now, it is a wasteland, a patchwork of dust and misery. Israel does not allow news organisations to report independently from Gaza. Today, it took a group of journalists, including Sky News, into the area of the Strip occupied by Israeli forces. The brief visit was highly controlled and offered no access to Palestinians, or other areas of Gaza. Military censorship laws in Israel mean that military personnel were shown all our material before publication. Sky News maintained editorial control of this report at all times. The buildings in front of me have all been wrecked by warfare - at best, the sides blown out and a mere skeleton remaining. Many have simply been reduced to rubble. Over the past two years, more than 68,000 people have been killed in Gaza as a result of Israeli military action. It was a war that started on 7 October 2023, when more than 1,200 people, mostly civilians, were killed by Hamas militants in a devastating surprise attack. Now, an uneasy ceasefire hangs over Gaza, the result of the peace plan drawn up by US President Donald Trump's team and now endorsed by the United Nations. I am standing on a mound of earth at the edge of an Israeli military camp. The only signs of life around me are the Israeli soldiers behind me, a roster of wild dogs who dart around the area, and a single solitary bird that lands on a rock - a gentle counterpoint to the desolation that surrounds it. This is the Israeli side of the line that now divides Gaza into two parts. It's known as the Yellow Line, although there is no actual line running through the whole territory. A series of concrete blocks are gradually being put into place, but they are starting from the edges and working in. From where I'm standing, I can see a tall red and white mast several hundred metres away. This sits exactly on the Yellow Line, so it is a very visible sign that we are near the division. Basically, the land I'm standing on is now run by Israel, and is home to a very small number of Gazans. The vast majority of the two million-strong population is on the other side of the Yellow Line, where control is still held by Hamas. The Israeli military has invited us here. They are in charge of where we go and what we see, and they also have the right to censor the material we broadcast, although we, as journalists, retain complete editorial control over what we write and say. IDF: Hamas 'haven't changed who they are' The message they are keen to project is that, despite two years of attacks on Gaza, Hamas has not gone away and is showing no sign of disarming. And that, they insist, is something that worries all Israelis, and terrifies those who live near the border with Gaza. Some of those towns are very clearly visible through the afternoon haze. \"We're not staying here as a hobby,\" says Lieutenant Colonel Nadav Shoshani, the spokesperson for the Israeli Defence Forces (IDF). \"We're staying here to secure the people of Israel. We see it right there,\" and he points towards a nearby Israeli town. \"It's a two-minute drive to where our civilians live. And we see right here a battlefield where there were tens of thousands of Hamas terrorists. \"They haven't changed who they are. And it's going to need pressure from the international community and maybe also from Israel to make sure they disarm. \"Hamas are rearming, Hamas are killing their opponents on the street. Hamas are trying to reassert dominance, and power, in Gaza.\" Under the peace plan endorsed by the UN, a so-called stabilisation force is expected to enter Gaza to protect civilians and ensure the delivery of humanitarian aid. But we have no details of who those troops will be, when they will arrive, what their legal mandate will be or whether they will be required to disarm Hamas. For the moment, the Strip is simply split between the half where there is a strictly-enforced peace, but almost no residents, and the half where there are millions of people trying to live amid the chaos of post-war devastation. International journalists are now allowed into Gaza, but our colleagues have been there since the start of the war. As I was watching Shuja'iyya from an Israeli army camp, so they were visiting the remains of the town on the other side of the Yellow line. Read more:Trump's Gaza plan looks convincing - but there's more to this storyInside warehouse where Gaza aid held after Israel 'refused entry' 'Everything here is destroyed' What they saw was the same vista of ruin. It is impossible to imagine people living in such a place, but remarkably, some do. Our team met Iman Hasoneh, 48 years old, and ground down by the pain of life. Her husband has internal bleeding from a wound, and her children are exhausted. The family fled Shuja'iyyah months ago, then found nowhere else to live, and ended up returning to the rubble of their home. \"Our home collapsed, and it was a miracle we escaped,\" she says. \"We couldn't find anywhere else. Our struggle was immense. We moved around so much. \"There was a rocket attack over there\" - she beckons towards another collapsed building down the street - \"and the blast knocked us all over. \"I didn't expect to survive. I'm giving up. One day they will just announce that we have all been killed. We are on the edge of the Yellow Line, and there is so much suffering.\" Our team asks here about the effect of the peace plan. \"I want to be optimistic, but I'm not sure what is going to happen. \"They are giving us an anaesthetic to numb the pain. But everything here is destroyed. God willing, the Israelis will pull out and leave here.\" Above her, the drone is buzzing. It is the same drone we heard from the camp, launched from near the place where I stand and watch, now hovering over the ruined home where Iman hopes to live another day."
    },
    {
        "title": "'He must have got this from K': What mistaken tweet tells us about 'secret' plan to end Ukraine war",
        "description": "There are developments in the quest for peace in Ukraine.&#160;",
        "url": "https://news.sky.com/story/he-must-have-got-this-from-k-what-mistaken-tweet-tells-us-about-secret-plan-to-end-ukraine-war-13472965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-ternopil-russia_7086367.jpg?20251119230414",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-11-19 22:35:00",
        "Headline": "Donald Trump's special envoy Steve Witkoff clearly thought he was sending a private message given his tweet was swiftly deleted. It's given us an insight into the role he and his equally unlikely Russian counterpart are playing in a plan to end the war.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  There are developments in the quest for peace in Ukraine.  It's been one of those days when different snippets of news have come together to create a picture of sorts. The jigsaw remains complicated, but the suggestion is neither the Ukrainians nor the Europeans have been privy to the developments. As it happened: Russia responds to spy ship claim The most intriguing development came at lunchtime on Thursday. \"He must have got this from K...\" wrote Donald Trump's special envoy Steve Witkoff on X. He clearly thought he was sending a private message. He was replying to a scoop of a story by Axios's Barak Ravid. The story revealed a \"secret\" plan to end the Ukraine war. The report suggested the Americans had been talking secretly to the Russians about a renewed effort to bring the war to an end, which involved Ukraine ceding land it still controls to Russia. Who is \"K\" in Witkoff's message? It's probably Kirill Dmitriev, who has become Putin's unofficial and unlikely envoy to Washington. Kyiv-born and Stanford-educated Dmitriev is, essentially, Witkoff's Russian opposite number. In a sense, they are the yin and yang of this geopolitical puzzle. Witkoff is a real estate mogul. Dmitriev is an economist. They are opposing forces with backgrounds that are, on the face of it, equally unsuited to geopolitical conflict resolution. Yet their two leaders are trusting them with this huge task. 'Territorial concessions' in 28-point plan So, back to the developments to have emerged over the last 24 hours. First, we know senior US Department of War officials, including Army Secretary Dan Driscoll, have arrived in the Ukrainian capital to meet their counterparts there. Their visit was scheduled but the focus shifted. The plan to discuss drone technology and the winter offensive morphed into a discussion about a Russian-presented peace plan Witkoff and Dmitriev had been discussing. This is the second development. The Axios report - which Witkoff seems inadvertently to have suggested came from Dmitriev - claims the two envoys met recently in Florida (Witkoff's base) to discuss a 28-point plan for peace. A defence official told our partners at NBC News that Driscoll has been briefed on the 28-point plan. Driscoll and his military staff are thought to have been presenting an initial brief to the Ukrainian side of this Russian-sponsored plan. Ukrainian sources have suggested to me in clear terms they are not happy with this Witkoff-Dmitriev plan. Sources tell me it includes \"territorial concessions\" and \"reductions in military strength\". The Ukrainian position is the plan represents the latest attempt to \"play the American government\".  What's happening with security guarantees? Ukraine wants security guarantees from the US. Trump signalled during Zelenskyy's last visit to Washington that he was willing to provide those. This was framed by the Europeans as a huge positive development, even though the White House did not spell out the crucial detail - what would these guarantees actually entail? The latest reporting, from Axios, suggests the security guarantees (still undefined, publicly at least) are dependent on Ukraine giving up the whole of the Donbas region - this would include about 15% of territory Russia does not currently hold. Crucially, the areas of the Donbas from which Ukraine would withdraw (the 15%) would be considered a demilitarised zone. The plan is very similar to one floated by Vice President JD Vance in the months before Trump won last year's election, which was roundly rejected as a non-starter at the time. Watch more from Mark Stone:What have we learned from the Epstein files?The prince and president: What happened? Is Gaza plan the model? Another source, from a third country close to the negotiations, has told me the Qataris are playing a role in the talks and were present at the weekend when Steve Witkoff met Ukraine's national security advisor Rustem Umerov last weekend. Qatari and Turkish mediation, along with the multipoint peace plan for Gaza, is being projected as a model transferable to Ukraine despite the conflict, challenges, and root causes being wholly different. Other European sources told me this morning they were not aware of this Russian-American plan. It's worth remembering it's in the interests of the Russians to be seen to be engaged in peace proposals in order to avoid secondary sanctions from the US. Zelenskyy has been in Turkey over the past 24 hours, where he singled out Trump's efforts to find peace. \"Since the beginning of this year, we in Ukraine have supported every decisive step and the leadership of @POTUS, every strong and fair proposal aimed at ending this war.\" Zelenskyy wrote. \"And only President Trump and the United States have sufficient power to make this war come to an end.\" This is the vital language of flattery."
    },
    {
        "title": "Russia accuses British government of being 'provocative' after spy ship nears UK",
        "description": "Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK.",
        "url": "https://news.sky.com/story/russian-spy-ship-currently-on-edge-of-uk-waters-warns-defence-secretary-13472703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yantar-english-channel_7085832.jpg?20251119105235",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-19 09:43:00",
        "Headline": "Defence Secretary John Healey says the UK has \"military options ready\" if Russian spy ship the Yantar sails closer to British shores.",
        "Content": " Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK. At a news conference in Downing Street on Wednesday, John Healey said the Yantar was on the edge of British waters north of Scotland, having entered wider UK waters over the last few weeks. He said it was the second time this year the ship had been deployed off the UK coast and he claimed it was \"designed for gathering intelligence and mapping our undersea cables\". Politics latest: 'Budget leaks are not acceptable,' says Reeves Mr Healey said the ship had \"directed lasers\" at pilots of surveillance aircraft monitoring its activities - a Russian action he called \"deeply dangerous\". The defence secretary explained: \"We deployed a Royal Navy frigate and RAF planes to monitor and track this vessel's every move, during which the Yantar directed lasers at our pilots.\" He said his message to Moscow and President Vladimir Putin was \"we see you, we know what you're doing, and if the Yantar travels south this week, we are ready\". \n                  Welfare versus warfare: Sir Keir Starmer's unresolved question  - and why the PM's pinned his hopes on economic growth\n                 \n                  Is Trump's America chaos? Or are memories just short?\n                 \n                  Europe must be ready to build 'millions of drones' to defend itself against possible Russian attacks, EU warns\n                 Mr Healey also stated the UK government has \"military options ready\" if the ship sails closer to British shores. Russia's response Responding to Mr Healey's comments, the Russian embassy to the UK said on social media it noted his \"latest provocative statements\" and insisted the ship was an \"oceanographic research vessel... in international waters\". The embassy said the British accusations \"raise a smile\" and Russia's actions were \"not aimed at undermining\" the UK's security. It hit out at the UK government's \"Russophobic course and the escalation of militaristic hysteria\", which it warned creates \"prerequisites for new dangerous situations\", as it urged London to \"refrain from destructive steps\". Read more:Analysis: A Bond-villain ship prowling our waters The defence secretary's remarks come after a report from MPs warned the UK lacks a plan to defend itself from a military attack, despite the government promising to boost readiness with new arms factories. At least 13 sites across the UK have been identified for new factories to make munitions and military explosives, with Mr Healey expecting the arms industry to break ground at the first plant next year. The report, by the Commons Defence Committee, said the UK \"lacks a plan for defending the homeland and overseas territories\" as it urged the government to launch a \"co-ordinated effort to communicate with the public on the level of threat we face\". 'Assertive retaliation' Now the government has been cautioned it may need to be \"more muscular\" in standing up to Russia. The chair of the Joint Committee on National Security Strategy, Matt Western, said Wednesday's development \"demonstrates once again that Russia presents a genuine and immediate threat to the UK's security\". He added that \"the UK needed to be more muscular in tackling Russian aggression\" and \"there is more we can do\". \"More assertive retaliation may be required,\" he concluded. Mr Healey acknowledged the dangers facing the UK, saying the country was in a \"new era of threat\" that \"demands a new era for defence\". Giving more details on the vessel, he said it was \"part of a Russian fleet designed to put and hold our undersea infrastructure and those of our allies at risk\". Read more from Sky News:Briton who volunteered as spy for Russia jailedRail line blast 'initiated by Russian secret services' He said the Yantar wasn't just part of a naval operation but part of a Russian programme driven by Moscow's Main Directorate of Deep-Sea Research, or GUGI, which is \"designed to have capabilities which can undertake surveillance in peacetime and sabotage in conflict\". \"That is why we've been determined, whenever the Yantar comes into British wider waters, we track it, we deter it and we say to Putin we are ready, and we do that alongside allies,\" he added. Asked by Sky News' political correspondent Rob Powell whether this was the first time that lasers had been used by a Russian vessel against pilots, Mr Healey replied: \"This is the first time we've had this action from Yantar directed against the British RAF. \"We take it extremely seriously. I've changed the Navy's rules of engagement so that we can follow more closely, monitor more closely, the activities of the Yantar when it's in our wider waters. We have military options ready.\" Mr Healey added that the last time the Yantar was in UK waters, the British military surfaced a nuclear-powered attack submarine close to the ship \"that they did not know was there\"."
    },
    {
        "title": "Meta to block Instagram and Facebook for users under 16 in Australia",
        "description": "Meta will stop Instagram, Facebook and Threads for users in Australia under the age of 16, the company has said.",
        "url": "https://news.sky.com/story/meta-to-block-instagram-and-facebook-for-users-under-16-in-australia-13472915",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-meta-instagram_7073644.jpg?20251106114734",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-19 19:15:00",
        "Headline": "The block will come into effect by 10 December to comply with the country's social media ban for young teenagers.",
        "Content": "Meta will stop Instagram, Facebook and Threads for users in Australia under the age of 16, the company has said. The block will come into effect by 10 December to comply with the country's social media ban for young teenagers. Meta, which operates the three apps, said it had begun notifying users it believed were between 13 and 15 that their accounts will be shut down through in-app messages, email and texts. From 4 December, it will start deactivating the accounts and blocking new sign-ups by anyone under 16. The company said the process was expected to be completed by 10 December. It previously indicated to Australian politicians it would only begin removing access once the law comes into effect on that date. The company said it would use several age assurance methods to comply with the ban and adopt a \"data minimisation approach\", only seeking additional information when it had reason to doubt a user's stated age. \"While we are working hard to remove all users who we understand to be under the age of 16 by 10 December, compliance with the law will be an ongoing and multi-layered process,\" said Antigone Davis, Meta's vice president and global head of safety. Read more:Australia's social media ban can be enforced 'effectively' - report There are around 350,000 Instagram users and around 150,000 Facebook users aged between 13 and 15 in Australia, according to the country's internet regulator. No data has been published for Threads. Meta said affected teenagers can update their contact details to be notified once they turn 16."
    },
    {
        "title": "South Korea: All 267 passengers and crew rescued from ferry that ran aground, says coastguard",
        "description": "More than 250 passengers on board a ferry that ran aground off the South Korean coast have been rescued, according to the coastguard.",
        "url": "https://news.sky.com/story/south-korea-all-267-passengers-and-crew-rescued-from-ferry-that-ran-aground-says-coastguard-13472834",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-korea-ferry_7086033.jpg?20251119144207",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-19 14:42:00",
        "Headline": "The Queen Jenuvia 2 was sailing from the southern island of Jeju to the southwestern port city of Mokpo, before hitting rocks late on Wednesday, the coastguard said.",
        "Content": "More than 250 passengers on board a ferry that ran aground off the South Korean coast have been rescued, according to the coastguard. It said the Queen Jenuvia 2, travelling from the southern island of Jeju to the southwestern port city of Mokpo, hit rocks near Jindo, off the country's southwest coast, late on Wednesday. A total of 267 people were on board, including 246 passengers and 21 crew. Three people had minor injuries. Footage showed passengers wearing life vests waiting to be picked up by rescue boats, which were approaching the 26,000-tonne South Korean ferry. Its bow seemed to have become stuck on the edge of a small island, but it appeared to be upright and the passengers seemed calm. Weather conditions at the scene were reported to be fair with light winds. South Korea's Prime Minister Kim Min-seok ordered all available boats and equipment to be used to rescue those on board, his office said. \n                  Former South Korean leader Yoon Suk Yeol charged over drone flights into North Korea\n                 \n                  Third body pulled from rubble after boiler tower collapses in South Korea - four still trapped \n                 \n                  South Korean anti-foreigner protests 'self-destructive' and must end, says president\n                 The coastguard received a report of the incident late on Wednesday, and immediately deployed 20 vessels and a plane to join the rescue effort. It was not immediately clear what caused the vessel to run aground. The vessel can carry up to 1,010 passengers and has multiple lower decks for large vehicles and passenger vehicles, according to its operator Seaworld Ferry. Read more on Sky News:Russian spy ship 'near UK'Warnings as heavy snow hits In 2014, more than 300 people, mostly schoolchildren heading to Jeju on a school trip, died when the Sewol ferry sank. It was one of the country's worst disasters. The ship went down 11 years ago near the site of Wednesday's incident, though further off Jindo. After taking a turn too fast, the overloaded and illegally-modified ferry began listing. It then lay on its side as passengers waited for rescue, which was slow to come, before sinking as the country watched on live television. Many of the victims were found in their cabins, where they had been told to wait by the crew while the captain and some crew members were taken aboard the first coastguard vessels to arrive at the scene."
    },
    {
        "title": "A Bond-villain ship prowling our waters: Why the Yantar alarms the West",
        "description": "The Yantar may look scruffy and unthreatening but below the surface it's the kind of ship a Bond villain would be proud of.",
        "url": "https://news.sky.com/story/a-bond-villain-ship-prowling-our-waters-why-the-yantar-alarms-the-west-13472832",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-russian-yantar_7085910.jpg?20251119122923",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-11-19 14:34:00",
        "Headline": "With hidden subs, laser systems and cable-cutting gear, Russia's covert vessel is mapping - and has the potential to target - the vital undersea networks our economies rely on.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The Yantar may look scruffy and unthreatening but below the surface it's the kind of ship a Bond villain would be proud of. In hangars below decks lurk submersibles straight out of the Bond film Thunderball. Two Consul Class mini manned subs are on board and a number of remotely operated ones. It can \"undertake surveillance in peacetime and sabotage in conflict\", in the words of Britain's Defence Secretary John Healey. Cable-cutting equipment combined with surveillance and intelligence gathering capabilities make this a vessel to be reckoned with. Most worryingly though, in its most recent tangle with RAF planes sent to stalk it, the Yantar deployed a laser to distract and dazzle the British pilot. Matthew Savill, from the Royal United Services Institute, told Sky News this was potentially a worrying hostile act. He said: \"If this had been used to dazzle the pilot and that aircraft had subsequently crashed, then maybe the case could be made that not only was it hostile but it was fundamentally an armed attack because it had the same impact as if they'd used a weapon.\" \n                  'He must have got this from K': What mistaken tweet tells us about 'secret' plan to end Ukraine war\n                 \n                  Explosion on rail line 'initiated by Russian secret services', Polish government says\n                 \n                  Hundreds of Russian troops roll into key frontline Ukrainian city 'Mad Max-style', video appears to show\n                 The Yantar is off our waters and here to threaten the West's Achilles heel, says our government. Undersea infrastructure is essential to our hyper-connected world. Undersea cables are the vital nervous system of Western civilisation. Through them courses the data that powers our 21st century economies and communications systems. Pipelines are equally important in supplying fuel and gas that are vital to our prosperity. But they stretch for mile after mile along the seabed, exposed and all but undefended. Their vulnerability is enough to keep Western economists and security officials awake at night, and Russia is well aware of that strategic weakness. Read more:What is the mysterious Yantar 'spy ship'?Why UK's undersea cables are vulnerableUK plan to defend from invasion moving at 'glacial' pace That is why some of the most sophisticated kit the Russian military possesses is geared towards mapping and potentially threatening them. The Yantar's concealed capabilities are currently being used to map that underwater network of cables and pipelines, it's thought, but they could in the future be used to sabotage them. Russia has been blamed for mysterious underwater attacks in the recent past. A more kinetic conflict striking at the West's soft underwater underbelly could have a disastrous impact. Enough damage to internet cables could play havoc with Western economies. It is a scenario security experts believe the West is not well enough prepared for. Putting the Yantar and its Russian overseers on watch is one thing; preventing them from readying for such a doomsday outcome in time of war is quite another."
    },
    {
        "title": "Former Olympic snowboarder wanted by US charged with masterminding murder of witness",
        "description": "A Canadian former Olympic snowboarder who is wanted in the US for running a multi-national drug trafficking network is also facing charges in connection with the killing of a federal witness, the US Attorney General, Pam Bondi, has announced.",
        "url": "https://news.sky.com/story/former-olympic-snowboarder-wanted-by-us-charged-with-masterminding-murder-of-witness-13472956",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ryan-wedding-wanted_7086358.jpg?20251119224848",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-19 23:40:00",
        "Headline": "Ryan Wedding is accused of orchestrating the killing of the witness in Colombia to help him avoid extradition to the US in January.",
        "Content": "A Canadian former Olympic snowboarder who is wanted in the US for running a multi-national drug trafficking network is also facing charges in connection with the killing of a federal witness, the US Attorney General, Pam Bondi, has announced. Ryan Wedding is accused of orchestrating the killing of the witness in Colombia to help him avoid extradition to the US in January. Ten other defendants have been arrested on the charges in the federal indictment, which was unsealed in California. US authorities are now offering up to $15m for information leading to the arrest of Wedding, who is on the FBI's 10 Most Wanted list. He is believed to be living in Mexico under the protection of the Sinaloa cartel. Authorities say he is working closely with the cartel to funnel massive quantities of drugs into the US and Canada. \"Whether you are a street-level drug dealer ... or an international drug kingpin, we are coming for you,\" Ms Bondi said. \"We will find you and you will be accountable and held to justice for your crimes.\" Wedding, whose aliases include El Jefe, Public Enemy and James Conrad King, was charged in 2024 with running a drug ring that moves some 60 tons of cocaine a year using long-haul lorries to bring the drugs between Colombia, Mexico, Southern California and Canada. Authorities say he and his co-conspirators used a Canadian website called The Dirty News to post a photograph of the witness so he could be identified and killed. The witness was then followed to a restaurant in Medellin and shot in the head in January. Read more from Sky News:On the ground in Gaza - a landscape of complete devastationRussia accuses government of being 'provocative' after spy ship nears UK \"Wedding placed the bounty on the victim's head, and the erroneous belief that the victim's death would result in the dismissal of criminal charges against him and his international drug trafficking ring, and would further ensure that he was not extradited to the United States,\" said Bill Essayli, the top federal prosecutor for the Central District of California. \"He was wrong.\" The US government is also offering rewards of up to $2m for others involved in the killing."
    },
    {
        "title": "One killed and 170 homes damaged or destroyed as fire burns in Japan",
        "description": "A fire has killed one and damaged or burned 170 buildings after starting during strong winds in south-western Japan.",
        "url": "https://news.sky.com/story/one-killed-and-170-homes-damaged-or-destroyed-as-fire-burns-in-japan-13472667",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-japan-fire-oita_7085703.jpg?20251119085005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-19 08:48:00",
        "Headline": "A man in his 70s was unaccounted for and firefighters later found a body, possibly of the missing man, the disaster response team said.",
        "Content": " A fire has killed one and damaged or burned 170 buildings after starting during strong winds in south-western Japan. Aerial footage showed homes reduced to rubble and thick plumes of smoke rising from the hilly Saganoseki district of Oita city. A man in his 70s was unaccounted for and firefighters later found a body, possibly of the missing man, the Oita prefectural disaster response team said. The fire started on Tuesday evening near a fishing port in the city of Oita on the southern main island of Kyushu, with the cause still under investigation. It has burned 48,900 square metres - roughly the size of seven football pitches - forcing 175 residents in the district, some 770 km (478 miles) southwest of Tokyo, to evacuate to an emergency shelter, Japan's Fire and Disaster Management Agency said. Dozens of fire engines, two army helicopters and more than 200 firefighters were sent to tackle the blaze, which was not fully under control nearly 20 hours after it started. Read more:Did 'man in white shorts' evade justice over one-punch killing of young British father?MI5 is also trying to send a signal to China with spying warning to parliamentarians It may take a few days before the fire is completely extinguished, town mayor Shinya Adachi told reporters after he visited the devastated neighbourhood on Wednesday. A firefighter told the Kyodo News Agency that the operation was hampered by narrow backstreets that fire engines were unable to pass through. One resident told Kyodo News Agency she quickly fled without many of her belongings because the fire \"spread in the blink of an eye\". Around 260 homes remained without electricity on Wednesday afternoon. Prime Minister Sanae Takaichi posted a statement on X pledging to \"provide maximum support\" and offering sympathy for those affected. The number of buildings and size of the area engulfed in flames make it the largest urban fire in Japan since a 1976 fire in Sakata, excluding incidents caused by earthquakes."
    },
    {
        "title": "Ship that hit Baltimore road bridge lost power before fatal collision due to a single loose wire",
        "description": "A single loose wire on the container ship that crashed into and partially destroyed a US road bridge, led to the vessel losing of power just before the fatal collision, investigators have concluded.",
        "url": "https://news.sky.com/story/ship-that-hit-baltimore-road-bridge-lost-power-before-fatal-collision-due-to-a-single-loose-wire-13472739",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-baltimore-bridge-collapse_6502610.jpg?20240327175856",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-19 10:56:00",
        "Headline": "Police had around 90 seconds to clear vehicles from the Francis Scott Key Bridge as it was not equipped with warning systems to halt traffic that are now recommended. They were unable to prevent the deaths of six construction workers",
        "Content": " A single loose wire on the container ship that crashed into and partially destroyed a US road bridge, led to the vessel losing of power just before the fatal collision, investigators have concluded. The US National Transportation Safety Board (NTSB) has found that the unconnected electric cable meant the Dali experienced a loss of propulsion and steering less than a mile from Francis Scott Key Bridge in Baltimore. The collision on 26 March 2024 that followed collapsed a span of the bridge and killed six construction workers who were unable to escape in time. It led to the blockage of the mouth of one of America's busiest ports for almost three months. Investigators found that an improperly placed label on the wire prevented it from being fully inserted, causing an inadequate connection. The NTSB's chair said locating the loose wire was like trying to find a single loose rivet on the Eiffel Tower. The board has praised the ship's crew. \"The crew's actions were as timely as they could be, and they were appropriate and also impressive considering the circumstance,\" board member Michael Graham said. \n                  Baltimore bridge collapse: Owner of cargo ship agrees to pay $102m to US government\n                 \n                  Dali: Ship in deadly Baltimore bridge collapse leaves three months after disaster\n                 \n                  Baltimore bridge collapse: Channel fully cleared after cargo ship collided with bridge support\n                 But he called on the maritime shipping industry to strengthen its safety systems and better manage risks to bring it into line with the rigorous approach taken in aviation. \"Many of these issues we have discussed today as part of this accident could have been identified, addressed, and either mitigated or eliminated,\" Mr Graham said. The far reaching consequences of the accident are continuing. State officials have more than doubled the projected cost of the bridge rebuild from an upper estimate of $1.9bn (£1.4bn) to $5.2bn (£3.9bn) - with the reopening date pushed back to late 2030. How to prevent future tragedies  In March, the board called for urgent safety assessments of 68 bridges in 19 US states including famous crossings like the Golden Gate Bridge in San Francisco and New York's Brooklyn Bridge. The organisation found that countermeasures to reduce the vulnerability of the bridge from ships could have been implemented if a vulnerability assessment had been conducted by the Maryland Transportation Authority The board has now issued numerous recommendations to try to prevent future catastrophic collisions. Major bridges should consider adopting motorist warning systems that can immediately stop motorists from entering bridges in an emergency. The Baltimore bridge, like many others, was not equipped with a warning system to prevent vehicles entering. But police managed to clear and halt traffic on the bridge before the collapse, despite only having about 90 seconds to do so. Read more:Owner of cargo ship agrees to pay $102mFBI opens criminal probe into Baltimore bridge collapse If traffic had not been stopped, it is likely that the death toll would have been much higher. Police officers were discussing how to best evacuate the six workers who were on the bridge moments before the entire structure collapsed. Other recommendations include the periodic inspections of high-voltage switchboards and proposed changes that would allow ships to recover faster from a loss of power. In a joint statement, Grace Ocean (the Dali's manager) and Synergy Marine Group (the Dali's operator) thanked the NTSB for its investigation and stressed that they had fully cooperated with the board. It said: \"Grace Ocean and Synergy Marine Group continue to extend their deepest sympathy to all those affected by the Francis Scott Key Bridge incident of 26 March 2024. \"Since the outset, Grace Ocean and Synergy Marine have fully cooperated with the Board, making personnel, records and technical information available as requested. \"We note the Board's findings, including its observations regarding the vulnerability of the Key Bridge's main support pier, as well as the comments relating to aspects of the vessel's electrical arrangements. These matters will be reviewed in detail with our technical teams, the vessel owner and counsel.\" The NTSB also called on Hyundai Heavy - the company that built the Dali - to incorporate \"proper wire-label banding installation methods\". In response the company said that when it delivered the ship \"there was no indication that any wire was loose\". It added that if any wire were to come loose \"over the course of a decade, through vibrations or otherwise, the owner and operator should have detected that in a routine inspection and through normal maintenance\". Synergy Marine Group has been approached for a response to Hyundai Heavy's comments. The NTSB has not specified that the power outage caused the crash. A probable cause for the crash will be decided at a later date. The FBI is conducting a criminal probe into the collapse."
    },
    {
        "title": "'He must have got this from K': What mistaken tweet tells us about 'secret' plan to end Ukraine war",
        "description": "There are developments in the quest for peace in Ukraine.&#160;",
        "url": "https://news.sky.com/story/he-must-have-got-this-from-k-what-mistaken-tweet-tells-us-about-secret-plan-to-end-ukraine-war-13472965",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-ternopil-russia_7086367.jpg?20251119230414",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-11-19 22:35:00",
        "Headline": "Donald Trump's special envoy Steve Witkoff clearly thought he was sending a private message given his tweet was swiftly deleted. It's given us an insight into the role he and his equally unlikely Russian counterpart are playing in a plan to end the war.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  There are developments in the quest for peace in Ukraine.  It's been one of those days when different snippets of news have come together to create a picture of sorts. The jigsaw remains complicated, but the suggestion is neither the Ukrainians nor the Europeans have been privy to the developments. As it happened: Russia responds to spy ship claim The most intriguing development came at lunchtime on Thursday. \"He must have got this from K...\" wrote Donald Trump's special envoy Steve Witkoff on X. He clearly thought he was sending a private message. He was replying to a scoop of a story by Axios's Barak Ravid. The story revealed a \"secret\" plan to end the Ukraine war. The report suggested the Americans had been talking secretly to the Russians about a renewed effort to bring the war to an end, which involved Ukraine ceding land it still controls to Russia. Who is \"K\" in Witkoff's message? It's probably Kirill Dmitriev, who has become Putin's unofficial and unlikely envoy to Washington. Kyiv-born and Stanford-educated Dmitriev is, essentially, Witkoff's Russian opposite number. In a sense, they are the yin and yang of this geopolitical puzzle. Witkoff is a real estate mogul. Dmitriev is an economist. They are opposing forces with backgrounds that are, on the face of it, equally unsuited to geopolitical conflict resolution. Yet their two leaders are trusting them with this huge task. 'Territorial concessions' in 28-point plan So, back to the developments to have emerged over the last 24 hours. First, we know senior US Department of War officials, including Army Secretary Dan Driscoll, have arrived in the Ukrainian capital to meet their counterparts there. Their visit was scheduled but the focus shifted. The plan to discuss drone technology and the winter offensive morphed into a discussion about a Russian-presented peace plan Witkoff and Dmitriev had been discussing. This is the second development. The Axios report - which Witkoff seems inadvertently to have suggested came from Dmitriev - claims the two envoys met recently in Florida (Witkoff's base) to discuss a 28-point plan for peace. A defence official told our partners at NBC News that Driscoll has been briefed on the 28-point plan. Driscoll and his military staff are thought to have been presenting an initial brief to the Ukrainian side of this Russian-sponsored plan. Ukrainian sources have suggested to me in clear terms they are not happy with this Witkoff-Dmitriev plan. Sources tell me it includes \"territorial concessions\" and \"reductions in military strength\". The Ukrainian position is the plan represents the latest attempt to \"play the American government\".  What's happening with security guarantees? Ukraine wants security guarantees from the US. Trump signalled during Zelenskyy's last visit to Washington that he was willing to provide those. This was framed by the Europeans as a huge positive development, even though the White House did not spell out the crucial detail - what would these guarantees actually entail? The latest reporting, from Axios, suggests the security guarantees (still undefined, publicly at least) are dependent on Ukraine giving up the whole of the Donbas region - this would include about 15% of territory Russia does not currently hold. Crucially, the areas of the Donbas from which Ukraine would withdraw (the 15%) would be considered a demilitarised zone. The plan is very similar to one floated by Vice President JD Vance in the months before Trump won last year's election, which was roundly rejected as a non-starter at the time. Watch more from Mark Stone:What have we learned from the Epstein files?The prince and president: What happened? Is Gaza plan the model? Another source, from a third country close to the negotiations, has told me the Qataris are playing a role in the talks and were present at the weekend when Steve Witkoff met Ukraine's national security advisor Rustem Umerov last weekend. Qatari and Turkish mediation, along with the multipoint peace plan for Gaza, is being projected as a model transferable to Ukraine despite the conflict, challenges, and root causes being wholly different. Other European sources told me this morning they were not aware of this Russian-American plan. It's worth remembering it's in the interests of the Russians to be seen to be engaged in peace proposals in order to avoid secondary sanctions from the US. Zelenskyy has been in Turkey over the past 24 hours, where he singled out Trump's efforts to find peace. \"Since the beginning of this year, we in Ukraine have supported every decisive step and the leadership of @POTUS, every strong and fair proposal aimed at ending this war.\" Zelenskyy wrote. \"And only President Trump and the United States have sufficient power to make this war come to an end.\" This is the vital language of flattery."
    },
    {
        "title": "Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk",
        "description": "They've said they are offering him an opportunity to tell them everything, once and for all.",
        "url": "https://news.sky.com/story/deadline-day-for-andrew-to-respond-to-epstein-inquiry-but-its-hard-to-imagine-why-hed-talk-13472817",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "US",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-19 14:08:00",
        "Headline": "Andrew Mountbatten-Windsor was summoned by the US Congress to answer questions about his relationship with Jeffrey Epstein - and the deadline to respond is today. But based on how that Newsnight interview went, he may decide not to.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  They've said they are offering him an opportunity to tell them everything, once and for all. But as we hit the two-week deadline set by the US Congress committee investigating Jeffrey Epstein for a reply from Andrew Mountbatten-Windsor, will he agree to their request to open up about the paedophile financier? The letter sent by the House Committee on Oversight and Government Reform said members wanted to talk to him because of the widely reported allegations that have been made against him, which he denies, and because of his relationship with Epstein and what he may have seen. The committee is looking into Epstein's crimes and his wider sex trafficking network. Andrew was given until today, 20 November, to respond. Legally he isn't obliged to talk to them, and to be honest it's hard to imagine why he would. The only time he has spoken at length about the allegations against him and his relationship with Epstein was that Newsnight interview in 2019, and we all know how much of a disaster that was.  Yes, this could be an opportunity for him to publicly apologise for keeping up his links with Epstein, which he has never done before, or show some sympathy towards Epstein's victims, even as he vehemently denies the allegations against him. But while there is the moral argument that he should tell the committee everything he knows, it could also raise more uncomfortable questions for him, and that could feel like too much of a risk for Andrew and the wider Royal Family. However, even saying no won't draw all this to a close. There are other outstanding loose ends. The Metropolitan Police still have to tell us if they intend to take any further action after they said they were looking into claims Andrew had asked one of his officers to dig up dirt on his accuser, Virginia Giuffre. Read more:King formally strips Andrew of prince titleBill to release Epstein files gets all-clear from Congress  There could also still be a debate in parliament about the Andrew problem. The Liberal Democrats have said they want to use their opposition debating time to bring the issue to the floor of the House of Commons, while other MPs on the Public Accounts Committee have signalled their intention to look into Andrew's finances and housing arrangements. And then there are the wider Epstein files over in America, and what information they may hold. From developments this week, it seems we are edging ever closer to seeing those released. All of this may mean Andrew in other ways is forced to say more than he wants to, even without opening up to the Congress committee."
    },
    {
        "title": "Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art",
        "description": "A painting that helped save the life of its Jewish subject during the Holocaust has become the most expensive piece of modern art and the second most expensive painting ever sold at auction.",
        "url": "https://news.sky.com/story/gustav-klimts-portrait-of-elisabeth-lederer-sells-for-163180m-at-auction-a-record-for-modern-art-13472668",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gustav-klimt-elisabeth-lederer_7085615.jpg?20251119073215",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-19 08:38:00",
        "Headline": "Its sale price beat the previous record, set by an Andy Warhol portrait of Marilyn Monroe, which went for $195m in 2022 and puts it second in the all-time list, behind Leonardo da Vinci's Salvator Mundi.",
        "Content": "A painting that helped save the life of its Jewish subject during the Holocaust has become the most expensive piece of modern art and the second most expensive painting ever sold at auction. The Portrait of Elisabeth Lederer, by Austrian artist Gustav Klimt, was bought for $236.4m (£180m) by an unnamed buyer after a 20-minute bidding war at Sotheby's in New York on Tuesday. Its sale price beat the previous record for 20th-century art set by Andy Warhol's Shot Sage Blue Marilyn, a portrait of Marilyn Monroe bought for $195m (£148m) in 2022. The most expensive painting ever sold at auction was Leonardo da Vinci's Salvator Mundi, which fetched $450m (£342m) in 2017, Christie's said on its website. Sotheby's said on X the price for the Klimt was \"astonishing\", making the piece \"the most valuable work of modern art ever sold at auction\". The portrait, which Klimt worked on between 1914 and 1916, depicts the daughter of one of Vienna's wealthiest families wearing an East Asian emperor's cloak. Evaded fire and Nazi looters \n                  Austria gunman had 'significant passion' for school shootings, police say\n                 \n                  King and Queen 'shocked and saddened' by school shooting in Austria\n                 \n                  What we know so far about school shooting in Austria\n                 Measuring 1.8m (6ft), the colourful piece, which was completed in 1916, illustrates the Lederer family's life of luxury before Nazi Germany annexed Austria in 1938. It was kept separate from other Klimt paintings that burned in a fire at an Austrian castle. It also escaped being looted by the Nazis, who plundered the Lederer art collection. They left only the family portraits, which they held to be \"too Jewish\" to be worth stealing, according to the National Gallery of Canada, where the painting was previously on loan. Father lie saved her life To save her own life, Elisabeth Lederer made up a story that Klimt, who was not Jewish and died in 1918, was her father. It helped that the artist spent years working meticulously on her portrait. She convinced the Nazis to give her a document stating that she descended from Klimt, which allowed her to live safely in Vienna until her death from illness in 1944. The painting, which is one of two full-length portraits by the Austrian artist that remain privately owned, was part of the collection of billionaire Leonard A Lauder, heir to the Estée Lauder cosmetics empire, who died this year. Read more on Sky News:Dancing sisters in 'joint suicide'Resale ticket prices to be cappedNew suspect in 'one punch' killing Five Klimt pieces from Lauder's collection sold at the auction for a total of $392m (£298m), which also included pieces by Vincent van Gogh, Henri Matisse and Edvard Munch, Sotheby's said. An 18-carat-gold toilet by Maurizio Cattelan - the provocative Italian artist known for taping a banana to a wall - sold for a reported $12.1m (£9.2m). The fully-functioning toilet, one of two he created in 2016 satirising superwealth, was stolen while on display at Blenheim Palace, the country manor where Winston Churchill was born, in 2019. Two men were convicted of the theft, but it's unclear what they did with the loo. Investigators believe it was likely broken up and melted down."
    },
    {
        "title": "Man arrested in Florida over alleged murder and kidnap of British woman",
        "description": "A man has been arrested over the alleged murder of a missing British woman in Florida, investigators in the US have said.",
        "url": "https://news.sky.com/story/man-arrested-in-florida-over-alleged-murder-and-kidnap-of-british-woman-13472778",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-florida-us-dwain-hall_7085914.jpg?20251119125832",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-19 12:34:00",
        "Headline": "Dwain Hall, 53, of Ocala, was arrested on charges of first-degree murder and kidnapping on Monday.",
        "Content": "A man has been arrested over the alleged murder of a missing British woman in Florida, investigators in the US have said. The unnamed woman's body was found in the town of Marion Oaks in central Florida last month. Analysis of the remains confirmed her identity and that she had been murdered. Dwain Hall, 53, of nearby Ocala, was arrested on charges of first-degree murder and kidnapping on Monday, the Florida Department of Law Enforcement (FDLE) said in a statement. The woman, who had been due to return home on 13 October, missed her scheduled flight, FDLE said. Its officers had been asked to check on her by authorities in the UK, who approached them through the international investigative agency, Interpol. Hall was held by FDLE agents and Marion County Sheriff's Office detectives. \n                  Four killed and 11 injured after car fleeing police smashes into Florida bar\n                 \n                  One year on from Donald Trump's election win, an untold story has emerged\n                 \n                  Orlando airport close to cancelling all landings due to US government shutdown\n                 FDLE commissioner Mark Glass said its agents \"worked with extraordinary speed and unwavering determination to ensure justice was served and closure was brought to the victim's family. Read more on Sky News:Only Trump can veto Epstein filesNew suspect in 'punch' killing \"This type of violent crime and disregard for human life will not be tolerated in our state - those who commit such heinous crimes will be held fully accountable.\" Multiple agencies have helped in the investigation, including the FBI and the Hampshire & Isle of Wight Constabulary, FDLE said."
    },
    {
        "title": "Ship that hit Baltimore road bridge lost power before fatal collision due to a single loose wire",
        "description": "A single loose wire on the container ship that crashed into and partially destroyed a US road bridge, led to the vessel losing of power just before the fatal collision, investigators have concluded.",
        "url": "https://news.sky.com/story/ship-that-hit-baltimore-road-bridge-lost-power-before-fatal-collision-due-to-a-single-loose-wire-13472739",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-baltimore-bridge-collapse_6502610.jpg?20240327175856",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-19 10:56:00",
        "Headline": "Police had around 90 seconds to clear vehicles from the Francis Scott Key Bridge as it was not equipped with warning systems to halt traffic that are now recommended. They were unable to prevent the deaths of six construction workers",
        "Content": " A single loose wire on the container ship that crashed into and partially destroyed a US road bridge, led to the vessel losing of power just before the fatal collision, investigators have concluded. The US National Transportation Safety Board (NTSB) has found that the unconnected electric cable meant the Dali experienced a loss of propulsion and steering less than a mile from Francis Scott Key Bridge in Baltimore. The collision on 26 March 2024 that followed collapsed a span of the bridge and killed six construction workers who were unable to escape in time. It led to the blockage of the mouth of one of America's busiest ports for almost three months. Investigators found that an improperly placed label on the wire prevented it from being fully inserted, causing an inadequate connection. The NTSB's chair said locating the loose wire was like trying to find a single loose rivet on the Eiffel Tower. The board has praised the ship's crew. \"The crew's actions were as timely as they could be, and they were appropriate and also impressive considering the circumstance,\" board member Michael Graham said. \n                  Baltimore bridge collapse: Owner of cargo ship agrees to pay $102m to US government\n                 \n                  Dali: Ship in deadly Baltimore bridge collapse leaves three months after disaster\n                 \n                  Baltimore bridge collapse: Channel fully cleared after cargo ship collided with bridge support\n                 But he called on the maritime shipping industry to strengthen its safety systems and better manage risks to bring it into line with the rigorous approach taken in aviation. \"Many of these issues we have discussed today as part of this accident could have been identified, addressed, and either mitigated or eliminated,\" Mr Graham said. The far reaching consequences of the accident are continuing. State officials have more than doubled the projected cost of the bridge rebuild from an upper estimate of $1.9bn (£1.4bn) to $5.2bn (£3.9bn) - with the reopening date pushed back to late 2030. How to prevent future tragedies  In March, the board called for urgent safety assessments of 68 bridges in 19 US states including famous crossings like the Golden Gate Bridge in San Francisco and New York's Brooklyn Bridge. The organisation found that countermeasures to reduce the vulnerability of the bridge from ships could have been implemented if a vulnerability assessment had been conducted by the Maryland Transportation Authority The board has now issued numerous recommendations to try to prevent future catastrophic collisions. Major bridges should consider adopting motorist warning systems that can immediately stop motorists from entering bridges in an emergency. The Baltimore bridge, like many others, was not equipped with a warning system to prevent vehicles entering. But police managed to clear and halt traffic on the bridge before the collapse, despite only having about 90 seconds to do so. Read more:Owner of cargo ship agrees to pay $102mFBI opens criminal probe into Baltimore bridge collapse If traffic had not been stopped, it is likely that the death toll would have been much higher. Police officers were discussing how to best evacuate the six workers who were on the bridge moments before the entire structure collapsed. Other recommendations include the periodic inspections of high-voltage switchboards and proposed changes that would allow ships to recover faster from a loss of power. In a joint statement, Grace Ocean (the Dali's manager) and Synergy Marine Group (the Dali's operator) thanked the NTSB for its investigation and stressed that they had fully cooperated with the board. It said: \"Grace Ocean and Synergy Marine Group continue to extend their deepest sympathy to all those affected by the Francis Scott Key Bridge incident of 26 March 2024. \"Since the outset, Grace Ocean and Synergy Marine have fully cooperated with the Board, making personnel, records and technical information available as requested. \"We note the Board's findings, including its observations regarding the vulnerability of the Key Bridge's main support pier, as well as the comments relating to aspects of the vessel's electrical arrangements. These matters will be reviewed in detail with our technical teams, the vessel owner and counsel.\" The NTSB also called on Hyundai Heavy - the company that built the Dali - to incorporate \"proper wire-label banding installation methods\". In response the company said that when it delivered the ship \"there was no indication that any wire was loose\". It added that if any wire were to come loose \"over the course of a decade, through vibrations or otherwise, the owner and operator should have detected that in a routine inspection and through normal maintenance\". Synergy Marine Group has been approached for a response to Hyundai Heavy's comments. The NTSB has not specified that the power outage caused the crash. A probable cause for the crash will be decided at a later date. The FBI is conducting a criminal probe into the collapse."
    },
    {
        "title": "Harry Dunn's mother Charlotte Charles honoured for road safety campaigning",
        "description": "The mother of a teenage motorcyclist killed by a US citizen in 2019 has been honoured for her campaigning efforts on road safety following her son's death.",
        "url": "https://news.sky.com/story/harry-dunns-mother-charlotte-charles-honoured-for-road-safety-campaigning-13472807",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-charlotte-charles-harry-dunn_7085974.jpg?20251119133529",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-19 15:09:00",
        "Headline": "Charlotte Charles' son Harry Dunn, 19, died in 2019 when a car driven by a former US State Department employee hit him while on the wrong side of the road outside RAF Croughton.",
        "Content": "The mother of a teenage motorcyclist killed by a US citizen in 2019 has been honoured for her campaigning efforts on road safety following her son's death. Charlotte Charles, the mother of 19-year-old Harry Dunn, has been made a Member of the Order of the British Empire by the Prince of Wales at Windsor Castle. Harry was killed when a Volvo driven by then-US State Department employee Anne Sacoolas hit him while on the wrong side of the road outside Royal Air Force Croughton in Northamptonshire. Sacoolas left the UK 19 days after the incident, as the US government had asserted diplomatic immunity on her behalf, claiming she was the wife of a diplomat. She eventually pleaded guilty to causing death by careless driving via video link in October 2022 and later received an eight-month prison sentence, suspended for 12 months. Ms Charles, alongside Harry's father Tim Dunn, has been campaigning for justice for several years. She was named in the King's Birthday Honours list and has met with US President Donald Trump at the White House. \n                  Russia accuses British government of being 'provocative' after spy ship nears UK\n                 \n                  Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk\n                 \n                  Robert Best death: Women in court after man's body found in Inverclyde field\n                  \"To be honoured and recognised feels a little bit surreal because I was just doing what I desperately needed to do at the time - which was to try and secure safety and a better understanding of everything that we had been going through,\" she said after she was named in the King's honours list. Read more from Sky News:Russian spy ship currently on edge of UK watersMan charged with further offences following train stabbing Those honoured at Wednesday's ceremony also included Sir Matthew Vaughn, the filmmaker known for Layer Cake, Kick-Ass, X-Men: First Class, and the Kingsman series. He received a knighthood for his contributions to the creative industries as part of former prime minister Rishi Sunak's resignation honours list. Engineer Dr Peter Musgrove was also recognised and appointed Commander of the Order of the British Empire, an honour awarded for prominent contributions to the arts, sciences, public service, and other fields."
    },
    {
        "title": "Former Olympic snowboarder wanted by US charged with masterminding murder of witness",
        "description": "A Canadian former Olympic snowboarder who is wanted in the US for running a multi-national drug trafficking network is also facing charges in connection with the killing of a federal witness, the US Attorney General, Pam Bondi, has announced.",
        "url": "https://news.sky.com/story/former-olympic-snowboarder-wanted-by-us-charged-with-masterminding-murder-of-witness-13472956",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ryan-wedding-wanted_7086358.jpg?20251119224848",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-19 23:40:00",
        "Headline": "Ryan Wedding is accused of orchestrating the killing of the witness in Colombia to help him avoid extradition to the US in January.",
        "Content": "A Canadian former Olympic snowboarder who is wanted in the US for running a multi-national drug trafficking network is also facing charges in connection with the killing of a federal witness, the US Attorney General, Pam Bondi, has announced. Ryan Wedding is accused of orchestrating the killing of the witness in Colombia to help him avoid extradition to the US in January. Ten other defendants have been arrested on the charges in the federal indictment, which was unsealed in California. US authorities are now offering up to $15m for information leading to the arrest of Wedding, who is on the FBI's 10 Most Wanted list. He is believed to be living in Mexico under the protection of the Sinaloa cartel. Authorities say he is working closely with the cartel to funnel massive quantities of drugs into the US and Canada. \"Whether you are a street-level drug dealer ... or an international drug kingpin, we are coming for you,\" Ms Bondi said. \"We will find you and you will be accountable and held to justice for your crimes.\" Wedding, whose aliases include El Jefe, Public Enemy and James Conrad King, was charged in 2024 with running a drug ring that moves some 60 tons of cocaine a year using long-haul lorries to bring the drugs between Colombia, Mexico, Southern California and Canada. Authorities say he and his co-conspirators used a Canadian website called The Dirty News to post a photograph of the witness so he could be identified and killed. The witness was then followed to a restaurant in Medellin and shot in the head in January. Read more from Sky News:On the ground in Gaza - a landscape of complete devastationRussia accuses government of being 'provocative' after spy ship nears UK \"Wedding placed the bounty on the victim's head, and the erroneous belief that the victim's death would result in the dismissal of criminal charges against him and his international drug trafficking ring, and would further ensure that he was not extradited to the United States,\" said Bill Essayli, the top federal prosecutor for the Central District of California. \"He was wrong.\" The US government is also offering rewards of up to $2m for others involved in the killing."
    },
    {
        "title": "Nvidia beats expectations again in defiance of AI bubble fears",
        "description": "The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now. ",
        "url": "https://news.sky.com/story/nvidia-beats-expectations-again-in-defiance-of-ai-bubble-fears-13472848",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jensen-huang-nvidia_7072665.jpg?20251105113409",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-19 21:36:00",
        "Headline": "The company not only posted another set of record-breaking figures but said it expects those records will be broken again in three months.  ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now.  Nvidia's revenue reached $57bn in the three months to October, higher than Wall Street estimates and the company's own guidance. That's up 62% on the same time last year, and has been described by the business as an \"outstanding\" quarter. Money blog: Ryanair flights to EU banned in 'unprecedented' decision A profit measure called earnings per share was also better than expected at $1.30.  It matters as Nvidia has powered the artificial intelligence (AI) boom through its computer chips, which are key parts in AI chatbots such as ChatGPT. \n                  AI bubble fears take hold of stock markets and bitcoin\n                 \n                  'Agentic AI' is current industry buzzword - but what does it mean and should we be cautious?\n                 \n                  A third of daily music uploads are AI-generated and 97% of people can't tell the difference, says report\n                 Nvidia has major tech companies as clients and acts as a good proxy for whether the tens of billions of dollars invested in AI is paying off.  Its chief executive, Jensen Huang, has been described as the Godfather of AI and watch parties were organised for those looking to follow the Wednesday evening announcement. The company has been a massive beneficiary of the push to put money into AI, with its share price reaching stratospheric highs. In October, it became the first worth $5trn (£3.83trn), about the size of the German economy, Europe's largest, and double the UK's benchmark stock index, the FTSE 100.  What's been announced? Revenue from data centres reached a record high of $51.2bn, more than £10bn higher than the three months previous. The outlook is for continuing strong sales in the final three months of the financial year, as the company forecasts revenue will be roughly $65bn.  Read more:Nvidia boss defends against claims of bubble by 'Big Short' investorInflation slows to 3.6%, but food costs shoot upwards  Demand for Nvidia products continues to surpass expectations, while the business is \"still in the early innings\" of AI transitions, its chief financial officer Colette Kress said. Mr Huang said sales of its blackwell chips are \"off the charts\" and its cloud graphics processing chips (GPUs) are \"sold out\".  Why it matters Developing AI infrastructure, like the construction of data centres, has been a significant contributor to US economic growth, as measured by gross domestic product (GDP). A faltering of AI expansion, therefore, impacts the US economy, the world's largest, which in turn affects the UK and global economies. Anxiety around the massive valuations tech companies have accrued, on the hope of AI revolutionising the world, is likely to be staved off by the results announcement. A fall in these tech company valuations could have meant a drop in the value of pension pots or savings. Just seven dominant tech companies, many of which have borrowed to invest in AI, make up more than a quarter of major US stock index, the S&P 500.  In the last year alone, Nvidia's share price has risen more than 230%. Some, including US trader Michael Burry, famous for being played by Christian Bale in the Hollywood film The Big Short, have effectively bet that Nvidia's share price would fall. Addressing the topic of an AI bubble, Nvidia's founder, Mr Huang, said, \"From our vantage point, we see something very different\".  What next? Regardless of the figures released on Wednesday evening, significant market moves were anticipated, given the attention paid to the results and the significance of the company. Nvidia shares rose as much as 4% in after-hours trading. The results also boosted the share price of its chip-making competitors like Broadcom and Advanced Micro Devices.  For now, the AI bubble remains intact."
    },
    {
        "title": "Nvidia beats expectations again in defiance of AI bubble fears",
        "description": "The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now. ",
        "url": "https://news.sky.com/story/nvidia-beats-expectations-again-in-defiance-of-ai-bubble-fears-13472848",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jensen-huang-nvidia_7072665.jpg?20251105113409",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-19 21:36:00",
        "Headline": "The company not only posted another set of record-breaking figures but said it expects those records will be broken again in three months.  ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now.  Nvidia's revenue reached $57bn in the three months to October, higher than Wall Street estimates and the company's own guidance. That's up 62% on the same time last year, and has been described by the business as an \"outstanding\" quarter. Money blog: Ryanair flights to EU banned in 'unprecedented' decision A profit measure called earnings per share was also better than expected at $1.30.  It matters as Nvidia has powered the artificial intelligence (AI) boom through its computer chips, which are key parts in AI chatbots such as ChatGPT. \n                  AI bubble fears take hold of stock markets and bitcoin\n                 \n                  'Agentic AI' is current industry buzzword - but what does it mean and should we be cautious?\n                 \n                  A third of daily music uploads are AI-generated and 97% of people can't tell the difference, says report\n                 Nvidia has major tech companies as clients and acts as a good proxy for whether the tens of billions of dollars invested in AI is paying off.  Its chief executive, Jensen Huang, has been described as the Godfather of AI and watch parties were organised for those looking to follow the Wednesday evening announcement. The company has been a massive beneficiary of the push to put money into AI, with its share price reaching stratospheric highs. In October, it became the first worth $5trn (£3.83trn), about the size of the German economy, Europe's largest, and double the UK's benchmark stock index, the FTSE 100.  What's been announced? Revenue from data centres reached a record high of $51.2bn, more than £10bn higher than the three months previous. The outlook is for continuing strong sales in the final three months of the financial year, as the company forecasts revenue will be roughly $65bn.  Read more:Nvidia boss defends against claims of bubble by 'Big Short' investorInflation slows to 3.6%, but food costs shoot upwards  Demand for Nvidia products continues to surpass expectations, while the business is \"still in the early innings\" of AI transitions, its chief financial officer Colette Kress said. Mr Huang said sales of its blackwell chips are \"off the charts\" and its cloud graphics processing chips (GPUs) are \"sold out\".  Why it matters Developing AI infrastructure, like the construction of data centres, has been a significant contributor to US economic growth, as measured by gross domestic product (GDP). A faltering of AI expansion, therefore, impacts the US economy, the world's largest, which in turn affects the UK and global economies. Anxiety around the massive valuations tech companies have accrued, on the hope of AI revolutionising the world, is likely to be staved off by the results announcement. A fall in these tech company valuations could have meant a drop in the value of pension pots or savings. Just seven dominant tech companies, many of which have borrowed to invest in AI, make up more than a quarter of major US stock index, the S&P 500.  In the last year alone, Nvidia's share price has risen more than 230%. Some, including US trader Michael Burry, famous for being played by Christian Bale in the Hollywood film The Big Short, have effectively bet that Nvidia's share price would fall. Addressing the topic of an AI bubble, Nvidia's founder, Mr Huang, said, \"From our vantage point, we see something very different\".  What next? Regardless of the figures released on Wednesday evening, significant market moves were anticipated, given the attention paid to the results and the significance of the company. Nvidia shares rose as much as 4% in after-hours trading. The results also boosted the share price of its chip-making competitors like Broadcom and Advanced Micro Devices.  For now, the AI bubble remains intact."
    },
    {
        "title": "Inflation slows to 3.6%, but food costs shoot upwards",
        "description": "The rate of inflation has eased to 3.6%, according to official figures that make for better reading for the economy and chancellor ahead of the budget.",
        "url": "https://news.sky.com/story/inflation-slows-to-36-official-figures-show-13472597",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-energy-money-gfx_7008555.jpg?20250901182947",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-11-19 05:46:00",
        "Headline": "Stubbornly high inflation figures have given rise to caution at the Bank of England as it mulls the pace of interest rate cuts. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  The rate of inflation has eased to 3.6%, according to official figures that make for better reading for the economy and chancellor ahead of the budget. The Office for National Statistics (ONS) said the slowdown in the consumer prices index (CPI) measure, from the annual 3.8% rate recorded the previous month, was largely down to weaker housing effects, especially from energy bills. ONS chief economist Grant Fitzner said: \"Inflation eased in October, driven mainly by gas and electricity prices, which increased less than this time last year following changes in the Ofgem energy price cap. Money latest: Delivery not arrived? Here's what you can do \"The costs of hotels was also a downward driver, with prices falling this month. These were only partially offset by rising food prices, following the dip seen in September.  \"The annual cost of raw materials for businesses continued to increase, while factory gate prices also rose.\" The final part of that statement will be seen as a risk to expectations from economists that the peak pace for price increases is now behind the UK economy after a spike this year that has caused concern among interest rate-setters at the Bank of England. \n                  ExxonMobil to close Mossmorran plastics plant in Fife with hundreds of jobs at risk\n                 \n                  Octopus COPs £500m financing boost for electric vehicles arm\n                 \n                  Badenoch calls for government to 'get Britain drilling again' as Starmer flies to COP30\n                 October's data marked the first decline for the inflation rate since March. It has been widely believed that the figure will ease gradually in the months ahead, helping to cushion household spending power from a slowdown in wage growth. But key risks include shocks within the global economy and the impact of potential measures in the budget next week.  The chancellor's first budget was blamed by business groups and economists for helping push up costs since April. Then, firms passed on hikes to employer national insurance contributions and minimum pay levels imposed by Rachel Reeves.  That has been reflected in many supermarket prices, for example, as they are among the biggest employers in the country. The ONS data showed that food inflation rose from 4.5% to 4.9%. Other factors have contributed too such as high global demand for chicken and shrinking UK cattle herds pushing up beef costs. Poor cocoa and coffee harvests have resulted in prices spiking too this year, with chocolate standing at record levels this summer.  While food has been a main contributor to inflation, so too has energy, though bills have stabilised this year thanks largely to healthy global supplies of natural gas. Petrol and diesel costs could become more of a problem for inflation, however. The AA has blamed global factors for UK fuel prices nearing their highest level for seven months. The motoring group said that but for the 5p cut in fuel duty under the last Conservative government, pump prices would have returned to pre-COVID levels. There have been rumours that Ms Reeves could remove that reduction next Wednesday.  She said of the ONS figures: \"This fall in inflation is good news for households and businesses across the country, but I’m determined to do more to bring prices down. \"That’s why at the budget next week I will take the fair choices to deliver on the public’s priorities to cut NHS waiting lists, cut national debt and cut the cost of living.\" When asked if she recognised a contribution to rising inflation from her first budget, she responded: \"Food prices fell last month and they have risen this month. \"But I do recognise that there's more that we need to do to tackle the cost of living challenges. And that's why one of the three priorities in my budget next week is to tackle the cost of living, as well as to cut NHS waiting lists and cut government debt.\" The Bank of England's most recent forecasts see its 2% inflation target not being met until the early part of 2027. Stubborn inflation in the UK has threatened the pace of interest rate cuts but policymakers are expected, by financial markets at least, to agree a further quarter point reduction next month on the back of weakness in economic growth and the labour market. Official figures last week showed the UK's unemployment rate rising to 5% from 4.8% and the pace of wage growth continuing its gradual decline. Economic output during the third quarter of the year also slowed further to stand at just 0.1%. Read more:What taxes could go up now?Is Starmer 'in office but not in power'?Budget income tax U-turn. What happened? The Bank's rate-setting committee voted 5-4 earlier this month to maintain Bank rate at 4%. That decision allowed for more data to come in - such as the employment and growth numbers - and, crucially, for the budget to have taken place, ahead of its next meeting."
    },
    {
        "title": "Inflation may have eased but we're stuck in a world of higher prices",
        "description": "Inflation has fallen, but households are still feeling squeezed.",
        "url": "https://news.sky.com/story/inflation-may-have-eased-but-were-stuck-in-a-world-of-higher-prices-13472672",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-economy-bank_6965901.png?20251106133243",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-19 08:54:00",
        "Headline": "Sky's Gurpreet Narwan says the latest official data presents huge challenges for the Bank of England in that food price spikes could reverse the progress it wants on calming wage growth.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  Inflation has fallen, but households are still feeling squeezed. They are living with the impact of price rises that have hit their budgets - not just this month or even this year, but over the course of several years. Britain's emergence out of lockdown and the war in Ukraine triggered an inflationary crisis that saw the headline inflation rate peak at 11.1% in 2022, with food prices rising by a peak of 19.2% in October of the same year. Money latest: A mixed picture for inflation Since then, inflation - the pace of price rises - has broadly come down but that doesn't mean prices have come down, they've just been rising less quickly. It means that today's announcement that the headline rate of inflation fell from 3.8% to 3.6% might not feel like it's shifted the dial massively on the cost of living. Prices are, after all, still rising. And when it comes to food, prices are rising faster than wages. \n                  Sir Keir Starmer refuses to rule out extending freeze on income tax thresholds\n                 \n                  Cunning plan or a gamble that didn't pay off? Why some think the chancellor pulled off something extraordinary\n                 \n                  Budget 2025: Ex-Bank of England rate setter Andy Haldane criticises 'repeated mistakes'\n                 Food price inflation hit 4.9% in October. While overall inflation fell, food price inflation actually accelerated, and it's been rising consistently (bar a dip in September) since April. That was the same month increases to employer's national insurance contributions came into force. Supermarkets have been passing these costs on to customers.  Stubborn and rising food price inflation will worry policymakers at the Bank of England as they weigh up whether to cut interest rates next month. Of all the types of inflation, households are particularly sensitive to rising food prices. When households are sensitive to inflation and nervous about it rising, they are more likely to push for wage increases that could fuel inflation even higher. And food prices have risen considerably over the past few years. The price level for food now is 4.9% higher than it was last year but, crucially, 36.8% higher than it was four years ago. Even if the pace of price rises now slows as the Bank of England expects - people have not forgotten this. They are living in a new world of higher prices, which makes any claim that living standards are improving a difficult one to sell."
    },
    {
        "title": "WH Smith boss quits after accounting blunder",
        "description": "The boss of WH Smith has resigned with immediate effect after an accounting failure prompted the retailer to slash its profit forecasts.",
        "url": "https://news.sky.com/story/wh-smith-boss-quits-after-accounting-blunder-13472677",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wh-smith-store-heathrow_7085742.jpg?20251119093840",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-19 09:12:00",
        "Headline": "A review finds WH Smith's North America division had been recognising supplier income incorrectly, knocking £30m from its profit forecasts.",
        "Content": "The boss of WH Smith has resigned with immediate effect after an accounting failure prompted the retailer to slash its profit forecasts. WH Smith said that Carl Cowling, its chief executive of six years who had presided over the sale of the company's UK high street business earlier this year, offered to go after an independent review into an overstatement of earnings was revealed in August. Experts from Deloitte found WH Smith's North America division - its key area for growth - had been recognising supplier income incorrectly. Money latest: A mixed picture for inflation It identified weaknesses in the composition of the North America finance team, WH Smith said, along with insufficient systems, controls and review procedures. The company said that, as a result, it now expected group headline trading profit for its financial year of between £100m-£110m, down nearly 55% on the previous 12 months. Profit in North America was forecast to fall to between £5m-£15m - down sharply on the £55m forecast before the accounting errors were first flagged. \n                  Nvidia beats expectations again in defiance of AI bubble fears\n                 \n                  Inflation slows to 3.6%, but food costs shoot upwards\n                 \n                  Two regular Ryanair flights to EU banned in 'unprecedented' decision | Money blog\n                 The company apologised for the shortcomings, which had resulted in a drop in its share price of almost 50% since August. The board, WH Smith said, was focused on rebuilding trust and profitability. Andrew Harrison, head of WH Smith's UK division, will act as interim CEO. Shares rose by more than 4% during morning trade as investors digested the company's update. Mr Cowling said of his departure: \"Whilst the issues identified in the Deloitte review arose in our North American division, I recognise the seriousness of this situation and as Group CEO feel it is only right that I step down from my position. \"It has been a privilege to lead WH Smith for the past six years as CEO. \"During this time, we have guided the Company through the unprecedented challenges of the pandemic, pioneered our highly successful one-stop-shop for travel essentials, and completed the divestment of our High Street and online businesses. \"I would like to thank the entire team for their support, and I wish them well.\" Commenting on the turmoil at the company Dan Coatsworth, head of markets at AJ Bell, said: \"No chief executive is going to survive an episode as catastrophic as the one that wiped £594m off the value of WH Smith. \"Carl Cowling was clinging on to his job the second WH Smith announced an accounting setback in the summer, and now he's done the decent thing and stepped down. \"Even if Cowling hadn't resigned, his credibility at WH Smith was shattered by the scale of value destruction straight after selling the UK high street business. \"That strategic shift was meant to be a defining moment for the company, but it has gone down in history for the wrong reasons.\""
    },
    {
        "title": "Reeves dealt blow as Interactive Investor abandons retail campaign",
        "description": "Britain's second-biggest retail investment platform has dealt a fresh blow to Rachel Reeves's hopes of stimulating a stock market splurge by pulling out of a government-backed marketing campaign.",
        "url": "https://news.sky.com/story/reeves-dealt-blow-as-interactive-investor-abandons-retail-campaign-13472698",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-interactive-investor_7084811.png?20251118100351",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-19 09:51:00",
        "Headline": "The UK’s second-biggest retail investment platform has joined rivals including AJ Bell and Freetrade in withdrawing from a key plank of the chancellor’s Leeds Reforms, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's second-biggest retail investment platform has dealt a fresh blow to Rachel Reeves's hopes of stimulating a stock market splurge by pulling out of a government-backed marketing campaign. Sky News has learnt that Interactive Investor (II), which is owned by London-listed asset manager Aberdeen, has become the latest prominent name to pull out of the initiative. The industry-led campaign \"to explain the benefits of investing\", which is being coordinated by the Investment Association, was hailed by the chancellor in July as a key plank of her so-called Leeds Reforms to \"rewire the financial system\". Money latest: A mixed picture for inflation Among the companies which agreed to help fund the marketing push were Barclays, Hargreaves Lansdown, London Stock Exchange Group, NatWest and Schroders. Since that announcement, however, some of the named backers, including AJ Bell, Freetrade and Trading212, have been reported to have withdrawn. The loss of II is a major blow to the campaign given its presence in the retail investment market, and is said to have been driven by the cost implications of participating. \n                  Nvidia beats expectations again in defiance of AI bubble fears\n                 \n                  Inflation slows to 3.6%, but food costs shoot upwards\n                 \n                  Two regular Ryanair flights to EU banned in 'unprecedented' decision | Money blog\n                 The advertising agency M&C Saatchi has been picked to oversee the marketing drive, which will go live next year. It will come amid likely reforms to cash ISAs which will see the annual limit reduced from £20,000, with Ms Reeves expected to unveil further details in next week's Budget. Her ISA reforms have drawn strong opposition from building societies, which have warned that they will impact mortgage lending, and investment industry executives who have complained that they will add complexity to the system and deter savers. Aberdeen and II both declined to comment."
    },
    {
        "title": "Small business finance firm SAPI lands $80m funding boost",
        "description": "A small business financing platform co-founded by a Goldman Sachs alumnus will this week unveil an $80m (&#163;61m) funding boost as it seeks to expand its international presence.",
        "url": "https://news.sky.com/story/small-business-finance-firm-sapi-lands-80m-funding-boost-13472671",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-bills-biz-cost-of-living_6881705.png?20250410131148",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-19 08:50:00",
        "Headline": "Founded in London and Hanoi by former Goldman Sachs and AlixPartners executives, SAPI will announce this week that it has secured debt and equity funding in a round led by Hudson Cove, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A small business financing platform co-founded by a Goldman Sachs alumnus will this week unveil an $80m (£61m) funding boost as it seeks to expand its international presence. Sky News understands that SAPI has secured $75m in debt financing and $5m of equity in a round led by Hudson Cove, a US-based alternative credit asset manager. Co-founded by Mai Le, formerly of Goldman Sachs, and Alexis van Lennep, who used to work for AlixPartners, SAPI has advanced tens of millions of pounds to small businesses, the vast majority of which are either immigrant- or female-owned. Money latest: A mixed picture for inflation It aims to address the decline in smaller British businesses able to access external funding through so-called embedded finance, which the consultancy firm McKinsey predicts could exceed Euros 100bn by 2030. SAPI's new funding round has also been backed by existing investors Triple A Capital and Passion Capital. \"Having the right backer at the right time can fundamentally change someone's life and the trajectory of the business they've started,\" Ms Le said. \n                  Nvidia beats expectations again in defiance of AI bubble fears\n                 \n                  Inflation slows to 3.6%, but food costs shoot upwards\n                 \n                  Two regular Ryanair flights to EU banned in 'unprecedented' decision | Money blog\n                 \"This funding round lets us scale payment-linked financing that repays at source and reaches more business owners who are too often overlooked by traditional lenders.\" \"Too often, start-ups and small companies, frequently founded by women or immigrants, are denied credit at a crucial moment in their journey.\" In addition to its London office, SAPI has a presence in Hanoi, having recently established a financial technology entity in Vietnam to accelerate growth across Asia-Pacific markets. Founded in 2020, SAPI stands for Securities Application Programming Interface."
    },
    {
        "title": "Marks & Spencer defends £195 beef wellington",
        "description": "M&S has defended the price of a &#163;195 beef wellington made by chef Tom Kerridge.",
        "url": "https://news.sky.com/story/marks-spencer-defends-163195-beef-wellington-13472786",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-marks-and-spencer-beef-wellington_7085932.jpg?20251119125056",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-19 12:46:00",
        "Headline": "M&S insists it's been a hit with customers, but it has certainly caused a stir online - the supermarket is selling beef wellington for just shy of £200. That's quite a bit more than what you'd find at even Fortnum & Mason.",
        "Content": "M&S has defended the price of a £195 beef wellington made by chef Tom Kerridge. Some online are unhappy with the cost of the Collection Fillet of British Beef Wellington, which serves six people - yet despite the price, it's nearly sold out. \"It's not just overspending on Christmas, it's M&S overspending on Christmas\" is what one person said about it. Read all the latest Money news here Another said: \"I think it would be justifiable if it included Tom Kerridge to do the cooking and cleaning up.\" A third asked if the price had anything to do with the recent cyber attack M&S suffered in April: \"M&S trying to recoup some of that cyber attack loss by charging at least twice too much for a bit of fillet.\" Other wellingtons available Fortnum & Mason, known for its high-end offerings, sells a Classic Beef Wellington that serves six to eight people for £120. Charlie Bigham has launched a £30 ready meal beef wellington. And Gordon Ramsay, at two of his restaurants, offers a three-course Beef Wellington Experience costing £95 per person. Read more:WH Smith boss quits after accounting blunderBest and worst parcel delivery companies revealed 'Our best quality wellington ever' An M&S spokesperson told Sky News: \"The M&S Collection Tom Kerridge Beef Wellington has been a big hit with customers - it's selling very well and we only have a few left on our Christmas Food To Order page. \"Serving six people and weighing over 2kg, the hand-butchered British beef fillet is matured over 17 days and hand rolled in portobello mushroom duxelles with silky chicken breast mousse and black truffle as it would be in a restaurant - it's the absolute best quality wellington we've ever created.\" Sky News has contacted Tom Kerridge for comment."
    },
    {
        "title": "What is each supermarket's policy if your delivery is late?",
        "description": "If you regularly order your supermarket shopping online, chances are you'll have had a delivery turn up late at least once.",
        "url": "https://news.sky.com/story/what-is-each-supermarkets-policy-if-your-delivery-is-late-13472802",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-food-shop-money-istock_7085983.jpg?20251119134140",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-19 13:31:00",
        "Headline": "Ordered your food shopping, but it's turned up late? Here's what you can do about it... ",
        "Content": "If you regularly order your supermarket shopping online, chances are you'll have had a delivery turn up late at least once. The bad news is that if you didn't try to claim back any extra you paid for a specific delivery slot, you may have missed out. Get more tips and advice in the Money blog The good news is you now know for the future. Consumer group Which says: \"If you paid extra for special delivery and your order arrived later than agreed, you can claim back the extra delivery cost as the service wasn't delivered.\" We asked Scott Dixon, from The Complaints Resolver, to go into a bit more detail - and he flagged S49 of the Consumer Rights Act 2015, which states: \"Every contract to supply a service is to be treated as including a term that the trader must perform the service with reasonable care and skill.\" Scott says: \"Late delivery would be considered as a breach of contract under the Consumer Rights Act 2015, as you paid for a time-specific delivery as part of the contract you entered into. \n                  How to get started with a stocks and shares ISA - and six tips if you already have one\n                 \n                  Gazumping and the wardrobe rule - your complete guide to buying a house like a pro\n                 \n                  The best places to buy used tech - but go armed with these dos and don'ts\n                 \"You could request a refund of the delivery charge as the time-specific part of the contract constitutes a breach and has not been fulfilled. \"I would contact customer services and be nice about it, as you are more likely to elicit a better outcome that way, given the value involved.\" The inspiration for this post was one of the Money team seeing their shopping arrive 45 minutes late last weekend. They rang Tesco's customer service team who, full marks, took down the details and refunded the £7 delivery charge without much fuss. Tesco's media team later told us they judge things case by case - but they do encourage you to contact their customer relations teams if there's any delay. We asked the other supermarkets for their policies. Asda said... \"Asda always aims to deliver goods within the delivery slot agreed with the customer. However, if an order is delivered outside of this slot, we will let the customer know and they are then able to request a refund for the delivery charge.\" Ocado... \"We offer customers a one-hour delivery slot of their choice. If we're running late, we'll always contact the customer directly to let them know. On the rare occasion that we're really late, our customer hub advisors can issue refunds - these are assessed on a case-by-case basis.\" Morrisons... \"We work with customers on a case-by-case basis to resolve any late delivery issues.\" Waitrose... \"In the event of a delay, the shop makes every effort to contact each customer directly in advance of their delivery to explain the situation and provide an updated ETA. If the customer is no longer able to accept the delivery, we work with them to reschedule it at a time that suits. While delays are often beyond our control, we assess each situation on a case-by-case basis, and Partners can offer a gesture of goodwill when customers are inconvenienced.\" Regardless of their policies, it's worth (politely) pushing - as the law is on your side."
    },
    {
        "title": "China says it has 'no interest' in spying on UK following latest accusations",
        "description": "China's foreign ministry has hit back at what it called \"unfounded\" accusations of spying in Westminster, saying it has \"no interest\" in gathering intelligence on the UK.",
        "url": "https://news.sky.com/story/china-says-it-has-no-interest-in-spying-on-uk-following-latest-accusations-13472651",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-westminster-big-ben_7021720.jpg?20250916021346",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-19 08:12:00",
        "Headline": "It comes after MPs were warned that two people working for Chinese security services had been posing as recruitment headhunters.",
        "Content": " China's foreign ministry has hit back at what it called \"unfounded\" accusations of spying in Westminster, saying it has \"no interest\" in gathering intelligence on the UK. Yesterday, the security service MI5 sent a warning to MPs and peers about two recruitment headhunters who are working for Chinese security services. Politics latest: 'Are we safe?' - Minister challenged repeatedly after damning report from MPs They are Amanda Qiu of BR-YR Executive Search and Shirly Shen of the Internship Union. But speaking in response to a question by Asia correspondent Helen-Ann Smith, Chinese foreign ministry spokesperson Mao Ning replied: \"China has repeatedly made clear its solemn position on this matter. \"We firmly oppose such unfounded allegations and the exaggerated portrayal and sensationalism that project one's own biases onto others. \"Judgements based on erroneous information will only lead astray. \n                  MI5 is also trying to send a signal to China with spying warning to parliamentarians\n                 \n                  Parliamentarians warned of new spying attempts from China-linked agents\n                 \n                  Stranded Chinese astronauts return to Earth after space capsule damaged\n                 Ms Mao added: \"China never interferes in the internal affairs of other countries, nor does it have any interest in gathering so-called intelligence on the British parliament.\" Asia correspondent It is China's standard playbook to outright deny allegations of spying.\n\n But given that it's common knowledge countries spy on each other, and given the recent spate of allegations of this nature, it might feel a little far-fetched for China to stick so rigorously to the position that the UK is just making it all up. Not so, says Mao Ning, the spokesperson for China's Ministry of Foreign Affairs. When I put it to her, she said that these allegations are, in fact, a \"projection of one's own biases on to others\", and that China doesn't \"have any interest in gathering so-called intelligence on the British parliament\". That is almost certainly not true. China is commonly understood to run a highly sophisticated espionage operation. But, in a way, the truth or untruth might be immaterial to the impact on the bilateral relationship. While the UK government may seek to send strong signals amidst criticism that it's being too soft, China really does not appreciate this type of laundry being aired in public. It may well signal a thorny period ahead. In a message seen by Sky News about parliamentary staff, MPs and peers were warned that the MI5 alert \"highlights how the Chinese Ministry of State Security (MSS) is actively reaching out to individuals in our community\". The message continued: \"Their aim is to collect information and lay the groundwork for long-term relationships, using professional networking sites, recruitment agents and consultants acting on their behalf.\" Security minister Dan Jarvis later said in a statement to parliament that \"China has a low threshold for what information is considered to be of value, and will gather individual pieces of information to build a wider picture\". He added: \"Let me speak plainly. This activity involves a covert and calculated attempt by a foreign power to interfere with our sovereign affairs in favour of its own interests, and this government will not tolerate it.\" Read more:MI5 is trying to send a signal to China with spying warningThree key questions about China spy case that need answering The government made a statement in the House of Commons following the revelations, saying it would take all \"necessary measures\" to protect the UK. Westminster employees were warned that two individuals were both known to be reaching out on LinkedIn to \"conduct outreach at scale on behalf of MSS\". This latest warning comes after the collapse of a prosecution of two people suspected of spying on behalf of China. The previous spying allegations led to controversy over how the government under Labour responded to the Crown Prosecution Service's requests for evidence. Sir Keir Starmer sought to blame the previous Conservative government for the issues, which centred on whether China could be designated an \"enemy\" under First World War-era legislation. Sir Keir has sought to keep relationships with Beijing somewhat warm, highlighting the value of China as a trading partner."
    },
    {
        "title": "Russia accuses British government of being 'provocative' after spy ship nears UK",
        "description": "Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK.",
        "url": "https://news.sky.com/story/russian-spy-ship-currently-on-edge-of-uk-waters-warns-defence-secretary-13472703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-yantar-english-channel_7085832.jpg?20251119105235",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-19 09:43:00",
        "Headline": "Defence Secretary John Healey says the UK has \"military options ready\" if Russian spy ship the Yantar sails closer to British shores.",
        "Content": " Russia has accused the British government of \"provocative statements\" and an \"escalation of militaristic hysteria\" after the defence secretary warned a Kremlin spy ship was nearing the UK. At a news conference in Downing Street on Wednesday, John Healey said the Yantar was on the edge of British waters north of Scotland, having entered wider UK waters over the last few weeks. He said it was the second time this year the ship had been deployed off the UK coast and he claimed it was \"designed for gathering intelligence and mapping our undersea cables\". Politics latest: 'Budget leaks are not acceptable,' says Reeves Mr Healey said the ship had \"directed lasers\" at pilots of surveillance aircraft monitoring its activities - a Russian action he called \"deeply dangerous\". The defence secretary explained: \"We deployed a Royal Navy frigate and RAF planes to monitor and track this vessel's every move, during which the Yantar directed lasers at our pilots.\" He said his message to Moscow and President Vladimir Putin was \"we see you, we know what you're doing, and if the Yantar travels south this week, we are ready\". \n                  Welfare versus warfare: Sir Keir Starmer's unresolved question  - and why the PM's pinned his hopes on economic growth\n                 \n                  Is Trump's America chaos? Or are memories just short?\n                 \n                  Europe must be ready to build 'millions of drones' to defend itself against possible Russian attacks, EU warns\n                 Mr Healey also stated the UK government has \"military options ready\" if the ship sails closer to British shores. Russia's response Responding to Mr Healey's comments, the Russian embassy to the UK said on social media it noted his \"latest provocative statements\" and insisted the ship was an \"oceanographic research vessel... in international waters\". The embassy said the British accusations \"raise a smile\" and Russia's actions were \"not aimed at undermining\" the UK's security. It hit out at the UK government's \"Russophobic course and the escalation of militaristic hysteria\", which it warned creates \"prerequisites for new dangerous situations\", as it urged London to \"refrain from destructive steps\". Read more:Analysis: A Bond-villain ship prowling our waters The defence secretary's remarks come after a report from MPs warned the UK lacks a plan to defend itself from a military attack, despite the government promising to boost readiness with new arms factories. At least 13 sites across the UK have been identified for new factories to make munitions and military explosives, with Mr Healey expecting the arms industry to break ground at the first plant next year. The report, by the Commons Defence Committee, said the UK \"lacks a plan for defending the homeland and overseas territories\" as it urged the government to launch a \"co-ordinated effort to communicate with the public on the level of threat we face\". 'Assertive retaliation' Now the government has been cautioned it may need to be \"more muscular\" in standing up to Russia. The chair of the Joint Committee on National Security Strategy, Matt Western, said Wednesday's development \"demonstrates once again that Russia presents a genuine and immediate threat to the UK's security\". He added that \"the UK needed to be more muscular in tackling Russian aggression\" and \"there is more we can do\". \"More assertive retaliation may be required,\" he concluded. Mr Healey acknowledged the dangers facing the UK, saying the country was in a \"new era of threat\" that \"demands a new era for defence\". Giving more details on the vessel, he said it was \"part of a Russian fleet designed to put and hold our undersea infrastructure and those of our allies at risk\". Read more from Sky News:Briton who volunteered as spy for Russia jailedRail line blast 'initiated by Russian secret services' He said the Yantar wasn't just part of a naval operation but part of a Russian programme driven by Moscow's Main Directorate of Deep-Sea Research, or GUGI, which is \"designed to have capabilities which can undertake surveillance in peacetime and sabotage in conflict\". \"That is why we've been determined, whenever the Yantar comes into British wider waters, we track it, we deter it and we say to Putin we are ready, and we do that alongside allies,\" he added. Asked by Sky News' political correspondent Rob Powell whether this was the first time that lasers had been used by a Russian vessel against pilots, Mr Healey replied: \"This is the first time we've had this action from Yantar directed against the British RAF. \"We take it extremely seriously. I've changed the Navy's rules of engagement so that we can follow more closely, monitor more closely, the activities of the Yantar when it's in our wider waters. We have military options ready.\" Mr Healey added that the last time the Yantar was in UK waters, the British military surfaced a nuclear-powered attack submarine close to the ship \"that they did not know was there\"."
    },
    {
        "title": "Waste mountain branded 'utterly appalling' by PM grew 40 feet high within months",
        "description": "A mountain of waste branded \"utterly appalling\" by Prime Minister Sir Keir Starmer grew so quickly that most of it was in place before the Environment Agency (EA) was even aware of it.",
        "url": "https://news.sky.com/story/waste-mountain-branded-utterly-appalling-by-pm-grew-40-feet-high-within-months-13472792",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-river-cherwell-kidlington_7083471.jpg?20251116165151",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-19 17:28:00",
        "Headline": "Environment Agency bosses said those responsible would pay for the \"blight on the landscape\" they had left.",
        "Content": " A mountain of waste branded \"utterly appalling\" by Prime Minister Sir Keir Starmer grew so quickly that most of it was in place before the Environment Agency (EA) was even aware of it. Sky News revealed this week how the site in Oxfordshire, next to the A34, went from a grassy field in March to a pile of rubbish 12 metres/40ft thick in September. Sir Keir has called the scene \"utterly appalling\" while the EA says it is \"laser focused\" on pursuing the perpetrators. Anna Burns, the agency's director for the Thames area, said those responsible would pay for the \"blight on the landscape\" they had left. She said: \"Most of the tipping happened before we were aware of it. As soon as we were aware, we acted quickly and decisively. \"We are pursuing this as a criminal investigation and currently following a number of leads, and we are laser focused on pursing that investigation. \"And we are working with partners to understand the risks associated with the site. \"I completely understand why communities want this waste gone, it's a blight on the landscape.\"  She added that the waste appeared to be shredded domestic and commercial waste, like plastic and paper, which is non-hazardous, though it may also include items like batteries. At the site this week, Sky spotted an old DVD, tooth floss and AA batteries at the edge of a waste pile. Read more from Sky News:Weather warnings for snow and ice updatedWhat is the mysterious Yantar 'spy ship'? Ms Burns' remarks come as the EA convenes a meeting about the site with organisations including Thames Valley Police, National Highways, and the local authority. The agency first visited the site at the beginning of July, after it was reported to them, and issued a cease-and-desist letter to stop further tipping. After more dumping was then discovered, officers secured a court order to close down the site in October. Now the EA is monitoring water run-off from the site and has installed a boom there to try to prevent leakage into the nearby River Cherwell. Earlier this week, Calum Miller, Liberal Democrat MP for Bicester and Woodstock, told Sky News that the clean-up operation could exceed the entire yearly budget for Cherwell District Council."
    },
    {
        "title": "Pro-Palestine activists accused of harassing Labour MP over Israel-Hamas war have convictions thrown out",
        "description": "Two pro-Palestinian activists found guilty of harassing a government minister have had their convictions overturned.",
        "url": "https://news.sky.com/story/pro-palestine-activists-accused-of-harassing-labour-mp-over-israel-hamas-war-have-convictions-thrown-out-13472840",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hiba-ahmed-ayeshah-behit_7086160.jpg?20251119164401",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-19 15:15:00",
        "Headline": "Ayeshah Behit, 32, and Hiba Ahmed, 26, were found guilty at magistrates' court in June of the offence against Labour MP Alex Davies-Jones. But Judge Tracey Lloyd-Clarke said during a crown court hearing on Wednesday the prosecutions were not necessary. ",
        "Content": "Two pro-Palestinian activists found guilty of harassing a government minister have had their convictions overturned. Ayeshah Behit, 32, and Hiba Ahmed, 26, were in June found guilty of the offence against the Labour MP for Pontypridd, Alex Davies-Jones, at Cardiff Magistrates' Court. The pair challenged the ruling, asking for the verdict to be determined by a crown court, as they denied they harassed Ms Davies-Jones and argued they were exercising their right to free speech. At Cardiff Crown Court on Wednesday, Judge Tracey Lloyd-Clarke said the prosecutions were unnecessary and allowed both appeals. Ms Behit and Ms Ahmed had filmed a confrontation with Ms Davies-Jones, who had been campaigning in Treforest, Rhondda Cynon Taf, in the run-up to the general election, on 26 June last year. As she made her way to the campaign meeting place, she saw Ms Behit and Ms Ahmed with leaflets which suggested she was a \"full-blown supporter of this genocide\" - referring to the Israel-Hamas conflict. Ms Davies-Jones told the court she was aware of what was on the leaflets and had initially approached the defendants in an attempt to defuse the situation. Read more from Sky News: Inflation slows to 3.6%, but food costs shoot upwardsWeather warnings for snow and ice updated She said they asked why she had abstained on a Commons ceasefire vote and she decided to end the conversation when it became \"confrontational\". A video of the interaction was played in court, with the pair shouting as the MP walked away. \"It was becoming quite scary,\" said the MP, who is now parliamentary under-secretary of state for victims. An edited video of her interaction was later posted on social media, with suggestions that she was racist and Islamophobic. Ms Ahmed, who has no previous convictions, was given a 12-month conditional discharge in June. Ms Behit, who had a previous conviction relating to a protest in Cardiff last year, was handed an 18-month conditional discharge. During the three-day appeal hearing, representatives for the pair argued their actions did not amount to harassment and were a reasonable exercise of their rights to freedom of expression. Francesca Cociani, for the appellants, said: \"It was not only in a public place but it was within her constituency... In the middle of a national campaign for the general election.\" Judge Lloyd-Clarke said the actions of the two activists amounted to a \"planned and well-orchestrated campaign\" which had the aim of harming the electoral prospects of Ms Davies-Jones. But she noted that \"less intrusive\" measures such as a police warning or civil action were not pursued before they were prosecuted. \"Nothing in this judgment implies, or should be taken to imply, that there is any truth in the accusations made by the appellants about Ms Davies-Jones,\" the judge added. \"We are not satisfied that a prosecution was necessary... the appeals of both defendants are allowed.\""
    },
    {
        "title": "Sir Keir Starmer refuses to rule out extending freeze on income tax thresholds",
        "description": "Sir Keir Starmer has refused to rule out extending the freeze on income tax thresholds in next week's budget.",
        "url": "https://news.sky.com/story/sir-keir-starmer-refuses-to-rule-out-extending-freeze-on-income-tax-thresholds-13472776",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-pmqs_7085880.png?20251119120456",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-19 12:24:00",
        "Headline": "The measure is reportedly being considered by Rachel Reeves as she seeks to plug an estimated £30bn black hole in the public finances.",
        "Content": " Sir Keir Starmer has refused to rule out extending the freeze on income tax thresholds in next week's budget. The prime minister said he would not \"inflict austerity on the country as they did\", referring to the Conservatives, but did not directly address the speculation that the chancellor may extend the freeze on income tax thresholds beyond 2028. Politics latest: Labour MP says he would quit to let Andy Burnham stands - but has 'no plans' to do so Asked by Conservative leader Kemi Badenoch whether Rachel Reeves would unveil the measure next week, Sir Keir said: \"The budget is one week today and we will lay out our plans. \"I've said what we will do in terms of protecting the NHS and public services. \"What we won't do is inflict austerity on the country as they did. What we won't do is inflict a borrowing spree like Liz Truss did.\" Ahead of the general election, the Labour Party promised not to increase taxes on \"working people\", including national insurance, income tax and VAT. \n                  Inflation may have eased but we're stuck in a world of higher prices\n                 \n                  Cunning plan or a gamble that didn't pay off? Why some think the chancellor pulled off something extraordinary\n                 \n                  Budget 2025: Ex-Bank of England rate setter Andy Haldane criticises 'repeated mistakes'\n                 It has already been accused of breaking the pledge of national insurance by increasing the amount paid by employers - though Labour said its promise only applied to employees. While extending the freeze on tax thresholds - dubbed a stealth tax because it drags people into paying higher rates even if their wages increase - would not be a technical breach of the manifesto, it would lead to people paying more personal tax. The current freeze in thresholds, brought in by the previous Conservative government after the pandemic, is due to expire in 2028. Pressed on his lack of answer, Ms Badenoch said: \"It is quite clear that they are going to freeze thresholds. \"We didn't get a clear answer from them but this is really important, because in her budget speech last year, the chancellor said, and I quote, 'I am keeping every single promise on tax that I made in our manifesto'. Read more:No 'free tickets' on council tax under ReformMI5 is trying to send a signal to China with spying warning to parliamentarians \"So, there will be no extension of the freeze in income tax and national insurance thresholds. Why was freezing thresholds a breach of the manifesto last year but it isn't this year?\" Conservative MPs laughed as the prime minister replied: \"Every week she comes along and speculates and distorts.\" Extending the freeze on income tax thresholds is one of the measures that is reportedly being considered by Ms Reeves as she seeks to fill an estimated £30bn hole in the public finances. Other proposals include a mansion tax - an annual 1% charge on the amount a property's value exceeds £2m - and a gambling tax that would earn the Treasury about £3.2bn extra a year."
    },
    {
        "title": "Nvidia beats expectations again in defiance of AI bubble fears",
        "description": "The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now. ",
        "url": "https://news.sky.com/story/nvidia-beats-expectations-again-in-defiance-of-ai-bubble-fears-13472848",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jensen-huang-nvidia_7072665.jpg?20251105113409",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-19 21:36:00",
        "Headline": "The company not only posted another set of record-breaking figures but said it expects those records will be broken again in three months.  ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The world's most valuable company has reported another series of expectation-beating results, heading off fears of the AI bubble bursting for now.  Nvidia's revenue reached $57bn in the three months to October, higher than Wall Street estimates and the company's own guidance. That's up 62% on the same time last year, and has been described by the business as an \"outstanding\" quarter. Money blog: Ryanair flights to EU banned in 'unprecedented' decision A profit measure called earnings per share was also better than expected at $1.30.  It matters as Nvidia has powered the artificial intelligence (AI) boom through its computer chips, which are key parts in AI chatbots such as ChatGPT. \n                  AI bubble fears take hold of stock markets and bitcoin\n                 \n                  'Agentic AI' is current industry buzzword - but what does it mean and should we be cautious?\n                 \n                  A third of daily music uploads are AI-generated and 97% of people can't tell the difference, says report\n                 Nvidia has major tech companies as clients and acts as a good proxy for whether the tens of billions of dollars invested in AI is paying off.  Its chief executive, Jensen Huang, has been described as the Godfather of AI and watch parties were organised for those looking to follow the Wednesday evening announcement. The company has been a massive beneficiary of the push to put money into AI, with its share price reaching stratospheric highs. In October, it became the first worth $5trn (£3.83trn), about the size of the German economy, Europe's largest, and double the UK's benchmark stock index, the FTSE 100.  What's been announced? Revenue from data centres reached a record high of $51.2bn, more than £10bn higher than the three months previous. The outlook is for continuing strong sales in the final three months of the financial year, as the company forecasts revenue will be roughly $65bn.  Read more:Nvidia boss defends against claims of bubble by 'Big Short' investorInflation slows to 3.6%, but food costs shoot upwards  Demand for Nvidia products continues to surpass expectations, while the business is \"still in the early innings\" of AI transitions, its chief financial officer Colette Kress said. Mr Huang said sales of its blackwell chips are \"off the charts\" and its cloud graphics processing chips (GPUs) are \"sold out\".  Why it matters Developing AI infrastructure, like the construction of data centres, has been a significant contributor to US economic growth, as measured by gross domestic product (GDP). A faltering of AI expansion, therefore, impacts the US economy, the world's largest, which in turn affects the UK and global economies. Anxiety around the massive valuations tech companies have accrued, on the hope of AI revolutionising the world, is likely to be staved off by the results announcement. A fall in these tech company valuations could have meant a drop in the value of pension pots or savings. Just seven dominant tech companies, many of which have borrowed to invest in AI, make up more than a quarter of major US stock index, the S&P 500.  In the last year alone, Nvidia's share price has risen more than 230%. Some, including US trader Michael Burry, famous for being played by Christian Bale in the Hollywood film The Big Short, have effectively bet that Nvidia's share price would fall. Addressing the topic of an AI bubble, Nvidia's founder, Mr Huang, said, \"From our vantage point, we see something very different\".  What next? Regardless of the figures released on Wednesday evening, significant market moves were anticipated, given the attention paid to the results and the significance of the company. Nvidia shares rose as much as 4% in after-hours trading. The results also boosted the share price of its chip-making competitors like Broadcom and Advanced Micro Devices.  For now, the AI bubble remains intact."
    },
    {
        "title": "Meta to block Instagram and Facebook for users under 16 in Australia",
        "description": "Meta will stop Instagram, Facebook and Threads for users in Australia under the age of 16, the company has said.",
        "url": "https://news.sky.com/story/meta-to-block-instagram-and-facebook-for-users-under-16-in-australia-13472915",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-meta-instagram_7073644.jpg?20251106114734",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-19 19:15:00",
        "Headline": "The block will come into effect by 10 December to comply with the country's social media ban for young teenagers.",
        "Content": "Meta will stop Instagram, Facebook and Threads for users in Australia under the age of 16, the company has said. The block will come into effect by 10 December to comply with the country's social media ban for young teenagers. Meta, which operates the three apps, said it had begun notifying users it believed were between 13 and 15 that their accounts will be shut down through in-app messages, email and texts. From 4 December, it will start deactivating the accounts and blocking new sign-ups by anyone under 16. The company said the process was expected to be completed by 10 December. It previously indicated to Australian politicians it would only begin removing access once the law comes into effect on that date. The company said it would use several age assurance methods to comply with the ban and adopt a \"data minimisation approach\", only seeking additional information when it had reason to doubt a user's stated age. \"While we are working hard to remove all users who we understand to be under the age of 16 by 10 December, compliance with the law will be an ongoing and multi-layered process,\" said Antigone Davis, Meta's vice president and global head of safety. Read more:Australia's social media ban can be enforced 'effectively' - report There are around 350,000 Instagram users and around 150,000 Facebook users aged between 13 and 15 in Australia, according to the country's internet regulator. No data has been published for Threads. Meta said affected teenagers can update their contact details to be notified once they turn 16."
    },
    {
        "title": "New record for wind-powered electricity in Britain",
        "description": "A new wind record has been set for Britain, with enough electricity generated from turbines to power 22 million homes, the system operator has said.",
        "url": "https://news.sky.com/story/new-record-for-wind-powered-electricity-in-britain-13472884",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wind-turbines-uk_7086229.jpg?20251119181703",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-19 16:56:00",
        "Headline": "The National Energy System Operator (Neso) has predicted Britain could hit another milestone in the months ahead by running the grid for a period entirely with zero carbon power, renewables and nuclear.",
        "Content": "A new wind record has been set for Britain, with enough electricity generated from turbines to power 22 million homes, the system operator has said. The mark of 22,711 megawatts (MW) was set at 7.30pm on 11 November, beating the previous high for wind power generation of 22,253 MW set on 18 December last year. At the time, wind was providing 43.6% of Britain's electricity, enough to keep around three-quarters of British homes powered, the National Energy System Operator (Neso) said. The country had experienced windy conditions, particularly in the north of England and Scotland.  Neso said gas at the time was providing 12.5% of generation, while 12.1% came from \"embedded wind\", which supplies power directly to local distribution networks rather than the high-voltage transmission network. Also, 11.3% came from interconnectors with other countries, 8% from nuclear, 8% from biomass, 1.4% from hydro, and 1.1% from storage. Neso has predicted that Britain could hit another milestone in the months ahead by running the electricity grid for a period entirely with zero carbon power, renewables and nuclear. \n                  Why US may soon have a real energy emergency\n                 \n                  Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce\n                 \n                  Britain's winter blackout risk the lowest in six years\n                 Kayte O'Neill, chief operating officer at Neso, said the record showed that \"our national grid can run safely and securely on large quantities of renewables generated right here in Britain\". She went on to say: \"I look forward to seeing if we can hit another clean energy milestone in the months ahead: running Britain's electricity grid entirely zero carbon.\" Neso said wind power is now the largest source of electricity generation for the UK, and the government wants to generate almost all of the UK's electricity from low-carbon sources by 2030. Read more from Sky News:Inflation slows to 3.6%, but food costs riseWintry blast could be a dry run for a cold December Industry body RenewableUK's deputy chief executive, Jane Cooper, urged the government to go further by increasing the amount of capacity they will support in the next round of auctions. This is where contracts are handed out for new wind farms to receive an agreed price for the power they generate. Government support is seen as crucial in auctions as it sets the maximum price generators can receive for electricity, which can determine the commercial feasibility of projects."
    },
    {
        "title": "Ultra-processed foods leading cause of 'chronic disease pandemic', say experts",
        "description": "Ultra-processed foods (UPFs) are a leading cause of a \"chronic disease pandemic\" linked to worsening diets, experts have warned.",
        "url": "https://news.sky.com/story/ultra-processed-foods-leading-cause-of-chronic-disease-pandemic-say-experts-13472593",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-carbs-processed-food_7085566.jpg?20251119054157",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-19 05:16:00",
        "Headline": "The authors of a new report accuse powerful food companies of \"co-ordinated efforts... to skew decision-making, frame policy debates in their interest, and manufacture the appearance of scientific doubt\".",
        "Content": "Ultra-processed foods (UPFs) are a leading cause of a \"chronic disease pandemic\" linked to worsening diets, experts have warned. UPFs include items such as processed meats, some ready meals and cereals, ice cream, crisps, biscuits, mass-produced bread and fizzy drinks. They often contain a high level of saturated fat, salt and sugar - as well as additives such as sweeteners and preservatives. UPFs leave less room for more nutritious foods and are also believed to negatively affect gut health. Forty-three scientists and researchers have now sounded the alarm and accused food companies of putting \"profitability above all else\". Writing in The Lancet, they said the firms' economic and political power is growing and \"the global public health response is still nascent, akin to where the tobacco control movement was decades ago\". They warned that while some countries have brought in controls on UPFs, policy is lagging due to \"co-ordinated efforts of the industry to skew decision-making, frame policy debates in their interest, and manufacture the appearance of scientific doubt\". Professor Chris Van Tulleken, from University College London, one of the authors, said obesity and diet-related disease had increased in line with a \"three-decade history of reformulation by the food industry\". \"This is not a product level discussion. The entire diet is being ultra-processed,\" he warned. Read more from Sky News:Bill to release Epstein files gets all-clearBest and worst parcel delivery companies revealed However, several experts not involved with the article urged more research, cautioning that existing studies had shown a link with poor health and UPFs but not established causation. Kate Halliwell, chief scientific officer at the Food and Drink Federation (FDF), which represents the industry, said companies had made a \"series of changes over many years to make the food and drink we all buy healthier, in line with government guidelines\". She said FDF-member products now contained a third less salt and sugar and a quarter fewer calories than in 2015. Previous studies cited by the British Heart Foundation have linked UPFs to a greater risk of heart disease, stroke, and early death. A 2023 meta analysis in the PubMed journal said evidence suggested an association between UPF intake \"and the risk of overall and several cancers, including colorectal, breast and pancreatic cancer\". Get cancer symptoms checked, charity urges It comes as Cancer Research UK warned too many Britons are putting off getting potential symptoms checked. A poll for the charity suggested the top reasons people delay getting potential signs of cancer checked is because of a lack of GP appointments, or thinking their symptoms might not be serious. More than half (53%) of the 6,844 surveyed said they were put off as they believed getting seen would be difficult, while 47% said they actually had found it difficult to get an appointment. Some 44% put it off as they though the symptom wasn't serious, 41% believed they could manage things themselves, and 40% didn't want to be seen as making a fuss. Cancer Research UK said it had now trained Tesco pharmacists to spot possible cancer signs - and that people can speak to them in private if they needed. The pharmacists will be able to give advice on next steps and whether a GP appointment is recommended."
    },
    {
        "title": "Princess of Wales says her children were 'very sad' to miss Paddington at Royal Variety Performance",
        "description": "The Princess of Wales has admitted her children were \"very sad\" to miss the Royal Variety Performance in London, which she and the Prince of Wales attended.",
        "url": "https://news.sky.com/story/princess-of-wales-says-her-children-were-very-sad-to-miss-paddington-at-royal-variety-performance-13472933",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-of-wales-prince-william_7086300.jpg?20251119204213",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-19 20:21:00",
        "Headline": "William and Kate made their first appearance at the event - headlined by the cast of Paddington The Musical - since the princess's recovery from cancer.",
        "Content": "The Princess of Wales has admitted her children were \"very sad\" to miss the Royal Variety Performance in London, which she and the Prince of Wales attended. Prince William and Kate made their first appearance at the event since her recovery from cancer. Wednesday's red carpet show at the Royal Albert Hall was headlined by the cast of Paddington The Musical. After arriving and being presented with posies by nine-year-old twins Emelia and Olivia Edwards, the family of staff at a care home for entertainment industry workers, Kate asked if they were fans of Paddington Bear. The princess, wearing a green velvet gown, then told the girls that her children were \"very sad\" not to attend the show and added she had to tell them children were not allowed to go. \"My kiddies were very sad, we're going to have to keep it a big secret that I saw you guys,\" she said. \"They were very sad not to be joining us.\" It is the sixth time William and Kate have attended the annual charity event. When Olivia told the prince, wearing a tuxedo, her favourite singer was Billie Eilish, he replied she had good taste. He said: \"It's very nice to see you both. You're very smiley, you two.\" The royals were also greeted on the red carpet by ITV board members and representatives from the Royal Variety Charity, of which the King is the royal patron. The Paddington cast were set to take to the stage on Wednesday evening, while pop star Jessie J and Grammy award-winning singer Laufey were also expected to perform. Read more from Sky News:New record for wind-powered electricity in BritainWeather warnings for snow and ice updated Held annually, the Royal Variety Performance was first staged in 1912 for King George V and Queen Mary in support of the charity, which helps those working in the entertainment industry. Ahead of the show, its executive producer Giles Cooper said the charity was \"thrilled\" the prince and princess would \"once again attend the Royal Variety Performance\". Mr Cooper, also chairman of the charity, added: \"This annual great British institution, viewed by a worldwide TV audience of over 150 million, continues to be a crucial fundraising event supporting people in all areas of performance, either on or off stage. \"In this pressurised world of working in the entertainment industry, our mental health initiative, started in 2024, has been a lifeline for many who are experiencing issues such as anxiety, depression or addiction.\" On Tuesday, the princess called on businesses to value \"time and tenderness just as much as productivity and success\" in her first speech since she was diagnosed with cancer at the start of 2024. Speaking at the Future Workforce Summit, Kate told 80 business leaders: \"Every one of you interacts with your own environment; a home, a family, a business, a workforce, a community. \"These are the ecosystems that you yourselves help to weave. Imagine a world where each of these environments were built on valuing time and tenderness just as much as productivity and success. \"As business leaders, you will face the daily challenge of finding the balance between profitability and having a positive impact. But the two are not, and should not be incompatible.\""
    },
    {
        "title": "Gustav Klimt's Portrait of Elisabeth Lederer sells for £180m at auction, a record for modern art",
        "description": "A painting that helped save the life of its Jewish subject during the Holocaust has become the most expensive piece of modern art and the second most expensive painting ever sold at auction.",
        "url": "https://news.sky.com/story/gustav-klimts-portrait-of-elisabeth-lederer-sells-for-163180m-at-auction-a-record-for-modern-art-13472668",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gustav-klimt-elisabeth-lederer_7085615.jpg?20251119073215",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-19 08:38:00",
        "Headline": "Its sale price beat the previous record, set by an Andy Warhol portrait of Marilyn Monroe, which went for $195m in 2022 and puts it second in the all-time list, behind Leonardo da Vinci's Salvator Mundi.",
        "Content": "A painting that helped save the life of its Jewish subject during the Holocaust has become the most expensive piece of modern art and the second most expensive painting ever sold at auction. The Portrait of Elisabeth Lederer, by Austrian artist Gustav Klimt, was bought for $236.4m (£180m) by an unnamed buyer after a 20-minute bidding war at Sotheby's in New York on Tuesday. Its sale price beat the previous record for 20th-century art set by Andy Warhol's Shot Sage Blue Marilyn, a portrait of Marilyn Monroe bought for $195m (£148m) in 2022. The most expensive painting ever sold at auction was Leonardo da Vinci's Salvator Mundi, which fetched $450m (£342m) in 2017, Christie's said on its website. Sotheby's said on X the price for the Klimt was \"astonishing\", making the piece \"the most valuable work of modern art ever sold at auction\". The portrait, which Klimt worked on between 1914 and 1916, depicts the daughter of one of Vienna's wealthiest families wearing an East Asian emperor's cloak. Evaded fire and Nazi looters \n                  Austria gunman had 'significant passion' for school shootings, police say\n                 \n                  King and Queen 'shocked and saddened' by school shooting in Austria\n                 \n                  What we know so far about school shooting in Austria\n                 Measuring 1.8m (6ft), the colourful piece, which was completed in 1916, illustrates the Lederer family's life of luxury before Nazi Germany annexed Austria in 1938. It was kept separate from other Klimt paintings that burned in a fire at an Austrian castle. It also escaped being looted by the Nazis, who plundered the Lederer art collection. They left only the family portraits, which they held to be \"too Jewish\" to be worth stealing, according to the National Gallery of Canada, where the painting was previously on loan. Father lie saved her life To save her own life, Elisabeth Lederer made up a story that Klimt, who was not Jewish and died in 1918, was her father. It helped that the artist spent years working meticulously on her portrait. She convinced the Nazis to give her a document stating that she descended from Klimt, which allowed her to live safely in Vienna until her death from illness in 1944. The painting, which is one of two full-length portraits by the Austrian artist that remain privately owned, was part of the collection of billionaire Leonard A Lauder, heir to the Estée Lauder cosmetics empire, who died this year. Read more on Sky News:Dancing sisters in 'joint suicide'Resale ticket prices to be cappedNew suspect in 'one punch' killing Five Klimt pieces from Lauder's collection sold at the auction for a total of $392m (£298m), which also included pieces by Vincent van Gogh, Henri Matisse and Edvard Munch, Sotheby's said. An 18-carat-gold toilet by Maurizio Cattelan - the provocative Italian artist known for taping a banana to a wall - sold for a reported $12.1m (£9.2m). The fully-functioning toilet, one of two he created in 2016 satirising superwealth, was stolen while on display at Blenheim Palace, the country manor where Winston Churchill was born, in 2019. Two men were convicted of the theft, but it's unclear what they did with the loo. Investigators believe it was likely broken up and melted down."
    },
    {
        "title": "Oasis fan fell to his death at Wembley in 'tragic accident', coroner's court hears",
        "description": "An Oasis fan who fell to his death at Wembley Stadium was the victim of a \"tragic accident\", a pre-inquest review has heard.",
        "url": "https://news.sky.com/story/oasis-fan-fell-to-his-death-at-wembley-in-tragic-accident-coroners-court-hears-13472861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lee-claydon-oasis_6983635.jpg?20250805191312",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-19 15:50:00",
        "Headline": "Police tell a pre-inquest hearing they have completed their investigation into the death of Bournemouth man Lee Claydon, 45, who died at the London stadium on 2 August. The full inquest will take place on 26 February next year.",
        "Content": "An Oasis fan who fell to his death at Wembley Stadium was the victim of a \"tragic accident\", a pre-inquest review has heard. Bournemouth man Lee Claydon, 45, died following the incident at the London venue on 2 August. Detective Sergeant James Raffin, from the Met Police, said there were \"no concerns\" from Mr Claydon's toxicology report.  He also said that while Mr Claydon had drunk alcohol, this was \"expected\" and \"normal for any of the people attending\" the Oasis gig. The force had also ruled out the possibility of suicide, he said. He told Barnet Coroner's Court the police had now completed their investigation into his death He said: \"From a police point of view, this is no longer a criminal prosecution. \n                  Oasis guitarist 'Bonehead' taking break from reunion tour as he reveals prostate cancer diagnosis\n                 \n                  Paul Gallagher: Older brother of Oasis stars Liam and Noel denies rape charge\n                 \n                  Fans to see Ticketmaster changes after Oasis investigation - here's what they are\n                 \"We do not suspect any third party involvement. \"This, from everything we have seen, was a tragic accident. \"From a police point of view, I would say our investigation is complete.\" DS Raffin said he was aware the family had concerns over the \"circumstances on the night\", and said he would pass these on to officials at Brent Council. The deceased's father, Clive Claydon, 75, previously raised questions about barriers at the venue. \"It must have been horrific,\" he said in August. \"All I know is there was beer everywhere, it's slippery, he slipped apparently, we do not know the rest of it, there's questions about the barriers.\" Brent Council will now review the police report. Mr Claydon, a landscape gardener, fell during a gig that formed part of Oasis' sell-out Live '25 reunion tour - their first since splitting in 2009. The inquest opening, which took place in September, heard that the father-of-three was taken to a medical centre in Wembley after the fall, where he was pronounced dead at 10.38pm. A post-mortem examination on 6 August gave his preliminary medical cause of death as \"multiple bodily injuries\". Senior Coroner Andrew Walker told the review hearing the full inquest will take place on 26 February next year. He said: \"It looks like we are going to be in a position next February to have reports from the London Borough of Brent over the circumstances and also we will have by then the police investigation report.\" Oasis previously said in a statement: \"We are shocked and saddened to hear of the tragic death of a fan at the show. \"Oasis would like to extend our sincere condolences to the family and friends of the person involved.\" In a statement at the time of the fall, a Wembley spokesperson said: \"The stadium operates to a very high health and safety standard, fully meeting legal requirements for the safety of spectators and staff, and is certified to and compliant with the ISO 45001 standard. \"We work very closely and collaboratively with all relevant event delivery stakeholders - including event owners, local authorities, the Sports Grounds Safety Authority and the police - to deliver events to high standards of safety, security and service for everyone attending or working in the venue.\""
    },
    {
        "title": "Marks & Spencer defends £195 beef wellington",
        "description": "M&S has defended the price of a &#163;195 beef wellington made by chef Tom Kerridge.",
        "url": "https://news.sky.com/story/marks-spencer-defends-163195-beef-wellington-13472786",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-marks-and-spencer-beef-wellington_7085932.jpg?20251119125056",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-11-19 12:46:00",
        "Headline": "M&S insists it's been a hit with customers, but it has certainly caused a stir online - the supermarket is selling beef wellington for just shy of £200. That's quite a bit more than what you'd find at even Fortnum & Mason.",
        "Content": "M&S has defended the price of a £195 beef wellington made by chef Tom Kerridge. Some online are unhappy with the cost of the Collection Fillet of British Beef Wellington, which serves six people - yet despite the price, it's nearly sold out. \"It's not just overspending on Christmas, it's M&S overspending on Christmas\" is what one person said about it. Read all the latest Money news here Another said: \"I think it would be justifiable if it included Tom Kerridge to do the cooking and cleaning up.\" A third asked if the price had anything to do with the recent cyber attack M&S suffered in April: \"M&S trying to recoup some of that cyber attack loss by charging at least twice too much for a bit of fillet.\" Other wellingtons available Fortnum & Mason, known for its high-end offerings, sells a Classic Beef Wellington that serves six to eight people for £120. Charlie Bigham has launched a £30 ready meal beef wellington. And Gordon Ramsay, at two of his restaurants, offers a three-course Beef Wellington Experience costing £95 per person. Read more:WH Smith boss quits after accounting blunderBest and worst parcel delivery companies revealed 'Our best quality wellington ever' An M&S spokesperson told Sky News: \"The M&S Collection Tom Kerridge Beef Wellington has been a big hit with customers - it's selling very well and we only have a few left on our Christmas Food To Order page. \"Serving six people and weighing over 2kg, the hand-butchered British beef fillet is matured over 17 days and hand rolled in portobello mushroom duxelles with silky chicken breast mousse and black truffle as it would be in a restaurant - it's the absolute best quality wellington we've ever created.\" Sky News has contacted Tom Kerridge for comment."
    }
]