[
    {
        "title": "US hails 'tremendous progress' on Ukraine peace plan - but says negotiators 'need more time'",
        "description": "The US secretary of state has hailed a \"tremendous amount of progress\" on peace talks after the US and Ukraine delegations met in Geneva - but said that negotiators would \"need more time\". ",
        "url": "https://news.sky.com/story/us-hails-tremendous-progress-on-ukraine-peace-plan-but-says-negotiators-need-more-time-13474651",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-russia-us-rubio_7090031.jpg?20251123200211",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 21:04:00",
        "Headline": "Marco Rubio, the US secretary of state, says the meetings in Switzerland on Sunday have been \"the most productive and meaningful\" of the peace process so far.",
        "Content": " The US secretary of state has hailed a \"tremendous amount of progress\" on peace talks after the US and Ukraine delegations met in Geneva - but said that negotiators would \"need more time\".  Marco Rubio said the meetings in Switzerland on Sunday have been \"the most productive and meaningful\" of the peace process so far. He said the US was making \"some changes\" to the peace plan, seemingly based on Ukrainian suggestions, \"in the hopes of further narrowing the differences and getting closer to something that both Ukraine and obviously the United States are very comfortable with\". Mr Rubio struck an optimistic tone talking to the media after discussions but was light on the details, saying there was still work to be done.  \"I don't want to declare victory or finality here. There's still some work to be done, but we are much further ahead today at this time than we were when we began this morning and where we were a week ago for certain,\" Mr Rubio said. He also stressed: \"We just need more time than what we have today. I honestly believe we'll get there.\" Sky News' defence analyst Michael Clarke said on the initial US-Russian 28-point peace plan that it was Donald Trump against the world, with maybe only Moscow on his side.  Mr Rubio praised the Ukrainian attitude towards the talks and said Mr Trump was \"quite pleased\" after he previously said in a social media post that Ukraine's leaders had expressed \"ZERO GRATITUDE\" for US efforts. Ukrainian President Volodymyr Zelenskyy said in his nightly address on Sunday that there are signs that \"President Trump's team hears us\". In a news release on Sunday evening, the White House said the day \"marked a significant step forward\". \"Ukrainian representatives stated that, based on the revisions and clarifications presented today, they believe the current draft reflects their national interests and provides credible and enforceable mechanisms to safeguard Ukraine's security in both the near and long term,\" it claimed. International correspondent We've witnessed a day of determined and decidedly frantic diplomacy in this well-heeled city.  Camera crews were perched on street corners and long convoys of black vehicles swept down Geneva's throughfares as the Ukrainians worked hard to keep the Americans on side.  Secretary of state Marco Rubio did not want to go into details at a press \"gaggle\" held at the US Mission this evening, but he seemed to think they had made more progress in the last 96 hours than the previous 10 months combined. The Ukrainian leader Volodymyr Zelenskyy also seemed satisfied enough, posting on Telegram that there were \"signals President Trump's team is hearing us\" after a day of \"numerous meetings and negotiations\". That said, we are a long way from the finish line here - something Rubio acknowledged when he said that any proposal agreed here would have to be handed over to the Russians.  At that point, negotiations to stop the war would surely get tougher. President Putin has shown little or no inclination to stop the conflict thus far. This, then, is the most important reason the Ukrainians seem determined to keep the Americans on side.  European leaders have presented a counter proposal to the widely criticised US-Russian peace plan, with suggestions including a cap on Ukraine's peacetime army and readmitting Moscow into the G8. This will only take place if the plan is agreed to by the US, Russia and Ukraine, and the G7 signs off on the move. Russia was expelled after annexing Crimea in 2014. The counter proposal also includes US guarantees to Ukraine that mirror NATO's Article 5 - the idea that \"an armed attack against one NATO member shall be considered an attack against them all\". Read more:Who actually wrote US-Russian peace plan for Ukraine?In full: Europe's 28-point counter proposal to US-Russia plan The initial peace plan was worked up by the White House and Kremlin without Ukraine's involvement, and it acquiesces to many of Russia's previous demands. It covers a range of issues - from territorial concessions to reconstruction programmes, the future Ukrainian relationship with NATO and the EU, and educational reforms in both Ukraine and Russia."
    },
    {
        "title": "Who actually wrote US-Russian peace plan for Ukraine?",
        "description": "Questions are being raised about the Russia-Ukraine peace plan, after US politicians suggested the proposal's 28 points did not originate from Donald Trump's administration but were put forward by Moscow.",
        "url": "https://news.sky.com/story/who-actually-wrote-us-russian-peace-plan-for-ukraine-13474427",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-rubio_7089728.jpg?20251123160734",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 10:03:00",
        "Headline": "As officials hold discussions in Switzerland, there are claims the 28 points on the peace plan were not from the Trump administration, but a Russian \"wish list\" drafted by a close ally of Vladimir Putin.",
        "Content": "Questions are being raised about the Russia-Ukraine peace plan, after US politicians suggested the proposal's 28 points did not originate from Donald Trump's administration but were put forward by Moscow. Senators, critical of the US president's approach to Ukraine, said they spoke with the US secretary of state Marco Rubio, who told them the plan is a \"wish list\" from the Russians and not a proposal offering Washington's positions. Ukraine war latest: Washington denies backing 'Moscow wish list' The US state department has called that account \"blatantly false\", with Mr Rubio saying that the senators were mistaken and that Washington was responsible for the proposals. The 28-point plan has surprised many for being so favourable to Moscow. Explained: Trump's peace plan in full  Republican senator Mike Rounds is among those who have claimed the plan was not drafted by Washington. \"This administration was not responsible for this release in its current form,\" he said at a security conference in Canada. \"They want to utilise it as a starting point.\" Mr Rounds added: \"It looked more like it was written in Russian to begin with.\" Independent senator Angus King said Mr Rubio told them the plan \"was not the administration's plan\" but a \"essentially the wish list of the Russians\". The senators said they spoke to Mr Rubio after he contacted them while on his way to Geneva for talks on the plan. According to the Reuters news agency, some US officials also said the plan contains material that the US secretary of state has previously rejected and neither he, nor anyone in the state department, was aware of the plan before it was announced. These latest claims have added to growing confusion over who was involved in drawing up the 28 points. European leader asks: 'Who authored the plan?' Poland's Prime Minister Donald Tusk has raised concerns about its origins. On Sunday, he wrote on X: \"It would be good to know for sure who is the author of the plan and where was it created.\" In a post on X, Mr Rubio insisted that \"the peace proposal was authored by the US... but it is also based on previous and ongoing input from Ukraine\". A former adviser to Vladimir Putin had denied that Russia was behind the peace plan. Sergei Markov told Sky News \"it is American\" and the points were a \"very good basis for diplomatic negotiation\". Mr Markov insisted there were \"some positive moods in Russia about it\" but also accused Europe and Ukraine of wanting to continue the war, despite Russia unilaterally launching and pursuing a full-scale invasion of Ukraine.  Read more from Sky News:Peace plan scrutinised at G20Ukraine issued with 'surrender ultimatum'Ukraine and Europe cannot reject plan American special envoy Steve Witkoff and Donald Trump's son-in-law Jared Kushner met Kirill Dmitriev in Miami at the end of October to work on the proposals, according to multiple sources familiar with the matter. Mr Dmitriev, who is a close ally of the Russian president, was blacklisted by the US government in 2022 following Russia's invasion of Ukraine. Trump rows back on demands The US president initially demanded that Ukraine accept the peace plan by Thursday. But he has since rowed back from that position, instead saying the proposal was not his final offer. The plan currently on the table calls for major concessions by Kyiv, including ceding territory to Russia, pledging not to join NATO and abandoning certain weaponry. Ukrainian President Volodymyr Zelenskyy has not rejected the proposals outright, but said he would not betray Ukraine's interests. Meanwhile, Mr Putin has described the plan as the basis of a resolution to the conflict. Separately, Senator Roger Wicker, the Republican chairman of the Senate Armed Services Committee, has been equally dismissive of the proposals. \"This so-called 'peace plan' has real problems, and I am highly sceptical it will achieve peace,\" he said."
    },
    {
        "title": "David Cameron reveals he has been treated for prostate cancer",
        "description": "Former prime minister Lord Cameron has revealed he has been treated for prostate cancer.",
        "url": "https://news.sky.com/story/david-cameron-reveals-he-has-been-treated-for-prostate-cancer-13474658",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cameron-david_7090117.jpg?20251123222144",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-11-23 21:26:00",
        "Headline": "The former PM has shared his health news in a bid to add himself to the growing list of people calling for a targeted screening programme. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Former prime minister Lord Cameron has revealed he has been treated for prostate cancer. The former Tory leader, who was PM from 2010 until 2016, and foreign secretary from November 2023 until last year's general election, went public in an interview with The Times. The 59-year-old joins Olympic cycling champion Sir Chris Hoy, ex-Sky News presenter Dermot Murnaghan and another former PM, Rishi Sunak, in campaigning for better diagnosis and treatment. He has now had the all clear and is cancer-free. Lord Cameron went to the GP for a prostate-specific antigen (PSA) test - which looks for proteins associated with prostate cancer - after his wife Samantha urged him to make an appointment. His result showed his numbers were worryingly high. Recalling the moment when, after a follow-up biopsy, he was told he had cancer, Lord Cameron said: \"You always dread hearing those words. \"And then literally as they're coming out of the doctor's mouth you're thinking, 'Oh, no, he's going to say it. He's going to say it. Oh God, he said it'. Then came the next decision. Do you get treatment? Or do you watch and wait?\" \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Chinese spy alleged to be Prince Andrew's 'close confidant' met with British prime ministers, pictures show\n                 \n                  David Cameron comes out in support of assisted dying bill after previously voting against in 2015\n                 Lord Cameron said his older brother Alexander died of pancreatic cancer at the same age he is now. \"It focuses the mind,\" he said. \"I decided quite quickly. I wanted to move ahead and that's what I did.\" The former prime minister opted to have focal therapy, a treatment which delivers electric pulses via needles to destroy the cancerous cells. He was given a post-treatment MRI scan around the time the US struck a nuclear plant in Iran last year. \"It was the same week as Donald Trump was talking about the bomb damage assessment... I got my own bomb damage assessment,\" he quipped. Explaining why he has shared his diagnosis, Lord Cameron said: \"I've got a platform. This is something we've really got to think about, talk about, and if necessary, act on. \"I want to, as it were, come out. I want to add my name to the long list of people calling for a targeted screening programme.\" Lord Cameron is backing a call by the charity Prostate Cancer Research for the introduction of screening for men at high risk of the disease. \"I don't particularly like discussing my personal intimate health issues, but I feel I ought to,\" he continued. \"Let's be honest. Men are not very good at talking about their health. We tend to put things off. \"We're embarrassed to talk about something like the prostate, because it's so intricately connected with sexual health and everything else. I sort of thought, well, this has happened to you, and you should lend your voice to it. \"I would feel bad if I didn't come forward and say that I've had this experience. I had a scan. It helped me discover something that was wrong. It gave me the chance to deal with it.\" Approximately 12,000 men in the UK die from prostate cancer every year, making it the country's biggest male cancer. Read more:Starmer 'absolutely' wants Rayner back in cabinetChancellor vows to 'grip the cost of living' An ongoing trial is looking at how healthcare professionals could use PSA tests with other assessments to improve screening. Lord Cameron's interview comes ahead of a meeting on Thursday, which could see the National Screening Committee give the green light for the first NHS screening programme for prostate cancer."
    },
    {
        "title": "Eight men arrested after attempted murder of couple in their 60s in Newcastle",
        "description": "Eight men have been arrested in connection with the attempted murder of a couple in Newcastle, police have said.",
        "url": "https://news.sky.com/story/eight-men-arrested-after-attempted-murder-of-couple-in-their-60s-in-newcastle-13474639",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-newcastle-durham-street_7090042.jpg?20251123202041",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 19:53:00",
        "Headline": "A man and a woman in their 60s were found with serious injuries inside a property in Durham Street in the city's Elswick area at around 6.45pm on Friday.",
        "Content": "Eight men have been arrested in connection with the attempted murder of a couple in Newcastle, police have said. A man and a woman in their 60s were found with serious injuries inside a property in Durham Street in the city's Elswick area at around 6.45pm on Friday. The woman sustained serious head injuries and remains in hospital in a critical condition, while the man is in a stable condition. A man in his 30s was initially arrested on suspicion of attempted murder, Northumbria Police said on Saturday, before announcing seven further arrests on Sunday. All eight men remain in custody.  Five of the men - two in their 20s, two in their 30s, and one in his 40s - have been arrested on suspicion of attempted murder. A man in his 50s has been arrested on suspicion of conspiracy to murder, while two other men - one in his 40s and one in his 60s - have been arrested on suspicion of assisting an offender. Detective Chief Inspector Mark Atherton, the senior investigating officer in the case, said: \"Eight suspects are now in custody being questioned, and I would like to reassure our communities extensive inquiries into this serious incident have already been carried out.\" Police are urging anyone with information to come forward and have issued an appeal for people who saw a red Renault Twingo car, which was allegedly stolen. The vehicle is believed to have been parked in the West End of Newcastle between 6.30pm and 8pm on Friday before being found in the Longbenton area on Saturday morning. Read more from Sky News:Murder victim named - as girl, 13, is bailedStarmer wants Rayner back in cabinet \"We would like to thank everyone who has already come forward and as part of our investigation we are keen to hear from anyone who may have seen the Renault Twingo,\" DCI Atherton said. \"Any information - no matter how insignificant it may seem - could prove vital to establishing exactly what happened that evening.\""
    },
    {
        "title": "Royal Navy intercepts Russian warship and tanker",
        "description": "A Royal Navy patrol ship has intercepted two Russian vessels off the UK coast, the Ministry of Defence has said.",
        "url": "https://news.sky.com/story/royal-navy-intercepts-russian-warship-and-tanker-13474438",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hms-severn-russia_7089535.jpg?20251123115650",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 10:38:00",
        "Headline": "HMS Severn intercepted Russian warship RFN Stoikiy and tanker Yelnya off the UK coast in a shadowing operation in the past fortnight, the Ministry of Defence said.",
        "Content": "A Royal Navy patrol ship has intercepted two Russian vessels off the UK coast, the Ministry of Defence has said. It comes after Defence Secretary John Healey announced last Wednesday that lasers from Russian spy ship the Yantar were directed at RAF pilots tracking it, in an attempt to disrupt the monitoring. The MoD said on Sunday that in a \"round-the-clock shadowing operation\", the Royal Navy ship HMS Severn has intercepted Russian warship RFN Stoikiy and tanker Yelnya off the UK coast in the past fortnight.  The Russian vessels sailed through the Dover Strait and westward through the English Channel, the MoD said. HMS Severn later handed over monitoring duties to a NATO ally off the coast of Brittany, France, it said, but continued to watch from a distance and remained ready to respond to any unexpected activity. The ministry added that the UK's armed forces are on patrol \"from the English Channel to the High North\" amid increased Russian activity threatening UK waters. Earlier this week, Russia accused the British government of \"provocative statements\" after the defence secretary warned the Yantar was nearing the UK. At a news conference in Downing Street on Wednesday, Mr Healey said the spy ship was on the edge of British waters north of Scotland, having entered wider UK waters over the last few weeks. He said it was the second time this year the Yantar had been deployed off the UK coast and he claimed it was \"designed for gathering intelligence and mapping our undersea cables\". Read more:Navy could cut off Russian 'spy ship', says ex-MI6 bossBritain warns Russia's spy ship - but is it a hollow threat? Mr Healey said the ship had \"directed lasers\" at pilots of a P-8 surveillance aircraft monitoring its activities - a Russian action he deemed \"deeply dangerous\". In a clear message to Russian President Vladimir Putin, the defence secretary said: \"We see you. We know what you are doing. And we are ready.\" The ministry said while tracking the Yantar, Royal Navy frigate HMS Somerset and other civilian ships in the area \"experienced GPS jamming in a further demonstration of unprofessional behaviour, intended to be disruptive and a nuisance\".  Russia's UK embassy dismissed the accusations and insisted the Yantar is a research ship in international waters. The defence secretary also repeated government plans to increase defence spending and work with NATO allies to bolster European security. And he stressed how plans to buy weapons and build arms factories will create jobs and economic growth. A report by a group of MPs, also released on Wednesday, underlined the scale of the challenge the UK faces. It accused the government of lacking a national plan to defend itself from attack. The Defence Select Committee also warned that Mr Healey, the prime minister and the rest of the cabinet are moving at a \"glacial\" pace to fix the issue and are failing to launch a \"national conversation on defence and security\" - something Sir Keir Starmer had promised last year. The UK has seen a 30% increase in Russian vessels threatening UK waters in the past two years, according to the MoD. But the ministry maintained the UK has a wide range of military options at its disposal to keep UK waters safe. Three RAF P-8 Poseidon aircraft have deployed to Keflavik Air Base in Iceland in the largest overseas deployment of the RAF P-8 fleet so far, the MoD said. They are conducting surveillance operations as part of NATO's collective defence, patrolling for Russian ships and submarines in the North Atlantic and Arctic. The operations come just weeks after HMS Duncan tracked the movements of Russian destroyer Vice Admiral Kulakov, and frigate HMS Iron Duke was dispatched to monitor Russian Kilo-class submarine Novorossiysk."
    },
    {
        "title": "Tributes paid to mental health charity worker - as girl, 13, arrested on suspicion of Swindon murder bailed",
        "description": "A woman who died in Swindon has been remembered as an \"incredible person\" and \"caring\" colleague - as a 13-year-old girl arrested on suspicion of murder was bailed.",
        "url": "https://news.sky.com/story/tribute-paid-to-mental-health-charity-worker-as-girl-13-arrested-on-suspicion-of-murder-bailed-13474507",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sarah-forrester-swindon-murder_7089650.jpg?20251123143708",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 14:55:00",
        "Headline": "Sarah Forrester, who was in her 50s, was described as an \"incredible person\" after she was pronounced dead in Swindon on Friday evening.",
        "Content": "A woman who died in Swindon has been remembered as an \"incredible person\" and \"caring\" colleague - as a 13-year-old girl arrested on suspicion of murder was bailed. Sarah Forrester, 55, was described as a \"kind\" and \"considerate\" after she was pronounced dead at an address in the Wiltshire town on Friday evening. A statement from mental health charity The Kelly Foundation, where Ms Forrester worked, said everyone was \"heartbroken at the sudden loss of our lovely Sarah\". \"She was completely committed to the charity and devoted to her two young children,\" the charity said. \"Sarah was pivotal in the work that we do here at the Kelly Foundation and her loss is a hugely traumatic event, not just for us and her colleagues but more especially for her children and family. \"Sarah was an incredible person, kind, thoughtful, considerate, caring and funny and she embodied everything that we hope our charity is and can be.\" Kerry Marsh, Ms Forrester's neighbour in Swindon and friend of seven years, told Sky News: \"Sarah was a good friend of mine. She was a kind soul who would help anyone. \"She was a great mum and did so much with her children, and I was lucky enough to class her as a friend.\" Stuart Gould, a friend of Ms Forrester who saw her just a few hours before she was found dead, told Sky News: \"I popped in to see her on Friday lunchtime to present her with a box of Maltesers as she has organised an event at the Pinetrees Community Centre for me. \"In my short time of knowing Sarah, she was a beautiful, enthusiastic woman who put others before herself. On the Friday afternoon in question she was talking to two other ladies and helping them. It's so sad.\" Wiltshire Police said the 13-year-old girl arrested on suspicion of murder has been bailed. Read more from Sky News:Royal Navy intercepts Russian warshipRail fares to be frozen for first time in 30 years Detective Chief Superintendent Guy Elkins said: \"Our thoughts are with Sarah's friends and family at this awful time. \"An investigation into her death is being led by our Major Crime Investigation Team and local residents will continue to see increased policing activity in the area. \"A 13-year-old girl arrested on suspicion of murder has been bailed and I can confirm that we are not looking for anyone else in connection with Sarah's death.\" Police have asked people not to speculate about the incident online as this could prejudice the case."
    },
    {
        "title": "Sir Keir Starmer 'absolutely' wants Angela Rayner back in cabinet",
        "description": "Sir Keir Starmer has said he \"absolutely\" wants Angela Rayner back in his cabinet after she resigned for failing to pay the correct amount of stamp duty. ",
        "url": "https://news.sky.com/story/i-like-angie-a-lot-sir-keir-starmer-absolutely-wants-angela-rayner-back-in-cabinet-13474461",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-rayner_7089746.jpg?20251123162005",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 16:59:00",
        "Headline": "The prime minister says his ex-deputy is \"the best example ever\" of social mobility in the UK and that he is still in contact with her.",
        "Content": "Sir Keir Starmer has said he \"absolutely\" wants Angela Rayner back in his cabinet after she resigned for failing to pay the correct amount of stamp duty.  Speaking from the G20 Summit in South Africa, the prime minister told broadcasters his former deputy is \"the best example ever\" of social mobility and he is still in touch with her. Asked if she could make a comeback this side of a general election, Sir Keir said: \"I've always said I want Angela back. Even back in September at the time I said she is going to be a big voice in the Labour movement. \"Do I want Angela back at some stage? Yes absolutely. \"I think she is the best example ever in the United Kingdom of social mobility - going from a pretty challenging childhood to being deputy prime minister of the United Kingdom. She is the story of social mobility above all other stories.\" Asked if he missed having her around, Sir Keir said: \"I’m friends with Angie and I like Angie a lot and we talk a lot. We still do. \"It's always good to have Angela.\" \n                  Starmer's political capital fading fast as he nears tax-raising budget\n                 \n                  G20 still 'really important' despite Donald Trump's absence, says Sir Keir Starmer\n                 \n                  Pro-Palestine activists accused of harassing Labour MP over Israel-Hamas war have convictions thrown out\n                 Ms Rayner's meteoric rise to the top of Labour came after she left school aged 16, pregnant and with no qualifications. She was elected deputy Labour leader by the membership in 2020, and was made deputy prime minister then housing secretary by Sir Keir. She resigned from all of those positions in September, after it emerged she had not paid the higher rate of stamp duty on a second home she bought in Hove, East Sussex, saving her about £40k.  It followed a tearful interview with Sky's political editor Beth Rigby about the \"complex living arrangement\" regarding her first home, which was sold to a trust following her divorce to provide stability for her teenage son, who has lifelong disabilities and is the sole beneficiary of the trust. An investigation by the prime minister ethic's watchdog found she breached the ministerial code by failing to get correct tax advice, but that she acted \"with integrity\". Ms Rayner is still a backbench MP and recently did not rule out a return to the front bench herself - telling the Daily Mirror during a visit to a care centre in her constituency that she had \"not gone away\". Other cabinet ministers have also supported her return. During the Labour Party Conference a few weeks after she resigned, Health Secretary Wes Streeting paid tribute to her work on the Employment Rights Bill and said Labour \"wants her back and needs her back\"."
    },
    {
        "title": "Israel strikes Beirut for first time in months, killing Hezbollah chief of staff",
        "description": "An Israeli airstrike has struck Lebanon's capital Beirut for the first time in months, killing Hezbollah's chief of staff. ",
        "url": "https://news.sky.com/story/israel-strikes-beirut-for-first-time-in-months-saying-it-targeted-hezbollah-chief-of-staff-13474482",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lebanon-beirut_7089602.jpg?20251123135323",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 13:54:00",
        "Headline": "It is the first Israeli airstrike on Beirut since June and comes days before Pope Leo is scheduled to visit Lebanon.",
        "Content": " An Israeli airstrike has struck Lebanon's capital Beirut for the first time in months, killing Hezbollah's chief of staff.  In a statement to the media, Benjamin Netanyahu said on Sunday that Haytham Ali Tabtabai had been \"eliminated\", describing him as \"a master of murders\". \"I thank the IDF and the security forces for carrying out a professional, precise and successful operation today,\" he added. Hezbollah also confirmed the official's death shortly after. Lebanon's Health Ministry has said at least five people were killed and 28 others were wounded in the targeted Israeli strike. Smoke could be seen in the busy Haret Hreik neighbourhood, with one video circulated on social media showing dozens of people crowded around the area of the strike, which appeared to be on an apartment building. Israel did not issue an evacuation warning. Residents told Reuters news agency they heard the roar of warplanes before the blast. Gunshots were fired to disperse the crowds as rescue workers and firefighters reached the damaged building. The Lebanese military cordoned off the area. Who was Hezbollah military leader Haytham Ali Tabtabai?  Haytham Ali Tabtabai had led Hezbollah's elite Radwan Unit. In 2016, the US designated him as a terrorist and offered up to $5m in exchange for information on him. He had been the apparent successor of Ibrahim Aqil, who was killed in Israeli attacks in September 2024 that wiped out much of Hezbollah's senior leadership, including longtime leader Hassan Nasrallah. This was the first Israeli airstrike on Beirut since June and comes days before Pope Leo is scheduled to visit Lebanon. Israeli strikes on southern Lebanon have intensified in recent weeks. Israel says Hezbollah is attempting to rebuild its military capabilities there, which the Lebanese government has denied. Middle East correspondent The killing of Haytham Ali Tabatabai is a blow to Hezbollah and also a warning that, a year after the ceasefire came into effect, it is now under huge strain. Israel does not believe that either Lebanon or Hezbollah have lived up to the promises made, and that far from disarming, Hezbollah is now building up its resources once more. Tabatabai, it claims, was the person responsible for leading that rearmament. For its part, Lebanon insists there is a viable disarmament mechanism in place that Israel is ignoring.  This attack, it insists, is proof that Israel doesn't care about the rules. It's worth reiterating that Hezbollah - which Britain, America and others consider a terrorist organisation - does not run Lebanon. It does, however, wield considerable power in the Lebanese parliament and across the country, particularly in the south, where Lebanon borders Israel.  And Hezbollah's military strength is bolstered by the support of Iran. So what happens next? If Israel believes that Hezbollah is rearming, and that its residents in the north face a renewed threat, it will inevitably launch further reprisals.  Hezbollah, too, may feel obliged to respond, either with rockets fired into Israel or by targeting overseas sites that are linked to either Israel or Judaism. As in Gaza, there is a ceasefire in place, but that doesn't necessarily mean the firing stops. And as long as the United States will tolerate Israel's actions, then Benjamin Netanyahu will feel at liberty to continue. Mr Netanyahu said in his statement on Sunday evening: \"The policy I am leading is absolutely clear: Under my leadership, the State of Israel will not allow Hezbollah to rebuild its power, and we will not allow it to once again pose a threat to the State of Israel.\" Hezbollah is one of the most heavily armed non-state groups in the world and regarded as an Iranian proxy force. It is a sworn enemy of Israel and has openly called for the destruction of the \"Zionist regime in Palestine\". More from Sky News:The Israel-Hezbollah ceasefire explainedInside a Jordan warehouse full of Gaza aid Israel has accused Hezbollah of trying to rearm since a US-backed ceasefire last year. The militant group says it has abided by requirements for it to end its military presence near the Lebanon-Israel border and for the Lebanese army to deploy there. Lebanon and United Nations peacekeepers have criticised the ongoing Israeli attacks, accusing them of violating the ceasefire agreement."
    },
    {
        "title": "Hundreds protest against Crowborough army barracks plan for asylum seekers",
        "description": "Hundreds of people have protested against plans to move asylum seekers to an army training camp - as speakers encouraged people to \"form patrols\" and stop paying council tax.",
        "url": "https://news.sky.com/story/hundreds-protest-against-crowborough-army-barracks-plan-for-asylum-seekers-13474553",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-crowborough-asylum_7089772.jpg?20251123163959",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-23 16:34:00",
        "Headline": "Protesters marched through the East Sussex town after the camp, which can house up to 540 people, was offered up by the Ministry of Defence.",
        "Content": " Hundreds of people have protested against plans to move asylum seekers to an army training camp - as speakers encouraged people to \"form patrols\" and stop paying council tax. Campaigners marched through the streets of Crowborough, East Sussex, after Crowborough Training Camp, which can house up to 540 men, was offered to the Home Office by the Ministry of Defence for a period of 12 months. It has been offered along with Cameron Barracks in Inverness as part of the government's bid to close asylum hotels. Sunday's protest, which saw participants chanting \"send them home\" as they carried signs and flags, was the second of three organised by Crowborough residents.  Wealden District Council has backed a motion to formally oppose the scheme. Proposing the motion at a council meeting in November, council leader James Partridge said: \"There has been a strong reaction against the proposals from many people who live in Crowborough. \n                  Britain's immigration system changes explained amid 'biggest shake-up' in 50 years\n                 \n                  A Danish style asylum system? How the UK and Denmark's immigration policies compare\n                 \n                  More children to face deportation under government's asylum crackdown\n                 \"They are justifiably very worried about what would happen if 540 single men arrive to stay in the town with very little to do all day in accommodation which is not suitable. \"The risks are obvious, and the information about mitigations provided so far by the Home Office has not allayed people's fears.\" The government has said mandatory security and criminality checks will be carried out on all asylum seekers using biometric data, and the site will have 24-hour security. A spokeswoman for Sussex Police said: \"A planned peaceful protest took place in Crowborough on Sunday morning. There were no arrests.\""
    },
    {
        "title": "Royal Navy intercepts Russian warship and tanker",
        "description": "A Royal Navy patrol ship has intercepted two Russian vessels off the UK coast, the Ministry of Defence has said.",
        "url": "https://news.sky.com/story/royal-navy-intercepts-russian-warship-and-tanker-13474438",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hms-severn-russia_7089535.jpg?20251123115650",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 10:38:00",
        "Headline": "HMS Severn intercepted Russian warship RFN Stoikiy and tanker Yelnya off the UK coast in a shadowing operation in the past fortnight, the Ministry of Defence said.",
        "Content": "A Royal Navy patrol ship has intercepted two Russian vessels off the UK coast, the Ministry of Defence has said. It comes after Defence Secretary John Healey announced last Wednesday that lasers from Russian spy ship the Yantar were directed at RAF pilots tracking it, in an attempt to disrupt the monitoring. The MoD said on Sunday that in a \"round-the-clock shadowing operation\", the Royal Navy ship HMS Severn has intercepted Russian warship RFN Stoikiy and tanker Yelnya off the UK coast in the past fortnight.  The Russian vessels sailed through the Dover Strait and westward through the English Channel, the MoD said. HMS Severn later handed over monitoring duties to a NATO ally off the coast of Brittany, France, it said, but continued to watch from a distance and remained ready to respond to any unexpected activity. The ministry added that the UK's armed forces are on patrol \"from the English Channel to the High North\" amid increased Russian activity threatening UK waters. Earlier this week, Russia accused the British government of \"provocative statements\" after the defence secretary warned the Yantar was nearing the UK. At a news conference in Downing Street on Wednesday, Mr Healey said the spy ship was on the edge of British waters north of Scotland, having entered wider UK waters over the last few weeks. He said it was the second time this year the Yantar had been deployed off the UK coast and he claimed it was \"designed for gathering intelligence and mapping our undersea cables\". Read more:Navy could cut off Russian 'spy ship', says ex-MI6 bossBritain warns Russia's spy ship - but is it a hollow threat? Mr Healey said the ship had \"directed lasers\" at pilots of a P-8 surveillance aircraft monitoring its activities - a Russian action he deemed \"deeply dangerous\". In a clear message to Russian President Vladimir Putin, the defence secretary said: \"We see you. We know what you are doing. And we are ready.\" The ministry said while tracking the Yantar, Royal Navy frigate HMS Somerset and other civilian ships in the area \"experienced GPS jamming in a further demonstration of unprofessional behaviour, intended to be disruptive and a nuisance\".  Russia's UK embassy dismissed the accusations and insisted the Yantar is a research ship in international waters. The defence secretary also repeated government plans to increase defence spending and work with NATO allies to bolster European security. And he stressed how plans to buy weapons and build arms factories will create jobs and economic growth. A report by a group of MPs, also released on Wednesday, underlined the scale of the challenge the UK faces. It accused the government of lacking a national plan to defend itself from attack. The Defence Select Committee also warned that Mr Healey, the prime minister and the rest of the cabinet are moving at a \"glacial\" pace to fix the issue and are failing to launch a \"national conversation on defence and security\" - something Sir Keir Starmer had promised last year. The UK has seen a 30% increase in Russian vessels threatening UK waters in the past two years, according to the MoD. But the ministry maintained the UK has a wide range of military options at its disposal to keep UK waters safe. Three RAF P-8 Poseidon aircraft have deployed to Keflavik Air Base in Iceland in the largest overseas deployment of the RAF P-8 fleet so far, the MoD said. They are conducting surveillance operations as part of NATO's collective defence, patrolling for Russian ships and submarines in the North Atlantic and Arctic. The operations come just weeks after HMS Duncan tracked the movements of Russian destroyer Vice Admiral Kulakov, and frigate HMS Iron Duke was dispatched to monitor Russian Kilo-class submarine Novorossiysk."
    },
    {
        "title": "David Cameron reveals he has been treated for prostate cancer",
        "description": "Former prime minister Lord Cameron has revealed he has been treated for prostate cancer.",
        "url": "https://news.sky.com/story/david-cameron-reveals-he-has-been-treated-for-prostate-cancer-13474658",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cameron-david_7090117.jpg?20251123222144",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-11-23 21:26:00",
        "Headline": "The former PM has shared his health news in a bid to add himself to the growing list of people calling for a targeted screening programme. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Former prime minister Lord Cameron has revealed he has been treated for prostate cancer. The former Tory leader, who was PM from 2010 until 2016, and foreign secretary from November 2023 until last year's general election, went public in an interview with The Times. The 59-year-old joins Olympic cycling champion Sir Chris Hoy, ex-Sky News presenter Dermot Murnaghan and another former PM, Rishi Sunak, in campaigning for better diagnosis and treatment. He has now had the all clear and is cancer-free. Lord Cameron went to the GP for a prostate-specific antigen (PSA) test - which looks for proteins associated with prostate cancer - after his wife Samantha urged him to make an appointment. His result showed his numbers were worryingly high. Recalling the moment when, after a follow-up biopsy, he was told he had cancer, Lord Cameron said: \"You always dread hearing those words. \"And then literally as they're coming out of the doctor's mouth you're thinking, 'Oh, no, he's going to say it. He's going to say it. Oh God, he said it'. Then came the next decision. Do you get treatment? Or do you watch and wait?\" \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Chinese spy alleged to be Prince Andrew's 'close confidant' met with British prime ministers, pictures show\n                 \n                  David Cameron comes out in support of assisted dying bill after previously voting against in 2015\n                 Lord Cameron said his older brother Alexander died of pancreatic cancer at the same age he is now. \"It focuses the mind,\" he said. \"I decided quite quickly. I wanted to move ahead and that's what I did.\" The former prime minister opted to have focal therapy, a treatment which delivers electric pulses via needles to destroy the cancerous cells. He was given a post-treatment MRI scan around the time the US struck a nuclear plant in Iran last year. \"It was the same week as Donald Trump was talking about the bomb damage assessment... I got my own bomb damage assessment,\" he quipped. Explaining why he has shared his diagnosis, Lord Cameron said: \"I've got a platform. This is something we've really got to think about, talk about, and if necessary, act on. \"I want to, as it were, come out. I want to add my name to the long list of people calling for a targeted screening programme.\" Lord Cameron is backing a call by the charity Prostate Cancer Research for the introduction of screening for men at high risk of the disease. \"I don't particularly like discussing my personal intimate health issues, but I feel I ought to,\" he continued. \"Let's be honest. Men are not very good at talking about their health. We tend to put things off. \"We're embarrassed to talk about something like the prostate, because it's so intricately connected with sexual health and everything else. I sort of thought, well, this has happened to you, and you should lend your voice to it. \"I would feel bad if I didn't come forward and say that I've had this experience. I had a scan. It helped me discover something that was wrong. It gave me the chance to deal with it.\" Approximately 12,000 men in the UK die from prostate cancer every year, making it the country's biggest male cancer. Read more:Starmer 'absolutely' wants Rayner back in cabinetChancellor vows to 'grip the cost of living' An ongoing trial is looking at how healthcare professionals could use PSA tests with other assessments to improve screening. Lord Cameron's interview comes ahead of a meeting on Thursday, which could see the National Screening Committee give the green light for the first NHS screening programme for prostate cancer."
    },
    {
        "title": "Eight men arrested after attempted murder of couple in their 60s in Newcastle",
        "description": "Eight men have been arrested in connection with the attempted murder of a couple in Newcastle, police have said.",
        "url": "https://news.sky.com/story/eight-men-arrested-after-attempted-murder-of-couple-in-their-60s-in-newcastle-13474639",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-newcastle-durham-street_7090042.jpg?20251123202041",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 19:53:00",
        "Headline": "A man and a woman in their 60s were found with serious injuries inside a property in Durham Street in the city's Elswick area at around 6.45pm on Friday.",
        "Content": "Eight men have been arrested in connection with the attempted murder of a couple in Newcastle, police have said. A man and a woman in their 60s were found with serious injuries inside a property in Durham Street in the city's Elswick area at around 6.45pm on Friday. The woman sustained serious head injuries and remains in hospital in a critical condition, while the man is in a stable condition. A man in his 30s was initially arrested on suspicion of attempted murder, Northumbria Police said on Saturday, before announcing seven further arrests on Sunday. All eight men remain in custody.  Five of the men - two in their 20s, two in their 30s, and one in his 40s - have been arrested on suspicion of attempted murder. A man in his 50s has been arrested on suspicion of conspiracy to murder, while two other men - one in his 40s and one in his 60s - have been arrested on suspicion of assisting an offender. Detective Chief Inspector Mark Atherton, the senior investigating officer in the case, said: \"Eight suspects are now in custody being questioned, and I would like to reassure our communities extensive inquiries into this serious incident have already been carried out.\" Police are urging anyone with information to come forward and have issued an appeal for people who saw a red Renault Twingo car, which was allegedly stolen. The vehicle is believed to have been parked in the West End of Newcastle between 6.30pm and 8pm on Friday before being found in the Longbenton area on Saturday morning. Read more from Sky News:Murder victim named - as girl, 13, is bailedStarmer wants Rayner back in cabinet \"We would like to thank everyone who has already come forward and as part of our investigation we are keen to hear from anyone who may have seen the Renault Twingo,\" DCI Atherton said. \"Any information - no matter how insignificant it may seem - could prove vital to establishing exactly what happened that evening.\""
    },
    {
        "title": "'A real moral failing': Manchester synagogue members still don't feel safe weeks after attack",
        "description": "Sitting on the benches inside the synagogue, just metres from where last month's attack in Manchester began to unfold, chairman Alan Levy remembers it like it was yesterday.",
        "url": "https://news.sky.com/story/a-real-moral-failing-manchester-synagogue-members-still-dont-feel-safe-weeks-after-attack-13474557",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-manchester-synagogue_7089850.jpg?20251123172335",
        "type": "UK",
        "Author": "Katie Barnfield",
        "Date Published": "2025-11-23 16:36:00",
        "Headline": "Alan Levy, who was working security when Jihad al Shamie attacked the synagogue last month, says it is \"difficult to say we feel safe\".",
        "Content": "\n          North of England correspondent\n        Sitting on the benches inside the synagogue, just metres from where last month's attack in Manchester began to unfold, chairman Alan Levy remembers it like it was yesterday. Working security on the day, he was the first to sound the alarm - running to barricade the doors as Jihad al Shamie came towards them, trying to get inside. He points to a seat a few rows behind us - and tells us it belonged to Adrian Daulby, one of the two men who lost their lives that day.   \"I came running in here to make sure all the doors were closed - but that door was actually open,\" he says, pointing to a fire exit at the back of the main room. Alan remembers how Adrian Daulby \"leapt up\" from his seat to close it, and then \"ran the length of the synagogue\" to help them hold shut the front doors - where he was struck accidentally by a police bullet. \"When I look at that seat now - and Adrian isn't sitting there - it makes me so sad,\" he says. \"It's difficult to say we feel safe, really. It's still so raw.\" Seven weeks on from the attack, the Heaton Park synagogue has opened its doors for Mitzvah Day, a yearly event focused on helping those in need. Walking through the front doors, one of the first things you see are rows of sympathy cards lining the shelves inside, filled with handwritten notes of support. The event's organiser, Geraldine Simon, shows me two baby grows that were knitted by a local woman who said she had no idea how to support them after the attack - but wanted to try. \"She wrote us a note asking us to give them to someone who needs them, saying 'tell the mother every stitch was knitted with love',\" Geraldine says. \"That's an example of the kind of outpouring of support we've had. It means everything to us.\" Although the community nearby rallied around them after the attack, both Alan and his son Marc - head of Manchester's Jewish Representative Council - say that despite promises at the time, they and other members of the synagogue still feel unsafe almost two months on. \"The fact is, we're sat here now inside a synagogue behind gates with security outside,\" Marc says. \"And the fact that's still needed is a real moral failing. \"We really hoped the attack would be a sort of line in the sand - but it became apparent very quickly that probably wasn't going to be the case.\" He says that despite more security and an increased presence from Greater Manchester Police - which has now agreed to fund repairs inside the synagogue after officers had to break in on the day of the attack - they feel the threat of antisemitism has not died down. \"We make another plea in the aftermath of our friends and family being targeted - people need to be careful with their language,\" Marc says. Read more:Attack victims' cause of death given at inquestJamie Al Shamie died of multiple gunshot wounds'People shouldn't be scared to go to synagogue,' victim says He adds: \"Questions are being asked among our community about whether our children and grandchildren will still be as welcome in this country as our family have been for generations now. \"And the answer is, unequivocally - no they won't be.\""
    },
    {
        "title": "Hundreds protest against Crowborough army barracks plan for asylum seekers",
        "description": "Hundreds of people have protested against plans to move asylum seekers to an army training camp - as speakers encouraged people to \"form patrols\" and stop paying council tax.",
        "url": "https://news.sky.com/story/hundreds-protest-against-crowborough-army-barracks-plan-for-asylum-seekers-13474553",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-crowborough-asylum_7089772.jpg?20251123163959",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 16:34:00",
        "Headline": "Protesters marched through the East Sussex town after the camp, which can house up to 540 people, was offered up by the Ministry of Defence.",
        "Content": " Hundreds of people have protested against plans to move asylum seekers to an army training camp - as speakers encouraged people to \"form patrols\" and stop paying council tax. Campaigners marched through the streets of Crowborough, East Sussex, after Crowborough Training Camp, which can house up to 540 men, was offered to the Home Office by the Ministry of Defence for a period of 12 months. It has been offered along with Cameron Barracks in Inverness as part of the government's bid to close asylum hotels. Sunday's protest, which saw participants chanting \"send them home\" as they carried signs and flags, was the second of three organised by Crowborough residents.  Wealden District Council has backed a motion to formally oppose the scheme. Proposing the motion at a council meeting in November, council leader James Partridge said: \"There has been a strong reaction against the proposals from many people who live in Crowborough. \n                  Britain's immigration system changes explained amid 'biggest shake-up' in 50 years\n                 \n                  A Danish style asylum system? How the UK and Denmark's immigration policies compare\n                 \n                  More children to face deportation under government's asylum crackdown\n                 \"They are justifiably very worried about what would happen if 540 single men arrive to stay in the town with very little to do all day in accommodation which is not suitable. \"The risks are obvious, and the information about mitigations provided so far by the Home Office has not allayed people's fears.\" The government has said mandatory security and criminality checks will be carried out on all asylum seekers using biometric data, and the site will have 24-hour security. A spokeswoman for Sussex Police said: \"A planned peaceful protest took place in Crowborough on Sunday morning. There were no arrests.\""
    },
    {
        "title": "Sir Keir Starmer 'absolutely' wants Angela Rayner back in cabinet",
        "description": "Sir Keir Starmer has said he \"absolutely\" wants Angela Rayner back in his cabinet after she resigned for failing to pay the correct amount of stamp duty. ",
        "url": "https://news.sky.com/story/i-like-angie-a-lot-sir-keir-starmer-absolutely-wants-angela-rayner-back-in-cabinet-13474461",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-rayner_7089746.jpg?20251123162005",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 16:59:00",
        "Headline": "The prime minister says his ex-deputy is \"the best example ever\" of social mobility in the UK and that he is still in contact with her.",
        "Content": "Sir Keir Starmer has said he \"absolutely\" wants Angela Rayner back in his cabinet after she resigned for failing to pay the correct amount of stamp duty.  Speaking from the G20 Summit in South Africa, the prime minister told broadcasters his former deputy is \"the best example ever\" of social mobility and he is still in touch with her. Asked if she could make a comeback this side of a general election, Sir Keir said: \"I've always said I want Angela back. Even back in September at the time I said she is going to be a big voice in the Labour movement. \"Do I want Angela back at some stage? Yes absolutely. \"I think she is the best example ever in the United Kingdom of social mobility - going from a pretty challenging childhood to being deputy prime minister of the United Kingdom. She is the story of social mobility above all other stories.\" Asked if he missed having her around, Sir Keir said: \"I’m friends with Angie and I like Angie a lot and we talk a lot. We still do. \"It's always good to have Angela.\" \n                  Starmer's political capital fading fast as he nears tax-raising budget\n                 \n                  G20 still 'really important' despite Donald Trump's absence, says Sir Keir Starmer\n                 \n                  Pro-Palestine activists accused of harassing Labour MP over Israel-Hamas war have convictions thrown out\n                 Ms Rayner's meteoric rise to the top of Labour came after she left school aged 16, pregnant and with no qualifications. She was elected deputy Labour leader by the membership in 2020, and was made deputy prime minister then housing secretary by Sir Keir. She resigned from all of those positions in September, after it emerged she had not paid the higher rate of stamp duty on a second home she bought in Hove, East Sussex, saving her about £40k.  It followed a tearful interview with Sky's political editor Beth Rigby about the \"complex living arrangement\" regarding her first home, which was sold to a trust following her divorce to provide stability for her teenage son, who has lifelong disabilities and is the sole beneficiary of the trust. An investigation by the prime minister ethic's watchdog found she breached the ministerial code by failing to get correct tax advice, but that she acted \"with integrity\". Ms Rayner is still a backbench MP and recently did not rule out a return to the front bench herself - telling the Daily Mirror during a visit to a care centre in her constituency that she had \"not gone away\". Other cabinet ministers have also supported her return. During the Labour Party Conference a few weeks after she resigned, Health Secretary Wes Streeting paid tribute to her work on the Employment Rights Bill and said Labour \"wants her back and needs her back\"."
    },
    {
        "title": "Tributes paid to mental health charity worker - as girl, 13, arrested on suspicion of Swindon murder bailed",
        "description": "A woman who died in Swindon has been remembered as an \"incredible person\" and \"caring\" colleague - as a 13-year-old girl arrested on suspicion of murder was bailed.",
        "url": "https://news.sky.com/story/tribute-paid-to-mental-health-charity-worker-as-girl-13-arrested-on-suspicion-of-murder-bailed-13474507",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sarah-forrester-swindon-murder_7089650.jpg?20251123143708",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 14:55:00",
        "Headline": "Sarah Forrester, who was in her 50s, was described as an \"incredible person\" after she was pronounced dead in Swindon on Friday evening.",
        "Content": "A woman who died in Swindon has been remembered as an \"incredible person\" and \"caring\" colleague - as a 13-year-old girl arrested on suspicion of murder was bailed. Sarah Forrester, 55, was described as a \"kind\" and \"considerate\" after she was pronounced dead at an address in the Wiltshire town on Friday evening. A statement from mental health charity The Kelly Foundation, where Ms Forrester worked, said everyone was \"heartbroken at the sudden loss of our lovely Sarah\". \"She was completely committed to the charity and devoted to her two young children,\" the charity said. \"Sarah was pivotal in the work that we do here at the Kelly Foundation and her loss is a hugely traumatic event, not just for us and her colleagues but more especially for her children and family. \"Sarah was an incredible person, kind, thoughtful, considerate, caring and funny and she embodied everything that we hope our charity is and can be.\" Kerry Marsh, Ms Forrester's neighbour in Swindon and friend of seven years, told Sky News: \"Sarah was a good friend of mine. She was a kind soul who would help anyone. \"She was a great mum and did so much with her children, and I was lucky enough to class her as a friend.\" Stuart Gould, a friend of Ms Forrester who saw her just a few hours before she was found dead, told Sky News: \"I popped in to see her on Friday lunchtime to present her with a box of Maltesers as she has organised an event at the Pinetrees Community Centre for me. \"In my short time of knowing Sarah, she was a beautiful, enthusiastic woman who put others before herself. On the Friday afternoon in question she was talking to two other ladies and helping them. It's so sad.\" Wiltshire Police said the 13-year-old girl arrested on suspicion of murder has been bailed. Read more from Sky News:Royal Navy intercepts Russian warshipRail fares to be frozen for first time in 30 years Detective Chief Superintendent Guy Elkins said: \"Our thoughts are with Sarah's friends and family at this awful time. \"An investigation into her death is being led by our Major Crime Investigation Team and local residents will continue to see increased policing activity in the area. \"A 13-year-old girl arrested on suspicion of murder has been bailed and I can confirm that we are not looking for anyone else in connection with Sarah's death.\" Police have asked people not to speculate about the incident online as this could prejudice the case."
    },
    {
        "title": "Ban on Maccabi Tel Aviv fans for Aston Villa game 'based on false hooligan claims'",
        "description": "West Midlands Police has defended the ban on Maccabi Tel Aviv fans attending an Aston Villa match after it was claimed that false intelligence was used.",
        "url": "https://news.sky.com/story/ban-on-maccabi-tel-aviv-fans-for-aston-villa-game-based-on-false-hooligan-claims-13474429",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-villa-maccabi_7089489.jpg?20251123102514",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 10:12:00",
        "Headline": "According to The Sunday Times, Dutch police questioned claims in a confidential dossier from West Midlands Police that was used in the ban decision.",
        "Content": "West Midlands Police has defended the ban on Maccabi Tel Aviv fans attending an Aston Villa match after it was claimed that false intelligence was used. Supporters of the Israeli club were barred from the Europa League fixture at Villa Park on 6 November. West Midlands Police chief superintendent Tom Joyce told Sky News before the game that a \"section\" of Maccabi's fanbase engaged in \"quite significant levels of hooliganism\".  According to The Sunday Times, West Midlands Police claimed in a confidential dossier that when Maccabi played Ajax in Amsterdam last year, Israeli fans threw \"innocent members of the public into the river\", and added that between 500 and 600 supporters had \"intentionally targeted Muslim communities\". The report also said 5,000 Dutch police officers had been deployed in response. However, the Netherlands' national police force has questioned the claims, reportedly describing information cited by its British officers as \"not true\" and in some instances obviously inaccurate. Sebastiaan Meijer, a spokesman for the Amsterdam division, told The Sunday Times that he was \"surprised\" by allegations in the West Midlands Police report, which had linked 200 travelling supporters to the Israel Defence Forces (IDF). Mr Meijer denied that his force had such intelligence, adding that the claim was meaningless given the country had a policy of conscription. Also, Mr Meijer said that Amsterdam's force \"does not recognise\" the claim in the British report, attributed to Dutch law enforcement, that Israelis were \"highly organised, skilled fighters with a serious desire and will to fight with police and opposing groups\".  The Dutch police added that the only known case of a fan being in the river appeared to involve a Maccabi supporter. While being filmed, he was told he could leave the water on the condition that he said \"Free Palestine\". In an interview with Sky News before the game, West Midlands Police referenced disorder when Maccabi played Ajax in Amsterdam last November. Mr Joyce said ahead of the Villa Park match: \"We've had examples where a section of Maccabi fans were targeting people not involved in football matches, and certainly we had an incident in Amsterdam last year which has informed some of our decision-making. \"So it is exclusively a decision we made on the basis of the behaviour of a sub-section of Maccabi fans, but all the reaction that could occur obviously formed part of that as well.\" Maccabi's visit to Birmingham came amid heightened tensions due to Israel's war on Hamas in Gaza. A safety advisory group (SAG) recommended that Maccabi fans should be banned from attending the fixture on the advice of the police. The ban drew criticism, and Prime Minister Sir Keir Starmer said it was the \"wrong decision\". Read more:Eleven arrested during night of protestsMaccabi boss hits out at 'blatant falsehoods' West Midland Police's statement in full Following The Sunday Times report, West Midlands Police stood by its \"information and intelligence\", adding that the \"Maccabi Fanatics... posed a credible threat to safety\". In a statement to Sky News, the force said: \"West Midlands Police's evaluation was based primarily on information and intelligence and had public safety at its heart. \"We assessed the fixture between Ajax and Maccabi Tel Aviv in Amsterdam as having involved significant public disorder. \"We met with Dutch police on 1 October, where information relating to that 2024 fixture was shared with us. \"Informed by information and intelligence, we concluded that Maccabi Tel Aviv supporters - specifically the subgroup known as the Maccabi Fanatics - posed a credible threat to public safety. \"The submission made to the SAG safety advisory group was based on information and intelligence which helped shape understanding of the risks. \"West Midlands Police commissioned a peer review, which was conducted by UKFPU [United Kingdom Policing Unit], the NPCC [National Police Chiefs' Council] and subject matter experts. \"This review, carried out on 20 October, fully endorsed the force's approach and decision-making. \"We are satisfied that the policing strategy and operational plan was effective, proportionate, and maintained the city's reputation as a safe and welcoming place for everyone.\" Sky News has approached Dutch police for comment."
    },
    {
        "title": "Titanic couple's pocket watch sells for record £1.78m",
        "description": "A gold pocket watch that belonged to an elderly couple who drowned as the Titanic sunk has sold for a record-breaking &#163;1.78m at auction.",
        "url": "https://news.sky.com/story/titanic-couples-pocket-watch-sells-for-record-163178m-13474341",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-titanic-auction_7089267.jpg?20251123053607",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-23 05:19:00",
        "Headline": "The 18-carat Jules Jurgensen engraved watch was owned by first class passenger Isidor Straus, who died when the ship sank in April 1912.",
        "Content": "A gold pocket watch that belonged to an elderly couple who drowned as the Titanic sunk has sold for a record-breaking £1.78m at auction. The 18-carat Jules Jurgensen engraved watch was owned by first class passenger Isidor Straus, who died when the ship sank in April 1912. He and his wife Ida were portrayed in the film Titanic as a couple who held each other as the ship went down. When he was offered a seat on a lifeboat due to his age, he replied that he would not go before other men. His wife refused to leave him, and the couple were last seen alive sitting on deckchairs, facing fate by each other's side. They were among very few first class passengers to perish in the disaster. The watch was recovered from Mr Straus's body along with other personal items and returned to his family. \n                  What happened to the Titan submersible?\n                 \n                  Watch gifted to captain who saved 700 Titanic passengers sells for record fee\n                 \n                  Titan sub owner's ethos 'was to make money', OceanGate ex-director tells hearing\n                 It had been a present for his 43rd birthday in 1888 - the same year he became a partner in the New York department store, Macy's. Read more from Sky News:TikTok: Teens' safety not at risk from AI moderationJohnson hits out at COVID inquiry report The watch, which had remained in the couple's family, was sold at Henry Aldridge & Son Auctioneers in Devizes, Wiltshire. The £1.78m for the item is the highest amount ever paid for Titanic memorabilia, according to the company. A letter written by Mrs Straus on Titanic stationery and posted while onboard the ship fetched £100,000. The previous record was set last year when another gold pocket watch presented to the captain of a boat that rescued over 700 passengers from the liner sold for £1.56m."
    },
    {
        "title": "US hails 'tremendous progress' on Ukraine peace plan - but says negotiators 'need more time'",
        "description": "The US secretary of state has hailed a \"tremendous amount of progress\" on peace talks after the US and Ukraine delegations met in Geneva - but said that negotiators would \"need more time\". ",
        "url": "https://news.sky.com/story/us-hails-tremendous-progress-on-ukraine-peace-plan-but-says-negotiators-need-more-time-13474651",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-russia-us-rubio_7090031.jpg?20251123200211",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 21:04:00",
        "Headline": "Marco Rubio, the US secretary of state, says the meetings in Switzerland on Sunday have been \"the most productive and meaningful\" of the peace process so far.",
        "Content": " The US secretary of state has hailed a \"tremendous amount of progress\" on peace talks after the US and Ukraine delegations met in Geneva - but said that negotiators would \"need more time\".  Marco Rubio said the meetings in Switzerland on Sunday have been \"the most productive and meaningful\" of the peace process so far. He said the US was making \"some changes\" to the peace plan, seemingly based on Ukrainian suggestions, \"in the hopes of further narrowing the differences and getting closer to something that both Ukraine and obviously the United States are very comfortable with\". Mr Rubio struck an optimistic tone talking to the media after discussions but was light on the details, saying there was still work to be done.  \"I don't want to declare victory or finality here. There's still some work to be done, but we are much further ahead today at this time than we were when we began this morning and where we were a week ago for certain,\" Mr Rubio said. He also stressed: \"We just need more time than what we have today. I honestly believe we'll get there.\" Sky News' defence analyst Michael Clarke said on the initial US-Russian 28-point peace plan that it was Donald Trump against the world, with maybe only Moscow on his side.  Mr Rubio praised the Ukrainian attitude towards the talks and said Mr Trump was \"quite pleased\" after he previously said in a social media post that Ukraine's leaders had expressed \"ZERO GRATITUDE\" for US efforts. Ukrainian President Volodymyr Zelenskyy said in his nightly address on Sunday that there are signs that \"President Trump's team hears us\". In a news release on Sunday evening, the White House said the day \"marked a significant step forward\". \"Ukrainian representatives stated that, based on the revisions and clarifications presented today, they believe the current draft reflects their national interests and provides credible and enforceable mechanisms to safeguard Ukraine's security in both the near and long term,\" it claimed. International correspondent We've witnessed a day of determined and decidedly frantic diplomacy in this well-heeled city.  Camera crews were perched on street corners and long convoys of black vehicles swept down Geneva's throughfares as the Ukrainians worked hard to keep the Americans on side.  Secretary of state Marco Rubio did not want to go into details at a press \"gaggle\" held at the US Mission this evening, but he seemed to think they had made more progress in the last 96 hours than the previous 10 months combined. The Ukrainian leader Volodymyr Zelenskyy also seemed satisfied enough, posting on Telegram that there were \"signals President Trump's team is hearing us\" after a day of \"numerous meetings and negotiations\". That said, we are a long way from the finish line here - something Rubio acknowledged when he said that any proposal agreed here would have to be handed over to the Russians.  At that point, negotiations to stop the war would surely get tougher. President Putin has shown little or no inclination to stop the conflict thus far. This, then, is the most important reason the Ukrainians seem determined to keep the Americans on side.  European leaders have presented a counter proposal to the widely criticised US-Russian peace plan, with suggestions including a cap on Ukraine's peacetime army and readmitting Moscow into the G8. This will only take place if the plan is agreed to by the US, Russia and Ukraine, and the G7 signs off on the move. Russia was expelled after annexing Crimea in 2014. The counter proposal also includes US guarantees to Ukraine that mirror NATO's Article 5 - the idea that \"an armed attack against one NATO member shall be considered an attack against them all\". Read more:Who actually wrote US-Russian peace plan for Ukraine?In full: Europe's 28-point counter proposal to US-Russia plan The initial peace plan was worked up by the White House and Kremlin without Ukraine's involvement, and it acquiesces to many of Russia's previous demands. It covers a range of issues - from territorial concessions to reconstruction programmes, the future Ukrainian relationship with NATO and the EU, and educational reforms in both Ukraine and Russia."
    },
    {
        "title": "Fierce battle for frontline towns where Ukraine's soldiers are surrounded",
        "description": "Footage geolocated by Sky News showed Russian soldiers walking through the Shakhtarskyi neighbourhood on the outskirts of Pokrovsk on Thursday.",
        "url": "https://news.sky.com/story/the-battle-for-frontline-towns-where-ukraines-soldiers-are-surrounded-13473694",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-teaser-ukraine_7087820.jpg?20251121183710",
        "type": "World",
        "Author": "Annoa Abekah-Mensah and Sophia Massam, Data and Forensics team",
        "Date Published": "2025-11-23 00:01:00",
        "Headline": "With a peace plan put to President Zelenskyy, the Ukrainian towns of Pokrovsk and Myrnohrad - fiercely defended throughout the war - risk being encircled by Russian forces advancing in the Donbas.",
        "Content": "By Annoa Abekah-Mensah and Sophia Massam, Data and Forensics team    Footage geolocated by Sky News showed Russian soldiers walking through the Shakhtarskyi neighbourhood on the outskirts of Pokrovsk on Thursday. The video sheds light on the situation in this key frontline area, as Russian forces slowly encroach on Myrnohrad, the satellite town to Pokrovsk, and one of its last remaining outposts. Videos geolocated by Sky News show fighting intensifying in recent weeks, as Russian forces attempt to gain control of the towns and their network of road and rail intersections. Gaining control here would give Russia a base from which to access key cities further north that form part of Ukraine's \"fortress belt\". Russian forces are advancing from all directions, according to the Institute for the Study of War (ISW), with only one small opening to the northwest of Myrnohrad remaining. Estimated to be only 3km wide by military experts, this withdrawal corridor is patrolled by Russian drone units which monitor the area for moving vehicles and those who may attempt to leave on foot. Russian forces have been advancing on Myrnohrad since late October. \n                  Why developers are worried about 'jaws of death' in England's housing market\n                 \n                  A Danish style asylum system? How the UK and Denmark's immigration policies compare\n                 \n                  The rise of Christian nationalism in Britain and its relationship with the far right\n                 Video from a Ukrainian unit in Myrnohad, posted on 29 October, shows a Russian vehicle attempting to enter the town from the northeast. The tank is attacked and soldiers attempting to enter on foot are targeted. Video posted on 3 November shows Russian forces on the ground in the south of the town. By 8 November, Russian strikes begin to pummel the northeast of Myrnohrad, the location of many of the town's high-rise buildings, at that time, held by Ukrainian forces. George Barros, Russia Team & Geospatial Intelligence Team Lead at ISW, told Sky News that Russian strategy in Pokrovsk has been to erode Ukrainian logistical capacity using drones and artillery over the course of several months. \"After denying supply lines and degrading the frontline forces by essentially cutting them off from behind and starving them out in their positions, then the Russians move forward with their infantry and frontal assaults,\" Barros explained. Capture the flag  For a brief period, it looked as though Russian forces had captured Myrnohrad. Videos posted on 13 November appeared to show a Russian flag flying over the Myrnohrad mine. However, video posted the following day showed a Ukrainian drone shooting it down. Both Russian and Ukrainian forces continue to fight for control of Myrnohrad, with videos posted on the 19 and 20 November showing Russian airstrikes on Ukrainian positions in the town, and Ukrainian drone strikes targeting Russian forces on foot. While the exact numbers of Russian and Ukrainian forces in the area remains unclear, reports indicate that three key Russian units are active in Pokrovsk and Myrnohrad, and are advancing on the towns from the north and south. A number of Ukrainian units remain inside the towns, including the 145th Assault regiment and the 32nd, 35th, 38th and 155th Brigades. Reports indicate that more Ukrainian units have been moved into surrounding areas to hold the withdrawal corridor open. Sky News reached out to the Ukrainian brigades still in Myrnohrad, but they declined to comment, citing military regulations. Strategic significance Natia Seskuria, associate international security fellow at the Royal United Services Institute (RUSI), explained that the area is important for the Ukrainians to keep and the Russians to take because of its strategic position. \"Situated at a major road and rail intersection in Donetsk Oblast, Pokrovsk has functioned as a central artery for moving troops, equipment, and supplies to Ukrainian units deployed along the surrounding front.\" Russia \"would gain a platform to redirect its offensive efforts toward Ukraine's principal defensive urban centres... including Kramatorsk and Slovyansk,\" Seskuria said. Read more:Analysis - Ukraine and its allies are in a perilous momentAnalysis: Europe scrambles at G20 over Ukraine peace planeG20 lands in South Africa: But who feels forgotten? Ukrainian and Russian soldiers in Pokrovsk have fought intensely and at close quarters over the last month. In late October US-made Black Hawk helicopters containing specialist troops directed by Ukrainian military intelligence entered Pokrovsk to try to keep the town. But as Russian troops advance, Myrnohrad is becoming the last stronghold of Ukrainian forces in the area. Uncertain future At least up until 12 November, there were still civilians living in Pokrovsk and Myrnohrad, despite strikes on buildings in both cities. A post made on that day by the Donetsk state regional administration estimated 1,200 people remain living in Pokrovsk and 900 in Myrnohrad. Evacuation is only possible with the help of the military or police, and it is not clear how many have evacuated in the 11 days since. Barros of ISW says gaining Pokrovsk would increase Russia's leverage at the negotiating table. \"If the Russians can successfully convince enough international leaders that, okay, the Russians took Pokrovsk, they're going to take the next thing, and they're going take the thing, so now let's negotiate, then that is a strategic victory for the Russians.\" Production by Michelle Inez Simon, Visual Investigations Producer. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done. "
    },
    {
        "title": "In full: Europe's 28-point counter proposal to US-Russia peace plan for Ukraine",
        "description": "Europe has tabled a counter proposal to the US-Russia draft peace plan for Ukraine. ",
        "url": "https://news.sky.com/story/in-full-europes-28-point-counter-proposal-to-us-russia-peace-plan-for-ukraine-13474575",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-zelenskyy-starmer_7089873.jpg?20251123173459",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 17:20:00",
        "Headline": "The document uses the US plan as its basis, with suggestions for deletions and alterations. ",
        "Content": " Europe has tabled a counter proposal to the US-Russia draft peace plan for Ukraine.  The document - drafted by Britain, France and Germany - uses the United States's 28-point plan as its basis, working through it point-by-point with suggested changes and deletions. The US has since said it is making \"some changes\" to its peace plan after seemingly positive talks with Ukraine. Latest: US-Ukraine talks held in Switzerland  Reuters news agency has seen the European proposals and reports that the text is as follows… 1. Ukraine's sovereignty to be reconfirmed. 2. There will be a total and complete non-aggression agreement reached between Russia and Ukraine and NATO. All ambiguities from the last 30 years will be resolved. (Point 3 of the US plan is deleted. A draft of it seen by Reuters said: \"There will be the expectation that Russia will not invade its neighbours and NATO will not expand further.\") 4. After a peace agreement is signed, a dialogue between Russia and NATO will convene to address all security concerns and create a de-escalatory environment to ensure global security and increase the opportunity for connectivity and future economic opportunity. 5. Ukraine will receive robust Security Guarantees. In full: The US peace plan for Ukraine  6. Size of Ukraine military to be capped at 800,000 in peacetime. 7. Ukraine joining NATO depends on consensus of NATO members, which does not exist. 8. NATO agrees not to permanently station troops under its command in Ukraine in peacetime. 9. NATO fighter jets will be stationed in Poland. 10. US guarantee that mirrors Article 5: a. US to receive compensation for the guarantee b. If Ukraine invades Russia, it forfeits the guarantee c. If Russia invades Ukraine, in addition to a robust coordinated military response, all global sanctions will be restored and any kind of recognition for the new territory and all other benefits from this agreement will be withdrawn. 11. Ukraine is eligible for EU membership and will get short-term preferred market access to Europe while this is being evaluated. 12. Robust Global Redevelopment Package for Ukraine including but not limited to: a. Creation of Ukraine Development fund to invest in high growth industries including technology, data centres and Al efforts b. The United States will partner with Ukraine to jointly restore, grow, modernise and operate Ukraine's gas infrastructure, which includes its pipeline and storage facilities c. A joint effort to redevelop areas impacted by the war to restore, redevelop and modernise cities and residential areas d. Infrastructure development e. Mineral and natural resource extraction f. A special financing package will be developed by the World Bank to provide financing to accelerate these efforts. 13. Russia to be progressively re-integrated into the global economy. a. Sanction relief will be discussed and agreed upon in phases and on a case-by-case basis b. The United States will enter into a long-term Economic Cooperation Agreement to pursue mutual development in the areas of energy, natural resources, infrastructure, AI, datacenters, rare earths, joint projects in the Arctic, as well as various other mutually beneficial corporate opportunities c. Russia to be invited back into the G8. Read more:Who actually wrote US-Russian peace plan for Ukraine?Analysis - Ukraine is in a perilous moment  14. Ukraine will be fully reconstructed and compensated financially, including through Russian sovereign assets that will remain frozen until Russia compensates damage to Ukraine. 15. A joint Security taskforce will be established with the participation of US, Ukraine, Russia and the Europeans to promote and enforce all of the provisions of this agreement. 16. Russia will legislatively enshrine a non-aggression policy towards Europe and Ukraine. 17. The United States and Russia agree to extend nuclear non-proliferation and control treaties, including Fair Start. 18. Ukraine agrees to remain a non-nuclear state under the NPT [Nuclear Non-Proliferation Treaty]. 19. The Zaporizhzhia nuclear power plant will be restarted under supervision of the [International Atomic Energy Agency] IAEA, and the produced power shall be shared equitably in a 50-50 split between Russia and Ukraine. 20. Ukraine will adopt EU rules on religious tolerance and the protection of linguistic minorities. 21. Territories Ukraine commits not to recover its occupied sovereign territory through military means. Negotiations on territorial swaps will start from the Line of Contact.  22. Once future territorial arrangements have been agreed, both the Russian Federation and Ukraine undertake not to change these arrangements by force. Any security guarantees will not apply if there is a breach of this obligation. 23. Russia shall not obstruct Ukraine's use of the Dnieper River for purposes of commercial activities, and agreements will be reached for grain shipments to move freely through the Black Sea. 24. A humanitarian committee will be established to resolve open issues: a. All remaining prisoners and bodies will be exchanged on the principle of All for All b. All civilian detainees and hostages will be returned, including children c. There will be a family reunification program d. Provisions will be made to address the suffering of victims from the conflict. 25. Ukraine will hold elections as soon as possible after the signing of the peace agreement 26. Provision will be made to address the suffering of victims of the conflict. 27. This agreement will be legally binding. Its implementation will be monitored and guaranteed by a Board of Peace, chaired by President Donald J. Trump. There will be penalties for violation. 28. Upon all sides agreeing to this memorandum, a ceasefire will be immediately effective upon both parties withdrawing to the agreed upon points for the implementation of the agreement to begin. Ceasefire modalities, including monitoring, will be agreed by both parties under US supervision."
    },
    {
        "title": "Ex-Brazil president Jair Bolsonaro says he tried to prize open ankle tag after 'hallucinations'",
        "description": "Brazil's former president Jair Bolsonaro has said \"hallucinations\" and a nervous breakdown led to an attempt to tamper with his electronic ankle tag. ",
        "url": "https://news.sky.com/story/ex-brazil-president-jair-bolsonaro-says-he-tried-to-prize-open-ankle-tag-after-hallucinations-13474647",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bolsonaro-jair_7090073.jpg?20251123211342",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 20:44:00",
        "Headline": "Bolsonaro, who was expected to be moved from house arrest to prison next week, has denied the incident was an attempt to escape. ",
        "Content": "Brazil's former president Jair Bolsonaro has said \"hallucinations\" and a nervous breakdown led to an attempt to tamper with his electronic ankle tag.  The 70-year-old was placed under house arrest in early August, weeks before he was convicted for leading a coup attempt after losing his country's 2022 election. It was reported on Saturday that Bolsonaro had tried to open his ankle monitor with a soldering iron in an apparent bid to flee and avoid jail. In a Supreme Court document published on Sunday, assistant judge Luciana Sorrentino - who had met with Bolsonaro online - wrote that the former president \"said he had 'hallucinations' that there was some wiretap in the ankle monitoring, so he tried to uncover it\". The document also said Bolsonaro reported feeling \"a certain paranoia\" that sparked his curiosity in opening the monitoring device. It added that the former president said he \"did not remember having a breakdown of this magnitude in another occasion\" and speculated that it may have been caused by a recent change in his medication. He has denied that it was an attempt to escape. \n                  Ex-Brazil president Jair Bolsonaro 'tried to open ankle monitor' with soldering iron in 'escape attempt', court documents allege\n                 \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                 \n                  Dozens of protesters storm COP30 venue in Brazil\n                 \"[Bolsonaro] said he was with his daughter, his elder brother and an aide at his house and none of them saw what he was doing to the ankle monitoring,\" the document reads. \"He said he started to touch it late at night and stopped around midnight.\" Bolsonaro had been expected to begin serving his 27-year jail sentence some time next week. The Supreme Court received information that the far-right leader's tag was violated at 12.08am on Saturday. It ordered for Bolsonaro to be detained hours later, deeming him a flight risk. He is now being held at the federal police headquarters in Brasilia, where he was visited by his wife on Sunday morning. Bolsonaro's meeting with the assistant judge on Sunday was procedural but also gave his lawyers another chance to argue he should remain under house arrest due to ill health. Similar requests have previously been rejected."
    },
    {
        "title": "Israel strikes Beirut for first time in months, killing Hezbollah chief of staff",
        "description": "An Israeli airstrike has struck Lebanon's capital Beirut for the first time in months, killing Hezbollah's chief of staff. ",
        "url": "https://news.sky.com/story/israel-strikes-beirut-for-first-time-in-months-saying-it-targeted-hezbollah-chief-of-staff-13474482",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lebanon-beirut_7089602.jpg?20251123135323",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 13:54:00",
        "Headline": "It is the first Israeli airstrike on Beirut since June and comes days before Pope Leo is scheduled to visit Lebanon.",
        "Content": " An Israeli airstrike has struck Lebanon's capital Beirut for the first time in months, killing Hezbollah's chief of staff.  In a statement to the media, Benjamin Netanyahu said on Sunday that Haytham Ali Tabtabai had been \"eliminated\", describing him as \"a master of murders\". \"I thank the IDF and the security forces for carrying out a professional, precise and successful operation today,\" he added. Hezbollah also confirmed the official's death shortly after. Lebanon's Health Ministry has said at least five people were killed and 28 others were wounded in the targeted Israeli strike. Smoke could be seen in the busy Haret Hreik neighbourhood, with one video circulated on social media showing dozens of people crowded around the area of the strike, which appeared to be on an apartment building. Israel did not issue an evacuation warning. Residents told Reuters news agency they heard the roar of warplanes before the blast. Gunshots were fired to disperse the crowds as rescue workers and firefighters reached the damaged building. The Lebanese military cordoned off the area. Who was Hezbollah military leader Haytham Ali Tabtabai?  Haytham Ali Tabtabai had led Hezbollah's elite Radwan Unit. In 2016, the US designated him as a terrorist and offered up to $5m in exchange for information on him. He had been the apparent successor of Ibrahim Aqil, who was killed in Israeli attacks in September 2024 that wiped out much of Hezbollah's senior leadership, including longtime leader Hassan Nasrallah. This was the first Israeli airstrike on Beirut since June and comes days before Pope Leo is scheduled to visit Lebanon. Israeli strikes on southern Lebanon have intensified in recent weeks. Israel says Hezbollah is attempting to rebuild its military capabilities there, which the Lebanese government has denied. Middle East correspondent The killing of Haytham Ali Tabatabai is a blow to Hezbollah and also a warning that, a year after the ceasefire came into effect, it is now under huge strain. Israel does not believe that either Lebanon or Hezbollah have lived up to the promises made, and that far from disarming, Hezbollah is now building up its resources once more. Tabatabai, it claims, was the person responsible for leading that rearmament. For its part, Lebanon insists there is a viable disarmament mechanism in place that Israel is ignoring.  This attack, it insists, is proof that Israel doesn't care about the rules. It's worth reiterating that Hezbollah - which Britain, America and others consider a terrorist organisation - does not run Lebanon. It does, however, wield considerable power in the Lebanese parliament and across the country, particularly in the south, where Lebanon borders Israel.  And Hezbollah's military strength is bolstered by the support of Iran. So what happens next? If Israel believes that Hezbollah is rearming, and that its residents in the north face a renewed threat, it will inevitably launch further reprisals.  Hezbollah, too, may feel obliged to respond, either with rockets fired into Israel or by targeting overseas sites that are linked to either Israel or Judaism. As in Gaza, there is a ceasefire in place, but that doesn't necessarily mean the firing stops. And as long as the United States will tolerate Israel's actions, then Benjamin Netanyahu will feel at liberty to continue. Mr Netanyahu said in his statement on Sunday evening: \"The policy I am leading is absolutely clear: Under my leadership, the State of Israel will not allow Hezbollah to rebuild its power, and we will not allow it to once again pose a threat to the State of Israel.\" Hezbollah is one of the most heavily armed non-state groups in the world and regarded as an Iranian proxy force. It is a sworn enemy of Israel and has openly called for the destruction of the \"Zionist regime in Palestine\". More from Sky News:The Israel-Hezbollah ceasefire explainedInside a Jordan warehouse full of Gaza aid Israel has accused Hezbollah of trying to rearm since a US-backed ceasefire last year. The militant group says it has abided by requirements for it to end its military presence near the Lebanon-Israel border and for the Lebanese army to deploy there. Lebanon and United Nations peacekeepers have criticised the ongoing Israeli attacks, accusing them of violating the ceasefire agreement."
    },
    {
        "title": "Behind the scenes at COP30: How they reached the final deal",
        "description": "It was the showdown nobody wanted. But in the end, it saved the climate summit.",
        "url": "https://news.sky.com/story/behind-the-scenes-at-cop30-how-they-reached-the-final-deal-13474547",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews_7089930.jpg?20251123180805",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-23 16:24:00",
        "Headline": "The all-night session was kept afloat by coffee that arrived about every two hours, saltine crackers and traditional Brazilian cheese dough-balls. As the sun dawned, a path emerged.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  It was the showdown nobody wanted. But in the end, it saved the climate summit. As the clock ticked past the deadline of 6pm on Friday in Belem, Brazil, the issue that, rightly or wrongly, came to define this year's UN climate talks was still unresolved. The great, unanswered question was how to talk about fossil fuels: two words pathetically controversial for a summit trying to tackle climate change, given they are the main cause. But it had taken 28 COP meetings to even name those words in a deal. Finally, the promise came in Dubai in 2023 to \"transition away from fossil fuels\". The decision, known as the \"UAE consensus\", was hailed as \"historic\" at the time. But few countries have done much about it since. Two years later in Brazil, a push for a plan at COP30 on how to actually transition from fossil fuels gathered steam, garnering support from at least 80 countries. They had already set the target in Dubai, this was about how to get there. The proposal was made more credible by the fact that it wasn't just wealthy Europeans such as the UK and Germany, with little fossil fuels themselves anyway, who were supporting it. It was also backed by countries including the oil-rich Sierra Leone, where two in three people still need electricity, and coal-major Colombia. But it was too much to stomach for economies that rely on fossil fuels, like Russia and the Arab negotiating group. A bombshell draft of the final deal that landed on the table on Friday had deleted all three earlier proposals for a fossil fuel plan. The European Union commissioner Wopke Hoekstra was livid. \"This current thing is clearly a non-starter, and we will need to significantly beef this up,\" he said as he charged through the main tent of the conference, flanked by aides and journalists scavenging for soundbites. \"If that doesn't happen, we're clearly facing a no-deal scenario.\" Colombia was spitting feathers. \"We cannot accept a text that is not dealing with the real problems. We won't be silent,\" thundered its environment minister Irene Velez Torres. A sweltering meeting of ministers, drowned out by the sound of generators and Amazon rain pounding on the tent above, had yielded nothing. The mighty all-nighter Then came the more than 12-hour, overnight session that nearly collapsed the whole process - before finally breaking the deadlock. Early evening on Friday, upstairs in the UN-patrolled conference, the Brazilian president of the talks, Andre Aranha Correa do Lago, met with around 80 people from different negotiating groups. The protagonists on the one side included China, Saudi Arabia and India, who in fact are already transitioning their energy systems away from fossil fuels, but resent being told to speed up by countries that have already got rich from their own fossil fuel-powered industrial revolutions. On the other side of the still yawning chasm were the UK, EU, Latin American countries and small island states, who thought the credibility of the COP process was on the line if they didn't inch forward on tackling fossil fuels. It was a squabble over semantics, but at its heart the tension was over the pressing need to act faster on climate change, and who is to blame for that urgency. This is when it does pay to have made rapid progress on climate action back home, as Britain broadly has, because it strengthens your hand when asking other countries to do more. But the two groups remained diametrically opposed. COPs are always tense at the end, but the stakes felt higher than in previous years because countries were considering walking away. \"It felt on a knife edge,\" said someone close to the negotiations, speaking on condition of anonymity, as all diplomats at COP do to protect relationships. UK energy secretary Ed Miliband said on Saturday: \"I spent much of the night thinking, genuinely, we were not going to get an agreement, and for us, we were willing to walk away.\" Cruise ships, coffee and crackers The all-night session was kept afloat by coffee that arrived about every two hours, saltine crackers and traditional Brazilian cheese dough-balls. \"Various folks arrived through the night. [Brazil's climate minister] Marina Silva was there at one point. Senior Chinese and Saudi figures turned up at possibly 4 or 5am, but I've lost track of time,\" said one person familiar with what happened. Some aides peeled off to go and check out from the cruise ship where they'd been staying - brought in by Brazil due to a lack of hotel rooms in rough-and-ready Belem - before it was rumoured to set sail at 8am on Saturday. Others couldn't keep their eyes open. \"There were people negotiating on one end of sofa, and snoring on the other end,\" another person present told Sky News. \"Someone else was sitting on the floor, holding onto a fire extinguisher, asleep. It was hot.\" By hosting the COP on the edge of the Amazon rainforest, Brazil gave visitors a taste of life in a hotter world: almost daily 30°C heat, 80% humidity, and torrential downpours that flood roads and wash out livelihoods. A new dawn Inside the venue, finally, as the sun dawned on Saturday morning, a path emerged. The bleary-eyed ministers and negotiators still standing at about 6am figured out they could hint at a fossil fuel plan, but without saying the words out loud. The final agreement is a fudge: it promises to \"accelerate implementation\", taking into account previous decisions \"such as the United Arab Emirates Consensus\" - in a nod to the previous fossil fuel pledge. Ed Miliband said: \"We thought there had to be an acknowledgement of the UAE consensus... We thought we weren't going to get it. We thought we were quite potentially looking at no deal. \"And then, just before seven o'clock in the morning, that opened up, and that's what opened the space for there to be an agreement.\" Climate-progressive countries didn't really want to leave with nothing - afraid a breakdown would play into the hand of Donald Trump, who is pulling the US out of the process. So they accepted the compromise and a voluntary process on fossil fuels to be launched outside of the COP process. Applause masked disappointment There were then a few hours to dash back to hotels, perhaps grab 90 minutes of sleep and a shower, before coming back for the closing session to see the deal signed off. Nothing is official until the final gavel falls. \"What struck me in those moments was nobody in that room really wanted to be the people who brought the thing down,\" said a bleary-eyed Mr Miliband on Saturday, looking like he could topple over at any moment. \"But actually there was a will to keep the show on the road.\" Another source told Sky News that China was anxious to get an agreement. Once back in the plenary hall, the agreement was so fragile, many feared it could all still fall apart. When the COP president Mr do Lago proclaimed the deal done and struck his ceremonial gavel, the room erupted in a standing ovation. The truth is that the applause masked a lot of disappointment. COP is the annual test of the world's appetite for tackling climate change and working together - and both are falling out of fashion. What they were really cheering was that they had any deal at all. A few rays of hope came from other promises to finally triple cash for developing countries to cope with ever more extreme weather, more money for forests, and recognition that the switch to clean energy needs to be fair for workers and communities. The final package was no crowning glory of the COP process. It was a glue that kept the process stuck together, in a fractured world, for now."
    },
    {
        "title": "Dozens of kidnapped schoolchildren in Nigeria escape as Pope Leo appeals for release of remaining abductees",
        "description": "At least 50 of the 303 children abducted this week from a Catholic school in Nigeria have escaped and been reunited with their families, a church group has said, as Pope Leo pleaded for their immediate release.",
        "url": "https://news.sky.com/story/dozens-of-kidnapped-schoolchildren-in-nigeria-escape-as-pope-leo-appeals-for-release-of-remaining-abductees-13474471",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-st-marys-school-nigeria_7088284.jpg?20251122100122",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 13:09:00",
        "Headline": "On Friday, gunmen took students and teachers from St Mary's school in the northwest of the country.",
        "Content": "At least 50 of the 303 children abducted this week from a Catholic school in Nigeria have escaped and been reunited with their families, a church group has said, as Pope Leo pleaded for their immediate release. In the Pope's \"heartfelt appeal\" he spoke of his \"great pain\" following one of the worst mass kidnappings ever recorded in the West African country. On Friday, gunmen kidnapped students and teachers from St Mary's school in the northwest of Nigeria - the latest in a spate of school attacks this week that has forced the government to close 47 colleges.   The 50 schoolchildren, aged between 10 and 18, escaped individually between Friday and Saturday, according to the Most Reverend Bulus Dauwa Yohanna, the proprietor of the school. A total of 253 schoolchildren and 12 teachers are still being held, he said in a statement. It was not immediately clear where the children who escaped were being held or how they managed to return. Speaking at the end of a mass in St Peter's Square, Pope Leo said he was \"deeply saddened\" to learn of the kidnappings in Nigeria and Cameroon this week. He said: \"I feel great pain, especially for the many young men and women who have been abducted and for their anguished families.\" \"I make a heartfelt appeal for the immediate release of the hostages and urge the competent authorities to take appropriate and timely decisions to ensure their release,\" he added. \"Let us pray for these brothers and sisters of ours and that churches and schools may always and everywhere remain places of safety and hope.\" Read more from Sky News:Torrential rain triggers deadly flooding and landslides in VietnamSeveral airlines cancel Venezuela flights after FAA warning No group has yet claimed responsibility for the abductions at St Mary's and authorities have said tactical squads have been deployed alongside local hunters to rescue the children. The Christian Association of Nigeria (CAN) said on Saturday it had raised its estimate of those taken from the school to 315 from an earlier estimate of 227, following a verification exercise that found a further 88 students had been captured after they tried to escape.  Nigeria's security situation has faced increased scrutiny since US President Donald Trump threatened military action in the West African country over the treatment of Christians. Nigeria's government says Mr Trump's claims that Christians face persecution there are a misrepresentation of the country's complex security challenges. Niger state has now closed all schools to forestall other kidnappings. The decision was made to protect lives and property, Niger governor Umar Bago told reporters on Saturday. School kidnappings have come to define insecurity in Africa's most populous nation, and armed gangs often see schools as \"strategic\" targets to attract more attention. Unicef said last year that only 37% of schools across 10 of the conflict-hit states have early warning systems to detect threats."
    },
    {
        "title": "Who actually wrote US-Russian peace plan for Ukraine?",
        "description": "Questions are being raised about the Russia-Ukraine peace plan, after US politicians suggested the proposal's 28 points did not originate from Donald Trump's administration but were put forward by Moscow.",
        "url": "https://news.sky.com/story/who-actually-wrote-us-russian-peace-plan-for-ukraine-13474427",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-rubio_7089728.jpg?20251123160734",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 10:03:00",
        "Headline": "As officials hold discussions in Switzerland, there are claims the 28 points on the peace plan were not from the Trump administration, but a Russian \"wish list\" drafted by a close ally of Vladimir Putin.",
        "Content": "Questions are being raised about the Russia-Ukraine peace plan, after US politicians suggested the proposal's 28 points did not originate from Donald Trump's administration but were put forward by Moscow. Senators, critical of the US president's approach to Ukraine, said they spoke with the US secretary of state Marco Rubio, who told them the plan is a \"wish list\" from the Russians and not a proposal offering Washington's positions. Ukraine war latest: Washington denies backing 'Moscow wish list' The US state department has called that account \"blatantly false\", with Mr Rubio saying that the senators were mistaken and that Washington was responsible for the proposals. The 28-point plan has surprised many for being so favourable to Moscow. Explained: Trump's peace plan in full  Republican senator Mike Rounds is among those who have claimed the plan was not drafted by Washington. \"This administration was not responsible for this release in its current form,\" he said at a security conference in Canada. \"They want to utilise it as a starting point.\" Mr Rounds added: \"It looked more like it was written in Russian to begin with.\" Independent senator Angus King said Mr Rubio told them the plan \"was not the administration's plan\" but a \"essentially the wish list of the Russians\". The senators said they spoke to Mr Rubio after he contacted them while on his way to Geneva for talks on the plan. According to the Reuters news agency, some US officials also said the plan contains material that the US secretary of state has previously rejected and neither he, nor anyone in the state department, was aware of the plan before it was announced. These latest claims have added to growing confusion over who was involved in drawing up the 28 points. European leader asks: 'Who authored the plan?' Poland's Prime Minister Donald Tusk has raised concerns about its origins. On Sunday, he wrote on X: \"It would be good to know for sure who is the author of the plan and where was it created.\" In a post on X, Mr Rubio insisted that \"the peace proposal was authored by the US... but it is also based on previous and ongoing input from Ukraine\". A former adviser to Vladimir Putin had denied that Russia was behind the peace plan. Sergei Markov told Sky News \"it is American\" and the points were a \"very good basis for diplomatic negotiation\". Mr Markov insisted there were \"some positive moods in Russia about it\" but also accused Europe and Ukraine of wanting to continue the war, despite Russia unilaterally launching and pursuing a full-scale invasion of Ukraine.  Read more from Sky News:Peace plan scrutinised at G20Ukraine issued with 'surrender ultimatum'Ukraine and Europe cannot reject plan American special envoy Steve Witkoff and Donald Trump's son-in-law Jared Kushner met Kirill Dmitriev in Miami at the end of October to work on the proposals, according to multiple sources familiar with the matter. Mr Dmitriev, who is a close ally of the Russian president, was blacklisted by the US government in 2022 following Russia's invasion of Ukraine. Trump rows back on demands The US president initially demanded that Ukraine accept the peace plan by Thursday. But he has since rowed back from that position, instead saying the proposal was not his final offer. The plan currently on the table calls for major concessions by Kyiv, including ceding territory to Russia, pledging not to join NATO and abandoning certain weaponry. Ukrainian President Volodymyr Zelenskyy has not rejected the proposals outright, but said he would not betray Ukraine's interests. Meanwhile, Mr Putin has described the plan as the basis of a resolution to the conflict. Separately, Senator Roger Wicker, the Republican chairman of the Senate Armed Services Committee, has been equally dismissive of the proposals. \"This so-called 'peace plan' has real problems, and I am highly sceptical it will achieve peace,\" he said."
    },
    {
        "title": "Torrential rain triggers deadly flooding and landslides in Vietnam",
        "description": "Torrential rain, flooding and landslides has left more than 100 people dead or missing in Vietnam.",
        "url": "https://news.sky.com/story/55-dead-in-vietnam-after-torrential-rain-triggers-flooding-and-landslides-13474371",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-flooding-vietnam-quy-nhon_7089435.jpg?20251123090346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 07:22:00",
        "Headline": "Footage shows a dramatic rescue involving a drone which airlifted a stranded man to safety from an island in the middle of the Serepok River.",
        "Content": " Torrential rain, flooding and landslides has left more than 100 people dead or missing in Vietnam. Rainfall has exceeded 74.8in (1.9 metres) in some parts of central Vietnam over the past week. The region is a major coffee production belt and home to popular beaches, but it is also prone to storms and floods. Fatalities have been reported in Dak Lak province and the neighbouring Khanh Hoa province. Footage has been released by local police of a dramatic rescue, involving a drone which airlifted a stranded man to safety from an island in the middle of the Serepok River, Dak Lak province. The government estimates the flooding has cost the economy around 8.98 trillion dong (£260m). More than 235,000 houses were flooded and nearly 80,000 hectares of crops were damaged, Vietnam's disaster agency said. \n                  COP30: China dominates renewables - and this project in Laos shows why\n                 \n                  Torrential rain after Typhoon Bualoi leaves at least 26 dead in Vietnam amid flooding and landslides\n                 \n                  Three people killed and more than a dozen injured as Typhoon Kajiki hits Vietnam\n                 On Thursday, VietnamNet newspaper said that a suspension bridge on Da Nhim River in Lam Dong province had been swept away. Video footage posted online showed the bridge being swallowed by the river in just a few seconds. Naval forces have been deployed to help stranded citizens in Khanh Hoa, the Vietnam News Agency reported, adding that floodwaters had reached record highs in many areas. Photos shared in state media reports showed residents, including children, sitting on the roofs of flooded houses in Khanh Hoa, Gia Lai and Dak Lak provinces. Read more from Sky News:Crisis talks in Geneva on UkraineTrump wants MTG to return to politics'Moral migrants' relocating to Russia A seven-year-old girl was rescued late on Wednesday in Da Lat, the capital of Lam Dong province, after being buried by a landslide, the Nhan Dan newspaper reported. The landslide, triggered by heavy rain, knocked down and buried part of the house where the girl was staying. She was pulled out after an hour and a half and was taken to hospital with a broken leg, according to the report."
    },
    {
        "title": "Ukrainian sumo wrestler makes history in Japan",
        "description": "A Ukrainian sumo wrestler who left his homeland after Russia's full-scale invasion has made history in Japan.",
        "url": "https://news.sky.com/story/ukrainian-sumo-wrestler-makes-history-in-japan-13474477",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sumo-yavhusishyn_7089571.jpg?20251123132105",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-23 13:08:00",
        "Headline": "Danylo Yavhusishyn, who fled Ukraine in the wake of Russia's full-scale invasion of his homeland, is a rising star in the world of sumo wrestling.",
        "Content": "A Ukrainian sumo wrestler who left his homeland after Russia's full-scale invasion has made history in Japan. Danylo Yavhusishyn, also known by his ring name of Aonishiki Arata, has become the first competitor from his country to win an elite-level tournament. He defeated Hoshoryu Tomokatsu, a top-ranked Mongolian wrestler. Yavhusishyn was asked in his winning ceremony interview if was pleased with his results in sumo. \"No, I think this is just the beginning,\" he said. Yavhusishyn left Ukraine as a teenager in 2022 after Russia launched a full-scale invasion of his country. Speaking at a news conference last month, he said: \"I hope that people from Ukraine will be able to see my sumo, and have some kind of encouragement from that.\" \n                  One killed and 170 homes damaged or destroyed as fire burns in Japan\n                 \n                  Japan sends in troops to help tackle deadly bear attacks\n                 \n                  The 40 million Americans without food because of the government shutdown\n                 Yavhusishyn, 21, won the deciding match in the 15-day Kyushu Grand Sumo Tournament in Fukuoka, southwestern Japan, on Sunday, and he received the Prime Minister's Cup from Takahiro Inoue, an adviser to Prime Minister Sanae Takaichi. He had decided to travel to Japan following the Russian invasion after striking up a friendship with a Japanese wrestler at a tournament in 2019. Read more from Sky News:Fierce battle for key Ukrainian townsPeace plan 'not final offer' - Trump Ukraine has a strong Olympic wrestling tradition. Zhan Beleniuk won a gold medal in the Greco-Roman category at the 2020 Tokyo Games, staged in 2021 due to the COVID pandemic. The stars of sumo descended on London's Royal Albert Hall last month for a major tournament.  It was only the second time a Grand Tournament had been held outside of Japan in the sport's long history. The five-day tournament was won by 26-year-old Hoshoryu."
    },
    {
        "title": "JFK's granddaughter reveals terminal cancer diagnosis - as she hits out at relative RFK Jr",
        "description": "John F Kennedy's granddaughter has revealed she has terminal cancer, making the announcement on the anniversary of the ex-US president's assassination.",
        "url": "https://news.sky.com/story/jfks-granddaughter-reveals-terminal-cancer-diagnosis-as-she-hits-out-at-relative-rfk-jr-13474365",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tatiana-schlossberg_7089323.jpg?20251123115034",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-23 06:38:00",
        "Headline": "Tatiana Schlossberg, 35, the daughter of former US ambassador Caroline Kennedy, said she was diagnosed in May last year.",
        "Content": "John F Kennedy's granddaughter has revealed she has terminal cancer, making the announcement on the anniversary of the ex-US president's assassination. Tatiana Schlossberg, 35, has also criticised policies pushed by her relative, US health secretary Robert F Kennedy Jr, a long-time vaccine critic. She said measures backed by RFK Jr could hurt cancer patients like her, and her mother Caroline Kennedy, a former US ambassador, had urged senators to reject his confirmation in Congress in January. Mr Kennedy has sparked controversy after saying COVID-19 shots were no longer recommended for healthy children and pregnant women, firing the panel that makes vaccine recommendations, and refusing to strongly back vaccinations as a measles outbreak worsened. Ms Schlossberg, who said she was diagnosed in May last year, made her remarks in an essay for The New Yorker on Saturday, which was published on the 62nd anniversary of her grandfather's assassination in Dallas in 1963. She said of RFK Jr: \"As I spent more and more of my life under the care of doctors, nurses, and researchers striving to improve the lives of others, I watched as Bobby cut nearly a half billion dollars for research into mRNA vaccines, technology that could be used against certain cancers.\" After the birth of her second child, her doctor noticed her high white blood cell count. It turned out to be acute myeloid leukaemia with a rare mutation, called Inversion 3, mostly seen in older people. \n                  What to know about newly released JFK assassination files\n                 \n                  Clint Hill, Secret Service agent who leapt onto John F Kennedy's limo after assassination, dies aged 93\n                 \n                  'Who shot JFK?' question fits Trump narrative about 'deep state' hiding secrets from the American people\n                 Ms Schlossberg, an environmental journalist, wrote she has undergone rounds of chemotherapy and two stem cell transplants, the first using cells from her sister and the next from an unrelated donor, and participated in clinical trials. In the article, she disclosed that one of her doctors during the latest trial told her \"he could keep me alive for a year, maybe\". She also spoke of her fears her daughter and son will not remember her.  Read more from Sky News:Ukraine peace plan 'not final offer', Trump says'Thousands' of Westerners apply to live in Russia Her parents are JFK's daughter, Caroline Kennedy, and Edwin Schlossberg. Her grandmother, Jacqueline Kennedy Onassis, the wife of the 35th US president, often referred to as Jackie O, died aged 64 of cancer in 1994, when she was under the age of five. Ms Schlossberg said she feels cheated and sad that she won't get to keep living \"the wonderful life\" she had with her husband, George Moran. While her parents and siblings try to shelter her from their pain, she said she feels it every day. \"For my whole life, I have tried to be good, to be a good student and a good sister and a good daughter, and to protect my mother and never make her upset or angry,\" Ms Schlossberg said. \"Now I have added a new tragedy to her life, to our family's life, and there's nothing I can do to stop it.\""
    },
    {
        "title": "Who actually wrote US-Russian peace plan for Ukraine?",
        "description": "Questions are being raised about the Russia-Ukraine peace plan, after US politicians suggested the proposal's 28 points did not originate from Donald Trump's administration but were put forward by Moscow.",
        "url": "https://news.sky.com/story/who-actually-wrote-us-russian-peace-plan-for-ukraine-13474427",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-rubio_7089728.jpg?20251123160734",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-23 10:03:00",
        "Headline": "As officials hold discussions in Switzerland, there are claims the 28 points on the peace plan were not from the Trump administration, but a Russian \"wish list\" drafted by a close ally of Vladimir Putin.",
        "Content": "Questions are being raised about the Russia-Ukraine peace plan, after US politicians suggested the proposal's 28 points did not originate from Donald Trump's administration but were put forward by Moscow. Senators, critical of the US president's approach to Ukraine, said they spoke with the US secretary of state Marco Rubio, who told them the plan is a \"wish list\" from the Russians and not a proposal offering Washington's positions. Ukraine war latest: Washington denies backing 'Moscow wish list' The US state department has called that account \"blatantly false\", with Mr Rubio saying that the senators were mistaken and that Washington was responsible for the proposals. The 28-point plan has surprised many for being so favourable to Moscow. Explained: Trump's peace plan in full  Republican senator Mike Rounds is among those who have claimed the plan was not drafted by Washington. \"This administration was not responsible for this release in its current form,\" he said at a security conference in Canada. \"They want to utilise it as a starting point.\" Mr Rounds added: \"It looked more like it was written in Russian to begin with.\" Independent senator Angus King said Mr Rubio told them the plan \"was not the administration's plan\" but a \"essentially the wish list of the Russians\". The senators said they spoke to Mr Rubio after he contacted them while on his way to Geneva for talks on the plan. According to the Reuters news agency, some US officials also said the plan contains material that the US secretary of state has previously rejected and neither he, nor anyone in the state department, was aware of the plan before it was announced. These latest claims have added to growing confusion over who was involved in drawing up the 28 points. European leader asks: 'Who authored the plan?' Poland's Prime Minister Donald Tusk has raised concerns about its origins. On Sunday, he wrote on X: \"It would be good to know for sure who is the author of the plan and where was it created.\" In a post on X, Mr Rubio insisted that \"the peace proposal was authored by the US... but it is also based on previous and ongoing input from Ukraine\". A former adviser to Vladimir Putin had denied that Russia was behind the peace plan. Sergei Markov told Sky News \"it is American\" and the points were a \"very good basis for diplomatic negotiation\". Mr Markov insisted there were \"some positive moods in Russia about it\" but also accused Europe and Ukraine of wanting to continue the war, despite Russia unilaterally launching and pursuing a full-scale invasion of Ukraine.  Read more from Sky News:Peace plan scrutinised at G20Ukraine issued with 'surrender ultimatum'Ukraine and Europe cannot reject plan American special envoy Steve Witkoff and Donald Trump's son-in-law Jared Kushner met Kirill Dmitriev in Miami at the end of October to work on the proposals, according to multiple sources familiar with the matter. Mr Dmitriev, who is a close ally of the Russian president, was blacklisted by the US government in 2022 following Russia's invasion of Ukraine. Trump rows back on demands The US president initially demanded that Ukraine accept the peace plan by Thursday. But he has since rowed back from that position, instead saying the proposal was not his final offer. The plan currently on the table calls for major concessions by Kyiv, including ceding territory to Russia, pledging not to join NATO and abandoning certain weaponry. Ukrainian President Volodymyr Zelenskyy has not rejected the proposals outright, but said he would not betray Ukraine's interests. Meanwhile, Mr Putin has described the plan as the basis of a resolution to the conflict. Separately, Senator Roger Wicker, the Republican chairman of the Senate Armed Services Committee, has been equally dismissive of the proposals. \"This so-called 'peace plan' has real problems, and I am highly sceptical it will achieve peace,\" he said."
    },
    {
        "title": "Donald Trump says he would 'love to see' Marjorie Taylor Greene return to politics",
        "description": "President Donald Trump says he would \"love to see\" one-time ally Marjorie Taylor Greene return to politics one day - as the fiery congresswoman reportedly considers a White House run in 2028.",
        "url": "https://news.sky.com/story/donald-trump-says-he-would-love-to-see-marjorie-taylor-greene-return-to-politics-13474321",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-marjorie-taylor-greene_7088174.jpg?20251122065156",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-23 00:21:00",
        "Headline": "It comes as the firebrand congresswoman has reportedly told allies she is considering a run for president.",
        "Content": " President Donald Trump says he would \"love to see\" one-time ally Marjorie Taylor Greene return to politics one day - as the fiery congresswoman reportedly considers a White House run in 2028. The US leader said \"it's not going to be easy for her\" to revive her political career in comments to Sky's partner network NBC News. But he added: \"I'd love to see that.\" In the meantime, Mr Trump said \"she's got to take a little rest\". Marjorie Taylor Greene - a one-time MAGA ally who has turned into a fierce critic of Mr Trump - unexpectedly announced on Saturday that she would be resigning from Congress. In a video posted online, the Georgia representative said she did not want her congressional district \"to have to endure a hurtful and hateful primary against me by the president we all fought for\".  Ms Greene's resignation followed a falling-out with Mr Trump in recent months, as the congresswoman criticised him for his stance on files related to Jeffrey Epstein, along with foreign policy and health care. \n                  Who actually wrote US-Russian peace plan for Ukraine?\n                 \n                  Several airlines cancel Venezuela flights after 'hazardous situation' warning\n                 \n                  Haunted by Trump deja vu, Ukraine and its allies are in a perilous moment\n                 Mr Trump branded her a \"traitor\" and \"lunatic\" and said he would endorse a challenger against her when she ran for re-election next year. She said her last day would be 5 January 2026. Meanwhile, Time magazine reports that Ms Greene has told allies that she is considering running for president in 2028."
    },
    {
        "title": "FCA consumer chief Mills to leave City watchdog",
        "description": "One of the City watchdog's top executives is to step down after an eventful eight-year tenure in which he also applied to run Britain's competition regulator.",
        "url": "https://news.sky.com/story/fca-consumer-chief-mills-to-leave-city-watchdog-13474444",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-fca-financial-conduct_6759446.jpg?20241127163152",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-23 10:58:00",
        "Headline": "Sheldon Mills has been asked to spearhead a review of the growing use of AI in delivering consumer financial advice when he leaves the Financial Conduct Authority, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the City watchdog's top executives is to step down after an eventful eight-year tenure in which he also applied to run Britain's competition regulator. Sky News has learnt that Sheldon Mills, the Financial Conduct Authority's (FCA) executive director, consumers and competition, is to leave in the coming months. Mr Mills, who joined the FCA in 2018, is understood to have been asked to lead a review of the growing use of artificial intelligence in the delivery of financial advice to consumers after he steps down. His departure from one of the UK's most powerful economic regulators is understood to have been communicated to FCA employees late last week. Mr Mills, who has also chaired Stonewall, the LGBTQ+ charity, is said to have been on a leave of absence for much of the last 12 months. The FCA website says his executive duties are \"currently being covered by Sarah Pritchard and David Geale, Managing Director, [Payment Systems Regulator]\". Insiders said the financial services watchdog would shortly advertise for a new executive director of markets, Ms Pritchard's former role. The shake-up comes months after Nikhil Rathi, the FCA chief executive, was appointed to a second five-year term by Rachel Reeves, the chancellor. Ministers have been pressing Britain's main economic regulators this year to adopt growth-oriented policies and remove red tape for businesses as the economy struggles. The FCA declined to comment on Sunday."
    },
    {
        "title": "Sir Keir Starmer 'absolutely' wants Angela Rayner back in cabinet",
        "description": "Sir Keir Starmer has said he \"absolutely\" wants Angela Rayner back in his cabinet after she resigned for failing to pay the correct amount of stamp duty. ",
        "url": "https://news.sky.com/story/i-like-angie-a-lot-sir-keir-starmer-absolutely-wants-angela-rayner-back-in-cabinet-13474461",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-rayner_7089746.jpg?20251123162005",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-23 16:59:00",
        "Headline": "The prime minister says his ex-deputy is \"the best example ever\" of social mobility in the UK and that he is still in contact with her.",
        "Content": "Sir Keir Starmer has said he \"absolutely\" wants Angela Rayner back in his cabinet after she resigned for failing to pay the correct amount of stamp duty.  Speaking from the G20 Summit in South Africa, the prime minister told broadcasters his former deputy is \"the best example ever\" of social mobility and he is still in touch with her. Asked if she could make a comeback this side of a general election, Sir Keir said: \"I've always said I want Angela back. Even back in September at the time I said she is going to be a big voice in the Labour movement. \"Do I want Angela back at some stage? Yes absolutely. \"I think she is the best example ever in the United Kingdom of social mobility - going from a pretty challenging childhood to being deputy prime minister of the United Kingdom. She is the story of social mobility above all other stories.\" Asked if he missed having her around, Sir Keir said: \"I’m friends with Angie and I like Angie a lot and we talk a lot. We still do. \"It's always good to have Angela.\" \n                  Starmer's political capital fading fast as he nears tax-raising budget\n                 \n                  G20 still 'really important' despite Donald Trump's absence, says Sir Keir Starmer\n                 \n                  Pro-Palestine activists accused of harassing Labour MP over Israel-Hamas war have convictions thrown out\n                 Ms Rayner's meteoric rise to the top of Labour came after she left school aged 16, pregnant and with no qualifications. She was elected deputy Labour leader by the membership in 2020, and was made deputy prime minister then housing secretary by Sir Keir. She resigned from all of those positions in September, after it emerged she had not paid the higher rate of stamp duty on a second home she bought in Hove, East Sussex, saving her about £40k.  It followed a tearful interview with Sky's political editor Beth Rigby about the \"complex living arrangement\" regarding her first home, which was sold to a trust following her divorce to provide stability for her teenage son, who has lifelong disabilities and is the sole beneficiary of the trust. An investigation by the prime minister ethic's watchdog found she breached the ministerial code by failing to get correct tax advice, but that she acted \"with integrity\". Ms Rayner is still a backbench MP and recently did not rule out a return to the front bench herself - telling the Daily Mirror during a visit to a care centre in her constituency that she had \"not gone away\". Other cabinet ministers have also supported her return. During the Labour Party Conference a few weeks after she resigned, Health Secretary Wes Streeting paid tribute to her work on the Employment Rights Bill and said Labour \"wants her back and needs her back\"."
    },
    {
        "title": "David Cameron reveals he has been treated for prostate cancer",
        "description": "Former prime minister Lord Cameron has revealed he has been treated for prostate cancer.",
        "url": "https://news.sky.com/story/david-cameron-reveals-he-has-been-treated-for-prostate-cancer-13474658",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cameron-david_7090117.jpg?20251123222144",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-11-23 21:26:00",
        "Headline": "The former PM has shared his health news in a bid to add himself to the growing list of people calling for a targeted screening programme. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Former prime minister Lord Cameron has revealed he has been treated for prostate cancer. The former Tory leader, who was PM from 2010 until 2016, and foreign secretary from November 2023 until last year's general election, went public in an interview with The Times. The 59-year-old joins Olympic cycling champion Sir Chris Hoy, ex-Sky News presenter Dermot Murnaghan and another former PM, Rishi Sunak, in campaigning for better diagnosis and treatment. He has now had the all clear and is cancer-free. Lord Cameron went to the GP for a prostate-specific antigen (PSA) test - which looks for proteins associated with prostate cancer - after his wife Samantha urged him to make an appointment. His result showed his numbers were worryingly high. Recalling the moment when, after a follow-up biopsy, he was told he had cancer, Lord Cameron said: \"You always dread hearing those words. \"And then literally as they're coming out of the doctor's mouth you're thinking, 'Oh, no, he's going to say it. He's going to say it. Oh God, he said it'. Then came the next decision. Do you get treatment? Or do you watch and wait?\" \n                  Starmer's challenge is to see if usual rules of special relationship still apply under Trump after years of love bombing\n                 \n                  Chinese spy alleged to be Prince Andrew's 'close confidant' met with British prime ministers, pictures show\n                 \n                  David Cameron comes out in support of assisted dying bill after previously voting against in 2015\n                 Lord Cameron said his older brother Alexander died of pancreatic cancer at the same age he is now. \"It focuses the mind,\" he said. \"I decided quite quickly. I wanted to move ahead and that's what I did.\" The former prime minister opted to have focal therapy, a treatment which delivers electric pulses via needles to destroy the cancerous cells. He was given a post-treatment MRI scan around the time the US struck a nuclear plant in Iran last year. \"It was the same week as Donald Trump was talking about the bomb damage assessment... I got my own bomb damage assessment,\" he quipped. Explaining why he has shared his diagnosis, Lord Cameron said: \"I've got a platform. This is something we've really got to think about, talk about, and if necessary, act on. \"I want to, as it were, come out. I want to add my name to the long list of people calling for a targeted screening programme.\" Lord Cameron is backing a call by the charity Prostate Cancer Research for the introduction of screening for men at high risk of the disease. \"I don't particularly like discussing my personal intimate health issues, but I feel I ought to,\" he continued. \"Let's be honest. Men are not very good at talking about their health. We tend to put things off. \"We're embarrassed to talk about something like the prostate, because it's so intricately connected with sexual health and everything else. I sort of thought, well, this has happened to you, and you should lend your voice to it. \"I would feel bad if I didn't come forward and say that I've had this experience. I had a scan. It helped me discover something that was wrong. It gave me the chance to deal with it.\" Approximately 12,000 men in the UK die from prostate cancer every year, making it the country's biggest male cancer. Read more:Starmer 'absolutely' wants Rayner back in cabinetChancellor vows to 'grip the cost of living' An ongoing trial is looking at how healthcare professionals could use PSA tests with other assessments to improve screening. Lord Cameron's interview comes ahead of a meeting on Thursday, which could see the National Screening Committee give the green light for the first NHS screening programme for prostate cancer."
    },
    {
        "title": "Chancellor Rachel Reeves hints at more welfare cuts after previous rebellion - but authority on shaky ground ",
        "description": "It feels like the most torturous build-up to any budget in recent history.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-hints-at-more-welfare-cuts-after-previous-rebellion-but-authority-on-shaky-ground-13474479",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-amanda-akass_6935129.jpg?20250605145201",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-23 13:27:00",
        "Headline": "The government's earlier efforts to reform welfare and save £5bn ended in an inglorious failure.",
        "Content": "\n          Political correspondent\n              @amandaakass\n It feels like the most torturous build-up to any budget in recent history. After a slow and painful climb up the mountain of manifesto-busting income tax increases, a hasty and inglorious retreat. There's been endless speculation about the two-child benefit cap, tax thresholds, mansion taxes, exit taxes, energy bills, and pension schemes. Now, finally, we're just days away. Politics Live: Reeves's 'mansplaining' claims are just a 'smokescreen', says shadow chancellor Chancellor Rachel Reeves has set out her final stall in an opinion piece for The Sunday Times, in a bid to reclaim the iron mantle of fiscal discipline which has become somewhat skew-whiff amid the confusion. She argues that increasing public debt is not a Labour virtue and insists her focus on Wednesday will be to grip inflation and address the cost of living - citing plans to freeze rail fares as an example of dealing with both. But perhaps most interesting is her claim that controlling public spending \"will require us to reform our welfare system too.\" The government's previous efforts to reform welfare and save £5bn ended in an inglorious failure. \n                  Wednesday's budget will be big - and Starmer has some serious convincing to do as he fights for survival\n                 \n                  Rachel Reeves vows to 'grip the cost of living' - despite expectation of tax rises in budget\n                 \n                  Starmer refuses to rule out manifesto-breaking tax rises in budget\n                 Another bloody battle looms Now with a new secretary of state in charge of the Department of Work and Pensions, government fixer Pat MacFadden, Ms Reeves is clearly signalling that she wants to try again. While not exactly a surprise, it sets the stage for another bloody battle with the party's increasingly rebellious backbenchers. Perhaps scrapping the hated two-child benefit cap will be the quid pro quo offered to show she's listening to left-wing concerns.  Transport Secretary Heidi Alexander, who had the unenviable job of avoiding questions about the budget on the Sunday morning broadcast round, was careful to frame the idea of increasing government spending on child poverty within the context of welfare reform. Heavy hint two-child benefit cap to be axed While she technically refused to be drawn on reports the chancellor is set to scrap the cap, she heavily hinted that was to be the case. \"Tackling child poverty is in the DNA of the Labour Party. Nobody wants to see kids going without,\" she told Sky News' Sunday Morning with Trevor Phillips. \"And we know that three-quarters of children who are living in poverty at the moment are in working households and growing up in poverty has consequences that last a lifetime.\" It would be odd to make such a passionate pitch for the party's anti-poverty credentials if the government is about to reject a policy which charities say would be the single most cost-effective measure to reduce child poverty. How much would axing the cap cost? Scrapping the cap is estimated to cost between £3bn and £4bn. When challenged by Trevor Phillips on the fact that polling shows the majority of voters believe the two-child benefit cap is morally right, she responded \"and that is why we are all so determined to make sure that our welfare system is fair\" - before going on to outline the work Mr McFadden is doing to encourage people into employment rather than a life on benefits. The Tories don't believe the Labour Party has any hope of getting welfare cuts past its rebellious backbenchers. \"I want to see the chancellor stand up and explain how she is going to control public spending, particularly welfare,\" said shadow chancellor Sir Mel Stride. \"In order to make sure that we're not having to put up taxes, and she's not going to be breaking all these promises that she's made, yet again.\" Read more from Sky News:PM 'playing whack-a-mole' to keep US on sideJailed ex-Reform leader in Wales 'can't besmirch everyone else' Autumn of disastrous headlines After an autumn of disastrous headlines from the accidental release of foreign prisoners and Angela Rayner's stamp duty to Peter Mandelson's links to convicted sex offender Jeffrey Epstein, the authority of both the prime minister and the chancellor is much shakier now than it was even after the previous welfare rebellion. A review into Personal Independence Payments launched as part of the fallout to those efforts is unlikely to recommend cuts. Getting a greater share of the 6.5 million people currently reliant on benefits into the workplace has long been the holy grail for chancellors looking to boost economic growth - and scale back a spiralling health-related benefits bill which looks set to top £100bn by the end of the decade. But multiple governments have failed to get a handle on the issue. It seems unlikely at this moment of such fractious internal party relations that Rachel Reeves can really rely on the prospect of any serious welfare savings to help balance the books. But she's keen to highlight to both voters and the bond markets that she wants to try."
    },
    {
        "title": "Women in public life 'get more abuse and criticism than men', says Keir Starmer",
        "description": "Women in public life get \"much more abuse and criticism than men\", Sir Keir Starmer has said after Rachel Reeves claimed she was a victim of mansplaining. ",
        "url": "https://news.sky.com/story/women-in-public-life-get-more-abuse-and-criticism-than-men-says-keir-starmer-13474448",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-rachel-reeves_7081298.jpg?20251113172906",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-23 11:36:00",
        "Headline": "The prime minister weighed in after Chancellor Rachel Reeves suggested criticism towards her was motivated by sexism. ",
        "Content": "Women in public life get \"much more abuse and criticism than men\", Sir Keir Starmer has said after Rachel Reeves claimed she was a victim of mansplaining.  Ms Reeves, who is the UK's first female chancellor, suggested in a recent interview with The Times that some criticism towards her is motivated by sexism. Asked about her claims, including that people are \"mansplaining how to be chancellor to me\", the prime minister said: \"I will just say that I strongly believe that women in public life get much more criticism and abuse than men, and I mean that is in politics, but it's also across a number of other areas, I'd also say the media, frankly.\" Speaking to broadcasters from the G20 Summit in South Africa, he added: \"There's abuse and criticism of all politicians, but I'm acutely aware that women get much more abuse and criticism than men do and I think it's about time we acknowledge that.\" Ms Reeves' comments were met with a backlash as they came just days before she is due to deliver her highly anticipated autumn budget, following weeks of speculation about what it will contain. There was chaos last week after an increase in income tax, which many had expected to be on the way, was revealed to no longer be on the cards. Ms Reeves is grappling with weak economic growth, persistent inflation and an expected downgrade to official productivity forecasts as she prepares her statement.  Shadow chancellor Mel Stride said the chancellor's claims about mansplaining were a \"smokescreen to try and get us off what's really happening\". \"This isn't about gender, this is about mismanagement of the economy,\" he told Sky News' Sunday Morning with Trevor Phillips.  \"What Rachel Reeves can't step away from is the fact that unemployment is at a five-year high, spiralling inflation, people feeling worse off, business confidence rock-bottom, anaemic growth. \"And all of those challenges are down to her choices, I'm afraid.\" Read More:What could be in the budget?Reeves hints at more welfare cuts Ms Reeves has pledged to get a grip on the cost of living in her budget, which will be delivered on Wednesday 26 November. Making people better off is a \"fundamental precursor to economic growth\", she wrote in The Sunday Times. However, while no longer expected to raise income tax, an extension of the freeze on income tax thresholds is among rumoured measures to fill an estimated £20bn blackhole in the public finances. This would see more people dragged into paying tax for the first time or shifted into a higher rate as their wages go up."
    },
    {
        "title": "Rachel Reeves vows to 'grip the cost of living' - despite expectation of tax rises in budget",
        "description": "Chancellor Rachel Reeves has promised to&#160;\"grip the cost of living\" in the budget next week.",
        "url": "https://news.sky.com/story/rachel-reeves-vows-to-grip-the-cost-of-living-despite-expectation-of-tax-rises-in-budget-13474338",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves_7071771.jpg?20251104165428",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-23 05:05:00",
        "Headline": "The chancellor is expected to raise taxes when she sets out economic policies on 26 November as she seeks to bridge a multibillion-pound gap in her spending plans.",
        "Content": "Chancellor Rachel Reeves has promised to \"grip the cost of living\" in the budget next week. Writing in The Mirror newspaper, she acknowledged that high prices \"hit ordinary families most\" and that the economy \"feels stuck\" for too many. But at the same time, she is expected to raise taxes when she sets out economic policies on 26 November as she seeks to bridge a multibillion-pound gap in her spending plans. \"Delivering on our promise to make people better off is not possible if we don't get a grip on inflation,\" Ms Reeves wrote in The Sunday Times. \"It is a fundamental precursor to economic growth. It is essential to make families better off and for businesses to thrive. \"There is an urgent need to ease the pressure on households now. It will require direct action by this government to get inflation under control.\" She said reforms would change the welfare system from \"trapping millions of people on benefits\" to one \"designed to help people succeed\".  It comes as the government announced that rail fares will be frozen for the first time in 30 years. The fare freeze applies to England and services run by English train operators.  And it will save commuters on more expensive routes more than £300 a year. Read more:PM refuses to rule out manifesto-breaking tax risesWill government lower energy bills in the budget? Among the rumoured measures in the budget is an extension of the freeze on income tax thresholds, which would see more people dragged into paying tax for the first time or shifted into a higher rate as their wages go up. However, Conservative leader Kemi Badenoch said Ms Reeves should \"have the balls\" to admit that such a move would breach Labour's manifesto promise not to raise taxes on working people."
    },
    {
        "title": "Ex-Reform leader in Wales who took pro-Russia bribes 'can't besmirch everyone else', says party's head of policy Zia Yusuf",
        "description": "Nathan Gill's actions were \"treasonous\" but people should not \"besmirch everyone else at Reform\", the party's head of policy Zia Yusuf has said.",
        "url": "https://news.sky.com/story/ex-reform-leader-in-wales-who-took-pro-russia-bribes-cant-besmirch-everyone-else-says-partys-head-of-policy-zia-yusuf-13474417",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-nathan-gill-reform-uk-in-wales_7087573.jpg?20251123113645",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-23 09:22:00",
        "Headline": "Nathan Gill was jailed after he admitted accepting tens of thousands of pounds in cash to make pro-Russian statements to the media and European Parliament.",
        "Content": " Nathan Gill's actions were \"treasonous\" but people should not \"besmirch everyone else at Reform\", the party's head of policy Zia Yusuf has said. Gill, the former leader of Reform UK in Wales, was jailed for 10 and a half years last week after he admitted accepting tens of thousands of pounds in cash to make pro-Russian statements to the media and European Parliament. Asked by Sky News's Sunday Morning with Trevor Phillips if the case showed the party was soft on President Vladimir Putin, Mr Yusuf said that would be an \"incredibly unreasonable position to take\". He said: \"Nathan Gill, what he did was treasonous, it was horrific, it was awful. He's been dealt with by the authorities and he deserves the sentence that he got.\" He added: \"As far as we're concerned he is ancient history. I've never met him, I had never heard about him until I saw he was in the newspapers. It is unreasonable to besmirch Reform and the millions of people around the country who support Nigel and support our party.\" Gill, 52, was announced as the leader of Reform UK in Wales in March 2021, but quit the party a few months later after he failed to be elected to the Senedd. He previously led the Welsh wing of UKIP (UK Independence Party) between 2014 and 2016, then ran by Nigel Farage, and was a member of the Senedd between 2016 and 2017, as well as an MEP between 2014 and 2020. \n                  Wednesday's budget will be big - and Starmer has some serious convincing to do as he fights for survival\n                 \n                  Sir Keir Starmer 'absolutely' wants Angela Rayner back in cabinet\n                 \n                  David Cameron reveals he has been treated for prostate cancer\n                 Gill left UKIP in 2019 to join Mr Farage's new Brexit Party - later rebranded as Reform UK. Following an investigation by counter-terrorism police, officers said they believe Gill likely took a minimum of £40,000 in cash. Prime Minister Sir Keir Starmer demanded an investigation into links between Reform UK and Russia following the case. Mr Farage's position on Russia has come under scrutiny in the past. He faced a backlash during the general election campaign when he spoke about the incursion of NATO and how \"we provoked this war\" in Ukraine. Read more:Starmer demands investigation into Reform-Russia links Speaking to Trevor Phillips, Mr Yusuf insisted his boss has never supported or been sympathetic to Russia's decision to invade Ukraine, saying it is \"not Nigel's position that 'we provoked the war'.\" He said: \"When he [Farage] was pressed as to how he would respond if he was prime minister and Russian jets encroached into NATO airspace, his view was that those planes should be shot down. We are crystal clear about our position. \"I would also say this: the notion that Vladimir Putin, the murderous dictator, is making decisions based on what Nigel Farage is saying here in England, I think is for the birds. \"We are now in a situation where Ukraine's sovereignty has been violated, and Vladimir Putin needs to be brought to heel.\" But Labour accused Reform of \"pandering to Moscow\" following the interview. Anna Turley, chair of the Labour Party, said Mr Farage has previously called Mr Putin \"the leader he most admired and has repeatedly parroted Kremlin talking points\". She added: \"Reform must urgently allow an independent investigation to root out pro-Russia links, to assure the public that Putin holds no sway over their party or its representatives.\" Read more from Sky News:Reeves vows to 'grip the cost of living'PM 'playing whack-a-mole' to keep US on side Police have confirmed Mr Farage has not been part of the investigation into Gill. Mr Farage said on Friday: \"An investigation into Russian and Chinese influence over British politics would be welcome.\" The Reform UK MP for Clacton had previously described his former colleague as a \"bad apple\" and said he was \"shocked\" after Gill pleaded guilty to bribery. He said: \"Any political party can find in their midst all sorts of terrible people. \"You can never, ever guarantee 100% that everyone you meet in your life, you shake hands with in the pub, is a good person.\""
    },
    {
        "title": "Behind the scenes at COP30: How they reached the final deal",
        "description": "It was the showdown nobody wanted. But in the end, it saved the climate summit.",
        "url": "https://news.sky.com/story/behind-the-scenes-at-cop30-how-they-reached-the-final-deal-13474547",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews_7089930.jpg?20251123180805",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-23 16:24:00",
        "Headline": "The all-night session was kept afloat by coffee that arrived about every two hours, saltine crackers and traditional Brazilian cheese dough-balls. As the sun dawned, a path emerged.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  It was the showdown nobody wanted. But in the end, it saved the climate summit. As the clock ticked past the deadline of 6pm on Friday in Belem, Brazil, the issue that, rightly or wrongly, came to define this year's UN climate talks was still unresolved. The great, unanswered question was how to talk about fossil fuels: two words pathetically controversial for a summit trying to tackle climate change, given they are the main cause. But it had taken 28 COP meetings to even name those words in a deal. Finally, the promise came in Dubai in 2023 to \"transition away from fossil fuels\". The decision, known as the \"UAE consensus\", was hailed as \"historic\" at the time. But few countries have done much about it since. Two years later in Brazil, a push for a plan at COP30 on how to actually transition from fossil fuels gathered steam, garnering support from at least 80 countries. They had already set the target in Dubai, this was about how to get there. The proposal was made more credible by the fact that it wasn't just wealthy Europeans such as the UK and Germany, with little fossil fuels themselves anyway, who were supporting it. It was also backed by countries including the oil-rich Sierra Leone, where two in three people still need electricity, and coal-major Colombia. But it was too much to stomach for economies that rely on fossil fuels, like Russia and the Arab negotiating group. A bombshell draft of the final deal that landed on the table on Friday had deleted all three earlier proposals for a fossil fuel plan. The European Union commissioner Wopke Hoekstra was livid. \"This current thing is clearly a non-starter, and we will need to significantly beef this up,\" he said as he charged through the main tent of the conference, flanked by aides and journalists scavenging for soundbites. \"If that doesn't happen, we're clearly facing a no-deal scenario.\" Colombia was spitting feathers. \"We cannot accept a text that is not dealing with the real problems. We won't be silent,\" thundered its environment minister Irene Velez Torres. A sweltering meeting of ministers, drowned out by the sound of generators and Amazon rain pounding on the tent above, had yielded nothing. The mighty all-nighter Then came the more than 12-hour, overnight session that nearly collapsed the whole process - before finally breaking the deadlock. Early evening on Friday, upstairs in the UN-patrolled conference, the Brazilian president of the talks, Andre Aranha Correa do Lago, met with around 80 people from different negotiating groups. The protagonists on the one side included China, Saudi Arabia and India, who in fact are already transitioning their energy systems away from fossil fuels, but resent being told to speed up by countries that have already got rich from their own fossil fuel-powered industrial revolutions. On the other side of the still yawning chasm were the UK, EU, Latin American countries and small island states, who thought the credibility of the COP process was on the line if they didn't inch forward on tackling fossil fuels. It was a squabble over semantics, but at its heart the tension was over the pressing need to act faster on climate change, and who is to blame for that urgency. This is when it does pay to have made rapid progress on climate action back home, as Britain broadly has, because it strengthens your hand when asking other countries to do more. But the two groups remained diametrically opposed. COPs are always tense at the end, but the stakes felt higher than in previous years because countries were considering walking away. \"It felt on a knife edge,\" said someone close to the negotiations, speaking on condition of anonymity, as all diplomats at COP do to protect relationships. UK energy secretary Ed Miliband said on Saturday: \"I spent much of the night thinking, genuinely, we were not going to get an agreement, and for us, we were willing to walk away.\" Cruise ships, coffee and crackers The all-night session was kept afloat by coffee that arrived about every two hours, saltine crackers and traditional Brazilian cheese dough-balls. \"Various folks arrived through the night. [Brazil's climate minister] Marina Silva was there at one point. Senior Chinese and Saudi figures turned up at possibly 4 or 5am, but I've lost track of time,\" said one person familiar with what happened. Some aides peeled off to go and check out from the cruise ship where they'd been staying - brought in by Brazil due to a lack of hotel rooms in rough-and-ready Belem - before it was rumoured to set sail at 8am on Saturday. Others couldn't keep their eyes open. \"There were people negotiating on one end of sofa, and snoring on the other end,\" another person present told Sky News. \"Someone else was sitting on the floor, holding onto a fire extinguisher, asleep. It was hot.\" By hosting the COP on the edge of the Amazon rainforest, Brazil gave visitors a taste of life in a hotter world: almost daily 30°C heat, 80% humidity, and torrential downpours that flood roads and wash out livelihoods. A new dawn Inside the venue, finally, as the sun dawned on Saturday morning, a path emerged. The bleary-eyed ministers and negotiators still standing at about 6am figured out they could hint at a fossil fuel plan, but without saying the words out loud. The final agreement is a fudge: it promises to \"accelerate implementation\", taking into account previous decisions \"such as the United Arab Emirates Consensus\" - in a nod to the previous fossil fuel pledge. Ed Miliband said: \"We thought there had to be an acknowledgement of the UAE consensus... We thought we weren't going to get it. We thought we were quite potentially looking at no deal. \"And then, just before seven o'clock in the morning, that opened up, and that's what opened the space for there to be an agreement.\" Climate-progressive countries didn't really want to leave with nothing - afraid a breakdown would play into the hand of Donald Trump, who is pulling the US out of the process. So they accepted the compromise and a voluntary process on fossil fuels to be launched outside of the COP process. Applause masked disappointment There were then a few hours to dash back to hotels, perhaps grab 90 minutes of sleep and a shower, before coming back for the closing session to see the deal signed off. Nothing is official until the final gavel falls. \"What struck me in those moments was nobody in that room really wanted to be the people who brought the thing down,\" said a bleary-eyed Mr Miliband on Saturday, looking like he could topple over at any moment. \"But actually there was a will to keep the show on the road.\" Another source told Sky News that China was anxious to get an agreement. Once back in the plenary hall, the agreement was so fragile, many feared it could all still fall apart. When the COP president Mr do Lago proclaimed the deal done and struck his ceremonial gavel, the room erupted in a standing ovation. The truth is that the applause masked a lot of disappointment. COP is the annual test of the world's appetite for tackling climate change and working together - and both are falling out of fashion. What they were really cheering was that they had any deal at all. A few rays of hope came from other promises to finally triple cash for developing countries to cope with ever more extreme weather, more money for forests, and recognition that the switch to clean energy needs to be fair for workers and communities. The final package was no crowning glory of the COP process. It was a glue that kept the process stuck together, in a fractured world, for now."
    },
    {
        "title": "TikTok boss insists teens' safety not at risk from AI moderation ",
        "description": "There's a lot going on at TikTok right now.&#160;",
        "url": "https://news.sky.com/story/tiktok-boss-insists-teens-safety-not-at-risk-from-ai-moderation-13473610",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ali-law-tiktok_7087692.png?20251121155050",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-23 00:01:00",
        "Headline": "Ali Law, TikTok's director of public policy and government affairs for northern Europe, sat down with Sky News to talk about safety on the platform.",
        "Content": "\n          Science and technology reporter\n        There's a lot going on at TikTok right now.  As well as online safety updates and new features, the company is introducing sweeping changes to how it moderates the platform's content. At the same time, there's an intense focus on online safety, particularly here in the UK. With all that going on, Sky News got a rare, exclusive sit-down with one of TikTok's senior safety executives, Ali Law. The increasing role of artificial intelligence  One of the biggest changes happening at TikTok is around artificial intelligence. Like most social media companies, TikTok has used AI to help moderate its platform for years - it is useful for sifting out content that obviously violates policies, and TikTok says it now removes around 85% of violative content without getting a human involved. \n                  Nvidia beats expectations again in defiance of AI bubble fears\n                 \n                  Half of novelists fear AI will replace them entirely, survey finds\n                 \n                  AI bubble fears take hold of stock markets and bitcoin\n                 Now, it is increasing its use of AI and will be relying less on human moderators. So what's changed that means TikTok is confident AI can keep young users safe? \"One of the things that has changed is really the sophistication of those models,\" said Mr Law, who is TikTok's director of public policy and government affairs for northern Europe. He explained that AI is now better able to understand context. \"A great example is being able to identify a weapon.\" Whereas previous models may have been able to identify a knife, newer models can tell the difference between a knife being used in a cooking video and a knife in a graphic, violent encounter, according to Mr Law. \"We set a high benchmark when it comes to rolling out new moderation technology. \"In particular, we make sure that we satisfy ourselves that the output of existing moderation processes is either matched or exceeded by anything that we're doing on a new basis. \"We also make sure the changes are introduced on a gradual basis with human oversight so that if there isn't a level of delivery in line with what we expect, we can address that.\" Human moderator jobs being cut That increasing use of AI means TikTok will rely less on its network of tens of thousands of human moderators around the world. In London alone, the company is proposing to cut more than 400 moderator jobs, although there are reports a number of those jobs will be rehired in other countries. On 30 October, Paul Nowak, general secretary of the TUC union, said \"time and time again\" TikTok had \"failed to provide a good enough answer\" about how the cuts would impact the safety of UK users. When Sky News asked if Mr Law could ensure UK users' safety after the cuts, he said the company's focus is \"always on outcomes\". \"Our focus is on making sure the platform is as safe as possible. \"We will make deployments of the most advanced technology in order to achieve that, working with the many thousands of trust and safety professionals that we will have at TikTok around the world on an ongoing basis.\" The UK's science, technology and innovation committee, led by Labour MP Chi Onwurah, has issued a probe into the cuts, with Ms Onwurah calling them \"deeply concerning\". She said AI \"just isn't reliable or safe enough to take on work like this\" and there was a \"real risk\" to UK users. However, Mr Law said that, as a parent himself, he is \"also highly concerned and highly interested in issues of online safety\". \"That's why I'm so confident in the changes that we are making at TikTok in terms of content moderation as a whole,\" he said. \"The power really comes in the combination of the best technology and human experts working together, and that still is the case at TikTok and it will be going forwards as well.\"  New wellness tools The interview came at the end of an online safety event at TikTok's Dublin office, its European headquarters. During the conference, the company announced a number of new features designed to increase user safety, including a new in-app Time and Wellbeing hub for TikTok users. The hub is designed with the Digital Wellness Lab at Boston Children's Hospital and gamifies mindfulness techniques like affirmations, not using TikTok during the night and lowering your screentime. Read more from Sky News:Meta to block Instagram and Facebook for users under 16 in AustraliaHalf of novelists fear AI will replace them entirely, survey findsHow violent extremists are thriving online - and why it's getting harder to catch them Cori Stott, executive director of the digital wellness lab, said many people use their phones to \"set their wellbeing, to reset their emotions, to find these safe spaces, and also to find entertainment\". The hub was built as part of the TikTok app because young people want wellness tools \"where they already are\", without needing to go to a different app, she said. Still, there are plenty of reports suggesting that phone use and social media has a damaging effect on young people's mental health… is TikTok trying to solve a problem of its own creation? \"If you are a teen on the app, you will load up and find that you have, if you're under 16, a private profile, no access to direct messaging, a screen time limit set at an hour, [and at] 10pm sleep hour suggestion,\" said Mr Law. \"So the experience is one that does try and promote a balanced approach to using the app and make sure that people have the options to set their own guardrails around this,\" he said. \"I think the other thing I'd say is that the content on TikTok is, in the main, inspiring, surprising, creative.\""
    },
    {
        "title": "Ukrainian sumo wrestler makes history in Japan",
        "description": "A Ukrainian sumo wrestler who left his homeland after Russia's full-scale invasion has made history in Japan.",
        "url": "https://news.sky.com/story/ukrainian-sumo-wrestler-makes-history-in-japan-13474477",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sumo-yavhusishyn_7089571.jpg?20251123132105",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-11-23 13:08:00",
        "Headline": "Danylo Yavhusishyn, who fled Ukraine in the wake of Russia's full-scale invasion of his homeland, is a rising star in the world of sumo wrestling.",
        "Content": "A Ukrainian sumo wrestler who left his homeland after Russia's full-scale invasion has made history in Japan. Danylo Yavhusishyn, also known by his ring name of Aonishiki Arata, has become the first competitor from his country to win an elite-level tournament. He defeated Hoshoryu Tomokatsu, a top-ranked Mongolian wrestler. Yavhusishyn was asked in his winning ceremony interview if was pleased with his results in sumo. \"No, I think this is just the beginning,\" he said. Yavhusishyn left Ukraine as a teenager in 2022 after Russia launched a full-scale invasion of his country. Speaking at a news conference last month, he said: \"I hope that people from Ukraine will be able to see my sumo, and have some kind of encouragement from that.\" \n                  One killed and 170 homes damaged or destroyed as fire burns in Japan\n                 \n                  Japan sends in troops to help tackle deadly bear attacks\n                 \n                  The 40 million Americans without food because of the government shutdown\n                 Yavhusishyn, 21, won the deciding match in the 15-day Kyushu Grand Sumo Tournament in Fukuoka, southwestern Japan, on Sunday, and he received the Prime Minister's Cup from Takahiro Inoue, an adviser to Prime Minister Sanae Takaichi. He had decided to travel to Japan following the Russian invasion after striking up a friendship with a Japanese wrestler at a tournament in 2019. Read more from Sky News:Fierce battle for key Ukrainian townsPeace plan 'not final offer' - Trump Ukraine has a strong Olympic wrestling tradition. Zhan Beleniuk won a gold medal in the Greco-Roman category at the 2020 Tokyo Games, staged in 2021 due to the COVID pandemic. The stars of sumo descended on London's Royal Albert Hall last month for a major tournament.  It was only the second time a Grand Tournament had been held outside of Japan in the sport's long history. The five-day tournament was won by 26-year-old Hoshoryu."
    }
]