[
    {
        "title": "Ballots being counted in key by-election test for Starmer and council contests",
        "description": "Ballots are being counted in a series of council elections, mayoral votes, and a key by-election test for Sir Keir Starmer.",
        "url": "https://news.sky.com/story/polls-close-in-thousands-of-council-elections-and-key-by-election-test-for-starmer-13359552",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-election-result-count_6903124.jpg?20250502022519",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-05-01 21:05:00",
        "Headline": "This is the first major electoral test for the Labour government, as well as Kemi Badenoch and Nigel Farage, after the general election last year.",
        "Content": "\n          Political reporter\n        Ballots are being counted in a series of council elections, mayoral votes, and a key by-election test for Sir Keir Starmer. More than 1,600 council seats are up for grabs across 23 local authorities, while four regional mayors and two local mayors will be elected. In Runcorn and Helsby voters are choosing a new MP after Labour's Mike Amesbury resigned following his conviction for punching a constituent. Betting odds had Reform ahead of the incumbent party in the by-election, and government parties tend to do poorly in by-elections. Politics latest: Follow the results live Already, the Labour Party is managing expectations that they may lose the seat. Speaking about the by-election and polls more widely, Ellie Reeves, the party's chair, said: \"These elections were always going to be a challenge, being held largely in areas dominated by the Conservatives, often for decades. That's why Labour candidates stood on a promise to bring change right across our country. \n                  Kneecap apologise to families for 'kill your MP' remarks\n                 \n                  Local elections 2025: The first public test for party leaders\n                 \n                  Kemi Badenoch does not rule out local coalitions with Reform after Thursday's council elections\n                 \"There are promising signs that the Labour government's plan for change is already starting to turn around 14 years of Tory failure. \"NHS waiting lists have fallen consistently. Free breakfast clubs are starting to roll out in every primary school. Some 3.5 million workers got a pay rise with the minimum wage increase this month, with pensions rising thanks to Labour's commitment to the triple lock.\"But we know people aren't yet fully feeling the benefit and we are just as impatient for change as the rest of the country. However the results turn out this evening, this Labour government will go further and faster in turning our country around and giving Britain the future it deserves.\" A Reform UK spokesperson said: \"We have fought a strong campaign. The two major parties are more fearful of the results tonight than we are.\" Sky News interviews party leaders:Sir Keir StarmerKemi BadenochNigel FarageSir Ed DaveyCarla Denyer  Torrid for the Tories? Because of the way local elections work, there were a large number of Conservative councillors up for election, compared to the other parties. With their favourability ratings still low, it is likely many will lose their seats. However, they are pinning their hopes on Labour doing badly, with murmurings of disquiet about Ms Badenoch's leadership. A Conservative spokesperson said: \"Tonight will be the first real test of Keir Starmer's Labour government, ten months after they won an unprecedented majority at the general election. \"The Conservatives have started on the process of renewing our party under Kemi Badenoch's leadership. But we also have always been clear that these would be tough elections for the party - defending an incredibly high watermark from 2021 when we took two-thirds of all seats. \"If the 2024 general election was replicated on today's battleground, we would lose control of almost every single council.\" According to Liberal Democrat leader Sir Ed Davey, the party is expecting \"big gains\" off the Tories in the Conservative's \"former middle England heartlands\". The Greens are also anticipating a good set of elections. In the first result of the night, Labour held on to the North Tyneside mayoralty by just 444 votes. Five other mayoralties are also up grabs: Cambridgeshire and Peterborough, West of England, Greater Lincolnshire, Hull and East Yorkshire, and Doncaster.  Mr Farage told Sky News political editor Beth Rigby his party have a good chance in Hull, Lincolnshire and perhaps Doncaster. Join Sky News presenter Jonathan Samuels and deputy political editor Sam Coates to follow the results. Lead politics presenter Sophy Ridge, political editor Beth Rigby, and data and economics editor Ed Conway will take over on Friday morning to report and explain what has happened."
    },
    {
        "title": "Labour hold North Tyneside - follow mayoral election results as they come in",
        "description": "Six mayors are being elected in England, with most of the mayoralties last contested in 2021.",
        "url": "https://news.sky.com/story/the-mayoral-election-results-in-full-13354442",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mayoral-elections-mayors_6894862.jpg?20250423173455",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-01 21:00:00",
        "Headline": "Labour are defending four out of six mayoral contests, and the other two are newly created mayors. Results will be updated on this page as they come in through the night.",
        "Content": "Six mayors are being elected in England, with most of the mayoralties last contested in 2021. These include four combined authority mayorsi , otherwise known as metro mayors, as well as two city mayors. Two of the mayors will take up new positions in the Hull and East Yorkshire, and Greater Lincolnshire combined authorities. The other mayoralties were all last contested in 2021. Vote 2025 - latest updates Metro mayors • Cambridgeshire and Peterborough• Greater Lincolnshire• Hull and East Yorkshire• West of England City mayors • Doncaster• North Tyneside (LABOUR HOLD) All of these mayoralties will be elected under a first-past-the-post electoral system, which is also used for Westminster parliamentary elections. See below for more detailed breakdowns of results for each race. Metro mayors There are four metro mayors being elected in combined authorities. These mayors are elected by voters from several different areas and counting will take place at local council level. Tables will be updated as each local area reports its result. Cambridgeshire and Peterborough First established in 2017, the combined authority covers six areas. These are Peterborough, Fenland, Huntingdonshire, East Cambridgeshire, South Cambridgeshire, and Cambridge local council areas. Labour won the mayoralty from the Conservatives when it was last contested in 2021. Greater Lincolnshire This is a new mayoralty, being elected for the first time in 2025. The combined authority covers nine areas. These are North Lincolnshire, North East Lincolnshire, Boston, Lincoln, East Lindsey, West Lindsey, North Kesteven, South Kesteven, and South Holland local council areas. Hull and East Yorkshire This is a new mayoralty, being elected for the first time in 2025. The combined authority area covers both Hull City and East Riding of Yorkshire local council areas. West of England The combined authority covers three areas: Bristol City, South Gloucestershire, and Bath and North East Somerset local council areas. The authority was established in 2017. Labour won the mayoralty from the Conservatives when it was last contested in 2021. City mayors There are two city mayors being elected, one for Doncaster and one for North Tyneside. Labour's Ros Jones has been the Mayor of Doncaster since 2013, and is running for re-election this year. Labour have managed to hold onto the mayoralty of North Tyneside with a razor-thin majority of just 444 votes, with Reform coming in second place."
    },
    {
        "title": "NHS may offer weight loss jabs over the counter at pharmacies",
        "description": "Patients will be able to get weight loss injections from pharmacies, according to reports.&#160;",
        "url": "https://news.sky.com/story/nhs-may-offer-weight-loss-jabs-over-the-counter-at-pharmacies-13359595",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wegovy-jabs_6903107.jpg?20250502001700",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-01 23:09:00",
        "Headline": "It's claimed drugs like Ozempic could be available after a short consultation at a cost of £9.90 - broadening access to these jabs considerably.",
        "Content": "Patients will be able to get weight loss injections from pharmacies, according to reports.  It's claimed drugs such as Ozempic and Mounjaro could be available over the counter after a short consultation - at the cost of an NHS prescription. This would broaden access to these jabs considerably, as the health service currently restricts injections to those regarded as having the highest clinical need.  At the moment, there is a two-year waiting list for Wegovy on the NHS - and last year, research by Sky News showed the rollout is happening far more slowly than planned. Thousands of people with severe obesity have been denied access to the treatment, with doctors previously claiming that a \"soul-destroying\" postcode lottery has emerged. According to the Daily Mail, a multimillion-pound deal for a pilot scheme will be struck with a pharmaceutical firm, with a view to issuing prescriptions through chemists and health centres. They would be priced at £9.90 - the same as an NHS prescription - and substantially less than the £150-a-month cost of obtaining these injections privately. \n                  Wales to introduce same-day mental health care, Welsh government says\n                 \n                  NHS prescription charges in England frozen for first time in three years\n                 \n                  Nazi flags, patient 'sexually assaulted', 'dog poo left at whistleblower's home': Sky News investigates UK's 'worst ambulance service'\n                 But the reports have been described as \"speculative\", with health experts warning obesity drugs must only be used under medical supervision by those who are eligible.  A government spokesperson said: \"As the government shifts the NHS from sickness to prevention, we will be looking across the board at how these drugs can be made available to more people who can benefit from them. \"The NHS is already tackling obesity in innovative ways, including through community care models and digital technologies, to help deliver these drugs as part of a rounded package of care.\" Previous estimates from the National Institute for Health and Care Excellence (NICE) have suggested that 3.4 million people in England could benefit from weight loss injections. But last December, NICE said these jabs would only be available to 220,000 patients on the NHS in the first three years - meaning millions of others could end up waiting up to 12 years for treatment. Read more from Sky News:Harrods targeted by cyberattackersUK's hottest start to May on recordPolice horses attacked by dog in park  Studies show people lose on average 15% of their body weight within months of starting treatment with Wegovy. The drug mimics a natural hormone and people feel fuller faster and for longer. Obesity costs the NHS £6bn a year and is linked to 200 different diseases. Half of all obese people with three related problems, such as high blood pressure or diabetes, die within 10 years."
    },
    {
        "title": "'My dad was shot down over the Soviet Union' - what happens when a US spy plane gets caught?",
        "description": "\"My dad was shot down over the Soviet Union,\" Gary says. \"As a kid I thought it was normal, everybody's dad goes through this.\"",
        "url": "https://news.sky.com/story/my-dad-was-shot-down-over-the-soviet-union-what-happens-when-a-us-spy-plane-gets-caught-13359128",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-u-2-francis-gary-powers_6902729.jpg?20250501154813",
        "type": "Home",
        "Author": "Michael Drummond",
        "Date Published": "2025-05-01 09:31:00",
        "Headline": "In May 1960 an American U-2 spy plane flew over Russian missile sites. The US thought it was beyond the reach of Soviet air defences. They were wrong. Sixty-five years later, what's changed?",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n \"My dad was shot down over the Soviet Union,\" Gary says. \"As a kid I thought it was normal, everybody's dad goes through this.\" In the thick of the Cold War an American spy plane flew over Russian missile sites, taking pictures for the CIA. The US thought that at 70,000 feet their U-2 aircraft was beyond the reach of Soviet air defences. They were wrong. What resulted from the downing of the U-2 plane and the capture of pilot Francis Gary Powers was an international incident that could have led to nuclear war. Sixty-five years later, with conflicts raging in Ukraine, Gaza and elsewhere, militaries around the world still gather intelligence in a game of espionage cat-and-mouse. Could something similar happen again? What happened on 1 May, 1960? Wanting to know what missile capabilities the Soviets had, President Dwight D Eisenhower authorised a series of flights by U-2 spy planes over modern-day Russia. \n                  ISIS and the Yazidis: The women they tried to erase\n                 \n                  Trump latest: President changes inner circle - day after Waltz pictured using same app at centre of war chat security breach\n                 \n                  Wildfire in Israel burns 5,000 acres as drivers forced to flee cars\n                 \"As the United States saw it, although they knew that the overflight of Soviet territory was against international law, they regarded their activity as taking a peek behind the Iron Curtain in order to get an idea of Soviet preparedness,\" says Sean Rehling, a curator at the Imperial War Museum in Duxford. Powers was flying near Sverdlovsk when his U-2 aircraft was brought down by a Soviet missile. He was able to parachute to safety, but was captured. The Americans, not knowing yet that Powers was still alive, claimed that a weather research aircraft had strayed into Soviet territory. So when Soviet premier Nikita Khrushchev announced that a US pilot had been captured they were caught in a lie. Powers was put on a public show trial and sentenced to prison, but was released in 1962 in exchange for Soviet spy, Rudolf Abel. Rehling says the U-2 incident ratcheted up tensions between the US and the USSR, and perhaps emboldened Khrushchev to pursue a bold, risky diplomacy that led to the crisis point when Soviet missiles were deployed to Cuba. “We see the culmination of this when, almost two half years later in the Cuban Missile Crisis, the Soviet Union appeared to be adopting a much more confrontational attitude to the United States. “The world became step by step this gradually more dangerous place” 'I wanted to find out the truth' \"My father was very controversial when he returned home,\" his son Gary, 59, tells Sky News. \"Was he a hero, was he a traitor? Did he defect?\" Released on a bridge in Berlin one cold, foggy morning, Powers was taken back to the US where he was questioned first by the CIA, and then by a Senate committee. He was cleared by both. Learning about what happened growing up, Gary pestered his dad for details of the incident. \"How high were you flying on 1 May?,\" he would ask. \"Gary, I can't tell you that,\" his father would reply. Powers died in 1977, aged 47. Despite being officially cleared of any wrongdoing, he's never quite able to shake the questions about what happened. His son never stopped wondering about the U-2 incident. \"I wanted to find out the truth of what he went through,\" Gary says. He founded The Cold War Museum in Virginia in 1996 and regularly runs tours about espionage history, which of course includes the U-2 incident involving his father. Read more from Sky News:The political novice elected by Canadian votersWhat Sky News witnessed at Pope's funeral Is the U-2 incident still relevant in 2025? It may be more than six decades since 1 May, 1960, but the lessons of the U-2 incident still resonate today. NATO fighter jets are regularly scrambled to respond to Russian spy planes approaching the alliance’s borders, while Western surveillance planes operate over the Black Sea, gathering intelligence for Ukraine. “Even though Power's aircraft was shot down 65 years ago, the world in which we live is a legacy of the Cold War,” Rehling says. “Today, even though nations might not necessarily know who a potential adversary or enemy may be, gathering intelligence is just as important as it was during the Cold War.” Gary argues that the U-2 incident is still relevant, mirrored in the geopolitical jostling between NATO, the US, Russia and China. “It’s a cat-and-mouse game, trying to find out what the other side is doing and not getting caught doing it.”"
    },
    {
        "title": "US national security adviser Mike Waltz to leave role in first major change to Trump's team",
        "description": "US national security adviser Mike Waltz is leaving his post and is set to be replaced by secretary of state Marco Rubio.",
        "url": "https://news.sky.com/story/us-national-security-adviser-mike-waltz-to-leave-role-13359325",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mike-waltz-national-security-adviser_6902775.jpg?20250501163626",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-01 15:00:00",
        "Headline": "Mr Waltz's departure is the first major change in Donald Trump's top team and comes shortly after he marked 100 days in office.",
        "Content": "US national security adviser Mike Waltz is leaving his post and is set to be replaced by secretary of state Marco Rubio. Donald Trump said on Thursday that he was naming Mr Rubio as acting national security adviser and had nominated Mr Waltz to be the next US ambassador to the United Nations. Mr Rubio will continue to serve as secretary of state, Mr Trump said. Confirming the moves in a post on Truth Social, the president praised Mr Waltz, who, he said, had \"worked hard\" to advance US interests. \"In the interim, Secretary of State Marco Rubio will serve as National Security Advisor, while continuing his strong leadership at the State Department. Together, we will continue to fight tirelessly to make America, and the world, safe again,\" Mr Trump said. Mr Waltz said he was \"deeply honored to continue my service to President Trump and our great nation\". Mr Waltz faced scrutiny for creating a chat on messaging app Signal in which defence secretary Pete Hegseth and other officials discussed strikes on Yemen's Iran-backed Houthis. It came to light after Mr Waltz accidentally added a US journalist to the group. Trump latest: Waltz 'leaving White House' Signal is regarded as highly secure and has end-to-end encryption, but is a commercial app and is not classified by US officials. A transcript showed Mr Hegseth provided timings of aircraft launches and when bombs would drop. Mr Waltz said he took \"full responsibility\" but insisted he didn't know how Jeffrey Goldberg ended up on the chat and maintained he didn't know the journalist. The White House said no classified information was shared and publicly stood by Mr Waltz.  However, Reuters and AP news agencies cited anonymous sources on Thursday and said he would now leave after less than five months in the job. His deputy, Alex Wong, is also said to be going. Mr Waltz is a highly decorated special forces veteran and the first Green Beret to serve in Congress. The 51-year-old was also Donald Trump's fifth permanent national security adviser, after he went through four during his first term. His departure is the first major change in the president's top team this time round - and comes shortly after he marked 100 days in office. It's so far unclear who will take over. Read more from Sky News:Musk fury over report Tesla looking for new bossHarris attacks Trump in biggest speech since election  The 'Signalgate' episode, which came to light in March, was reportedly not the only breach of security protocol involving senior officials. Mr Hegseth is said to have had his wife, brother and lawyer on another group chat about the Yemen strikes. Mr Trump has publicly backed Mr Hegseth, saying today said he was doing a \"fantastic job\", but some experts believe his position is also at risk."
    },
    {
        "title": "Mike Waltz's 'Signalgate' mistake weakened Trump - so why isn't Pete Hegseth also getting fired?",
        "description": "Timing's everything for Donald Trump.&#160;&#160;",
        "url": "https://news.sky.com/story/waltzs-signalgate-mistake-weakened-trump-so-why-isnt-pete-hegseth-also-getting-fired-13359388",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mike-waltz-national-security_6902868.jpg?20250501190450",
        "type": "Home",
        "Author": "James Matthews",
        "Date Published": "2025-05-01 16:31:00",
        "Headline": "Sharing sensitive military information on a group chat was a reckless error of judgement and raised questions over the president's decision to appoint him.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Timing's everything for Donald Trump.   The time for sacking Mike Waltz was, clearly, not before the 100-day milestone - the measure of his performance in office. The national security adviser had his card marked from the day the 'Signalgate' scandal broke. Trump latest: Waltz 'leaving White House' hours after TV appearance In any other government, at any other time, political expediency would have demanded his immediate sacking. To have shared sensitive military information on a group chat is a most reckless error of judgement. Bad enough that the information reached the inbox of a US journalist - who knows who else might have accessed the information in what is a commercially available app? China, Russia? Iran, the very country that backs the Houthi rebels who were under attack? \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  US national security adviser Mike Waltz to leave role in first major change to Trump's team\n                 \n                  What US-Ukraine minerals deal means for Putin\n                 Initially, Donald Trump defended Waltz as a \"good man\" who had \"learned a lesson\". The president will have known, though, that he's a man who has fundamentally weakened him. Waltz's mistake put the lives of US service personnel at risk and called into question the credibility of his ultimate boss. The emoji-laden group chat read like the stuff of excited youngsters breathlessly sharing gossip. It was recklessness over responsibility at the heart of government, and it reflected on the commander-in-chief and his judgement in appointing Waltz in the first place.  To keep him in post for weeks following the scandal looked like an acceptance, of sorts, and it didn't look good. If there are questions about the circumstances surrounding Waltz, there are, too, about Trump's defence secretary, Pete Hegseth. Hegseth was also part of the Signalgate group chat and more. Separately, he shared messages on Signal with his wife and brother about military strikes. Both are involved with the Pentagon, but are nowhere near the security clearance typically required to access that kind of detail. Read more from Sky News:Musk fury over report Tesla looking for new bossHarris attacks Trump in biggest speech since election If Waltz committed a sackable offence, why didn't Hegseth? It's a question that won't go away. The answer, I suspect, is that Donald Trump invested considerable political capital in forcing Hegseth into position, in spite of strong opposition. In a story that acknowledges weakness at the heart of government, Donald Trump has his limits."
    },
    {
        "title": "Luxury store Harrods is latest retail victim of cyber attackers",
        "description": "Harrods, the luxury London department store, has become the latest in a string of prominent retailers to be targeted by cyber hackers.",
        "url": "https://news.sky.com/story/luxury-store-harrods-is-latest-retail-victim-of-cyber-attackers-13359363",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20241025145441",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-01 15:53:00",
        "Headline": "Harrods has \"restricted internet access\" after an attempt to gain access to its systems left some customers struggling to pay for purchases, Sky News can reveal. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods, the luxury London department store, has become the latest in a string of prominent retailers to be targeted by cyber hackers. Sky News has learnt that Harrods has been engaged in attempts to fend off a cyber attack after similar incidents in recent days involving Marks & Spencer and the Co-op Group. Follow updates: M&S 'forced to halt all recruitment' | Money Further details of the apparent Harrods cyberattack were unclear on Thursday afternoon, although one customer of the upmarket store told Sky News he had been unable to pay for a purchase earlier in the day. 👉 Listen to Sky News Daily on your podcast app 👈 In a statement issued in response to an enquiry from Sky News, a Harrods spokesperson said: \"We recently experienced attempts to gain unauthorised access to some of our systems. \"Our seasoned IT security team immediately took proactive steps to keep systems safe, and as a result, we have restricted internet access at our sites today. \"Currently, all sites including our Knightsbridge store, H beauty stores and airport stores remain open to welcome customers. \"Customers can also continue to shop via harrods.com. \"We are not asking our customers to do anything differently at this point, and we will continue to provide updates as necessary.\" Read more:The notorious hackers linked to M&S cyber attack The concentration of cyber attacks on retailers underscores the growing centrality of the risk attached to consumer-facing companies' online operations. Harrods, which is owned by a Qatari sovereign wealth fund, is said to be engaging specialists to help resolve and investigate the issue. M&S has been unable to accept online orders for the last week as a result of its cyber incident."
    },
    {
        "title": "Murder suspect allegedly asked 'do you like it?' as he stabbed man to death in video shown to jury",
        "description": "A suspected double murderer appeared to ask one of his alleged victims \"do you like it?\" as he stabbed him to death in a video that has been shown to a jury.",
        "url": "https://news.sky.com/story/murder-suspect-allegedly-asked-do-you-like-it-as-he-stabbed-man-to-death-in-video-shown-to-jury-13359395",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-metropolitan-police_6902823.jpg?20250501174505",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-01 16:45:00",
        "Headline": "Yostin Andres Mosquera admits the manslaughter of Albert Alfonso by way of loss of self-control. He denies murdering Mr Alfonso and Paul Longworth.",
        "Content": "A suspected double murderer appeared to ask one of his alleged victims \"do you like it?\" as he stabbed him to death in a video that has been shown to a jury. Warning: Some readers may find details in this story distressing Yostin Andres Mosquera, 35, denies murdering Albert Alfonso, 62, and Paul Longworth, 71, at the flat the men shared in west London last July. Mosquera is accused of dumping their chopped-up bodies in suitcases on Clifton Suspension Bridge in Bristol. Jurors at the Old Bailey watched the footage, which had the sound of someone appearing to struggle to breathe. Mr Alfonso's death was captured on four cameras in his bedroom to record sex sessions with Mosquera, who is seen singing and dancing in the aftermath of the attack at the property in Shepherd's Bush. In the video, the two men, who are both naked, are seen struggling with each other and wrestling to the ground. PC Nick Swire said: \"You can see Mosquera apply a knife to Mr Alfonso\", as the officer described the \"frenzied stabbing to the torso and the chest\". Mr Alfonso's \"body goes limp and he loses consciousness\", PC Swire said, before the footage ends with Mr Alfonso on the ground, and \"significant blood flowing from the neck area to the floor\". Mosquera has admitted the manslaughter of Mr Alfonso by way of loss of self-control. Prosecutors say Mosquera was \"in complete control\" of his actions. Two days after the 8 July killing, different CCTV footage shows Mosquera dragging a heavy red suitcase along Clifton Suspension Bridge at about 11.23pm. Two members of the bridge's staff approached him, but were called away, before he was also seen by a cyclist who stopped to see if he was okay, thinking he was a tourist, jurors heard. The witness also saw a large silver trunk a few metres away from the defendant, and Mosquera told him the luggage contained car parts. But really, they \"contained the decapitated and dismembered bodies of Paul Longworth and Albert Alfonso, which the defendant had transported to Bristol from their home in London\", prosecutor Deanna Heer KC said. The prosecution alleges Mosquera was planning to \"dispose\" of the bodies, but, after being approached by the staff and the cyclist, he abandoned the cases and ran away. After discovering the cases contained body parts, police searched the Shepherd's Bush flat where they found Mr Alfonso and Mr Longworth's decapitated heads, as well as other remains, in a chest freezer, the court heard. Read more on Sky News:Harrods suffers cyber attackWill UK heatwave last?Elite police unit tackles knife crime Ms Heer previously said Paul Longworth had been hit repeatedly on the back of his head with a hammer, which shattered his skull. The hearing continues."
    },
    {
        "title": "NHS may offer weight loss jabs over the counter at pharmacies",
        "description": "Patients will be able to get weight loss injections from pharmacies, according to reports.&#160;",
        "url": "https://news.sky.com/story/nhs-may-offer-weight-loss-jabs-over-the-counter-at-pharmacies-13359595",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wegovy-jabs_6903107.jpg?20250502001700",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 23:09:00",
        "Headline": "It's claimed drugs like Ozempic could be available after a short consultation at a cost of £9.90 - broadening access to these jabs considerably.",
        "Content": "Patients will be able to get weight loss injections from pharmacies, according to reports.  It's claimed drugs such as Ozempic and Mounjaro could be available over the counter after a short consultation - at the cost of an NHS prescription. This would broaden access to these jabs considerably, as the health service currently restricts injections to those regarded as having the highest clinical need.  At the moment, there is a two-year waiting list for Wegovy on the NHS - and last year, research by Sky News showed the rollout is happening far more slowly than planned. Thousands of people with severe obesity have been denied access to the treatment, with doctors previously claiming that a \"soul-destroying\" postcode lottery has emerged. According to the Daily Mail, a multimillion-pound deal for a pilot scheme will be struck with a pharmaceutical firm, with a view to issuing prescriptions through chemists and health centres. They would be priced at £9.90 - the same as an NHS prescription - and substantially less than the £150-a-month cost of obtaining these injections privately. \n                  Wales to introduce same-day mental health care, Welsh government says\n                 \n                  NHS prescription charges in England frozen for first time in three years\n                 \n                  Nazi flags, patient 'sexually assaulted', 'dog poo left at whistleblower's home': Sky News investigates UK's 'worst ambulance service'\n                 But the reports have been described as \"speculative\", with health experts warning obesity drugs must only be used under medical supervision by those who are eligible.  A government spokesperson said: \"As the government shifts the NHS from sickness to prevention, we will be looking across the board at how these drugs can be made available to more people who can benefit from them. \"The NHS is already tackling obesity in innovative ways, including through community care models and digital technologies, to help deliver these drugs as part of a rounded package of care.\" Previous estimates from the National Institute for Health and Care Excellence (NICE) have suggested that 3.4 million people in England could benefit from weight loss injections. But last December, NICE said these jabs would only be available to 220,000 patients on the NHS in the first three years - meaning millions of others could end up waiting up to 12 years for treatment. Read more from Sky News:Harrods targeted by cyberattackersUK's hottest start to May on recordPolice horses attacked by dog in park  Studies show people lose on average 15% of their body weight within months of starting treatment with Wegovy. The drug mimics a natural hormone and people feel fuller faster and for longer. Obesity costs the NHS £6bn a year and is linked to 200 different diseases. Half of all obese people with three related problems, such as high blood pressure or diabetes, die within 10 years."
    },
    {
        "title": "UK weather: Warmest start to May on record - but will the hot spell continue?",
        "description": "The UK has seen its warmest start to May on record as temperatures soared to over 29C in the spring sunshine.",
        "url": "https://news.sky.com/story/uk-weather-warmest-start-to-may-on-record-but-will-the-hot-spell-continue-13359283",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-weather-southend-warm_6902759.jpg?20250501161746",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 14:03:00",
        "Headline": "Last month was also the sunniest April in the UK since records began in 1910, according to provisional Met Office figures.",
        "Content": "The UK has seen its warmest start to May on record as temperatures soared to over 29C in the spring sunshine. The Met Office said 29.3C (84.7F) had been recorded at Kew Gardens in southwest London, passing the previous 1 May record of 27.4C (81.3F) set in Lossiemouth in 1990. Thursday was also the warmest day of the year so far, beating the previous high of 26.7C (80F) reached in Wisley, Surrey, on Wednesday. Follow latest updates: May record broken But the heat is not expected to last for the bank holiday weekend, with cooler weather starting to drift in from the north on Friday. Temperatures are expected to ease by Friday and Saturday, meaning cooler conditions of 14C to 18C across the UK. Stephen Dixon, a Met Office spokesman, said: \"Temperatures tomorrow will be slightly reduced from what we've seen today, possibly 26 or 27 degrees in the far southeast of England through the day tomorrow.\" \n                  UK weather latest: Highest temperature today confirmed - after May record broken\n                 \n                  UK weather: Forecasts say temperatures to soar above 20C in some areas\n                 \n                  Man arrested over wildfire that triggered 'major incident' in Northern Ireland\n                 What has led to the hot spell? Forecasters said the hot spell has been due to the jet stream remaining stuck north of the country, allowing high pressure to settle. Last month was also the sunniest April in the UK since records began in 1910, with 47% more sunshine hours than the long-term meteorological average, and the third warmest April on record, according to provisional Met Office figures. Rainfall was well below average for most of the UK last month, with just 56% of expected totals recorded. And Tyne and Wear had its second driest April on record, with only 7% of its usual rainfall. Science correspondent Britain has basked in the early taste of summer. The warmest May Day, the third warmest April and a spring that has so far beaten temperature records dating back to 1884. But this is more than just natural variation. Scientists see the fingerprints of climate change all over the tumbling records. Maps released by data analysts Climate Central show that across large parts of the country, human-induced climate change has made the high temperatures four or even five times more likely. The warm - and dry - weather this spring has led to a steep rise in wildfires. Figures from Europe's satellite monitoring service Copernicus show that more than twice as much land has been burned so far this year in the UK as the average for a whole year. Latest data shows 29,484 hectares (72,857 acres) have been scorched in 2025, compared to a yearly average of 12,613 hectares (31,167 acres) between 2012 and 2024. Temperatures will fall sharply into the Bank Holiday weekend. But the fire risk remains 'very high to extreme' across much of Scotland and 'very high' for large parts of England. The warmth that brings joy to many of us also brings jeopardy. Boy's body recovered from lake Meanwhile, the recovery of a 16-year-old boy's body from a lake in Nottingham prompted emergency services to warn about swimming in lakes and rivers. Chief Inspector David Mather, of Nottinghamshire Police, said: \"I would like to take this opportunity to highlight this case as a reminder of the devastating consequences of entering open water - regardless of whether people do so deliberately or inadvertently.\" The London Fire Brigade said its crews responded to 565 water-related incidents last year and have already attended around 160 in the first quarter of this year, with incidents ranging from rescuing people to animals stranded on lakes and ponds. 'Water temperatures can be dangerously cold' Assistant commissioner for prevention and protection Craig Carter said. \"Even when the sun is shining, water temperatures can be dangerously cold. Cold water shock can affect anyone, no matter how fit or experienced they are. It can lead to water inhalation, and, in the worst cases, drowning.\" The Royal National Lifeboat Institution (RNLI) offered similar warnings, advising those planning to swim at a lifeguarded beach to swim between the red and yellow flags. Fire services warned that the warm weather means there is a \"heightened\" risk of grass and wildfires which can spread more easily during the dry spell, as firefighters have been battling what they described as a large wildfire in the Peak District. The RAC also cautioned drivers on the roads, with spokesman Rod Dennis saying breakdowns are expected to \"soar\", while the NHS reported searches for hay fever advice had doubled from Monday to Wednesday."
    },
    {
        "title": "Murder suspect allegedly asked 'do you like it?' as he stabbed man to death in video shown to jury",
        "description": "A suspected double murderer appeared to ask one of his alleged victims \"do you like it?\" as he stabbed him to death in a video that has been shown to a jury.",
        "url": "https://news.sky.com/story/murder-suspect-allegedly-asked-do-you-like-it-as-he-stabbed-man-to-death-in-video-shown-to-jury-13359395",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-metropolitan-police_6902823.jpg?20250501174505",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 16:45:00",
        "Headline": "Yostin Andres Mosquera admits the manslaughter of Albert Alfonso by way of loss of self-control. He denies murdering Mr Alfonso and Paul Longworth.",
        "Content": "A suspected double murderer appeared to ask one of his alleged victims \"do you like it?\" as he stabbed him to death in a video that has been shown to a jury. Warning: Some readers may find details in this story distressing Yostin Andres Mosquera, 35, denies murdering Albert Alfonso, 62, and Paul Longworth, 71, at the flat the men shared in west London last July. Mosquera is accused of dumping their chopped-up bodies in suitcases on Clifton Suspension Bridge in Bristol. Jurors at the Old Bailey watched the footage, which had the sound of someone appearing to struggle to breathe. Mr Alfonso's death was captured on four cameras in his bedroom to record sex sessions with Mosquera, who is seen singing and dancing in the aftermath of the attack at the property in Shepherd's Bush. In the video, the two men, who are both naked, are seen struggling with each other and wrestling to the ground. PC Nick Swire said: \"You can see Mosquera apply a knife to Mr Alfonso\", as the officer described the \"frenzied stabbing to the torso and the chest\". Mr Alfonso's \"body goes limp and he loses consciousness\", PC Swire said, before the footage ends with Mr Alfonso on the ground, and \"significant blood flowing from the neck area to the floor\". Mosquera has admitted the manslaughter of Mr Alfonso by way of loss of self-control. Prosecutors say Mosquera was \"in complete control\" of his actions. Two days after the 8 July killing, different CCTV footage shows Mosquera dragging a heavy red suitcase along Clifton Suspension Bridge at about 11.23pm. Two members of the bridge's staff approached him, but were called away, before he was also seen by a cyclist who stopped to see if he was okay, thinking he was a tourist, jurors heard. The witness also saw a large silver trunk a few metres away from the defendant, and Mosquera told him the luggage contained car parts. But really, they \"contained the decapitated and dismembered bodies of Paul Longworth and Albert Alfonso, which the defendant had transported to Bristol from their home in London\", prosecutor Deanna Heer KC said. The prosecution alleges Mosquera was planning to \"dispose\" of the bodies, but, after being approached by the staff and the cyclist, he abandoned the cases and ran away. After discovering the cases contained body parts, police searched the Shepherd's Bush flat where they found Mr Alfonso and Mr Longworth's decapitated heads, as well as other remains, in a chest freezer, the court heard. Read more on Sky News:Harrods suffers cyber attackWill UK heatwave last?Elite police unit tackles knife crime Ms Heer previously said Paul Longworth had been hit repeatedly on the back of his head with a hammer, which shattered his skull. The hearing continues."
    },
    {
        "title": "Labour hold North Tyneside - follow mayoral election results as they come in",
        "description": "Six mayors are being elected in England, with most of the mayoralties last contested in 2021.",
        "url": "https://news.sky.com/story/the-mayoral-election-results-in-full-13354442",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mayoral-elections-mayors_6894862.jpg?20250423173455",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 21:00:00",
        "Headline": "Labour are defending four out of six mayoral contests, and the other two are newly created mayors. Results will be updated on this page as they come in through the night.",
        "Content": "Six mayors are being elected in England, with most of the mayoralties last contested in 2021. These include four combined authority mayorsi , otherwise known as metro mayors, as well as two city mayors. Two of the mayors will take up new positions in the Hull and East Yorkshire, and Greater Lincolnshire combined authorities. The other mayoralties were all last contested in 2021. Vote 2025 - latest updates Metro mayors • Cambridgeshire and Peterborough• Greater Lincolnshire• Hull and East Yorkshire• West of England City mayors • Doncaster• North Tyneside (LABOUR HOLD) All of these mayoralties will be elected under a first-past-the-post electoral system, which is also used for Westminster parliamentary elections. See below for more detailed breakdowns of results for each race. Metro mayors There are four metro mayors being elected in combined authorities. These mayors are elected by voters from several different areas and counting will take place at local council level. Tables will be updated as each local area reports its result. Cambridgeshire and Peterborough First established in 2017, the combined authority covers six areas. These are Peterborough, Fenland, Huntingdonshire, East Cambridgeshire, South Cambridgeshire, and Cambridge local council areas. Labour won the mayoralty from the Conservatives when it was last contested in 2021. Greater Lincolnshire This is a new mayoralty, being elected for the first time in 2025. The combined authority covers nine areas. These are North Lincolnshire, North East Lincolnshire, Boston, Lincoln, East Lindsey, West Lindsey, North Kesteven, South Kesteven, and South Holland local council areas. Hull and East Yorkshire This is a new mayoralty, being elected for the first time in 2025. The combined authority area covers both Hull City and East Riding of Yorkshire local council areas. West of England The combined authority covers three areas: Bristol City, South Gloucestershire, and Bath and North East Somerset local council areas. The authority was established in 2017. Labour won the mayoralty from the Conservatives when it was last contested in 2021. City mayors There are two city mayors being elected, one for Doncaster and one for North Tyneside. Labour's Ros Jones has been the Mayor of Doncaster since 2013, and is running for re-election this year. Labour have managed to hold onto the mayoralty of North Tyneside with a razor-thin majority of just 444 votes, with Reform coming in second place."
    },
    {
        "title": "Luxury store Harrods is latest retail victim of cyber attackers",
        "description": "Harrods, the luxury London department store, has become the latest in a string of prominent retailers to be targeted by cyber hackers.",
        "url": "https://news.sky.com/story/luxury-store-harrods-is-latest-retail-victim-of-cyber-attackers-13359363",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20241025145441",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-01 15:53:00",
        "Headline": "Harrods has \"restricted internet access\" after an attempt to gain access to its systems left some customers struggling to pay for purchases, Sky News can reveal. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods, the luxury London department store, has become the latest in a string of prominent retailers to be targeted by cyber hackers. Sky News has learnt that Harrods has been engaged in attempts to fend off a cyber attack after similar incidents in recent days involving Marks & Spencer and the Co-op Group. Follow updates: M&S 'forced to halt all recruitment' | Money Further details of the apparent Harrods cyberattack were unclear on Thursday afternoon, although one customer of the upmarket store told Sky News he had been unable to pay for a purchase earlier in the day. 👉 Listen to Sky News Daily on your podcast app 👈 In a statement issued in response to an enquiry from Sky News, a Harrods spokesperson said: \"We recently experienced attempts to gain unauthorised access to some of our systems. \"Our seasoned IT security team immediately took proactive steps to keep systems safe, and as a result, we have restricted internet access at our sites today. \"Currently, all sites including our Knightsbridge store, H beauty stores and airport stores remain open to welcome customers. \"Customers can also continue to shop via harrods.com. \"We are not asking our customers to do anything differently at this point, and we will continue to provide updates as necessary.\" Read more:The notorious hackers linked to M&S cyber attack The concentration of cyber attacks on retailers underscores the growing centrality of the risk attached to consumer-facing companies' online operations. Harrods, which is owned by a Qatari sovereign wealth fund, is said to be engaging specialists to help resolve and investigate the issue. M&S has been unable to accept online orders for the last week as a result of its cyber incident."
    },
    {
        "title": "Vets could face temporary price cap on medicines as part of competition probe",
        "description": "Vets could face a temporary price cap on medicines while the competition watchdog investigates whether pet owners are being ripped off.",
        "url": "https://news.sky.com/story/vets-could-face-temporary-price-cap-on-medicines-as-part-of-competition-probe-13359511",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vet-cat-veterinarian_6903021.jpg?20250501215648",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 20:20:00",
        "Headline": "The veterinary sector has changed radically in the last decade with big firms buying out independent practices and there are worries pet owners are being taken advantage of.",
        "Content": "Vets could face a temporary price cap on medicines while the competition watchdog investigates whether pet owners are being ripped off. They could also be forced to clearly display prices for prescriptions, treatments, surgery and out-of-hours help - both on websites and in offices. The Competition and Markets Authority (CMA) announced a review into the industry in September 2023. It says 56,000 people have raised concerns, including overpaying for medicines and not getting basic information such as price lists. A CMA paper published on Thursday said it was considering a cap on the mark-up that vets can put on cremations, as well as a short-term \"stabilising\" freeze on medicine prices. It said it could be put in place \"while the competition benefits of the broader package of measures come into effect\". The CMA previously expressed concerns over consolidation that has seen large firms buy out many independent practices. \n                  'Exotic cat smuggling ring' uncovered by police in Spain\n                 \n                  Famous osprey Louis returns to nest in Scotland after illness\n                 \n                  Surgeons carry out world's first pig-to-human liver transplant\n                 About 60% of vet practices now belong to large companies, while in 2013 - when the vast majority were independent - it was just 10%. The CMA is also looking at the link between treatments and bonuses, which it said \"limit vets' clinical freedom to provide a choice of treatments suited to the pet owner and animal's requirements\". It said it wants to give pet owners \"greater understanding of the treatment and other options open to them and the different vet practices that could provide these services\". Read more from Sky News:Appeal after dog attacks police horsesHarrods is latest victim of cyber attackers Rocio Concha, from consumer publication Which?, said its research had shown pet owners feel \"exposed to bad practices like unclear pricing and unnecessary treatment\". \"Shopping around and getting reliable information about paying for vet services is much more difficult than it should be,\" said Ms Concha. She said regulation of vets was outdated and urged the government to act quickly when the CMA confirms its recommendations."
    },
    {
        "title": "Met Police appeal for witnesses as footage shows two of their horses being attacked by dog",
        "description": "Police are appealing for witnesses after two of their horses were attacked by a dog in London.",
        "url": "https://news.sky.com/story/met-police-appeal-for-witnesses-as-footage-shows-two-of-their-horses-being-attacked-by-dog-13359269",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dog-horse-shepherd_6902725.png?20250501154628",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 13:32:00",
        "Headline": "The small dog chased the horses and repeatedly made attempts to bite their legs while the pet's owner struggled to get the animal back under control.",
        "Content": " Police are appealing for witnesses after two of their horses were attacked by a dog in London. Met Police Mounted Branch officers Sergeant Leon Astley and PC Grace Miller-McCormack were riding the horses, named Yvonne and Snaffles, when they were chased by the dog in Shepherd's Bush, west London, at around 11.30am on Monday. The small dog chased the horses and repeatedly made attempts to bite their legs while the pet's owner struggled to get the animal back under control. Police bodycam footage worn by PC Miller-McCormack shows the small dog running up to the two horses on Shepherd's Bush Green. The officer is then heard warning that the dog is \"going to get kicked\" as it begins chasing Yvonne, a 13-year-old grey horse, being ridden by Sergeant Astley. In the footage, PC Miller-McCormack is later heard saying \"get away\" as the dog runs back and begins to target 15-year-old Snaffles - the brown horse she is riding. The dog then begins to chase Sergeant Astley's horse again as members of the public appear to be shouting off camera. PC Miller-McCormack then appears to be speaking to the dog owner as she says: \"You need to grab (the dog), you need to get hold of it.\" Police have said members of the public ultimately had to step in to help detain the dog. Yvonne and Snaffles are recovering well at their stables with minor injuries, and the officers were unharmed, the force added. Police said an investigation is ongoing and no arrests have yet been made. The dog was seized and later returned to its owner. A person can receive an unlimited fine or be sent to prison for up to six months, or both, for having a dog seriously out of control. If the dog injures someone, this can increase to up to five years in prison. The Met Police has therefore said it is \"advisable for owners to keep their dogs on the lead if they don't have sufficient recall, to ensure the safety of the animal and others around them\". Read more:Military horses throw riders off before bolting through central LondonOn the street with elite police unit tackling knife crime Sergeant Astley said: \"What should have been a routine patrol turned out to be unexpectedly eventful, where our hardworking police horses were sadly injured in the course of their duty. Fortunately, Yvonne and Snaffles are recovering well and being looked after in their stables. \"We know horses are not a common sight in the capital, but we urge all owners to keep their dogs under control to prevent this happening again. \"We're appealing for any witnesses of the incident to come forward by calling 101 quoting CAD2691/28APR25.\""
    },
    {
        "title": "English FA will ban transgender women from women's football from next season",
        "description": "The Football Association will ban transgender women playing women's football in England from next season.",
        "url": "https://news.sky.com/story/fa-will-ban-transgender-women-from-womens-football-from-next-season-13359117",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-flag-corner-fa-wembley_6902439.jpg?20250501102407",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 08:56:00",
        "Headline": "It follows a similar move by the Scottish FA this week after a UK Supreme Court ruling in April that a female is defined by biological sex.",
        "Content": "The Football Association will ban transgender women playing women's football in England from next season. It follows a similar move by the Scottish FA this week after a UK Supreme Court ruling in April that a female is defined by biological sex. In Scotland, only players who were female at birth will be allowed to play in women's football over the age of 13. A statement from the English FA said on Thursday: \"As the governing body of the national sport, our role is to make football accessible to as many people as possible, operating within the law and international football policy defined by UEFA and FIFA. \"Our current policy, which allows transgender women to participate in the women's game, was based on this principle and supported by expert legal advice. \"This is a complex subject, and our position has always been that if there was a material change in law, science, or the operation of the policy in grassroots football then we would review it and change it if necessary. \"The Supreme Court's ruling on the 16 April means that we will be changing our policy. Transgender women will no longer be able to play in women's football in England, and this policy will be implemented from 1 June 2025. \"We understand that this will be difficult for people who simply want to play the game they love in the gender by which they identify, and we are contacting the registered transgender women currently playing to explain the changes and how they can continue to stay involved in the game.\" Previously the English body had said that its gender policies were being updated as a result of the court ruling - and transgender women could continue to compete as long as their testosterone was below a certain level. The Football Association of Wales said on Thursday that it will \"await further guidance\" and will \"take the steps required to meet [its] obligations under the Equality Act\". Cricket could also follow suit, with reports that the England and Wales Cricket Board (ECB) is meeting on Friday to discuss banning transgender women from competing at all. Currently, they cannot compete in the top two tiers of the elite game - but are allowed to play up to and including Tier 2. The ECB has not yet commented on the reports. Read more from Sky NewsMusicians sign letter in support of KneecapPost Office victims to get 'recognition'Firearms officer cleared of Kaba murder There are not thought to be any transgender women currently playing women's professional football in either England or Scotland. Only around 20 are believed to play in the grassroots game this season. The new policies for both nations emulate blanket bans on trans women in women's sport introduced by athletics, cricket, and rugby.  Court rules women are defined by sex at birth The Supreme Court ruling on 16 April followed a long-running legal challenge around how sex-based rights are applied through the UK-wide Equality Act 2010. The judges were asked to rule on what that legislation means by \"sex\" - whether biological sex or \"certificated\" sex as legally defined by the 2004 Gender Recognition Act. They unanimously decided the definition of a \"woman\" and \"sex\" in the Equality Act 2010 refers to \"a biological woman and biological sex\". But delivering the verdict Lord Hodge cautioned: \"But we counsel against reading this judgment as a triumph of one or more groups in our society at the expense of another. It is not. \"The Equality Act 2010 gives transgender people protection, not only against discrimination through the protected characteristic of gender reassignment, but also against direct discrimination, indirect discrimination and harassment in substance in their acquired gender. \"This is the application of the principle of discrimination by association. Those statutory protections are available to transgender people, whether or not they possess a gender recognition certificate.\""
    },
    {
        "title": "Ballots being counted in key by-election test for Starmer and council contests",
        "description": "Ballots are being counted in a series of council elections, mayoral votes, and a key by-election test for Sir Keir Starmer.",
        "url": "https://news.sky.com/story/polls-close-in-thousands-of-council-elections-and-key-by-election-test-for-starmer-13359552",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-election-result-count_6903124.jpg?20250502022519",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-05-01 21:05:00",
        "Headline": "This is the first major electoral test for the Labour government, as well as Kemi Badenoch and Nigel Farage, after the general election last year.",
        "Content": "\n          Political reporter\n        Ballots are being counted in a series of council elections, mayoral votes, and a key by-election test for Sir Keir Starmer. More than 1,600 council seats are up for grabs across 23 local authorities, while four regional mayors and two local mayors will be elected. In Runcorn and Helsby voters are choosing a new MP after Labour's Mike Amesbury resigned following his conviction for punching a constituent. Betting odds had Reform ahead of the incumbent party in the by-election, and government parties tend to do poorly in by-elections. Politics latest: Follow the results live Already, the Labour Party is managing expectations that they may lose the seat. Speaking about the by-election and polls more widely, Ellie Reeves, the party's chair, said: \"These elections were always going to be a challenge, being held largely in areas dominated by the Conservatives, often for decades. That's why Labour candidates stood on a promise to bring change right across our country. \n                  Kneecap apologise to families for 'kill your MP' remarks\n                 \n                  Local elections 2025: The first public test for party leaders\n                 \n                  Kemi Badenoch does not rule out local coalitions with Reform after Thursday's council elections\n                 \"There are promising signs that the Labour government's plan for change is already starting to turn around 14 years of Tory failure. \"NHS waiting lists have fallen consistently. Free breakfast clubs are starting to roll out in every primary school. Some 3.5 million workers got a pay rise with the minimum wage increase this month, with pensions rising thanks to Labour's commitment to the triple lock.\"But we know people aren't yet fully feeling the benefit and we are just as impatient for change as the rest of the country. However the results turn out this evening, this Labour government will go further and faster in turning our country around and giving Britain the future it deserves.\" A Reform UK spokesperson said: \"We have fought a strong campaign. The two major parties are more fearful of the results tonight than we are.\" Sky News interviews party leaders:Sir Keir StarmerKemi BadenochNigel FarageSir Ed DaveyCarla Denyer  Torrid for the Tories? Because of the way local elections work, there were a large number of Conservative councillors up for election, compared to the other parties. With their favourability ratings still low, it is likely many will lose their seats. However, they are pinning their hopes on Labour doing badly, with murmurings of disquiet about Ms Badenoch's leadership. A Conservative spokesperson said: \"Tonight will be the first real test of Keir Starmer's Labour government, ten months after they won an unprecedented majority at the general election. \"The Conservatives have started on the process of renewing our party under Kemi Badenoch's leadership. But we also have always been clear that these would be tough elections for the party - defending an incredibly high watermark from 2021 when we took two-thirds of all seats. \"If the 2024 general election was replicated on today's battleground, we would lose control of almost every single council.\" According to Liberal Democrat leader Sir Ed Davey, the party is expecting \"big gains\" off the Tories in the Conservative's \"former middle England heartlands\". The Greens are also anticipating a good set of elections. In the first result of the night, Labour held on to the North Tyneside mayoralty by just 444 votes. Five other mayoralties are also up grabs: Cambridgeshire and Peterborough, West of England, Greater Lincolnshire, Hull and East Yorkshire, and Doncaster.  Mr Farage told Sky News political editor Beth Rigby his party have a good chance in Hull, Lincolnshire and perhaps Doncaster. Join Sky News presenter Jonathan Samuels and deputy political editor Sam Coates to follow the results. Lead politics presenter Sophy Ridge, political editor Beth Rigby, and data and economics editor Ed Conway will take over on Friday morning to report and explain what has happened."
    },
    {
        "title": "Man accused of felling Sycamore Gap tree told police he was being 'framed'",
        "description": "One of the men on trial accused of chopping down the Sycamore Gap tree told police he was being framed as part of a dispute with someone who was \"stirring the pot\".",
        "url": "https://news.sky.com/story/chainsaw-used-to-cut-down-sycamore-gap-tree-and-wedge-of-trunk-trophy-never-found-court-hears-13359174",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sycamore-gap_6902537.jpg?20250501124036",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-01 10:58:00",
        "Headline": "Groundworker Daniel Graham, 39, and mechanic Adam Carruthers, 32, deny felling the famous Northumberland landmark. ",
        "Content": "One of the men on trial accused of chopping down the Sycamore Gap tree told police he was being framed as part of a dispute with someone who was \"stirring the pot\". Groundworker Daniel Graham, 39, admitted he knew how to cut down trees and owned chainsaws, but said he was not trained to bring down anything as large as the famous sycamore beside Hadrian's Wall. He and his co-accused, mechanic Adam Carruthers, 32, each deny two counts of causing criminal damage to the tree and the wall overnight on 28 September 2023.  Newcastle Crown Court heard Graham told police in an interview that he thought he was being \"fixed up\" and mentioned a \"fake profile\" and a \"p***y down the road\" when asked with whom he was in dispute. He told police there had been an altercation when his friend Carruthers was assaulted, and Facebook messages later appeared, accusing him and Carruthers of felling the Sycamore Gap tree. He said: \"It was all false f****ng shite, someone stirring the pot.\" Asked if the dispute was ongoing, he replied: \"Obviously it's not finished because I'm f****** in here.\" Jurors have been shown mobile phone footage allegedly showing the moment the men used a chainsaw to fell the sycamore, which then crashed on to the Roman wall. Prosecutors say photographs and two short videos taken on Graham's phone showed a piece of wood next to a chainsaw in the boot of his Range Rover after they travelled to the Northumberland landmark in the dark during Storm Agnes. But on the third day of the trial, the court heard neither the chainsaw nor the alleged trophy have been found, despite extensive police searches. The jury has been told the defendants now appeared to blame each other and their once-close friendship has \"unravelled\". The court heard Graham told police in an interview he was being framed for the crime as part of a dispute with someone \"stirring the pot\" and insisted: \"That Sycamore Gap's got nothing to do with me.\" \"I have no reason on this planet to go and fell this f***ng tree, all right,\" he said, and when asked if it was a shock, he replied: \"Aye, it's a shock but not a surprise.\" When the police asked him if he denied being responsible for the crime, he said: \"1000%, I will tell you now, it was not me stood by the tree with the chainsaw.\" The court heard he also told police: \"I have never been a grass and I'm not going to f***ng start now\". Carruthers told police he didn't remember what he had been doing on the night the Sycamore Gap tree had been felled. He told officers he did not own a chainsaw and had not used one for months, which would probably have been on a fencing job. Carruthers said: \"If I'm honest, I'm not really a fan of them because they're nasty things.\" He told police he had never felled a tree before, saying: \"If someone said 'there's a tree and there's a saw, cut that down,' I'd have a go, but I've never done it.\" He went on to say: \"I wouldn't be keen doing it, I wouldn't jump at the chance, if I'm honest, like. I wouldn't fancy that - I'll stick with spanners.\" Prosecutor Rebecca Brown told jurors Graham was first arrested at his home at Millbeck Stables, Carlisle, on 31 October 2023. Two chainsaws were seized from a work shed, along with a mobile phone inside a jacket pocket hanging in a caravan, during a search. Carruthers was first arrested on suspicion of criminal damage on the same date at the caravan where he was living at The Old Fuel Depot at Kirkbride Airfield, Wigton, Cumbria, the court heard. Read more from Sky News:On the street with elite police unit tackling knife crimeBody of teenager recovered from lake Ms Brown said the two men were arrested for a second time on 3 November 2023 when a chainsaw was found in a shipping container at the Old Fuel Depot site. But none of the chainsaws recovered are said to be the one used in felling the Sycamore Gap tree, the jury was told.  The court heard Carruthers's father's house in Wigton, Cumbria, was also searched by police on 3 November. \"The reason for the search was to look for outstanding property, namely a chainsaw and a wedge from the tree,\" Ms Brown said. She said the house was \"extremely cluttered with access to most rooms difficult because of this\" and there was no sign of any chainsaws or a wedge from a tree. The prosecutor told the court the house was also searched for chainsaw parts, chainsaw packaging, felling equipment, mobile phones, receipts of any relevant purchases, banking details, silver spray paint, clothing stained in silver paint and boots. But none of these were found. Jurors were told that forensic video analyst Emiliano Polito was instructed to compare photos and videos on Graham's phone showing a piece of wood and a large chainsaw in the boot of a vehicle - taken at 2am on 28 September 2023 - with images taken by a scenes of crime officer of Graham's Range Rover at his property. Ms Brown said Mr Polito conducted a vehicle comparison and found that \"there is no doubt that vehicle X (the vehicle in the images and videos) and the recovered vehicle (Graham's Range Rover) are the same vehicle\". The trial continues."
    },
    {
        "title": "Wildfire in Israel burns 5,000 acres as drivers forced to flee cars",
        "description": "Emergency crews in Israel are battling a wildfire that sent smoke drifting over Jerusalem and forced drivers to run from their cars.",
        "url": "https://news.sky.com/story/israel-wildfire-burns-5000-acres-as-drivers-forced-to-flee-cars-13359460",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-israel-wildfire_6902917.jpg?20250501200210",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-01 18:53:00",
        "Headline": "The blaze is the most significant Israel has seen in the past decade, says the country's fire and rescue authority.",
        "Content": "Emergency crews in Israel are battling a wildfire that sent smoke drifting over Jerusalem and forced drivers to run from their cars. About 5,000 acres (20 square kilometres) have been scorched since the blaze started in the hills outside the city on Wednesday. The ambulance service said at least 12 people had been treated in hospital, mainly for smoke inhalation, but the fire service said \"miraculously\" no homes had been damaged. Ten firefighting planes were dropping fire retardant material on Thursday and authorities said eight more were due to arrive. Spain, Italy, France, Croatia, Ukraine and Romania are among those sending aircraft. People celebrating Israel's independence day on Thursday were advised to be exceptionally careful if holding barbecues and told to avoid forests and parks. Most official celebrations were cancelled as security forces were diverted to the fire effort. \n                  Itamar Ben-Gvir: Israeli minister called 'war criminal' in extraordinary row with protesters during US visit\n                 \n                  Gaza aid worker detained after Israeli attack has been released\n                 \n                  Shin Bet chief Ronen Bar resigns over October 7 failings - defusing Benjamin Netanyahu row\n                 The blaze is the most significant the country has seen in the past decade, according to Tal Volvovitch, from the fire and rescue authority. However, an evacuation order for about 12 towns near Jerusalem has been lifted and the main highway linking Jerusalem to Tel Aviv also reopened on Thursday. A day earlier, drivers had to abandoned their vehicles when flames encroached on the road. Firefighting is continuing but the blaze has now been mostly contained, said the Jewish National Fund, which manages forests in the country. It said conditions had been perfect for fires to spread - hot and dry, little rain over winter, and strong, shifting winds. \"Of course when there's a series of drought years, it's a fertile ground for fires,\" said the fund's Anat Gold, adding that climate change was the likely cause. Read more from Sky News:Hundreds arrested in Turkey during May Day ralliesUS national security adviser Mike Waltz to leave role Israel often gets wildfires in the summer but it's unusual for them to break out this early in the year. In 2010, a forest fire burned for four days on Israel's Mount Carmel, claiming 44 lives and destroying around 12,000 acres."
    },
    {
        "title": "'My dad was shot down over the Soviet Union' - what happens when a US spy plane gets caught?",
        "description": "\"My dad was shot down over the Soviet Union,\" Gary says. \"As a kid I thought it was normal, everybody's dad goes through this.\"",
        "url": "https://news.sky.com/story/my-dad-was-shot-down-over-the-soviet-union-what-happens-when-a-us-spy-plane-gets-caught-13359128",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-u-2-francis-gary-powers_6902729.jpg?20250501154813",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-05-01 09:31:00",
        "Headline": "In May 1960 an American U-2 spy plane flew over Russian missile sites. The US thought it was beyond the reach of Soviet air defences. They were wrong. Sixty-five years later, what's changed?",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n \"My dad was shot down over the Soviet Union,\" Gary says. \"As a kid I thought it was normal, everybody's dad goes through this.\" In the thick of the Cold War an American spy plane flew over Russian missile sites, taking pictures for the CIA. The US thought that at 70,000 feet their U-2 aircraft was beyond the reach of Soviet air defences. They were wrong. What resulted from the downing of the U-2 plane and the capture of pilot Francis Gary Powers was an international incident that could have led to nuclear war. Sixty-five years later, with conflicts raging in Ukraine, Gaza and elsewhere, militaries around the world still gather intelligence in a game of espionage cat-and-mouse. Could something similar happen again? What happened on 1 May, 1960? Wanting to know what missile capabilities the Soviets had, President Dwight D Eisenhower authorised a series of flights by U-2 spy planes over modern-day Russia. \n                  ISIS and the Yazidis: The women they tried to erase\n                 \n                  Trump latest: President changes inner circle - day after Waltz pictured using same app at centre of war chat security breach\n                 \n                  Wildfire in Israel burns 5,000 acres as drivers forced to flee cars\n                 \"As the United States saw it, although they knew that the overflight of Soviet territory was against international law, they regarded their activity as taking a peek behind the Iron Curtain in order to get an idea of Soviet preparedness,\" says Sean Rehling, a curator at the Imperial War Museum in Duxford. Powers was flying near Sverdlovsk when his U-2 aircraft was brought down by a Soviet missile. He was able to parachute to safety, but was captured. The Americans, not knowing yet that Powers was still alive, claimed that a weather research aircraft had strayed into Soviet territory. So when Soviet premier Nikita Khrushchev announced that a US pilot had been captured they were caught in a lie. Powers was put on a public show trial and sentenced to prison, but was released in 1962 in exchange for Soviet spy, Rudolf Abel. Rehling says the U-2 incident ratcheted up tensions between the US and the USSR, and perhaps emboldened Khrushchev to pursue a bold, risky diplomacy that led to the crisis point when Soviet missiles were deployed to Cuba. “We see the culmination of this when, almost two half years later in the Cuban Missile Crisis, the Soviet Union appeared to be adopting a much more confrontational attitude to the United States. “The world became step by step this gradually more dangerous place” 'I wanted to find out the truth' \"My father was very controversial when he returned home,\" his son Gary, 59, tells Sky News. \"Was he a hero, was he a traitor? Did he defect?\" Released on a bridge in Berlin one cold, foggy morning, Powers was taken back to the US where he was questioned first by the CIA, and then by a Senate committee. He was cleared by both. Learning about what happened growing up, Gary pestered his dad for details of the incident. \"How high were you flying on 1 May?,\" he would ask. \"Gary, I can't tell you that,\" his father would reply. Powers died in 1977, aged 47. Despite being officially cleared of any wrongdoing, he's never quite able to shake the questions about what happened. His son never stopped wondering about the U-2 incident. \"I wanted to find out the truth of what he went through,\" Gary says. He founded The Cold War Museum in Virginia in 1996 and regularly runs tours about espionage history, which of course includes the U-2 incident involving his father. Read more from Sky News:The political novice elected by Canadian votersWhat Sky News witnessed at Pope's funeral Is the U-2 incident still relevant in 2025? It may be more than six decades since 1 May, 1960, but the lessons of the U-2 incident still resonate today. NATO fighter jets are regularly scrambled to respond to Russian spy planes approaching the alliance’s borders, while Western surveillance planes operate over the Black Sea, gathering intelligence for Ukraine. “Even though Power's aircraft was shot down 65 years ago, the world in which we live is a legacy of the Cold War,” Rehling says. “Today, even though nations might not necessarily know who a potential adversary or enemy may be, gathering intelligence is just as important as it was during the Cold War.” Gary argues that the U-2 incident is still relevant, mirrored in the geopolitical jostling between NATO, the US, Russia and China. “It’s a cat-and-mouse game, trying to find out what the other side is doing and not getting caught doing it.”"
    },
    {
        "title": "US-Ukraine deal no longer looks like gangsters running a protection racket - but Trump could still end military support",
        "description": "This is a significant moment in this war.",
        "url": "https://news.sky.com/story/us-ukraine-deal-no-longer-looks-like-gangsters-running-a-protection-racket-but-trump-could-still-end-military-support-13359078",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_6897186.jpg?20250426112423",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-01 07:33:00",
        "Headline": "The deal doesn't guarantee peace, but it does give Donald Trump a personal political investment in a war he has appeared to regard as someone else's problem.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n This is a significant moment in this war. It strengthens ties between Ukraine and the US which have been fraying to the point of disintegration. But will it increase the chances of a diplomatic breakthrough to find peace? Possibly not. Without that, this agreement will have changed little in this pointless grinding war. But it does give Donald Trump a personal political investment in a conflict he has always seemed to have regarded as someone else's fault, someone else's problem and a money pit for US resources. On the face of it, it is a purely economic agreement. Ukraine had wanted to tie in explicit guarantees of continuing US military support. The details are scant but they appear to be absent. But reaching agreement is a considerable diplomatic achievement on both sides. \n                  ISIS and the Yazidis: The women they tried to erase\n                 \n                  Trump latest: President changes inner circle - day after Waltz pictured using same app at centre of war chat security breach\n                 \n                  Wildfire in Israel burns 5,000 acres as drivers forced to flee cars\n                 The negotiations have been painful. Ukraine war latest: Follow live updates  The idea of a minerals deal was initially proposed by President Zelenskyy but at times he must have regretted it as acrimonious talks threatened to torpedo US support for Ukraine entirely. It was meant to have been signed in February before the infamous Zelenskyy-Trump-Vance bust up in the Oval Office. At one point it looked like an act of extortion. Like gangsters running a protection racket, the US seemed to be demanding all Ukraine's mineral wealth in return for continued support. But the terms now look less onerous. Most importantly it seems the Trump administration is not asking retrospectively for the return of billions given by the Biden administration, by means of this minerals extraction agreement. The turning point in negotiations appears to have been the meeting engineered between Mr Trump and Mr Zelenskyy on the sidelines of the Pope's funeral in Rome on Saturday. Mr Zelenskyy appears to have persuaded Mr Trump it was a deal worth signing. Read more:Key moments that have shaped Trump and Zelenskyy relationshipTesla's board members 'start looking for Musk's successor'What the White House has said about minerals deal  The terms are vague and not detailed but the agreement appears to be more of a long term proposal for joint cooperation over Ukraine's economic future. America will invest in exploiting Ukraine's mineral wealth but also share the profits years down the line. The signing comes at a crucial time for Ukraine. Its forces are losing ground on the battlefield. And Mr Trump's efforts to broker peace look decidedly one-sided against them. Falling in line on this deal was essential for Ukrainians. Whether it saves them from President Trump walking away and ending military support for them anyway, is by no means certain."
    },
    {
        "title": "Ex-husband rejected alleged killer's invitation to poisonous mushrooms lunch, court hears",
        "description": "The estranged husband of a woman accused of murdering his parents and aunt by feeding them poisonous mushrooms has told a court their relationship had become increasingly strained.",
        "url": "https://news.sky.com/story/ex-husband-rejected-alleged-killers-invitation-to-poisonous-mushrooms-lunch-court-hears-13359039",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erin-patterson_6901598.jpg?20250430125843",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-01 05:26:00",
        "Headline": "Erin Patterson is accused of murdering three of her husband's relatives having served them a beef wellington laced with poisonous mushrooms.",
        "Content": "The estranged husband of a woman accused of murdering his parents and aunt by feeding them poisonous mushrooms has told a court their relationship had become increasingly strained. Erin Patterson, 50, is charged with the murders of her mother-in-law Gail Patterson, father-in-law Donald Patterson, and Gail's sister Heather Wilkinson, as well as the attempted murder of Heather's husband Ian Wilkinson. All four fell ill after she invited them to her home in Leongatha for lunch on 29 July 2023, when it is alleged she fed them a beef wellington laced with highly poisonous death cap mushrooms. She denies all the charges, claiming the deaths were a \"terrible accident\". At the Supreme Court of Victoria in Australia on Thursday, her estranged husband Simon Patterson said that although they had separated amicably in 2015 - their relationship had deteriorated by late-2022. It happened after he listed them as financially separated on a tax return, which triggered a series of child support payments that meant he would no longer pay their two children's private school fees directly, he told the court. \"I was sure she was very upset about that,\" he told the court. Their soured relationship meant he repeatedly declined invitations to his estranged wife's home for lunch - including the one in question. He told the court he did not feel comfortable about attending. Text messages between her and her estranged husband read out in court revealed she found his decision not to come \"really disappointing\" as she had spent time and money preparing the \"special meal\". By midnight on the day of the lunch, which she served with mashed potatoes and green beans, all four had fallen unwell, the court heard. Gail and Heather died almost a week later, with Donald dying a day later. Ian Wilkinson spent seven weeks in hospital but survived. Read more from Sky NewsThree people killed in hairdresser shootingDeaths reported during Spain-Portugal blackoutSky reporter returns to ruined family home Jurors heard Patterson lied about having cancer - and spun the lunch as an opportunity to discuss how she would tell their children. This would ensure they would not be at the meal and not eat the poisoned food, prosecutors claim. Patterson's legal team does not contest that she lied about having the illness. The trial, which is scheduled to run until June, continues."
    },
    {
        "title": "Hundreds arrested in Turkey during worldwide May Day demonstrations and rallies",
        "description": "More than 200 protesters have been arrested in Turkey as people gathered in Istanbul for May Day.",
        "url": "https://news.sky.com/story/hundreds-arrested-in-turkey-during-worldwide-may-day-demonstrations-and-rallies-13359146",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istanbul-turkey-may-day_6902373.jpg?20250501114654",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-01 09:43:00",
        "Headline": "The arrests in Istanbul came as people across the globe kicked off May Day marches and protests - many of which focused on Donald Trump's policies.",
        "Content": "More than 200 protesters have been arrested in Turkey as people gathered in Istanbul for May Day. People across the world have marked the annual event, also known as International Workers' Day or Labour Day, which recognises the struggles and achievements of workers and the labour movement. However in Turkey, May Day also served as an opportunity for pro-democracy demonstrators to protest against the jailing of Istanbul's opposition mayor Ekrem Imamoglu. His imprisonment in March had already sparked the country's largest protests in more than a decade. A law association said that more than 200 protesters were arrested before midday near Taksim Square in central Istanbul, a symbolic rallying point long closed to May Day gatherings. Authorities had blocked access to central Istanbul and shut down transit lines on Thursday. The arrests in Turkey came as people across Asia kicked off May Day celebrations with big marches and protests - many of which focused on US President Donald Trump's policies and fears of global economic uncertainty. In Manila, thousands of Filipino workers marched near the presidential palace, where police blocked access with barricades. Protesters demanded higher wages and stronger protections for local jobs and businesses. It comes as thousands of people are expected to attend rallies and marches across the US as well, including in Chicago, Los Angeles, New York and Philadelphia. Organisers in the US said their message this year focused on fighting Mr Trump's approach to targeting immigrants, federal workers and diversity initiatives. Los Angeles is expected to host one of the world's largest May Day events this year, and a banner there summarised the day's theme: \"One Struggle, One Fight - Workers Unite!\" \"We're bringing the fight to the billionaires and politicians who are trying to divide us with fear and lies. We know the truth - an attack on immigrant workers is an attack on all workers,\" April Verrett, president of the Service Employees International Union, which represents two million workers, said in a statement. In Taiwan, President Lai Ching-te referenced new US tariffs under Mr Trump as he promoted a proposed spending bill aimed at stabilising the job market and supporting livelihoods. In the Philippines, protest leader Mong Palatino warned \"tariff wars and policies of Trump\" threatened local industries. A truck during a march in Tokyo in Japan featured a doll that resembled Mr Trump. There, the demands of those marching were wide-ranging and included higher wages, gender equality, healthcare, reduced military spending and disaster relief for earthquake victims. They also demanded a ceasefire in Gaza and an end to Russia's invasion of Ukraine. \"For our children to be able to live with hope, the rights of workers must be recognised,\" said Junko Kuramochi, a member of a mothers' group in Tokyo. Tadashi Ito, a union construction worker, said he worried about rising prices for imported raw materials. \"Everybody is fighting over work and so the contracts tend to go where the wages are cheapest,\" he said. \"We think peace comes first. And we hope Trump will eradicate conflict and inequalities.\" \"Workers unite! Workers of the world! May Day!\" the crowds shouted, punctuating each exclamation with the Japanese battle cry: \"Banzai!\" In Indonesia, President Prabowo Subianto greeted thousands of workers who cheered him in Jakarta's National Monument Park. \"The government that I lead will work as hard as possible to eliminate poverty from Indonesia,\" he told the crowd. About 200,000 Indonesian workers were expected to take part in May Day marches across Southeast Asia's largest economy, according to Said Iqbal, president of the Confederation of Indonesian Trade Unions. They are demanding an end to outsourcing rules, wage raises, and protection for domestic workers and migrant workers abroad."
    },
    {
        "title": "British woman Ethel Caterham becomes oldest person in the world at 115",
        "description": "A British woman has officially become the oldest person in the world at the age of 115, according to the Guinness World Records.",
        "url": "https://news.sky.com/story/british-woman-ethel-caterham-becomes-oldest-person-in-the-world-at-115-13359190",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ethel-caterham-surrey_6902579.jpg?20250501130000",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-01 11:30:00",
        "Headline": "Ethel Caterham, who lives in a care home in Surrey, has taken the mantle at 115 years and 252 days, LongeviQuest confirms.",
        "Content": "A British woman has officially become the oldest person in the world at the age of 115, according to the Guinness World Records. Ethel Caterham, who lives in a care home in Surrey, has taken the mantle at 115 years and 252 days, LongeviQuest confirmed. It comes after the death on 30 April of the previous record holder, Inah Canabarro Lucas, who was a 116-year-old nun from Brazil. Mrs Caterham sets multiple records - including being the last living person to be born in 1909. She is also the youngest person to be named the oldest woman in the last 12 years. Mrs Caterham is also among the oldest survivors of coronavirus, having contracted it at 110 in 2020. She has outlived her husband Norman, who died in 1976, and both her children Gem and Anne, who died after the millennium. Asked what her secret to a long life is, she told the Salisbury Journal: \"Say yes to every opportunity because you never know what it will lead to. Have a positive mental attitude and have everything in moderation.\" Read more from Sky NewsEnglish FA will ban transgender women from women's footballFatal paddleboarding trip instructor's police sacking revealed Still in good health Mrs Caterham remains in good health and enjoys sitting in the garden at her care home, which has been named Ethel's Garden in her honour. She was born in Hampshire on 21 August 1909 - the second-youngest of eight children. Her older sister Gladys also lived a long life, having died at 104 years and 78 days in 2002. Mrs Caterham moved to India to work as a nanny when she was 18 and often reminisces about her time there. When she returned she met her future husband, a British Army major, at a dinner party in 1931 - the pair marrying in Salisbury Cathedral two years later. They went to live in Hong Kong and Gibraltar when he was posted abroad, with Mrs Caterham returning to her love of children and opening her own nursery during their time in Asia. On the couple's return to the UK - they settled in Surrey where she gave birth to their daughters. Gem died in the early 2000s and Anne aged 82 in 2020."
    },
    {
        "title": "Kamala Harris attacks Donald Trump in biggest speech since US election loss",
        "description": "Former vice president Kamala Harris has criticised Donald Trump's \"wholesale abandonment\" of US ideals during his first 100 days in office in her biggest speech since her election defeat.",
        "url": "https://news.sky.com/story/kamala-harris-attacks-donald-trump-in-biggest-speech-since-us-election-loss-13359053",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kamala-harris-donald-trump_6902318.jpg?20250501093511",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-01 06:04:00",
        "Headline": "The former vice president criticises her former rival's \"wholesale abandonment\" of US ideals during his first 100 days in office.",
        "Content": "Former vice president Kamala Harris has criticised Donald Trump's \"wholesale abandonment\" of US ideals during his first 100 days in office in her biggest speech since her election defeat. Ms Harris accused the president of \"the greatest man-made economic crisis in modern presidential history\" in her most extensive public comments since conceding in November. She said Mr Trump's politics benefited the rich and described his \"narrow, self-serving vision\" where they \"punish truth tellers, favour loyalists, cash in on their power, and leave everyone else to fend for themselves\". \"Instead of an administration working to advance America's highest ideals, we are witnessing the wholesale abandonment of those ideals,\" Ms Harris said on Wednesday - a day after Mr Trump marked 100 days in office. During the 15-minute speech, she spoke of the anxiety and confusion which have gripped many Democrats since her election defeat, warning \"things are probably going to get worse before they get better\" - but she discouraged despair. \"They are counting on the notion that if they can make some people afraid, it will have a chilling effect on others,\" she said. \"But what they have overlooked is that fear is not the only thing that's contagious. Courage is contagious.\" She delivered the speech to a hometown crowd in San Francisco at an event hosted by Emerge America, an organisation which recruits and trains Democratic women, which started after her first run for office in the city. 👉 Follow Trump100 on your podcast app 👈 The former vice president is ramping up her public presence as Democrats nationally search for a path forwards after last year's election, in which Republicans also won control of Congress. Ms Harris is seen as a strong candidate for California governor next year, if she runs, and could be a presidential contender again. \"I'm not here tonight to offer all the answers,\" she said. \"But I am here to say this: You are not alone and we are all in this together. \"The one check, the one balance, the one power that must not fail is the voice of the people.\" Read more US news:Musk furious over Tesla reportsUS-Ukraine sign investment fund deal Before Wednesday's speech, she had barely mentioned Mr Trump by name since she conceded defeat to him. The president went after his former rival in a campaign-style rally on Tuesday marking his 100th day in office. He sarcastically called her a \"great border czar\" and a \"great candidate\" as he repeated some of the lines he routinely delivered during the campaign."
    },
    {
        "title": "Mike Waltz's 'Signalgate' mistake weakened Trump - so why isn't Pete Hegseth also getting fired?",
        "description": "Timing's everything for Donald Trump.&#160;&#160;",
        "url": "https://news.sky.com/story/waltzs-signalgate-mistake-weakened-trump-so-why-isnt-pete-hegseth-also-getting-fired-13359388",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mike-waltz-national-security_6902868.jpg?20250501190450",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-05-01 16:31:00",
        "Headline": "Sharing sensitive military information on a group chat was a reckless error of judgement and raised questions over the president's decision to appoint him.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Timing's everything for Donald Trump.   The time for sacking Mike Waltz was, clearly, not before the 100-day milestone - the measure of his performance in office. The national security adviser had his card marked from the day the 'Signalgate' scandal broke. Trump latest: Waltz 'leaving White House' hours after TV appearance In any other government, at any other time, political expediency would have demanded his immediate sacking. To have shared sensitive military information on a group chat is a most reckless error of judgement. Bad enough that the information reached the inbox of a US journalist - who knows who else might have accessed the information in what is a commercially available app? China, Russia? Iran, the very country that backs the Houthi rebels who were under attack? \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  US national security adviser Mike Waltz to leave role in first major change to Trump's team\n                 \n                  What US-Ukraine minerals deal means for Putin\n                 Initially, Donald Trump defended Waltz as a \"good man\" who had \"learned a lesson\". The president will have known, though, that he's a man who has fundamentally weakened him. Waltz's mistake put the lives of US service personnel at risk and called into question the credibility of his ultimate boss. The emoji-laden group chat read like the stuff of excited youngsters breathlessly sharing gossip. It was recklessness over responsibility at the heart of government, and it reflected on the commander-in-chief and his judgement in appointing Waltz in the first place.  To keep him in post for weeks following the scandal looked like an acceptance, of sorts, and it didn't look good. If there are questions about the circumstances surrounding Waltz, there are, too, about Trump's defence secretary, Pete Hegseth. Hegseth was also part of the Signalgate group chat and more. Separately, he shared messages on Signal with his wife and brother about military strikes. Both are involved with the Pentagon, but are nowhere near the security clearance typically required to access that kind of detail. Read more from Sky News:Musk fury over report Tesla looking for new bossHarris attacks Trump in biggest speech since election If Waltz committed a sackable offence, why didn't Hegseth? It's a question that won't go away. The answer, I suspect, is that Donald Trump invested considerable political capital in forcing Hegseth into position, in spite of strong opposition. In a story that acknowledges weakness at the heart of government, Donald Trump has his limits."
    },
    {
        "title": "Mike Waltz: The ex-special forces soldier leaving his role as US national security adviser",
        "description": "Donald Trump's national security adviser Mike Waltz is leaving his role, in the first big shakeup of the US president's inner circle since he took office on 20 January.",
        "url": "https://news.sky.com/story/mike-waltz-the-ex-special-forces-soldier-leaving-his-role-as-us-national-security-adviser-13359342",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-air-force-one_6859274.jpg?20250317070119",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-01 15:11:00",
        "Headline": "The 51-year-old is said to be leaving his post just over a month after he accepted responsibility for the Signal chat scandal.",
        "Content": "Donald Trump's national security adviser Mike Waltz is leaving his role, in the first big shakeup of the US president's inner circle since he took office on 20 January. The reasons for Mr Waltz's departure are not yet clear, but it comes just over a month after he took responsibility for the Signal chat scandal, which embarrassed the Trump administration. On Thursday, Mr Trump announced that Mr Waltz would be taking up a role as the next United States ambassador to the United Nations. US latest: Follow live updates Secretary of state Marco Rubio will take on Mr Waltz's responsibilities until a new appointment is made, Mr Trump added. Here we take a look at who Mr Waltz is and his role in \"Signalgate\". Former congressman with a military background Mr Waltz, from Florida, is a former special forces soldier who served in the US military for 21 years and was involved in multiple combat tours to Afghanistan. Prior to becoming Mr Trump's national security adviser, he had served as a Republican congressman for Florida since 2019. Mr Waltz is a leading critic of China, and has spoken out about the country's activity in the Asia-Pacific, claiming the US needs to be ready for a potential conflict in the region. His role as Mr Trump's national security adviser means he has been responsible for briefing the president on key national security issues and coordinating with different agencies. What was his role in the 'Signalgate' scandal Mr Waltz faced scrutiny after it emerged he created a group chat on the messaging app Signal in which defence secretary Pete Hegseth and other US officials discussed strikes on Yemen's Iran-backed Houthis. It came to light in March after Mr Waltz accidentally added a US journalist to the group. In relation to the leak, Mr Waltz later told Fox News: \"I take responsibility. I built the group.\" He added that it was \"embarrassing\".  Who could take over as national security adviser? Mr Waltz is Mr Trump's fifth permanent national security adviser after the president went through four during his first term in the White House. Mr Waltz will be replaced, for now, by Mr Rubio, who Mr Trump said would \"serve as national security adviser, while continuing his strong leadership at the state department\". He also praised Mr Waltz for \"working hard to put our nation's interests first\". In terms of a permanent solution, a source told Reuters one option is US special envoy Steve Witkoff, who has been involved in both Russia-Ukraine diplomacy as well as the Middle East."
    },
    {
        "title": "Kamala Harris attacks Donald Trump in biggest speech since US election loss",
        "description": "Former vice president Kamala Harris has criticised Donald Trump's \"wholesale abandonment\" of US ideals during his first 100 days in office in her biggest speech since her election defeat.",
        "url": "https://news.sky.com/story/kamala-harris-attacks-donald-trump-in-biggest-speech-since-us-election-loss-13359053",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kamala-harris-donald-trump_6902318.jpg?20250501093511",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-01 06:04:00",
        "Headline": "The former vice president criticises her former rival's \"wholesale abandonment\" of US ideals during his first 100 days in office.",
        "Content": "Former vice president Kamala Harris has criticised Donald Trump's \"wholesale abandonment\" of US ideals during his first 100 days in office in her biggest speech since her election defeat. Ms Harris accused the president of \"the greatest man-made economic crisis in modern presidential history\" in her most extensive public comments since conceding in November. She said Mr Trump's politics benefited the rich and described his \"narrow, self-serving vision\" where they \"punish truth tellers, favour loyalists, cash in on their power, and leave everyone else to fend for themselves\". \"Instead of an administration working to advance America's highest ideals, we are witnessing the wholesale abandonment of those ideals,\" Ms Harris said on Wednesday - a day after Mr Trump marked 100 days in office. During the 15-minute speech, she spoke of the anxiety and confusion which have gripped many Democrats since her election defeat, warning \"things are probably going to get worse before they get better\" - but she discouraged despair. \"They are counting on the notion that if they can make some people afraid, it will have a chilling effect on others,\" she said. \"But what they have overlooked is that fear is not the only thing that's contagious. Courage is contagious.\" She delivered the speech to a hometown crowd in San Francisco at an event hosted by Emerge America, an organisation which recruits and trains Democratic women, which started after her first run for office in the city. 👉 Follow Trump100 on your podcast app 👈 The former vice president is ramping up her public presence as Democrats nationally search for a path forwards after last year's election, in which Republicans also won control of Congress. Ms Harris is seen as a strong candidate for California governor next year, if she runs, and could be a presidential contender again. \"I'm not here tonight to offer all the answers,\" she said. \"But I am here to say this: You are not alone and we are all in this together. \"The one check, the one balance, the one power that must not fail is the voice of the people.\" Read more US news:Musk furious over Tesla reportsUS-Ukraine sign investment fund deal Before Wednesday's speech, she had barely mentioned Mr Trump by name since she conceded defeat to him. The president went after his former rival in a campaign-style rally on Tuesday marking his 100th day in office. He sarcastically called her a \"great border czar\" and a \"great candidate\" as he repeated some of the lines he routinely delivered during the campaign."
    },
    {
        "title": "Tesla's board members have reportedly started looking for Elon Musk's successor as CEO",
        "description": "Tesla's board members have reportedly started a search for someone to replace Elon Musk as CEO, with the claim prompting an angry reaction from the world's richest person.",
        "url": "https://news.sky.com/story/teslas-board-members-have-reportedly-started-looking-for-elon-musks-successor-as-ceo-13359016",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-tesla_6902434.jpg?20250501102033",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-01 01:50:00",
        "Headline": "Musk's net worth has plunged and Tesla stocks have fallen amid a public backlash over his role in Donald Trump's government.",
        "Content": " Tesla's board members have reportedly started a search for someone to replace Elon Musk as CEO, with the claim prompting an angry reaction from the world's richest person. Several executive search firms were approached to find a successor around a month ago, the Wall Street Journal reported. But it added that the current status of the succession planning for the electric carmaker was not known.  Tesla's chair, Robyn Denholm, later reacted to the report by insisting that any suggestion of an active search was \"absolutely false\". She added that the board was highly confident in Musk's ability to continue \"executing on the exciting growth plan ahead\". He later took to his X platform to denounce the story, writing: \"It is an EXTREMELY BAD BREACH OF ETHICS that the @WSJ would publish a DELIBERATELY FALSE ARTICLE and fail to include an unequivocal denial beforehand by the Tesla board of directors!\" Musk's net worth has plunged and Tesla stocks have fallen sharply amid a public backlash over his role in Donald Trump's government. He owns just under 13% of Tesla stock and is the largest shareholder. The world's richest man has been leading the Department of Government Efficiency (DOGE), where he has overseen the firing of tens of thousands of government employees. He has also supported far-right parties in Europe, which has led to protests against Musk and Tesla, and seen its showrooms and charging stations vandalised across the US and Europe. President Trump has labelled the vandals \"terrorists\".  It comes after Musk said the time he spends with DOGE would \"drop significantly\" from May. He said he would be dedicating more time to running his companies, such as Tesla, SpaceX and X. Read more from Sky News:US and Ukraine sign deal to establish investment fundOn the beat tackling violent crime in ManchesterGaza children allowed into UK for treatment for first time The board members met with Musk and asked him to announce publicly he would spend more time at Tesla, the report said. It was unclear if Musk, who is a member of the board, was aware of any attempts to identify a successor, or if his pledge to spend more time at Tesla had affected succession planning, it added. On Wednesday, Mr Trump said Musk could be part of his administration for as long as he wants. \"You're invited to stay as long as you want,\" Mr Trump said. He said Musk had been \"treated unfairly\" for his role in helping Mr Trump slash the size of the federal government, adding: \"You really have sacrificed a lot.\""
    },
    {
        "title": "'De minimis': The rarely examined trade clause about to become a very big deal",
        "description": "The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important.",
        "url": "https://news.sky.com/story/de-minimis-the-rarely-examined-trade-clause-about-to-become-a-very-big-deal-13358896",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shein-china_6902118.jpg?20250430204354",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2025-05-01 02:00:00",
        "Headline": "There's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. Now, the US is set to scrap it altogether - and nobody knows what will happen next. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important. For example, consider a little bit of legal small print no one spent all that much time thinking about until recently - a clause in most countries' customs arrangements known as \"de minimis\". The idea behind de minimis is quite simple. Collecting customs can be an expensive business. You need to employ lots of people to check goods, police the system and collect the relevant customs and tariffs. In theory, you could fund that via the customs you're charging people to import goods into the country. But what if the items you're imposing tariffs and charges on are so cheap that it makes no economic sense to actually impose those charges? Consider a £5 T-shirt of the kind you might order from an online retailer such as Shein. In theory, that garment should face a 20% tariff when it arrives from China into the UK. \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  Mike Waltz's 'Signalgate' mistake weakened Trump - so why isn't Pete Hegseth also getting fired?\n                 \n                  US national security adviser Mike Waltz to leave role in first major change to Trump's team\n                 But since 20% of a small number is an even smaller number, most customs authorities, including those in the UK, have taken the stance of essentially excluding any cheap imports from paying customs. This is the 'de minimis' rule. There are similar rules in most countries, with the main difference being the threshold at which they kick in. Here in Britain, de minimis applies to anything worth less than £135. In the US the threshold at which you start paying customs charges is higher: $800. Now, there's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. The historic arguments against collecting those fees were that a) doing so probably cost more money than it would raise, b) scanning and checking every import would jam up ports and airports unnecessarily and c) it might have a bearing on the wider economy as it throws further sand in the wheels of commerce. But in recent years, a host of mostly Chinese retailers have exploited the de minimis rule to ship (actually, mostly to fly) cheap products to the US, UK, Europe and beyond. The most visible of these companies are Shein and Temu. By directly flying consignments of very cheap clothes and consumer goods to airports in the west, they have been able to undercut other companies without having to pay customs fees. All of which is why, alongside the host of other tariffs imposed in recent weeks, Donald Trump is also doing something else - eliminating America's de minimis rules altogether. At least, that's the plan. Having pledged to do so in February, the administration rapidly reversed the decision after consignments began to pile up at US airports. However, the impending rule, which is due to kick in this Friday, sounds like it might be more concrete than the last one. And, if it's actually imposed, tariffs of 145% will be imposed on goods that, once upon a time, didn't face any tariffs at all. Which is a very big deal indeed. Already, prices on websites including Shein have begun to increase. Consumers have begun to abandon the sites' apps. And consignments of goods bound for the US from China have begun to slow. The real question is what happens next. Does the White House U-turn again? Or does it stand firm? Even as American consumers see the cost of their hitherto cheap goods rise, and potentially even face empty supermarket shelves, the notion of which was summoned up by a delegation of retail chiefs who met with the president last week. The short answer, as with so much about the current US administration is: no one really knows, and if they say they do, don't believe them."
    },
    {
        "title": "Luxury store Harrods is latest retail victim of cyber attackers",
        "description": "Harrods, the luxury London department store, has become the latest in a string of prominent retailers to be targeted by cyber hackers.",
        "url": "https://news.sky.com/story/luxury-store-harrods-is-latest-retail-victim-of-cyber-attackers-13359363",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-harrods-london_6727506.jpg?20241025145441",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-01 15:53:00",
        "Headline": "Harrods has \"restricted internet access\" after an attempt to gain access to its systems left some customers struggling to pay for purchases, Sky News can reveal. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods, the luxury London department store, has become the latest in a string of prominent retailers to be targeted by cyber hackers. Sky News has learnt that Harrods has been engaged in attempts to fend off a cyber attack after similar incidents in recent days involving Marks & Spencer and the Co-op Group. Follow updates: M&S 'forced to halt all recruitment' | Money Further details of the apparent Harrods cyberattack were unclear on Thursday afternoon, although one customer of the upmarket store told Sky News he had been unable to pay for a purchase earlier in the day. 👉 Listen to Sky News Daily on your podcast app 👈 In a statement issued in response to an enquiry from Sky News, a Harrods spokesperson said: \"We recently experienced attempts to gain unauthorised access to some of our systems. \"Our seasoned IT security team immediately took proactive steps to keep systems safe, and as a result, we have restricted internet access at our sites today. \"Currently, all sites including our Knightsbridge store, H beauty stores and airport stores remain open to welcome customers. \"Customers can also continue to shop via harrods.com. \"We are not asking our customers to do anything differently at this point, and we will continue to provide updates as necessary.\" Read more:The notorious hackers linked to M&S cyber attack The concentration of cyber attacks on retailers underscores the growing centrality of the risk attached to consumer-facing companies' online operations. Harrods, which is owned by a Qatari sovereign wealth fund, is said to be engaging specialists to help resolve and investigate the issue. M&S has been unable to accept online orders for the last week as a result of its cyber incident."
    },
    {
        "title": "M&S pauses recruitment amid ongoing cyber attack",
        "description": "M&S has paused recruitment amid an ongoing cyber attack.",
        "url": "https://news.sky.com/story/ms-pauses-recruitment-amid-ongoing-cyber-attack-13359330",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marks-and-spencer-shop_6896501.jpg?20250425144859",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-01 15:03:00",
        "Headline": "On Thursday, the company had no jobs listed anywhere across its UK business despite having more than 200 job openings this time last week.",
        "Content": " M&S has paused recruitment amid an ongoing cyber attack. The company has pulled all online job adverts from its website as it seeks to resolve problems on its platforms. M&S's website currently says: \"Sorry you can't search or apply for roles right now, we're working hard to be back online as soon as possible.\" Read more: Who are the hackers linked to M&S cyber attack? On Thursday, the company had no jobs listed anywhere across its UK business despite having more than 200 job openings this time last week. \"While we proactively manage the cyber incident, we are temporarily pausing some of our normal processes so we can continue to work hard on offering the best M&S for our customers and colleagues,\" M&S told Sky News' Money team. \"Job adverts will be up again in due course.\" \n                  Who are Scattered Spider? How the notorious hackers linked to M&S cyber attack work\n                 \n                  The UK is 'widely' underestimating online threats from hostile states and criminals, cyber security chief warns\n                 \n                  UK in AI arms race with Russia as Putin 'wants destruction', minister to warn\n                 The British business employs around 65,000 people and has been battling the cyber attack for more than a week. It is still not taking online orders and some customers have reported empty shelves around the country. M&S first reported issues over the Easter weekend, when it stopped taking click-and-collect orders and saw contactless payments impacted by the \"cyber incident\". It has since restarted contactless payments. Read more from Sky News:Half-tonne piece of rocket to crash back down to EarthTesla reportedly searching for Elon Musk's successor On Wednesday, the Metropolitan Police confirmed it is investigating a cyber attack. In a separate incident, rival retailer The Co-op shut off parts of its IT systems on Wednesday after an attempted hack. Co-op staff are now reportedly being ordered to keep cameras on to verify identities on all remote work meetings as a result."
    },
    {
        "title": "Space NK owner kicks off £300m-plus sale process",
        "description": "The owner of Space NK has kicked off a formal sale process more than a year since it hired bankers to auction the high street beauty chain.",
        "url": "https://news.sky.com/story/space-nk-owner-kicks-off-163300m-plus-sale-process-13359234",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-space-nk-windsor_6538220.jpg?20240430105916",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-01 12:43:00",
        "Headline": "Bankers at Raymond James have begun contacting prospective bidders for one of the UK's best-known high street beauty retailers, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Space NK has kicked off a formal sale process more than a year since it hired bankers to auction the high street beauty chain. Sky News has learnt that teasers have begun being circulated to prospective bidders in recent weeks, despite anxiety about consumer confidence in a stuttering UK economy. Manzanita Capital, a private investment firm, engaged bankers at Raymond James to oversee an auction in April 2024. Money latest: Big interest rate cut reductions predicted A deal is expected to fetch between £300m and £400m. Manzanita has owned Space NK for more than 20 years, and is not expected to sanction a sale unless it receives an attractive offer. One party contacted about a potential bid said the business appeared to be in good financial health. Manzanita has also owned the French perfume house Diptyque and Susanne Kaufmann, an Austrian luxury skincare brand. Founded in 1993 by Nicky Kinnaird, Space NK - which is named after her initials - trades from roughly stores and employs more than 1,000 people. It specialises in high-end skincare and cosmetics products. Manzanita previously explored a sale of Space NK in 2018, hiring Goldman Sachs to handle a strategic review, but opted not to proceed with a deal. Manzanita has been contacted for comment, while Raymond James declined to comment."
    },
    {
        "title": "Tesla's board members have reportedly started looking for Elon Musk's successor as CEO",
        "description": "Tesla's board members have reportedly started a search for someone to replace Elon Musk as CEO, with the claim prompting an angry reaction from the world's richest person.",
        "url": "https://news.sky.com/story/teslas-board-members-have-reportedly-started-looking-for-elon-musks-successor-as-ceo-13359016",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-tesla_6902434.jpg?20250501102033",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-01 01:50:00",
        "Headline": "Musk's net worth has plunged and Tesla stocks have fallen amid a public backlash over his role in Donald Trump's government.",
        "Content": " Tesla's board members have reportedly started a search for someone to replace Elon Musk as CEO, with the claim prompting an angry reaction from the world's richest person. Several executive search firms were approached to find a successor around a month ago, the Wall Street Journal reported. But it added that the current status of the succession planning for the electric carmaker was not known.  Tesla's chair, Robyn Denholm, later reacted to the report by insisting that any suggestion of an active search was \"absolutely false\". She added that the board was highly confident in Musk's ability to continue \"executing on the exciting growth plan ahead\". He later took to his X platform to denounce the story, writing: \"It is an EXTREMELY BAD BREACH OF ETHICS that the @WSJ would publish a DELIBERATELY FALSE ARTICLE and fail to include an unequivocal denial beforehand by the Tesla board of directors!\" Musk's net worth has plunged and Tesla stocks have fallen sharply amid a public backlash over his role in Donald Trump's government. He owns just under 13% of Tesla stock and is the largest shareholder. The world's richest man has been leading the Department of Government Efficiency (DOGE), where he has overseen the firing of tens of thousands of government employees. He has also supported far-right parties in Europe, which has led to protests against Musk and Tesla, and seen its showrooms and charging stations vandalised across the US and Europe. President Trump has labelled the vandals \"terrorists\".  It comes after Musk said the time he spends with DOGE would \"drop significantly\" from May. He said he would be dedicating more time to running his companies, such as Tesla, SpaceX and X. Read more from Sky News:US and Ukraine sign deal to establish investment fundOn the beat tackling violent crime in ManchesterGaza children allowed into UK for treatment for first time The board members met with Musk and asked him to announce publicly he would spend more time at Tesla, the report said. It was unclear if Musk, who is a member of the board, was aware of any attempts to identify a successor, or if his pledge to spend more time at Tesla had affected succession planning, it added. On Wednesday, Mr Trump said Musk could be part of his administration for as long as he wants. \"You're invited to stay as long as you want,\" Mr Trump said. He said Musk had been \"treated unfairly\" for his role in helping Mr Trump slash the size of the federal government, adding: \"You really have sacrificed a lot.\""
    },
    {
        "title": "Trump's trade war could ease the squeeze on household finances",
        "description": "The headlines related to Donald Trump's trade war to date have largely all been negative and with total justification.",
        "url": "https://news.sky.com/story/trumps-trade-war-could-ease-the-squeeze-on-household-finances-13359082",
        "image_url": "https://e3.365dm.com/22/03/1920x1080/skynews-energy-price-cap-bills_5721942.jpg?20220328164248",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-05-01 07:52:00",
        "Headline": "From the understandable depths of despair and frustration felt over the president's protectionist path, there are also some unintended positives emerging that may help drive down some big bills.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The headlines related to Donald Trump's trade war to date have largely all been negative and with total justification. We've heard of the dire impact tariffs are expected to have on the UK and wider global economy from the International Monetary Fund, the toll they are already taking on UK exporters to the United States - especially car, steel and aluminium manufacturers. Jobs, order books and profitability are threatened and stock markets have lost significant ground, knocking pension and investment values. Money latest: State pensions have been underpaid by £800m Government borrowing costs have also faced upwards pressure. But from the understandable depths of despair and frustration felt over the president's protectionist path, there are also some unintended positives emerging that may help drive down some big bills for both households and businesses alike in the UK. Oil and fuel \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  'De minimis': The rarely examined trade clause about to become a very big deal\n                 \n                  UK growth could be 'postponed' for two years, report warns\n                 The surprise news on Wednesday that the US economy had contracted over the first three months of the year - caused by a dash for imports to beat tariffs - drove a decisive blow to oil prices. They have fallen steadily since Trump 2.0 began in January but the declines accelerated after the \"liberation day\" tariff bomb was dropped early last month. Brent crude, the international benchmark, fell 15% in April alone and is currently trading at a four-year low of $60. Analysts are now openly talking about the prospects for a $55 level, also aided by signals that Saudi Arabia is going to sell more oil. RAC Fuel Watch data shows average costs of 134.19p-per-litre for unleaded and 140.71p for diesel this week. Its commentary, on both measures, adds simply: \"should fall sharply\". A report by the motoring organisation on pump costs due on Friday is expected to accuse retailers of profiteering, even as prices ease towards four-year lows.  Energy Energy bills have been the main driver of inflation since the 2022 price shock caused by Russia's invasion of Ukraine. It's all linked to the UK's reliance on natural gas to provide power and heat, forcing up not only bills from suppliers but also raising costs across the economy. Expectations of weaker demand, due to the trade war, have helped bring down day-ahead UK wholesale costs by 20% in April alone - by almost 50% since February. Updated forecasts by industry specialist Cornwall Insight last week predicted a 9% decline in the price cap adjustment due to take effect from July, and saw continued declines even into winter. It is likely that July's decrease could be even more meaningful given wholesale costs have continued to fall, in line with longer-term contracts. The price cap figure will be revealed in three weeks' time by the industry regulator.  Imports There is a growing swell of opinion that the UK, and others, could become a dumping ground for goods that America has turned her nose up at due to the tariffs. The thinking goes that big exporters, such as China, will just want to sell off products - that should have gone to the US - on the cheap. That is not good for domestic suppliers but it should also place downwards pressure on the pace of inflation. When a member of the Bank of England's rate-setting committee, Megan Greene, signed up to this theory in remarks last week (on the basis that the UK does not retaliate to Trump's tariffs), it prompted financial markets to fully price in an interest rate cut on 8 May. Interest rates Interest rates are the medicine, deployed by the Bank, to help keep inflation in check. By raising borrowing costs, or keeping them higher, you look to lower demand in the economy to cool price growth. Should fuel and energy bills fall substantially given the recent trends, and wage growth continue to ease amid shaky confidence in the economic outlook, pressure on policymakers to keep Bank rate elevated falls away. Read more:UK figures show Trump's tariff argument doesn't add upWhat are Trump's tariffs and how do they affect the UK? Financial markets are currently seeing almost four interest rate cuts to come this year. That would take Bank rate from 4.5% to 3.5% by December. However, some analysts including those at US investment bank Morgan Stanley believe it will fall to 3.25%, with the possibility of a bumper half percentage point reduction next week. Whatever happens next Thursday multiple rate cuts, alongside lower fuel and energy bills, would represent a big win for households and businesses alike in very uncertain and expensive times."
    },
    {
        "title": "British Gas-owner Centrica faces backlash against chief's pay",
        "description": "The owner of British Gas, Britain's biggest domestic energy supplier, is facing a backlash against its chief executive's pay next week &#8211; a year after he said his multimillion pound package was impossible to justify.",
        "url": "https://news.sky.com/story/british-gas-owner-centrica-faces-backlash-against-chief8217s-pay-13359175",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-centrica-net-zero-chris-oshea_6222011.jpg?20230718121012",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-01 10:57:00",
        "Headline": "ISS, the shareholder advisory group, has urged Centrica investors to vote against Chris O'Shea's near-29% salary rise at its AGM next week, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of British Gas, Britain's biggest domestic energy supplier, is facing a backlash against its chief executive's pay next week – a year after he said his multimillion pound package was impossible to justify. Sky News has learnt that a number of Centrica's shareholders will vote against its remuneration report at its annual meeting on 8 May following a recommendation from the leading proxy adviser Institutional Shareholder Services (ISS). In a report circulated to clients, ISS said a 28.7% salary rise for Chris O'Shea was the principal reason for its recommendation to oppose Centrica's pay report. Money latest: State pensions underpaid by £800m It added that Mr O'Shea's pay rise and the 8.5% increase handed to Centrica's finance chief were \"materially above those given to the wider workforce\". \"The CEO's salary positioning and manner in which the increase has been implemented is not considered to be supported by cogent rationale,\" ISS said. As a result of the salary increase, Mr O'Shea will also benefit from \"quasi-guaranteed restricted stock plan awards, which are also seeing material increases under the proposed remuneration policy\". \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  Luxury store Harrods is latest retail victim of cyber attackers\n                 \n                  M&S pauses recruitment amid ongoing cyber attack\n                 Last year, Mr O'Shea told the BBC he could not justify his multimillion pound pay package. He was paid £4.3m last year, roughly half what he earned in the previous 12 months. Companies including Unilever and Melrose have been hit by sizeable pay revolts this week amid signs that UK boards are experiencing a bumpier-than-expected AGM season. Centrica declined to comment."
    },
    {
        "title": "'De minimis': The rarely examined trade clause about to become a very big deal",
        "description": "The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important.",
        "url": "https://news.sky.com/story/de-minimis-the-rarely-examined-trade-clause-about-to-become-a-very-big-deal-13358896",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shein-china_6902118.jpg?20250430204354",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-05-01 02:00:00",
        "Headline": "There's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. Now, the US is set to scrap it altogether - and nobody knows what will happen next. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The thing about trade, and the economics of trade, is that it is simultaneously desperately boring and desperately important. For example, consider a little bit of legal small print no one spent all that much time thinking about until recently - a clause in most countries' customs arrangements known as \"de minimis\". The idea behind de minimis is quite simple. Collecting customs can be an expensive business. You need to employ lots of people to check goods, police the system and collect the relevant customs and tariffs. In theory, you could fund that via the customs you're charging people to import goods into the country. But what if the items you're imposing tariffs and charges on are so cheap that it makes no economic sense to actually impose those charges? Consider a £5 T-shirt of the kind you might order from an online retailer such as Shein. In theory, that garment should face a 20% tariff when it arrives from China into the UK. \n                  iPhones sold in US will no longer come from China - as Apple reveals impact of Trump's tariffs\n                 \n                  Mike Waltz's 'Signalgate' mistake weakened Trump - so why isn't Pete Hegseth also getting fired?\n                 \n                  US national security adviser Mike Waltz to leave role in first major change to Trump's team\n                 But since 20% of a small number is an even smaller number, most customs authorities, including those in the UK, have taken the stance of essentially excluding any cheap imports from paying customs. This is the 'de minimis' rule. There are similar rules in most countries, with the main difference being the threshold at which they kick in. Here in Britain, de minimis applies to anything worth less than £135. In the US the threshold at which you start paying customs charges is higher: $800. Now, there's a long and detailed set of discussions that have bored on for decades about the pros and cons of this scheme. The historic arguments against collecting those fees were that a) doing so probably cost more money than it would raise, b) scanning and checking every import would jam up ports and airports unnecessarily and c) it might have a bearing on the wider economy as it throws further sand in the wheels of commerce. But in recent years, a host of mostly Chinese retailers have exploited the de minimis rule to ship (actually, mostly to fly) cheap products to the US, UK, Europe and beyond. The most visible of these companies are Shein and Temu. By directly flying consignments of very cheap clothes and consumer goods to airports in the west, they have been able to undercut other companies without having to pay customs fees. All of which is why, alongside the host of other tariffs imposed in recent weeks, Donald Trump is also doing something else - eliminating America's de minimis rules altogether. At least, that's the plan. Having pledged to do so in February, the administration rapidly reversed the decision after consignments began to pile up at US airports. However, the impending rule, which is due to kick in this Friday, sounds like it might be more concrete than the last one. And, if it's actually imposed, tariffs of 145% will be imposed on goods that, once upon a time, didn't face any tariffs at all. Which is a very big deal indeed. Already, prices on websites including Shein have begun to increase. Consumers have begun to abandon the sites' apps. And consignments of goods bound for the US from China have begun to slow. The real question is what happens next. Does the White House U-turn again? Or does it stand firm? Even as American consumers see the cost of their hitherto cheap goods rise, and potentially even face empty supermarket shelves, the notion of which was summoned up by a delegation of retail chiefs who met with the president last week. The short answer, as with so much about the current US administration is: no one really knows, and if they say they do, don't believe them."
    },
    {
        "title": "Labour hold North Tyneside - follow mayoral election results as they come in",
        "description": "Six mayors are being elected in England, with most of the mayoralties last contested in 2021.",
        "url": "https://news.sky.com/story/the-mayoral-election-results-in-full-13354442",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-mayoral-elections-mayors_6894862.jpg?20250423173455",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-01 21:00:00",
        "Headline": "Labour are defending four out of six mayoral contests, and the other two are newly created mayors. Results will be updated on this page as they come in through the night.",
        "Content": "Six mayors are being elected in England, with most of the mayoralties last contested in 2021. These include four combined authority mayorsi , otherwise known as metro mayors, as well as two city mayors. Two of the mayors will take up new positions in the Hull and East Yorkshire, and Greater Lincolnshire combined authorities. The other mayoralties were all last contested in 2021. Vote 2025 - latest updates Metro mayors • Cambridgeshire and Peterborough• Greater Lincolnshire• Hull and East Yorkshire• West of England City mayors • Doncaster• North Tyneside (LABOUR HOLD) All of these mayoralties will be elected under a first-past-the-post electoral system, which is also used for Westminster parliamentary elections. See below for more detailed breakdowns of results for each race. Metro mayors There are four metro mayors being elected in combined authorities. These mayors are elected by voters from several different areas and counting will take place at local council level. Tables will be updated as each local area reports its result. Cambridgeshire and Peterborough First established in 2017, the combined authority covers six areas. These are Peterborough, Fenland, Huntingdonshire, East Cambridgeshire, South Cambridgeshire, and Cambridge local council areas. Labour won the mayoralty from the Conservatives when it was last contested in 2021. Greater Lincolnshire This is a new mayoralty, being elected for the first time in 2025. The combined authority covers nine areas. These are North Lincolnshire, North East Lincolnshire, Boston, Lincoln, East Lindsey, West Lindsey, North Kesteven, South Kesteven, and South Holland local council areas. Hull and East Yorkshire This is a new mayoralty, being elected for the first time in 2025. The combined authority area covers both Hull City and East Riding of Yorkshire local council areas. West of England The combined authority covers three areas: Bristol City, South Gloucestershire, and Bath and North East Somerset local council areas. The authority was established in 2017. Labour won the mayoralty from the Conservatives when it was last contested in 2021. City mayors There are two city mayors being elected, one for Doncaster and one for North Tyneside. Labour's Ros Jones has been the Mayor of Doncaster since 2013, and is running for re-election this year. Labour have managed to hold onto the mayoralty of North Tyneside with a razor-thin majority of just 444 votes, with Reform coming in second place."
    },
    {
        "title": "Ballots being counted in key by-election test for Starmer and council contests",
        "description": "Ballots are being counted in a series of council elections, mayoral votes, and a key by-election test for Sir Keir Starmer.",
        "url": "https://news.sky.com/story/polls-close-in-thousands-of-council-elections-and-key-by-election-test-for-starmer-13359552",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-election-result-count_6903124.jpg?20250502022519",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-05-01 21:05:00",
        "Headline": "This is the first major electoral test for the Labour government, as well as Kemi Badenoch and Nigel Farage, after the general election last year.",
        "Content": "\n          Political reporter\n        Ballots are being counted in a series of council elections, mayoral votes, and a key by-election test for Sir Keir Starmer. More than 1,600 council seats are up for grabs across 23 local authorities, while four regional mayors and two local mayors will be elected. In Runcorn and Helsby voters are choosing a new MP after Labour's Mike Amesbury resigned following his conviction for punching a constituent. Betting odds had Reform ahead of the incumbent party in the by-election, and government parties tend to do poorly in by-elections. Politics latest: Follow the results live Already, the Labour Party is managing expectations that they may lose the seat. Speaking about the by-election and polls more widely, Ellie Reeves, the party's chair, said: \"These elections were always going to be a challenge, being held largely in areas dominated by the Conservatives, often for decades. That's why Labour candidates stood on a promise to bring change right across our country. \n                  Kneecap apologise to families for 'kill your MP' remarks\n                 \n                  Local elections 2025: The first public test for party leaders\n                 \n                  Kemi Badenoch does not rule out local coalitions with Reform after Thursday's council elections\n                 \"There are promising signs that the Labour government's plan for change is already starting to turn around 14 years of Tory failure. \"NHS waiting lists have fallen consistently. Free breakfast clubs are starting to roll out in every primary school. Some 3.5 million workers got a pay rise with the minimum wage increase this month, with pensions rising thanks to Labour's commitment to the triple lock.\"But we know people aren't yet fully feeling the benefit and we are just as impatient for change as the rest of the country. However the results turn out this evening, this Labour government will go further and faster in turning our country around and giving Britain the future it deserves.\" A Reform UK spokesperson said: \"We have fought a strong campaign. The two major parties are more fearful of the results tonight than we are.\" Sky News interviews party leaders:Sir Keir StarmerKemi BadenochNigel FarageSir Ed DaveyCarla Denyer  Torrid for the Tories? Because of the way local elections work, there were a large number of Conservative councillors up for election, compared to the other parties. With their favourability ratings still low, it is likely many will lose their seats. However, they are pinning their hopes on Labour doing badly, with murmurings of disquiet about Ms Badenoch's leadership. A Conservative spokesperson said: \"Tonight will be the first real test of Keir Starmer's Labour government, ten months after they won an unprecedented majority at the general election. \"The Conservatives have started on the process of renewing our party under Kemi Badenoch's leadership. But we also have always been clear that these would be tough elections for the party - defending an incredibly high watermark from 2021 when we took two-thirds of all seats. \"If the 2024 general election was replicated on today's battleground, we would lose control of almost every single council.\" According to Liberal Democrat leader Sir Ed Davey, the party is expecting \"big gains\" off the Tories in the Conservative's \"former middle England heartlands\". The Greens are also anticipating a good set of elections. In the first result of the night, Labour held on to the North Tyneside mayoralty by just 444 votes. Five other mayoralties are also up grabs: Cambridgeshire and Peterborough, West of England, Greater Lincolnshire, Hull and East Yorkshire, and Doncaster.  Mr Farage told Sky News political editor Beth Rigby his party have a good chance in Hull, Lincolnshire and perhaps Doncaster. Join Sky News presenter Jonathan Samuels and deputy political editor Sam Coates to follow the results. Lead politics presenter Sophy Ridge, political editor Beth Rigby, and data and economics editor Ed Conway will take over on Friday morning to report and explain what has happened."
    },
    {
        "title": "M&S pauses recruitment amid ongoing cyber attack",
        "description": "M&S has paused recruitment amid an ongoing cyber attack.",
        "url": "https://news.sky.com/story/ms-pauses-recruitment-amid-ongoing-cyber-attack-13359330",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marks-and-spencer-shop_6896501.jpg?20250425144859",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-01 15:03:00",
        "Headline": "On Thursday, the company had no jobs listed anywhere across its UK business despite having more than 200 job openings this time last week.",
        "Content": " M&S has paused recruitment amid an ongoing cyber attack. The company has pulled all online job adverts from its website as it seeks to resolve problems on its platforms. M&S's website currently says: \"Sorry you can't search or apply for roles right now, we're working hard to be back online as soon as possible.\" Read more: Who are the hackers linked to M&S cyber attack? On Thursday, the company had no jobs listed anywhere across its UK business despite having more than 200 job openings this time last week. \"While we proactively manage the cyber incident, we are temporarily pausing some of our normal processes so we can continue to work hard on offering the best M&S for our customers and colleagues,\" M&S told Sky News' Money team. \"Job adverts will be up again in due course.\" \n                  Who are Scattered Spider? How the notorious hackers linked to M&S cyber attack work\n                 \n                  The UK is 'widely' underestimating online threats from hostile states and criminals, cyber security chief warns\n                 \n                  UK in AI arms race with Russia as Putin 'wants destruction', minister to warn\n                 The British business employs around 65,000 people and has been battling the cyber attack for more than a week. It is still not taking online orders and some customers have reported empty shelves around the country. M&S first reported issues over the Easter weekend, when it stopped taking click-and-collect orders and saw contactless payments impacted by the \"cyber incident\". It has since restarted contactless payments. Read more from Sky News:Half-tonne piece of rocket to crash back down to EarthTesla reportedly searching for Elon Musk's successor On Wednesday, the Metropolitan Police confirmed it is investigating a cyber attack. In a separate incident, rival retailer The Co-op shut off parts of its IT systems on Wednesday after an attempted hack. Co-op staff are now reportedly being ordered to keep cameras on to verify identities on all remote work meetings as a result."
    },
    {
        "title": "What is going on with the retail cyber attacks?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/scattered-spider-who-are-the-hackers-linked-to-the-ms-attack-13359343",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/2372505010431285307_6902754.png?20250501160947",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-01 15:13:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 M&S has been targeted in a cyber attack which has left it unable to process online orders or take contactless payments. There have also been cyber attacks against Harrods and Co-Op, which are being investigated. Some experts predict it could be costing M&S millions of pounds each day. The notorious hacking group, Scattered Spider, is believed to be behind the attack on M&S. A cyber security company has told Sky News the group is \"one of the most dangerous and active groups\" they are monitoring. On today's Sky News Daily Niall Paterson talks to our science and technology reporter, Mickey Carroll, about Scattered Spider and what can be done to tackle cyber gangs. Producer: Natalie Ktena Editor: Wendy Parker"
    },
    {
        "title": "Daughter of Sir David Amess praises 'swift action' of counter-terror police's Kneecap investigation",
        "description": "The daughter of murdered MP Sir David Amess has praised \"swift action taken by law enforcement\" after counter-terror police confirmed they are investigating claims the band Kneecap called for people to kill their MPs.",
        "url": "https://news.sky.com/story/daughter-of-sir-david-amess-praises-swift-action-of-counter-terror-polices-kneecap-investigation-13359154",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kneecap-rap-trio-ifta_6899609.jpg?20250501172615",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-01 10:10:00",
        "Headline": "Sir David Amess, Conservative MP for Southend-on-Sea, was murdered by Ali Harbi Ali at his constituency surgery in Leigh-on-Sea in October 2021. His daughter Katie has praised the Met Police for its investigation into a video of Kneecap allegedly calling for people to kill their MPs.",
        "Content": "The daughter of murdered MP Sir David Amess has praised \"swift action taken by law enforcement\" after counter-terror police confirmed they are investigating claims the band Kneecap called for people to kill their MPs. The Metropolitan Police revealed on Thursday that its Counter Terrorism Internet Referral Unit has found \"there are grounds for further investigation into potential offences\" in connection to two videos of the rap group. The first, believed to be from a Kneecap gig at London's Kentish Town Forum in November 2024, allegedly shows one member of the band shouting: \"Up Hamas, up Hezbollah\". The second, thought to be from a separate concert in November 2023, reportedly sees another say: \"The only good Tory is a dead Tory. Kill your local MP.\" Sir David, Conservative MP for Southend-on-Sea, was murdered by Ali Harbi Ali at his constituency surgery in Leigh-on-Sea in October 2021. It was the second murder of a British MP in less than 10 years, following the murder of Labour's Jo Cox by Thomas Mair in 2016. Read more Why are Kneecap controversial?Murdered MP's daughter 'happy to meet' rappers \n                  Sir David Amess's family 'betrayed and angry' as government refuse inquiry\n                 \n                  Refusal to hold inquiry into Sir David Amess murder 'an absolute insult', says his daughter\n                 \n                  What is Prevent - and why is the anti-terrorism programme controversial?\n                 Previously the Met said it was assessing whether the two clips of the Irish language trio met the threshold for an investigation. Katie Amess said in response to their decision on Thursday to pursue an investigation: \"Kneecap's rhetoric is not only abhorrent but poses a direct threat to the safety and well-being of elected officials and the democratic institutions they represent. \"The glorification and incitement of violence have no place in our society and must be unequivocally condemned. \"I commend the swift action taken by law enforcement agencies in addressing this and urge a thorough investigation to determine the full extent of any criminal activity.\" She added that musicians \"must be held accountable\" for rhetoric that \"incites violence and hatred\" and that cultural venues should \"not be exploited to propagate messages of hate\".  In a statement posted on Instagram, the group - made up of Liam Og O Hannaidh, Naoise O Caireallain and JJ O Dochartaigh - addressed the families of murdered MPs Sir David Amess and Jo Cox, saying: \"We never intended to cause you hurt.\" But Ms Amess accused them of \"gaslighting\", saying their comments were \"absurd\" and \"not an apology\". Dozens of artists come out in support Since the controversy emerged amid a backlash over their performance at US festival Coachella, in which they displayed the message \"Free Israel. Free Palestine\", more than 40 artists have come out to support them. Paul Weller, Primal Scream and DJ Annie Mac are among the music stars to have signed an open letter claiming there has been a \"clear, concerted attempt to censor and ultimately de-platform\" the band. Kneecap had their concert at the Eden Project in Cornwall cancelled on Wednesday. In its statement on Thursday, the Met Police confirmed: \"Both videos were referred to the Counter Terrorism Internet Referral Unit for assessment by specialist officers, who have determined there are grounds for further investigation into potential offences linked to both videos. \"The investigation is now being carried out by officers from the Met's Counter Terrorism Command and inquiries remain ongoing at this time.\""
    }
]