[
    {
        "title": "'A threat to national security': Fears drones could be used to lift inmates out of prisons",
        "description": "Sophisticated drones sending \"overwhelming amounts\" of drugs and weapons into prisons represent a threat to national security, according to an annual inspection report by the prisons watchdog.",
        "url": "https://news.sky.com/story/drones-are-sending-overwhelming-amounts-of-drugs-into-prisons-and-could-help-inmates-escape-report-warns-13393798",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-drone-prison_6959764.jpg?20250708004925",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-07-07 23:29:00",
        "Headline": "The HMP chief inspector of prisons has issued a stark warning over drugs being delivered via drones - saying \"the police and prison service have in effect ceded the airspace\" over two Category A jails. ",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Sophisticated drones sending \"overwhelming amounts\" of drugs and weapons into prisons represent a threat to national security, according to an annual inspection report by the prisons watchdog. HMP chief inspector of prisons Charlie Taylor has warned criminal gangs are targeting jails and making huge profits selling contraband to a \"vulnerable and bored\" prison population. The watchdog boss reiterated his concerns about drones making regular deliveries to two Category A jails, HMP Long Lartin and HMP Manchester, which hold \"the most dangerous men in the country\", including terrorists.  Mr Taylor said \"the police and prison service have in effect ceded the airspace\" above these two high-security prisons, which he said was compromising the \"safety of staff, prisoners, and ultimately that of the public\". \"The possibility now whereby we're seeing packages of up to 10kg brought in by serious organised crime means that in some prisons there is now a menu of drugs available,\" he said. \"Anything from steroids to cannabis, to things like spice and cocaine.\" \"Drone technology is moving fast... there is a level of risk that's posed by drones that I think is different from what we've seen in the past,\" warned the chief inspector - who also said there's a \"theoretical risk\" that a prisoner could escape by being carried out of a jail by a drone. He urged the prison service to \"get a grip\" of the issue, stating: \"We'd like to see the government, security services, coming together, using technology, using intelligence, so that this risk doesn't materialise.\" The report makes clear that physical security - such as netting, windows and CCTV - is \"inadequate\" in some jails, including Manchester, with \"inexperienced staff\" being \"manipulated\". Mr Taylor said there are \"basic\" measures which could help prevent the use of drones, such as mowing the lawn, \"so we don't get packages disguised as things like astro turf\". Responding to the report, the Prison Advice and Care Trust (PACT) said: \"The ready access to drugs is deeply worrying and is undermining efforts to create places of rehabilitation.\" Mr Taylor's report found that overcrowding continues to be what he described as a \"major issue\", with increasing levels of violence against staff and between prisoners, combined with a lack of purposeful activity. Some 20% of adult men responding to prisoner surveys said they felt unsafe at the time of the inspection, increasing to 30% in the high security estate. Andrea Coomber, chief executive of the Howard League for Penal Reform, said: \"This report is a checklist for all the reasons the government must prioritise reducing prison numbers, urgently. \"Sentencing reform is essential, and sensible steps to reduce the prison population would save lives.\" Read more UK news:The human impact of the Post Office scandalGovt to ban 'appalling' NDAs that silence victims  The report comes after the government pledged to accept most of the recommendations proposed in the independent review of sentencing policy, with the aim of freeing up around 9,500 spaces. Those measures won't come into effect until spring 2026. Prisons Minister Lord Timpson said Mr Taylor's findings show \"the scale of the crisis\" the government \"inherited\", with \"prisons dangerously full, rife with drugs and violence\". He said: \"After just 500 prison places added in 14 years, we're building 14,000 extra - with 2,400 already delivered - and reforming sentencing to ensure we never run out of space again. \"We're also investing £40m to bolster security, alongside stepping up cooperation with police to combat drones and stop the contraband which fuels violence behind bars.\""
    },
    {
        "title": "Texas floods: At least 104 killed - as new images show scale of the destruction",
        "description": "At least 104 people have died in the flash floods that have left a trail of destruction across Texas.",
        "url": "https://news.sky.com/story/seven-more-deaths-confirmed-in-texas-floods-bringing-total-to-at-least-89-13393687",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-guadalupe-river-texas_6958436.jpg?20250706111155",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-07 14:54:00",
        "Headline": "Kerr County Sheriff's Office said the number of bodies found in the area had risen from 75 to 84 - with 56 adults and 28 children.",
        "Content": " At least 104 people have died in the flash floods that have left a trail of destruction across Texas. Kerr County Sheriff's Office said the number of bodies found in the area had risen from 75 to 84 - including 56 adults and 28 children. The have been seven fatalities in Travis County, six in Kendall County, four in Burnet County, two in Williamson County and one in Tom Green County. Earlier, White House press secretary Karoline Leavitt warned that \"the situation on the ground remains dangerous\" and that there \"could be additional public safety threats with additional incoming heavy rain\". Latest updates - Texas floods The floods that first struck on Friday have wreaked havoc and left people in a state of grief - with 27 of the confirmed deaths having taken place at a girls' summer camp in Kerr County. Among those killed at Camp Mystic were Renee Smajstrla and Sarah Marsh, both eight, Eloise Peck and Lila Bonner, both nine, and the camp's director Richard Eastland. \n                  The 'Alligator Alcatraz' detention centre was built in eight days - but problems are emerging\n                 \n                  Israeli PM nominates Donald Trump for Nobel Peace Prize - as Gaza ceasefire talks continue \n                 \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 A photo has now emerged showing the inside of the camp on Saturday after the waters hit. At least 41 people are still missing in the state - including 10 girls from Camp Mystic. In her news conference, Ms Leavitt criticised people who have claimed the Trump administration's cuts to the National Weather Service (NWS) have played a role in the worsening the disaster. It comes after Texas officials criticised the NWS by claiming it failed to warn the public about the impending danger. Meanwhile, Senate Democratic Leader Chuck Schumer asked the Department of Commerce's acting inspector general on Monday to probe whether staffing vacancies at the NWS's San Antonio office contributed to \"delays, gaps, or diminished accuracy\" in forecasting the flooding. The NWS did not immediately respond to a request for comment on Mr Schumer's letter, but earlier defended its forecasting and emergency management. Ms Leavitt has told reporters that claims Mr Trump was responsible for any issues related to the flash floods response were \"depraved and despicable\". \"It is not [a political game], it is a national tragedy,\" she said. The press secretary also claimed, in relation to some NWS offices being reportedly understaffed, that one place actually had \"too many people\". \"Any person who has deliberately lied about the facts around the catastrophic event, you should be deeply ashamed,\" she said. She also said that Mr Trump was going to visit Texas \"later in the week\". Previously, Mr Trump said it was likely he would visit on Friday. Texas Senator Ted Cruz spoke at a news conference and said: \"Texas is grieving right now, the pain, the shock of what has transpired these last few days has broken the heart of our state. \"Those numbers [the number of dead] are continuing to go up... that's every parent's nightmare, every mum and dad.\" He said he had picked up his own daughter from a camp in the area last week. Mr Cruz added: \"You know what I'd do? What I did when this happened? Just go hug your kids. \"Because I've got to tell you, I hugged my girls with tears in my eyes.\"  Dalton Rice, the city manager of Kerrville in Kerr County, was asked whether evacuation warnings could have been issued earlier. He said: \"It's very tough to make those calls because we also don't want to cry wolf. \"You know, we want to make sure that we activated [it] at the right time.\" He added: \"We had first responders getting swept away, responding to the first areas of rainfall. That's how quick it happened. \"They were driving to these areas and one of them got swept off the road.\""
    },
    {
        "title": "Israeli soldiers 'psychologically broken' after 'confronting the reality' in Gaza, UN expert says",
        "description": "A UN expert has said some young soldiers in the Israeli Defence Forces are being left \"psychologically broken\" after \"confront[ing] the reality among the rubble\" when serving in Gaza.  ",
        "url": "https://news.sky.com/story/israeli-soldiers-psychologically-broken-after-confronting-the-reality-in-gaza-un-expert-says-13393840",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-israel-gaza_6959756.jpg?20250707225133",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-07 21:43:00",
        "Headline": "Francesca Albanese told The World with Yalda Hakim that \"many\" of the young people fighting in Gaza are \"haunted by what they have seen, what they have done\".",
        "Content": " A UN expert has said some young soldiers in the Israeli Defence Forces are being left \"psychologically broken\" after \"confront[ing] the reality among the rubble\" when serving in Gaza.   Francesca Albanese, the UN Human Rights Council's special rapporteur on the occupied Palestinian territories, was responding to a Sky News interview with an Israeli solider who described arbitrary killing of civilians in Gaza. She told The World with Yalda Hakim that \"many\" of the young people fighting in Gaza are \"haunted by what they have seen, what they have done\". \"It doesn't make sense,\" Ms Albanese said. \"This is not a war, this is an assault against civilians and this is producing a fracture in many of them. \"As that soldier's testimony reveals, especially the youngest among the soldiers have been convinced this is a form of patriotism, of defending Israel and Israeli society against this opaque but very hard felt enemy, which is Hamas. \"But the thing is that they've come to confront the reality among the rubble of Gaza.\" Being in Gaza is \"probably this is the first time the Israeli soldiers are awakening to this,\" she added. \"And they don't make sense of this because their attachment to being part of the IDF, which is embedded in their national ideology, is too strong. \n                  Israeli soldier describes arbitrary killing of civilians in Gaza\n                 \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Hamas gives 'positive' response to ceasefire proposal but asks for amendments\n                 \"This is why they are psychologically broken.\" Jonathan Conricus, a former IDF spokesman who is now a senior fellow at the Foundation for Defence of Democracies, said he believes the Sky News interview with the former IDF solider \"reflects one part of how ugly, difficult and horrible fighting in a densely populated, urban terrain is\". \"I think [the ex-soldier] is reflecting on how difficult it is to fight in such an area and what the challenges are on the battlefield,\" he said.  'An economy of genocide'  Ms Albanese, one of dozens of independent UN-mandated experts, also said her most recent report for the human rights council has identified \"an economy of genocide\" in Israel. The system, she told Hakim, is made up of more than 60 private sector companies \"that have become enmeshed in the economy of occupation […] that have Israel displace the Palestinians and replace them with settlers, settlements and infrastructure Israel runs.\" Israel has rejected allegations of genocide in Gaza, citing its right to defend itself after Hamas's attack on 7 October 2023.  The companies named in Ms Albanese's report are in, but not limited to, the financial sector, big tech and the military industry. \"These companies can be held responsible for being directed linked to, or contributing, or causing human rights impacts,\" she said. \"We're not talking of human rights violations, we are talking of crimes.\" \"Some of the companies have engaged in good faith, others have not,\" Ms Albanese said. Read more:Israeli soldier describes arbitrary killing of civilians in GazaBritish surgeons on life in Gaza The companies she has named include American technology giant Palantir, which has issued a statement to Sky News. It said it is \"not true\" that Palantir \"is the (or a) developer of the 'Gospel' - the AI-assisted targeting software allegedly used by the IDF in Gaza, and that we are involved with the 'Lavender' database used by the IDF for targeting cross-referencing\". \"Both capabilities are independent of and pre-ate Palantir's announced partnership with the Israeli Defence Ministry,\" the statement added."
    },
    {
        "title": "Post Office scandal: Daughter has had 'panic attacks' since mum was accused of stealing",
        "description": "The daughter of a Post Office victim has told Sky News she suffered \"dark thoughts of suicide\" in the years after her mother was accused of stealing.",
        "url": "https://news.sky.com/story/post-office-scandal-daughter-has-had-panic-attacks-since-mum-was-accused-of-stealing-13393742",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-post-office-horizon_6414709.jpg?20240108095342",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-07-07 23:22:00",
        "Headline": "The first public inquiry report on the Post Office - examining redress and the \"human impact\" of the scandal - is due to be published today.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  The daughter of a Post Office victim has told Sky News she suffered \"dark thoughts of suicide\" in the years after her mother was accused of stealing. Kate Burrows was 14 years old when her mother, Elaine Hood, was prosecuted and subsequently convicted in 2003. The first public inquiry report on the Post Office - examining redress and the \"human impact\" of the scandal - is due to be published today. \"I've suffered with panic attacks from about 14, 15 years old, and I still have them to this day,\" Kate said. \"I've been in and out of therapy for what feels like most of my adult life and it absolutely categorically goes back to [what happened].\" Kate, along with others, helped set up the charity Lost Chances, supporting the children of Post Office victims. She hopes the inquiry will recognise their suffering. \"It's important that our voices are heard,\" she said. \"Not only within the report, but in law actually. \n                  Post Office scandal: Victims say government's control of redress schemes should be taken away\n                 \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \"And then maybe that would be a deterrent for any future cover-ups, that it's not just the one person it's the whole family [affected].\" Her sister, Rebecca Richards, who was 18 when their mother was accused, described how an eating disorder \"escalated\" after what happened. \"When my mum was going through everything, my only control of that situation was what food I put in my body,\" she said. She also said that seeing her mother at court when she was convicted, would \"stay with me forever\". \"The two investigators were sat in front of my dad and I, sniggering and saying 'we've got this one'. \"To watch my mum in the docks handcuffed to a guard... not knowing if she was going to be coming home... that is the most standout memory for me.\" The sisters are hoping the inquiry findings will push Fujitsu into fulfilling a promise they made nearly a year ago - to try and help the children of victims. Last summer, Kate met with the European boss of the company, Paul Patterson, who said he would look at ways they could support Lost Chances. Despite appearing at the inquiry in November last year and saying he would not \"stay silent\" on the issue, Kate said there has been little movement in terms of support. \"It's very much a line of 'we're going to wait until the end of the inquiry report to decide',\" she said. \"But Mr Patterson met us in person, looked us in the eye, and we shared the most deeply personal stories and he said we will do something... they need to make a difference.\"  Fujitsu, who developed the faulty Horizon software, has said it is in discussions with the government regarding a contribution to compensation. The inquiry will delve in detail into redress schemes, of which four exist, three controlled by the government and one by the Post Office. Victims of the scandal say they are hoping Sir Wyn Williams, chair of the inquiry, will recommend that the government and the Post Office are removed from the redress schemes as thousands still wait for full and fair redress. A Department for Business and Trade spokesperson said they were \"grateful\" for the inquiry's work, describing \"the immeasurable suffering\" victims endured and saying the government has \"quadrupled the total amount paid to affected postmasters\", with more than £1bn having now been paid to thousands of claimants. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Jury shown CCTV and bodycam footage of brothers allegedly assaulting police at Manchester Airport",
        "description": "CCTV and police bodycam footage allegedly showing three police officers being assaulted at Manchester Airport has been played to jurors.",
        "url": "https://news.sky.com/story/jury-shown-cctv-and-bodycam-footage-of-brothers-allegedly-assaulting-police-at-manchester-airport-13393655",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-manchester-airport_6959448.jpg?20250707151316",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-07 13:37:00",
        "Headline": "A jury at Liverpool Crown Court today watched CCTV and bodycam footage from opposite angles, which captured what the prosecution says is a \"high level of violence\" being used by the siblings.",
        "Content": " CCTV and police bodycam footage allegedly showing three police officers being assaulted at Manchester Airport has been played to jurors. Mohammed Fahir Amaaz, 20, and his brother, Muhammad Amaad, 26, are said to have struck out after police were called to the airport on 23 July last year, following Amaaz allegedly headbutting a customer at a Starbucks in Terminal 2. Minutes later, three police officers approached the defendants at the paystation in the terminal's car park. A jury at Liverpool Crown Court today watched CCTV footage from opposite angles, which captured what the prosecution says was a \"high level of violence\" being used by the siblings. The prosecution says Amaaz resisted as officers tried to move him to arrest him, and Amaad then intervened. Junior counsel Adam Birkby suggested Amaaz threw 10 punches, including one to the face of PC Lydia Ward, which knocked her to the floor. His brother Amaad is then said to have aimed six punches at firearms officer PC Zachary Marsden. Amaaz also allegedly kicked PC Marsden and struck firearms officer PC Ellie Cook twice with his elbow. He is said to have punched PC Marsden from behind and had a hold of him, before PC Cook discharged her Taser. The bodycam and CCTV footage, submitted as evidence by the prosecution, allegedly shows the officers' arrival in the Terminal 2 car park and their attempts to arrest the siblings, as well as their exchanges with them. PC Ward can be heard saying \"Oi, you b*****d\" in footage from her bodycam, the prosecution evidence appears to show. She then appears to fall to the floor and screams. PC Cook, who is pointing her Taser at one of the defendants, then allegedly says: \"Stay on the floor, stay on the floor whatever you do.\" \"Get back, get back,\" PC Ward appears to say. The bodycam footage, shown to the jury by the prosecution, shows PC Marsden, who is also pointing his Taser, appear to approach the defendant who is lying on the ground and kick out at him. Mr Birkby said: \"Mr Amaaz, while prone, lifts his head towards the officers. PC Marsden kicks Mr Amaaz around the head area. \"PC Marsden stamps his foot towards the crown of Mr Amaaz's head area but doesn't appear to connect with Mr Amaaz.\" Amaaz denies three counts of assault occasioning actual bodily harm to the three police officers and one count of assault to Abdulkareem Ismaeil, the customer at Starbucks. Amaad denies one count of assault occasioning actual bodily harm to PC Marsden."
    },
    {
        "title": "'A threat to national security': Fears drones could be used to lift inmates out of prisons",
        "description": "Sophisticated drones sending \"overwhelming amounts\" of drugs and weapons into prisons represent a threat to national security, according to an annual inspection report by the prisons watchdog.",
        "url": "https://news.sky.com/story/drones-are-sending-overwhelming-amounts-of-drugs-into-prisons-and-could-help-inmates-escape-report-warns-13393798",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-drone-prison_6959764.jpg?20250708004925",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-07-07 23:29:00",
        "Headline": "The HMP chief inspector of prisons has issued a stark warning over drugs being delivered via drones - saying \"the police and prison service have in effect ceded the airspace\" over two Category A jails. ",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Sophisticated drones sending \"overwhelming amounts\" of drugs and weapons into prisons represent a threat to national security, according to an annual inspection report by the prisons watchdog. HMP chief inspector of prisons Charlie Taylor has warned criminal gangs are targeting jails and making huge profits selling contraband to a \"vulnerable and bored\" prison population. The watchdog boss reiterated his concerns about drones making regular deliveries to two Category A jails, HMP Long Lartin and HMP Manchester, which hold \"the most dangerous men in the country\", including terrorists.  Mr Taylor said \"the police and prison service have in effect ceded the airspace\" above these two high-security prisons, which he said was compromising the \"safety of staff, prisoners, and ultimately that of the public\". \"The possibility now whereby we're seeing packages of up to 10kg brought in by serious organised crime means that in some prisons there is now a menu of drugs available,\" he said. \"Anything from steroids to cannabis, to things like spice and cocaine.\" \"Drone technology is moving fast... there is a level of risk that's posed by drones that I think is different from what we've seen in the past,\" warned the chief inspector - who also said there's a \"theoretical risk\" that a prisoner could escape by being carried out of a jail by a drone. He urged the prison service to \"get a grip\" of the issue, stating: \"We'd like to see the government, security services, coming together, using technology, using intelligence, so that this risk doesn't materialise.\" The report makes clear that physical security - such as netting, windows and CCTV - is \"inadequate\" in some jails, including Manchester, with \"inexperienced staff\" being \"manipulated\". Mr Taylor said there are \"basic\" measures which could help prevent the use of drones, such as mowing the lawn, \"so we don't get packages disguised as things like astro turf\". Responding to the report, the Prison Advice and Care Trust (PACT) said: \"The ready access to drugs is deeply worrying and is undermining efforts to create places of rehabilitation.\" Mr Taylor's report found that overcrowding continues to be what he described as a \"major issue\", with increasing levels of violence against staff and between prisoners, combined with a lack of purposeful activity. Some 20% of adult men responding to prisoner surveys said they felt unsafe at the time of the inspection, increasing to 30% in the high security estate. Andrea Coomber, chief executive of the Howard League for Penal Reform, said: \"This report is a checklist for all the reasons the government must prioritise reducing prison numbers, urgently. \"Sentencing reform is essential, and sensible steps to reduce the prison population would save lives.\" Read more UK news:The human impact of the Post Office scandalGovt to ban 'appalling' NDAs that silence victims  The report comes after the government pledged to accept most of the recommendations proposed in the independent review of sentencing policy, with the aim of freeing up around 9,500 spaces. Those measures won't come into effect until spring 2026. Prisons Minister Lord Timpson said Mr Taylor's findings show \"the scale of the crisis\" the government \"inherited\", with \"prisons dangerously full, rife with drugs and violence\". He said: \"After just 500 prison places added in 14 years, we're building 14,000 extra - with 2,400 already delivered - and reforming sentencing to ensure we never run out of space again. \"We're also investing £40m to bolster security, alongside stepping up cooperation with police to combat drones and stop the contraband which fuels violence behind bars.\""
    },
    {
        "title": "Post Office scandal: Daughter has had 'panic attacks' since mum was accused of stealing",
        "description": "The daughter of a Post Office victim has told Sky News she suffered \"dark thoughts of suicide\" in the years after her mother was accused of stealing.",
        "url": "https://news.sky.com/story/post-office-scandal-daughter-has-had-panic-attacks-since-mum-was-accused-of-stealing-13393742",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-post-office-horizon_6414709.jpg?20240108095342",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-07-07 23:22:00",
        "Headline": "The first public inquiry report on the Post Office - examining redress and the \"human impact\" of the scandal - is due to be published today.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n  The daughter of a Post Office victim has told Sky News she suffered \"dark thoughts of suicide\" in the years after her mother was accused of stealing. Kate Burrows was 14 years old when her mother, Elaine Hood, was prosecuted and subsequently convicted in 2003. The first public inquiry report on the Post Office - examining redress and the \"human impact\" of the scandal - is due to be published today. \"I've suffered with panic attacks from about 14, 15 years old, and I still have them to this day,\" Kate said. \"I've been in and out of therapy for what feels like most of my adult life and it absolutely categorically goes back to [what happened].\" Kate, along with others, helped set up the charity Lost Chances, supporting the children of Post Office victims. She hopes the inquiry will recognise their suffering. \"It's important that our voices are heard,\" she said. \"Not only within the report, but in law actually. \n                  Post Office scandal: Victims say government's control of redress schemes should be taken away\n                 \n                  Post Office: Police identify seven suspects related to Horizon scandal\n                 \n                  Post Office scandal: Government has not done enough to ensure compensation for victims, committee of MPs finds\n                 \"And then maybe that would be a deterrent for any future cover-ups, that it's not just the one person it's the whole family [affected].\" Her sister, Rebecca Richards, who was 18 when their mother was accused, described how an eating disorder \"escalated\" after what happened. \"When my mum was going through everything, my only control of that situation was what food I put in my body,\" she said. She also said that seeing her mother at court when she was convicted, would \"stay with me forever\". \"The two investigators were sat in front of my dad and I, sniggering and saying 'we've got this one'. \"To watch my mum in the docks handcuffed to a guard... not knowing if she was going to be coming home... that is the most standout memory for me.\" The sisters are hoping the inquiry findings will push Fujitsu into fulfilling a promise they made nearly a year ago - to try and help the children of victims. Last summer, Kate met with the European boss of the company, Paul Patterson, who said he would look at ways they could support Lost Chances. Despite appearing at the inquiry in November last year and saying he would not \"stay silent\" on the issue, Kate said there has been little movement in terms of support. \"It's very much a line of 'we're going to wait until the end of the inquiry report to decide',\" she said. \"But Mr Patterson met us in person, looked us in the eye, and we shared the most deeply personal stories and he said we will do something... they need to make a difference.\"  Fujitsu, who developed the faulty Horizon software, has said it is in discussions with the government regarding a contribution to compensation. The inquiry will delve in detail into redress schemes, of which four exist, three controlled by the government and one by the Post Office. Victims of the scandal say they are hoping Sir Wyn Williams, chair of the inquiry, will recommend that the government and the Post Office are removed from the redress schemes as thousands still wait for full and fair redress. A Department for Business and Trade spokesperson said they were \"grateful\" for the inquiry's work, describing \"the immeasurable suffering\" victims endured and saying the government has \"quadrupled the total amount paid to affected postmasters\", with more than £1bn having now been paid to thousands of claimants. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Jury shown CCTV and bodycam footage of brothers allegedly assaulting police at Manchester Airport",
        "description": "CCTV and police bodycam footage allegedly showing three police officers being assaulted at Manchester Airport has been played to jurors.",
        "url": "https://news.sky.com/story/jury-shown-cctv-and-bodycam-footage-of-brothers-allegedly-assaulting-police-at-manchester-airport-13393655",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-manchester-airport_6959448.jpg?20250707151316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-07 13:37:00",
        "Headline": "A jury at Liverpool Crown Court today watched CCTV and bodycam footage from opposite angles, which captured what the prosecution says is a \"high level of violence\" being used by the siblings.",
        "Content": " CCTV and police bodycam footage allegedly showing three police officers being assaulted at Manchester Airport has been played to jurors. Mohammed Fahir Amaaz, 20, and his brother, Muhammad Amaad, 26, are said to have struck out after police were called to the airport on 23 July last year, following Amaaz allegedly headbutting a customer at a Starbucks in Terminal 2. Minutes later, three police officers approached the defendants at the paystation in the terminal's car park. A jury at Liverpool Crown Court today watched CCTV footage from opposite angles, which captured what the prosecution says was a \"high level of violence\" being used by the siblings. The prosecution says Amaaz resisted as officers tried to move him to arrest him, and Amaad then intervened. Junior counsel Adam Birkby suggested Amaaz threw 10 punches, including one to the face of PC Lydia Ward, which knocked her to the floor. His brother Amaad is then said to have aimed six punches at firearms officer PC Zachary Marsden. Amaaz also allegedly kicked PC Marsden and struck firearms officer PC Ellie Cook twice with his elbow. He is said to have punched PC Marsden from behind and had a hold of him, before PC Cook discharged her Taser. The bodycam and CCTV footage, submitted as evidence by the prosecution, allegedly shows the officers' arrival in the Terminal 2 car park and their attempts to arrest the siblings, as well as their exchanges with them. PC Ward can be heard saying \"Oi, you b*****d\" in footage from her bodycam, the prosecution evidence appears to show. She then appears to fall to the floor and screams. PC Cook, who is pointing her Taser at one of the defendants, then allegedly says: \"Stay on the floor, stay on the floor whatever you do.\" \"Get back, get back,\" PC Ward appears to say. The bodycam footage, shown to the jury by the prosecution, shows PC Marsden, who is also pointing his Taser, appear to approach the defendant who is lying on the ground and kick out at him. Mr Birkby said: \"Mr Amaaz, while prone, lifts his head towards the officers. PC Marsden kicks Mr Amaaz around the head area. \"PC Marsden stamps his foot towards the crown of Mr Amaaz's head area but doesn't appear to connect with Mr Amaaz.\" Amaaz denies three counts of assault occasioning actual bodily harm to the three police officers and one count of assault to Abdulkareem Ismaeil, the customer at Starbucks. Amaad denies one count of assault occasioning actual bodily harm to PC Marsden."
    },
    {
        "title": "Stephen Doohan: Paramedic who secretly gave pregnant woman abortion drug jailed for more than 10 years",
        "description": "A paramedic who secretly gave a pregnant woman an abortion drug during sex has been jailed for more than 10 years.&#160;",
        "url": "https://news.sky.com/story/stephen-doohan-paramedic-who-secretly-gave-pregnant-woman-abortion-drug-jailed-for-more-than-10-years-13393526",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-glasgow-glasgow-court_6917345.jpg?20250707123236",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-07 09:31:00",
        "Headline": "A judge said the 33-year-old caused \"long-term psychological injury\" to his victim.",
        "Content": "A paramedic who secretly gave a pregnant woman an abortion drug during sex has been jailed for more than 10 years.  Stephen Doohan, 33, was married when he met the woman on holiday in Spain in 2021 and began a long-distance relationship. The High Court in Glasgow heard how the victim travelled to Edinburgh in March 2023 to visit Doohan after learning she was pregnant. During consensual sex, Doohan twice secretly administered the tablets which led to the woman suffering a miscarriage. In May, Doohan pleaded guilty to sexual assault and causing the woman to have an abortion. He returned to the dock on Monday where he was jailed for 10 years and six months. Lord Colbeck said Doohan caused \"long-term psychological injury\" to his victim. The judge said: \"You put her through considerable pain over a number of days and left her facing a lifetime of pain and loss.\" \n                  Liam Gallagher hits out at  Edinburgh council after Oasis fans branded 'rowdy'\n                 \n                  Women's centre founded by Harry Potter author JK Rowling to host conference on internet pornography\n                 \n                  Man appears in court charged with rape of 15-year-old girl in Edinburgh\n                 The court heard how the woman found tablets hidden under the mattress after she became suspicious over Doohan's behaviour in bed. Lord Colbeck said: \"The complainer then carried out an internet search for abortion tablets and confronted you over your actions.\" After the woman fell ill, Doohan convinced her to lie to medics at the Royal Infirmary of Edinburgh amid fears he would be arrested if she told the truth. The victim later attended another hospital with her sister and was told she was having a miscarriage. The Crown Office and Procurator Fiscal Service (COPFS) said Doohan sent the woman gifts including perfume, socks, facial cleansing oil, money to get her hair done and bought tickets for them to attend a football match. Read more from Sky News:Mother guilty of murdering three people with poisonous mushroomsIsraeli soldier describes arbitrary killing of civilians in Gaza The woman complained to the Scottish Ambulance Service in May 2023, sparking an investigation. The court heard that on 14 March 2023, the day the woman told Doohan she was pregnant, the paramedic used a work intranet to search for abortion drugs. Lord Colbeck said: \"You planned out what you did to your victim using resources available to you as a paramedic.\" In addition to his prison sentence, Doohan was also added to the sex offenders' register and banned from contacting his victim. Fiona Kirkby, procurator fiscal for high court sexual offences, said: \"Stephen Doohan's calculated and heinous actions caused the loss of the victim's pregnancy, robbing her of plans she had for the future. \"He has now been held accountable for this fundamental breach of trust. \"While offences like this are thankfully rare, I hope this prosecution sends a clear message to all those who seek to inflict sexual harm towards women. \"Our thoughts remain with the victim, who must be commended for reporting her experience and seeking justice. \"We recognise that reporting sexual offending can be difficult but would urge anyone affected to come forward and seek support when they feel ready to do so.\" The Scottish Ambulance Service branded it an \"appalling case\". A spokesperson added: \"We recognise the courage it must have taken for the victim to come forward and speak out. \"As soon as we learned of these very serious allegations and charges, we immediately took action, providing ongoing support to her whilst liaising with Police Scotland throughout the investigation. \"We know nothing will change what has happened to the victim and all we can hope is this sentence provides some comfort to them.\""
    },
    {
        "title": "UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal",
        "description": "UK farmers have \"nothing more to give\" as they fear the government will use agriculture to further reduce US tariffs in a trade deal with the White House.",
        "url": "https://news.sky.com/story/uk-farmers-have-nothing-more-to-give-as-they-fear-govt-will-compromise-welfare-in-us-uk-trade-deal-13393675",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6956690.jpg?20250703224359",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-07 14:40:00",
        "Headline": "Donald Trump has given the UK a 9 July deadline to sort out a deal over steel tariffs, with farmers concerned lower US welfare standards will be allowed to reduce them.",
        "Content": "\n          Political reporter\n              @alixculbertson\n UK farmers have \"nothing more to give\" as they fear the government will use agriculture to further reduce US tariffs in a trade deal with the White House. The UK is trying to reduce steel tariffs to zero, from a current reduced rate of 25%, but Downing Street refused to confirm if it was confident ahead of Donald Trump's deadline of 9 July. Tom Bradshaw, president of the National Farmers' Union (NFU), said UK agriculture had already been used to reduce Trump-imposed tariffs on cars but any other concessions would have serious repercussions for farmers, food security and the UK's high animal welfare standards. Politics latest: Downing Street refuses to rule out wealth tax He told Sky News: \"It just feels like we, as the agricultural sector, had to shoulder the responsibility to reduce the tariffs on cars from 25%. \"We can't do it anymore, we have nothing more to give. \"It's clear the steel quotas and tariffs aren't sorted yet, so we just want to be very clear with the government: if they're sitting around the negotiating table - which we understand they are - they can't expect agriculture to give any more.\" \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 \n                  Tesla shares sink as Musk launches political party\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 'Massively undermine our standards' Since 30 June, the US has been able to import 13,000 tonnes of hormone-free British beef without tariffs under a deal made earlier this year, which farmers feel was to reduce the car import levy Mr Trump imposed. The UK was also given tariff-free access to 1.4bn litres of US ethanol, which farmers say will put the UK's bioethanol and associated sectors under pressure. Allowing lower US food standards would \"massively undermine our standards\" and would mean fewer sales to the European Union where food standards are also high, Mr Bradshaw said. It would leave British farmers competing on a playing field that is \"anything but fair\", he said, because US food can be produced - and sold - much cheaper due to low welfare which could see a big reduction in investment in UK farms, food security and the environment. Read more:Trump tariff deadline extended as new threats issued to BRICs nations  'The US will push hard for more access' He said the US narrative has always suggested they want access to British agriculture products \"as a start and they'll negotiate for more\". \"The narrative from the White House on 8 May, when a US-UK trade deal was announced, was all about further access to our agriculture products - it was very different to what our government was saying,\" he added. \"So far, the UK has stood firm and upheld our higher welfare standards, but the US will push very hard to have further access. \"No country in the world has proved they can reduce the 10% tariffs further.\" US 'will target poultry and pork' The Essex farmer said he expects the US to push \"very hard\" to get the UK to lower its standards on poultry and pork, specifically. US poultry is often washed with antimicrobials, including chlorine, in an attempt to wash off high levels of bacteria caused by poor hygiene, antibiotic use and low animal welfare conditions not allowed in UK farming. US pig rearing methods are also quite different, with intensive farming and the use of feed additive ractopamine legal, with both banned in the UK. A government spokesperson told Sky News: \"We regularly speak to businesses across the UK to understand the impact of tariffs and will only ever act in the national interest. \"Our Plan for Change has delivered a deal which will open up exclusive access for UK beef farmers to the US market for the first time ever and all agricultural imports coming to the UK will have to meet our high SPS (sanitary and phytosanitary) standards.\""
    },
    {
        "title": "Children with special needs will 'always' have 'legal right' to support, education secretary says",
        "description": "The education secretary has said children with special needs will \"always\" have a legal right to additional support as she sought to quell a looming row over potential cuts.",
        "url": "https://news.sky.com/story/children-with-special-needs-will-always-have-legal-right-to-support-education-secretary-says-13393728",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bridget-phillipson_6949324.jpg?20250624101138",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-07-07 16:12:00",
        "Headline": "Bridget Phillipson seeks to dampen a looming row over whether the government could scrap tailored plans for children with special needs - as some Labour MPs fear a repeat of the welfare row.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The education secretary has said children with special needs will \"always\" have a legal right to additional support as she sought to quell a looming row over potential cuts. The government is facing a potential repeat of the debacle over welfare reform due to suggestions it could scrap tailored plans for children and young people with special needs in the classroom. Politics latest: Minister says 'those with broadest shoulders should pay more tax' Speaking in the Commons on Monday, Bridget Phillipson failed to rule out abolishing education, health and care plans (EHCPs) - legally-binding plans to ensure children and young people receive bespoke support in either mainstream or specialist schools. Laura Trott, the shadow education secretary, said parents' anxiety was \"through the roof\" following reports over the weekend that EHCPs could be scrapped. She said parents \"need and deserve answers\" and asked: \"Can she confirm that no parent or child will have their right to support reduced, replaced or removed as a result of her planned changes?\"  Ms Phillipson said SEND provision was a \"serious and complex area\" and that the government's plans would be set out in a white paper that would be published later in the year. \n                  Exclusive: Watchdog upholds nearly 100% of complaints about special educational needs in England\n                 \n                  London Welsh language school secures funding - but long-term future still in doubt\n                 \n                  Teachers given new guidance in dealing with AI-generated child sexual abuse material\n                 \"I would say to all parents of children with SEND, there is no responsibility I take more seriously than our responsibility to some of the most vulnerable children in our country,\" she said. \"We will ensure, as a government, that children get better access to more support, strengthened support, with a much sharper focus on early intervention.\" ECHPs are drawn up by local councils and are available to children and young people aged up to 25 who need more support than is provided by the Special Educational Needs and Disabilities (SEND) budget. They identify educational, health and social needs and set out the additional support to meet those needs. In total, there were 638,745 EHCPs in place in January 2025 - up 10.8% on the same point last year. 'Rebel ready' One Labour MP said they were concerned the government risked making the \"same mistakes\" over ECHPs as it did with the row over welfare, when it was eventually forced into a humiliating climbdown in the face of opposition by Labour MPs. \"The political risk is much higher even than with welfare, and I'm worried it's being driven by a need to save money which it shouldn't be,\" they told Sky News. \"Some colleagues are rebel ready.\" The MP said the government should be \"charting a transition from where we are now to where we need to be\", adding: \"That may well be a future without ECHPs, because there is mainstream capacity - but that cannot be a removal of current provision.\" Later in the debate, Ms Phillipson said children with special educational needs and disabilities would \"always\" have a \"legal right\" to additional support as she accused a Conservative MP of attempting to \"scare\" parents. \"The guiding principle of any reform to the SEND system that we will set out will be about better support for children, strengthened support for children and improved support for children, both inside and outside of special schools,\" she said. Read more:Government to ban 'appalling' non-disclosure agreementsGovernment declines to rule out wealth tax \"Improved inclusivity in mainstream schools, more specialist provision in mainstream schools, and absolutely drawing on the expertise of the specialist sector in creating the places where we need them, there will always be a legal right … to the additional support… that children with SEND need.\" Her words were echoed by schools minister Catherine McKinnell, who also did not rule out changing ECHPs. She told the Politics Hub With Sophy Ridge that the government was \"focused on reforming the whole system\". \"Children and families have been left in a system where they've had to fight for their child's education, and that has to change,\" she said. She added that EHCPs have not necessarily \"fixed the situation\" for some children - but for others it's \"really important\"."
    },
    {
        "title": "Government to ban 'appalling' non-disclosure agreements that silence victims of abuse at work",
        "description": "Victims will no longer have to \"suffer in silence\", the government has said, as it pledges to ban non-disclosure agreements (NDAs) designed to silence staff who've suffered harassment or discrimination.",
        "url": "https://news.sky.com/story/government-to-ban-appalling-non-disclosure-agreements-that-silence-victims-of-abuse-at-work-13393781",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sexual-harassment_6959673.jpg?20250707193242",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-07 17:54:00",
        "Headline": "Non-disclosure agreements, such as those signed by victims of Harvey Weinstein, have been wrongly used to silence victims of harassment and discrimination. The government is proposing they should be voided and banned.",
        "Content": "Victims will no longer have to \"suffer in silence\", the government has said, as it pledges to ban non-disclosure agreements (NDAs) designed to silence staff who've suffered harassment or discrimination. Accusers of Harvey Weinstein, the former film producer and convicted sex offender, are among many in recent years who had to breach such agreements in order to speak out. Labour has suggested an extra section in the Employment Rights Bill that would void NDAs that are intended to stop employees going public about harassment or discrimination. The government said this would allow victims to come forward about their situation rather than remain \"stuck in unwanted situations, through fear or desperation\". Zelda Perkins, Weinstein's former assistant and founder of Can't Buy My Silence UK, said the changes would mark a \"huge milestone\" in combatting the \"abuse of power\". She added: \"This victory belongs to the people who broke their NDAs, who risked everything to speak the truth when they were told they couldn't. Without their courage, none of this would be happening.\" Deputy prime minister Angela Rayner said the government had \"heard the calls from victims of harassment and discrimination\" and was taking action to prevent people from having to \"suffer in silence\". \n                  'A threat to national security': Fears drones could be used to lift inmates out of prisons\n                 \n                  Post Office scandal: Daughter has had 'panic attacks' since mum was accused of stealing\n                 \n                  Every mobile phone to receive emergency alert: When it will happen - and what it will say\n                  An NDA is a broad term that describes any agreement that restricts what a signatory can say about something and was originally intended to protect commercially sensitive information. Currently, a business can take an employee to court and seek compensation if they think a NDA has been broken. \"Many high profile cases\" have revealed NDAs are being manipulated to prevent people \"speaking out about horrific experiences in the workplace\", the government said. Announcing the amendments, employment minister Justin Madders said: \"The misuse of NDAs to silence victims of harassment or discrimination is an appalling practice that this government has been determined to end.\" The bill is currently in the House of Lords, where it will be debated on 14 July, before going on to be discussed by MPs as well."
    },
    {
        "title": "Building societies step up protest against Reeves's cash ISA reforms",
        "description": "Building society chiefs will this week intensify their protests against the chancellor's plans to cut cash ISA limits by warning that it will push up borrowing costs for homeowners and businesses.",
        "url": "https://news.sky.com/story/building-societies-step-up-protest-against-reevess-cash-isa-reforms-13393599",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-doorstep_6956222.jpg?20250707125812",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-07 11:19:00",
        "Headline": "A draft letter from the Building Societies Association, seen by Sky News, warns the chancellor that slashing the cash ISA limit risks pushing up borrowing costs for homeowners and businesses.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Building society chiefs will this week intensify their protests against the chancellor's plans to cut cash ISA limits by warning that it will push up borrowing costs for homeowners and businesses. Sky News has obtained the draft of a letter being circulated by the Building Societies Association (BSA) among its members which will demand that Rachel Reeves abandons a proposed move to slash savers' annual cash ISA allowance from the existing £20,000 threshold. Money blog: 'I get paid to taste biscuits' The draft letter, which is expected to be published this week, warns the chancellor that her decision would deter savers, disrupt Labour's housebuilding ambitions and potentially present an obstacle to economic growth by triggering higher funding costs. \"Cash ISAs are a cornerstone of personal savings for millions across the UK, helping people from all walks of life to build financial resilience and achieve their savings goals,\" the draft letter said. \"Beyond their personal benefits, Cash ISAs play a vital role in the broader economy. \"The funds deposited in these accounts support lending, helping to keep mortgages and loans affordable and accessible. \n                  Reeves's tax turmoil deepens\n                 \n                  Rachel Reeves hints at tax rises in autumn budget after welfare bill U-turn\n                 \n                  Did Keir Starmer screw up his own anniversary?\n                 \"Cutting Cash ISA limits would make this funding more scarce which would have the knock-on effect of making loans to households and businesses more expensive and harder to come by. \"This would undermine efforts to stimulate economic growth, including the government's commitment to delivering 1.5 million new homes. \"Cutting the Cash ISA limit would send a discouraging message to savers, who are sensibly trying to plan for the future and undermine a product that has stood the test of time.\" The chancellor is reportedly preparing to announce a review of cash ISA limits as part of her Mansion House speech next week. While individual building society bosses have come out publicly to express their opposition to the move, the BSA letter is likely to be viewed with concern by Treasury officials. The Nationwide is by far Britain's biggest building society, with the likes of the Coventry, Yorkshire and Skipton also ranking among the sector's largest players. Read more from Sky News:Trump tariff deadline extended as new threats issuedWhat happens to your pension when you die? In the draft letter, which is likely to be signed by dozens of building society bosses, the BSA said the chancellor's proposals \"would make the whole ISA regime more complex and make it harder for people to transfer money between cash and investments\". \"Restricting Cash ISAs won't encourage people to invest, as it won't suddenly change their appetite to take on risk,\" it said. \"We know that barriers to investing are primarily behavioural, therefore building confidence and awareness are far more important.\" The BSA called on Ms Reeves to back \"a long-term consumer awareness and information campaign to educate people about the benefits of investing, alongside maintaining strong support for saving\". \"We therefore urge you to affirm your support for Cash ISAs by maintaining the current £20,000 limit. \"Preserving this threshold will enable households to continue building financial security while supporting broader economic stability and growth.\" The BSA declined to comment on Monday on the leaked letter, although one source said the final version was subject to revision. The Treasury has so far refused to comment on its plans."
    },
    {
        "title": "British teenager released from Dubai jail after royal pardon",
        "description": "A British teenager sentenced to one year in a&#160;Dubai&#160;jail for having a sexual relationship with a 17-year-old girl has been released after receiving a royal pardon, a campaign group has said.",
        "url": "https://news.sky.com/story/british-teenager-released-from-dubai-jail-after-royal-pardon-13393481",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-marcus-fakana-sky-dubai_6773113.png?20241211112448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-07 07:53:00",
        "Headline": "Marcus Fakana, from north London, was arrested in Dubai last year - but campaigners say his case has continued to raise concerns about the \"criminalisation\" of tourists and \"disproportionate sentencing\".",
        "Content": "A British teenager sentenced to one year in a Dubai jail for having a sexual relationship with a 17-year-old girl has been released after receiving a royal pardon, a campaign group has said. Marcus Fakana, 18, of Tottenham, north London, received the pardon from Dubai ruler Sheikh Mohammed bin Rashid al Maktoum and is safely in the UK, Detained In Dubai said. The group's chief executive Radha Stirling said Mr Fakana \"is currently recovering\". She added: \"His case has attracted significant public attention due to concerns about the criminalisation of tourists and disproportionate sentencing. \"We believe this case highlights the urgent need for expedited legal processes for foreign nationals and safeguards against unnecessary custodial sentences.\" Mr Fakana was with his parents in the United Arab Emirates when a \"holiday romance blossomed\" with another Londoner, who has since turned 18, the campaign group previously said. Read more from Sky News:Israeli soldier describes arbitrary killing of civilians in GazaAt least 82 dead in Texas floods as search continues He was arrested at his hotel last year after the girl's mother reported the relationship to Dubai police after she allegedly found their pictures and chats. In Dubai, the age of consent is 18."
    },
    {
        "title": "Israeli soldiers 'psychologically broken' after 'confronting the reality' in Gaza, UN expert says",
        "description": "A UN expert has said some young soldiers in the Israeli Defence Forces are being left \"psychologically broken\" after \"confront[ing] the reality among the rubble\" when serving in Gaza.  ",
        "url": "https://news.sky.com/story/israeli-soldiers-psychologically-broken-after-confronting-the-reality-in-gaza-un-expert-says-13393840",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-israel-gaza_6959756.jpg?20250707225133",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-07 21:43:00",
        "Headline": "Francesca Albanese told The World with Yalda Hakim that \"many\" of the young people fighting in Gaza are \"haunted by what they have seen, what they have done\".",
        "Content": " A UN expert has said some young soldiers in the Israeli Defence Forces are being left \"psychologically broken\" after \"confront[ing] the reality among the rubble\" when serving in Gaza.   Francesca Albanese, the UN Human Rights Council's special rapporteur on the occupied Palestinian territories, was responding to a Sky News interview with an Israeli solider who described arbitrary killing of civilians in Gaza. She told The World with Yalda Hakim that \"many\" of the young people fighting in Gaza are \"haunted by what they have seen, what they have done\". \"It doesn't make sense,\" Ms Albanese said. \"This is not a war, this is an assault against civilians and this is producing a fracture in many of them. \"As that soldier's testimony reveals, especially the youngest among the soldiers have been convinced this is a form of patriotism, of defending Israel and Israeli society against this opaque but very hard felt enemy, which is Hamas. \"But the thing is that they've come to confront the reality among the rubble of Gaza.\" Being in Gaza is \"probably this is the first time the Israeli soldiers are awakening to this,\" she added. \"And they don't make sense of this because their attachment to being part of the IDF, which is embedded in their national ideology, is too strong. \n                  Israeli soldier describes arbitrary killing of civilians in Gaza\n                 \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Hamas gives 'positive' response to ceasefire proposal but asks for amendments\n                 \"This is why they are psychologically broken.\" Jonathan Conricus, a former IDF spokesman who is now a senior fellow at the Foundation for Defence of Democracies, said he believes the Sky News interview with the former IDF solider \"reflects one part of how ugly, difficult and horrible fighting in a densely populated, urban terrain is\". \"I think [the ex-soldier] is reflecting on how difficult it is to fight in such an area and what the challenges are on the battlefield,\" he said.  'An economy of genocide'  Ms Albanese, one of dozens of independent UN-mandated experts, also said her most recent report for the human rights council has identified \"an economy of genocide\" in Israel. The system, she told Hakim, is made up of more than 60 private sector companies \"that have become enmeshed in the economy of occupation […] that have Israel displace the Palestinians and replace them with settlers, settlements and infrastructure Israel runs.\" Israel has rejected allegations of genocide in Gaza, citing its right to defend itself after Hamas's attack on 7 October 2023.  The companies named in Ms Albanese's report are in, but not limited to, the financial sector, big tech and the military industry. \"These companies can be held responsible for being directed linked to, or contributing, or causing human rights impacts,\" she said. \"We're not talking of human rights violations, we are talking of crimes.\" \"Some of the companies have engaged in good faith, others have not,\" Ms Albanese said. Read more:Israeli soldier describes arbitrary killing of civilians in GazaBritish surgeons on life in Gaza The companies she has named include American technology giant Palantir, which has issued a statement to Sky News. It said it is \"not true\" that Palantir \"is the (or a) developer of the 'Gospel' - the AI-assisted targeting software allegedly used by the IDF in Gaza, and that we are involved with the 'Lavender' database used by the IDF for targeting cross-referencing\". \"Both capabilities are independent of and pre-ate Palantir's announced partnership with the Israeli Defence Ministry,\" the statement added."
    },
    {
        "title": "Russia's former transport minister Roman Starovoit found dead 'with gunshot wound'",
        "description": "A former Russian transport minister has been found dead with a gunshot wound in his car just hours after it was revealed he had been sacked from his role.",
        "url": "https://news.sky.com/story/russias-former-transport-minister-roman-starovoit-found-dead-with-gunshot-wound-13393651",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-roman-starovoit-vladimir-putin_6959423.jpg?20250707143639",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-07 13:30:00",
        "Headline": "Russia's Investigative Committee, the top criminal investigation agency, said Mr Starovoit's body was discovered in his vehicle parked in Odintsovo, a neighbourhood west of Moscow where members of the country's elite live.",
        "Content": "A former Russian transport minister has been found dead with a gunshot wound in his car just hours after it was revealed he had been sacked from his role. Roman Starovoit, the ex-governor of the Kursk region, is reported to have taken his own life. The 53-year-old's death comes after he was dismissed from his transport position by President Vladimir Putin. In a statement, Russia's Investigative Committee, the top criminal investigation agency, said Mr Starovoit's body was discovered in his vehicle parked in Odintsovo, a neighbourhood west of Moscow where members of the country's elite live. The circumstances surrounding Mr Starovoit's death are being investigated, with the statement adding: \"The main version is suicide.\" A gun previously presented to him as an official gift was reportedly found next to his body. Earlier on Monday, it was revealed Mr Putin had sacked Mr Starovoit after just over a year in the job. \n                  The Russian deserters escaping from Putin's army\n                 \n                  The Russian deserters escaping from Putin's army\n                 \n                  Vladimir Putin tells Donald Trump he will not back down from goals in Ukraine, Kremlin says\n                 Mr Starovoit was appointed transport minister in May 2024 after spending almost five years as governor of the Kursk region bordering Ukraine. His dismissal by Mr Putin could be linked to an investigation into the embezzlement of state funds allocated for building fortifications in the region, according to reports in the Russian media. A few months after he left his role as governor, Ukrainian troops crossed over the border into Kursk as Kyiv launched the biggest foreign incursion into Russian territory since the Second World War. The alleged embezzlement has been cited as one of the reasons for deficiencies in Russia's defensive lines that failed to stem the August 2024 incursion. Ukrainian forces were pushed out of Kursk earlier this year. In April, Mr Starovoit's successor as governor, Alexei Smirnov, was charged with embezzling money earmarked for defence purposes.  Read more from Sky News:The ordeal of Russian soldiers forced to flee Putin's armyPutin tells Trump he will not back down from goals in Ukraine Andrei Nikitin, a former governor of the Novgorod region, has been appointed acting transport minister. When earlier asked about Mr Starovoit's sudden departure, Kremlin spokesman Dmitry Peskov said: \"At present, in the president's opinion, Andrei Nikitin's professional qualities and experience will best contribute to ensuring that this agency, which the president described as extremely important, fulfils its tasks and functions.\""
    },
    {
        "title": "Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs",
        "description": "Donald Trump has revealed hefty trade tariffs against at least seven countries, to be applied from 1 August.",
        "url": "https://news.sky.com/story/trade-war-trump-reveals-first-two-nations-to-pay-delayed-liberation-day-tariffs-13393738",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6947106.jpg?20250620213313",
        "type": "World",
        "Author": "James Sillars",
        "Date Published": "2025-07-07 16:29:00",
        "Headline": "Countries are set to be informed of tariff rates by letter in the coming days as the president seeks to bolster US-based manufacturing and jobs through his on-off trade war regime.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed hefty trade tariffs against at least seven countries, to be applied from 1 August. The initial announcement, via his Truth Social platform, concerned Japan and South Korea. Both would face 25% rates on all goods, he said. Malaysia and Kazakhstan were later added to the list, while South Africa was told it faced a 30% rate. Laos and Myanmar were hit with 40% duties. It marks the restart of the threatened \"liberation day\" escalation that was paused in April, for 90 days, to allow for negotiations to take place with all US trading partners. The US president is sending each nation a letter to inform them of the tariff rates they face and warn against retaliatory tariffs. \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Tesla shares sink as Musk launches political party\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 Those duties will come on top of sector-specific tariffs - such as 50% rates covering steel - which are already in force. Money latest: Retailers release images of 'prolific shoplifters' Mr Trump says in the letters that rates can be adjusted \"upward or downward, depending on our relationship with your country\". Country-specific tariffs had been due to take effect from Wednesday this week but Mr Trump had earlier revealed that nations would start to get letters instead, setting out the US position. Duties would take effect from 1 August, without any subsequent deal being agreed, it was announced. The letters sent to Japan and South Korea cited persistent trade imbalances for the rates and included the sentence: \"We invite you to participate in the extraordinary Economy of the United States, the Number One Market in the World, by far.\" He ended both letters by saying, \"Thank you for your attention to this matter!\" The European Union - the biggest single US trading partner - is among those set to get a letter in the coming days. Mr Trump has also threatened an additional 10% tariff on any country aligning itself with the \"anti-American policies\" of BRICS nations - those are Brazil, Russia, India, China and South Africa and whose members also include Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates. The UK, bar a massive shock U-turn, should be exempt.  The country was the first to be granted a trade deal, of sorts, in May and the Trump administration has claimed many others had been offering concessions since the clock ticked down to 9 July. The UK is not expected to face any changes to its current 10% rate due to the trade truce, which came into effect last week. While UK-made cars aerospace products face no duties under a new quota arrangement, it still remains to be seen whether 25% tariffs on UK-produced steel and aluminium will be cancelled.  They could, conceivably, even be raised to 50%, as is currently the case for America's other trading partners, because no agreement on eliminating the rate was reached when the government struck its deal in May. It all amounts to more uncertainty for the UK steel sector. A No 10 spokesman said on Monday: \"Our work with the US continues to get this deal implemented as soon as possible. \"That will remove the 25% tariff on UK steel and aluminium, making us the only country in the world to have tariffs removed on these products. \"The US agreed to remove tariffs on these products as part of our agreement on 8 May. It reiterated that again at the G7 last month. The discussions continue, and will continue to do so.\" China and Vietnam have also secured some US concessions. The dollar strengthened but US stock markets lost ground in the wake of the letters to Japan and South Korea being made public, with the broad-based S&P 500 down by 1%. Stock markets in both Japan and South Korea were closed for the day but US-traded shares of SK Telecom and LG Display were down 7.5% and 5.8% respectively."
    },
    {
        "title": "Eleven killed in Kenya as protesters clash with police ",
        "description": "Eleven people have been killed in Kenya after clashing with police at the latest anti-government protests, the East African nation's police said.",
        "url": "https://news.sky.com/story/ten-killed-in-kenya-as-protesters-clash-with-police-13393764",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kenya-nairobi-protest_6959633.jpg?20250707183735",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-07 17:27:00",
        "Headline": "Officers fired and hurled tear gas canisters, injuring demonstrators. One young man being carried away, with his shirt drenched in blood, said he had been shot.",
        "Content": "Eleven people have been killed in Kenya after clashing with police at the latest anti-government protests, the East African nation's police said. A further 29 people were injured, the state-funded Kenya National Commission said. Some Kenyans have for weeks been protesting police brutality, poor governance and the high cost of living, while demanding President William Ruto's resignation. Authorities today blocked major roads leading to the capital, Nairobi, in the strictest measures yet to contain the unrest, which saw protesters light bonfires and throw stones at police. Dozens of officers were injured, Kenyan police said. Officers fired and hurled tear gas canisters, injuring demonstrators. One young man being carried away, with his shirt drenched in blood, said he had been shot. A reporter for Reuters news agency said they saw one man lying motionless on the road with a bleeding wound after police fired at advancing protesters in the Nairobi suburb of Kangemi. As well as blocking vehicles from accessing Nairobi's city centre, police also stopped most pedestrians unless they were deemed to have essential duties. \n                  Israeli PM nominates Donald Trump for Nobel Peace Prize - as Gaza ceasefire talks continue \n                 \n                  Israeli soldiers 'psychologically broken' after 'confronting the reality' in Gaza, UN expert says\n                 \n                  The 'Alligator Alcatraz' detention centre was built in eight days - but problems are emerging\n                 Protests were recorded across 17 of Kenya's 47 counties, the Kenya National Commission said. In Kenya, 7 July is known as Saba Saba, which is Swahili for Seven Seven. It's a significant date in Kenya's history and marks the anniversary of the first major protests 35 years ago. Those demonstrations called on then-President Daniel arap Moi - Mr Ruto's mentor - for a transition from a one-party state to a multiparty democracy. This change was realised in the 1992 elections. A professor of history and international relations at United States International University Africa in Nairobi said there is \"no reversing the Gen Z Saba Saba-like spirit\". Macharia Munene said: \"Attempt to criminalise protests is reactive and will not work. \"It instead makes the government appear retrogressive and desperate enough to subvert the constitution.\" Kenya's interior minister Kipchumba Murkomen said on Sunday that the government would not tolerate violent protests and police would be deployed to ensure public safety. Last month, he told police to \"shoot on sight\" anyone who approaches police stations during protests, after several were burned. Kenya's latest wave of demonstrations was sparked by calls for police accountability after the death of a blogger in police custody last month. A police officer then shot a civilian at close range during a protest on 17 June, further angering the public. On 25 June, at least 19 people were killed during demonstrations against police brutality that were held to mark the one-year anniversary of anti-tax protests. The 2024 protests culminated in parliament being stormed and more than 60 people being killed."
    },
    {
        "title": "International experts join mass grave excavation at former mother and baby home in Ireland",
        "description": "International experts have joined Irish specialists at a mass grave where almost 800 babies and young children are thought to be buried.",
        "url": "https://news.sky.com/story/international-experts-join-mass-grave-excavation-at-former-mother-and-baby-home-in-ireland-13393598",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-galway-tuam-memorial_6943477.jpg?20250616115312",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-07 11:17:00",
        "Headline": "It is hoped that excavation work will lead to the identification of the remains of 796 children who are believed to have died at St Mary's home between 1925 and 1961.",
        "Content": " International experts have joined Irish specialists at a mass grave where almost 800 babies and young children are thought to be buried. A team from Colombia, Spain, the UK, Canada and the US has linked up with staff from the Office of the Director of Authorised Intervention (ODAIT) before excavation work begins at the site of a former home for unmarried mothers in Tuam, Co Galway, Ireland. It is hoped the process will lead to the identification of the remains of 796 children who are believed to have died at St Mary's home between 1925 and 1961. The work follows research by local historian Catherine Corless which uncovered the deaths of the children at the home, which was run by Catholic nuns. Ms Corless found in 2014 that the youngsters were buried in a sewage system. Mother and baby homes were institutions where young pregnant women were sent, often under pressure from local clergy. There, they would give birth and eventually be separated from their children, who were offered up for adoption, sometimes in the US. Irish society in the mid-20th century was deeply intertwined with the teachings of the Catholic Church, and pregnancies out of wedlock were seen as scandalous.  The Irish government made a formal state apology in 2021 after an inquiry found an \"appalling level of infant mortality\" in Ireland's mother and baby homes, concluding that around 9,000 children had died in the 18 institutions investigated. Read more: 9,000 children died at 'brutally misogynistic' homes in IrelandArchbishop 'embarrassed' over role of church in mother and baby homes scandal The Bon Secours Sisters, which ran the home in Tuam, also offered a \"profound apology\" after acknowledging the order had \"failed to protect the inherent dignity\" of women and children there. The work at the burial site, which is being undertaken by the ODAIT, will involve exhumation, analysis, identification if possible, and re-interment of the remains at the site. The excavation is expected to begin next week and is anticipated to last two years. Ireland correspondent You couldn't get a starker juxtaposition; Ireland's first mass grave excavation site used to be a children's playground.  Generations of Tuam's kids played on swings and slides, oblivious to the skeletal remains of other children just underneath their feet.  The difference between them? A brutal, inhuman attitude to unmarried mothers in mid-century Ireland. Turfed out of family homes, young vulnerable women were sent to homes like the one in Tuam to give birth in deep shame. Conditions were awful. Children died at the rate of one a fortnight, year after year. There are 9,000 dead infants that we know about, at homes around the country.  At Tuam, hundreds of dead children were dumped into a disused sewage system. Dehumanised and left to rot by servants of Christ.  Today a press pack thronged the playground site, now fenced off.  Journalists from the US and Germany joined their Irish colleagues in trying to imagine the horrors that lie under the grass and concrete.  The Irish authorities describe this dig as \"unprecedented\" and \"complex\". Experts have been called in from around the world, including some from Durham University who pioneered a technique using teeth enamel to identify sexes.  Performed to a high forensic standard, in case of criminal proceedings, the excavation could last for two years – piecing together tiny fragments of bones in a heart-rending effort to give some dignity to innocent children regarded as nothing more than an embarrassment to polite society.  ODAIT leader Daniel McSweeney said on Monday: \"We have reached an important new stage of this unique and incredibly complex excavation. \"It's three weeks since we took control of the site and significant progress has been made since then. \"We have recruited essential expert staff to the team, preparation work at the site is ongoing to safeguard the integrity of the site and the sensitive nature of the work.\""
    },
    {
        "title": "What happened at the Tuam mother and baby home - and why is the site now only being excavated?",
        "description": "A long-awaited excavation&#160;at a former mother and baby home in Ireland hopes to identify the remains of infants who died there.",
        "url": "https://news.sky.com/story/what-happened-at-the-tuam-mother-and-baby-home-and-why-is-the-site-now-only-being-excavated-13393566",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tuam-galway-institution_6943454.jpg?20250616114438",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-07 10:32:00",
        "Headline": "An estimated 796 babies and children are believed to have been buried at the site of the St Mary's home in Tuam, County Galway, between 1925 and 1961. Exhumation of the bodies has finally begun.",
        "Content": "A long-awaited excavation at a former mother and baby home in Ireland hopes to identify the remains of infants who died there. An estimated 796 babies and children are thought to have been buried in a former sewage tank at the St Mary's home in Tuam, County Galway, between 1925 and its closure in 1961. The home was one of a number of Catholic-run institutions around Ireland that housed roughly 35,000 single women over several decades who were dealing with the \"shame\" of having a baby out of wedlock. Here is everything you need to know about the excavation and how it got to this stage. How did we get here? Irish society in the mid-20th century was deeply intertwined with the teachings of the Catholic Church, and pregnancies out of wedlock were seen as scandalous. Mother and baby homes were institutions where young pregnant women were sent, often under pressure from local clergy. At the homes they would give birth and eventually be separated from their children, who were offered up for adoption, sometimes in the US. They differed from Magdalene Laundries, where single mothers and teenage girls were placed to work. Women in the laundries faced gruelling work conditions and abuse at the hands of the religious congregations that ran them. In 2015 the Irish government launched the Commission of Investigation into Mother and Baby Homes, aiming to provide a full account of what happened to vulnerable women and children in the homes from 1922 to 1998. What followed was a five-year investigation by a judicial commission that found a total of 9,000 babies died across 18 mother and baby homes. The investigation was prompted after local historian Catherine Corless discovered the existence of a mass children's grave at the site of St Mary's home in Tuam, which, a decade later, is finally being excavated. What happened in Tuam? The St Mary's home in Tuam was run by the Bon Secours Sisters, a religious order of Catholic nuns. Death records for the St Mary's home list children as dying from malnutrition, as well as diseases such as measles and tuberculosis - which were rife at the time. The home closed in 1961, and was later demolished. In 1975 two 12-year-old boys discovered the septic tank, which was full of human bones. At the time, locals believed the remains were from the Irish famine of the 1840s. It was historian Ms Corless who made the grim discovery that nearly 800 children were put into the mass grave after scouring through death records. The claim was first published in 2014 and was found to be accurate in 2017 when the site was excavated for the first time. Speaking to Sky News' Ireland correspondent Stephen Murphy in June, Ms Corless said a baby would die at St Mary's home, on average, every fortnight. She said once they had died, they would be placed in one of multiple chambers that were built inside the underground septic tank. \"The chambers were built inside the tank, they are little openings in concrete and go down 9ft. The babies had to be placed one on top of the other, there is no way to actually get down into the chambers,\" Ms Corless said. Why is the area only being excavated now? In the aftermath of the government investigation into mother and baby homes and the discovery in Tuam, the Irish government announced in 2018 that the bodies of the 796 infants would be excavated. At the time, Irish premier Leo Varadkar said the government had to pass legislation to give it the power to do the excavations. He said the excavations were expected to be carried out in the second half of 2019. In 2019, a bill was drafted that would allow for the excavation and exhumation of the site, but the COVID-19 pandemic meant its consideration was delayed. It wasn't until 2022 when the Institutional Burials Act was passed, which aimed to restore dignity in death and, where possible, identify those buried at the site of St Mary's. The following year, the Office of the Director of Authorised Intervention (ODAIT), the agency that would oversee the excavation, was set up with Daniel MacSweeny appointed as its lead. On 16 June 2025, pre-excavation work got underway at Tuam. This included securing the site with a 2.4 metre-high perimeter.  What will the excavation involve? Excavation will finally start next week and is expected to last for two years. Experts from the ODIAT will be joined by personnel from Colombia, Spain, the UK, Canada and the US for the process. The excavation is set to involve the exhumation, analysis, identification if possible, and re-interment - the burying of human remains in a new location after being exhumed - of the remains. Mr MacSweeney said the Bon Secours Sisters had provided ODAIT with access to its archive material and it is hoped that this will also help the identification process. The team will also attempt to establish cause of death where possible. The site is secured by a 2.4 metre-high perimeter and will be monitored 24 hours a day. Ireland correspondent Stephen Murphy said the excavation will be a \"painstaking forensic process\" but will aim to give many relatives long-awaited closure. He says: \"This dig may offer physical remains for reburial to many of those families. But a more fundamental question will most likely never be answered: how could a Christian institution treat women at their most vulnerable with such cold inhumanity, and simply dump their dead children into a pit in the dank earth?\""
    },
    {
        "title": "Texas floods: At least 104 killed - as new images show scale of the destruction",
        "description": "At least 104 people have died in the flash floods that have left a trail of destruction across Texas.",
        "url": "https://news.sky.com/story/seven-more-deaths-confirmed-in-texas-floods-bringing-total-to-at-least-89-13393687",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-guadalupe-river-texas_6958436.jpg?20250706111155",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-07 14:54:00",
        "Headline": "Kerr County Sheriff's Office said the number of bodies found in the area had risen from 75 to 84 - with 56 adults and 28 children.",
        "Content": " At least 104 people have died in the flash floods that have left a trail of destruction across Texas. Kerr County Sheriff's Office said the number of bodies found in the area had risen from 75 to 84 - including 56 adults and 28 children. The have been seven fatalities in Travis County, six in Kendall County, four in Burnet County, two in Williamson County and one in Tom Green County. Earlier, White House press secretary Karoline Leavitt warned that \"the situation on the ground remains dangerous\" and that there \"could be additional public safety threats with additional incoming heavy rain\". Latest updates - Texas floods The floods that first struck on Friday have wreaked havoc and left people in a state of grief - with 27 of the confirmed deaths having taken place at a girls' summer camp in Kerr County. Among those killed at Camp Mystic were Renee Smajstrla and Sarah Marsh, both eight, Eloise Peck and Lila Bonner, both nine, and the camp's director Richard Eastland. \n                  The 'Alligator Alcatraz' detention centre was built in eight days - but problems are emerging\n                 \n                  Israeli PM nominates Donald Trump for Nobel Peace Prize - as Gaza ceasefire talks continue \n                 \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 A photo has now emerged showing the inside of the camp on Saturday after the waters hit. At least 41 people are still missing in the state - including 10 girls from Camp Mystic. In her news conference, Ms Leavitt criticised people who have claimed the Trump administration's cuts to the National Weather Service (NWS) have played a role in the worsening the disaster. It comes after Texas officials criticised the NWS by claiming it failed to warn the public about the impending danger. Meanwhile, Senate Democratic Leader Chuck Schumer asked the Department of Commerce's acting inspector general on Monday to probe whether staffing vacancies at the NWS's San Antonio office contributed to \"delays, gaps, or diminished accuracy\" in forecasting the flooding. The NWS did not immediately respond to a request for comment on Mr Schumer's letter, but earlier defended its forecasting and emergency management. Ms Leavitt has told reporters that claims Mr Trump was responsible for any issues related to the flash floods response were \"depraved and despicable\". \"It is not [a political game], it is a national tragedy,\" she said. The press secretary also claimed, in relation to some NWS offices being reportedly understaffed, that one place actually had \"too many people\". \"Any person who has deliberately lied about the facts around the catastrophic event, you should be deeply ashamed,\" she said. She also said that Mr Trump was going to visit Texas \"later in the week\". Previously, Mr Trump said it was likely he would visit on Friday. Texas Senator Ted Cruz spoke at a news conference and said: \"Texas is grieving right now, the pain, the shock of what has transpired these last few days has broken the heart of our state. \"Those numbers [the number of dead] are continuing to go up... that's every parent's nightmare, every mum and dad.\" He said he had picked up his own daughter from a camp in the area last week. Mr Cruz added: \"You know what I'd do? What I did when this happened? Just go hug your kids. \"Because I've got to tell you, I hugged my girls with tears in my eyes.\"  Dalton Rice, the city manager of Kerrville in Kerr County, was asked whether evacuation warnings could have been issued earlier. He said: \"It's very tough to make those calls because we also don't want to cry wolf. \"You know, we want to make sure that we activated [it] at the right time.\" He added: \"We had first responders getting swept away, responding to the first areas of rainfall. That's how quick it happened. \"They were driving to these areas and one of them got swept off the road.\""
    },
    {
        "title": "Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs",
        "description": "Donald Trump has revealed hefty trade tariffs against at least seven countries, to be applied from 1 August.",
        "url": "https://news.sky.com/story/trade-war-trump-reveals-first-two-nations-to-pay-delayed-liberation-day-tariffs-13393738",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6947106.jpg?20250620213313",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-07-07 16:29:00",
        "Headline": "Countries are set to be informed of tariff rates by letter in the coming days as the president seeks to bolster US-based manufacturing and jobs through his on-off trade war regime.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed hefty trade tariffs against at least seven countries, to be applied from 1 August. The initial announcement, via his Truth Social platform, concerned Japan and South Korea. Both would face 25% rates on all goods, he said. Malaysia and Kazakhstan were later added to the list, while South Africa was told it faced a 30% rate. Laos and Myanmar were hit with 40% duties. It marks the restart of the threatened \"liberation day\" escalation that was paused in April, for 90 days, to allow for negotiations to take place with all US trading partners. The US president is sending each nation a letter to inform them of the tariff rates they face and warn against retaliatory tariffs. \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Tesla shares sink as Musk launches political party\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 Those duties will come on top of sector-specific tariffs - such as 50% rates covering steel - which are already in force. Money latest: Retailers release images of 'prolific shoplifters' Mr Trump says in the letters that rates can be adjusted \"upward or downward, depending on our relationship with your country\". Country-specific tariffs had been due to take effect from Wednesday this week but Mr Trump had earlier revealed that nations would start to get letters instead, setting out the US position. Duties would take effect from 1 August, without any subsequent deal being agreed, it was announced. The letters sent to Japan and South Korea cited persistent trade imbalances for the rates and included the sentence: \"We invite you to participate in the extraordinary Economy of the United States, the Number One Market in the World, by far.\" He ended both letters by saying, \"Thank you for your attention to this matter!\" The European Union - the biggest single US trading partner - is among those set to get a letter in the coming days. Mr Trump has also threatened an additional 10% tariff on any country aligning itself with the \"anti-American policies\" of BRICS nations - those are Brazil, Russia, India, China and South Africa and whose members also include Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates. The UK, bar a massive shock U-turn, should be exempt.  The country was the first to be granted a trade deal, of sorts, in May and the Trump administration has claimed many others had been offering concessions since the clock ticked down to 9 July. The UK is not expected to face any changes to its current 10% rate due to the trade truce, which came into effect last week. While UK-made cars aerospace products face no duties under a new quota arrangement, it still remains to be seen whether 25% tariffs on UK-produced steel and aluminium will be cancelled.  They could, conceivably, even be raised to 50%, as is currently the case for America's other trading partners, because no agreement on eliminating the rate was reached when the government struck its deal in May. It all amounts to more uncertainty for the UK steel sector. A No 10 spokesman said on Monday: \"Our work with the US continues to get this deal implemented as soon as possible. \"That will remove the 25% tariff on UK steel and aluminium, making us the only country in the world to have tariffs removed on these products. \"The US agreed to remove tariffs on these products as part of our agreement on 8 May. It reiterated that again at the G7 last month. The discussions continue, and will continue to do so.\" China and Vietnam have also secured some US concessions. The dollar strengthened but US stock markets lost ground in the wake of the letters to Japan and South Korea being made public, with the broad-based S&P 500 down by 1%. Stock markets in both Japan and South Korea were closed for the day but US-traded shares of SK Telecom and LG Display were down 7.5% and 5.8% respectively."
    },
    {
        "title": "Tesla shares sink as Musk launches political party",
        "description": "Shares in Elon Musk's Tesla have reversed sharply over renewed concerns about his focus on the company's recovery as he plots against Donald Trump. ",
        "url": "https://news.sky.com/story/tesla-shares-sink-as-musk-launches-political-party-13393614",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk_6959398.jpg?20250707133742",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-07-07 11:48:00",
        "Headline": "Investors are said to be worried about two things as the fight between Elon Musk and Donald Trump ramps up over the president's spending plans.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shares in Elon Musk's Tesla have reversed sharply over renewed concerns about his focus on the company's recovery as he plots against Donald Trump.  Shares in the electric car firm plunged by more than 7% at the start of trading on Wall Street - taking about $71bn (£52bn) off its market value. The stock has often come under pressure since Musk started his association with the president, latterly helping bring down federal government costs through a new department known as DOGE (Department of Government Efficiency). Money latest: Call centre worker's tips for getting discounts But it is now suffering as their political relationship has soured. Musk has publicly opposed the so-called \"big, beautiful bill\" - Mr Trump's flagship tax cut and spending plans that received Congressional approval last week - since he left his DOGE role. Musk wrote in a post on his X platform on 30 June: \"It is obvious with the insane spending of this bill, which increases the debt ceiling by a record FIVE TRILLION DOLLARS that we live in a one-party country - the PORKY PIG PARTY!!\" \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 Once the bill was passed, he created a poll on X, asking people if they would want him to launch the America Party.  He wrote on 4 July: \"Independence Day is the perfect time to ask if you want independence from the two-party (some would say uniparty) system!\" The vote ended with 65.4% in favour of creating the party. The formation of the America Party was announced the following day. \"By a factor of 2 to 1, you want a new political party and you shall have it! When it comes to bankrupting our country withwaste & graft, we live in a one-party system, not a democracy.\" \"Today, the America Party is formed to give you back your freedom,\" Musk posted. Trump responded on his Truth Social account: \"I am saddened to watch Elon Musk go completely 'off the rails,' essentially becoming a TRAIN WRECK over the past five weeks. \"He even wants to start a Third Political Party, despite the fact that they have never succeeded in the United States -The System seems not designed for them.\"  Trump has previously threatened to go after Tesla's government subsidies and contracts through the DOGE department to save \"big\" as their relationship deteriorated. Such threats have also pressured the share price at Tesla. It has suffered throughout Trump 2.0 and, in fact, has trended lower since last December - shortly after Mr Trump's election win was confirmed. Read more: The Trump-Musk bust-up that everyone knew was comingMusk hits out at Tesla succession claim The possibility of tariff hits to the business, followed by actual tariff disruption, along with a consumer and investor backlash against Musk's previous DOGE role have contributed to a 35% decline on the December peak. The very absence of Tesla's CEO dragged on the shares. Tesla sales suffered globally as the trade war ramped up due to the imposition of tariffs by a government he supported, until the public row between him and the president began in early June. Musk had only just renewed his 100% focus on Tesla and his other business interests by that time. Tesla sales were down during the presidential election campaign last year and continued to decline, on a quarterly basis, during the first half of 2025. Neil Wilson, UK investor strategist at Saxo Markets, said of the company's share price woes: \"Investors are worried about two things - one is more Trump ire affecting subsidies and the other more importantly is a distracted Musk. \"Investors had cheered Musk stepping back from frontline politics but are now worried he's going to sucked back in and take his eye off Tesla.\""
    },
    {
        "title": "Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs",
        "description": "Donald Trump has revealed hefty trade tariffs against at least seven countries, to be applied from 1 August.",
        "url": "https://news.sky.com/story/trade-war-trump-reveals-first-two-nations-to-pay-delayed-liberation-day-tariffs-13393738",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6947106.jpg?20250620213313",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-07 16:29:00",
        "Headline": "Countries are set to be informed of tariff rates by letter in the coming days as the president seeks to bolster US-based manufacturing and jobs through his on-off trade war regime.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed hefty trade tariffs against at least seven countries, to be applied from 1 August. The initial announcement, via his Truth Social platform, concerned Japan and South Korea. Both would face 25% rates on all goods, he said. Malaysia and Kazakhstan were later added to the list, while South Africa was told it faced a 30% rate. Laos and Myanmar were hit with 40% duties. It marks the restart of the threatened \"liberation day\" escalation that was paused in April, for 90 days, to allow for negotiations to take place with all US trading partners. The US president is sending each nation a letter to inform them of the tariff rates they face and warn against retaliatory tariffs. \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Tesla shares sink as Musk launches political party\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 Those duties will come on top of sector-specific tariffs - such as 50% rates covering steel - which are already in force. Money latest: Retailers release images of 'prolific shoplifters' Mr Trump says in the letters that rates can be adjusted \"upward or downward, depending on our relationship with your country\". Country-specific tariffs had been due to take effect from Wednesday this week but Mr Trump had earlier revealed that nations would start to get letters instead, setting out the US position. Duties would take effect from 1 August, without any subsequent deal being agreed, it was announced. The letters sent to Japan and South Korea cited persistent trade imbalances for the rates and included the sentence: \"We invite you to participate in the extraordinary Economy of the United States, the Number One Market in the World, by far.\" He ended both letters by saying, \"Thank you for your attention to this matter!\" The European Union - the biggest single US trading partner - is among those set to get a letter in the coming days. Mr Trump has also threatened an additional 10% tariff on any country aligning itself with the \"anti-American policies\" of BRICS nations - those are Brazil, Russia, India, China and South Africa and whose members also include Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates. The UK, bar a massive shock U-turn, should be exempt.  The country was the first to be granted a trade deal, of sorts, in May and the Trump administration has claimed many others had been offering concessions since the clock ticked down to 9 July. The UK is not expected to face any changes to its current 10% rate due to the trade truce, which came into effect last week. While UK-made cars aerospace products face no duties under a new quota arrangement, it still remains to be seen whether 25% tariffs on UK-produced steel and aluminium will be cancelled.  They could, conceivably, even be raised to 50%, as is currently the case for America's other trading partners, because no agreement on eliminating the rate was reached when the government struck its deal in May. It all amounts to more uncertainty for the UK steel sector. A No 10 spokesman said on Monday: \"Our work with the US continues to get this deal implemented as soon as possible. \"That will remove the 25% tariff on UK steel and aluminium, making us the only country in the world to have tariffs removed on these products. \"The US agreed to remove tariffs on these products as part of our agreement on 8 May. It reiterated that again at the G7 last month. The discussions continue, and will continue to do so.\" China and Vietnam have also secured some US concessions. The dollar strengthened but US stock markets lost ground in the wake of the letters to Japan and South Korea being made public, with the broad-based S&P 500 down by 1%. Stock markets in both Japan and South Korea were closed for the day but US-traded shares of SK Telecom and LG Display were down 7.5% and 5.8% respectively."
    },
    {
        "title": "Tesla shares sink as Musk launches political party",
        "description": "Shares in Elon Musk's Tesla have reversed sharply over renewed concerns about his focus on the company's recovery as he plots against Donald Trump. ",
        "url": "https://news.sky.com/story/tesla-shares-sink-as-musk-launches-political-party-13393614",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk_6959398.jpg?20250707133742",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-07 11:48:00",
        "Headline": "Investors are said to be worried about two things as the fight between Elon Musk and Donald Trump ramps up over the president's spending plans.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Shares in Elon Musk's Tesla have reversed sharply over renewed concerns about his focus on the company's recovery as he plots against Donald Trump.  Shares in the electric car firm plunged by more than 7% at the start of trading on Wall Street - taking about $71bn (£52bn) off its market value. The stock has often come under pressure since Musk started his association with the president, latterly helping bring down federal government costs through a new department known as DOGE (Department of Government Efficiency). Money latest: Call centre worker's tips for getting discounts But it is now suffering as their political relationship has soured. Musk has publicly opposed the so-called \"big, beautiful bill\" - Mr Trump's flagship tax cut and spending plans that received Congressional approval last week - since he left his DOGE role. Musk wrote in a post on his X platform on 30 June: \"It is obvious with the insane spending of this bill, which increases the debt ceiling by a record FIVE TRILLION DOLLARS that we live in a one-party country - the PORKY PIG PARTY!!\" \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 \n                  UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 Once the bill was passed, he created a poll on X, asking people if they would want him to launch the America Party.  He wrote on 4 July: \"Independence Day is the perfect time to ask if you want independence from the two-party (some would say uniparty) system!\" The vote ended with 65.4% in favour of creating the party. The formation of the America Party was announced the following day. \"By a factor of 2 to 1, you want a new political party and you shall have it! When it comes to bankrupting our country withwaste & graft, we live in a one-party system, not a democracy.\" \"Today, the America Party is formed to give you back your freedom,\" Musk posted. Trump responded on his Truth Social account: \"I am saddened to watch Elon Musk go completely 'off the rails,' essentially becoming a TRAIN WRECK over the past five weeks. \"He even wants to start a Third Political Party, despite the fact that they have never succeeded in the United States -The System seems not designed for them.\"  Trump has previously threatened to go after Tesla's government subsidies and contracts through the DOGE department to save \"big\" as their relationship deteriorated. Such threats have also pressured the share price at Tesla. It has suffered throughout Trump 2.0 and, in fact, has trended lower since last December - shortly after Mr Trump's election win was confirmed. Read more: The Trump-Musk bust-up that everyone knew was comingMusk hits out at Tesla succession claim The possibility of tariff hits to the business, followed by actual tariff disruption, along with a consumer and investor backlash against Musk's previous DOGE role have contributed to a 35% decline on the December peak. The very absence of Tesla's CEO dragged on the shares. Tesla sales suffered globally as the trade war ramped up due to the imposition of tariffs by a government he supported, until the public row between him and the president began in early June. Musk had only just renewed his 100% focus on Tesla and his other business interests by that time. Tesla sales were down during the presidential election campaign last year and continued to decline, on a quarterly basis, during the first half of 2025. Neil Wilson, UK investor strategist at Saxo Markets, said of the company's share price woes: \"Investors are worried about two things - one is more Trump ire affecting subsidies and the other more importantly is a distracted Musk. \"Investors had cheered Musk stepping back from frontline politics but are now worried he's going to sucked back in and take his eye off Tesla.\""
    },
    {
        "title": "Building societies step up protest against Reeves's cash ISA reforms",
        "description": "Building society chiefs will this week intensify their protests against the chancellor's plans to cut cash ISA limits by warning that it will push up borrowing costs for homeowners and businesses.",
        "url": "https://news.sky.com/story/building-societies-step-up-protest-against-reevess-cash-isa-reforms-13393599",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-doorstep_6956222.jpg?20250707125812",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-07 11:19:00",
        "Headline": "A draft letter from the Building Societies Association, seen by Sky News, warns the chancellor that slashing the cash ISA limit risks pushing up borrowing costs for homeowners and businesses.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Building society chiefs will this week intensify their protests against the chancellor's plans to cut cash ISA limits by warning that it will push up borrowing costs for homeowners and businesses. Sky News has obtained the draft of a letter being circulated by the Building Societies Association (BSA) among its members which will demand that Rachel Reeves abandons a proposed move to slash savers' annual cash ISA allowance from the existing £20,000 threshold. Money blog: 'I get paid to taste biscuits' The draft letter, which is expected to be published this week, warns the chancellor that her decision would deter savers, disrupt Labour's housebuilding ambitions and potentially present an obstacle to economic growth by triggering higher funding costs. \"Cash ISAs are a cornerstone of personal savings for millions across the UK, helping people from all walks of life to build financial resilience and achieve their savings goals,\" the draft letter said. \"Beyond their personal benefits, Cash ISAs play a vital role in the broader economy. \"The funds deposited in these accounts support lending, helping to keep mortgages and loans affordable and accessible. \n                  Reeves's tax turmoil deepens\n                 \n                  Rachel Reeves hints at tax rises in autumn budget after welfare bill U-turn\n                 \n                  Did Keir Starmer screw up his own anniversary?\n                 \"Cutting Cash ISA limits would make this funding more scarce which would have the knock-on effect of making loans to households and businesses more expensive and harder to come by. \"This would undermine efforts to stimulate economic growth, including the government's commitment to delivering 1.5 million new homes. \"Cutting the Cash ISA limit would send a discouraging message to savers, who are sensibly trying to plan for the future and undermine a product that has stood the test of time.\" The chancellor is reportedly preparing to announce a review of cash ISA limits as part of her Mansion House speech next week. While individual building society bosses have come out publicly to express their opposition to the move, the BSA letter is likely to be viewed with concern by Treasury officials. The Nationwide is by far Britain's biggest building society, with the likes of the Coventry, Yorkshire and Skipton also ranking among the sector's largest players. Read more from Sky News:Trump tariff deadline extended as new threats issuedWhat happens to your pension when you die? In the draft letter, which is likely to be signed by dozens of building society bosses, the BSA said the chancellor's proposals \"would make the whole ISA regime more complex and make it harder for people to transfer money between cash and investments\". \"Restricting Cash ISAs won't encourage people to invest, as it won't suddenly change their appetite to take on risk,\" it said. \"We know that barriers to investing are primarily behavioural, therefore building confidence and awareness are far more important.\" The BSA called on Ms Reeves to back \"a long-term consumer awareness and information campaign to educate people about the benefits of investing, alongside maintaining strong support for saving\". \"We therefore urge you to affirm your support for Cash ISAs by maintaining the current £20,000 limit. \"Preserving this threshold will enable households to continue building financial security while supporting broader economic stability and growth.\" The BSA declined to comment on Monday on the leaked letter, although one source said the final version was subject to revision. The Treasury has so far refused to comment on its plans."
    },
    {
        "title": "Trump tariff deadline extended as new threats issued to BRICS states",
        "description": "The date for Trump's tariffs to take effect has been extended, with deals being sent to countries from Monday evening, the president said. ",
        "url": "https://news.sky.com/story/trump-tariff-deadline-extended-as-new-threats-issued-to-brics-states-13393463",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-donald_6956602.jpg?20250703195527",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-07-07 06:17:00",
        "Headline": "Countries will receive letters on possible trade deals on Monday, President Trump said. Many of the world's largest economies are yet to reach a deal with the US. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The date for Trump's tariffs to take effect has been extended, with deals being sent to countries from Monday evening, the president said.  The 90-day pause on country-specific taxes on US imports was due to end on Wednesday, but instead will expire on 1 August, the Trump administration said. Money blog: 'I get paid to taste biscuits' The US president's signature economic policy of tariffs meant countries across the world were hit with individual tariffs, causing havoc with international trade. But Mr Trump appeared to be in deal-making mode early Monday, posting on his social media network, Truth Social, that countries would receive \"letters and/or deals\" from 5pm UK time. However, he also made an additional threat of an extra 10% tariff for \"any country aligning themselves with the anti-American policies of BRICS\". Market reaction \n                  'Utter rubbish': Putin dismisses MI5 claims Russia trying to create mayhem in UK and Europe\n                 \n                  Ukraine war: 'A just peace' needed to end conflict, UN chief tells Putin at 'new global order' BRICS summit\n                 The BRICS (Brazil, Russia, India, China, South Africa) organisation of countries also includes Egypt, Ethiopia, Indonesia, Iran and the United Arab Emirates. Reaction has been far more muted than the big market moves when the country-specific tariffs were announced on 2 April's \"Liberation Day\" announcement, but the news has not been welcomed.  Many major stock indexes in Asia closed down, while the UK's benchmark index of 100 most valuable London Stock Exchange-listed firms, the FTSE 100, fell around 0.1% on the open. BRICS members India saw its NIFTY 50 index fall 0.1%, China saw its Shenzhen Component shed 0.7%, and Hong Kong's Hang Seng index lost 0.23%. Read more:What happens to your pension when you die?Take away government's control of redress schemes, say Post Office victims The Shanghai Composite, however, was up 0.02%. Based on pre-market trading, US stocks look set to open down. Deals While the UK reached an agreement with the US to circumvent the worst of tariffs, many of the world's largest economies are yet to strike a deal. Tariffs on UK steel exports to the US are still expected to come into force on 9 July. The UK had been spared from the 50% tax on aluminium and steel. The European Union, India, Japan and Canada have yet to reach an agreement. An agreement with China, the world's second biggest economy, has held despite allegations of deal-breaking on both sides."
    },
    {
        "title": "Former Sainsbury's chief King in frame to head Channel 4",
        "description": "Justin King, one of Britain's most prominent businessmen, is in the frame to become the next head of Channel 4, the state-owned broadcaster.",
        "url": "https://news.sky.com/story/former-sainsburys-chief-king-in-frame-to-head-channel-4-13393511",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-channel-4-channel-four_6846256.jpg?20250304185310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-07 09:02:00",
        "Headline": "Justin King is among the contenders expected to be interviewed in the coming weeks to replace Sir Ian Cheshire as the state-owned broadcaster's chair, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Justin King, one of Britain's most prominent businessmen, is in the frame to become the next head of Channel 4, the state-owned broadcaster. Sky News has learnt that Mr King is among the contenders to replace Sir Ian Cheshire as Channel 4 chairman. A Whitehall source said on Monday that the former J Sainsbury chief executive - who now chairs companies including Allwyn, the National Lottery operator, and Ovo Energy - had been shortlisted for the post and was expected to be interviewed for it this month. Money blog: Former call centre worker reveals simple tip for getting discounts It was unclear who else remained in contention for the Channel 4 post, although the government insider suggested Debbie Wosskow, who already sits on the broadcaster's board, had also made it to the shortlist. The status of a number of other reported candidates - including Tristia Clarke, the former TalkTalk boss - could not be established on Monday. If chosen, Mr King would be the latest in a string of heavyweight names to take the post, following the likes of Sir Ian and Luke Johnson, the hospitality entrepreneur. Mr King also sits on the board of Marks & Spencer, as well as a number of privately owned companies. Sir Ian stepped down earlier this year after just one three-year term in the role. Read more from Sky News:Trump tariff deadline extended as new threats issuedFormer Labour leader Lord Kinnock calls for wealth tax The Channel 4 chairmanship is currently held on an interim basis by Dawn Airey, the media industry executive who has occupied top jobs at companies including ITV, Yahoo! and Channel 5. The race to lead the state-owned broadcaster's board has acquired additional importance since the resignation of Alex Mahon, its long-serving chief executive. At the weekend, Broadcast, the trade publication, reported that Alex Burford, another Channel 4 non-executive director and the boss of Warner Records UK, was interested in replacing Ms Mahon. Ms Mahon, who was a vocal opponent of the last Conservative government's proposed privatisation of Channel 4, is leaving to join Superstruct, a private equity-owned live entertainment company. The appointment of a new chair is expected to take place by the autumn, with the chosen candidate expected to lead the recruitment of Ms Mahon's successor. Recruitment to the board of Channel 4 is technically led by Ofcom, the media regulator, in agreement with Lisa Nandy, the culture secretary. The Channel 4 search is taking place at a time when the BBC is under growing pressure from Ms Nandy over its decision not to curb the broadcasting of Bob Vylan's Glastonbury Festival set, in which the band called for the death of Israeli armed forces. Channel 4 declined to comment."
    },
    {
        "title": "Government declines to rule out wealth tax after ex-Labour leader Lord Kinnock calls for one",
        "description": "The government has declined to rule out a \"wealth tax\" after former Labour leader Neil Kinnock called for one to help the UK's dwindling finances.\n\n",
        "url": "https://news.sky.com/story/former-labour-leader-lord-kinnock-calls-for-wealth-tax-to-help-ailing-government-finances-13393515",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-neil-kinnock-labour_6958382.jpg?20250706093136",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-07 09:10:00",
        "Headline": "The chancellor is rapidly losing her £9.9bn fiscal headroom thanks to multiple U-turns on policies that were meant to save money.",
        "Content": " The government has declined to rule out a \"wealth tax\" after former Labour leader Neil Kinnock called for one to help the UK's dwindling finances.\n\n Lord Kinnock, who was Labour leader from 1983 to 1992, told Sky News' Sunday Morning With Trevor Phillips that imposing a 2% tax on assets valued above £10 million would bring in up to £11 billion a year. Politics latest: Reeves's tax turmoil deepens On Monday, Prime Minister Sir Keir Starmer's spokesperson would not say if the government will or will not bring in a specific tax for the wealthiest. Asked multiple times if the government will do so, he said: \"The government is committed to the wealthiest in society paying their share in tax. \"The prime minister has repeatedly said those with the broadest shoulders should carry the largest burden.\" He added the government has closed loopholes for non-doms, placed taxes on private jets and said the 1% wealthiest people in the UK pay one third of taxes. Chancellor Rachel Reeves earlier this year insisted she would not impose a wealth tax in her autumn budget, something she also said in 2023 ahead of Labour winning the election last year. Asked if her position has changed, Sir Keir's spokesman referred back to her previous comments and said: \"The government position is what I have said it is.\"  On Sunday, Lord Kinnock told Sky News: \"It's not going to pay the bills, but that kind of levy does two things. \"One is to secure resources, which is very important in revenues. \"But the second thing it does is to say to the country, 'we are the government of equity'. \"This is a country which is very substantially fed up with the fact that whatever happens in the world, whatever happens in the UK, the same interests come out on top unscathed all the time while everybody else is paying more for getting services. \"Now, I think that a gesture or a substantial gesture in the direction of equity fairness would make a big difference.\" The son of a coal miner, who became a member of the House of Lords in 2005, the Labour peer said asset values have \"gone through the roof\" in the past 20 years while economies and incomes have stagnated in real terms.  In reference to the chancellor refusing to change her fiscal rules, he said the government is giving the appearance it is \"bogged down by their own imposed limitations\", which he said is \"not actually the accurate picture\". A wealth tax would help the government get out of that situation and would be backed by the \"great majority of the general public\", he added. His comments came after a bruising week for the prime minister, who had to heavily water down a welfare bill meant to save £5.5bn after dozens of Labour MPs threatened to vote against it. With those savings lost - and a previous U-turn on cutting winter fuel payments also reducing savings - the chancellor's £9.9bn fiscal headroom has quickly dwindled. In a hint of what could come, government minister Stephen Morgan on Monday told Wilfred Frost on Sky News Breakfast: \"I hold dear the Labour values of making sure those that have the broadest shoulders pay, pay more tax. \"I think that's absolutely right.\" He added that the government has already put a tax on private jets and on the profits of energy companies."
    },
    {
        "title": "'A threat to national security': Fears drones could be used to lift inmates out of prisons",
        "description": "Sophisticated drones sending \"overwhelming amounts\" of drugs and weapons into prisons represent a threat to national security, according to an annual inspection report by the prisons watchdog.",
        "url": "https://news.sky.com/story/drones-are-sending-overwhelming-amounts-of-drugs-into-prisons-and-could-help-inmates-escape-report-warns-13393798",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-drone-prison_6959764.jpg?20250708004925",
        "type": "Politics",
        "Author": "Mollie Malone",
        "Date Published": "2025-07-07 23:29:00",
        "Headline": "The HMP chief inspector of prisons has issued a stark warning over drugs being delivered via drones - saying \"the police and prison service have in effect ceded the airspace\" over two Category A jails. ",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n Sophisticated drones sending \"overwhelming amounts\" of drugs and weapons into prisons represent a threat to national security, according to an annual inspection report by the prisons watchdog. HMP chief inspector of prisons Charlie Taylor has warned criminal gangs are targeting jails and making huge profits selling contraband to a \"vulnerable and bored\" prison population. The watchdog boss reiterated his concerns about drones making regular deliveries to two Category A jails, HMP Long Lartin and HMP Manchester, which hold \"the most dangerous men in the country\", including terrorists.  Mr Taylor said \"the police and prison service have in effect ceded the airspace\" above these two high-security prisons, which he said was compromising the \"safety of staff, prisoners, and ultimately that of the public\". \"The possibility now whereby we're seeing packages of up to 10kg brought in by serious organised crime means that in some prisons there is now a menu of drugs available,\" he said. \"Anything from steroids to cannabis, to things like spice and cocaine.\" \"Drone technology is moving fast... there is a level of risk that's posed by drones that I think is different from what we've seen in the past,\" warned the chief inspector - who also said there's a \"theoretical risk\" that a prisoner could escape by being carried out of a jail by a drone. He urged the prison service to \"get a grip\" of the issue, stating: \"We'd like to see the government, security services, coming together, using technology, using intelligence, so that this risk doesn't materialise.\" The report makes clear that physical security - such as netting, windows and CCTV - is \"inadequate\" in some jails, including Manchester, with \"inexperienced staff\" being \"manipulated\". Mr Taylor said there are \"basic\" measures which could help prevent the use of drones, such as mowing the lawn, \"so we don't get packages disguised as things like astro turf\". Responding to the report, the Prison Advice and Care Trust (PACT) said: \"The ready access to drugs is deeply worrying and is undermining efforts to create places of rehabilitation.\" Mr Taylor's report found that overcrowding continues to be what he described as a \"major issue\", with increasing levels of violence against staff and between prisoners, combined with a lack of purposeful activity. Some 20% of adult men responding to prisoner surveys said they felt unsafe at the time of the inspection, increasing to 30% in the high security estate. Andrea Coomber, chief executive of the Howard League for Penal Reform, said: \"This report is a checklist for all the reasons the government must prioritise reducing prison numbers, urgently. \"Sentencing reform is essential, and sensible steps to reduce the prison population would save lives.\" Read more UK news:The human impact of the Post Office scandalGovt to ban 'appalling' NDAs that silence victims  The report comes after the government pledged to accept most of the recommendations proposed in the independent review of sentencing policy, with the aim of freeing up around 9,500 spaces. Those measures won't come into effect until spring 2026. Prisons Minister Lord Timpson said Mr Taylor's findings show \"the scale of the crisis\" the government \"inherited\", with \"prisons dangerously full, rife with drugs and violence\". He said: \"After just 500 prison places added in 14 years, we're building 14,000 extra - with 2,400 already delivered - and reforming sentencing to ensure we never run out of space again. \"We're also investing £40m to bolster security, alongside stepping up cooperation with police to combat drones and stop the contraband which fuels violence behind bars.\""
    },
    {
        "title": "Children with special needs will 'always' have 'legal right' to support, education secretary says",
        "description": "The education secretary has said children with special needs will \"always\" have a legal right to additional support as she sought to quell a looming row over potential cuts.",
        "url": "https://news.sky.com/story/children-with-special-needs-will-always-have-legal-right-to-support-education-secretary-says-13393728",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bridget-phillipson_6949324.jpg?20250624101138",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-07-07 16:12:00",
        "Headline": "Bridget Phillipson seeks to dampen a looming row over whether the government could scrap tailored plans for children with special needs - as some Labour MPs fear a repeat of the welfare row.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The education secretary has said children with special needs will \"always\" have a legal right to additional support as she sought to quell a looming row over potential cuts. The government is facing a potential repeat of the debacle over welfare reform due to suggestions it could scrap tailored plans for children and young people with special needs in the classroom. Politics latest: Minister says 'those with broadest shoulders should pay more tax' Speaking in the Commons on Monday, Bridget Phillipson failed to rule out abolishing education, health and care plans (EHCPs) - legally-binding plans to ensure children and young people receive bespoke support in either mainstream or specialist schools. Laura Trott, the shadow education secretary, said parents' anxiety was \"through the roof\" following reports over the weekend that EHCPs could be scrapped. She said parents \"need and deserve answers\" and asked: \"Can she confirm that no parent or child will have their right to support reduced, replaced or removed as a result of her planned changes?\"  Ms Phillipson said SEND provision was a \"serious and complex area\" and that the government's plans would be set out in a white paper that would be published later in the year. \n                  Exclusive: Watchdog upholds nearly 100% of complaints about special educational needs in England\n                 \n                  London Welsh language school secures funding - but long-term future still in doubt\n                 \n                  Teachers given new guidance in dealing with AI-generated child sexual abuse material\n                 \"I would say to all parents of children with SEND, there is no responsibility I take more seriously than our responsibility to some of the most vulnerable children in our country,\" she said. \"We will ensure, as a government, that children get better access to more support, strengthened support, with a much sharper focus on early intervention.\" ECHPs are drawn up by local councils and are available to children and young people aged up to 25 who need more support than is provided by the Special Educational Needs and Disabilities (SEND) budget. They identify educational, health and social needs and set out the additional support to meet those needs. In total, there were 638,745 EHCPs in place in January 2025 - up 10.8% on the same point last year. 'Rebel ready' One Labour MP said they were concerned the government risked making the \"same mistakes\" over ECHPs as it did with the row over welfare, when it was eventually forced into a humiliating climbdown in the face of opposition by Labour MPs. \"The political risk is much higher even than with welfare, and I'm worried it's being driven by a need to save money which it shouldn't be,\" they told Sky News. \"Some colleagues are rebel ready.\" The MP said the government should be \"charting a transition from where we are now to where we need to be\", adding: \"That may well be a future without ECHPs, because there is mainstream capacity - but that cannot be a removal of current provision.\" Later in the debate, Ms Phillipson said children with special educational needs and disabilities would \"always\" have a \"legal right\" to additional support as she accused a Conservative MP of attempting to \"scare\" parents. \"The guiding principle of any reform to the SEND system that we will set out will be about better support for children, strengthened support for children and improved support for children, both inside and outside of special schools,\" she said. Read more:Government to ban 'appalling' non-disclosure agreementsGovernment declines to rule out wealth tax \"Improved inclusivity in mainstream schools, more specialist provision in mainstream schools, and absolutely drawing on the expertise of the specialist sector in creating the places where we need them, there will always be a legal right … to the additional support… that children with SEND need.\" Her words were echoed by schools minister Catherine McKinnell, who also did not rule out changing ECHPs. She told the Politics Hub With Sophy Ridge that the government was \"focused on reforming the whole system\". \"Children and families have been left in a system where they've had to fight for their child's education, and that has to change,\" she said. She added that EHCPs have not necessarily \"fixed the situation\" for some children - but for others it's \"really important\"."
    },
    {
        "title": "Government to ban 'appalling' non-disclosure agreements that silence victims of abuse at work",
        "description": "Victims will no longer have to \"suffer in silence\", the government has said, as it pledges to ban non-disclosure agreements (NDAs) designed to silence staff who've suffered harassment or discrimination.",
        "url": "https://news.sky.com/story/government-to-ban-appalling-non-disclosure-agreements-that-silence-victims-of-abuse-at-work-13393781",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sexual-harassment_6959673.jpg?20250707193242",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-07 17:54:00",
        "Headline": "Non-disclosure agreements, such as those signed by victims of Harvey Weinstein, have been wrongly used to silence victims of harassment and discrimination. The government is proposing they should be voided and banned.",
        "Content": "Victims will no longer have to \"suffer in silence\", the government has said, as it pledges to ban non-disclosure agreements (NDAs) designed to silence staff who've suffered harassment or discrimination. Accusers of Harvey Weinstein, the former film producer and convicted sex offender, are among many in recent years who had to breach such agreements in order to speak out. Labour has suggested an extra section in the Employment Rights Bill that would void NDAs that are intended to stop employees going public about harassment or discrimination. The government said this would allow victims to come forward about their situation rather than remain \"stuck in unwanted situations, through fear or desperation\". Zelda Perkins, Weinstein's former assistant and founder of Can't Buy My Silence UK, said the changes would mark a \"huge milestone\" in combatting the \"abuse of power\". She added: \"This victory belongs to the people who broke their NDAs, who risked everything to speak the truth when they were told they couldn't. Without their courage, none of this would be happening.\" Deputy prime minister Angela Rayner said the government had \"heard the calls from victims of harassment and discrimination\" and was taking action to prevent people from having to \"suffer in silence\". \n                  'A threat to national security': Fears drones could be used to lift inmates out of prisons\n                 \n                  Post Office scandal: Daughter has had 'panic attacks' since mum was accused of stealing\n                 \n                  Every mobile phone to receive emergency alert: When it will happen - and what it will say\n                  An NDA is a broad term that describes any agreement that restricts what a signatory can say about something and was originally intended to protect commercially sensitive information. Currently, a business can take an employee to court and seek compensation if they think a NDA has been broken. \"Many high profile cases\" have revealed NDAs are being manipulated to prevent people \"speaking out about horrific experiences in the workplace\", the government said. Announcing the amendments, employment minister Justin Madders said: \"The misuse of NDAs to silence victims of harassment or discrimination is an appalling practice that this government has been determined to end.\" The bill is currently in the House of Lords, where it will be debated on 14 July, before going on to be discussed by MPs as well."
    },
    {
        "title": "Government declines to rule out wealth tax after ex-Labour leader Lord Kinnock calls for one",
        "description": "The government has declined to rule out a \"wealth tax\" after former Labour leader Neil Kinnock called for one to help the UK's dwindling finances.\n\n",
        "url": "https://news.sky.com/story/former-labour-leader-lord-kinnock-calls-for-wealth-tax-to-help-ailing-government-finances-13393515",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-neil-kinnock-labour_6958382.jpg?20250706093136",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-07 09:10:00",
        "Headline": "The chancellor is rapidly losing her £9.9bn fiscal headroom thanks to multiple U-turns on policies that were meant to save money.",
        "Content": " The government has declined to rule out a \"wealth tax\" after former Labour leader Neil Kinnock called for one to help the UK's dwindling finances.\n\n Lord Kinnock, who was Labour leader from 1983 to 1992, told Sky News' Sunday Morning With Trevor Phillips that imposing a 2% tax on assets valued above £10 million would bring in up to £11 billion a year. Politics latest: Reeves's tax turmoil deepens On Monday, Prime Minister Sir Keir Starmer's spokesperson would not say if the government will or will not bring in a specific tax for the wealthiest. Asked multiple times if the government will do so, he said: \"The government is committed to the wealthiest in society paying their share in tax. \"The prime minister has repeatedly said those with the broadest shoulders should carry the largest burden.\" He added the government has closed loopholes for non-doms, placed taxes on private jets and said the 1% wealthiest people in the UK pay one third of taxes. Chancellor Rachel Reeves earlier this year insisted she would not impose a wealth tax in her autumn budget, something she also said in 2023 ahead of Labour winning the election last year. Asked if her position has changed, Sir Keir's spokesman referred back to her previous comments and said: \"The government position is what I have said it is.\"  On Sunday, Lord Kinnock told Sky News: \"It's not going to pay the bills, but that kind of levy does two things. \"One is to secure resources, which is very important in revenues. \"But the second thing it does is to say to the country, 'we are the government of equity'. \"This is a country which is very substantially fed up with the fact that whatever happens in the world, whatever happens in the UK, the same interests come out on top unscathed all the time while everybody else is paying more for getting services. \"Now, I think that a gesture or a substantial gesture in the direction of equity fairness would make a big difference.\" The son of a coal miner, who became a member of the House of Lords in 2005, the Labour peer said asset values have \"gone through the roof\" in the past 20 years while economies and incomes have stagnated in real terms.  In reference to the chancellor refusing to change her fiscal rules, he said the government is giving the appearance it is \"bogged down by their own imposed limitations\", which he said is \"not actually the accurate picture\". A wealth tax would help the government get out of that situation and would be backed by the \"great majority of the general public\", he added. His comments came after a bruising week for the prime minister, who had to heavily water down a welfare bill meant to save £5.5bn after dozens of Labour MPs threatened to vote against it. With those savings lost - and a previous U-turn on cutting winter fuel payments also reducing savings - the chancellor's £9.9bn fiscal headroom has quickly dwindled. In a hint of what could come, government minister Stephen Morgan on Monday told Wilfred Frost on Sky News Breakfast: \"I hold dear the Labour values of making sure those that have the broadest shoulders pay, pay more tax. \"I think that's absolutely right.\" He added that the government has already put a tax on private jets and on the profits of energy companies."
    },
    {
        "title": "Wealth tax may not be fully formed proposal - but could be put in the mix",
        "description": "I want to take you into the daily Downing Street briefing for political journalists to try and explain the likelihood of the government introducing a wealth tax.",
        "url": "https://news.sky.com/story/wealth-tax-may-not-be-fully-formed-proposal-but-could-be-put-in-the-mix-13393699",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-rachel-reeves_6948565.jpg?20250623111721",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-07-07 15:18:00",
        "Headline": "Lord Kinnock, who was Labour leader from 1983 to 1992, told Sky News' Sunday Morning With Trevor Phillips that imposing a 2% tax on assets valued above £10m would bring in up to £11bn a year.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n I want to take you into the daily Downing Street briefing for political journalists to try and explain the likelihood of the government introducing a wealth tax. Referred to as 'lobby', the sessions are the main chance for reporters to grill the prime minister's official spokesperson about the big political issues of the day. Now, occasionally the spokesperson comes to these sessions with a clear and obvious update that will 'create news'. Most of the time though, we're left trying to read between the lines of what's being said, searching for hints or steers that could indicate whether Number 10 is trying to shut a story down or let it run. This isn't always straightforward, as was proven in this briefing. Politics latest: Reeves's tax turmoil deepens Take this first answer from the PM's spokesperson when asked if Sir Keir Starmer backed a wealth tax. \n                  Government declines to rule out wealth tax after ex-Labour leader Lord Kinnock calls for one\n                 \n                  Another tantrum from the Labour backbenches is inevitable\n                 \n                  Starmer would be foolish not to recognise the threat posed by a left-wing Corbyn party\n                 \"Those with the broadest shoulders carry the greatest burden and the choices we've made reflect that… our progressive tax system means the top 1% of taxpayers contribute nearly a third of income tax with revenue from wealth and asset taxes… going towards funding tens of billions of pounds for public services.\" Now, one way of interpreting that is Downing Street saying they're already hitting the wealthiest so there's no need to whack them with more taxes. But then again, he could also be saying that raising money from the super-rich is a preferred policy of this government and as such may happen again. So which is it? Well, we asked that, and this is the answer we got. \"The chancellor has said that we are not going to be bringing in a wealth tax\". Pointing to a previous on the record statement is a classic lobby method of shutting a story down without commenting on it directly.  So a clear answer? Well in this instance, the spokesperson still seemed somewhat reluctant to throw his full weight behind this previous comment from Rachel Reeves. It all meant the few dozen journalists left the briefing room perplexed at where Downing Street stood on the policy with the only solid outcome being the fact that the government had certainly not ruled anything out. Read more:Government declines to rule out wealth tax For what it's worth, my read on the situation - based on other conversations and the many lobby briefings I've sat in over the years - is that the wealth tax idea hasn't (at this time) reached the point of becoming a formal proposal but may yet be put in the mix. The reason it's being talked about now is because the former Labour leader Neil Kinnock suggested on Sky News' Sunday Morning with Trevor Phillips that cabinet ministers may be sympathetic to it. Lord Kinnock, who was leader from 1983 to 1992, said that imposing a 2% tax on assets valued above £10m would bring in up to £11bn a year.  Whether this party veteran is reflecting back chatter from within government or simply pitching fresh suggestions is unclear. But you can see how such a measure would slot into the existing crease hardening down the middle of the cabinet between those more inclined to tax and spend (Angela Rayner, Lisa Nandy, Ed Miliband) and others more concerned about making savings and investing (Rachel Reeves and Darren Jones). For now, three to four months from a budget that will need to raise a significant amount of money, we can probably think of this as something of a Schrodinger's tax - simultaneously on and off with its final state only revealed when the chancellor opens her red box come the autumn."
    },
    {
        "title": "Building societies step up protest against Reeves's cash ISA reforms",
        "description": "Building society chiefs will this week intensify their protests against the chancellor's plans to cut cash ISA limits by warning that it will push up borrowing costs for homeowners and businesses.",
        "url": "https://news.sky.com/story/building-societies-step-up-protest-against-reevess-cash-isa-reforms-13393599",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-doorstep_6956222.jpg?20250707125812",
        "type": "Politics",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-07 11:19:00",
        "Headline": "A draft letter from the Building Societies Association, seen by Sky News, warns the chancellor that slashing the cash ISA limit risks pushing up borrowing costs for homeowners and businesses.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Building society chiefs will this week intensify their protests against the chancellor's plans to cut cash ISA limits by warning that it will push up borrowing costs for homeowners and businesses. Sky News has obtained the draft of a letter being circulated by the Building Societies Association (BSA) among its members which will demand that Rachel Reeves abandons a proposed move to slash savers' annual cash ISA allowance from the existing £20,000 threshold. Money blog: 'I get paid to taste biscuits' The draft letter, which is expected to be published this week, warns the chancellor that her decision would deter savers, disrupt Labour's housebuilding ambitions and potentially present an obstacle to economic growth by triggering higher funding costs. \"Cash ISAs are a cornerstone of personal savings for millions across the UK, helping people from all walks of life to build financial resilience and achieve their savings goals,\" the draft letter said. \"Beyond their personal benefits, Cash ISAs play a vital role in the broader economy. \"The funds deposited in these accounts support lending, helping to keep mortgages and loans affordable and accessible. \n                  Reeves's tax turmoil deepens\n                 \n                  Rachel Reeves hints at tax rises in autumn budget after welfare bill U-turn\n                 \n                  Did Keir Starmer screw up his own anniversary?\n                 \"Cutting Cash ISA limits would make this funding more scarce which would have the knock-on effect of making loans to households and businesses more expensive and harder to come by. \"This would undermine efforts to stimulate economic growth, including the government's commitment to delivering 1.5 million new homes. \"Cutting the Cash ISA limit would send a discouraging message to savers, who are sensibly trying to plan for the future and undermine a product that has stood the test of time.\" The chancellor is reportedly preparing to announce a review of cash ISA limits as part of her Mansion House speech next week. While individual building society bosses have come out publicly to express their opposition to the move, the BSA letter is likely to be viewed with concern by Treasury officials. The Nationwide is by far Britain's biggest building society, with the likes of the Coventry, Yorkshire and Skipton also ranking among the sector's largest players. Read more from Sky News:Trump tariff deadline extended as new threats issuedWhat happens to your pension when you die? In the draft letter, which is likely to be signed by dozens of building society bosses, the BSA said the chancellor's proposals \"would make the whole ISA regime more complex and make it harder for people to transfer money between cash and investments\". \"Restricting Cash ISAs won't encourage people to invest, as it won't suddenly change their appetite to take on risk,\" it said. \"We know that barriers to investing are primarily behavioural, therefore building confidence and awareness are far more important.\" The BSA called on Ms Reeves to back \"a long-term consumer awareness and information campaign to educate people about the benefits of investing, alongside maintaining strong support for saving\". \"We therefore urge you to affirm your support for Cash ISAs by maintaining the current £20,000 limit. \"Preserving this threshold will enable households to continue building financial security while supporting broader economic stability and growth.\" The BSA declined to comment on Monday on the leaked letter, although one source said the final version was subject to revision. The Treasury has so far refused to comment on its plans."
    },
    {
        "title": "Reeves's tax turmoil deepens",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;",
        "url": "https://news.sky.com/story/reevess-tax-turmoil-deepens-13393468",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250623145702",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-07 06:39:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈       Could Westminster be on for a quieter week?Sky News' Sam Coates and Politico's Anne McElvoy ponder that as the Prime Minister takes stock after the welfare rebellion - with some in the party telling Sam they're just focussing on getting to recess before a September reset.But the issue they can't shake off - will there be tax rises? With the Chancellor's black hole adding up to far more than £5.5bn - is there any other choice, In fact, could that black hole be more like £20bn?And which taxes would they be?"
    },
    {
        "title": "UK farmers have 'nothing more to give' as they fear govt will compromise welfare in US-UK trade deal",
        "description": "UK farmers have \"nothing more to give\" as they fear the government will use agriculture to further reduce US tariffs in a trade deal with the White House.",
        "url": "https://news.sky.com/story/uk-farmers-have-nothing-more-to-give-as-they-fear-govt-will-compromise-welfare-in-us-uk-trade-deal-13393675",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6956690.jpg?20250703224359",
        "type": "Technology",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-07 14:40:00",
        "Headline": "Donald Trump has given the UK a 9 July deadline to sort out a deal over steel tariffs, with farmers concerned lower US welfare standards will be allowed to reduce them.",
        "Content": "\n          Political reporter\n              @alixculbertson\n UK farmers have \"nothing more to give\" as they fear the government will use agriculture to further reduce US tariffs in a trade deal with the White House. The UK is trying to reduce steel tariffs to zero, from a current reduced rate of 25%, but Downing Street refused to confirm if it was confident ahead of Donald Trump's deadline of 9 July. Tom Bradshaw, president of the National Farmers' Union (NFU), said UK agriculture had already been used to reduce Trump-imposed tariffs on cars but any other concessions would have serious repercussions for farmers, food security and the UK's high animal welfare standards. Politics latest: Downing Street refuses to rule out wealth tax He told Sky News: \"It just feels like we, as the agricultural sector, had to shoulder the responsibility to reduce the tariffs on cars from 25%. \"We can't do it anymore, we have nothing more to give. \"It's clear the steel quotas and tariffs aren't sorted yet, so we just want to be very clear with the government: if they're sitting around the negotiating table - which we understand they are - they can't expect agriculture to give any more.\" \n                  Trade war: Trump reveals first nations to pay delayed 'liberation day' tariffs\n                 \n                  Tesla shares sink as Musk launches political party\n                 \n                  Trump tariff deadline extended as new threats issued to BRICS states\n                 'Massively undermine our standards' Since 30 June, the US has been able to import 13,000 tonnes of hormone-free British beef without tariffs under a deal made earlier this year, which farmers feel was to reduce the car import levy Mr Trump imposed. The UK was also given tariff-free access to 1.4bn litres of US ethanol, which farmers say will put the UK's bioethanol and associated sectors under pressure. Allowing lower US food standards would \"massively undermine our standards\" and would mean fewer sales to the European Union where food standards are also high, Mr Bradshaw said. It would leave British farmers competing on a playing field that is \"anything but fair\", he said, because US food can be produced - and sold - much cheaper due to low welfare which could see a big reduction in investment in UK farms, food security and the environment. Read more:Trump tariff deadline extended as new threats issued to BRICs nations  'The US will push hard for more access' He said the US narrative has always suggested they want access to British agriculture products \"as a start and they'll negotiate for more\". \"The narrative from the White House on 8 May, when a US-UK trade deal was announced, was all about further access to our agriculture products - it was very different to what our government was saying,\" he added. \"So far, the UK has stood firm and upheld our higher welfare standards, but the US will push very hard to have further access. \"No country in the world has proved they can reduce the 10% tariffs further.\" US 'will target poultry and pork' The Essex farmer said he expects the US to push \"very hard\" to get the UK to lower its standards on poultry and pork, specifically. US poultry is often washed with antimicrobials, including chlorine, in an attempt to wash off high levels of bacteria caused by poor hygiene, antibiotic use and low animal welfare conditions not allowed in UK farming. US pig rearing methods are also quite different, with intensive farming and the use of feed additive ractopamine legal, with both banned in the UK. A government spokesperson told Sky News: \"We regularly speak to businesses across the UK to understand the impact of tariffs and will only ever act in the national interest. \"Our Plan for Change has delivered a deal which will open up exclusive access for UK beef farmers to the US market for the first time ever and all agricultural imports coming to the UK will have to meet our high SPS (sanitary and phytosanitary) standards.\""
    },
    {
        "title": "How Australian death cap mushroom trial unfolded - as Erin Patterson found guilty of murder",
        "description": "An Australian woman has been found guilty of murdering three people after serving them poisonous mushrooms.",
        "url": "https://news.sky.com/story/what-we-know-from-australia-mushroom-poisoning-trial-as-jury-considers-verdict-13363700",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erin-patterson_6901598.jpg?20250430125843",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-07-07 07:36:00",
        "Headline": "After a nine-week trial, Erin Patterson has been found guilty of the murder of her parents-in-law and an aunt, who died days after she served them a beef wellington for lunch. ",
        "Content": " An Australian woman has been found guilty of murdering three people after serving them poisonous mushrooms. Mother-of-two Erin Patterson, 50, has been convicted of the 2023 murders of her former parents-in-law, Don and Gail Patterson, both 70, and Gail Patterson's sister, Heather Wilkinson, 66, along with the attempted murder of Reverend Ian Wilkinson, Heather's husband. Prosecutors said she served guests beef wellington knowing it contained deadly death cap mushrooms, also known as Amanita phalloides. Under Australian law, the prosecution did not have to prove a motive in order to secure a conviction. Instead, the jury was required to decide whether she knew the lunch contained death caps, and if she intended for them to die. After a nine-week trial in Morwell, Victoria, the jury concluded unanimously that she poisoned the guests on purpose and rejected her defence that the deaths were a \"terrible accident\". A sentencing date for Patterson is yet to be scheduled, but the charges carry a maximum life sentence. Here is everything you need to know about the case. An unexpected invitation Patterson invited the four victims for lunch at her home in Leongatha, a small town in Melbourne, on 29 July 2023. Her estranged husband, Simon Patterson, was also invited but didn't attend. Text messages read out in court revealed Patterson found his decision not to come \"really disappointing\" as she had spent time and money preparing the \"special meal\". He said he had listed them as financially separated on a tax return, which triggered a series of child support payments that meant he would no longer pay their two children's private school fees directly, he told the court. Speaking to the court through tears, Mr Patterson said: \"I was sure she was very upset about that.\" Reverend Wilkinson said he and his wife were surprised by the invitation, telling the Australian Broadcasting Corporation (ABC): \"There was no reason given for the lunch, and I remember talking to Heather wondering why the sudden invitation.\" But he said the pair were \"very happy to be invited\". Patterson's daughter, according to ABC, told the court that her mother organised a trip to the cinema for her and her brother in advance of the lunch. Sole survivor gives details about the lunch Reverend Wilkinson told the court Heather and Gail offered to help plate up the food, but Patterson rejected the offer. Each plate had a serving of mashed potatoes, green beans and an individual beef wellington. Patterson said the mushrooms were a mixture of button mushrooms from a supermarket and dried mushrooms bought at an Asian grocery store several months before, which were in a hand-labelled packet. Reverend Wilkinson said the four guests were given large grey dinner plates, while Patterson ate from a smaller, tan-coloured plate. He said he remembered his wife pointing this out after they became ill. The reverend said he and his wife ate their full servings, while Don ate his own and half of his wife's. Reverend Wilkinson said that after the meal, Patterson told them she had been diagnosed with cancer, suggesting the lunch was put together so that she could ask them the best way to tell her children about the illness. The prosecution said she did this to justify the children's absence. The defence does not dispute that Patterson lied about having cancer. When asked why she lied about her health, Patterson told the court it was partly to elicit sympathy from her husband's relatives, as she felt they were growing apart. \"I didn't want their care of me to stop, so I kept it going. I shouldn't have done it,\" she said, adding: \"I did lie to them.\" Defendant wanted to serve 'something special' While on the stand at the beginning of June, Patterson said she might have accidentally included foraged mushrooms in the fatal lunch. She said she brought expensive ingredients and researched ideas to find \"something special\" to serve. She said she deviated from her chosen recipe to improve the \"bland\" flavour. However, she denied that a series of photos showing mushrooms placed on weighing scales in her kitchen was evidence she had been measuring a \"fatal dose\" to serve to her lunch guests. Prosecutor Nanette Rogers asked: \"I suggest that you were weighing these death cap mushrooms so that you could calculate the weight required for the administration of a fatal dose for one person. Agree or disagree?\" \"Disagree,\" Patterson replied. The mother of two said she began foraging for mushrooms around the towns of Korumburra and Leongatha during the COVID lockdowns in 2020 and would use a food dehydrator to dry and preserve them. Prosecutors earlier claimed the defendant denied ever owning a food dehydrator, but police traced one owned by her to a nearby dump. It was later found to contain death cap mushrooms. The death cap is one of the most toxic mushrooms on the planet and is involved in the majority of fatal mushroom poisonings worldwide.  The species contains three main groups of toxins: amatoxins, phallotoxins, and virotoxins.  From these, amatoxins are primarily responsible for the toxic effects in humans.  The alpha-amanitin amatoxin has been found to cause protein deficit and ultimately cell death, although other mechanisms are thought to be involved.  The liver is the main organ that fails due to the poison, but other organs are also affected, most notably the kidneys.  The effects usually begin after a short latent period and include gastrointestinal disorders followed by jaundice, seizures, coma, and, eventually, death.  Two mobile phones she owned were also reset to factory status three times. Patterson told the court she disposed of the dehydrator before a visit from child protection, who were investigating her living arrangements. She said the phones were wiped because she panicked during the police investigation. \"I was scared of the conversation that might flow about the meal and the dehydrator,\" she said. \"I was scared they would blame me for it, for making everyone sick. I was scared that they would remove the children.\" Patterson talks through tears Lawyer Mr Mandy also questioned Patterson about a series of expletive-laden messages she sent to friends about the Patterson family. \"I wish I'd never said it. I feel ashamed for saying it and I wish that the family didn't have to hear that I said that,\" Patterson told the court about the messages. Talking through tears, she added: \"I was really frustrated with Simon, but it wasn't Don and Gail's fault.\" The court previously heard the relationship between Patterson and her estranged husband deteriorated shortly before the murders due to a disagreement over child support. Patterson's children 'ate leftovers after guests went to hospital' All four victims fell ill and were experiencing severe vomiting and diarrhoea by midnight on the day of the lunch. Police previously said the symptoms of all four of those who became ill were consistent with poisoning from death cap mushrooms, which are responsible for 90% of all toxic mushroom-related fatalities. Patterson said she also became unwell hours after eating the meal, but claimed she wasn't as ill as her guests because she had vomited due to an eating disorder. Her daughter, according to the ABC, told the court she remembers Patterson telling her she had diarrhoea that night. Patterson claimed she and her children ate leftovers from the beef wellington on the same day. Her daughter told the court she remembered this, and that her mum didn't eat much because she was still feeling unwell. The mum said she scraped the mushrooms off the plates in advance because she knew her children didn't like them. Patterson went to hospital two days after the lunch, where she initially discharged herself against medical advice, the court was told. A nurse at the hospital where she was treated told the court she \"didn't look unwell like Ian and Heather\", who were at the same hospital. Read more:Murder of woman exposes date-to-rob crime syndicateInside the recovered sunken Bayesian superyacht Gail and Heather died on Friday 4 August 2023, while Don died a day later. Reverend Wilkinson spent seven weeks in hospital but survived. Days after the deaths, police opened a homicide investigation and confirmed Patterson was a suspect. She was charged on 2 November 2023 and convicted in July 2025."
    }
]