[
    {
        "title": "Trump's words designed to stoke tension, confuse and apply intense pressure on Iran",
        "description": "This is the highest stakes diplomacy via social media.&#160;",
        "url": "https://news.sky.com/story/trumps-words-designed-to-stoke-tension-confuse-and-apply-intense-pressure-on-iran-13385097",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-g7-donald-trump-air-force-one_6944158.jpg?20250617102215",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-06-17 16:43:00",
        "Headline": "Donald Trump posted on Truth Social that the US knows where Iranian Supreme Leader Ali Khamenei is \"hiding,\" and that he was an \"easy target\" but said the US would not kill him - \"at least not for now\". It's a real-time version of his maximum pressure diplomacy.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n This is the highest stakes diplomacy via social media.  The American president just posted on his Truth Social platform: \"We know exactly where the so-called 'Supreme Leader' is hiding. \"He is an easy target, but is safe there - We are not going to take him out (kill!), at least not for now. But we don't want missiles shot at civilians, or American soldiers. \"Our patience is wearing thin. Thank you for your attention to this matter!\" Israel-Iran live: Trump says US knows where Iran's supreme leader is 'hiding' It was followed minutes later by \"UNCONDITIONAL SURRENDER!\" In real-time, we are witnessing Donald Trump's extreme version of maximum pressure diplomacy. He'd probably call it the 'art of the deal', but bunker busters are the tool, and it comes with such huge consequences, intended and unintended, known and unknown. Read more:The bunker buster bomb which could destroy Iran's nuclear ambitions  There is intentional ambiguity in the president's messaging. His assumption is that he can apply his 'art of the deal' strategy to a deeply ideological geopolitical challenge. It's all playing out publicly. Overnight, the New York Times, via two of its best-sourced reporters, had been told that Mr Trump is weighing whether to use B-2 aircraft to drop bunker-busting bombs on Iran's underground nuclear facilities. Meanwhile, Axios was reporting that a meeting is possible between Trump's envoy Steve Witkoff and Iran's foreign minister Abbas Araghchi. The reporting came just as Mr Trump warned \"everyone in Tehran to evacuate\". The nuclear sites being threatened with bunker busters are not in Tehran, but Trump's words are designed to stoke tension, to confuse and to apply intense pressure. His actions are too. He left the G7 in Canada early and asked his teams to gather in the White House Situation Room.  This is a game of smoke, mirrors, brinkmanship and - maybe - bluff. In Tehran, what's left of the leadership is watching and reading closely as they consider what's next. Maybe the Supreme Leader and his regime's days are numbered. Things remain very unpredictable. From history, though, regime change, even when it comes with a plan - and there is certainly not one here, spells civil war and from that comes a refugee crisis. These are truly tense and chaotic times."
    },
    {
        "title": "Police admit failures in Harry Dunn case after report finds officers prioritised suspect's welfare",
        "description": "Northamptonshire Police has admitted it failed Harry Dunn and his family after a report found officers prioritised the welfare of the suspect in the case over the investigation.",
        "url": "https://news.sky.com/story/police-admit-failures-in-harry-dunn-case-after-report-finds-officers-prioritised-suspects-welfare-13385168",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-harry-dunn-anne-sacoolas_6264477.jpg?20230827094558",
        "type": "Home",
        "Author": "Shamaan Freeman-Powell",
        "Date Published": "2025-06-17 18:50:00",
        "Headline": "An independent review has criticised the force's senior leadership for their handling of the case.  The 19-year-old died in 2019 after US state department employee Anne Sacoolas crashed into the motorbike he was driving near a military base.",
        "Content": "\n          Midlands correspondent\n              @Shamaan_SkyNews\n Northamptonshire Police has admitted it failed Harry Dunn and his family after a report found officers prioritised the welfare of the suspect in the case over the investigation. The 19-year-old died in 2019 after US state department employee Anne Sacoolas – who was driving a car on the wrong side of the road – hit his motorbike near RAF Croughton in Northamptonshire. However, Sacoolas was not immediately arrested following the crash and was able to flee the country, claiming diplomatic immunity, because police did not believe a \"necessity test\" had been met. An independent report, published on Wednesday, has now criticised the force's senior leadership for their handling of the case – including describing its former chief constable as having a \"detrimental\" impact. Harry Dunn's mother Charlotte Charles said she welcomed the findings. She told Sky News: \"Unfortunately, we were treated extremely poorly. All the authorities wanted to shut us down... \"This report does validate everything, of the way we felt and everything that we've been put through. To be treated as we were, as the victims of a serious crime, we were let down really, really badly.\" Following a long fight for justice by Mr Dunn's family, Sacoolas eventually pleaded guilty to causing death by careless driving via video link at the Old Bailey in December 2022. She later received an eight-month prison sentence, suspended for 12 months.  Following the report, Assistant Chief Constable Emma James said in a statement: \"On behalf of Northamptonshire Police, I want to apologise to Harry's family for what is now clear was a failure on our part to do the very best for the victim in this case, Harry, and his family who fought tirelessly in the years that followed to achieve justice for him. \"The picture which emerges is one of a force which has failed the family on a number of fronts\". She also added: \"It was vitally important that Northamptonshire Police conducted this review into the most high-profile case in the force's history, a case where clear and significant shortcomings have now been properly and independently unearthed.\" The report, which has 38 recommendations, found that Nick Adderley, who was sacked as head of the force last year after lying about his military record, had caused a breakdown in relations with Mr Dunn's family. It also revealed that his \"erroneous statements\" about Sacoolas's immunity status led the Foreign Office to contact the force asking him not to repeat them. Read more:Harry Dunn's family's fight for justice never wavered'I couldn't have asked for a better brother', Harry's twin tells inquest Danielle Stone, the Police, Fire and Crime Commissioner for Northamptonshire, said Mr Adderley's behaviour was \"unfathomable\". She added that the report \"makes really clear his culpability.\" The report also said Northamptonshire Police potentially had a culture of not arresting suspects \"in circumstances such as these, which could lead to evidence not being obtained\". It recommended that the force adopt an \"investigative mindset\" over serious road crashes. Regarding the decision not to arrest Sacoolas, the report said the decision had not been \"explained in enough detail\". It added: \"The overriding factor in the decision appears to be the welfare of the suspect and her suffering from shock, with little to no consideration around the full necessity test under the Police and Criminal Evidence Act. \"A prompt and effective investigation was not considered or articulated. The view is that in these circumstances the suspect could and should have been arrested to assist the evidence-gathering process.\" The report continued: \"The duty (police sergeant) made the decision not to arrest. \"The rationale was largely based on a belief that the necessity test was not met, and information received that Anne Sacoolas was in shock. \"Whilst the welfare of any person is a concern for officers, this should not have prevented the arrest of Anne Sacoolas.\" Ms Charles, who was recently honoured with an MBE after her campaigning efforts led to road safety improvements near US airbases, said: \"I don't think you're ever done grieving. There's never any closure to losing a child. You live with it, it's so profound. \"So the only thing I would ever say to anybody else who feels that they've got a fight ahead of them, dig deep, do your best, because you just never know the resilience that you've got until you absolutely have to find it.\""
    },
    {
        "title": "Battle to convince MPs to back benefit cuts to more than three million households ",
        "description": "Plans for cuts to benefits which will impact more than three million households will be published today - as the government faces a battle to convince dozens of Labour MPs to back them.",
        "url": "https://news.sky.com/story/battle-to-convince-mps-to-back-benefit-cuts-to-more-than-three-million-households-13385195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-welfare-benefits-health-disability_6859245.jpg?20250317023130",
        "type": "Home",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-17 19:46:00",
        "Headline": "Under pressure from Labour MPs concerned particularly that changes to PIP will drive families into poverty, Liz Kendall will announce new protections in the bill today.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Plans for cuts to benefits which will impact more than three million households will be published today - as the government faces a battle to convince dozens of Labour MPs to back them. Liz Kendall, the welfare secretary, has set out proposals to cut £5bn from the welfare budget - which she has said is \"unsustainable\" and \"trapping people in welfare dependency\". Disabled people claiming PIP, the personal independence payment which helps people - some of them working - with the increased costs of daily living, face having their awards reviewed from the end of next year. An estimated 800,000 current and future PIP recipients will lose an average of £4,500 a year, according to a government assessment.  The government also intends to freeze the health element of Universal Credit, claimed by more than two million people, at £97 a week during this parliament, and cut the rate to £50 for new claimants. Under pressure from Labour MPs concerned particularly that changes to PIP will drive families into poverty, Ms Kendall will announce new protections in the bill today. Sky News understands they include a 13-week transition period for those losing PIP; a higher rate of Universal Credit for people with the most serious conditions; and a commitment that disabled people who take a job will not immediately lose their benefits. \n                  First Minister John Swinney says winter fuel payment in Scotland 'will not be less than UK benefit'\n                 \n                  Ministers on resignation 'watch-list' over welfare reforms\n                 \n                  Economy shock overshadows Reeves' big day\n                 Some 40 Labour MPs have signed a letter refusing to support the cuts; and dozens of others have concerns, including ministers.  Ms Kendall is determined to press ahead, and has said the number of new PIP claimants has doubled since 2019 - at 34,000, up from 15,000. Ministers say 90% of current claimants will not lose their benefits; and that many people will be better off - with the total welfare bill set to continue to rise over this parliament. To keep the benefit, claimants must score a minimum of four points out of eight on one of the daily living criteria. Ministers say claimants with the most serious conditions, who cannot work, will not face constant reassessments. A £1bn programme is proposed, intended to give disabled people who can work tailored support to find jobs. Some Labour MPs have angrily opposed the reforms - which will be voted on later this month. Last night in a parliamentary debate, Labour MP for Poole Neil Duncan-Jordan disputed the Department for Work and Pensions (DWP) figures. Read More:Minister tells MPs controversial disability benefit reforms will go aheadBig benefits cuts are imminent - here's what to expect He said: \"We already know that PIP is an underclaimed benefit. The increase in claims is a symptom of declining public health and increased financial hardship disabled people are facing. \"We have the same proportion of people on working-age benefits as in 2015. This is not an economic necessity, it's a political choice.\" Rachael Maskell, Labour MP for York, called the proposals \"devastating \". She said: \"We must change direction and not proceed with these cuts.\" Disability groups say they fear an increase in suicides and mental health conditions. The government's own assessment forecast an extra 250,000 people could be pushed into poverty - including 50,000 children. It did not include the impact of people moving into work. Ms Kendall was urged by MPs on the Commons Work and Pensions committee to delay the reforms, to carry out an impact assessment, but wrote back to the committee saying the reforms were too urgent to delay - and that MPs would be able to amend the legislation."
    },
    {
        "title": "Missing teen Cole Cooper: Grieving mum alleges 'third party' involved in death",
        "description": "The grieving mother of a Scottish teen who vanished for a month has told Sky News she believes a \"third party\" was involved in her son's death.",
        "url": "https://news.sky.com/story/missing-teen-cole-cooper-grieving-mum-alleges-third-party-involved-in-death-13385058",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-cole-cooper-scotland_6944503.jpg?20250617164210",
        "type": "Home",
        "Author": "Connor Gillies",
        "Date Published": "2025-06-17 15:36:00",
        "Headline": "Cole, 19, had been missing for four weeks before he was discovered dead in woods near Falkirk earlier this month.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  The grieving mother of a Scottish teen who vanished for a month has told Sky News she believes a \"third party\" was involved in her son's death. Cole Cooper, 19, was discovered dead in woods near Falkirk earlier this month following a missing persons inquiry his relatives don't believe was taken seriously enough by police. He was last seen on CCTV in May after leaving a house party, but police later revealed a former school friend had spoken to Cole a few days later nearby. Speaking exclusively to Sky News, his mum Wendy Stewart, 42, has revealed her son had \"various arguments\" in the days and hours before he disappeared. In an emotional interview, she said: \"He was only 19, he should never have been taken. I am never going to see him again. I never got a chance to give him a last cuddle and hold his hand. \"Someone has taken that away from me far too soon. Whether it be intentionally or unintentionally, I do believe there has been some involvement by a third party and the result is the death of Cole.\" The family, who organised a local vigil in Cole's memory last weekend, have vowed to get \"justice\". \n                  Double shooting suspect 'fled through three countries in 15 hours', Spanish police claim\n                 \n                  Man, 27, pleads guilty to murdering and decapitating girlfriend\n                 \n                  Dozens to be rehomed and building earmarked for demolition after fatal Perth fire\n                 Asked what that means, Ms Stewart told Sky News: \"Finding the culprit and getting justice that way. Finding the person that is responsible for the death of my child.\" Police previously said 400 residents were spoken to during door-to-door enquires and more than 2,000 hours of CCTV footage was collected. The 19-year-old's death is being treated as \"unexplained\". Read more from Sky News:Council apologises amid school Union Flag rowWinter fuel payment in Scotland 'will not be less than UK benefit' Cole's aunt Aimee Tennie, 32, revealed the family's anger over the police handling of the case as they attempt to find out what happened. She said: \"We are aware of small details surrounding the weekend leading up to it with arguments. He had a few arguments over that weekend. We want the details re-examined thoroughly.\" Sky News put all of the family's concerns and allegations to Police Scotland. The force swerved our questions and responded saying: \"Enquiries remain ongoing.\" Wendy Stewart claimed the probe has been handled \"shockingly\" with a failure to take her son's disappearance seriously. The 42-year-old said: \"I have had to scream and shout from rooftops to be heard by the police. I don't think they have handled it well. \"The police really need to take accountability and listen to families, they are reporting a missing child and understand the family knows their child best.\" Cole Cooper's loved ones still have not been told when his body will be released to allow them to lay him to rest."
    },
    {
        "title": "Kellogg's, Coca-Cola and Brewdog beer on Russian shelves despite sanctions",
        "description": "Kellogg's cornflakes, Bonne Maman jam, Kent Crisps, Brewdog beer... these are the items on the supermarket shelves in front of me.&#160;",
        "url": "https://news.sky.com/story/kelloggs-coca-cola-and-brewdog-beer-on-russian-shelves-despite-sanctions-13385079",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-russia-sanctions_6944560.jpg?20250617172912",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-17 16:11:00",
        "Headline": "Russia is the most sanctioned economy in the world, but more than three years into its supposed isolation the shelves are still stocked with Western goods.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Kellogg's cornflakes, Bonne Maman jam, Kent Crisps, Brewdog beer... these are the items on the supermarket shelves in front of me.  I'm in a branch of Azbuka Vkusa (or 'Alphabet or Taste') in Moscow, where the aisles look remarkably like those in a Tesco, Sainsbury's or Waitrose. Russia is the most sanctioned economy in the world, but here we are, more than three years into its supposed isolation, and the shelves are still stocked with Western goods. So how come? Many of the products on sale here are what are called 'parallel imports'. That means they've entered Russia via third countries, without the trademark owner's permission. Russia legalised the practice soon after its invasion of Ukraine to sidestep sanctions and to shield consumers from the impact of a mass exodus of foreign brands. So despite companies pulling out of Russia, their products can often still be found here. Take Coca-Cola for example. It stopped selling to Russia and ceased operations here in 2022, but there's no problem buying its drinks. Next to each other on the supermarket shelf, I found one can from France, one from Poland, one from Iraq and even a bottle from the UK. \"Please recycle me,\" the cap hopefully implores. Like other businesses that say they have not authorised imports of their brands into Russia, there's little Coca-Cola can do about it. The company declined a request to comment. This specifically isn't sanctions-busting, since food and drink are generally exempt from the restrictions imposed by Britain and the EU. It is, however, an example of how trade bans (self-imposed, in this case) can be circumvented. And the very same practice is being used on some sanctioned goods, like luxury cars. At Frank Auto, a glitzy car showroom in northwest Moscow, there's a Porsche Cayenne Coupe, a Mercedes EQE and a BMW X5. All are under two years old, i.e. younger than the sanctions regime that was designed to keep them out. \"Germany officially does not know that we import cars for clients from Russia,\" Irina Frank, the dealership owner, tells me unashamedly. \"It's done through multiple moves. An order is placed, for example, from Turkey, then from Turkey it goes to Armenia, and from Armenia we deliver the car to Russia.\" She explains that the cars are imported to order, because of the cost involved and the uncertainty. \"Now, every transaction is checked, and there were cases when you even lost all the money, and cannot take the car out,\" she says. But it's clearly still possible. In February, Irina sold a Ferrari Purosangue to a customer who paid 130 million roubles (1.43 million euros) - 30% more than what it would have cost without sanctions, she says. And she even claims to have sold Range Rovers from Britain. \"Russia, you know, is a special country. Our people really love everything that is the most expensive, the coolest, in the maximum configuration,\" she adds. Sky News has reported extensively on how British and European cars are still entering Russia despite sanctions. But this is the first time we've spoken to some of those who have imported them. In a car park in front of Moscow's Belarussky train station, we meet Ararat Mardoyan, who owns a car brokerage firm called Autodegustator. He says he imported dozens of British and European cars into Russia during the first two years of the war, including his own vehicle.  His black Volkswagen took six months to arrive from Germany, after being shipped via Belgium, Georgia, Armenia and Iran. \"You're not doing anything wrong,\" he insists, when I ask if he's helping Russia avoid sanctions. He refers to the Eurasian Economic Union as justification - a customs union which Russia shares with Armenia, Belarus, Kazakhstan and Kyrgyzstan. \"It's like [the] European Union,\" he argues. \"If the good hits Kazakhstan, for example, it's already not only a Kazakh product, it's already a product of customs union.\" I suggest that such moves are not in the spirit of sanctions, and that some would question the morality of it. \"I don't think it's something from the sphere of immorality. It's business,\" he says. \"People have to work and survive.\" Ararat stopped importing European cars at the start of last year because of increased risks and decreasing profits, citing how he had to scrap an entire fleet of Range Rovers after their diagnostic systems were blocked as soon as they were switched on. But he doesn't believe the practice will ever cease, no matter how pricey and problematic it becomes. \"People who want to drive Ferrari,\" he says, \"they always have the money, and where there is the demand, there will always be supply.\" \"This is like a globalised world. I don't believe there's any chance of isolating Russia. It's not possible.\""
    },
    {
        "title": "Fat injections and Brazilian butt lifts 'offered in public toilets', experts warn",
        "description": "Fat injections, Brazilian butt lifts (BBLs), Botox and fillers are being offered by untrained people in places such as public toilets, officials have warned.",
        "url": "https://news.sky.com/story/fat-injections-and-brazilian-butt-lifts-offered-in-public-toilets-experts-warn-13385230",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-female-toilet_6944822.jpg?20250618004425",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-17 21:05:00",
        "Headline": "Trading standards leaders say there is a need for urgent government action over a \"wild west\" of unregulated and unlicensed practitioners and treatments, as well as where they can be offered.",
        "Content": "Fat injections, Brazilian butt lifts (BBLs), Botox and fillers are being offered by untrained people in places such as public toilets, officials have warned. Trading standards leaders say there is a need for urgent government action over a \"wild west\" of unregulated and unlicensed practitioners and treatments, as well as where they can be offered. The Chartered Trading Standards Institute (CTSI) said it uncovered \"shocking\" locations where procedures such as fillers are being administered, including \"pop-up\" shops on high streets, cubicles in public toilets and hotel rooms. It said these locations fall outside typical business premises, making taking action difficult. The CTSI also said \"unsafe and unregulated\" fillers were available for sale online for as little as £20. It also noted growing concerns over fat-dissolving injections, such as Lemon Bottle, which have \"little to no regulatory oversight to ensure their safe use by the public\". It said there was a \"postcode lottery\" across the UK in the minimum age at which such procedures can be carried out, with young people crossing borders for treatment. The CTSI said lives could be at risk amid the \"major gaps\" in regulation on who is responsible for the products and procedures. It claims there is no data available on how often the NHS is having to deal with infections and life-threatening complications when things go wrong. The CTSI warned the public to check the qualifications of people offering cosmetic procedures, to be wary of people advertising on social media and urged them not to buy products to use at home. Read more from Sky News:Man who murdered two women on Christmas Day jailedElon Musk posts 'negative drug test results'New York mayoral hopeful arrested by ICE agents 'Lives are being put at risk every single day' Kerry Nicol, external affairs manager at the CTSI, said: \"I am genuinely shocked by the scale of potential harm facing the public due to the alarming lack of regulation in the aesthetic industry. Consumers' lives are being put at risk every single day. She added: \"Alarm bells would ring if someone was offering a tattoo in someone's kitchen or a public toilet at a cheap price - so those are the alarm bells we need ringing for people offering facial injections in these kinds of settings.\" Regulations 'inadequately policed and enforced' Ashton Collins, director at Save Face, a register of accredited practitioners, said: \"Since 2023, we have been campaigning for the government to ban liquid BBLs from the high street and restrict their administration to qualified plastic surgeons.\" She added: \"For too long, regulations intended to safeguard patients have been inadequately policed and enforced.\" A Department of Health and Social Care spokesperson said: \"People's lives are being put at risk by inadequately trained operators in the cosmetic sector, which is why the government is looking into new regulations to protect people. \"The safety of patients is paramount and we urge anyone considering cosmetic procedures to consider the possible health impacts and find a reputable, insured and qualified practitioner.\""
    },
    {
        "title": "MPs vote to decriminalise abortion in England and Wales",
        "description": "MPs have voted to decriminalise abortion in England and Wales.",
        "url": "https://news.sky.com/story/mps-vote-to-decriminalise-abortion-in-historic-vote-13385137",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abortion-pro-choice_6943985.jpg?20250617033322",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-06-17 17:54:00",
        "Headline": "The amendment to the Crime and Policing Bill, abolishing the prosecution of women in England and Wales for terminating their pregnancy at any stage, passed by 379 votes to 137.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  MPs have voted to decriminalise abortion in England and Wales. The amendment to the Crime and Policing Bill, abolishing the prosecution of women for terminating their pregnancy at any stage, passed by 379 votes to 137. It represents the biggest shake-up in reproductive rights for almost 60 years. Labour MP Tonia Antoniazzi, who tabled the so-called \"New Clause One\" (NC1), said it would ensure women do not face investigation, arrest, prosecution or imprisonment in relation to any pregnancies. She said the current \"Victorian\" laws had been used against vulnerable women, citing cases such as Nicola Packer, who was prosecuted on suspicion of having an illegal abortion. She was found not guilty in May. \"Nicola's story is deplorable, but there are many others,\" Ms Antoniazzi said. Abortion in England and Wales is currently a criminal offence but is legal with an authorised provider for up to 24 weeks after conception. The procedure is allowed after this time in very limited circumstances. It is also legal to take prescribed related medication at home if a woman is less than 10 weeks pregnant. Ms Antoniazzi said NC1 was \"a narrow, targeted measure\" that would not change how abortion services were provided or the rules under the 1967 Abortion Act. She said: \"The 24 [week] limit remains. Abortions still require the approval of signatures of two doctors, and women would still have to meet the grounds laid out in the Act.\" The MP said that meant healthcare professionals \"acting outside the law and abusive partners using violence or poisoning to end a pregnancy would still be criminalised, as they are now.\" She added: \"This piece of legislation will only take women out of the criminal justice system because they are vulnerable and they need our help. \"As I have said before, and I will say it again, just what public interest is this serving? This is not justice, it is cruelty and it has got to end.\"  The change will not come into effect immediately as the Crime and Policing Bill is still making its way through Parliament. A separate amendment, put forward by Labour MP Stella Creasy, went further with a measure to \"lock in\" the right of a person to have an abortion while protecting those who help them. However, her amendment was not voted on because Ms Antoniazzi's passed, as expected. Conservative MP Sir Edward Leigh, speaking against both amendments, described them as \"not pro-woman\" and argued they \"would introduce sex-selective abortion\". How did MPs vote? MPs were given a free vote on the amendment, as is typically the case with so-called matters of conscience. A breakdown of the vote showed it was passed overwhelmingly by Labour and Lib Dem MPs. Read more:Sky poll reveals public's view on decriminalisation Just eight Conservative MPs voted in favour, while all Reform UK MPs opposed the amendment, with the exception of the party's leader Nigel Farage, who abstained. Sir Keir Starmer was not present for the vote as he is currently in Canada for the G7 summit, but said earlier that his \"longstanding in-principle position is that women have the right to a safe and legal abortion\". The issue of women investigated by police over suspected illegal abortions has been in the spotlight due to several recent high-profile cases. Ms Packer was cleared by a jury last month after taking prescribed abortion medicine at home when she was around 26 weeks pregnant, beyond the legal limit of 10 weeks. In the Commons, Ms Antoniazzi cited another case of a young mother who was jailed for two years after she was forced to take illegal abortion medication by her abusive partner. He was never investigated."
    },
    {
        "title": "Sir Keir Starmer hits out at politicians who 'shout and scream but do nothing' over grooming gangs",
        "description": "Sir Keir Starmer has said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry. ",
        "url": "https://news.sky.com/story/sir-keir-starmer-hits-out-at-politicians-who-shout-and-scream-but-do-nothing-over-grooming-gangs-13385032",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-g7-summit_6944456.jpg?20250617154856",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:51:00",
        "Headline": "The prime minister defended accusing the Tories of 'jumping on a far right bandwagon' when the called for a national inquiry into grooming gangs in January, as they did not launch one while in goverment. ",
        "Content": " Sir Keir Starmer has said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry.  Speaking to Sky News's political editor Beth Rigby, the prime minister was asked if he regretted saying in January that those calling for a national probe into paedophile rings were \"jumping on a far-right bandwagon\" - given he has now agreed to one.  Politics latest: Baroness Casey asks people to 'keep calm' about grooming gang ethnicity data Sir Keir said he was \"really clear\" he was talking about the Tories, who were demanding an inquiry they never set up when they were in government. He said: \"I was calling out those politicians. \"I am frustrated with politics when people shout and scream a lot and do nothing when they've got the opportunity to do it. It's one of the worst aspects of politics, in my view.\" Sir Keir also said there \"must be accountability\" for authorities who \"shied away\" from talking about the ethnicity of perpetrators for fear of being branded racist, as exposed in a report by Baroness Casey published on Monday.  \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  MPs vote to decriminalise abortion in England and Wales\n                 \n                  'Britain's darkest secret': Grooming survivor calls for apology from Starmer\n                 Asked if he is happy for \"social workers, policemen and people that failed\" to be held accountable, the prime minister said: \"Where the inquiry uncovers failure or wrongdoing, then there should absolutely be accountability. \"That is amongst the purposes of an inquiry, and it's a statutory inquiry... which will therefore mean there is power to compel evidence of witnesses because it's important that it is comprehensive and important that it gets to every single issue. And as part of that process, there's accountability for individuals who did wrong.\"  Baroness Casey was asked to produce an audit of sexual abuse carried out by grooming gangs in England and Wales in January, when comments by tech billionaire Elon Musk brought the scandal back into the spotlight. The government initially resisted calls from the Tories for a national inquiry into grooming gangs, saying they wanted to focus on implementing the recommendations of Professor Alexis Jay's seven-year review into child abuse. The review concluded in 2022 but the Conservatives did not implement its recommendations before they lost the election last July. Read More:Grooming gangs report author says 'do-gooders' giving racists 'more ammunition'Nationwide police operation on grooming gangs announced The government's position has changed following Baroness Casey's audit, which recommended an inquiry. Her report found that ethnicity data is not recorded for two-thirds of grooming gang perpetrators. However at a local level in three police forces - Greater Manchester, South Yorkshire and West Yorkshire - \"there has been a disproportionality of group-based child sexual exploitation offending by men of Asian ethnicity\". The cross bench peer said instead of looking into whether ethnicity or cultural factors played a part, authorities \"avoided the topic altogether for fear of appearing racist\", and this warranted further investigation."
    },
    {
        "title": "'Britain's darkest secret': Grooming survivor calls for apology from Starmer",
        "description": "A rape survivor who was abused by dozens of men has called on the prime minister to apologise for the delay in calling for a national inquiry into the grooming scandal.",
        "url": "https://news.sky.com/story/britains-darkest-secret-grooming-survivor-calls-for-apology-from-starmer-13385143",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rotherham-rape_6944698.jpg?20250617201707",
        "type": "Home",
        "Author": "Becky Johnson",
        "Date Published": "2025-06-17 18:01:00",
        "Headline": "\"Elizabeth\", whose name we have changed to protect her identity, also believes that had the authorities been prepared to confront concerns about the ethnicity of offenders and investigate communities more closely, she could have been spared the abuse she suffered.",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  A rape survivor who was abused by dozens of men has called on the prime minister to apologise for the delay in calling for a national inquiry into the grooming scandal. \"Elizabeth\", whose name we have changed to protect her identity, was abused by a gang of men in Rotherham from the age of 14. She was also trafficked to other cities and says she was raped by so many men over the course of more than three years she doesn't know the exact number. She says all her abusers were of Pakistani heritage. After Louise Casey's explosive report revealed the ethnicity of perpetrators had been shied away from by the authorities, Elizabeth says Sir Keir Starmer owes survivors an apology \"not just for holding back on the inquiry, because he could have done this six months ago, but also for the insults that followed\". She says it was incorrect of the prime minister to accuse people of jumping on a \"far-right bandwagon\". \"Survivors and families have not done that. You have whistleblowers, you know, it's concerned people wanting justice for child abuse,\" she says. She also believes that had the authorities been prepared to confront concerns about the ethnicity of offenders and investigate communities more closely, she could have been spared the abuse she suffered. \"Going back, the intelligence, everything, I should never have been a victim,\" she says. Read more from Sky News:Man who murdered two women on Christmas Day jailedElon Musk posts 'negative drug test results'New York mayoral hopeful arrested by ICE agents Many are angry it has taken 11 years for politicians to accept the issue Shockingly, in Rotherham, the truth has been known for more than a decade. In 2014 a report by Alexis Jay, who went on to chair a national inquiry into the wider issue of child sexual exploitation, found there were at least 1,400 victims of grooming in the town, with the perpetrators predominantly of Pakistani heritage.  Many here, including Elizabeth, are angry it has taken 11 years for politicians to accept the issue, despite scandals emerging in a number of towns and cities across Britain. \"It's a question still that needs to be answered. I do think it was because they wanted to be politically correct,\" she says. 'They silenced the wrong people' She's disappointed but unsurprised by the revelation that Whitehall officials wanted to help the authorities in Rotherham cover up the scandal: \"It does explain a lot because I've always thought that how organised Rotherham was - how possibly could they have pulled it off themselves?\" She believes the result of years of denial by the authorities has meant perpetrators were protected. She describes the survivors of grooming as \"Britain's darkest secret\", adding, \"they silenced the wrong people and we need the truth. Why did they do it?\". Sir Keir 'frustrated' with politicians who 'shout and scream but do nothing' Sir Keir said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry.  Speaking to Sky News's political editor Beth Rigby, the prime minister was asked if he regretted saying in January that those calling for a national probe into paedophile rings were \"jumping on a far-right bandwagon\" - given he has now agreed to one. Sir Keir said he was \"really clear\" he was talking about the Tories, who were demanding an inquiry they never set up when they were in government. He said: \"I was calling out those politicians. I am frustrated with politics when people shout and scream a lot and do nothing when they've got the opportunity to do it. It's one of the worst aspects of politics, in my view.\""
    },
    {
        "title": "Single ticket-holder from Ireland wins EuroMillions jackpot",
        "description": "A single ticket-holder from Ireland has won the 250 million euro EuroMillions jackpot, the Irish National Lottery said.",
        "url": "https://news.sky.com/story/single-ticket-holder-from-ireland-wins-euromillions-jackpot-13385031",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:50:00",
        "Headline": "The winning numbers from Tuesday's draw - which had rolled over several times - were 13, 22, 23, 44 and 49, with lucky stars 3 and 5.",
        "Content": "A single ticket-holder from Ireland has won the 250 million euro EuroMillions jackpot, the Irish National Lottery said. Ireland's lottery said it was the \"biggest ever EuroMillions jackpot,\" and its chief executive said it would reveal the winning location soon. The winning numbers from Tuesday's draw - which had rolled over several times - were 13, 22, 23, 44 and 49, with lucky stars 3 and 5. The EuroMillions jackpot is capped once it reaches 250 million euros - or £208m. According to the EuroMillions website, Tuesday's jackpot was £213.65 million. It added there were a total of 3,959,140 winners. In total, more than 92,000 players in Ireland won prizes in the EuroMillions and Plus games. Irish National Lottery chief executive Cian Murphy said: \"We are absolutely thrilled to see this incredible and record win for an Irish EuroMillions player. \n                  EuroMillions: UK's biggest lottery prize is still up for grabs\n                 \n                  EuroMillions ticketholder in UK stakes claim for £65m jackpot\n                 \n                  UK winner receives third biggest EuroMillions jackpot\n                 \"We are advising our players to check their tickets and, if they are the winner, sign the back of the ticket, keep it safe, and contact National Lottery HQ and we will guide you through the claims process.\" Read more from Sky News:Trump considering US strike on Iran, officials sayElon Musk posts 'drug test results'23andMe fined millions by UK watchdog Mr Murphy added that \"with such a big win we have procedures to follow, but we will reveal the winning location as soon as we can\". \"While this is a massive win, it can come as a shock to a winner and we advise them to stay calm, get independent legal and financial advice and contact us as soon as they can.\" Two British players, meanwhile, took home prizes of £6,287,001.20 for having the five winning numbers and one of the lucky stars."
    },
    {
        "title": "Police admit failures in Harry Dunn case after report finds officers prioritised suspect's welfare",
        "description": "Northamptonshire Police has admitted it failed Harry Dunn and his family after a report found officers prioritised the welfare of the suspect in the case over the investigation.",
        "url": "https://news.sky.com/story/police-admit-failures-in-harry-dunn-case-after-report-finds-officers-prioritised-suspects-welfare-13385168",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-harry-dunn-anne-sacoolas_6264477.jpg?20230827094558",
        "type": "UK",
        "Author": "Shamaan Freeman-Powell",
        "Date Published": "2025-06-17 18:50:00",
        "Headline": "An independent review has criticised the force's senior leadership for their handling of the case.  The 19-year-old died in 2019 after US state department employee Anne Sacoolas crashed into the motorbike he was driving near a military base.",
        "Content": "\n          Midlands correspondent\n              @Shamaan_SkyNews\n Northamptonshire Police has admitted it failed Harry Dunn and his family after a report found officers prioritised the welfare of the suspect in the case over the investigation. The 19-year-old died in 2019 after US state department employee Anne Sacoolas – who was driving a car on the wrong side of the road – hit his motorbike near RAF Croughton in Northamptonshire. However, Sacoolas was not immediately arrested following the crash and was able to flee the country, claiming diplomatic immunity, because police did not believe a \"necessity test\" had been met. An independent report, published on Wednesday, has now criticised the force's senior leadership for their handling of the case – including describing its former chief constable as having a \"detrimental\" impact. Harry Dunn's mother Charlotte Charles said she welcomed the findings. She told Sky News: \"Unfortunately, we were treated extremely poorly. All the authorities wanted to shut us down... \"This report does validate everything, of the way we felt and everything that we've been put through. To be treated as we were, as the victims of a serious crime, we were let down really, really badly.\" Following a long fight for justice by Mr Dunn's family, Sacoolas eventually pleaded guilty to causing death by careless driving via video link at the Old Bailey in December 2022. She later received an eight-month prison sentence, suspended for 12 months.  Following the report, Assistant Chief Constable Emma James said in a statement: \"On behalf of Northamptonshire Police, I want to apologise to Harry's family for what is now clear was a failure on our part to do the very best for the victim in this case, Harry, and his family who fought tirelessly in the years that followed to achieve justice for him. \"The picture which emerges is one of a force which has failed the family on a number of fronts\". She also added: \"It was vitally important that Northamptonshire Police conducted this review into the most high-profile case in the force's history, a case where clear and significant shortcomings have now been properly and independently unearthed.\" The report, which has 38 recommendations, found that Nick Adderley, who was sacked as head of the force last year after lying about his military record, had caused a breakdown in relations with Mr Dunn's family. It also revealed that his \"erroneous statements\" about Sacoolas's immunity status led the Foreign Office to contact the force asking him not to repeat them. Read more:Harry Dunn's family's fight for justice never wavered'I couldn't have asked for a better brother', Harry's twin tells inquest Danielle Stone, the Police, Fire and Crime Commissioner for Northamptonshire, said Mr Adderley's behaviour was \"unfathomable\". She added that the report \"makes really clear his culpability.\" The report also said Northamptonshire Police potentially had a culture of not arresting suspects \"in circumstances such as these, which could lead to evidence not being obtained\". It recommended that the force adopt an \"investigative mindset\" over serious road crashes. Regarding the decision not to arrest Sacoolas, the report said the decision had not been \"explained in enough detail\". It added: \"The overriding factor in the decision appears to be the welfare of the suspect and her suffering from shock, with little to no consideration around the full necessity test under the Police and Criminal Evidence Act. \"A prompt and effective investigation was not considered or articulated. The view is that in these circumstances the suspect could and should have been arrested to assist the evidence-gathering process.\" The report continued: \"The duty (police sergeant) made the decision not to arrest. \"The rationale was largely based on a belief that the necessity test was not met, and information received that Anne Sacoolas was in shock. \"Whilst the welfare of any person is a concern for officers, this should not have prevented the arrest of Anne Sacoolas.\" Ms Charles, who was recently honoured with an MBE after her campaigning efforts led to road safety improvements near US airbases, said: \"I don't think you're ever done grieving. There's never any closure to losing a child. You live with it, it's so profound. \"So the only thing I would ever say to anybody else who feels that they've got a fight ahead of them, dig deep, do your best, because you just never know the resilience that you've got until you absolutely have to find it.\""
    },
    {
        "title": "Battle to convince MPs to back benefit cuts to more than three million households ",
        "description": "Plans for cuts to benefits which will impact more than three million households will be published today - as the government faces a battle to convince dozens of Labour MPs to back them.",
        "url": "https://news.sky.com/story/battle-to-convince-mps-to-back-benefit-cuts-to-more-than-three-million-households-13385195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-welfare-benefits-health-disability_6859245.jpg?20250317023130",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-17 19:46:00",
        "Headline": "Under pressure from Labour MPs concerned particularly that changes to PIP will drive families into poverty, Liz Kendall will announce new protections in the bill today.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Plans for cuts to benefits which will impact more than three million households will be published today - as the government faces a battle to convince dozens of Labour MPs to back them. Liz Kendall, the welfare secretary, has set out proposals to cut £5bn from the welfare budget - which she has said is \"unsustainable\" and \"trapping people in welfare dependency\". Disabled people claiming PIP, the personal independence payment which helps people - some of them working - with the increased costs of daily living, face having their awards reviewed from the end of next year. An estimated 800,000 current and future PIP recipients will lose an average of £4,500 a year, according to a government assessment.  The government also intends to freeze the health element of Universal Credit, claimed by more than two million people, at £97 a week during this parliament, and cut the rate to £50 for new claimants. Under pressure from Labour MPs concerned particularly that changes to PIP will drive families into poverty, Ms Kendall will announce new protections in the bill today. Sky News understands they include a 13-week transition period for those losing PIP; a higher rate of Universal Credit for people with the most serious conditions; and a commitment that disabled people who take a job will not immediately lose their benefits. \n                  First Minister John Swinney says winter fuel payment in Scotland 'will not be less than UK benefit'\n                 \n                  Ministers on resignation 'watch-list' over welfare reforms\n                 \n                  Economy shock overshadows Reeves' big day\n                 Some 40 Labour MPs have signed a letter refusing to support the cuts; and dozens of others have concerns, including ministers.  Ms Kendall is determined to press ahead, and has said the number of new PIP claimants has doubled since 2019 - at 34,000, up from 15,000. Ministers say 90% of current claimants will not lose their benefits; and that many people will be better off - with the total welfare bill set to continue to rise over this parliament. To keep the benefit, claimants must score a minimum of four points out of eight on one of the daily living criteria. Ministers say claimants with the most serious conditions, who cannot work, will not face constant reassessments. A £1bn programme is proposed, intended to give disabled people who can work tailored support to find jobs. Some Labour MPs have angrily opposed the reforms - which will be voted on later this month. Last night in a parliamentary debate, Labour MP for Poole Neil Duncan-Jordan disputed the Department for Work and Pensions (DWP) figures. Read More:Minister tells MPs controversial disability benefit reforms will go aheadBig benefits cuts are imminent - here's what to expect He said: \"We already know that PIP is an underclaimed benefit. The increase in claims is a symptom of declining public health and increased financial hardship disabled people are facing. \"We have the same proportion of people on working-age benefits as in 2015. This is not an economic necessity, it's a political choice.\" Rachael Maskell, Labour MP for York, called the proposals \"devastating \". She said: \"We must change direction and not proceed with these cuts.\" Disability groups say they fear an increase in suicides and mental health conditions. The government's own assessment forecast an extra 250,000 people could be pushed into poverty - including 50,000 children. It did not include the impact of people moving into work. Ms Kendall was urged by MPs on the Commons Work and Pensions committee to delay the reforms, to carry out an impact assessment, but wrote back to the committee saying the reforms were too urgent to delay - and that MPs would be able to amend the legislation."
    },
    {
        "title": "Missing teen Cole Cooper: Grieving mum alleges 'third party' involved in death",
        "description": "The grieving mother of a Scottish teen who vanished for a month has told Sky News she believes a \"third party\" was involved in her son's death.",
        "url": "https://news.sky.com/story/missing-teen-cole-cooper-grieving-mum-alleges-third-party-involved-in-death-13385058",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-cole-cooper-scotland_6944503.jpg?20250617164210",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-06-17 15:36:00",
        "Headline": "Cole, 19, had been missing for four weeks before he was discovered dead in woods near Falkirk earlier this month.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  The grieving mother of a Scottish teen who vanished for a month has told Sky News she believes a \"third party\" was involved in her son's death. Cole Cooper, 19, was discovered dead in woods near Falkirk earlier this month following a missing persons inquiry his relatives don't believe was taken seriously enough by police. He was last seen on CCTV in May after leaving a house party, but police later revealed a former school friend had spoken to Cole a few days later nearby. Speaking exclusively to Sky News, his mum Wendy Stewart, 42, has revealed her son had \"various arguments\" in the days and hours before he disappeared. In an emotional interview, she said: \"He was only 19, he should never have been taken. I am never going to see him again. I never got a chance to give him a last cuddle and hold his hand. \"Someone has taken that away from me far too soon. Whether it be intentionally or unintentionally, I do believe there has been some involvement by a third party and the result is the death of Cole.\" The family, who organised a local vigil in Cole's memory last weekend, have vowed to get \"justice\". \n                  Double shooting suspect 'fled through three countries in 15 hours', Spanish police claim\n                 \n                  Man, 27, pleads guilty to murdering and decapitating girlfriend\n                 \n                  Dozens to be rehomed and building earmarked for demolition after fatal Perth fire\n                 Asked what that means, Ms Stewart told Sky News: \"Finding the culprit and getting justice that way. Finding the person that is responsible for the death of my child.\" Police previously said 400 residents were spoken to during door-to-door enquires and more than 2,000 hours of CCTV footage was collected. The 19-year-old's death is being treated as \"unexplained\". Read more from Sky News:Council apologises amid school Union Flag rowWinter fuel payment in Scotland 'will not be less than UK benefit' Cole's aunt Aimee Tennie, 32, revealed the family's anger over the police handling of the case as they attempt to find out what happened. She said: \"We are aware of small details surrounding the weekend leading up to it with arguments. He had a few arguments over that weekend. We want the details re-examined thoroughly.\" Sky News put all of the family's concerns and allegations to Police Scotland. The force swerved our questions and responded saying: \"Enquiries remain ongoing.\" Wendy Stewart claimed the probe has been handled \"shockingly\" with a failure to take her son's disappearance seriously. The 42-year-old said: \"I have had to scream and shout from rooftops to be heard by the police. I don't think they have handled it well. \"The police really need to take accountability and listen to families, they are reporting a missing child and understand the family knows their child best.\" Cole Cooper's loved ones still have not been told when his body will be released to allow them to lay him to rest."
    },
    {
        "title": "Fat injections and Brazilian butt lifts 'offered in public toilets', experts warn",
        "description": "Fat injections, Brazilian butt lifts (BBLs), Botox and fillers are being offered by untrained people in places such as public toilets, officials have warned.",
        "url": "https://news.sky.com/story/fat-injections-and-brazilian-butt-lifts-offered-in-public-toilets-experts-warn-13385230",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-female-toilet_6944822.jpg?20250618004425",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-17 21:05:00",
        "Headline": "Trading standards leaders say there is a need for urgent government action over a \"wild west\" of unregulated and unlicensed practitioners and treatments, as well as where they can be offered.",
        "Content": "Fat injections, Brazilian butt lifts (BBLs), Botox and fillers are being offered by untrained people in places such as public toilets, officials have warned. Trading standards leaders say there is a need for urgent government action over a \"wild west\" of unregulated and unlicensed practitioners and treatments, as well as where they can be offered. The Chartered Trading Standards Institute (CTSI) said it uncovered \"shocking\" locations where procedures such as fillers are being administered, including \"pop-up\" shops on high streets, cubicles in public toilets and hotel rooms. It said these locations fall outside typical business premises, making taking action difficult. The CTSI also said \"unsafe and unregulated\" fillers were available for sale online for as little as £20. It also noted growing concerns over fat-dissolving injections, such as Lemon Bottle, which have \"little to no regulatory oversight to ensure their safe use by the public\". It said there was a \"postcode lottery\" across the UK in the minimum age at which such procedures can be carried out, with young people crossing borders for treatment. The CTSI said lives could be at risk amid the \"major gaps\" in regulation on who is responsible for the products and procedures. It claims there is no data available on how often the NHS is having to deal with infections and life-threatening complications when things go wrong. The CTSI warned the public to check the qualifications of people offering cosmetic procedures, to be wary of people advertising on social media and urged them not to buy products to use at home. Read more from Sky News:Man who murdered two women on Christmas Day jailedElon Musk posts 'negative drug test results'New York mayoral hopeful arrested by ICE agents 'Lives are being put at risk every single day' Kerry Nicol, external affairs manager at the CTSI, said: \"I am genuinely shocked by the scale of potential harm facing the public due to the alarming lack of regulation in the aesthetic industry. Consumers' lives are being put at risk every single day. She added: \"Alarm bells would ring if someone was offering a tattoo in someone's kitchen or a public toilet at a cheap price - so those are the alarm bells we need ringing for people offering facial injections in these kinds of settings.\" Regulations 'inadequately policed and enforced' Ashton Collins, director at Save Face, a register of accredited practitioners, said: \"Since 2023, we have been campaigning for the government to ban liquid BBLs from the high street and restrict their administration to qualified plastic surgeons.\" She added: \"For too long, regulations intended to safeguard patients have been inadequately policed and enforced.\" A Department of Health and Social Care spokesperson said: \"People's lives are being put at risk by inadequately trained operators in the cosmetic sector, which is why the government is looking into new regulations to protect people. \"The safety of patients is paramount and we urge anyone considering cosmetic procedures to consider the possible health impacts and find a reputable, insured and qualified practitioner.\""
    },
    {
        "title": "Government to announce another delay to HS2",
        "description": "The government will announce another delay to the beleaguered HS2 project on Wednesday, saying the latest target is now impossible. ",
        "url": "https://news.sky.com/story/government-to-announce-another-delay-to-hs2-13385232",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hs2-transport_6927868.jpg?20250526144244",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-06-17 21:11:00",
        "Headline": "Heidi Alexander will blame the Tories for \"wasting billions\" as official reports reveal a \"litany of failure\" over the troubled project. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The government will announce another delay to the beleaguered HS2 project on Wednesday, saying the latest target is now impossible.  Sky News understands that Transport Secretary Heidi Alexander will announce that the London to Birmingham line will no longer be ready to open by 2033. It is not clear what the new target date will be. Ms Alexander is expected to blame the Tories for a \"litany of failure\" that drove the costs up by £37bn since 2012, when the high-speed rail network was approved by the coalition government. As first reported by The Telegraph, she is also expected to raise concerns that taxpayers may have been defrauded by subcontractors and pledge that \"consequences will be felt\". Ms Alexander's announcement will come alongside the findings of two reviews into HS2, looking into what went wrong and how and when to construct the rest of it. She will tell MPs: \"Billions of pounds of taxpayers' money has been wasted by constant scope changes, ineffective contracts and bad management. \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  MPs vote to decriminalise abortion in England and Wales\n                 \n                  Sir Keir Starmer hits out at politicians who 'shout and scream but do nothing' over grooming gangs\n                 \"It's an appalling mess. But it's one we will sort out.\" HS2 was originally planned to cut journey times and improve connectivity between London and the Midlands and the North. It was given the go-ahead in 2012 with the aim of operating by 2026, but has since been mired in setbacks and spiralling costs. Read More:HS2 boss reveals £100m bill for a railway line 'bat shed' that 'isn't needed'  The initial plan was to build the first phase connecting London and Birmingham, followed by adding two branches to Manchester and Leeds. However, Boris Johnson scrapped the leg to Leeds in 2021, while Rishi Sunak pulled the plug on the remainder of the second phase to Manchester in 2023 because of spiralling costs. The latest time scales give an opening date of between 2029 and 2033 for the London to Birmingham leg, which is under construction. The most recent cost estimate was £49bn to £56.6bn (in 2019 prices), according to a House of Commons research briefing. The original bill for the entire project at 2009 prices, when the idea was first conceived, was supposed to be £37.5bn."
    },
    {
        "title": "MPs vote to decriminalise abortion in England and Wales",
        "description": "MPs have voted to decriminalise abortion in England and Wales.",
        "url": "https://news.sky.com/story/mps-vote-to-decriminalise-abortion-in-historic-vote-13385137",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abortion-pro-choice_6943985.jpg?20250617033322",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-06-17 17:54:00",
        "Headline": "The amendment to the Crime and Policing Bill, abolishing the prosecution of women in England and Wales for terminating their pregnancy at any stage, passed by 379 votes to 137.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  MPs have voted to decriminalise abortion in England and Wales. The amendment to the Crime and Policing Bill, abolishing the prosecution of women for terminating their pregnancy at any stage, passed by 379 votes to 137. It represents the biggest shake-up in reproductive rights for almost 60 years. Labour MP Tonia Antoniazzi, who tabled the so-called \"New Clause One\" (NC1), said it would ensure women do not face investigation, arrest, prosecution or imprisonment in relation to any pregnancies. She said the current \"Victorian\" laws had been used against vulnerable women, citing cases such as Nicola Packer, who was prosecuted on suspicion of having an illegal abortion. She was found not guilty in May. \"Nicola's story is deplorable, but there are many others,\" Ms Antoniazzi said. Abortion in England and Wales is currently a criminal offence but is legal with an authorised provider for up to 24 weeks after conception. The procedure is allowed after this time in very limited circumstances. It is also legal to take prescribed related medication at home if a woman is less than 10 weeks pregnant. Ms Antoniazzi said NC1 was \"a narrow, targeted measure\" that would not change how abortion services were provided or the rules under the 1967 Abortion Act. She said: \"The 24 [week] limit remains. Abortions still require the approval of signatures of two doctors, and women would still have to meet the grounds laid out in the Act.\" The MP said that meant healthcare professionals \"acting outside the law and abusive partners using violence or poisoning to end a pregnancy would still be criminalised, as they are now.\" She added: \"This piece of legislation will only take women out of the criminal justice system because they are vulnerable and they need our help. \"As I have said before, and I will say it again, just what public interest is this serving? This is not justice, it is cruelty and it has got to end.\"  The change will not come into effect immediately as the Crime and Policing Bill is still making its way through Parliament. A separate amendment, put forward by Labour MP Stella Creasy, went further with a measure to \"lock in\" the right of a person to have an abortion while protecting those who help them. However, her amendment was not voted on because Ms Antoniazzi's passed, as expected. Conservative MP Sir Edward Leigh, speaking against both amendments, described them as \"not pro-woman\" and argued they \"would introduce sex-selective abortion\". How did MPs vote? MPs were given a free vote on the amendment, as is typically the case with so-called matters of conscience. A breakdown of the vote showed it was passed overwhelmingly by Labour and Lib Dem MPs. Read more:Sky poll reveals public's view on decriminalisation Just eight Conservative MPs voted in favour, while all Reform UK MPs opposed the amendment, with the exception of the party's leader Nigel Farage, who abstained. Sir Keir Starmer was not present for the vote as he is currently in Canada for the G7 summit, but said earlier that his \"longstanding in-principle position is that women have the right to a safe and legal abortion\". The issue of women investigated by police over suspected illegal abortions has been in the spotlight due to several recent high-profile cases. Ms Packer was cleared by a jury last month after taking prescribed abortion medicine at home when she was around 26 weeks pregnant, beyond the legal limit of 10 weeks. In the Commons, Ms Antoniazzi cited another case of a young mother who was jailed for two years after she was forced to take illegal abortion medication by her abusive partner. He was never investigated."
    },
    {
        "title": "UK weather: Yellow heat health alerts issued for most of England, as forecast reveals where it will hit 33C",
        "description": "Yellow heat health alerts have been issued for most of England - with temperatures forecast to hit highs of 33C (91F) this weekend. ",
        "url": "https://news.sky.com/story/uk-weather-yellow-heat-health-alerts-issued-for-most-of-england-13384920",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kensington-gardens_6944299.jpg?20250617132454",
        "type": "UK",
        "Author": "Connor Sephton, news reporter, and Jo Robinson, weather producer",
        "Date Published": "2025-06-17 11:33:00",
        "Headline": "The forecast means we are likely to see the hottest day of the year so far - eclipsing the 29.4C (85F) recorded last Friday in Suffolk.",
        "Content": "By Connor Sephton, news reporter, and Jo Robinson, weather producer   Yellow heat health alerts have been issued for most of England - with temperatures forecast to hit highs of 33C (91F) this weekend.  Only the North East and North West are exempt from the UK Health Security Agency's latest warnings for England, which comes into force at 12pm on Wednesday and expires at 6pm on Sunday. The alert indicates that people with pre-existing health conditions, and those aged over 65, could be at higher risk. Check the weather forecast where you are Forecasters say the East of England is likely to see the highest temperatures, which wouldn't be far off the June record of 35.6C (90F) set in 1976. There is currently a 15% chance of a new record being set. It could reach the low 30s across the rest of England and Wales, and the mid-to-high 20s in Scotland and Northern Ireland. According to the Met Office, it will get progressively warmer as the week progresses - with the heat peaking on Sunday. Deputy chief meteorologist Dan Holley said thundery showers may be possible heading into Saturday morning, with \"tropical nights\" a possibility as parts of the UK approach heatwave territory. Those who are not a fan of the heat will be pleased to know that high pressure is expected to move away early next week - meaning temperatures should fall. \"However, there is uncertainty in how quickly this happens, and the peak temperatures experienced across the UK,\" Mr Holley added. The heat coincides with the summer solstice, when UV levels are at their peak and nights at their shortest, so there will be little relief once it is dark. There will be some locally very warm nights - especially in western Scotland - which will exacerbate any heat health impacts. Grass pollen levels will be mostly high to very high over the next few days, but extreme temperatures can contribute to lower levels. The forecast means we are likely to see the hottest day of the year so far - eclipsing the 29.4C (85F) recorded last Friday in Suffolk. Ice cream makers, meanwhile, have said \"it's their Christmas time\", with some making fresh supplies around the clock. But the London Fire Brigade has warned that the hot weather, which follows one of the driest springs on record, also \"greatly increases\" the risk of wildfires that can spread rapidly. A heatwave is officially declared when temperatures exceed a certain level for three days in a row - and thresholds vary from 25C to 28C (77F to 82F) across the UK. • Close curtains in rooms that face the sun • Drink plenty of fluids - but avoid too much alcohol • Try to keep out of the sun between 11am and 3pm • Walk in the shade, apply sunscreen and wear a hat • Take water with you if you're travelling Europe grapples with heatwave too Iberia is currently experiencing an early season heatwave - with temperatures currently well above the average for this time of year. For Spain and Portugal, the middle of the week will bring the peak of the temperatures, widely reaching 35 to 40C (95F to 104F) inland, with a few locations exceeding 40C. The heat will spread further north into France over the next few days, with temperatures widely reaching the low 30s over the weekend. Temperatures will be some 12C to 16C above average in parts of the north and west, reaching 35C or 36C in places - perhaps even Paris. There is some uncertainty on how long the heat will persist across France. Some computer models have the peak on Sunday, while others keep it going into next week, with temperatures climbing even further, perhaps up to 40C."
    },
    {
        "title": "Woman who killed baby in crash outside hospital has sentence reduced",
        "description": "A driver who killed an eight-month-old baby in a crash outside a hospital has had her sentence reduced.",
        "url": "https://news.sky.com/story/woman-who-killed-baby-in-crash-outside-hospital-has-sentence-reduced-13385004",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-mabli-cariad-hall-wales_6202271.png?20230629120916",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:18:00",
        "Headline": "Bridget Curtis, 71, was sentenced in January for causing the death of eight-month-old Mabli Cariad Hall by dangerous driving outside Withybush Hospital in Pembrokeshire.",
        "Content": "A driver who killed an eight-month-old baby in a crash outside a hospital has had her sentence reduced. Bridget Curtis, 71, was jailed for four years in January, after she pleaded guilty to causing the death of Mabli Cariad Hall by dangerous driving. Mabli was struck by a white BMW outside Withybush Hospital in Haverfordwest, Pembrokeshire, on Wednesday 21 January 2023. She was airlifted to the University Hospital of Wales in Cardiff and was then moved to the Bristol Royal Hospital for Children, where she died of her injuries four days later. Mabli's father, Rob Hall, said in a victim impact statement that life without his daughter had been \"horrendous\" and he did not know how the family could \"recover from such trauma\". Her mother, Gwen Hall, described Mabli as her \"best friend, [her] shadow, [her] second skin\" and added that the day her daughter died was the day her life \"irreversibly changed for the worse\". Speaking after January's sentencing hearing, Mabli's grandfather Paul Sambrook said the \"nightmarish chapter\" had come to an end and urged people to \"take care every time you sit behind the wheel of [their] car\". \n                  Cost of rural crime in Wales at its highest in more than a decade\n                 \n                  Owner of paddleboarding company jailed over deaths of four people in Pembrokeshire\n                 \n                  River Cleddau: Families pay tribute to paddleboarding tragedy victims at sentencing hearing\n                 'Manifestly excessive' At the Court of Appeal on Tuesday, Curtis's barrister said the sentence should be reduced. Three senior judges ruled that Curtis's sentence was \"manifestly excessive\" and reduced it from four years to three. Mr Justice Butcher, sitting with Lord Justice Bean and Judge Richard Marks KC, said it was a \"truly tragic case\". \"We have read the very moving victim personal statements of Mabli's parents, expressing their grief at the death of their beloved baby,\" he added. \"No one could fail to sympathise with them for the appalling loss that they have sustained.\" Curtis, who attended the appeal hearing via video link from HMP Eastwood Park in Gloucestershire sat in a wheelchair throughout. 'Law-abiding life' Swansea Crown Court previously heard Mabli and her family were visiting her grandmother, who was receiving end-of-life care at the time of the crash. Mabli's father had just put her back into her pushchair on a grassed area under some trees opposite the hospital's entrance \"when he heard the sound of an approaching vehicle\". The court heard Curtis had given her daughter a lift to the hospital for an appointment and had stopped the car outside the main entrance, with the engine running. Her daughter was unable to see her handbag in the back of the car and the defendant \"turned around from her seat to look into the back\". \"The defendant had failed to switch off the vehicle and had failed to place the car, which was an automatic-geared vehicle, into a parked setting,\" Craig Jones said, prosecuting. In four and a half seconds, the vehicle reached a top speed of 29 miles per hour and travelled a distance of 28 metres before the collision. In mitigation, John Dye said the defendant had \"led a blameless, law-abiding life\". 'Tragic case' Mr Dye, representing Curtis again at the Court of Appeal, said it was a \"tragic case\" but that the issue was \"one of pedal confusion\". He said it was \"clearly dangerous driving\", but that in terms of culpability, the four seconds were \"more akin to...a lapse of concentration\". Craig Jones made no oral submissions to the court on behalf of the Crown Prosecution Service. Read more from Sky News:Man who murdered two women on Christmas Day jailed for lifeHow Clean Is Your House? presenter Kim Woodburn dies Mr Justice Butcher added that Curtis \"did not intend to cause any harm\" but that her driving was \"well over the threshold of dangerousness\". He added that the court accepted Curtis's remorse to be \"genuine\" and said it was \"inattention and confusion as to which pedal she was pressing that caused this tragedy\"."
    },
    {
        "title": "Sir Keir Starmer hits out at politicians who 'shout and scream but do nothing' over grooming gangs",
        "description": "Sir Keir Starmer has said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry. ",
        "url": "https://news.sky.com/story/sir-keir-starmer-hits-out-at-politicians-who-shout-and-scream-but-do-nothing-over-grooming-gangs-13385032",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-g7-summit_6944456.jpg?20250617154856",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:51:00",
        "Headline": "The prime minister defended accusing the Tories of 'jumping on a far right bandwagon' when the called for a national inquiry into grooming gangs in January, as they did not launch one while in goverment. ",
        "Content": " Sir Keir Starmer has said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry.  Speaking to Sky News's political editor Beth Rigby, the prime minister was asked if he regretted saying in January that those calling for a national probe into paedophile rings were \"jumping on a far-right bandwagon\" - given he has now agreed to one.  Politics latest: Baroness Casey asks people to 'keep calm' about grooming gang ethnicity data Sir Keir said he was \"really clear\" he was talking about the Tories, who were demanding an inquiry they never set up when they were in government. He said: \"I was calling out those politicians. \"I am frustrated with politics when people shout and scream a lot and do nothing when they've got the opportunity to do it. It's one of the worst aspects of politics, in my view.\" Sir Keir also said there \"must be accountability\" for authorities who \"shied away\" from talking about the ethnicity of perpetrators for fear of being branded racist, as exposed in a report by Baroness Casey published on Monday.  \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  MPs vote to decriminalise abortion in England and Wales\n                 \n                  'Britain's darkest secret': Grooming survivor calls for apology from Starmer\n                 Asked if he is happy for \"social workers, policemen and people that failed\" to be held accountable, the prime minister said: \"Where the inquiry uncovers failure or wrongdoing, then there should absolutely be accountability. \"That is amongst the purposes of an inquiry, and it's a statutory inquiry... which will therefore mean there is power to compel evidence of witnesses because it's important that it is comprehensive and important that it gets to every single issue. And as part of that process, there's accountability for individuals who did wrong.\"  Baroness Casey was asked to produce an audit of sexual abuse carried out by grooming gangs in England and Wales in January, when comments by tech billionaire Elon Musk brought the scandal back into the spotlight. The government initially resisted calls from the Tories for a national inquiry into grooming gangs, saying they wanted to focus on implementing the recommendations of Professor Alexis Jay's seven-year review into child abuse. The review concluded in 2022 but the Conservatives did not implement its recommendations before they lost the election last July. Read More:Grooming gangs report author says 'do-gooders' giving racists 'more ammunition'Nationwide police operation on grooming gangs announced The government's position has changed following Baroness Casey's audit, which recommended an inquiry. Her report found that ethnicity data is not recorded for two-thirds of grooming gang perpetrators. However at a local level in three police forces - Greater Manchester, South Yorkshire and West Yorkshire - \"there has been a disproportionality of group-based child sexual exploitation offending by men of Asian ethnicity\". The cross bench peer said instead of looking into whether ethnicity or cultural factors played a part, authorities \"avoided the topic altogether for fear of appearing racist\", and this warranted further investigation."
    },
    {
        "title": "Jazwell Brown: Man who murdered two women on Christmas Day after taking crack cocaine jailed for life",
        "description": "A man who murdered two women on Christmas Day has been jailed for life, with a minimum term of 39 years.",
        "url": "https://news.sky.com/story/jazwell-brown-man-who-murdered-two-women-on-christmas-day-after-taking-crack-cocaine-jailed-for-life-13384823",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jazwell-brown-christmas-day_6944342.jpg?20250617142905",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-17 13:39:00",
        "Headline": "Jazwell Brown, 49, attacked his partner, her dog and his teenage son, before targeting a neighbour and her boyfriend on 25 December 2024.",
        "Content": " A man who murdered two women on Christmas Day has been jailed for life, with a minimum term of 39 years. Jazwell Brown had previously pleaded guilty to killing Teohna Grant and Jo Pearson in Milton Keynes last year - as well as two counts of attempted murder. Detectives say the attacks were wholly unprovoked and committed while he was under the influence of crack cocaine. Brown had fatally assaulted Ms Pearson, his 38-year-old partner, in their home by stabbing her repeatedly and beating her with a baseball bat. He also attempted to kill his 18-year-old son, Jake Brown, using the same weapons. The 49-year-old then took the knife and baseball bat to his neighbour's flat, where he killed 24-year-old Teohna Grant. Her partner, Bradley Latter, sustained more than 20 injuries to his neck alone, but survived. Brown also stabbed Ms Pearson's dog Tilly before fleeing the scene in his car, driving at dangerously high speeds before he was arrested. Footage from a nearby doorbell camera showed the dog walking around while bloodied and injured. Detective Chief Inspector Stuart Brangwin said the scenes faced by emergency services that evening were \"indescribable\". He added: \"The events that unfolded on that day were truly horrific and tragic. We may never know what prompted Brown to behave the way he did.\" 'Terrible crimes' have 'torn apart the lives of many people' Beyond the life terms for the murders of Ms Pearson and Ms Grant, Brown was sentenced to 18 years for the attempted murder of his son, and 21 years for the attempted murder of Mr Latter. He was also sentenced to nine months for attacking Ms Pearson's dog, and 18 months for the possession of a knife in a public place. The judge said all of the sentences will run concurrently to the sentences for murder. Mr Justice Kerr told Brown: \"The terrible crimes you committed that day have torn apart the lives of many people.\" He said he accepted a psychiatric report that \"the use of illegal drugs was the immediate trigger of the attacks\", adding: \"That intoxication was voluntary.\" He said Brown's assault on his son Jake was \"a terrible betrayal of a son's natural trust in his father\". 'Completely expressionless' Luton Crown Court heard Jake Brown describe his father as being \"completely expressionless\" as he attacked them. The teenage boy called the police as he hid in the bathroom before Brown breached the door, holding the baseball bat. Jake told officers there had been no argument and nothing to justify the defendant's actions, and that the attack was like \"watching a horror film\", prosecutor Deanna Heer said. Brown then made his way across the communal landing to the flat next door, where Mr Latter and Ms Grant, who had left their door unlocked, were sitting in the living room enjoying a quiet Christmas Day. Ms Heer said Brown stabbed them both multiple times with a \"blank\" face. A bloodstained knife was found on the passenger seat of his car, with the defendant's fingerprint in blood on the knife, while spots of Ms Pearson's and Mr Latter's blood were found on his trainers. 'Not self-defence. Murder' Speaking in a cell after his arrest, Brown said: \"Oh Jesus, what happened tonight? What happened tonight, boy? Pure f***ing madness. Pure madness. \"I've gone f***ing crazy guys. Just gone crazy.\" He said \"I've gone bloody looney\", and later added: \"Not self-defence. Murder. It's plain murder, not self-defence. Murder\". Read more from Sky News:Murder arrest after charity worker found stabbedMan admits to decapitating girlfriend Tributes to victims In a statement, Ms Pearson's family said: \"Jo was a loving daughter, sister, mother, auntie, cousin, friend and neighbour. Her life was needlessly and cruelly cut short in horrendous circumstances on Christmas Day, in her own home at the hands of her partner. We will never be able to understand why.\" Meanwhile, Ms Grant was described as someone who had \"a huge heart full of love and kindness\". \"As a family we are heartbroken to have lost her,\" they said. \"The heartbreak is intensified by the realisation that we lost her due to the senseless, cruel actions of someone else. Our world is emptier, full of sadness and holds a lot less laughter now that she has gone.\""
    },
    {
        "title": "Trump's words designed to stoke tension, confuse and apply intense pressure on Iran",
        "description": "This is the highest stakes diplomacy via social media.&#160;",
        "url": "https://news.sky.com/story/trumps-words-designed-to-stoke-tension-confuse-and-apply-intense-pressure-on-iran-13385097",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-g7-donald-trump-air-force-one_6944158.jpg?20250617102215",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-06-17 16:43:00",
        "Headline": "Donald Trump posted on Truth Social that the US knows where Iranian Supreme Leader Ali Khamenei is \"hiding,\" and that he was an \"easy target\" but said the US would not kill him - \"at least not for now\". It's a real-time version of his maximum pressure diplomacy.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n This is the highest stakes diplomacy via social media.  The American president just posted on his Truth Social platform: \"We know exactly where the so-called 'Supreme Leader' is hiding. \"He is an easy target, but is safe there - We are not going to take him out (kill!), at least not for now. But we don't want missiles shot at civilians, or American soldiers. \"Our patience is wearing thin. Thank you for your attention to this matter!\" Israel-Iran live: Trump says US knows where Iran's supreme leader is 'hiding' It was followed minutes later by \"UNCONDITIONAL SURRENDER!\" In real-time, we are witnessing Donald Trump's extreme version of maximum pressure diplomacy. He'd probably call it the 'art of the deal', but bunker busters are the tool, and it comes with such huge consequences, intended and unintended, known and unknown. Read more:The bunker buster bomb which could destroy Iran's nuclear ambitions  There is intentional ambiguity in the president's messaging. His assumption is that he can apply his 'art of the deal' strategy to a deeply ideological geopolitical challenge. It's all playing out publicly. Overnight, the New York Times, via two of its best-sourced reporters, had been told that Mr Trump is weighing whether to use B-2 aircraft to drop bunker-busting bombs on Iran's underground nuclear facilities. Meanwhile, Axios was reporting that a meeting is possible between Trump's envoy Steve Witkoff and Iran's foreign minister Abbas Araghchi. The reporting came just as Mr Trump warned \"everyone in Tehran to evacuate\". The nuclear sites being threatened with bunker busters are not in Tehran, but Trump's words are designed to stoke tension, to confuse and to apply intense pressure. His actions are too. He left the G7 in Canada early and asked his teams to gather in the White House Situation Room.  This is a game of smoke, mirrors, brinkmanship and - maybe - bluff. In Tehran, what's left of the leadership is watching and reading closely as they consider what's next. Maybe the Supreme Leader and his regime's days are numbered. Things remain very unpredictable. From history, though, regime change, even when it comes with a plan - and there is certainly not one here, spells civil war and from that comes a refugee crisis. These are truly tense and chaotic times."
    },
    {
        "title": "The one 'bunker buster' bomb that could be used to hit Iran's secretive Fordow enrichment plant",
        "description": "Iran's secretive Fordow uranium enrichment plant is buried deep beneath a mountain, its vital centrifuges protected by tons upon tons of rock.",
        "url": "https://news.sky.com/story/the-one-bunker-buster-bomb-israel-could-use-to-hit-irans-secretive-fordow-enrichment-plant-13384914",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bomb-usa_6944497.png?20250617163412",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-06-17 10:50:00",
        "Headline": "Buried deep beneath a mountain, Iran's Fordow uranium enrichment plant is out of reach of much of Israel's weaponry. What are the bunker buster bombs Israel could use to try and breach it?",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  Iran's secretive Fordow uranium enrichment plant is buried deep beneath a mountain, its vital centrifuges protected by tons upon tons of rock. Israel has made no secret of its wish to destroy Iran's nuclear programme, but the only bomb believed to be powerful enough to penetrate the Fordow facility is an American \"bunker buster\" bomb that the Israelis do not have - yet. As President Donald Trump appears to switch between calling on Iran to negotiate and threatening retaliation \"at levels never seen before\", discussion is now turning to whether the US will be inexorably drawn into another Middle East conflict - something the president has repeatedly said he does not want. What are bunker buster bombs? Simply put, bunker buster bombs are designed to explode twice. Once to breach the ground surface and again once the bomb has burrowed down to a certain depth. They're used to reach military headquarters, bunkers and other facilities buried deep underground - hence their name. \"They are big, very heavy. There's a lot of explosives in them,\" military analyst Michael Clarke says. \n                  Trump's words designed to stoke tension, confuse and apply intense pressure on Iran\n                 \n                  Iranian TV presenter goes back on air moments after Israeli strike hits her studio\n                 \n                  As Iran tries to talk its way towards a resolution, Israel has other ideas\n                 The Israeli military has a number of bunker buster bombs but does not have the vaunted GBU-57, a 14-ton bomb that is so heavy it can only be launched from America's fleet of heavy bomber aircraft. It's that GBU-57 which is believed to be the only one capable of destroying the highly protected Fordow plant. Analysts say it can only be delivered from a US B-2 stealth bomber. Its 30,000lb (13,600kg) weight means that its sheer kinetic force enables it to reach deeply buried targets. It's understood that it can penetrate about 200ft (61m) below the surface before exploding. What are Iran's key nuclear facilities? Prime Minister Benjamin Netanyahu has made clear his desire to destroy Iran's nuclear programme and any hint of a threat of nuclear weapons - something Iran has long denied seeking. In the several days since Israel launched its surprise attack on Iran there has been a lot of attention paid to how well they would be able to disrupt Iran's nuclear programme, much of which is buried deep underground. \"The three sites they really want are Natanz, Isfahan and Fordow,\" says Prof Clarke. Natanz and Fordow are uranium enrichment sites and Isfahan is one of the largest nuclear research centres in Iran. What damage has Israel done to Iran's nuclear programme? The Natanz enrichment plant has been struck by Israel in the last few days, with its subterranean centrifuge hall believed damaged but not destroyed. Rafael Grossi, head of the International Atomic Energy Agency, told the BBC that the Natanz plant sustained extensive damage, likely destroying 15,000 centrifuges. This was possibly due to an Israeli airstrike disrupting the power supply to the centrifuges, rather than actual physical damage to the centrifuge hall, he said. At Fordow, however, no damage was seen. Mr Grossi added: \"There is very limited if any damage registered (there).\" At Isfahan, Iran's third key nuclear location, there was damage to buildings including the central chemical laboratory and a uranium conversion plant. Mr Grossi said: \"In Isfahan you have underground spaces as well, which do not seem to have been affected.\" Read more:'They are lying': Israeli president hits out at IranIran's ambassador to UK speaks to Sky News What will Israel do now? Prof Clarke says Israel is likely to continue its bombing campaign against Iran's nuclear facilities. \"I think they will keep on revisiting Natanz,\" he said. \"They will want to keep targeting down with more bunker busters until they actually hit the centrifuge hall itself.\" Fordow, on the other hand, appears too deep for even Israel's bunker buster bombs. \"It's the most important because it's the one the Iranians think they can protect,\" he adds. \"You have to blast the mountain to get to it.\"  It's possible, prof Clarke says, that Israel could try damaging it in a similar way to what happened to Natanz - disrupting the power supply - which could have the cumulative effect of rendering the centrifuges inoperable. \"What Netanyahu wants is to say: look at the destruction we have wrought on Iran. Their weapons programme is destroyed it would take them 30 years to rebuild... we have taken them off the table as a threat to us for a generation.\" But it remains to be seen if this is possible without direct American intervention - something President Trump may want to avoid at all costs."
    },
    {
        "title": "Kellogg's, Coca-Cola and Brewdog beer on Russian shelves despite sanctions",
        "description": "Kellogg's cornflakes, Bonne Maman jam, Kent Crisps, Brewdog beer... these are the items on the supermarket shelves in front of me.&#160;",
        "url": "https://news.sky.com/story/kelloggs-coca-cola-and-brewdog-beer-on-russian-shelves-despite-sanctions-13385079",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-russia-sanctions_6944560.jpg?20250617172912",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-17 16:11:00",
        "Headline": "Russia is the most sanctioned economy in the world, but more than three years into its supposed isolation the shelves are still stocked with Western goods.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Kellogg's cornflakes, Bonne Maman jam, Kent Crisps, Brewdog beer... these are the items on the supermarket shelves in front of me.  I'm in a branch of Azbuka Vkusa (or 'Alphabet or Taste') in Moscow, where the aisles look remarkably like those in a Tesco, Sainsbury's or Waitrose. Russia is the most sanctioned economy in the world, but here we are, more than three years into its supposed isolation, and the shelves are still stocked with Western goods. So how come? Many of the products on sale here are what are called 'parallel imports'. That means they've entered Russia via third countries, without the trademark owner's permission. Russia legalised the practice soon after its invasion of Ukraine to sidestep sanctions and to shield consumers from the impact of a mass exodus of foreign brands. So despite companies pulling out of Russia, their products can often still be found here. Take Coca-Cola for example. It stopped selling to Russia and ceased operations here in 2022, but there's no problem buying its drinks. Next to each other on the supermarket shelf, I found one can from France, one from Poland, one from Iraq and even a bottle from the UK. \"Please recycle me,\" the cap hopefully implores. Like other businesses that say they have not authorised imports of their brands into Russia, there's little Coca-Cola can do about it. The company declined a request to comment. This specifically isn't sanctions-busting, since food and drink are generally exempt from the restrictions imposed by Britain and the EU. It is, however, an example of how trade bans (self-imposed, in this case) can be circumvented. And the very same practice is being used on some sanctioned goods, like luxury cars. At Frank Auto, a glitzy car showroom in northwest Moscow, there's a Porsche Cayenne Coupe, a Mercedes EQE and a BMW X5. All are under two years old, i.e. younger than the sanctions regime that was designed to keep them out. \"Germany officially does not know that we import cars for clients from Russia,\" Irina Frank, the dealership owner, tells me unashamedly. \"It's done through multiple moves. An order is placed, for example, from Turkey, then from Turkey it goes to Armenia, and from Armenia we deliver the car to Russia.\" She explains that the cars are imported to order, because of the cost involved and the uncertainty. \"Now, every transaction is checked, and there were cases when you even lost all the money, and cannot take the car out,\" she says. But it's clearly still possible. In February, Irina sold a Ferrari Purosangue to a customer who paid 130 million roubles (1.43 million euros) - 30% more than what it would have cost without sanctions, she says. And she even claims to have sold Range Rovers from Britain. \"Russia, you know, is a special country. Our people really love everything that is the most expensive, the coolest, in the maximum configuration,\" she adds. Sky News has reported extensively on how British and European cars are still entering Russia despite sanctions. But this is the first time we've spoken to some of those who have imported them. In a car park in front of Moscow's Belarussky train station, we meet Ararat Mardoyan, who owns a car brokerage firm called Autodegustator. He says he imported dozens of British and European cars into Russia during the first two years of the war, including his own vehicle.  His black Volkswagen took six months to arrive from Germany, after being shipped via Belgium, Georgia, Armenia and Iran. \"You're not doing anything wrong,\" he insists, when I ask if he's helping Russia avoid sanctions. He refers to the Eurasian Economic Union as justification - a customs union which Russia shares with Armenia, Belarus, Kazakhstan and Kyrgyzstan. \"It's like [the] European Union,\" he argues. \"If the good hits Kazakhstan, for example, it's already not only a Kazakh product, it's already a product of customs union.\" I suggest that such moves are not in the spirit of sanctions, and that some would question the morality of it. \"I don't think it's something from the sphere of immorality. It's business,\" he says. \"People have to work and survive.\" Ararat stopped importing European cars at the start of last year because of increased risks and decreasing profits, citing how he had to scrap an entire fleet of Range Rovers after their diagnostic systems were blocked as soon as they were switched on. But he doesn't believe the practice will ever cease, no matter how pricey and problematic it becomes. \"People who want to drive Ferrari,\" he says, \"they always have the money, and where there is the demand, there will always be supply.\" \"This is like a globalised world. I don't believe there's any chance of isolating Russia. It's not possible.\""
    },
    {
        "title": "EasyJet cabin crews in Spain to go on strike next week",
        "description": "EasyJet cabin crews in Spain will go on strike over their pay for three days next week.",
        "url": "https://news.sky.com/story/easyjet-cabin-crews-in-spain-to-go-on-strike-next-week-13385201",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-easyjet-airports-flights_6708185.jpg?20241006142639",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 20:04:00",
        "Headline": "The airline said it intended to operate normally and hoped to avoid any disruption.",
        "Content": "EasyJet cabin crews in Spain will go on strike over their pay for three days next week. The USO union in Spain said the industrial action would take place from Wednesday 25 June to Friday 27 June. It said more than 650 flight attendants – based in Alicante, Barcelona, Malaga and Palma de Mallorca – could be involved. However, the airline said it intended to operate normally and hoped to avoid any disruption. The union said easyJet cabin crews​​​​​​ earn much less in Spain than in other countries. It added that the aim of the strike was \"to level the crews' working and wage conditions in Spain with the ones at other bases of the company in Europe\". Read more from Sky News:Cause of Spain and Portugal power cuts revealedElon Musk posts 'drug test results'Israeli tanks 'kill 51 people waiting for aid' A spokesperson for the airline said it would do everything possible to minimise the impact of the strikes. They added that easyJet employed crews in eight different countries \"on local terms and conditions\". Regulations in Spain compel airline workers to provide a minimum level of service during industrial action to limit disruption."
    },
    {
        "title": "Israeli tanks kill 51 people waiting for aid in Gaza, Hamas-run health ministry says ",
        "description": "Israeli tank shellfire has killed at least 51 Palestinians in Khan Younis, according to the Hamas-run health ministry in Gaza. ",
        "url": "https://news.sky.com/story/45-people-killed-in-israeli-strikes-on-khan-younis-says-hamas-run-gaza-health-ministry-13384815",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-khan-younis-gaza-israeli-strike_6944069.jpg?20250617081749",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 06:55:00",
        "Headline": "The Israel Defence Forces claims it \"regrets any harm to uninvolved individuals and operates to minimise harm as much as possible\".",
        "Content": "Israeli tank shellfire has killed at least 51 Palestinians in Khan Younis, according to the Hamas-run health ministry in Gaza.  Hundreds of others have been injured, with \"dozens of critical cases\" arriving at a medical complex. It is feared that the number of people killed will rise. The Israel Defence Forces said it was \"aware of reports regarding a number of injured individuals from IDF fire following the crowd's approach\" - and said details of the incident were under review. It added: \"The IDF regrets any harm to uninvolved individuals and operates to minimise harm as much as possible to them while maintaining the safety of our troops.\" The statement claimed that a gathering had been identified near an aid distribution truck that was stuck in the area - near where IDF soldiers were operating. The incident took place as people waited for United Nations and commercial aid trucks in the southern Gaza city. Witnesses said Israeli forces carried out an airstrike on a nearby home before firing at least two shells toward the crowd. One likened the incident to \"a massacre\", while another said it was a miracle he survived. Thanos Gargavanis, a trauma surgeon and emergency officer at the World Health Organisation, said: \"There's a constant correlation with the positions of the four announced food distribution sites and the mass casualty incidents.\" Gaza's health ministry says \"emergency, intensive care and operating rooms are experiencing severe overcrowding\". Some of those injured needed to be placed on the floors and corridors of Nasser Hospital because of a lack of space. Officials say medical staff \"are operating with limited supplies of life-saving medicines\" - with the ministry renewing an \"urgent appeal\" to increase aid. Samaher Meqdad - who was looking for her two brothers and nephew at the hospital - said: \"We don't want flour. We don't want food. We don't want anything. \"Why did they fire at the young people? Why? Aren't we human beings?\" Hours earlier, Donald Trump had joined other G7 leaders to call for a \"de-escalation of hostilities in the Middle East, including a ceasefire in Gaza\". Read more from Sky News:How the Israeli-backed aid plan in Gaza is unravellingControversial aid distributor accuses Hamas of deadly attack  On Monday, Gaza's health ministry said at least 34 people were shot dead near food distribution centres. This was the highest reported daily total since Israel and US-backed aid centres opened last month, with thousands of Palestinians moving through Israeli military-controlled areas to reach them. The Israeli military previously acknowledged firing warning shots at people it said had suspiciously approached its forces near the aid sites. According to the Gaza Humanitarian Foundation - which operates these aid centres - more than three million meals have been distributed without incident."
    },
    {
        "title": "Single ticket-holder from Ireland wins EuroMillions jackpot",
        "description": "A single ticket-holder from Ireland has won the 250 million euro EuroMillions jackpot, the Irish National Lottery said.",
        "url": "https://news.sky.com/story/single-ticket-holder-from-ireland-wins-euromillions-jackpot-13385031",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-lottery-ticket-euromillions_6640536.jpg?20241128141219",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:50:00",
        "Headline": "The winning numbers from Tuesday's draw - which had rolled over several times - were 13, 22, 23, 44 and 49, with lucky stars 3 and 5.",
        "Content": "A single ticket-holder from Ireland has won the 250 million euro EuroMillions jackpot, the Irish National Lottery said. Ireland's lottery said it was the \"biggest ever EuroMillions jackpot,\" and its chief executive said it would reveal the winning location soon. The winning numbers from Tuesday's draw - which had rolled over several times - were 13, 22, 23, 44 and 49, with lucky stars 3 and 5. The EuroMillions jackpot is capped once it reaches 250 million euros - or £208m. According to the EuroMillions website, Tuesday's jackpot was £213.65 million. It added there were a total of 3,959,140 winners. In total, more than 92,000 players in Ireland won prizes in the EuroMillions and Plus games. Irish National Lottery chief executive Cian Murphy said: \"We are absolutely thrilled to see this incredible and record win for an Irish EuroMillions player. \n                  EuroMillions: UK's biggest lottery prize is still up for grabs\n                 \n                  EuroMillions ticketholder in UK stakes claim for £65m jackpot\n                 \n                  UK winner receives third biggest EuroMillions jackpot\n                 \"We are advising our players to check their tickets and, if they are the winner, sign the back of the ticket, keep it safe, and contact National Lottery HQ and we will guide you through the claims process.\" Read more from Sky News:Trump considering US strike on Iran, officials sayElon Musk posts 'drug test results'23andMe fined millions by UK watchdog Mr Murphy added that \"with such a big win we have procedures to follow, but we will reveal the winning location as soon as we can\". \"While this is a massive win, it can come as a shock to a winner and we advise them to stay calm, get independent legal and financial advice and contact us as soon as they can.\" Two British players, meanwhile, took home prizes of £6,287,001.20 for having the five winning numbers and one of the lucky stars."
    },
    {
        "title": "Ukraine war: 14 killed as Russian missile and drone attacks strike Kyiv - including American citizen",
        "description": "Russian missile and drone attacks have killed 14 people in Kyiv overnight, according to Ukrainian officials.",
        "url": "https://news.sky.com/story/14-dead-in-russian-attacks-on-kyiv-overnight-says-interior-minister-13384780",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukraine-kyiv_6944003.jpg?20250617062733",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 04:44:00",
        "Headline": "Volodymyr Zelenskyy was due to hold talks with Donald Trump - but the US president has announced he is unexpectedly returning to Washington because of tensions in the Middle East.",
        "Content": "Russian missile and drone attacks have killed 14 people in Kyiv overnight, according to Ukrainian officials. A 62-year-old US citizen who suffered shrapnel wounds is among the dead. At least 139 others were wounded in strikes that hollowed out a residential building and destroyed dozens of apartments, with the city's mayor announcing that Wednesday will be an official day of mourning. Emergency workers were at the scene to rescue people from under the rubble. Images show a firefighter was among those hurt, with injured residents evacuated from their homes, some by crane. President Volodymyr Zelenskyy described the attack as \"one of the most terrifying attacks on Kyiv\" - and said Russian forces had fired 440 drones and 32 missiles as civilians slept in their homes. \"[Putin] wants the war to go on,\" he said. \"It is troubling when the powerful of this world turn a blind eye to it.\" Ukraine's interior minister, Ihor Klymenko, said 27 locations across the capital have been hit - including educational institutions and critical infrastructure. He claimed the attack, in the early hours of Tuesday morning, was one of the largest on the capital since Russia's full-scale invasion began in February 2022. Drones swarmed over the city, with an air raid alert remaining in force for seven hours. One person was killed and 17 others injured as a result of separate Russian drone strikes in the port city of Odesa. It comes as the G7 summit in Canada continues, which Ukraine's leader is expected to attend. Volodymyr Zelenskyy was due to hold talks with Donald Trump - but the president has announced he is unexpectedly returning to Washington because of tensions in the Middle East. Ukraine's foreign minister says Moscow's decision to attack Kyiv during the summit is a signal of \"total disrespect\" to the US. \"Russia not only rejects a ceasefire or a leaders' meeting to find solutions and end the war - it cynically strikes Ukraine's capital while pretending to seek diplomatic solutions,\" Andrii Sybiha wrote on social media. Moscow has launched a record number of drones and missiles in recent weeks, and says the attacks are in retaliation for a Ukrainian operation that targeted warplanes in airbases deep within Russian territory. Military analysts say Russia is adapting its tactics - and concentrating strikes on a single city at a time to overwhelm Ukraine's air defences. \"It is a new challenge that we need to adapt to as soon as possible,\" Oleksandr Kovalenko warned. Read more from Sky News:New episodes of The Wargame podcast releasedUS-UK trade deal is 'done', Donald Trump says On X, Ukraine's foreign ministry wrote: \"Russia's campaign of terror against civilians continues. Its war against Ukraine escalates with increased brutality. \"The only way to stop Russia is tighter pressure - through sanctions, more defence support for Ukraine, and limiting Russia's ability to keep sowing war.\" Olena Lapyshnak, who lived in one of the destroyed buildings, said: \"It's horrible, it's scary, in one moment there is no life. I can only curse the Russians, that's all I can say. They shouldn't exist in this world.\" Russia's military says it downed 203 Ukrainian drones over 10 regions on Monday evening and Tuesday morning - with flights in and out of all four of Moscow's airports temporarily suspended."
    },
    {
        "title": "Cause of massive power cut that plunged Spain and Portugal into chaos revealed",
        "description": "The massive power cut that plunged huge swathes of Spain and Portugal into chaos earlier this year was caused by a miscalculation, the Spanish government has said.",
        "url": "https://news.sky.com/story/cause-of-massive-power-cut-that-plunged-spain-and-portugal-into-chaos-revealed-13384965",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pamplona-spain-outage_6899997.jpg?20250428170201",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 13:23:00",
        "Headline": "The massive power outage left planes and trains disrupted and traffic jams stretching along roads, while people lost electricity across the two countries.",
        "Content": "The massive power cut that plunged huge swathes of Spain and Portugal into chaos earlier this year was caused by a miscalculation, the Spanish government has said. Airports, trains and internet were among the services affected by the blackout in late April, with traffic lights also down - causing huge tailbacks. Millions of people were affected and parts of the two countries were brought to a standstill as authorities raced to find the source of the problem.  There was discussion about whether a cyberattack was to blame, but today Spain's energy minister said the issue was a miscalculation by the Spanish power grid operator REE. Sara Aagesen said REE did not have enough thermal power stations switched on during peak hours of April 28 when the surge caused a chain reaction leading to the power outage. \"The system did not have sufficient dynamic voltage control capacity,\" she said. Read more from Sky News:Air India flight from Ahmedabad to London cancelledAssassination suspect captured after two-day manhunt \n                  Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed\n                 \n                  Body found in search for Briton who went missing during stag do in Portugal\n                 \n                  Madeleine McCann: New search under way brings fresh hope - but there are big unanswered questions\n                 The government report, which was due to be made public on Tuesday, found that some of the power plants required by law to regulate the grid's voltage failed to do so. Electricity grids in Europe are kept at 50 Hertz frequency in order to maintain stability - and even a slight deviation can lead to damage. Power plants \"should have controlled voltage and, moreover, many of them were economically remunerated to do so. They did not absorb all the reactive power that was expected in a context of high voltages,\" Ms Aagesen said. The investigation found no evidence of a cyberattack, she added."
    },
    {
        "title": "Austria gunman had 'significant passion' for school shootings, police say",
        "description": "A 21-year-old gunman who killed nine students and a teacher at his former school in Austria had developed a fascination and \"significant passion\" for such shootings in recent years, investigators say.",
        "url": "https://news.sky.com/story/austria-gunman-had-significant-passion-for-school-shootings-police-say-13385114",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-austria-graz-shooting_6938709.jpg?20250610213233",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 17:21:00",
        "Headline": "Police are dealing with copycat threats as they continue to investigate the shooting in Graz that killed nine students and a teacher.",
        "Content": "A 21-year-old gunman who killed nine students and a teacher at his former school in Austria had developed a fascination and \"significant passion\" for such shootings in recent years, investigators say. Police say the former pupil planned last Tuesday's roughly seven-minute attack at the BORG Dreierschützengasse high school in Graz down to the smallest detail - but are still uncertain as to the motive for his rampage. They have also flagged a series of copycat threats that are causing disruption. After the shooter's body was discovered, investigators found he still had 24 bullets in two magazines and another 18 loose bullets for his Glock handgun, along with 17 bullets for his shotgun, according to Michael Lohnegger, the head of Styria province's criminal police office. This has led to questions about why he decided to stop shooting when he did.  Detectives continue to trawl through a string of social media accounts attributed to the man - who has not been identified - to determine which are genuine. They can \"say with certainty that, over the years, he developed a significant passion in general terms for the phenomenon of school shootings,\" Mr Lohnegger said. \n                  King and Queen 'shocked and saddened' by school shooting in Austria\n                 \n                  What we know so far about school shooting in Austria\n                 \n                  Graz: At least 10 dead - including suspected lone gunman - in Austrian school shooting, police say\n                 \"He glorifies not just the acts in general, but also the perpetrators who carried out these acts.\" Read more from Sky News:14 killed as missile and drone attacks strike KyivCause of power cut that plunged Spain into chaos revealed Eleven people were also wounded in the shootings last week, after which the gunman also died by suicide. Two of those wounded have so far been released from hospital. Two remain in intensive care. Police also highlighted an ongoing issue with copycats making threats. In Graz alone, their threats have triggered around 30 police interventions in the past few days, the Styrian Police Department said. Austria's Chancellor Christian Stocker said gun laws in the country, which are among the more liberal in the EU, will be tightened in the wake of the attack."
    },
    {
        "title": "French police fire tear gas at migrants – as No 10 admits Channel crisis 'deteriorating'",
        "description": "Migrants attempting to reach the UK were teargassed by French police on Tuesday morning &#8211; as No 10 admitted the situation in the English Channel was getting worse.",
        "url": "https://news.sky.com/story/french-police-fire-tear-gas-at-migrants-8211-as-no-10-admits-channel-crisis-deteriorating-13384940",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gravelines-migrants_6944277.jpg?20250617135144",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-17 12:27:00",
        "Headline": "Officers took action against hundreds of people attempting the crossing near Calais on Tuesday morning as the prime minister and French president held talks on the sidelines of the G7 summit.",
        "Content": "Migrants attempting to reach the UK were teargassed by French police on Tuesday morning – as No 10 admitted the situation in the English Channel was getting worse. Officers took action after hundreds of people gathered on Gravelines beach, near Calais, and then rushed towards a single dinghy floating just offshore. However, authorities stood by and watched as some of them, undeterred by the gas, waded into the water intent on boarding the boat to risk the Channel crossing. The scenes unfolded just hours after a meeting between Sir Keir Starmer and French President Emmanuel Macron in Canada to address the situation, which No 10 described as \"deteriorating\". More than 16,300 people have crossed the Channel in small boats so far in 2025, a 43% increase on the same period in 2024. Migrants who ran into the sea at Gravelines had to wait in waist-deep water for almost an hour before they were able to board the dinghy. An older man on crutches had to be carried out of the water by two others, who then ran back to rejoin the crowd. Many others did not make it to the water, raising their arms in surrender under a thick blanket of tear gas fired by the French Police Nationale. A warning cry of \"baby, baby\" was heard as a man carrying a small child sprinted out of the smog. One Afghani migrant, who wished to remain anonymous, said he was seeking a better life in the UK as the situation was \"bad\" in his country. More than 50 migrants made it aboard the dinghy before it finally began its journey across the Channel. Others were left to watch as it floated out to sea. A woman was seen sitting on the sand after chasing the dinghy as it left the beach. She and her friends, thought to be Ethiopian, complained afterwards that it was mostly men who had managed to get on the boat. However, despite the vessel departing, witnesses saw the dinghy being brought back to shore about an hour and a half later. The police present on the beach would not confirm whether the use of tear gas had now become common practice in such cases. The prime minister and Mr Macron will hold a summit in July focused on tackling the issue, No 10 said after the pair met on the sidelines of the G7 summit in Canada. An official readout of the meeting stated that the two leaders had agreed that \"migration should be a key focus given the deteriorating situation in the Channel\" and that \"they should continue to work closely with other partners to find innovative ways to drive forward progress.\" Read more:Sharp fall in net migrationPolice watch on as migrants attempt crossingIs good weather to blame for rise in crossings? Downing Street said there were \"no quick fixes\", but said action was already being taken and \"the days of Britain being a soft touch for these [people-smuggling] gangs are over\". It said that included measures aimed at getting the French authorities to intervene even if migrants were already in the sea. Asked if the government approved of the use of tear gas, a No 10 spokesman said: \"Our work with the French has never been closer. \"We are the first government to have secured agreement from the French to review their laws so their border enforcement teams can intervene in shallow waters.\""
    },
    {
        "title": "Trump's words designed to stoke tension, confuse and apply intense pressure on Iran",
        "description": "This is the highest stakes diplomacy via social media.&#160;",
        "url": "https://news.sky.com/story/trumps-words-designed-to-stoke-tension-confuse-and-apply-intense-pressure-on-iran-13385097",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-g7-donald-trump-air-force-one_6944158.jpg?20250617102215",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-17 16:43:00",
        "Headline": "Donald Trump posted on Truth Social that the US knows where Iranian Supreme Leader Ali Khamenei is \"hiding,\" and that he was an \"easy target\" but said the US would not kill him - \"at least not for now\". It's a real-time version of his maximum pressure diplomacy.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n This is the highest stakes diplomacy via social media.  The American president just posted on his Truth Social platform: \"We know exactly where the so-called 'Supreme Leader' is hiding. \"He is an easy target, but is safe there - We are not going to take him out (kill!), at least not for now. But we don't want missiles shot at civilians, or American soldiers. \"Our patience is wearing thin. Thank you for your attention to this matter!\" Israel-Iran live: Trump says US knows where Iran's supreme leader is 'hiding' It was followed minutes later by \"UNCONDITIONAL SURRENDER!\" In real-time, we are witnessing Donald Trump's extreme version of maximum pressure diplomacy. He'd probably call it the 'art of the deal', but bunker busters are the tool, and it comes with such huge consequences, intended and unintended, known and unknown. Read more:The bunker buster bomb which could destroy Iran's nuclear ambitions  There is intentional ambiguity in the president's messaging. His assumption is that he can apply his 'art of the deal' strategy to a deeply ideological geopolitical challenge. It's all playing out publicly. Overnight, the New York Times, via two of its best-sourced reporters, had been told that Mr Trump is weighing whether to use B-2 aircraft to drop bunker-busting bombs on Iran's underground nuclear facilities. Meanwhile, Axios was reporting that a meeting is possible between Trump's envoy Steve Witkoff and Iran's foreign minister Abbas Araghchi. The reporting came just as Mr Trump warned \"everyone in Tehran to evacuate\". The nuclear sites being threatened with bunker busters are not in Tehran, but Trump's words are designed to stoke tension, to confuse and to apply intense pressure. His actions are too. He left the G7 in Canada early and asked his teams to gather in the White House Situation Room.  This is a game of smoke, mirrors, brinkmanship and - maybe - bluff. In Tehran, what's left of the leadership is watching and reading closely as they consider what's next. Maybe the Supreme Leader and his regime's days are numbered. Things remain very unpredictable. From history, though, regime change, even when it comes with a plan - and there is certainly not one here, spells civil war and from that comes a refugee crisis. These are truly tense and chaotic times."
    },
    {
        "title": "Elon Musk posts 'negative drug test results'",
        "description": "Elon Musk appears to have shared the results of a recent drug test following claims he abused illegal substances while campaigning for Donald Trump last year.",
        "url": "https://news.sky.com/story/elon-musk-shares-drug-test-results-13385035",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elon-musk-donald-trump_6931038.jpg?20250530102311",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:56:00",
        "Headline": "The Tesla chief executive uploaded the document to X following claims from US newspapers that he had previously abused illegal substances.",
        "Content": "Elon Musk appears to have shared the results of a recent drug test following claims he abused illegal substances while campaigning for Donald Trump last year. The Tesla chief executive posted an image of the document on X, his social media platform, which suggested he had tested negative for more than a dozen drugs including ecstasy, ketamine and cocaine. The test was purportedly carried out by Fastest Labs of South Austin after it collected a urine sample from a donor called \"Elon Musk\" on 11 June. The billionaire wrote \"lol\" alongside the image, which was posted in the early hours of Tuesday morning US time. It comes after The New York Times reported in May that the SpaceX founder had taken drugs while supporting Mr Trump's presidential campaign last year. But the newspaper said it was \"unclear\" if he had continued to do so while working for the White House. In January 2024, The Wall Street Journal also claimed that senior figures at SpaceX and Tesla had expressed concern about his alleged drug use. Mr Musk has consistently denied the claims. When asked about The New York Times report at his last press conference in the White House, he attacked the outlet for publishing what he called \"fake news\". Read more from Sky News:Man jailed for Christmas Day murdersUK and US sign trade deal23andMe fined millions  Following his post on Tuesday, Mr Musk hit out at the newspapers which reported the allegations. He wrote: \"The sheer audacity of the WSJ/NYT lies is astonishing!\"  The tech tycoon also challenged the journalists responsible for the articles to \"take drug tests and publish the results!\" \"They won't, because those hypocrites are guilty as sin,\" he added. Meanwhile, on Tuesday, Mr Musk's X announced it was suing the state of New York over a new law forcing companies to share their content moderation practices. The complaint, filed in Manhattan federal court, argued the legislation was unconstitutional."
    },
    {
        "title": "New York City mayoral hopeful Brad Lander arrested by ICE agents",
        "description": "A politician hoping to become the Democratic mayoral candidate for New York City has been arrested by federal agents.",
        "url": "https://news.sky.com/story/new-york-city-mayoral-hopeful-brad-lander-arrested-by-ice-agents-13385110",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brad-lander-ice-fbi_6944631.jpg?20250617185017",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-17 17:00:00",
        "Headline": "The politician, who is running to become the Democratic mayoral candidate for the region, was detained while escorting a defendant out of an immigration court.",
        "Content": " A politician hoping to become the Democratic mayoral candidate for New York City has been arrested by federal agents. Brad Lander was taken into custody while escorting a defendant out of an immigration courtroom after spending the morning observing proceedings. Video of the arrest, posted on his X account by his wife Meg Barnette, showed Mr Lander being confronted by Immigration and Customs Enforcement (ICE) agents. She said her husband was arrested after he \"linked arms\" with the person he was accompanying. As multiple officers, some in plain clothes, grabbed Mr Lander, he was heard repeatedly asking: \"Do you have a judicial warrant?\" While being put into handcuffs, he added: \"You don't have the authority to arrest US citizens,\" before an agent told him: \"You're obstructing.\" Mr Lander, who is also the city's comptroller, or financial officer, was then taken into a lift by the agents. The defendant he was with was also arrested. He was later released from custody after a few hours. The US attorney's office said it was investigating his actions and would decide later whether to charge him with a crime. Mr Lander is currently running in the Democratic Party primary for mayor, with voting closing on Saturday. The New York mayoral election is set for 4 November, with incumbent Eric Adams running as an independent despite being voted in as a Democrat. Speaking after his release, Mr Lander said \"I am just fine\" and \"lost a button\" from his shirt, but added the defendant \"ripped\" from his arms \"doesn't have a lawyer\" and will be held in an ICE detention centre. \"I believe it is important to show up and bear witness and accompany people,\" he said. \"So I am going to keep coming here week after week.\" In a statement, US Department of Homeland Security assistant secretary Tricia McLaughlin said Mr Lander \"was arrested for assaulting law enforcement and impeding a federal officer\". Mr Lander denies this. Sky News' US partner network NBC News reported that Ms Barnette said at a press conference: \"This is not the way we deal with the rule of law, this is not the way people are treated in the United States. \"I feel really rattled and scared, and my husband is a candidate for mayor, is an elected citywide official, is a US citizen.\" Zohran Mamdani, a New York assemblyman and a fellow candidate in the Democratic primaries, shared the video of Mr Lander's arrest and said: \"NYC Comptroller Brad Lander was just arrested by Trump's ICE agents because he asked to see a judicial warrant. \"This is fascism and all New Yorkers must speak in one voice. Release him now.\" Former governor Andrew Cuomo, also running in the primary, added: \"This is the latest example of the extreme thuggery of Trump's ICE out of control - one can only imagine the fear families across our country feel when confronted with ICE.\" Read more from Sky News:Minnesota rocked by 'evil' assassinationElon Musk 'shares drug test results' It comes after New Jersey mayor Ras Baraka was arrested on a trespassing charge outside a federal immigration detention centre in his city in May. He was released hours later, and charges were later dropped by the interim attorney for the state. Mr Baraka has since filed a suit against the attorney alleging false arrest and malicious prosecution. US President Donald Trump and his \"border czar\" Tom Homan have also suggested California governor Gavin Newsom and Los Angeles mayor Karen Bass should be arrested after anti-ICE protests broke out in the city."
    },
    {
        "title": "Donald Trump looked uneasy at G7 summit - his early exit spared him a Ukraine showdown",
        "description": "Now that the smoke clears on Trump's departure, we're seeing consequences beyond the immediate priority in the Middle East.",
        "url": "https://news.sky.com/story/donald-trump-looked-uneasy-at-g7-summit-his-early-exit-spared-him-a-ukraine-showdown-13385085",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-g7-volodymyr-zelenskyy_6944561.jpg?20250617172917",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-06-17 16:06:00",
        "Headline": "Volodymyr Zelenskyy arrived at the G7 leaders' summit in Kananaskis, Canada, after the US president left for Joint Base Andrews. That spared him the spectacle of a showdown over Ukraine.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Now that the smoke clears on Trump's departure, we're seeing consequences beyond the immediate priority in the Middle East. Before that conflict blew up, Ukraine was slated as the big ticket item here. A set-piece show of unity to advance the Ukrainian cause, with its President Volodymyr Zelenskyy feted as a special guest, celebrated and supported. That was before a Russian-friendly US president took an early plane out, the same president who has fragmented an alliance against Moscow's aggression.  This G7 summit was an opportunity for the world's big economies to coalesce around a unified strategy to increase pressure on Russia - without its biggest economy, unity and strategy are undermined. It's entirely in keeping with Donald Trump's input since he took power. We do expect an announcement on new sanctions against Russia. European countries have wanted to lower the price cap on Russian oil, which would be a measure to shrink Putin's war chest. \n                  Trump's words designed to stoke tension, confuse and apply intense pressure on Iran\n                 \n                  As Iran tries to talk its way towards a resolution, Israel has other ideas\n                 \n                  Will Iran and Israel listen to Trump?\n                 Trump gave it a body swerve when he left the gathering, but not before he placed his cards on the table. \"Let's see them do it first,\" referring to European countries. \"When I sanction a country, it costs the US a lot of money. You're talking about billions and billions of dollars.\" Read more:14 killed as Russian missile and drone attacks strike KyivThe 'bunker buster' that could hit Iran's Fordow plantRussian ambassador partly blames UK for Ukrainian drone attack It's not all he had to say on Russia. In a press Q&A upon arrival, he bemoaned the absence of Russia, having been expelled from the G8 in 2014 following its annexation of Crimea. It wasn't what this gathering wanted to see or hear - Trump, the guest who brought the lead balloon to the party. It was an uneasy juxtaposition as the Canadian host Mark Carney welcomed Zelenskyy to the summit and spoke of the importance of using \"maximum pressure\" against Russia. It's a 'maximum' minimised by Trump's absence. Had Donald Trump stuck around, of course, it might have got ugly. On day one, he already looked uneasy in the company of political counterparts he had antagonised from a distance. His early exit spared him the spectacle of a showdown over Ukraine, even if that's something G7 members might have welcomed as an opportunity long overdue. Maybe Trump saw it coming. Maybe it led to his going."
    },
    {
        "title": "As Iran tries to talk its way towards a resolution, Israel has other ideas",
        "description": "Donald Trump's early departure from the G7 was entirely in keeping with a president semi-detached.",
        "url": "https://news.sky.com/story/as-iran-tries-to-talk-its-way-towards-a-resolution-israel-has-other-ideas-13384777",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-iran-israel_6944156.png?20250617101756",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-06-17 04:21:00",
        "Headline": "For now, Donald Trump believes he can reach a deal with the Iranians through dialogue.  With a strong negotiating position, the test is how he exploits the opportunity, and trust will be at the heart of it.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Donald Trump's early departure from the G7 was entirely in keeping with a president semi-detached. He looked an awkward fit in Kananaskis, Alberta - a reluctant guest among political counterparts for whom he remains a curiosity - not in a good way. If he wanted an early 'out', he had a good excuse. They know here, as in the Middle East, that Trump is the pivotal president who can turn war into peace.  In executing the responsibility, he has turned back to the negotiating table. Iranian officials had asked for fresh talks and it seems they have their wish, with a White House offer of discussions on a ceasefire and nuclear deal. They have been here before without success, but the context has clearly changed. Israel-Iran live: Trump proposes talks this week As Iran endeavours to talk its way towards a resolution, Israel has other ideas. It wants the US to supply the bunker-busting bombs it lacks to penetrate Iran's underground nuclear storage sites. \n                  Trump's words designed to stoke tension, confuse and apply intense pressure on Iran\n                 \n                  Donald Trump looked uneasy at G7 summit - his early exit spared him a Ukraine showdown\n                 \n                  Will Iran and Israel listen to Trump?\n                 The Israelis have the ear of the US president. For now, however, Trump believes he can reach a deal with the Iranians through dialogue. His negotiating position is further strengthened by the prospect of answering Israel's call and engaging US weaponry. If and when the Iranians sit down with the Americans for fresh discussions, it will feel like make or break. For the absence of doubt, Donald Trump posted on social media last night: \"Everyone should immediately evacuate Tehran!\" Donald Trump can claim a vindication of his strategy. Negotiations with Iran drifted and - if we assume US assent of the Israeli action - Trump effectively outsourced the military action that's brought Iran to heel. Read more from Sky News:Israel had 'no choice' but to attackIsrael's war against Iran is a gambleTrump meets Starmer at G7 The test of him now is how he exploits the opportunity, and trust will be at the heart of it. The Iranians will consider how they negotiate in good faith with a US president aligned with an Israeli prime minister harbouring ambitions for regime change in their country. For their part, the Israelis will ponder whether they can trust him to deliver, given their more belligerent view on the way forward. And they will have legitimate questions arising from the diplomatic history of a US president big on promises. Whatever Trump states in his covering letter, the CV doesn't read too well."
    },
    {
        "title": "Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals",
        "description": "The head of Britain's biggest energy supplier has claimed his competitors oppose proposals for so-called postcode pricing because they financially benefit from the current system.",
        "url": "https://news.sky.com/story/bosses-of-octopus-energy-and-sse-clash-over-postcode-pricing-proposals-13384994",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wind-farm-wind-power_6840032.jpg?20250226090448",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-17 14:06:00",
        "Headline": "Supporters say the plans could help prevent firms from being paid tens of millions of pounds to stop producing energy, while opponents have dismissed the idea as an unnecessary distraction.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The head of Britain's biggest energy supplier has claimed his competitors oppose proposals for so-called postcode pricing because they financially benefit from the current system. Octopus Energy chief executive Greg Jackson told Sky News his business's rivals were against customers being charged based on where they lived, rather than on a national basis, because they would lose out on profits. He said: \"A very small number of companies that today get paid tens of millions, sometimes in a single day, to turn off wind farms and generate gas elsewhere, don't like it. \"The reason you're seeing that kind of behaviour from the rivals is they are benefiting from the current system that's generating incredible profitability.\" The government is currently considering whether to introduce the policy, which is also known as zonal pricing. Energy secretary Ed Miliband is expected to make a decision on the proposals by this summer. Money blog: Millions may wait months for payouts in Mastercard case Octopus has become Britain's biggest supplier with more than seven million customers. Mr Jackson has been a vocal proponent, as he said he wants to charge customers less and boost government electrification policies by having cheaper electricity costs. Business and economics reporter Zonal pricing would mean electricity bills are based on what region you live in. Some parts of Britain, like northern Scotland, are home to huge energy producers in the form of offshore wind farms.  But rather than feeding electricity to local homes and businesses, power goes into a nationwide auction and is bought to go across Britain. As the energy grid is still wired for the old coal-producing sites rather than the modern renewable generators, it's not straightforward to get electricity from where it's increasingly produced to the places people live and work.  That leads to traffic jams on the grid, blocking paid-for electricity moving to where it's needed and a system where producers can be paid a second time, to power down, and other suppliers, often gas plants, are paid to meet the shortfall.  Zonal pricing is designed to prevent paying the generators for power that can't be used.  It would mean those in Scotland have lower wholesale energy costs while those in the south, where there is less renewable energy production, would have higher wholesale costs. Whether bills go up or down depends on implementation.  Savings from one region could be spread across Britain, lowering bills across the board.  Mr Miliband has said he's not going to decide to raise prices.  However, SSE's chief executive Alistair Phillips-Davies described the policy as a \"distraction\" and said it could affect already agreed-upon upgrades of the national grid that will lower costs. \"I think you've got a very, very small number of people who are asking for this. It's just a distraction. We should remove it now,\" he said. While Octopus Energy estimates that said postcode pricing could be introduced in two to four years, Mr Phillips-Davies said it could take until 2032 before it was implemented, by which time Britain would have \"built much of the networks that are required to get the energy from these places down into the homes and businesses that actually need it\". \"We just need to stay true to the course,\" he added. Unions, as well as industry and energy representatives, have also spoken out against the policy. Opponents include eco-tycoon Dale Vince and trade body UK Steel. A joint letter signed by SSE, UK Steel, Ceramics UK and British Glass, along with the unions GMB, Unite and Unison, said zonal pricing could lead to scaled-back investment due to uncertainty and higher bills. A separate letter signed by 55 investors, including Centrica and the Ontario Teachers' Pension Plan, has also criticised the policy.  However, Mr Jackson said many investors had not voiced opposition, with thousands of small and medium businesses instead backing the policy in the hope of paying less on energy bills."
    },
    {
        "title": "Government to announce another delay to HS2",
        "description": "The government will announce another delay to the beleaguered HS2 project on Wednesday, saying the latest target is now impossible. ",
        "url": "https://news.sky.com/story/government-to-announce-another-delay-to-hs2-13385232",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hs2-transport_6927868.jpg?20250526144244",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-06-17 21:11:00",
        "Headline": "Heidi Alexander will blame the Tories for \"wasting billions\" as official reports reveal a \"litany of failure\" over the troubled project. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The government will announce another delay to the beleaguered HS2 project on Wednesday, saying the latest target is now impossible.  Sky News understands that Transport Secretary Heidi Alexander will announce that the London to Birmingham line will no longer be ready to open by 2033. It is not clear what the new target date will be. Ms Alexander is expected to blame the Tories for a \"litany of failure\" that drove the costs up by £37bn since 2012, when the high-speed rail network was approved by the coalition government. As first reported by The Telegraph, she is also expected to raise concerns that taxpayers may have been defrauded by subcontractors and pledge that \"consequences will be felt\". Ms Alexander's announcement will come alongside the findings of two reviews into HS2, looking into what went wrong and how and when to construct the rest of it. She will tell MPs: \"Billions of pounds of taxpayers' money has been wasted by constant scope changes, ineffective contracts and bad management. \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  MPs vote to decriminalise abortion in England and Wales\n                 \n                  Sir Keir Starmer hits out at politicians who 'shout and scream but do nothing' over grooming gangs\n                 \"It's an appalling mess. But it's one we will sort out.\" HS2 was originally planned to cut journey times and improve connectivity between London and the Midlands and the North. It was given the go-ahead in 2012 with the aim of operating by 2026, but has since been mired in setbacks and spiralling costs. Read More:HS2 boss reveals £100m bill for a railway line 'bat shed' that 'isn't needed'  The initial plan was to build the first phase connecting London and Birmingham, followed by adding two branches to Manchester and Leeds. However, Boris Johnson scrapped the leg to Leeds in 2021, while Rishi Sunak pulled the plug on the remainder of the second phase to Manchester in 2023 because of spiralling costs. The latest time scales give an opening date of between 2029 and 2033 for the London to Birmingham leg, which is under construction. The most recent cost estimate was £49bn to £56.6bn (in 2019 prices), according to a House of Commons research briefing. The original bill for the entire project at 2009 prices, when the idea was first conceived, was supposed to be £37.5bn."
    },
    {
        "title": "Poundland shake-up will see 68 stores and two distribution sites shut",
        "description": "The new owner of the discount retailer Poundland has revealed proposals to close 68 stores and two distribution centres under a shake-up that will also see frozen food and online sales halted.",
        "url": "https://news.sky.com/story/poundland-plans-to-shut-68-stores-and-two-distribution-sites-13384895",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-poundland-pound_6802760.jpg?20250118095137",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-17 10:16:00",
        "Headline": "A recovery plan aimed at restoring profitability leaves around 1,350 jobs at risk and could also see the company end online and frozen food sales.",
        "Content": "The new owner of the discount retailer Poundland has revealed proposals to close 68 stores and two distribution centres under a shake-up that will also see frozen food and online sales halted. Gordon Brothers, the investment firm which snapped up the struggling brand for a nominal sum last week, said its recovery plan \"intended to deliver a financially sustainable operating model for the business after an extended period of under-performance\". The plans are understood to be leaving 1,350 jobs at risk. Money latest: £150 compensation for thousands of energy customers It currently employs 16,000 people across the business. Poundland said it was also seeking store rent reductions more widely under the plans. Sky News reported on Monday that if creditors backed the restructuring, with a vote expected in late August, 250 of Poundland's sites would also see their rent bills reduced to zero. Poundland said its future focus would be on profitable stores, with its web-based operations becoming confined to browsing only. As a result of the new priority, along with a shift away from most chilled and all frozen products, the company said it would no longer need its frozen and digital distribution centre at Darton in South Yorkshire. It was to shut later this year. Poundland also planned to close its national distribution centre at Bilston in the West Midlands early in 2026. The retailer said it expects to end up with between 650 and 700 stores after the overhaul - assuming it achieves court approval. It currently runs around 800 stores across the UK and Ireland but stressed Irish shops, which trade as Dealz, have not been affected. Poundland's struggles in recent years have included increased competition, poorly-received stock and rising costs. Its managing director, Barry Williams, said: \"It's no secret that we have much work to do to get Poundland back on track. \"While Poundland remains a strong brand, serving 20 million-plus shoppers each year, our performance for a significant period has fallen short of our high standards and action is needed to enable the business to return to growth. \"It's sincerely regrettable that this plan includes the closure of stores and distribution centres, but it's necessary if we're to achieve our goal of securing the future of thousands of jobs and hundreds of stores. \"It goes without saying that if our plans are approved, we will do all we can to support colleagues who will be directly affected by the changes.\""
    },
    {
        "title": "EasyJet cabin crews in Spain to go on strike next week",
        "description": "EasyJet cabin crews in Spain will go on strike over their pay for three days next week.",
        "url": "https://news.sky.com/story/easyjet-cabin-crews-in-spain-to-go-on-strike-next-week-13385201",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-easyjet-airports-flights_6708185.jpg?20241006142639",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-17 20:04:00",
        "Headline": "The airline said it intended to operate normally and hoped to avoid any disruption.",
        "Content": "EasyJet cabin crews in Spain will go on strike over their pay for three days next week. The USO union in Spain said the industrial action would take place from Wednesday 25 June to Friday 27 June. It said more than 650 flight attendants – based in Alicante, Barcelona, Malaga and Palma de Mallorca – could be involved. However, the airline said it intended to operate normally and hoped to avoid any disruption. The union said easyJet cabin crews​​​​​​ earn much less in Spain than in other countries. It added that the aim of the strike was \"to level the crews' working and wage conditions in Spain with the ones at other bases of the company in Europe\". Read more from Sky News:Cause of Spain and Portugal power cuts revealedElon Musk posts 'drug test results'Israeli tanks 'kill 51 people waiting for aid' A spokesperson for the airline said it would do everything possible to minimise the impact of the strikes. They added that easyJet employed crews in eight different countries \"on local terms and conditions\". Regulations in Spain compel airline workers to provide a minimum level of service during industrial action to limit disruption."
    },
    {
        "title": "23andMe fined millions by UK watchdog over 'profoundly damaging' cyber attack ",
        "description": "The genetic testing company 23andMe is being fined &#163;2.31m by the UK's privacy watchdog over their 2023 data breach that saw the personal information of seven million people stolen.",
        "url": "https://news.sky.com/story/23andme-fined-millions-by-uk-watchdog-over-profoundly-damaging-cyber-attack-13384880",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-23andme-genetics-company_6578306.jpg?20250617112139",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-17 09:35:00",
        "Headline": "James Moss, the director of cyber investigations at law firm Addleshaw Goddard, told Sky News the ICO's fine was \"about as serious as it gets\".",
        "Content": "\n          Science and Technology reporter\n       The genetic testing company 23andMe is being fined £2.31m by the UK's privacy watchdog over their 2023 data breach that saw the personal information of seven million people stolen. More than 150,000 Britons had their personal information taken by hackers. Family trees, health reports, race and ethnicity information may all have been stolen, along with addresses, dates of birth and profile pictures. A database shared on dark web forums and viewed by Sky News' US partner network, NBC News, contained a list of 999,999 people who allegedly had Ashkenazi Jewish heritage, according to 23andMe's genetic profiling. \"Crazy. This could be used by Nazis,\" said one person at the time who appeared in the database. The ICO's fine comes after a joint investigation with Canada's privacy watchdog. It is the most severe punishment the watchdog can impose and reflects repeated failures to protect extremely sensitive data, according to the information commissioner. \"This was a profoundly damaging breach that exposed sensitive personal information, family histories, and even health conditions of thousands of people in the UK,\" said John Edwards, the UK's Information Commissioner. \n                  New leukaemia treatment hailed as 'milestone' in cancer management\n                 \n                  Gonorrhoea vaccine programme to launch after rise in diagnoses\n                 \n                  One million blood donors needed to meet demand and avoid 'red alert' shortage, NHS warns\n                 \"23andMe failed to take basic steps to protect this information. \"Their security systems were inadequate, the warning signs were there, and the company was slow to respond. This left people's most sensitive data vulnerable to exploitation and harm.\" Despite the attack starting in April 2023, 23andMe did not open an investigation until October that year, when an employee discovered the stolen data had been advertised for sale on Reddit. The company's defences only became strong enough to halt the attack by the end of that year - but that was not the end of 23andMe's troubles. 'Sue you to oblivion' By March this year, the best-known genetic testing company in the world had filed for bankruptcy, unable to rebuild trust after the hack and make enough money from its business model. It will now be sold for $305m (£225m) to 23andMe's original co-founder, Anne Wojcicki and her non-profit TTAM. But a blistering exchange in the US Senate last week laid out fresh concerns for the sensitive data users have shared with 23andMe. Senator Josh Hawley accused Joseph Selsavage, the interim chief executive of 23andMe, of lying to his customers when he says they can delete their genetic data from the company's databases. \"You're not deleting it,\" he said, \"because if you were, your company wouldn't be worth $300m.\" \"I hope [users] will rush to the courthouse [...] to sue you into oblivion.\" Mr Selsavage denied Senator Hawley's claims, saying his company deletes all user data when requested. James Moss, the director of cyber investigations at law firm Addleshaw Goddard, told Sky News the ICO's fine was \"about as serious as it gets\" but an enforcement order, a notice from the watchdog that dictates how data can be used in the future, would be \"more important\". \"That's the notice which looks forward and says, 'look, you have a legal obligation under UK law to continue to protect the personal data of these 150,000 UK citizens'. And that's arguably the more important,\" he said. A total of 28 US attorneys general last week launched a legal case against 23andMe to protect user data during the sale, and urged customers to purge their information from the firm's database, given the sensitivity of the data it has collected over the years. 23andMe already sells its users' genetic data and has made at least 30 deals with biotech and pharmaceutical companies like GSK. A spokesperson for the 23andMe buyer, TTAM, told Sky News the non-profit had made \"several binding commitments to enhance protections for customer data and privacy\". These include allowing individuals to delete their account and opt out of research at any time, notifying customers at least two days before the deal closes about what TTAM's acquisition means for them and agreeing, if TTAM were to sell the company again, only to sell it to someone who agrees to adopt TTAM's privacy polices and comply with data laws. Customers will also be offered two years of free Experian identity theft monitoring, while TTAM will continue to allow \"de-identified data\" to be used for scientific and biomedical research at universities and nonprofits. No money for UK victims The £2.31m fine money will go to the state rather than to individuals affected by the hack. In the US, victims of the hack won $30m in a class action lawsuit last year, but that's not an option in the UK, despite the incredibly sensitive information that was shared. Read more from Sky News:Trump mobile service announcedAre your smart devices spying on you?'Forever chemical' found in dozens of UK rivers, study finds Class action lawsuits for data breaches could \"improve and increase accountability for data-protection breaches\", according to solicitor Alex Lawrence Archer from the data law agency AWO. \"But also help individuals who are affected get something back, help them get redress, because a fine paid to the ICO doesn't achieve that. Although [the fine] is welcome, it doesn't help individuals.\" For anyone thinking about using one of the many genetic testing companies that have sprung up since 23andMe was founded in 2006, Mr Lawrence Archer has cautionary advice. \"Handing over your genetic data is a really big step, and it's something that [...] people have hitherto been encouraged to take quite lightly,\" he said. \"There's no hard and fast rule like you should or you shouldn't do it, but it's something that you should think really carefully about. \"It can be a quite permanent step that's very difficult to undo. It's not something that should be done lightly.\" 23andMe has been contacted for comment."
    },
    {
        "title": "London-listed Tullow Oil sees merger with Meren Energy collapse",
        "description": "Talks about a merger involving Tullow Oil, the London-listed African oil explorer, and Meren Energy, a Canadian-listed peer, have collapsed.",
        "url": "https://news.sky.com/story/london-listed-tullow-oil-sees-merger-with-meren-energy-collapse-13385128",
        "image_url": "https://e3.365dm.com/19/12/1920x1080/skynews-tullow-oil_4861583.jpg?20191209160330",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-17 17:50:00",
        "Headline": "A tie-up involving London-listed Tullow and Toronto-listed Meren would have created a group with a formidable presence in African oil production, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Talks about a merger involving Tullow Oil, the London-listed African oil explorer, and Meren Energy, a Canadian-listed peer, have collapsed. Sky News has learnt that discussions about a tie-up were progressing as recently as this month but are now said to have been terminated. It was unclear on Tuesday evening what the reason was for the abandonment of the negotiations. Tullow Oil, which has a market valuation of about £275m, is focused on West-African producing assets in Ghana, Gabon and the Ivory Coast. The company has seen its stock plunge dramatically since its peak valuation of about £15bn. Last December, it saw merger talks involving Kosmos Energy fall apart. Meren Energy, which until recently was called Africa Oil Corp, is substantially larger than Tullow Oil in valuation terms. \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  Government to announce another delay to HS2\n                 \n                  Poundland shake-up will see 68 stores and two distribution sites shut\n                 Listed in Canada and Sweden, it has a market capitalisation equivalent to approximately £980m. Run by chief executive Roger Tucker, Meren recently said it had up to $500m to spend on acquiring producing assets in Africa. A spokesman for Tullow Oil declined to comment."
    },
    {
        "title": "Battle to convince MPs to back benefit cuts to more than three million households ",
        "description": "Plans for cuts to benefits which will impact more than three million households will be published today - as the government faces a battle to convince dozens of Labour MPs to back them.",
        "url": "https://news.sky.com/story/battle-to-convince-mps-to-back-benefit-cuts-to-more-than-three-million-households-13385195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-welfare-benefits-health-disability_6859245.jpg?20250317023130",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-17 19:46:00",
        "Headline": "Under pressure from Labour MPs concerned particularly that changes to PIP will drive families into poverty, Liz Kendall will announce new protections in the bill today.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Plans for cuts to benefits which will impact more than three million households will be published today - as the government faces a battle to convince dozens of Labour MPs to back them. Liz Kendall, the welfare secretary, has set out proposals to cut £5bn from the welfare budget - which she has said is \"unsustainable\" and \"trapping people in welfare dependency\". Disabled people claiming PIP, the personal independence payment which helps people - some of them working - with the increased costs of daily living, face having their awards reviewed from the end of next year. An estimated 800,000 current and future PIP recipients will lose an average of £4,500 a year, according to a government assessment.  The government also intends to freeze the health element of Universal Credit, claimed by more than two million people, at £97 a week during this parliament, and cut the rate to £50 for new claimants. Under pressure from Labour MPs concerned particularly that changes to PIP will drive families into poverty, Ms Kendall will announce new protections in the bill today. Sky News understands they include a 13-week transition period for those losing PIP; a higher rate of Universal Credit for people with the most serious conditions; and a commitment that disabled people who take a job will not immediately lose their benefits. \n                  First Minister John Swinney says winter fuel payment in Scotland 'will not be less than UK benefit'\n                 \n                  Ministers on resignation 'watch-list' over welfare reforms\n                 \n                  Economy shock overshadows Reeves' big day\n                 Some 40 Labour MPs have signed a letter refusing to support the cuts; and dozens of others have concerns, including ministers.  Ms Kendall is determined to press ahead, and has said the number of new PIP claimants has doubled since 2019 - at 34,000, up from 15,000. Ministers say 90% of current claimants will not lose their benefits; and that many people will be better off - with the total welfare bill set to continue to rise over this parliament. To keep the benefit, claimants must score a minimum of four points out of eight on one of the daily living criteria. Ministers say claimants with the most serious conditions, who cannot work, will not face constant reassessments. A £1bn programme is proposed, intended to give disabled people who can work tailored support to find jobs. Some Labour MPs have angrily opposed the reforms - which will be voted on later this month. Last night in a parliamentary debate, Labour MP for Poole Neil Duncan-Jordan disputed the Department for Work and Pensions (DWP) figures. Read More:Minister tells MPs controversial disability benefit reforms will go aheadBig benefits cuts are imminent - here's what to expect He said: \"We already know that PIP is an underclaimed benefit. The increase in claims is a symptom of declining public health and increased financial hardship disabled people are facing. \"We have the same proportion of people on working-age benefits as in 2015. This is not an economic necessity, it's a political choice.\" Rachael Maskell, Labour MP for York, called the proposals \"devastating \". She said: \"We must change direction and not proceed with these cuts.\" Disability groups say they fear an increase in suicides and mental health conditions. The government's own assessment forecast an extra 250,000 people could be pushed into poverty - including 50,000 children. It did not include the impact of people moving into work. Ms Kendall was urged by MPs on the Commons Work and Pensions committee to delay the reforms, to carry out an impact assessment, but wrote back to the committee saying the reforms were too urgent to delay - and that MPs would be able to amend the legislation."
    },
    {
        "title": "MPs vote to decriminalise abortion in England and Wales",
        "description": "MPs have voted to decriminalise abortion in England and Wales.",
        "url": "https://news.sky.com/story/mps-vote-to-decriminalise-abortion-in-historic-vote-13385137",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-abortion-pro-choice_6943985.jpg?20250617033322",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-17 17:54:00",
        "Headline": "The amendment to the Crime and Policing Bill, abolishing the prosecution of women in England and Wales for terminating their pregnancy at any stage, passed by 379 votes to 137.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  MPs have voted to decriminalise abortion in England and Wales. The amendment to the Crime and Policing Bill, abolishing the prosecution of women for terminating their pregnancy at any stage, passed by 379 votes to 137. It represents the biggest shake-up in reproductive rights for almost 60 years. Labour MP Tonia Antoniazzi, who tabled the so-called \"New Clause One\" (NC1), said it would ensure women do not face investigation, arrest, prosecution or imprisonment in relation to any pregnancies. She said the current \"Victorian\" laws had been used against vulnerable women, citing cases such as Nicola Packer, who was prosecuted on suspicion of having an illegal abortion. She was found not guilty in May. \"Nicola's story is deplorable, but there are many others,\" Ms Antoniazzi said. Abortion in England and Wales is currently a criminal offence but is legal with an authorised provider for up to 24 weeks after conception. The procedure is allowed after this time in very limited circumstances. It is also legal to take prescribed related medication at home if a woman is less than 10 weeks pregnant. Ms Antoniazzi said NC1 was \"a narrow, targeted measure\" that would not change how abortion services were provided or the rules under the 1967 Abortion Act. She said: \"The 24 [week] limit remains. Abortions still require the approval of signatures of two doctors, and women would still have to meet the grounds laid out in the Act.\" The MP said that meant healthcare professionals \"acting outside the law and abusive partners using violence or poisoning to end a pregnancy would still be criminalised, as they are now.\" She added: \"This piece of legislation will only take women out of the criminal justice system because they are vulnerable and they need our help. \"As I have said before, and I will say it again, just what public interest is this serving? This is not justice, it is cruelty and it has got to end.\"  The change will not come into effect immediately as the Crime and Policing Bill is still making its way through Parliament. A separate amendment, put forward by Labour MP Stella Creasy, went further with a measure to \"lock in\" the right of a person to have an abortion while protecting those who help them. However, her amendment was not voted on because Ms Antoniazzi's passed, as expected. Conservative MP Sir Edward Leigh, speaking against both amendments, described them as \"not pro-woman\" and argued they \"would introduce sex-selective abortion\". How did MPs vote? MPs were given a free vote on the amendment, as is typically the case with so-called matters of conscience. A breakdown of the vote showed it was passed overwhelmingly by Labour and Lib Dem MPs. Read more:Sky poll reveals public's view on decriminalisation Just eight Conservative MPs voted in favour, while all Reform UK MPs opposed the amendment, with the exception of the party's leader Nigel Farage, who abstained. Sir Keir Starmer was not present for the vote as he is currently in Canada for the G7 summit, but said earlier that his \"longstanding in-principle position is that women have the right to a safe and legal abortion\". The issue of women investigated by police over suspected illegal abortions has been in the spotlight due to several recent high-profile cases. Ms Packer was cleared by a jury last month after taking prescribed abortion medicine at home when she was around 26 weeks pregnant, beyond the legal limit of 10 weeks. In the Commons, Ms Antoniazzi cited another case of a young mother who was jailed for two years after she was forced to take illegal abortion medication by her abusive partner. He was never investigated."
    },
    {
        "title": "Sir Keir Starmer hits out at politicians who 'shout and scream but do nothing' over grooming gangs",
        "description": "Sir Keir Starmer has said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry. ",
        "url": "https://news.sky.com/story/sir-keir-starmer-hits-out-at-politicians-who-shout-and-scream-but-do-nothing-over-grooming-gangs-13385032",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-g7-summit_6944456.jpg?20250617154856",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-17 14:51:00",
        "Headline": "The prime minister defended accusing the Tories of 'jumping on a far right bandwagon' when the called for a national inquiry into grooming gangs in January, as they did not launch one while in goverment. ",
        "Content": " Sir Keir Starmer has said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry.  Speaking to Sky News's political editor Beth Rigby, the prime minister was asked if he regretted saying in January that those calling for a national probe into paedophile rings were \"jumping on a far-right bandwagon\" - given he has now agreed to one.  Politics latest: Baroness Casey asks people to 'keep calm' about grooming gang ethnicity data Sir Keir said he was \"really clear\" he was talking about the Tories, who were demanding an inquiry they never set up when they were in government. He said: \"I was calling out those politicians. \"I am frustrated with politics when people shout and scream a lot and do nothing when they've got the opportunity to do it. It's one of the worst aspects of politics, in my view.\" Sir Keir also said there \"must be accountability\" for authorities who \"shied away\" from talking about the ethnicity of perpetrators for fear of being branded racist, as exposed in a report by Baroness Casey published on Monday.  \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  MPs vote to decriminalise abortion in England and Wales\n                 \n                  'Britain's darkest secret': Grooming survivor calls for apology from Starmer\n                 Asked if he is happy for \"social workers, policemen and people that failed\" to be held accountable, the prime minister said: \"Where the inquiry uncovers failure or wrongdoing, then there should absolutely be accountability. \"That is amongst the purposes of an inquiry, and it's a statutory inquiry... which will therefore mean there is power to compel evidence of witnesses because it's important that it is comprehensive and important that it gets to every single issue. And as part of that process, there's accountability for individuals who did wrong.\"  Baroness Casey was asked to produce an audit of sexual abuse carried out by grooming gangs in England and Wales in January, when comments by tech billionaire Elon Musk brought the scandal back into the spotlight. The government initially resisted calls from the Tories for a national inquiry into grooming gangs, saying they wanted to focus on implementing the recommendations of Professor Alexis Jay's seven-year review into child abuse. The review concluded in 2022 but the Conservatives did not implement its recommendations before they lost the election last July. Read More:Grooming gangs report author says 'do-gooders' giving racists 'more ammunition'Nationwide police operation on grooming gangs announced The government's position has changed following Baroness Casey's audit, which recommended an inquiry. Her report found that ethnicity data is not recorded for two-thirds of grooming gang perpetrators. However at a local level in three police forces - Greater Manchester, South Yorkshire and West Yorkshire - \"there has been a disproportionality of group-based child sexual exploitation offending by men of Asian ethnicity\". The cross bench peer said instead of looking into whether ethnicity or cultural factors played a part, authorities \"avoided the topic altogether for fear of appearing racist\", and this warranted further investigation."
    },
    {
        "title": "'Britain's darkest secret': Grooming survivor calls for apology from Starmer",
        "description": "A rape survivor who was abused by dozens of men has called on the prime minister to apologise for the delay in calling for a national inquiry into the grooming scandal.",
        "url": "https://news.sky.com/story/britains-darkest-secret-grooming-survivor-calls-for-apology-from-starmer-13385143",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rotherham-rape_6944698.jpg?20250617201707",
        "type": "Politics",
        "Author": "Becky Johnson",
        "Date Published": "2025-06-17 18:01:00",
        "Headline": "\"Elizabeth\", whose name we have changed to protect her identity, also believes that had the authorities been prepared to confront concerns about the ethnicity of offenders and investigate communities more closely, she could have been spared the abuse she suffered.",
        "Content": "\n          Social Affairs correspondent\n              @BeckyJohnsonSky\n  A rape survivor who was abused by dozens of men has called on the prime minister to apologise for the delay in calling for a national inquiry into the grooming scandal. \"Elizabeth\", whose name we have changed to protect her identity, was abused by a gang of men in Rotherham from the age of 14. She was also trafficked to other cities and says she was raped by so many men over the course of more than three years she doesn't know the exact number. She says all her abusers were of Pakistani heritage. After Louise Casey's explosive report revealed the ethnicity of perpetrators had been shied away from by the authorities, Elizabeth says Sir Keir Starmer owes survivors an apology \"not just for holding back on the inquiry, because he could have done this six months ago, but also for the insults that followed\". She says it was incorrect of the prime minister to accuse people of jumping on a \"far-right bandwagon\". \"Survivors and families have not done that. You have whistleblowers, you know, it's concerned people wanting justice for child abuse,\" she says. She also believes that had the authorities been prepared to confront concerns about the ethnicity of offenders and investigate communities more closely, she could have been spared the abuse she suffered. \"Going back, the intelligence, everything, I should never have been a victim,\" she says. Read more from Sky News:Man who murdered two women on Christmas Day jailedElon Musk posts 'negative drug test results'New York mayoral hopeful arrested by ICE agents Many are angry it has taken 11 years for politicians to accept the issue Shockingly, in Rotherham, the truth has been known for more than a decade. In 2014 a report by Alexis Jay, who went on to chair a national inquiry into the wider issue of child sexual exploitation, found there were at least 1,400 victims of grooming in the town, with the perpetrators predominantly of Pakistani heritage.  Many here, including Elizabeth, are angry it has taken 11 years for politicians to accept the issue, despite scandals emerging in a number of towns and cities across Britain. \"It's a question still that needs to be answered. I do think it was because they wanted to be politically correct,\" she says. 'They silenced the wrong people' She's disappointed but unsurprised by the revelation that Whitehall officials wanted to help the authorities in Rotherham cover up the scandal: \"It does explain a lot because I've always thought that how organised Rotherham was - how possibly could they have pulled it off themselves?\" She believes the result of years of denial by the authorities has meant perpetrators were protected. She describes the survivors of grooming as \"Britain's darkest secret\", adding, \"they silenced the wrong people and we need the truth. Why did they do it?\". Sir Keir 'frustrated' with politicians who 'shout and scream but do nothing' Sir Keir said he gets \"frustrated\" with politicians who \"shout and scream but do nothing\" as he defended past comments about a grooming gangs inquiry.  Speaking to Sky News's political editor Beth Rigby, the prime minister was asked if he regretted saying in January that those calling for a national probe into paedophile rings were \"jumping on a far-right bandwagon\" - given he has now agreed to one. Sir Keir said he was \"really clear\" he was talking about the Tories, who were demanding an inquiry they never set up when they were in government. He said: \"I was calling out those politicians. I am frustrated with politics when people shout and scream a lot and do nothing when they've got the opportunity to do it. It's one of the worst aspects of politics, in my view.\""
    },
    {
        "title": "Government to announce another delay to HS2",
        "description": "The government will announce another delay to the beleaguered HS2 project on Wednesday, saying the latest target is now impossible. ",
        "url": "https://news.sky.com/story/government-to-announce-another-delay-to-hs2-13385232",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hs2-transport_6927868.jpg?20250526144244",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-17 21:11:00",
        "Headline": "Heidi Alexander will blame the Tories for \"wasting billions\" as official reports reveal a \"litany of failure\" over the troubled project. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The government will announce another delay to the beleaguered HS2 project on Wednesday, saying the latest target is now impossible.  Sky News understands that Transport Secretary Heidi Alexander will announce that the London to Birmingham line will no longer be ready to open by 2033. It is not clear what the new target date will be. Ms Alexander is expected to blame the Tories for a \"litany of failure\" that drove the costs up by £37bn since 2012, when the high-speed rail network was approved by the coalition government. As first reported by The Telegraph, she is also expected to raise concerns that taxpayers may have been defrauded by subcontractors and pledge that \"consequences will be felt\". Ms Alexander's announcement will come alongside the findings of two reviews into HS2, looking into what went wrong and how and when to construct the rest of it. She will tell MPs: \"Billions of pounds of taxpayers' money has been wasted by constant scope changes, ineffective contracts and bad management. \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  MPs vote to decriminalise abortion in England and Wales\n                 \n                  Sir Keir Starmer hits out at politicians who 'shout and scream but do nothing' over grooming gangs\n                 \"It's an appalling mess. But it's one we will sort out.\" HS2 was originally planned to cut journey times and improve connectivity between London and the Midlands and the North. It was given the go-ahead in 2012 with the aim of operating by 2026, but has since been mired in setbacks and spiralling costs. Read More:HS2 boss reveals £100m bill for a railway line 'bat shed' that 'isn't needed'  The initial plan was to build the first phase connecting London and Birmingham, followed by adding two branches to Manchester and Leeds. However, Boris Johnson scrapped the leg to Leeds in 2021, while Rishi Sunak pulled the plug on the remainder of the second phase to Manchester in 2023 because of spiralling costs. The latest time scales give an opening date of between 2029 and 2033 for the London to Birmingham leg, which is under construction. The most recent cost estimate was £49bn to £56.6bn (in 2019 prices), according to a House of Commons research briefing. The original bill for the entire project at 2009 prices, when the idea was first conceived, was supposed to be £37.5bn."
    },
    {
        "title": "Former Tory MP admits harassing ex-wife",
        "description": "A former Conservative MP has admitted harassing their ex-wife.",
        "url": "https://news.sky.com/story/katie-wallis-former-tory-mp-admits-harassing-ex-wife-13384973",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-katie-wallis-cardiff_6944387.jpg?20250617145507",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-17 13:25:00",
        "Headline": "Wallis, previously known as Jamie, was the MP for Bridgend in South Wales between 2019 and 2024.",
        "Content": "A former Conservative MP has admitted harassing their ex-wife. Katie Wallis, who was previously known as Jamie, was the MP for Bridgend from 2019 until last year's election. On Tuesday, the 41-year-old admitted the \"harassment without violence\" of Rebecca Wallis between February and March of this year. At Cardiff Magistrates' Court, Wallis pleaded guilty to leaving her a number of messages. Defending, Narita Bahra KC, said her client did not wish to put their former partner, or their families, through anything more. \"He has, on balance, taken the pragmatic view, and recognises that he has previously had a public profile and taken the view that he can be rearraigned,\" she said. A psychiatric assessment and a pre-sentence report will be sought ahead of the sentencing hearing. \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 \n                  Barry Island: Teenager bailed after Taha Soomro, 16, dies at amusement park\n                 \n                  Paria Veisi: Woman who disappeared after leaving work died of stab wounds, coroner told\n                 Ms Bahra said it would examine what impact Wallis's gender transition had on their mental health during the offending period. The former MP came out as transgender in 2022, the first UK MP to do so, telling Sky News at the time that they hoped to start the gender transition process \"as quickly as possible\". Later that year, they received a driving ban and fine for fleeing the scene after a car crash. Wallis, who wore a black cardigan over a white shirt, spoke only to confirm their details and enter their plea. \"My preferred name is Katie, but my legal name is still Jamie,\" Wallis said. Read more from Sky News:Man who murdered two women on Christmas Day jailed for lifeHow Clean Is Your House? presenter Kim Woodburn dies They arrived late to court, having waited for members of the press and media to enter the courtroom before they did. Wallis was released on bail and will be sentenced on 14 July."
    },
    {
        "title": "Abortion debate reignited as Sky poll reveals public's view on decriminalisation ahead of Commons vote",
        "description": "A small group have gathered in the main square in the centre of Birmingham, and it's a real mix of people. There are older figures from the community, young students, as well as groups of friends and some families.",
        "url": "https://news.sky.com/story/abortion-debate-reignited-as-sky-poll-reveals-publics-view-on-decriminalisation-ahead-of-commons-vote-13384763",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-pro-life-pro-choice_6943979.jpg?20250617031155",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-06-17 00:41:00",
        "Headline": "The UK is majority pro-choice but, as parliament sets to vote on two amendments on abortion laws this week, there is likely to be a loud debate from the anti-abortion movement which has been energised by the Trump administration.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  A small group have gathered in the main square in the centre of Birmingham, and it's a real mix of people. There are older figures from the community, young students, as well as groups of friends and some families. On closer inspection, you can make out candles and rosary beads, signalling it's some kind of vigil. As hymns start to be sung, it's revealed to be a gathering to protest against abortion. Nearly 90% of this country is pro-choice, but a small, vocal minority is becoming more organised in the UK. Energised by the Trump administration, young and old activists in the UK anti-abortion movement have become more motivated to get their message across. And all this is happening just as abortion laws in the UK could be about to go through the most significant change in over 50 years. Nearly three years on from the ruling reversing Roe v Wade - a landmark case that once made abortion legal in the US - the age-old abortion debate has become even more political in the UK. A breakthrough moment came when Vice President JD Vance criticised the UK laws on abortion buffer zones - areas outside clinics where police are allowed to use their discretion to stop anyone harassing women entering abortion clinics. \n                  Police admit failures in Harry Dunn case after report finds officers prioritised suspect's welfare\n                 \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  Missing teen Cole Cooper: Grieving mum alleges 'third party' involved in death\n                 Explained: What are the UK's abortion laws? One of the cases cited by the vice president was that of Isabel Vaughan-Spruce. She's a lifelong anti-abortion activist who has been handing out leaflets outside clinics for 20 years. Since buffer zones came into force, she now visits to silently pray once a week. In 2022, she was arrested outside an abortion clinic for silent prayer and taken to court, although the charges were later dropped. She also received £13,000 in a civil claim against West Midlands Police, which did not admit liability. \"They actually asked me what I was doing, and I said, well, I'm just physically standing here. I might be praying in my head, but nothing out loud. And on that basis, they made an arrest. I was heavily searched, I was taken to the police station, locked in a police cell for hours before being questioned under caution. And then, eventually, I went to court. \"I believe that abortion centres are like the modern-day Calvary. This is where the innocent are being put to death. I might not be physically interacting with anybody or stopping anyone or talking to anyone, just to be there in prayer is really, really important from a spiritual perspective.\" For people like Ailish McEntee, any type of protest is a distraction, which she says is not wanted by the women who come to the clinic she works at in London. She's hoping that this week MPs will go further on abortion laws and pass an amendment through the Commons to decriminalise abortion for anyone seeking an abortion up to 24 weeks. \"The law itself works very well for the majority of people, but for those individuals in those kind of really high-risk domestic abuse situations... they maybe can't make it to a clinic, they might seek abortion care from those kind of unregulated providers. \"So this amendment would take away that decriminalisation of women themselves. And it's a really strange part of the law that we have. \"I think particularly in recent years, with Roe v Wade overturning and Donald Trump winning the election again, I think it's really pushed forward the anti-choice rhetoric that has always been there, but it's absolutely ramping up.\" According to polling by Sky News and YouGov, 55% of people are in favour of the law changing to stop women being criminalised for their own abortion before 24 weeks. Surprisingly though, 22% said they believe women should be investigated or imprisoned for abortion after 24 weeks. Stella Creasy is one of the MPs laying down an amendment to try to decriminalise abortion. \"There's no other health care provision that we see with a criminal foundation in this way and it has a very real practical consequence. \"We've seen some incredibly vulnerable women and girls who didn't even know that they were pregnant who have late-term miscarriages finding themselves with police officers rather than counsellors at their hospital beds finding themselves under suspicion for months, if not years, and I just don't think that's where the British public are at.\" But Rachel is concerned by this amendment. She runs sessions at the UK arm of Rachel's Vineyard - a faith-based organisation originally founded in the United States, dedicated to, in their words, \"healing the trauma of abortion\". They frame abortion not as a medical procedure, but as a harm to mothers and fathers. \"With all sudden deaths, whether you are 80 years of age or you're 26 weeks born, you know, out of the womb, and you've died, you've sadly died, we need to be able to investigate that. For us to have compassion, we need to have justice.\" In Northern Ireland, where the decriminalisation battle was won in 2019, I met Emma, who fought on the campaign at Alliance for Choice. She says police searches were a daily routine for her, and since 2019, she has been able to continue helping women navigate abortion care without the threat of being investigated. Read more:Farage: Abortion 'ludicrous' up to 24 weeksPro-choice campaigners back legal changeWoman not guilty of illegal abortionSocial media's illicit abortion trade Orfhlaith Campbell should have been one of the lucky ones. She was able to seek a medical abortion at 23 weeks in Northern Ireland, two years after it had been decriminalised, but she says she had to fight to get the care she needed. She was on the cusp of the medical time limit when she suffered a premature rupture of membranes, went into labour and was told she would likely develop sepsis. \"I would have died and my daughter was dying, I could feel her dying, and it was a compassionate choice. When we got the post-mortem after, the infection had went into her wee body too, and she had nuclear debris in her lungs. If she had survived at all, it would have been a very, very painful existence. \"So yes, I had to break through the stigma that had been ingrained in me in Northern Ireland. I had to break through legal fights and the barriers that were being put in place. But I was strong enough to know that that was compassionate and that healthcare was needed both for me and her.\" The UK is majority pro-choice, and our polling shows the majority are for decriminalising abortion. But activists who are against abortion are energised by the changing landscape of the debate in the US. As parliament sets to vote on two amendments on abortion laws this week and potentially pulls in one direction, activists will likely only get louder and become more effective at getting their message across."
    },
    {
        "title": "G7 - Trump walks out, Starmer holds his breath",
        "description": "&#160;<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>&#160;&#160; ",
        "url": "https://news.sky.com/story/g7-trump-walks-out-starmer-holds-his-breath-13384818",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-17 07:01:00",
        "Headline": "No subtitle found",
        "Content": " 👉Listen to Politics at Sam and Anne's on your podcast app👈    Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. President Donald Trump has made a hasty exit from the G7 conference in Canada, leaving questions about collective diplomacy and his promise to bring peace to an increasingly violent Middle East. The White House insists his return is to deal with \"important matters\", while Mr Trump himself has hinted his swift exit is for something \"big\". How will Keir Starmer and allies navigate talks following the US president's departure? Progress has been made on car tariffs and aerospace, but where does this leave the rest of the US-UK trade deal?"
    },
    {
        "title": "23andMe fined millions by UK watchdog over 'profoundly damaging' cyber attack ",
        "description": "The genetic testing company 23andMe is being fined &#163;2.31m by the UK's privacy watchdog over their 2023 data breach that saw the personal information of seven million people stolen.",
        "url": "https://news.sky.com/story/23andme-fined-millions-by-uk-watchdog-over-profoundly-damaging-cyber-attack-13384880",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-23andme-genetics-company_6578306.jpg?20250617112139",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-17 09:35:00",
        "Headline": "James Moss, the director of cyber investigations at law firm Addleshaw Goddard, told Sky News the ICO's fine was \"about as serious as it gets\".",
        "Content": "\n          Science and Technology reporter\n       The genetic testing company 23andMe is being fined £2.31m by the UK's privacy watchdog over their 2023 data breach that saw the personal information of seven million people stolen. More than 150,000 Britons had their personal information taken by hackers. Family trees, health reports, race and ethnicity information may all have been stolen, along with addresses, dates of birth and profile pictures. A database shared on dark web forums and viewed by Sky News' US partner network, NBC News, contained a list of 999,999 people who allegedly had Ashkenazi Jewish heritage, according to 23andMe's genetic profiling. \"Crazy. This could be used by Nazis,\" said one person at the time who appeared in the database. The ICO's fine comes after a joint investigation with Canada's privacy watchdog. It is the most severe punishment the watchdog can impose and reflects repeated failures to protect extremely sensitive data, according to the information commissioner. \"This was a profoundly damaging breach that exposed sensitive personal information, family histories, and even health conditions of thousands of people in the UK,\" said John Edwards, the UK's Information Commissioner. \n                  New leukaemia treatment hailed as 'milestone' in cancer management\n                 \n                  Gonorrhoea vaccine programme to launch after rise in diagnoses\n                 \n                  One million blood donors needed to meet demand and avoid 'red alert' shortage, NHS warns\n                 \"23andMe failed to take basic steps to protect this information. \"Their security systems were inadequate, the warning signs were there, and the company was slow to respond. This left people's most sensitive data vulnerable to exploitation and harm.\" Despite the attack starting in April 2023, 23andMe did not open an investigation until October that year, when an employee discovered the stolen data had been advertised for sale on Reddit. The company's defences only became strong enough to halt the attack by the end of that year - but that was not the end of 23andMe's troubles. 'Sue you to oblivion' By March this year, the best-known genetic testing company in the world had filed for bankruptcy, unable to rebuild trust after the hack and make enough money from its business model. It will now be sold for $305m (£225m) to 23andMe's original co-founder, Anne Wojcicki and her non-profit TTAM. But a blistering exchange in the US Senate last week laid out fresh concerns for the sensitive data users have shared with 23andMe. Senator Josh Hawley accused Joseph Selsavage, the interim chief executive of 23andMe, of lying to his customers when he says they can delete their genetic data from the company's databases. \"You're not deleting it,\" he said, \"because if you were, your company wouldn't be worth $300m.\" \"I hope [users] will rush to the courthouse [...] to sue you into oblivion.\" Mr Selsavage denied Senator Hawley's claims, saying his company deletes all user data when requested. James Moss, the director of cyber investigations at law firm Addleshaw Goddard, told Sky News the ICO's fine was \"about as serious as it gets\" but an enforcement order, a notice from the watchdog that dictates how data can be used in the future, would be \"more important\". \"That's the notice which looks forward and says, 'look, you have a legal obligation under UK law to continue to protect the personal data of these 150,000 UK citizens'. And that's arguably the more important,\" he said. A total of 28 US attorneys general last week launched a legal case against 23andMe to protect user data during the sale, and urged customers to purge their information from the firm's database, given the sensitivity of the data it has collected over the years. 23andMe already sells its users' genetic data and has made at least 30 deals with biotech and pharmaceutical companies like GSK. A spokesperson for the 23andMe buyer, TTAM, told Sky News the non-profit had made \"several binding commitments to enhance protections for customer data and privacy\". These include allowing individuals to delete their account and opt out of research at any time, notifying customers at least two days before the deal closes about what TTAM's acquisition means for them and agreeing, if TTAM were to sell the company again, only to sell it to someone who agrees to adopt TTAM's privacy polices and comply with data laws. Customers will also be offered two years of free Experian identity theft monitoring, while TTAM will continue to allow \"de-identified data\" to be used for scientific and biomedical research at universities and nonprofits. No money for UK victims The £2.31m fine money will go to the state rather than to individuals affected by the hack. In the US, victims of the hack won $30m in a class action lawsuit last year, but that's not an option in the UK, despite the incredibly sensitive information that was shared. Read more from Sky News:Trump mobile service announcedAre your smart devices spying on you?'Forever chemical' found in dozens of UK rivers, study finds Class action lawsuits for data breaches could \"improve and increase accountability for data-protection breaches\", according to solicitor Alex Lawrence Archer from the data law agency AWO. \"But also help individuals who are affected get something back, help them get redress, because a fine paid to the ICO doesn't achieve that. Although [the fine] is welcome, it doesn't help individuals.\" For anyone thinking about using one of the many genetic testing companies that have sprung up since 23andMe was founded in 2006, Mr Lawrence Archer has cautionary advice. \"Handing over your genetic data is a really big step, and it's something that [...] people have hitherto been encouraged to take quite lightly,\" he said. \"There's no hard and fast rule like you should or you shouldn't do it, but it's something that you should think really carefully about. \"It can be a quite permanent step that's very difficult to undo. It's not something that should be done lightly.\" 23andMe has been contacted for comment."
    },
    {
        "title": "Artificial solar eclipse created by 'driverless' spacecraft in world first",
        "description": "Two \"driverless\" spacecraft have flown in perfect formation to create a small artificial solar eclipse and \"achieve what no other mission has before\", the European Space Agency (ESA) has said.",
        "url": "https://news.sky.com/story/artificial-solar-eclipse-created-by-driverless-spacecraft-in-world-first-13384970",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-corona-sun-esa_6944366.png?20250617144431",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-17 13:31:00",
        "Headline": "The European Space Agency's synchronised flight allowed a satellite to cast an 8cm-wide shadow onto its sister craft flying 150 metres away.",
        "Content": "\n          Science and Technology reporter\n       Two \"driverless\" spacecraft have flown in perfect formation to create a small artificial solar eclipse and \"achieve what no other mission has before\", the European Space Agency (ESA) has said. The synchronised flight orbiting Earth allowed one of the satellites to cast an 8cm-wide shadow onto its sister craft, flying 150 metres away, by blocking its view from space of the sun's surface. The technique helped the space agency to capture detailed images of the sun's fiery outer atmosphere, called the corona. Scientists increasingly need to study the corona, but find it hard to do so without an eclipse because the sun's surface is one million times brighter. Solar wind, the flow of matter from the sun to outer space, and coronal mass ejections, the eruptions of plasma from the sun, can both interfere with modern technology like satellites – as well as cause displays of the Northern and Southern Lights. It is hoped that studying the corona more closely will help scientists better understand solar weather, as well as answer questions about the sun itself. The images from the Proba-3 mission were taken in March but have only been released by the space agency this week. \"We can create our eclipse once every 19.6-hour orbit, while total solar eclipses only occur naturally around once, very rarely twice a year,\" said Andrei Zhukov from the Royal Observatory of Belgium. \"On top of that, natural total eclipses only last a few minutes, while Proba-3 can hold its artificial eclipse for up to six hours.\" Read more from Sky News:Trump mobile service announcedAre your smart devices spying on you?'Forever chemical' found in dozens of UK rivers The two satellites are able to align with the sun so that the 1.4-metre disc carried by one of the spacecraft, the Occulter, covers the bright disc of the sun and casts a shadow. The other spacecraft, the Coronagraph, then takes a series of photographs with different exposure times. The satellites flew within 150 metres of each other, with a precision \"equal to the thickness of the average fingernail\", according to the ESA. Rather than relying on human drivers, who would have an \"uncomfortable\" delay of a fifth of a second while steering, the spacecraft autonomously lined themselves up with the sun in a manner \"akin to driverless cars\", the space agency said. When the spacecraft blasted off in December last year, they had enough fuel to keep going for around two years. After five years, it is expected they will burn up in the Earth's atmosphere."
    },
    {
        "title": "Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals",
        "description": "The head of Britain's biggest energy supplier has claimed his competitors oppose proposals for so-called postcode pricing because they financially benefit from the current system.",
        "url": "https://news.sky.com/story/bosses-of-octopus-energy-and-sse-clash-over-postcode-pricing-proposals-13384994",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wind-farm-wind-power_6840032.jpg?20250226090448",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-06-17 14:06:00",
        "Headline": "Supporters say the plans could help prevent firms from being paid tens of millions of pounds to stop producing energy, while opponents have dismissed the idea as an unnecessary distraction.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The head of Britain's biggest energy supplier has claimed his competitors oppose proposals for so-called postcode pricing because they financially benefit from the current system. Octopus Energy chief executive Greg Jackson told Sky News his business's rivals were against customers being charged based on where they lived, rather than on a national basis, because they would lose out on profits. He said: \"A very small number of companies that today get paid tens of millions, sometimes in a single day, to turn off wind farms and generate gas elsewhere, don't like it. \"The reason you're seeing that kind of behaviour from the rivals is they are benefiting from the current system that's generating incredible profitability.\" The government is currently considering whether to introduce the policy, which is also known as zonal pricing. Energy secretary Ed Miliband is expected to make a decision on the proposals by this summer. Money blog: Millions may wait months for payouts in Mastercard case Octopus has become Britain's biggest supplier with more than seven million customers. Mr Jackson has been a vocal proponent, as he said he wants to charge customers less and boost government electrification policies by having cheaper electricity costs. Business and economics reporter Zonal pricing would mean electricity bills are based on what region you live in. Some parts of Britain, like northern Scotland, are home to huge energy producers in the form of offshore wind farms.  But rather than feeding electricity to local homes and businesses, power goes into a nationwide auction and is bought to go across Britain. As the energy grid is still wired for the old coal-producing sites rather than the modern renewable generators, it's not straightforward to get electricity from where it's increasingly produced to the places people live and work.  That leads to traffic jams on the grid, blocking paid-for electricity moving to where it's needed and a system where producers can be paid a second time, to power down, and other suppliers, often gas plants, are paid to meet the shortfall.  Zonal pricing is designed to prevent paying the generators for power that can't be used.  It would mean those in Scotland have lower wholesale energy costs while those in the south, where there is less renewable energy production, would have higher wholesale costs. Whether bills go up or down depends on implementation.  Savings from one region could be spread across Britain, lowering bills across the board.  Mr Miliband has said he's not going to decide to raise prices.  However, SSE's chief executive Alistair Phillips-Davies described the policy as a \"distraction\" and said it could affect already agreed-upon upgrades of the national grid that will lower costs. \"I think you've got a very, very small number of people who are asking for this. It's just a distraction. We should remove it now,\" he said. While Octopus Energy estimates that said postcode pricing could be introduced in two to four years, Mr Phillips-Davies said it could take until 2032 before it was implemented, by which time Britain would have \"built much of the networks that are required to get the energy from these places down into the homes and businesses that actually need it\". \"We just need to stay true to the course,\" he added. Unions, as well as industry and energy representatives, have also spoken out against the policy. Opponents include eco-tycoon Dale Vince and trade body UK Steel. A joint letter signed by SSE, UK Steel, Ceramics UK and British Glass, along with the unions GMB, Unite and Unison, said zonal pricing could lead to scaled-back investment due to uncertainty and higher bills. A separate letter signed by 55 investors, including Centrica and the Ontario Teachers' Pension Plan, has also criticised the policy.  However, Mr Jackson said many investors had not voiced opposition, with thousands of small and medium businesses instead backing the policy in the hope of paying less on energy bills."
    },
    {
        "title": "Disgraced singer Gary Glitter to stay in jail as parole bid refused",
        "description": "Gary Glitter will stay in prison after the Parole Board refused the disgraced singer's bid to be released. ",
        "url": "https://news.sky.com/story/disgraced-singer-gary-glitter-to-stay-in-jail-as-parole-bid-refused-13384989",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-gary-glitter-parole_6447208.jpg?20240207103155",
        "type": "Entertainment",
        "Author": "Henry Vaughan",
        "Date Published": "2025-06-17 13:58:00",
        "Headline": "In 2015, the 81-year-old, whose real name is Paul Gadd, was jailed for child sex offences and then, in 2023, less than six weeks after he was released halfway through his 16-year sentence, he was recalled to jail for breaching his licence conditions.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Gary Glitter will stay in prison after the Parole Board refused the disgraced singer's bid to be released.  Glitter, 81, was recalled to jail less than six weeks after he was released halfway through his 16-year sentence in 2023 for breaching his licence conditions by allegedly viewing downloaded images of children. He was sentenced to 16 years imprisonment in 2015 after being found guilty of sexually assaulting three schoolgirls between 1975 and 1980. The Parole Board last year said it was \"not satisfied that release at this point would be safe for the protection of the public\" after a hearing held behind closed doors. A spokesman on Tuesday said his release was refused again following a \"paper review\". \"Parole Board decisions are solely focused on what risk a prisoner could represent to the public if released and whether that risk is manageable in the community,\" a statement said. \"A panel will carefully examine a huge range of evidence, including details of the original crime, and any evidence of behaviour change, as well as explore the harm done and impact the crime has had on the victims. \n                  Man, 27, pleads guilty to murdering and decapitating girlfriend\n                 \n                  'Ordering a woman to be sexually exploited is as easy as ordering a takeaway': How trafficking victims are being sold online\n                 \n                  Retired vicar admits role in 'Eunuch Maker' extreme body modification ring\n                 \"Parole reviews are undertaken thoroughly and with extreme care. Protecting the public is our number one priority.\" Glitter, whose real name is Paul Gadd, will be eligible for a further review at a date set by the Ministry of Justice. His sentence expires in February 2031. He was made bankrupt earlier this year after failing to pay more than £500,000 in damages to a woman who sued him for abusing her when she was 12 years old. Richard Scorer, head of abuse law and public inquiries at Slater and Gordon, who represented the woman, told Sky News the Parole Board has made \"the right decision\". He added: \"My client is relieved at this ruling but apprehensive about having to go through the merry-go-round of Gadd coming up for parole again, and the fear of him being let out on licence. \"This is unfair on victims and it would be better if they were assured that he would serve the rest of his sentence.\" Read more from Sky News:Man jailed for murdering two women on Christmas DayEx-lawyer 'fears revenge over gang boss murder claim' Glitter was first jailed for four months in 1999 after he admitted possessing around 4,000 indecent images of children. He was expelled from Cambodia in 2002, and in March 2006 was convicted of sexually abusing two girls, aged 10 and 11, in Vietnam, where he spent two-and-a-half years in prison. Glitter was automatically released from HMP The Verne, a low-security prison in Portland, Dorset, in February 2023 after serving half of his fixed-term determinate sentence. But he was back behind bars weeks later after reportedly trying to access the dark web and images of children."
    },
    {
        "title": "How Clean Is Your House? presenter Kim Woodburn dies",
        "description": "Kim Woodburn - a former cleaner who found fame presenting the hit TV show How Clean Is Your House? - has died.",
        "url": "https://news.sky.com/story/how-clean-is-your-house-presenter-kim-woodburn-dies-13384877",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kim-woodburn-how-clean-is-your-house_6944236.jpg?20250617114630",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-17 09:31:00",
        "Headline": "The Hampshire-born cleaner was scouted to front How Clean Is Your House? and went on to become a household name alongside Aggie MacKenzie in the hit Channel 4 show.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n Kim Woodburn - a former cleaner who found fame presenting the hit TV show How Clean Is Your House? - has died. Woodburn, who was 83, later became a contestant on Celebrity Big Brother in 2017, finishing as runner-up. Her manager said in a statement: \"It is with immense sadness that we let you know our beloved Kim Woodburn passed away yesterday following a short illness. \"Kim was an incredibly kind, caring, charismatic and strong person. \"Her husband, Peter, is heartbroken at the loss of his soulmate. \"We are so proud of the amazing things Kim achieved in her life and career. \"We kindly ask that Kim's husband and close friends are given the time and privacy they need to grieve. \"We will not be releasing any further details.\" On Tuesday, her husband shared a video montage of photos of Woodburn over the years, starting when she was just four years old, with the message: \"My wonderful, beautiful, Kim passed away last night. God bless, my love, xx xx\" Known for her trademark tight, plaited bun, Kim was largely blind in her right eye, and had poor sight in her left eye, and earlier this year had told her followers she was undergoing emergency eye surgery. Read more from Sky News:Doctor to plead guilty to giving Friends star ketamine before fatal overdoseLiam Gallagher hits out at Edinburgh council after Oasis fans branded 'rowdy' Woodburn, who had been selling video greetings to fans, shared her last Instagram post in February, when she posted a message saying \"Kim is unable to record any further videos for the foreseeable future due to a health problem\". She wrote: \"No more videos for now, my loves, I need to get better!\" Woodburn, born Patricia Mary in Hampshire, left a turbulent home life aged 16, moving to Liverpool to become a live-in cleaner. She revealed in her 2006 autobiography that, at the age of 23, she prematurely gave birth to a stillborn son and buried him in a park. The revelation in her book led to a police inquiry, but no action was taken by officers. In the same year as the stillbirth, she changed her name to Kim - after American actress Kim Novak. Years later, she was scouted by a TV company looking for a cleaner with an engaging personality to front How Clean is Your House? Paired with Scottish cleaner Aggie MacKenzie, the two professional cleaners fronted the show - a ratings hit and a pioneer for the home cleaning genre - from 2003 to 2009. Woodburn went on to appear in Celebrity Big Brother, I'm A Celebrity… Get Me Out Of here! and E4's Celebrity Cooking School, as well as regularly contributing to ITV's This Morning and Loose Women. She also appeared on The Oprah Winfrey Show, Big Brother's Bit On The Side, Celebrity Come Dine With Me and A Place In The Sun."
    }
]