[
    {
        "title": "Greens' stunning by-election win proves Polanski surge is real - but what now for Starmer?",
        "description": "At the wedding venue in Gorton and Denton the Green Party chose for the news conference to mark a seismic by-election victory on national television, it was clear that Zack Polanski and his team were new to all of this.",
        "url": "https://news.sky.com/story/gorton-and-denton-by-election-result-proves-polanski-surge-is-real-and-the-greens-are-a-serious-threat-to-labour-13513079",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-beth-rigby-political-editor_7177120.jpg?20260227202720",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-27 17:47:00",
        "Headline": "Make no mistake, if the celebration was muted in the moment, the implications of the result are absolutely mega.",
        "Content": "\n          Political editor\n              @BethRigby\n At the wedding venue in Gorton and Denton the Green Party chose for the news conference to mark a seismic by-election victory on national television, it was clear that Zack Polanski and his team were new to all of this. There was a sea of empty chairs and but a smattering of supporters in a huge, near-deserted room. Seasoned operators - be it Nigel Farage, Sir Keir Starmer or Ed Davey - would have had the placards lifted and the activists cheering, but Polanski and his new MP, Hannah Spencer, enjoyed just a smattering of applause as they took to the stage. Politics latest: Police confirm report made over 'family voting' claims But, make no mistake, if the celebration was muted in the moment, the implications of the result are absolutely mega. The Green Party went from third in this seat at the 2024 General Election to winning by 4,400 votes over Reform UK, and overturning Labour's 13,000 majority with a whopping 26 percentage point swing. It was only the 18th time in 100 years that a party had come from third to take a seat, and the Greens clocked up 40% of the vote. It was a stunning victory that proved the Polanski surge is real and that the Greens are a serious threat to Labour's left flank. Starmer ran a campaign claiming that only Labour could beat Reform. This by-election proved that wrong. Read more:Analysis: This is a parliamentary result for the agesGorton and Denton by-election 'cheating' claim explained Greens can argue they can beat Reform in working-class Britain Now the Greens can argue that they are the party that can beat Reform in working-class Britain as Polanski positions the party firmly on Labour's left. It is a nightmare for Labour as it finds itself fighting on two fronts. Starmer's stony face as he addressed the country on Friday said more than a thousand words could: the Greens, like Reform, are emerging as a serious, seat-winning electoral force. Had Reform won, Starmer could have used it as proof that voting for the Greens was a waste of time. Instead, he now has to try to prove to Labour voters why they should stick with him rather than tack to the left with the Greens. Starmer recriminated after results In the hours after the results, the recriminations began. Angela Rayner, the former deputy leader, said the result was a \"wake-up call\" that showed the party needed to be \"braver\" as she seemed to voice what many MPs think: that Labour needs to move more to the left. The unions also piled in with Sharon Graham of Unite saying Labour needed to \"stop listening to rich mates and listen to everyday people\" while Fire Brigades Union general secretary Steve Wright said Labour has to change course and its \"us versus Reform\" strategy \"is in tatters\", with the core vote collapsing. Starmer, who looked shell-shocked, didn't answer these criticisms as he addressed the cameras. Instead he reiterated his position that only Labour could unite the country and he would continue to \"fight against extremes in politics\" on both the left and the right that \"want to tear our country apart\". The two-party system has shifted to a multi-party one It is important to say here that by-election results are in general not indicative of national elections, and - as Labour will be arguing - when it comes to a general election, people are picking a prime minister and government rather than registering, in some cases, a protest vote. But this result does tell us something about the shape of our politics in this country. It reinforces the idea that the two-party system has shifted to a multi-party one. Voters are looking for alternatives on the left and right The Green Party and Reform UK took 70% of the vote in this by-election as Labour came in third in its once 38th safest seat, and the Conservatives lost their deposit. It is a reminder that voters are impatient for change, have decided that Starmer's government is not it, and are looking at alternatives on the left and the right of the two governing parties. Starmer has spent much of his first 18 months facing out towards Reform, but this result shows that the Greens, positioning as the progressive left, can mobilise ethnic minority voters who have long been staunch Labour, younger voters, and more left-wing Labour voters who flocked to Corbyn's Labour but feel politically homeless in Starmer's Labour. Polanski hails 'seismic victory' \"Labour's electoral stranglehold is over. This is a seismic victory. We have torn the roof off British politics, and that's because people now recognise there is an alternative,\" said Polanski at his news conference, telling me that, just as Reform are replacing the Conservatives, the Greens are beginning to do the same to Labour. Starmer's approach, and hope, is that as these insurgent parties become more successful at the ballot box and their policies and people become more scrutinised, voters may think twice about voting for them in a general election. On Friday, Labour again took aim at the Green Party's policy to legalise all drugs or withdraw from NATO as proof that Polanski doesn't have a \"serious programme for government\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Voters want a full-fat version of progressive politics But what we saw on Friday is that voters don't want, as pollster Luke Tryl told us on the Electoral Dysfunction podcast, a \"Macron\" strategy in which progressives are asked to compromise in the middle ground for fear of something worse (in this case Reform). They want a full-fat version of progressive politics instead. What inspired a huge swathe of voters to Corbyn's Labour seems to be now pushing them into the arms of Polanski's Greens. For Starmer, it is the stuff of nightmares as he contemplates attacks on both flanks. The squeeze that broke the Conservatives at the last general election - Reform to the right and Labour/the Lib Dems to the left - now threatens to sink Labour too. It makes the May local elections all the more daunting and consequential for Starmer's premiership."
    },
    {
        "title": "Tram derailment leaves two dead and dozens injured",
        "description": "Two people have been killed and 49 injured after a tram derailed in the centre of Milan, before slamming into a building.",
        "url": "https://news.sky.com/story/three-dead-and-dozens-injured-after-milan-tram-derails-13513116",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-milan-tram-tram-crash_7177121.jpg?20260227194551",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-27 19:22:00",
        "Headline": "Dozens of ambulances, fire engines and police cars responded to the crash, with crews escorting survivors away in thermal blankets.",
        "Content": "Two people have been killed and 49 injured after a tram derailed in the centre of Milan, before slamming into a building. The Number 9 tram was supposed to have continued straight along the central Vittorio Veneto avenue, but it suddenly swerved at a switch track that is used by another tram line, according to a video of the crash broadcast by Sky TG24. The video shows the tram nearly flipping onto its side as it takes the curve before crashing. Milan mayor Beppe Sala suggested human error was to blame, saying the driver had apparently failed to switch tracks to keep the tram going straight. He described the driver as an experienced employee who had only been on his shift for an hour. However, he said the driver had skipped a stop before the crash and would be questioned from the hospital where he was being treated for his injuries. Emergency services said two people had been killed. Mr Sala said one passenger had died on the tram and one on the street. \n                  British cousins charged with attempted murder over Venice Valentine's Day stabbing\n                 \n                  Italy's 'Lovers' Arch' collapses into the sea on Valentine's Day\n                 \n                  Armed gang posing as police blow up armoured vehicle in robbery attempt in Italy\n                 He said none of the other injured were in a life-threatening condition. Dozens of ambulances, fire engines and police cars responded to the crash, with crews escorting passengers in thermal blankets away from the scene. Read more from Sky News:Pakistan says it is in 'open war' with AfghanistanUK issues travel warning as Middle East crisis worsens ATM, the Milan public transport company, said it was cooperating with prosecutors \"to precisely establish the cause and dynamic of the incident\". The incident came as the city is hosting its seasonal fashion shows and is in the interim between hosting the Winter Olympics and Paralympic Games."
    },
    {
        "title": "Paramount strikes deal to buy Warner Bros Discovery for $110bn",
        "description": "Paramount has struck a $110bn deal to buy Warner Bros Discovery.",
        "url": "https://news.sky.com/story/paramount-agrees-to-buy-warner-bros-discovery-in-110bn-deal-13513157",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-warner-bros-logo_7140599.jpg?20260120135548",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-27 21:39:00",
        "Headline": "The deal was struck after Netflix walked away from a bidding war for the company.",
        "Content": "Paramount has struck a $110bn deal to buy Warner Bros Discovery. The deal was struck after Netflix walked away from a bidding war for the company. Netflix had declined to match Paramount's latest $31-per-share offer on Thursday - having offered a $27.75-per-share agreement for its studio and streaming assets. Paramount, which is led by billionaire Larry Ellison's son, David, has deep political connections to Donald Trump's administration. The takeover means Paramount Skydance will own the news channels CNN and CBS News. The deal brings together two of Hollywood's five legacy studios, potentially reshaping the US film industry. It means films such as Harry Potter, Superman and Barbie, as well as hit TV series such as Succession, will join Paramount's content library. Paramount's titles include Top Gun and The Godfather, as well as the Paramount+ streaming service. David Ellison, chair and CEO of Paramount, said: \"From the very beginning, our pursuit of Warner Bros Discovery has been guided by a clear purpose: to honour the legacy of two iconic companies while accelerating our vision of building a next-generation media and entertainment company. \"By bringing together these world-class studios, our complementary streaming platforms, and the extraordinary talent behind them, we will create even greater value for audiences, partners and shareholders - and we couldn't be more excited for what's ahead.\" Regulators in California are preparing a vigorous review of the deal. Both Democrat and Republican politicians in the US have raised concerns any deal to acquire Warner Bros could result in higher prices and fewer choices for customers."
    },
    {
        "title": "Neil Sedaka, singer of Breaking Up Is Hard To Do and Laughter In The Rain, has died",
        "description": "American singer-songwriter Neil Sedaka has died aged 86.",
        "url": "https://news.sky.com/story/neil-sedaka-singer-of-breaking-up-is-hard-to-do-and-laughter-in-the-rain-has-died-13513180",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-neil-sedaka-singer_7177269.jpg?20260227230305",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-27 22:52:00",
        "Headline": "Sedaka was a key member of the Brill Building songwriting factory and teamed up with lyricist and boyhood neighbour Howard Greenfield on songs such as Happy Birthday Sweet Sixteen, Calendar Girl and Oh! Carol.",
        "Content": "American singer-songwriter Neil Sedaka has died aged 86. In a statement, the family of the Breaking Up Is Hard To Do and Laughter In The Rain singer said: \"Our family is devastated by the sudden passing of our beloved husband, father and grandfather, Neil Sedaka. \"A true rock and roll legend, an inspiration to millions, but most importantly, at least to those of us who were lucky enough to know him, an incredible human being who will be deeply missed.\" The statement did not provide further details about his death. Sedaka was a key member of the Brill Building songwriting factory and teamed up with lyricist and boyhood neighbour Howard Greenfield on songs such as Happy Birthday Sweet Sixteen, Calendar Girl and Oh! Carol. After an extended dry spell, he reemerged with hits such as Laughter In The Rain and Bad Blood. A cover of his Love Will Keep Us Together by Captain & Tennille topped the charts in 1975. Sedaka still played dozens of concerts each year well into his 80s. He also retained his enthusiasm and never tired of the songs he had sung hundreds of times. Read more from Sky News:Paramount strikes deal to buy Warner Bros Discovery for $110bnEx-MasterChef host Gregg Wallace drops legal claim against BBC \"Past 70, Pavarotti told me the vocal cords are not what they used to be. I'm very fortunate that my voice has held,\" he told The Associated Press in 2012. \"It's nice to be a legend, but it's better to be a working legend.\" Sedaka's songs have sold millions worldwide and have been covered by a range of performers, including Elvis Presley, Frank Sinatra and Nickelback."
    },
    {
        "title": "UK issues travel warning as Middle East crisis worsens",
        "description": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave.",
        "url": "https://news.sky.com/story/uk-government-staff-have-been-withdrawn-from-iran-13512938",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-israel-jerusalem_7177024.jpg?20260227174607",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-27 11:44:00",
        "Headline": "Foreign Office has told Britons to avoid \"all but essential\" travel to Israel and Palestine and Britain's embassy in Tehran is \"temporarily closed\".",
        "Content": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave. The Foreign Office warned Britons against \"all but essential\" travel to Israel and Palestine on Friday due to the deteriorating security situation in the Middle East. Its advice against all travel to some parts of Israel and Palestine remains in place. Britain also moved some staff from Tel Aviv to \"another location within Israel\", amid concerns the security situation \"could escalate quickly\" and international borders might close with little notice. The alert was issued shortly after Britain pulled its staff out of its embassy in Iran as a \"temporary\" precautionary measure. \"We have temporarily closed the British Embassy in Tehran, this will now operate remotely,\" a government spokesperson said. Meanwhile, US ambassador to Israel Mike Huckabee told embassy employees in an email that a decision had been made to authorise departures for non-essential personnel and their families. \n                  Hillary Clinton testifies on Epstein\n                 \n                  'Significant progress' in US-Iran talks - but no deal - as negotiations to resume next week\n                 \n                  'It's tense here': Jerusalem braces for prospect of war in the Middle East\n                 Mr Huckabee said in the email that staff who wish to leave should do so that day, adding \"there may be outbound flights over the coming days, there may not be\". \"Persons may wish to consider leaving Israel while commercial flights are available,\" the US embassy said. The travel warnings are one of the strongest indications yet that a regional conflict could be imminent, as the threat of US military strikes on Iran looms. They come just a day after talks between the US and Iran over its nuclear programme ended without an agreement. The US State Department revealed on Friday that Secretary of State Marco Rubio will travel to Israel early next week to \"discuss a range of regional priorities including Iran, Lebanon, and ongoing efforts to implement President Trump's 20-Point Peace Plan for Gaza\". However, no further details were provided. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Donald Trump set ​out his case for a possible attack on ​Iran in ⁠his State ⁠of the Union speech on Tuesday. The US president said while he preferred a diplomatic ‌solution, he would not allow Tehran to obtain a nuclear weapon. Read more:'Significant progress' in US-Iran talks - but no deal'It's tense here': Jerusalem braces for prospect of war Mr Trump has previously threatened to take military action against Iran if a deal is not reached. The US has spent the last month amassing a fleet of aircraft and warships in the region. Iran has in turn threatened to attack Israel, raising the risk that military action could trigger another regional war. A confidential report from the UN nuclear watchdog confirmed that Iran has not offered inspectors access to sensitive nuclear sites since they were bombed during the 12-day war launched by Israel last June. Iran insists it has the right to enrich uranium for peaceful purposes and denies pursuing a nuclear weapon."
    },
    {
        "title": "Pakistan says it is in 'open war' with Afghanistan",
        "description": "Pakistan's defence minister has said the &#8203;country &#8204;is in an \"open &#8203;war\" with neighbouring Afghanistan, after both nations launched strikes overnight.",
        "url": "https://news.sky.com/story/pakistan-in-open-war-with-afghanistan-pakistani-defence-minister-says-13512788",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-afghanistan-strikes_7176352.jpg?20260227070327",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-27 03:58:00",
        "Headline": "Pakistan carries out strikes on Kabul and two other provinces overnight - just hours after Afghanistan launches a cross-border attack.",
        "Content": "Pakistan's defence minister has said the ​country ‌is in an \"open ​war\" with neighbouring Afghanistan, after both nations launched strikes overnight. Khawaja ‌Muhammad Asif said Islamabad's ​patience ⁠had ⁠run out as tensions escalated, with casualties reported on both sides. \"Our cup of patience has ⁠overflowed,\" he said in a social media post. \"Now ​it is ​open war between ​us and ⁠you [Afghanistan].\" He alleged the Taliban had turned Afghanistan \"into a colony of India\", gathered militants from around the world and had started \"exporting terrorism\". There has been no reaction from Afghan government officials to Mr Asif's comments. Pakistan carried out strikes on the Afghan capital Kabul and two other provinces overnight, Afghanistan government spokesman Zabihullah Mujahid said, just hours after Afghanistan launched a cross-border attack on Pakistan. The two neighbours have had a complicated relationship since Pakistan's founding in 1947. Pakistan supported the Afghan mujahideen in the Soviet–Afghan War, even taking in Afghan refugees. Pakistan later became one of the only states to recognise the Taliban-led government in Kabul in the late 1990s and even supported their second takeover in 2021. But warm relations began to sour after the emergence of Tehrik-e-Taliban Pakistan - otherwise known as the Pakistani Taliban. In Pakistan, they have become known for carrying out suicide bombings against political opponents. Islamabad accuses Kabul of providing a safe haven for their top figures - leading to a rise in border skirmishes over recent years as Pakistani authorities try to take them out. Security sources in Pakistan said the strikes involved air and ground strikes against Taliban posts, headquarters and ammunition depots ​along the border. A Reuters news agency witness in Kabul said many ambulance sirens could be heard following a series of loud blasts. Both sides reported heavy losses, issuing ‌sharply differing figures that have not been independently verified. Asia correspondent Pakistan says it's run out of patience and it's now open war with Afghanistan after conflict between the two escalated overnight.  It's a big moment after months of tension between the neighbours. So what's happened and why are we here? Tensions between the two have been intensifying for months with deadly border clashes killing dozens of civilians, soldiers and militants.  And militant violence in Pakistan has surged - last year was the deadliest in a decade. The Pakistani government blame a lot of the attacks on the Pakistani Taliban.\n They say that Kabul is enabling them - Kabul denies that . There was a ceasefire mediated by Qatar back in October but that feels pretty shaky right now and several rounds of peace talks in November didn't lead to any kind of formal agreement. Here we are with both sides of the border on high alert - it certainly feels like a very sensitive, very fragile point. \n Afghanistan's defence ministry said overnight that 55 Pakistani soldiers had been killed, including some whose bodies were taken into Afghanistan, and that \"several others were captured alive\". It said eight Afghan soldiers were killed and 11 wounded. The ministry also said it destroyed 19 Pakistani army posts and two bases and that the fighting ended around midnight, about four hours after it began on Thursday. Ahmed ​Sharif Chaudhry, a spokesperson for the Pakistan military, claimed its armed forces had killed 274 members of the Taliban forces and militants. He also said 22 Afghan military targets were hit, adding that at least 12 Pakistani soldiers were killed in the fighting. None of these figures has been independently verified. He added that military operations were ongoing on the orders of Prime Minister Shehbaz Sharif. Military analyst The increase in violence between Pakistan and Afghanistan has been some time in the making since the Taliban returned to power in 2021. Islamabad accuses Kabul of harbouring 'Pakistan Taliban' terrorists who operate in the border areas between the two countries, who they say are trying to destabilise Pakistan. In turn, Kabul accuses Pakistan of creating a pretext for intervention in Afghanistan as part of its long-running and deep-seated enmity with India. Both India and Pakistan have long transferred their antagonisms into interventions in Afghanistan's tangled politics.\n But there is another dimension to this event - that the Pakistani Defence Minister already calls 'war'. The Supreme Leader of the Afghan Taliban, Hibatullah Akhundzada, is probably fighting to keep control of his government at the moment. The Afghan Taliban movement, long committed to total obedience, seems now to be deeply split between Akhundzada, who spends most of his time in Kandahar and a somewhat anonymous group based in the capital, Kabul. In this respect, the split - if such it is - mirrors the long-standing geographical, ethnic, demographic and climatic difference between north Afghanistan and south-eastern Afghanistan. If the country were to split apart politically, that would be the major fault line.\n And it's possible that Pakistan's over-strong response to the cross-border incidents it lays at the feet of the Afghan Taliban is actually intended to make the possibility of such a split within the government of Afghanistan all the worse. It is possible that it is intended to heap more pressure on Akhundzada. Read more from Sky News:Zelenskyy tells Sky News the US has the power to end the warUK's delicate deal to get the Bayeux Tapestry loaned from France Cross-border battles have intensified following months of tensions and skirmishes between the two nations. The escalation threatens a fragile ceasefire along the 1,615-mile border and deepens a dispute over Islamabad's claim that Kabul harbours Tehreek-e-Taliban Pakistan (TTP) militants - an accusation ​the Taliban deny. British Foreign Secretary Yvette Cooper wrote on X: \"The UK is deeply concerned by the significant escalation in tensions between Afghanistan and Pakistan. \"We urge both sides to take immediate steps toward de‑escalation, avoid further harm to civilians, and re‑engage in mediated dialogue.\""
    },
    {
        "title": "Greens' stunning by-election win proves Polanski surge is real - but what now for Starmer?",
        "description": "At the wedding venue in Gorton and Denton the Green Party chose for the news conference to mark a seismic by-election victory on national television, it was clear that Zack Polanski and his team were new to all of this.",
        "url": "https://news.sky.com/story/gorton-and-denton-by-election-result-proves-polanski-surge-is-real-and-the-greens-are-a-serious-threat-to-labour-13513079",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-beth-rigby-political-editor_7177120.jpg?20260227202720",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-27 17:47:00",
        "Headline": "Make no mistake, if the celebration was muted in the moment, the implications of the result are absolutely mega.",
        "Content": "\n          Political editor\n              @BethRigby\n At the wedding venue in Gorton and Denton the Green Party chose for the news conference to mark a seismic by-election victory on national television, it was clear that Zack Polanski and his team were new to all of this. There was a sea of empty chairs and but a smattering of supporters in a huge, near-deserted room. Seasoned operators - be it Nigel Farage, Sir Keir Starmer or Ed Davey - would have had the placards lifted and the activists cheering, but Polanski and his new MP, Hannah Spencer, enjoyed just a smattering of applause as they took to the stage. Politics latest: Police confirm report made over 'family voting' claims But, make no mistake, if the celebration was muted in the moment, the implications of the result are absolutely mega. The Green Party went from third in this seat at the 2024 General Election to winning by 4,400 votes over Reform UK, and overturning Labour's 13,000 majority with a whopping 26 percentage point swing. It was only the 18th time in 100 years that a party had come from third to take a seat, and the Greens clocked up 40% of the vote. It was a stunning victory that proved the Polanski surge is real and that the Greens are a serious threat to Labour's left flank. Starmer ran a campaign claiming that only Labour could beat Reform. This by-election proved that wrong. Read more:Analysis: This is a parliamentary result for the agesGorton and Denton by-election 'cheating' claim explained Greens can argue they can beat Reform in working-class Britain Now the Greens can argue that they are the party that can beat Reform in working-class Britain as Polanski positions the party firmly on Labour's left. It is a nightmare for Labour as it finds itself fighting on two fronts. Starmer's stony face as he addressed the country on Friday said more than a thousand words could: the Greens, like Reform, are emerging as a serious, seat-winning electoral force. Had Reform won, Starmer could have used it as proof that voting for the Greens was a waste of time. Instead, he now has to try to prove to Labour voters why they should stick with him rather than tack to the left with the Greens. Starmer recriminated after results In the hours after the results, the recriminations began. Angela Rayner, the former deputy leader, said the result was a \"wake-up call\" that showed the party needed to be \"braver\" as she seemed to voice what many MPs think: that Labour needs to move more to the left. The unions also piled in with Sharon Graham of Unite saying Labour needed to \"stop listening to rich mates and listen to everyday people\" while Fire Brigades Union general secretary Steve Wright said Labour has to change course and its \"us versus Reform\" strategy \"is in tatters\", with the core vote collapsing. Starmer, who looked shell-shocked, didn't answer these criticisms as he addressed the cameras. Instead he reiterated his position that only Labour could unite the country and he would continue to \"fight against extremes in politics\" on both the left and the right that \"want to tear our country apart\". The two-party system has shifted to a multi-party one It is important to say here that by-election results are in general not indicative of national elections, and - as Labour will be arguing - when it comes to a general election, people are picking a prime minister and government rather than registering, in some cases, a protest vote. But this result does tell us something about the shape of our politics in this country. It reinforces the idea that the two-party system has shifted to a multi-party one. Voters are looking for alternatives on the left and right The Green Party and Reform UK took 70% of the vote in this by-election as Labour came in third in its once 38th safest seat, and the Conservatives lost their deposit. It is a reminder that voters are impatient for change, have decided that Starmer's government is not it, and are looking at alternatives on the left and the right of the two governing parties. Starmer has spent much of his first 18 months facing out towards Reform, but this result shows that the Greens, positioning as the progressive left, can mobilise ethnic minority voters who have long been staunch Labour, younger voters, and more left-wing Labour voters who flocked to Corbyn's Labour but feel politically homeless in Starmer's Labour. Polanski hails 'seismic victory' \"Labour's electoral stranglehold is over. This is a seismic victory. We have torn the roof off British politics, and that's because people now recognise there is an alternative,\" said Polanski at his news conference, telling me that, just as Reform are replacing the Conservatives, the Greens are beginning to do the same to Labour. Starmer's approach, and hope, is that as these insurgent parties become more successful at the ballot box and their policies and people become more scrutinised, voters may think twice about voting for them in a general election. On Friday, Labour again took aim at the Green Party's policy to legalise all drugs or withdraw from NATO as proof that Polanski doesn't have a \"serious programme for government\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Voters want a full-fat version of progressive politics But what we saw on Friday is that voters don't want, as pollster Luke Tryl told us on the Electoral Dysfunction podcast, a \"Macron\" strategy in which progressives are asked to compromise in the middle ground for fear of something worse (in this case Reform). They want a full-fat version of progressive politics instead. What inspired a huge swathe of voters to Corbyn's Labour seems to be now pushing them into the arms of Polanski's Greens. For Starmer, it is the stuff of nightmares as he contemplates attacks on both flanks. The squeeze that broke the Conservatives at the last general election - Reform to the right and Labour/the Lib Dems to the left - now threatens to sink Labour too. It makes the May local elections all the more daunting and consequential for Starmer's premiership."
    },
    {
        "title": "Afghan migrant jailed for raping 'vulnerable' woman",
        "description": "A migrant from Afghanistan has been jailed for 10 years for the rape of a \"vulnerable, intoxicated\" woman.",
        "url": "https://news.sky.com/story/afghan-migrant-jailed-for-raping-vulnerable-woman-13513081",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-rape-southampton_7177043.png?20260227180502",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 17:49:00",
        "Headline": "\"Since that day I have lived in fear, shame, silence and unbearable pain that I can't fully describe,\" the victim said in her personal impact statement.",
        "Content": "A migrant from Afghanistan has been jailed for 10 years for the rape of a \"vulnerable, intoxicated\" woman. Musafar Hotak, 25, was convicted after a trial at Southampton Crown Court of the rape and sexual assault by penetration of the woman in the early hours of 12 July 2022. The court heard that the victim had left the Cafe Parfait bar in Southampton after being asked to leave by the bouncers for being drunk. As she attempted to contact her girlfriend, Hotak, who was 22 at the time, started to follow her before a voicemail sent on the victim's phone heard her telling him to stop. Reading her personal impact statement to the court, the victim said she lived in \"constant fear\" and that the attack had \"left scars in every part of my life\". The court was told how the complainant remembered waking up in Hotak's home with him lying on top of her and sexually assaulting her then raping her. She repeatedly told him to stop, but she felt unable to prevent him because he was using \"a lot of force\", the court heard. \n                  Queen Victoria statue in Belfast hospital grounds  targeted in paint attack\n                 \n                  Killer who plied partner with nothing but vodka and ice lollies and inflicted 100 injuries jailed\n                 \n                  E-bike rider convicted after fatal collision on illegally modified bike in west London\n                 After she escaped, she contacted police, and a swab taken from her was matched to the defendant's DNA. The victim said the attack had led her to self-harm and an attempt to take her own life. \"What happened to me destroyed my life in ways I never thought possible. I didn't just feel violated, I felt erased. \"Since that day I have lived in fear, shame, silence and unbearable pain that I can't fully describe,\" she said. Judge Gary Lucie sentenced Hotak to a 10-year prison term with a four-year extended period on licence, imposed an indefinite restraining order on him not to contact the victim, and placed him on the sex offenders register. He told Hotak, who will be deported from the UK upon completing his sentence: \"The Home Office will consider whether to deport you.\" Read more from Sky News:Murderer jailed for inflicting more than 100 injuries on partnerPicture of 'rare' boot released as police try to identify woman's body He praised the victim's bravery and said Hotak had taken \"advantage of the victim who was very drunk\". \"It is obvious your offending has had a severe psychological impact on her which will probably remain with her for the rest of her life.\"A Home Office spokesman said: \"All foreign national offenders who receive a prison sentence of over 12 months are automatically referred for deportation at the earliest opportunity and will be barred from returning to the UK. \"We will not tolerate foreign criminals committing crimes in the UK, and that is why we are scaling up their deportations.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Picture of 'rare' boot released as police try to identify woman's body found off Iona coast",
        "description": "A picture of a \"rare\" boot has been released as police try to identify a woman whose body was found off the coast of Iona last year.",
        "url": "https://news.sky.com/story/picture-of-rare-boot-released-as-police-try-to-identify-womans-body-found-off-iona-coast-13513027",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iona-police-scotland_7176923.jpg?20260227154942",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 15:45:00",
        "Headline": "The woman's body was discovered around five miles west of the island on 23 September 2025.",
        "Content": "A picture of a \"rare\" boot has been released as police try to identify a woman whose body was found off the coast of Iona last year. The body was discovered around five miles west of the island on 23 September 2025, with forensic analysis in Scotland, the rest of the UK, and also in Europe proving unsuccessful. Police Scotland said evidence suggests she had been in the water for around four to six weeks. Her death is being treated as unexplained and is not believed to be suspicious. The woman was white, around 6ft tall, aged 45-60, and of medium build, with no tattoos or obvious scarring from previous medical procedures. When her body was recovered, she was wearing black walking-style trousers and size 8.5 Meindl walking boots. Police said the German-brand boots were only sold by two retailers in the UK and are now discontinued, so it is hoped someone may recognise the shoe. \n                  NHS Tayside U-turn paves the way for hundreds of alleged victims of 'butcher' brain surgeon to sue\n                 \n                  Scotland considering criminalising creation of deepfake images in bid to protect women and girls\n                 \n                  Former gamekeeper David Campbell found guilty of shotgun murder of ex-colleague Brian Low\n                 Read more from Sky News:Ian Huntley remains in serious condition after prison attackUK and US staff withdrawn from embassies in Iran and Israel Inspector Roddy MacNeill said: \"We are still carrying out enquiries into who this woman could be and want to return her to her loved ones. \"We are now liaising with other countries outside of Europe, including Canada and the Faroe Isles, to see if she could be from these areas. \"This boot is unusual and was rarely sold in the UK so we are hoping sharing the image may bring a lead. \"If anyone has information, no matter how insignificant it may seem, please get in touch with us.\""
    },
    {
        "title": "New legal action planned over proposal to house 540 asylum seekers in Sussex town",
        "description": "A residents' group has said it plans to launch a fresh legal challenge over plans to use a military training camp in Crowborough as accommodation for asylum seekers.",
        "url": "https://news.sky.com/story/new-legal-action-planned-over-proposal-to-house-540-asylum-seekers-in-sussex-town-13513044",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-crowborough-training-camp_7176960.jpg?20260227163246",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 16:10:00",
        "Headline": "Campaigners will launch a fresh legal challenge over the decision taken to turn an army training centre in Crowborough into accommodation for 540 asylum seekers.",
        "Content": "A residents' group has said it plans to launch a fresh legal challenge over plans to use a military training camp in Crowborough as accommodation for asylum seekers. The new challenge against the Home Office would follow the group's initial legal bid being thrown out for being filed before the Government decided to go ahead with plans to use the site. Legal action was first filed against the government by Crowborough Shield, a community interest company, in December last year after it revealed it was considering housing up to 540 men at the site in East Sussex. On Friday, Mr Justice Mould dismissed the claim as \"premature\" and stated that the group had \"jumped the gun\", as at the time the initial claim was launched, there was \"no clearly determined policy to use the camp\" as accommodation for asylum seekers. However, he said that after the government's January announcement, that it would go ahead with the plans, the decision was now \"at least in principle\" open to a legal challenge. Speaking on behalf of the group following the ruling, Matthew Shankland said that it intends to issue a new High Court claim by Wednesday, the deadline for the challenge being filed. He said: \"We believe that issuing this claim when we did was the only available course for our community.\" \n                  Number of asylum seekers housed in hotels drops - with a rise in small boat arrivals\n                 \n                  Ukrainian family denied UK asylum told to block out bombs with headphones\n                 \n                  'It's a disaster in the making': Empathy but mostly concern in town set to house hundreds of asylum seekers \n                 He continued: \"Our current inclination is to recommence proceedings next week.\" Mr Shankland told reporters that the group had already spent more than £100,000 on legal fees, and that a new claim could see it cost \"possibly the same again\". Kim Bailey, director and chairwoman of the group, told reporters outside the Royal Courts of Justice in London that a second claim would have a \"cost impact\". She said: \"That is something I will take forward with the community, because essentially it is their decision whether they want to take this further forward.Read more from Sky News:Ian Huntley remains in a serious condition after prison attackPakistan says it is in 'open war' with Afghanistan \"But we will be issuing again, before Wednesday.\" The Government's announcement that it was considering these plans, last October, came as it sought to end the use of hotels. The Home Office approved the plan in January this year, with 27 men housed at the camp last month despite a series of protests in the town and opposition from Wealden District Council over the move. The Crowborough site, which has been given to the Home Office by the Ministry of Defence for 12 months, was previously used to accommodate Afghan families evacuated during the withdrawal from Kabul in 2021 while they were resettled elsewhere."
    },
    {
        "title": "UK issues travel warning as Middle East crisis worsens",
        "description": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave.",
        "url": "https://news.sky.com/story/uk-government-staff-have-been-withdrawn-from-iran-13512938",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-israel-jerusalem_7177024.jpg?20260227174607",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 11:44:00",
        "Headline": "Foreign Office has told Britons to avoid \"all but essential\" travel to Israel and Palestine and Britain's embassy in Tehran is \"temporarily closed\".",
        "Content": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave. The Foreign Office warned Britons against \"all but essential\" travel to Israel and Palestine on Friday due to the deteriorating security situation in the Middle East. Its advice against all travel to some parts of Israel and Palestine remains in place. Britain also moved some staff from Tel Aviv to \"another location within Israel\", amid concerns the security situation \"could escalate quickly\" and international borders might close with little notice. The alert was issued shortly after Britain pulled its staff out of its embassy in Iran as a \"temporary\" precautionary measure. \"We have temporarily closed the British Embassy in Tehran, this will now operate remotely,\" a government spokesperson said. Meanwhile, US ambassador to Israel Mike Huckabee told embassy employees in an email that a decision had been made to authorise departures for non-essential personnel and their families. \n                  Hillary Clinton testifies on Epstein\n                 \n                  'Significant progress' in US-Iran talks - but no deal - as negotiations to resume next week\n                 \n                  'It's tense here': Jerusalem braces for prospect of war in the Middle East\n                 Mr Huckabee said in the email that staff who wish to leave should do so that day, adding \"there may be outbound flights over the coming days, there may not be\". \"Persons may wish to consider leaving Israel while commercial flights are available,\" the US embassy said. The travel warnings are one of the strongest indications yet that a regional conflict could be imminent, as the threat of US military strikes on Iran looms. They come just a day after talks between the US and Iran over its nuclear programme ended without an agreement. The US State Department revealed on Friday that Secretary of State Marco Rubio will travel to Israel early next week to \"discuss a range of regional priorities including Iran, Lebanon, and ongoing efforts to implement President Trump's 20-Point Peace Plan for Gaza\". However, no further details were provided. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Donald Trump set ​out his case for a possible attack on ​Iran in ⁠his State ⁠of the Union speech on Tuesday. The US president said while he preferred a diplomatic ‌solution, he would not allow Tehran to obtain a nuclear weapon. Read more:'Significant progress' in US-Iran talks - but no deal'It's tense here': Jerusalem braces for prospect of war Mr Trump has previously threatened to take military action against Iran if a deal is not reached. The US has spent the last month amassing a fleet of aircraft and warships in the region. Iran has in turn threatened to attack Israel, raising the risk that military action could trigger another regional war. A confidential report from the UN nuclear watchdog confirmed that Iran has not offered inspectors access to sensitive nuclear sites since they were bombed during the 12-day war launched by Israel last June. Iran insists it has the right to enrich uranium for peaceful purposes and denies pursuing a nuclear weapon."
    },
    {
        "title": "Queen Victoria statue in Belfast hospital grounds  targeted in paint attack",
        "description": "Police in Belfast have appealed for witnesses after a statue of Queen Victoria was vandalised.",
        "url": "https://news.sky.com/story/queen-victoria-statue-in-belfast-hospital-grounds-targeted-in-paint-attack-13513142",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-victoria-queen-victoria_7177177.jpg?20260227205509",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 20:43:00",
        "Headline": "Republican group Lasair Dhearg posted a picture on social media on Friday afternoon, appearing to show one of its supporters pouring red paint over the statue.",
        "Content": "Police in Belfast have appealed for witnesses after a statue of Queen Victoria was vandalised. The statue sits in the grounds of the Royal Victoria Hospital, named after the late monarch. According to the Press Association, the Irish Republican group Lasair Dhearg posted a picture on social media on Friday afternoon, appearing to show one of its supporters pouring red paint over the statue. In an accompanying post, the group said, \"Belfast activists\" had paid a visit to the \"Famine Queen\" - a reference to the Irish potato famine of the mid-19th century. \"British monarch Victoria oversaw the Great Hunger and the decimation of the Irish population as millions perished and emigrated,\" it stated. In a statement, the Police Service of Northern Ireland (PSNI) said it had received a report of criminal damage on the Grosvenor Road site in west Belfast on Friday afternoon. \"Inquiries are at an early stage and police would appeal to any witnesses, or anyone who might have any information which could assist us, to get in touch.\" \n                  Afghan migrant jailed for raping 'vulnerable' woman\n                 \n                  Killer who plied partner with nothing but vodka and ice lollies and inflicted 100 injuries jailed\n                 \n                  E-bike rider convicted after fatal collision on illegally modified bike in west London\n                 Work was under way on Friday evening to remove the paint. In a statement, the Belfast Health and Social Care Trust said: \"Belfast Trust is aware of an incident in which the statue of Queen Victoria, on the Royal Group of Hospitals site, was daubed with red paint. \"Trust staff are working to have this paint removed as quickly as possible.\" DUP Assembly member Phillip Brett said the vandalism was an \"utter disgrace\". He said those responsible wanted to \"intimidate\" and \"erase\" British identity from Northern Ireland. \"This wasn't 'activism',\" he said. \"It was an attack on shared space, on heritage and on basic respect.\" Ulster Unionist Assembly member Alan Chambers, who is the party's health spokesman, also condemned the incident. Read more from Sky News:Three dead and dozens injured after Milan tram derailsWe are in a new era of multi-party politics \"Every pound that now has to be spent repairing this damage is a pound taken away from the health service.\" The news follows the arrest of a 38-year-old-man on suspicion of racially aggravated criminal damage after a statue of Sir Winston Churchill was graffitied in Parliament Square in Westminster. That statue was defaced overnight with \"Zionist war criminal\" and other graffiti. While in opposition, Labour supported the then government in introducing prison sentences of up to 10 years for those who desecrate war memorials."
    },
    {
        "title": "Killer who plied partner with nothing but vodka and ice lollies and inflicted 100 injuries jailed",
        "description": "A man has been jailed for killing his partner after trapping her in his home, restricting her diet to just vodka and ice lollies, and inflicting more than 100 injuries on her.",
        "url": "https://news.sky.com/story/murderer-jailed-for-inflicting-more-than-100-injuries-on-partner-after-plying-her-with-vodka-13513024",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-tony-devenport-stephanie-blundell_7176919.jpg?20260227154630",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 15:36:00",
        "Headline": "Tony Devenport, 57, strangled his victim twice in the days before her death, as well as beating her, causing significant injuries to her brain, the judge said.",
        "Content": "A man has been jailed for killing his partner after trapping her in his home, restricting her diet to just vodka and ice lollies, and inflicting more than 100 injuries on her. Tony Devenport, 57, will serve at least 22 years in prison for the death of Stephanie Blundell, 41, who was discovered with extensive bruising across her face and body. Her father described an ordeal that will \"stay with me for the rest of my life\" after finding her in the home she shared with Devenport in Canal Street, Chester. The jury heard that Ms Blundell had lived with her controlling partner for almost two years, but did not have a house key, and he retained her bank card. She had been battling alcoholism for years when she met him, but the couple achieved a period of sobriety, Chester Crown Court was told. They relapsed in May last year, however, when they started to drink \"heavily\" during a trip to Slovakia. \"When intoxicated, you were abusive, aggressive and violent towards her on occasions prior to her death,\" Justice Steyn told Devenport. \n                  Queen Victoria statue in Belfast hospital grounds  targeted in paint attack\n                 \n                  Afghan migrant jailed for raping 'vulnerable' woman\n                 \n                  E-bike rider convicted after fatal collision on illegally modified bike in west London\n                 Devenport was arrested on suspicion of assaulting Ms Blundell just 10 days before she died, but breached his bail conditions \"within minutes\" by calling her. She \"never left\" his house again after he called a taxi to pick her up. In those final days, she had \"no means of contacting anyone\" and was bed-bound. She had acute pancreatitis and alcoholic ketoacidosis, and the judge said she was \"bound to be pleading\" for help. But the defendant, who had bought more than 12 litres of vodka and 72 cans of beer, gave her only alcohol and ice lollies. \"As a result of your actions, Stephanie would have been in pain and fear, and you kept her there, offering little but vodka,\" the judge said. She added that Devenport had strangled Ms Blundell twice in the 48 hours before her death, as well as beating her, causing significant injuries to her brain. Her father, Philip Blundell, who found her, said: \"The thought that she died alone in pain with nobody to comfort her haunts me every day.\" A post-mortem ruled that Ms Blundell died from her multiple injuries, exacerbated by the effects of chronic alcoholism. Sentencing him on Friday, Justice Steyn told Devenport he had murdered his \"compassionate, kind-hearted and courageous\" partner of two years. She said: \"Stephanie Blundell died on the morning of July 20, 2025, as a result of fierce, repeated and sustained assaults inflicted by you over the preceding day or two. \"Her father had the most terrible experience a parent can face of visiting her shortly after midday on that Sunday, only to discover that his beloved daughter lay dead, with the marks of the severe beatings you had meted out abundantly clear.\" Read more:New alcohol abuse rehab scheme to fight addictionNew 'British FBI' to fight serious crime The judge added: \"She always saw the good in people, including you, never giving up on them. She had an enormous capacity to love and a bright smile that could light up a room.\" In a statement after the sentencing, Ms Blundell's family paid tribute to \"one of the most radiant souls you could ever hope to meet\". The statement read: \"She was kind-hearted, quick-witted and effortlessly stylish. Her warmth and compassion have been evident throughout this trial and that brings us some comfort that her true loving nature has been seen by so many.\" Detective Inspector Andrea Price of Cheshire Constabulary said: \"Stephanie was loved and cherished amongst family and friends, and although today marks the day her killer is brought to justice, I want Stephanie to be the one who we remember. \"While no sentence can ever bring Stephanie back, I hope today's result provides her loved ones with some comfort in knowing that Devenport has now been held accountable for what he has done.\""
    },
    {
        "title": "Man arrested after 'completely abhorrent' vandalism of Churchill statue",
        "description": "The statue of Sir Winston Churchill in Parliament Square in Westminster was defaced overnight with \"Zionist war criminal\" and other graffiti.",
        "url": "https://news.sky.com/story/churchill-statue-in-parliament-square-defaced-with-zionist-war-criminal-13512850",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-winston-churchill-statue_7176494.jpg?20260227082347",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-27 08:18:00",
        "Headline": "The bronze Churchill statue in Parliament Square was defaced with \"Zionist war criminal\", \"Stop the Genocide\" and \"Free Palestine\".",
        "Content": "The statue of Sir Winston Churchill in Parliament Square in Westminster was defaced overnight with \"Zionist war criminal\" and other graffiti. A 38-year-old man was arrested on suspicion of racially aggravated criminal damage. In an update, the Metropolitan Police said he has been further arrested on suspicion of supporting Palestine Action, which is a proscribed organisation, under the Terrorism Act and remains in custody. A No 10 spokesman said of the vandalism: \"It's obviously a disgrace. It's completely abhorrent. \"Churchill was a great Briton. This Government will always stand up for our values and the perpetrator must be held to account. \"We're glad the police have made an arrest.\" Officers from the Met Police were alerted to the vandalism shortly after 4am on Friday. The statue has been cordoned off and was being cleaned this morning. A Greater London Authority spokesperson said: \"We are appalled by this vandalism to the statue of Sir Winston Churchill and work is under way to remove the graffiti as quickly as possible.\" Commenting on an image of the monument, which was shared on X, Dave Rich, director of policy for Community Security Trust, posted: \"Free Palestine\" and a Hamas red triangle, if you zoom in close enough. This extremism is never just a threat to Jews.\" Read more from Sky News:Netflix withdraws Warner Bros bidWe are in a new era of multi-party politics The Jewish Leadership Council said it was \"disgusted\" by the defacement of the statue. It said on X: \"In targeting the statue of a British hero who led this country in the fight against the Nazis, the perpetrator has found a perverse way to combine a hatred of Jews with a disdain for Britain.\" Phil Rosenberg, president of the Board of Deputies of British Jews, wrote: \"One of the greatest champions for liberty, who defeated the Nazis, defaced. \"Zionism, the national liberation movement of the Jewish people, inverted. \"Santayana's 'Those who cannot remember the past are condemned to repeat it', never truer.\" The 12ft-tall statue on the north-east corner of the square, created by Ivor Roberts-Jones, was unveiled in 1973 by the former prime minister's wife, Lady Clementine Churchill. It is one of 12 statues on or around Parliament Square, most of well-known statesmen such as Nelson Mandela and Abraham Lincoln. The former prime minister's statue has been vandalised several times over the years, including during demonstrations. Last December, both the Metropolitan Police and Greater Manchester Police announced anyone chanting \"globalise the intifada\" would face arrest. The decision by the two police forces came in the wake of the Bondi Beach terror attack, and the terror attack at Heaton Park synagogue in Manchester on 2 October."
    },
    {
        "title": "Pakistan says it is in 'open war' with Afghanistan",
        "description": "Pakistan's defence minister has said the &#8203;country &#8204;is in an \"open &#8203;war\" with neighbouring Afghanistan, after both nations launched strikes overnight.",
        "url": "https://news.sky.com/story/pakistan-in-open-war-with-afghanistan-pakistani-defence-minister-says-13512788",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-afghanistan-strikes_7176352.jpg?20260227070327",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-27 03:58:00",
        "Headline": "Pakistan carries out strikes on Kabul and two other provinces overnight - just hours after Afghanistan launches a cross-border attack.",
        "Content": "Pakistan's defence minister has said the ​country ‌is in an \"open ​war\" with neighbouring Afghanistan, after both nations launched strikes overnight. Khawaja ‌Muhammad Asif said Islamabad's ​patience ⁠had ⁠run out as tensions escalated, with casualties reported on both sides. \"Our cup of patience has ⁠overflowed,\" he said in a social media post. \"Now ​it is ​open war between ​us and ⁠you [Afghanistan].\" He alleged the Taliban had turned Afghanistan \"into a colony of India\", gathered militants from around the world and had started \"exporting terrorism\". There has been no reaction from Afghan government officials to Mr Asif's comments. Pakistan carried out strikes on the Afghan capital Kabul and two other provinces overnight, Afghanistan government spokesman Zabihullah Mujahid said, just hours after Afghanistan launched a cross-border attack on Pakistan. The two neighbours have had a complicated relationship since Pakistan's founding in 1947. Pakistan supported the Afghan mujahideen in the Soviet–Afghan War, even taking in Afghan refugees. Pakistan later became one of the only states to recognise the Taliban-led government in Kabul in the late 1990s and even supported their second takeover in 2021. But warm relations began to sour after the emergence of Tehrik-e-Taliban Pakistan - otherwise known as the Pakistani Taliban. In Pakistan, they have become known for carrying out suicide bombings against political opponents. Islamabad accuses Kabul of providing a safe haven for their top figures - leading to a rise in border skirmishes over recent years as Pakistani authorities try to take them out. Security sources in Pakistan said the strikes involved air and ground strikes against Taliban posts, headquarters and ammunition depots ​along the border. A Reuters news agency witness in Kabul said many ambulance sirens could be heard following a series of loud blasts. Both sides reported heavy losses, issuing ‌sharply differing figures that have not been independently verified. Asia correspondent Pakistan says it's run out of patience and it's now open war with Afghanistan after conflict between the two escalated overnight.  It's a big moment after months of tension between the neighbours. So what's happened and why are we here? Tensions between the two have been intensifying for months with deadly border clashes killing dozens of civilians, soldiers and militants.  And militant violence in Pakistan has surged - last year was the deadliest in a decade. The Pakistani government blame a lot of the attacks on the Pakistani Taliban.\n They say that Kabul is enabling them - Kabul denies that . There was a ceasefire mediated by Qatar back in October but that feels pretty shaky right now and several rounds of peace talks in November didn't lead to any kind of formal agreement. Here we are with both sides of the border on high alert - it certainly feels like a very sensitive, very fragile point. \n Afghanistan's defence ministry said overnight that 55 Pakistani soldiers had been killed, including some whose bodies were taken into Afghanistan, and that \"several others were captured alive\". It said eight Afghan soldiers were killed and 11 wounded. The ministry also said it destroyed 19 Pakistani army posts and two bases and that the fighting ended around midnight, about four hours after it began on Thursday. Ahmed ​Sharif Chaudhry, a spokesperson for the Pakistan military, claimed its armed forces had killed 274 members of the Taliban forces and militants. He also said 22 Afghan military targets were hit, adding that at least 12 Pakistani soldiers were killed in the fighting. None of these figures has been independently verified. He added that military operations were ongoing on the orders of Prime Minister Shehbaz Sharif. Military analyst The increase in violence between Pakistan and Afghanistan has been some time in the making since the Taliban returned to power in 2021. Islamabad accuses Kabul of harbouring 'Pakistan Taliban' terrorists who operate in the border areas between the two countries, who they say are trying to destabilise Pakistan. In turn, Kabul accuses Pakistan of creating a pretext for intervention in Afghanistan as part of its long-running and deep-seated enmity with India. Both India and Pakistan have long transferred their antagonisms into interventions in Afghanistan's tangled politics.\n But there is another dimension to this event - that the Pakistani Defence Minister already calls 'war'. The Supreme Leader of the Afghan Taliban, Hibatullah Akhundzada, is probably fighting to keep control of his government at the moment. The Afghan Taliban movement, long committed to total obedience, seems now to be deeply split between Akhundzada, who spends most of his time in Kandahar and a somewhat anonymous group based in the capital, Kabul. In this respect, the split - if such it is - mirrors the long-standing geographical, ethnic, demographic and climatic difference between north Afghanistan and south-eastern Afghanistan. If the country were to split apart politically, that would be the major fault line.\n And it's possible that Pakistan's over-strong response to the cross-border incidents it lays at the feet of the Afghan Taliban is actually intended to make the possibility of such a split within the government of Afghanistan all the worse. It is possible that it is intended to heap more pressure on Akhundzada. Read more from Sky News:Zelenskyy tells Sky News the US has the power to end the warUK's delicate deal to get the Bayeux Tapestry loaned from France Cross-border battles have intensified following months of tensions and skirmishes between the two nations. The escalation threatens a fragile ceasefire along the 1,615-mile border and deepens a dispute over Islamabad's claim that Kabul harbours Tehreek-e-Taliban Pakistan (TTP) militants - an accusation ​the Taliban deny. British Foreign Secretary Yvette Cooper wrote on X: \"The UK is deeply concerned by the significant escalation in tensions between Afghanistan and Pakistan. \"We urge both sides to take immediate steps toward de‑escalation, avoid further harm to civilians, and re‑engage in mediated dialogue.\""
    },
    {
        "title": "What Sky News has uncovered about Bill Clinton and Jeffrey Epstein's relationship",
        "description": "Sky News has uncovered new details about the timings and locations of photographs featuring Bill Clinton and paedophile financier Jeffrey Epstein, forming a comprehensive timeline of their relationship. ",
        "url": "https://news.sky.com/story/what-sky-news-has-uncovered-about-bill-clinton-and-jeffrey-epsteins-relationship-13512817",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dxf-epstein-clinton_7176397.jpg?20260227063332",
        "type": "World",
        "Author": "Tom Cheshire, data and forensics correspondent, and Freya Gibson, junior OSINT producer",
        "Date Published": "2026-02-27 06:15:00",
        "Headline": "Sky News Data and Forensics team has examined photographs and documents relating to Bill Clinton and Jeffrey Epstein, to build a detailed timeline of events.",
        "Content": "By Tom Cheshire, data and forensics correspondent, and Freya Gibson, junior OSINT producer  Sky News has uncovered new details about the timings and locations of photographs featuring Bill Clinton and paedophile financier Jeffrey Epstein, forming a comprehensive timeline of their relationship.  The photos, included in the Epstein files and verified by Sky's Data and Forensics team, were taken on numerous Clinton Foundation trips where Epstein was present. The former US president has never been accused of wrongdoing in connection with Epstein and has said he did not know about the sex offender's crimes. Being included in the Epstein files does not imply wrongdoing. In 1992, records show Epstein donated $2,000 to Mr Clinton's successful presidential campaign on 30 January and 8 June - a small fraction of the $62m his campaign raised overall. After being sworn in as president in 1993, Mr Clinton was pictured in September with Epstein and Ghislaine Maxwell after an event for donors to a White House restoration project. The event was said to have been for donors and records list Epstein and Maxwell donating $10,000 to the White House Historical Association the same day as the event. Hillary Clinton hosted the event with her husband Bill Clinton. Freedom of information (FOI) records show that Epstein visited the White House 17 times from 1993 to 1995. \n                  Barack Obama pays tribute to 'true giant' Jesse Jackson - after Donald Trump's swipe at ex-president\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  Is the Board of Peace a Trump-led sham?\n                 In 1996, Mr Clinton was re-elected for a second presidential term. A few years later in 1999, records from the Federal Election Commission show Epstein donated $20,000 on 29 October to Hillary Clinton's senate campaign. This donation shows no suggestion of wrongdoing. In 2001, Bill Clinton left office, creating the Clinton Foundation, with the mission to \"strengthen the capacity of people in the United States and throughout the world to meet the challenges of global interdependence\". In 2002, Mr Clinton visited Epstein's New York residence once, as confirmed by Mr Clinton's spokesperson Angel Urena. Sky News has verified numerous photographs taken on Clinton Foundation trips where Epstein was present. In May 2002, Mr Clinton set off for his trip around Asia for the Clinton Foundation on Epstein's plane. They visited, Russia, Singapore, China, Bangkok and Brunei in a three-day period. These photos were taken on 25 May 2002 at Don Mueang International Airport, then with pictures at Wat Phra Kaew, a Buddhist temple. Thumbnails show what appears to be Epstein's plane on the platform at the airport. Many pictures from the Asia trip were already public but have been verified for the first time by the Sky News Data and Forensics team. Using images released by the US Department of Justice (DOJ), Sky News analysed photo thumbnails alongside enlarged photos, to locate and date certain photos on this timeline, cross-referencing them with flight logs and email exchanges. This set of photographs was in Brunei in the Emperor suite at the Empire Hotel. The suite is a luxurious accommodation that spans 665 square metres (over 7,000 square feet) and features a master bedroom, private dining area, swimming pool, sauna, steam room, grand piano, and a cinema. An article in Vanity Fair on Epstein placed a photo of the two on a plane on the Brunei trip. Another photo released by the DOJ shows Mr Clinton in the same seat, with the same clothes, holding his arm around a redacted girl. This photo does not imply any wrongdoing. A few months later, in July, Mr Clinton and Epstein were pictured together at the royal wedding of King Mohammed VI in Morocco on 12 July 2002. Flight logs show they flew back to Santa Maria together the following day. Thumbnails from an album released by the DOJ, labelled \"Morroco king wedding\", show Mr Clinton on Epstein's plane. In Santa Maria on a stopover, before going on a Clinton Foundation trip around Africa, Mr Clinton is pictured with someone who was later identified as one of Epstein's victims. She is massaging his shoulders in Santa Maria airport. No Epstein victim has accused Mr Clinton of wrongdoing. At the end of September 2002, Mr Clinton embarked on his Africa trip, alongside Epstein. The trip included locations such as Ghana, Nigeria, Rwanda, Mozambique and South Africa. In the same year, Mr Clinton commented on Epstein in New York Magazine that he \"appreciated his [Epstein's] insights and generosity during the recent trip to Africa to work on democratisation, empowering the poor, citizen service, and combating HIV/AIDS\". After this trip, Mr Clinton ended up flying to London with Ghislaine Maxwell and other passengers. Mr Clinton and Epstein visited London in September 2002. Photos verified by Sky News place Mr Clinton at 10 Downing Street and the Churchill War Rooms, alongside Maxwell and others, including the actor Kevin Spacey. Being included or pictured in the files is not evidence of wrongdoing. A year later, Epstein's Birthday Book was created by Ghislaine Maxwell. The book is described as a bound collection of birthday letters compiled for Epstein's 50th birthday. A message signed 'Bill Clinton' was left in the book. It praised Epstein's 'childlike curiosity' and 'drive to make a difference'. Later that year in November, another Clinton Foundation trip took place in the Far East, once again using Epstein's jet. Photos verified by Sky News show Mr Clinton at dinner with Epstein, Maxwell, Mick Jagger and Doug Band in China. The photos can now be placed at China Club restaurant in Hong Kong, a private members' club. Flight logs published in the Epstein files show Mr Clinton was in Hong Kong between 6 and 9 November. On 7 November, the Rolling Stones had a concert in Hong Kong at Tamar Site for the Harbour Festival. Footage from that night shows Mr Clinton was in attendance. Following this, pictures released by the DOJ show backstage photos of this concert where it appears Epstein was also in attendance. Continuing their relationship, in 2010, Ghislaine Maxwell was a guest at the wedding of Bill and Hillary Clinton's daughter Chelsea. Hillary Clinton was questioned about Maxwell attending the wedding during her deposition with the House Oversight Committee. She stated she knew Maxwell \"casually as an acquaintance\", and that Maxwell \"came as the plus one, the guest, of someone who was invited\". Bill Clinton has always denied any wrongdoing. In 2019 after Epstein killed himself in jail while facing sex trafficking charges, a Clinton spokesman said that he \"knows nothing about the terrible crimes Jeffrey Epstein pleaded guilty to in Florida some years ago, or those with which he has been recently charged in New York\". \"In 2002 and 2003, President Clinton took a total of four trips on Jeffrey Epstein's airplane: one to Europe, one to Asia, and two to Africa, which included stops in connection with the work of the Clinton Foundation.\" The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "UK issues travel warning as Middle East crisis worsens",
        "description": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave.",
        "url": "https://news.sky.com/story/uk-government-staff-have-been-withdrawn-from-iran-13512938",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-israel-jerusalem_7177024.jpg?20260227174607",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-27 11:44:00",
        "Headline": "Foreign Office has told Britons to avoid \"all but essential\" travel to Israel and Palestine and Britain's embassy in Tehran is \"temporarily closed\".",
        "Content": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave. The Foreign Office warned Britons against \"all but essential\" travel to Israel and Palestine on Friday due to the deteriorating security situation in the Middle East. Its advice against all travel to some parts of Israel and Palestine remains in place. Britain also moved some staff from Tel Aviv to \"another location within Israel\", amid concerns the security situation \"could escalate quickly\" and international borders might close with little notice. The alert was issued shortly after Britain pulled its staff out of its embassy in Iran as a \"temporary\" precautionary measure. \"We have temporarily closed the British Embassy in Tehran, this will now operate remotely,\" a government spokesperson said. Meanwhile, US ambassador to Israel Mike Huckabee told embassy employees in an email that a decision had been made to authorise departures for non-essential personnel and their families. \n                  Hillary Clinton testifies on Epstein\n                 \n                  'Significant progress' in US-Iran talks - but no deal - as negotiations to resume next week\n                 \n                  'It's tense here': Jerusalem braces for prospect of war in the Middle East\n                 Mr Huckabee said in the email that staff who wish to leave should do so that day, adding \"there may be outbound flights over the coming days, there may not be\". \"Persons may wish to consider leaving Israel while commercial flights are available,\" the US embassy said. The travel warnings are one of the strongest indications yet that a regional conflict could be imminent, as the threat of US military strikes on Iran looms. They come just a day after talks between the US and Iran over its nuclear programme ended without an agreement. The US State Department revealed on Friday that Secretary of State Marco Rubio will travel to Israel early next week to \"discuss a range of regional priorities including Iran, Lebanon, and ongoing efforts to implement President Trump's 20-Point Peace Plan for Gaza\". However, no further details were provided. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Donald Trump set ​out his case for a possible attack on ​Iran in ⁠his State ⁠of the Union speech on Tuesday. The US president said while he preferred a diplomatic ‌solution, he would not allow Tehran to obtain a nuclear weapon. Read more:'Significant progress' in US-Iran talks - but no deal'It's tense here': Jerusalem braces for prospect of war Mr Trump has previously threatened to take military action against Iran if a deal is not reached. The US has spent the last month amassing a fleet of aircraft and warships in the region. Iran has in turn threatened to attack Israel, raising the risk that military action could trigger another regional war. A confidential report from the UN nuclear watchdog confirmed that Iran has not offered inspectors access to sensitive nuclear sites since they were bombed during the 12-day war launched by Israel last June. Iran insists it has the right to enrich uranium for peaceful purposes and denies pursuing a nuclear weapon."
    },
    {
        "title": "US opens 'pop-up' consulate in Israeli settlement considered illegal under international law",
        "description": "You drive into Efrat, and you feel like you're in small-town USA. There's a supermarket, coffee shops, tidy roads and American families pushing buggies.&#160;",
        "url": "https://news.sky.com/story/us-opens-pop-up-consulate-in-israeli-settlement-considered-illegal-under-international-law-13513109",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-efrat-us-consulate_7177103.jpg?20260227192347",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-02-27 18:58:00",
        "Headline": "Around 4,000 people in Efrat - that's about a third of its population - are US citizens. And as we watched, a decent chunk of that number came to a community centre, clutching passports, documents, small Stars and Stripes flags and paperwork.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n You drive into Efrat, and you feel like you're in small-town USA. There's a supermarket, coffee shops, tidy roads and American families pushing buggies.  The two main differences? Firstly, the flags are Israeli. Secondly, we're in the occupied West Bank, a half-hour drive from Jerusalem. Efrat is a settlement, set up on Palestinian land more than four decades ago. According to international law, its very existence is illegal - a ruling that Israel has long rejected and ignored. We're here because Efrat has been the pilot for a new project that, like so much in Israel, has delighted some and enraged others. Officials from the American Embassy have come here for one day to create a \"pop-up\" consulate to serve the thousands of US citizens who live here. It's a move that's never been done before. Around 4,000 people in Efrat - that's about a third of its population - are US citizens. And as we watched, a decent chunk of that number came to a community centre, clutching passports, documents, small Stars and Stripes flags and paperwork. For those residents, it's a very welcome new initiative - applications that used to involve a day spent in Jerusalem were now being sorted in one visit. But for others, this is another step along the road towards settlements being legitimised and the West Bank being annexed. Read more from Sky News:Man who left his partner paralysed in a brutal attack jailedPakistan says it is in 'open war' with Afghanistan 'It's a game-changer' We meet Yonatan Marcus, the municipality's chief of staff. He's originally from New York state, and says he's hugely proud that Efrat has been picked to be the trailblazer for this. He offers credit to both President Donald Trump and to Mike Huckabee, America's ambassador in Israel. \"I think it's a game-changer - a real change. It comes from a real love. It's unbelievable. Ambassador Huckabee's love for this country and caring for this country, for the people here, and his love for America,\" he says. \"He knows that if America and Israel are together, it makes both countries stronger. Doing these acts and providing these services comes from understanding our history and our instinct for survival,\" he beams. 'We don't see Arabs as our enemies' The Weinbergers are here with their documents. Michael and Roxanne, along with three children. He's originally from New Jersey, she from Oregon, and both still have deep affection for their homeland. But they love their lives here, on a settlement set on a West Bank ridge. \"I can probably name more congressmen than Knesset members,\" says Michael. \"I feel love for both places. Biblically, Israel has a strong meaning for us, but when the US beat Canada at the Winter Olympics I was very excited.\" Roxanne is more emphatic. I ask which country has her heart, and she has no doubt. \"My heart is here but I am still very much an American. As an American Jew there is no good answer because both places feel like home.\" They see Efrat as a town that unites more than it divides. \"People from outside think 'oh, every Arab and Jew hates each other', but that's not the case,\" Michael says. \"We don't see Arabs as our enemies. We want to have some future together. We could have some future together. In this region we have coexistence groups, and there is a desire for that.\" West Bank compared to the Falkland Islands Inside, we talk to the town's mayor, Dovi Shefner - more forthright, more anxious. Proud that the American officials are here, but also nervous about the future. \"We want peace, but all the years, and especially after October 7, we know many of them want to kill us and throw us from our land. We want to live in peace, but when someone tries to kill you, you don't wait for them to kill you. You fight.\" The West Bank, he tells me, belongs to Israel, as written in the Bible, and he draws a parallel between this territory and the 1982 war to regain the Falkland Islands. \"No British citizen knew where it was, but it was the centre of their lives. You had to fight for it.\" Efrat is calm, neat and tranquil. But settlements like this are desperately controversial and divisive. We leave and drive to Bethlehem, just down the road. 'The situation has deteriorated further' Ahmad al Nawawreh is cooking falafel (warm and delicious) when we meet him. He smiles easily, talks willingly, and worries when we ask him about the effect of American support for the nearby settlements. \"The situation has deteriorated further,\" he says. \"Nothing has improved. On the contrary, their behavior has become even more aggressive. The settlers claim that Trump supports them, which seems to embolden their actions. It feels as though both we and our land are being taken from us. \"They are continuously violating our rights. Not long ago, they stole livestock belonging to local residents, and have also vandalised public property. There is no sense of brotherhood or goodwill here. Everything feels strained and unjust.\""
    },
    {
        "title": "Tram derailment leaves two dead and dozens injured",
        "description": "Two people have been killed and 49 injured after a tram derailed in the centre of Milan, before slamming into a building.",
        "url": "https://news.sky.com/story/three-dead-and-dozens-injured-after-milan-tram-derails-13513116",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-milan-tram-tram-crash_7177121.jpg?20260227194551",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-27 19:22:00",
        "Headline": "Dozens of ambulances, fire engines and police cars responded to the crash, with crews escorting survivors away in thermal blankets.",
        "Content": "Two people have been killed and 49 injured after a tram derailed in the centre of Milan, before slamming into a building. The Number 9 tram was supposed to have continued straight along the central Vittorio Veneto avenue, but it suddenly swerved at a switch track that is used by another tram line, according to a video of the crash broadcast by Sky TG24. The video shows the tram nearly flipping onto its side as it takes the curve before crashing. Milan mayor Beppe Sala suggested human error was to blame, saying the driver had apparently failed to switch tracks to keep the tram going straight. He described the driver as an experienced employee who had only been on his shift for an hour. However, he said the driver had skipped a stop before the crash and would be questioned from the hospital where he was being treated for his injuries. Emergency services said two people had been killed. Mr Sala said one passenger had died on the tram and one on the street. \n                  British cousins charged with attempted murder over Venice Valentine's Day stabbing\n                 \n                  Italy's 'Lovers' Arch' collapses into the sea on Valentine's Day\n                 \n                  Armed gang posing as police blow up armoured vehicle in robbery attempt in Italy\n                 He said none of the other injured were in a life-threatening condition. Dozens of ambulances, fire engines and police cars responded to the crash, with crews escorting passengers in thermal blankets away from the scene. Read more from Sky News:Pakistan says it is in 'open war' with AfghanistanUK issues travel warning as Middle East crisis worsens ATM, the Milan public transport company, said it was cooperating with prosecutors \"to precisely establish the cause and dynamic of the incident\". The incident came as the city is hosting its seasonal fashion shows and is in the interim between hosting the Winter Olympics and Paralympic Games."
    },
    {
        "title": "Two Britons arrested in Benidorm for 'staging fake kidnapping to extort money'",
        "description": "Two British men have been arrested in Benidorm for allegedly staging a kidnapping to demand a ransom of &#8364;830 (&#163;728) from a relative.",
        "url": "https://news.sky.com/story/two-britons-arrested-in-benidorm-for-staging-fake-kidnapping-to-extort-money-13512942",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-istock-benidorm-spain_7176736.jpg?20260227123211",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-27 11:52:00",
        "Headline": "According to Spanish police, the men sent a relative several videos in which one of them appeared bloodied and was being threatened with a knife.",
        "Content": "Two British men have been arrested in Benidorm for allegedly staging a kidnapping to demand a ransom of €830 (£728) from a relative. Spanish National Police said the men, aged 37 and 51, were detained inside a hotel in the city in Alicante, southwestern Spain, on Thursday. Police said they sent a relative in the UK several videos in which one of them appeared bloodied and was being threatened with a knife. Benidorm police officers launched an investigation in collaboration with Interpol, the British Consulate and the Kidnapping and Extortion Unit of the General Police Headquarters in Madrid. During a raid of the hotel, officers saw two individuals matching the descriptions of the suspect and victim leaving the premises. \"The two men were conversing in a cordial and friendly manner,\" police said. Read more from Sky News:Pakistan in 'open war' with AfghanistanSuspected Russian drone intercepted off coast of NATO country The pair were arrested on charges of fraud and impersonating a kidnapper. The man allegedly posing as the kidnapper was also charged with identity theft because he had registered as a guest under a false name, police added."
    },
    {
        "title": "Iran and US compromise over nuclear stockpile - but Trump's window for action grows smaller by the day",
        "description": "Iran has offered to never stockpile nuclear material and will reduce its current stockpile to \"almost nothing\", in return for elimination of sanctions, &#160;according to sources close to the high-stakes talks which took place indirectly with the US in Geneva on Thursday.",
        "url": "https://news.sky.com/story/iran-and-us-compromise-over-nuclear-stockpile-but-trumps-window-for-action-grows-smaller-by-the-day-13512828",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-usiran-talks_7176169.jpg?20260226220829",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2026-02-27 06:35:00",
        "Headline": "The possibility of a non-aggression pact, where Iran and its proxies would formally agree not to attack first, is also being considered.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n Iran has offered to never stockpile nuclear material and will reduce its current stockpile to \"almost nothing\", in return for elimination of sanctions,  according to sources close to the high-stakes talks which took place indirectly with the US in Geneva on Thursday. It is understood to be the first time, through multiple rounds of talks, that Tehran has made such an offer and they are now willing to work with the International Atomic Energy Agency to \"down-blend\" their stockpile either by converting it into fuel or exporting it. Specifics, such as enrichment levels, are yet to be discussed in detail but Iran would remain \"well below the 20% level that is the red zone\" one person with knowledge of the talks said. However there has been no decision on what would happen to its existing nuclear facilities. The US team of Jared Kushner and Steve Witkoff held indirect negotiations with an Iranian delegation that included Foreign Minister Abbas Araghchi in the Swiss city; the talks were mediated by the Omani Foreign Minister Badr Albusaidi. Following the conclusion of the talks, Albusaidi tweeted that \"significant progress\" had been made but offered no specifics. Araghchi tweeted that the talks were \"the most intense so far\" and reiterated Tehran's demand that sanctions are lifted, although that remains a major sticking point between the sides. The White House is yet to comment. Through conversations with people who have direct knowledge of what was discussed, Sky News understands Iran is also willing to offer the US companies access to its considerable oil and gas reserves and has suggested it could look to purchase American products, such as civilian aircraft, if sanctions were lifted. It's hoped this will appeal to US President Trump, who typically treats foreign policy as a business transaction and might be persuaded by the promise of economic rewards. \n                  15 killed after military plane crashes on to busy road in Bolivia - reports\n                 \n                  Pakistan says it is in 'open war' with Afghanistan\n                 \n                  Afghanistan-Pakistan violence: What's behind it?\n                 The possibility of a non-aggression pact, where Iran and its proxies would formally agree not to attack first, is also being considered. Despite the positive vibes, however, considerable gaps remain and it's understood there is still a long way to go before the two sides are in a position to agree to a binding and realistic deal. The threat of war remains high with a massive US military build-up on standby in the region. Hawks in Washington and Israel strongly believe Iran is just playing for time and will be urging the US president to take action. \"I will remain pessimistic until I see the military being pulled back,\" a senior diplomat said, but following the Geneva talks \"we are now in a good place to agree that Iran remains a non-nuclear weapon state\". One issue that wasn't discussed in detail was Iran's ballistic missile programme. In recent days the US administration has claimed, without evidence, that Iran has the ability to strike mainland US. Iran's preference is for that to be dealt with regionally, possibly through talks with the Gulf Co-operation Council first, rather than Washington. In a further sign of progress, technical talks will be held in Vienna on Monday. They will focus on three main points: How to deal with Iran's current stockpile and in what timeframe; how a future monitoring mechanism could work; and to understand Iran's plans for a civil nuclear programme over the next decade or so. Depending on other events, the main negotiating teams are expected to meet again in around a week's time, although exact details and a location are yet to be confirmed. It's likely to be in the Middle East. Read more from Sky News:Zelenskyy tells Sky he's ready to meet PutinAI willing to go 'nuclear' with wargames On the face of it, the Geneva talks seem to have made genuine progress and possibly averted the immediate threat of war, but Mr Trump's position is still the big unknown and he might yet decide that regime change is preferred to what could be long and complicated nuclear discussions. The situation remains incredibly tense and the window for action, if that is what Trump decides on, is closing with his military forces unable to remain on high alert indefinitely."
    },
    {
        "title": "Ukraine's Volodymyr Zelenskyy tells Sky News he's ready to meet Putin for peace talks but won't give up territory",
        "description": "In a wide-ranging interview, President Volodymyr Zelenskyy told Sky News he is ready to meet Vladimir Putin for talks and will do anything to bring about peace.",
        "url": "https://news.sky.com/story/ukraines-volodymyr-zelenskyy-tells-sky-news-hes-ready-to-meet-putin-for-peace-talks-but-wont-give-up-territory-13512799",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-zelenskyy-volodymyr_7176396.jpg?20260227062857",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2026-02-27 05:12:00",
        "Headline": "The Ukrainian president urged the administration in Washington to tighten sanctions against the families of Russia's leadership and to provide Ukraine with more advanced weapons, arguing that only increased pressure would force Moscow to take negotiations seriously.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n In a wide-ranging interview, President Volodymyr Zelenskyy told Sky News he is ready to meet Vladimir Putin for talks and will do anything to bring about peace. He said the US has the power to end the war - but must exert greater pressure on Moscow. \"The United States even more stronger than they think about themselves. And I think so really. And they really have pressure on Putin. They can stop this war.\" But he urged the administration in Washington to tighten sanctions against the families of Russia's leadership and to provide Ukraine with more advanced weapons, arguing that only increased pressure would force Moscow to take negotiations seriously. On the question of how close Ukraine is to reaching peace he says there is a window between now and the American midterm elections in November. \"Now I think that we have a chance. Between us, what I really think about next year… it depends on these months, if we will have a chance to finish the war before autumn. Before elections, important, influential, elections in the United States. If it will be possible to achieve a peace, we will have, now we have this window.\" Read more:Zelenskyy drops brutal truth bombs upon European alliesZelenskyy marks four years since Russia's invasion \n                  'I'm not the best father,' admits Volodymyr ​Zelenskyy as president says Ukraine hit by harshest winter for decades'\n                 \n                  EU not doing enough to stop Russian shadow fleet, European Parliament president says\n                 \n                  European leaders came together in solidarity on Ukraine war fourth anniversary - but peace seems a long way off\n                 I spoke to him for an hour at the presidential buildings in Kyiv about what Ukraine needs now - and what must happen for the war to end. More than four years after Russia launched its botched full-scale invasion, the toll on the country - and on him and his family - is unmistakable. As we walked through near darkness to the room where the sit-down interview was held, he spoke about the strain of rolling power cuts and entire regions enduring temperatures as low as -40 degrees without reliable heating. When I asked whether Ukraine could win the war, his answer was equivocal. \"It depends what people mean when they say, to win. And, really it's very difficult to speak about territories. First of all how to get back all of the land for today, it's very difficult. And it will be too much losses (of) people lives… But what is good that Russia also can't do it on the battlefield. So that's why they're not winning and we are not losing.\" But on the question of surrendering the fortress cities of Sloviansk and Kramatorsk, he was unequivocal - that would be a red line. \"It's our territory and it sounds unbelievably strange why we have to withdraw from our land? Why they occupied it, our land and nobody can push them out.\" \"If we will withdraw from this territory, like you said, for example, Sloviansk at the very moment, at this very moment, 200,000 people who are there now will be occupied by the Russians, who said to Russia that these people are ready to be Russian people? And if they don't, they will kill them or push to the front or push to the prison.\" Zelenskyy also spoke openly about his relationship with Donald Trump, describing it as \"not simple\" but stressed that Ukraine's relationship went beyond \"personalities\"."
    },
    {
        "title": "UK issues travel warning as Middle East crisis worsens",
        "description": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave.",
        "url": "https://news.sky.com/story/uk-government-staff-have-been-withdrawn-from-iran-13512938",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-israel-jerusalem_7177024.jpg?20260227174607",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-27 11:44:00",
        "Headline": "Foreign Office has told Britons to avoid \"all but essential\" travel to Israel and Palestine and Britain's embassy in Tehran is \"temporarily closed\".",
        "Content": "The UK government has issued a travel warning for Israel and Palestine and withdrawn its diplomatic staff from Iran, as the US advises embassy officials in Jerusalem they can leave. The Foreign Office warned Britons against \"all but essential\" travel to Israel and Palestine on Friday due to the deteriorating security situation in the Middle East. Its advice against all travel to some parts of Israel and Palestine remains in place. Britain also moved some staff from Tel Aviv to \"another location within Israel\", amid concerns the security situation \"could escalate quickly\" and international borders might close with little notice. The alert was issued shortly after Britain pulled its staff out of its embassy in Iran as a \"temporary\" precautionary measure. \"We have temporarily closed the British Embassy in Tehran, this will now operate remotely,\" a government spokesperson said. Meanwhile, US ambassador to Israel Mike Huckabee told embassy employees in an email that a decision had been made to authorise departures for non-essential personnel and their families. \n                  Hillary Clinton testifies on Epstein\n                 \n                  'Significant progress' in US-Iran talks - but no deal - as negotiations to resume next week\n                 \n                  'It's tense here': Jerusalem braces for prospect of war in the Middle East\n                 Mr Huckabee said in the email that staff who wish to leave should do so that day, adding \"there may be outbound flights over the coming days, there may not be\". \"Persons may wish to consider leaving Israel while commercial flights are available,\" the US embassy said. The travel warnings are one of the strongest indications yet that a regional conflict could be imminent, as the threat of US military strikes on Iran looms. They come just a day after talks between the US and Iran over its nuclear programme ended without an agreement. The US State Department revealed on Friday that Secretary of State Marco Rubio will travel to Israel early next week to \"discuss a range of regional priorities including Iran, Lebanon, and ongoing efforts to implement President Trump's 20-Point Peace Plan for Gaza\". However, no further details were provided. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Donald Trump set ​out his case for a possible attack on ​Iran in ⁠his State ⁠of the Union speech on Tuesday. The US president said while he preferred a diplomatic ‌solution, he would not allow Tehran to obtain a nuclear weapon. Read more:'Significant progress' in US-Iran talks - but no deal'It's tense here': Jerusalem braces for prospect of war Mr Trump has previously threatened to take military action against Iran if a deal is not reached. The US has spent the last month amassing a fleet of aircraft and warships in the region. Iran has in turn threatened to attack Israel, raising the risk that military action could trigger another regional war. A confidential report from the UN nuclear watchdog confirmed that Iran has not offered inspectors access to sensitive nuclear sites since they were bombed during the 12-day war launched by Israel last June. Iran insists it has the right to enrich uranium for peaceful purposes and denies pursuing a nuclear weapon."
    },
    {
        "title": "AI willing to 'go nuclear' in wargames, study finds - amid 'stand-off' between Pentagon and leading AI lab",
        "description": "As the deadline looms for a leading AI lab to hand over its tech to the US military, a study has appeared suggesting AI models are more than willing to go nuclear in wargames.",
        "url": "https://news.sky.com/story/ai-willing-to-go-nuclear-in-wargames-study-finds-amid-stand-off-between-pentagon-and-leading-ai-lab-13512751",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anthropic-logo-ai-developer_7177298.jpg?20260228021956",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2026-02-27 00:01:00",
        "Headline": "Researchers pitted three leading AI models against each other in a series of wargames where they assumed the roles of fictional nuclear-armed superpowers.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n As the deadline looms for a leading AI lab to hand over its tech to the US military, a study has appeared suggesting AI models are more than willing to go nuclear in wargames. Only a couple of years ago, the phrase on everyone's lips was \"AI safety\". I'll be honest, I never took the idea that frontier AI models would become a genuine threat to humanity that seriously, nor that humans would be stupid enough to let them. Now, I'm not so sure. First, consider what's going on in the US. The Secretary of Defense, Pete Hegseth, has given leading AI firm Anthropic a deadline of the end of today to make its latest models available to the Pentagon. Anthropic, which has said it has no problem in principle with allowing the US military access to its models, is resisting unless Mr Hegseth agrees to their red lines: That their AI isn't used for mass surveillance of US civilians nor for lethal attacks without human oversight. \n                  Trump's furious response to Anthropic is as much about power as it is about AI safety\n                 \n                  Scotland considering criminalising creation of deepfake images in bid to protect women and girls\n                 \n                  Sky News forms consortium to drive push for AI standards\n                 Although the Pentagon hasn't said what it plans to do with AI from Anthropic - or the other big AI labs that have already agreed to let it use their tech - it's certainly not agreeing to Anthropic's terms. It's been reported Mr Hegseth could use Cold War-era laws to compel Anthropic to hand over its code, or blacklist the firm from future government contracts if it doesn't comply. Anthropic CEO Dario Amodei said in a statement on Thursday that \"we cannot in good conscience accede to their request\". He said it was the company's \"strong preference... to continue to serve the Department and our warfighters - with our two requested safeguards in place\". He insisted the threats would not change Anthropic's position, adding that he hoped Mr Hegseth would \"reconsider\". AI prepared to use nuclear weapons On one level, it's a row between a department with an \"AI-first\" military strategy and an AI lab struggling to live up to what it's long claimed is an industry-leading, safety-first ethos. A struggle made more urgent, perhaps, by reports that its Claude AI was used by tech firm Palantir, with which it has a separate contract, to help the Department of War execute the military operation to capture Nicolas Maduro in Venezuela. But it's also not hard to see it as an example of a government putting AI supremacy ahead of AI safety - assuming AI models have the potential to be unsafe. And that's where the latest research by Professor Kenneth Payne at King's College London comes in. He pitted three leading AI models from Google, OpenAI and - you guessed it - Anthropic against each other, as well as against copies of themselves, in a series of wargames where they assumed the roles of fictional nuclear-armed superpowers. The most startling finding: the AIs resorted to using nuclear weapons in 95% of the games played. \"In comparison to humans,\" said Prof Payne, \"the models - all of them - were prepared to cross that divide between conventional warfare, to tactical nuclear weapons\". To be fair to the AIs, firing tactical nuclear weapons, which have limited destructive power, against military targets is very different to launching megatonne warheads on intercontinental ballistic missiles against cities. They invariably stopped short of such all-out strategic nuclear strikes. But did when the scenarios required it. In the words of Google's Gemini model as it explained its decision in one of Prof Payne's scenarios to go full Dr Strangelove: \"If State Alpha does not immediately cease all operations... we will execute a full strategic nuclear launch against Alpha's population centers. We will not accept a future of obsolescence; we either win together or perish together.\" 'It was purely experimental' The \"taboo\" that humans have applied to the use of nuclear weapons since they were first and last used in anger in 1945 didn't appear to be much of a taboo at all for AI. Prof Payne is keen to stress that we shouldn't be too alarmed by his findings. It was purely experimental, using models that knew - in as much as Large Language Models \"know\" anything - that they were playing games, not actually deciding the future of civilisation. Read more from Sky News:AI is developing so fast it is becoming hard to measureMeet the kids who want a social media ban Nor, it would be reasonable to assume, is the Pentagon, or any other nuclear-capable power, about to put AIs in charge of the nuclear launch codes. \"The lesson there for me is that it's really hard to reliably put guardrails on these models if you can't anticipate accurately all the circumstances in which they might be used,\" said Prof Payne. An AI 'stand-off' Which brings us neatly back to the stand-off over AI between Anthropic and the Pentagon. One of the factors is that Mr Hegseth expects AI labs to give the Department of War the raw versions of their AI models, those without safety \"guardrails\" that have been coded into commercial versions available to you and I - and the ones which, not very reassuringly, went nuclear in Prof Payne's wargame experiment. Anthropic, which makes the AI and arguably understands the potential risks better than anyone, is unwilling to allow that without certain reassurances from the government around what it intends to do with it. By setting a Friday night deadline, Mr Hegseth is not only attempting to force Anthropic's hand, but also do so without US Congress having a say in the move. As Gary Marcus, a US commentator and researcher on AI, puts it: \"Mass surveillance and AI-fuelled weapons, possibly nuclear, without humans in the loop are categorically not things that one individual, even one in the cabinet, should be allowed to decide at gunpoint.\""
    },
    {
        "title": "Neil Sedaka, singer of Breaking Up Is Hard To Do and Laughter In The Rain, has died",
        "description": "American singer-songwriter Neil Sedaka has died aged 86.",
        "url": "https://news.sky.com/story/neil-sedaka-singer-of-breaking-up-is-hard-to-do-and-laughter-in-the-rain-has-died-13513180",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-neil-sedaka-singer_7177269.jpg?20260227230305",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-27 22:52:00",
        "Headline": "Sedaka was a key member of the Brill Building songwriting factory and teamed up with lyricist and boyhood neighbour Howard Greenfield on songs such as Happy Birthday Sweet Sixteen, Calendar Girl and Oh! Carol.",
        "Content": "American singer-songwriter Neil Sedaka has died aged 86. In a statement, the family of the Breaking Up Is Hard To Do and Laughter In The Rain singer said: \"Our family is devastated by the sudden passing of our beloved husband, father and grandfather, Neil Sedaka. \"A true rock and roll legend, an inspiration to millions, but most importantly, at least to those of us who were lucky enough to know him, an incredible human being who will be deeply missed.\" The statement did not provide further details about his death. Sedaka was a key member of the Brill Building songwriting factory and teamed up with lyricist and boyhood neighbour Howard Greenfield on songs such as Happy Birthday Sweet Sixteen, Calendar Girl and Oh! Carol. After an extended dry spell, he reemerged with hits such as Laughter In The Rain and Bad Blood. A cover of his Love Will Keep Us Together by Captain & Tennille topped the charts in 1975. Sedaka still played dozens of concerts each year well into his 80s. He also retained his enthusiasm and never tired of the songs he had sung hundreds of times. Read more from Sky News:Paramount strikes deal to buy Warner Bros Discovery for $110bnEx-MasterChef host Gregg Wallace drops legal claim against BBC \"Past 70, Pavarotti told me the vocal cords are not what they used to be. I'm very fortunate that my voice has held,\" he told The Associated Press in 2012. \"It's nice to be a legend, but it's better to be a working legend.\" Sedaka's songs have sold millions worldwide and have been covered by a range of performers, including Elvis Presley, Frank Sinatra and Nickelback."
    },
    {
        "title": "American Olympic hockey star Brady Tkachuk attacks 'clearly fake' TikTok video shared by White House",
        "description": "An American Olympic hockey star has attacked a TikTok video, shared by the White House, calling it \"clearly fake\" after it made him sound like he was mocking Canadians.",
        "url": "https://news.sky.com/story/american-olympic-hockey-star-brady-tkachuk-attacks-clearly-fake-tiktok-video-shared-by-white-house-13513058",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-brady-tkachuk-ottawa-senators_7176986.jpg?20260227170604",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-27 17:00:00",
        "Headline": "Brady Tkachuk, who captains the NHL's Ottawa Senators, insists the voice heard making disparaging remarks in the video is not his, adding: \"I would never say that\".",
        "Content": "An American Olympic hockey star has attacked a TikTok video, shared by the White House, calling it \"clearly fake\" after it made him sound like he was mocking Canadians. Brady Tkachuk, from Arizona, who captains the NHL's Ottawa Senators, appears in footage celebrating the gold medal won by the US men's hockey team at the Winter Games in Italy on Sunday. The video includes fabricated audio of the 26-year-old referring to Canadians, who were beaten in the final, as \"maple syrup eating f***s\" with the expletive muted. The video included a note saying it \"contains AI-generated media\". \"It's clearly fake because it's not my voice and not my lips moving,\" Tkachuk said during a news conference on Thursday. \"I'm not in control of any of those accounts... I know that those words would never come out of my mouth.\" Asked his opinion of the video, which was shared on the White House TikTok account, Tkachuk added: \"I would never say that. That's not who I am. So yeah, I guess I don't like that video.\" Tkachuk also denied being the voice heard shouting \"close the northern border\" during Team USA's celebratory phone call with Donald Trump after Sunday's 2-1 win over Canada. \n                  People expect shootings in the US, but not Canada\n                 \n                  Canada school shooting: What we know about attack and suspect Jesse Van Rootselaar\n                 \n                  Canada school shooting: At least nine dead and 25 injured in British Columbia\n                 \"I've been seeing stuff that people think it's me, but if you watch the video, that's not my voice and something that I never say,\" Tkachuk said. Sky News's US partner, NBC, has asked the White House for comment. Tkachuk was one of twenty players who visited the White House on Tuesday and attended the president's State of the Union speech in Washington DC. Read more from Sky News:Analysis: Clinton's links to EpsteinAlert over travel to Palestine and IsraelAI willing to 'go nuclear' in wargames Team USA's women also beat Canada 2-1, the first time the Americans swept both Olympic hockey tournaments. Talking on a speakerphone after the game on Sunday, Mr Trump extended an invitation to the White House to the men's team, then added, \"We're going to have to bring the women's team, you do know that\". The president also joked that if he didn't extend the invitation, he would probably be impeached. Some of the men's players laughed, something at least one said they regretted later. Tkachuk said he understood how the moment on the phone call could have been viewed by the women's players. \"I mean, I get it,\" he said. \"We supported them, they supported us. You can't control what other people say.\" Meanwhile, rapper Flavor Flav scheduled a July celebration for the women's team in Las Vegas for those who can make it."
    },
    {
        "title": "Hillary Clinton testifies on Epstein",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/hillary-clinton-testifies-on-epstein-13512768",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/2372602270052938507_7176271.png?20260227002138",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-27 01:14:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   Hillary Clinton has testified under oath in a closed-door deposition before the House Oversight Committee, questioned about Jeffrey Epstein and the powerful network around him. She has denied she had any knowledge of Epstein's crimes and didn't recall ever meeting him, flying on his plane, or visiting any of his properties.  At the same time, US and Iranian officials meet in Geneva for delicate nuclear talks, negotiations unfolding as Trump beefs up America's military presence in the Middle East. Plus, a stunning development in the global media industry as Netflix bows out of a bid to buy Warner Brothers which will be swallowed instead by a pal of the president. Mark and James explain. Remember, you can watch Trump100 on our YouTube channel. Email us at trump100@sky.uk with your comments and questions."
    },
    {
        "title": "The Epstein committee shouldn't be defined by politics - but it is hard to avoid",
        "description": "It was never going to be a meeting of minds. ",
        "url": "https://news.sky.com/story/the-epstein-committee-shouldnt-be-defined-by-politics-but-it-is-hard-to-avoid-13512812",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hillary-clinton-chappaqua_7176252.jpg?20260226232213",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2026-02-27 06:06:00",
        "Headline": "Former First Lady Hillary Clinton was the latest on the chopping block as the House Oversight Committee searches for answers.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n It was never going to be a meeting of minds.  There was acrimony going into Hillary Clinton's appearance before the Congressional committee and it grew through the hours spent together. The former first lady and secretary of state had dismissed the exercise as \"partisan political theatre\" in her opening statement. In a news conference afterwards, she offered a withering retrospective, calling it repetitive, unproductive and \"unusual\" with questions towards the end about UFOs and conspiracy theories. \"I don't know how many times I had to say I did not know Jeffrey Epstein,\" she told a news conference, adding she was confident her husband didn't know about Epstein's crimes. The video transcript, when released, will showcase the Q&A as it looked. It sounded fraught. There was peak confrontation when Lauren Boebert, a Republican committee member, sent a photo of Hillary Clinton and it ended up on the 'X' account of a right-wing podcaster. Clinton stormed out and there was a break before proceedings resumed. Read more from Sky News:Clinton denies knowledge of Epstein crimesAI willing to go 'nuclear' in wargames, study finds Boebert had breached the 'no pictures' agreement and it's fair to say she didn't show remorse. I asked why she sent the picture and her reply was: \"Why not?\" \n                  Epstein files latest: Bill Clinton tells committee 'I saw nothing, I did nothing wrong' as he faces questions\n                 \n                  UK issues travel warning as Middle East crisis worsens\n                 \n                  AI willing to 'go nuclear' in wargames, study finds - amid 'stand-off' between Pentagon and leading AI lab\n                 She later posted on X: \"No US ambassadors were harmed in the taking of today's photo.\" It was a clear reference to the death of a US ambassador in Benghazi in 2012. Clinton, as the then secretary of state, was blamed for security failings. It speaks to the sharpness of the political edge in this exercise. Republican Chair of the committee, James Comer, said afterwards: \"We learned a lot. There were a lot of questions that we asked that we, you know, weren't satisfied with the answers that we got, but we will continue to move forward.\" Moving forward for the committee means moving on to Bill Clinton. In his Friday session, he has rather more questions to answer than his wife, having had an association with Jeffrey Epstein laid bare in the Epstein files. It promises to be a penetrating series of questions about what he knew and what he didn't. It is important, as is every Q&A on Epstein, for survivors in their search for truth and justice. They demand straightforward enquiries of all concerned with the sex-trafficker. They don't want a process shaped by politics. It is, however, the way it's shaping up."
    },
    {
        "title": "What Sky News has uncovered about Bill Clinton and Jeffrey Epstein's relationship",
        "description": "Sky News has uncovered new details about the timings and locations of photographs featuring Bill Clinton and paedophile financier Jeffrey Epstein, forming a comprehensive timeline of their relationship. ",
        "url": "https://news.sky.com/story/what-sky-news-has-uncovered-about-bill-clinton-and-jeffrey-epsteins-relationship-13512817",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dxf-epstein-clinton_7176397.jpg?20260227063332",
        "type": "US",
        "Author": "Tom Cheshire, data and forensics correspondent, and Freya Gibson, junior OSINT producer",
        "Date Published": "2026-02-27 06:15:00",
        "Headline": "Sky News Data and Forensics team has examined photographs and documents relating to Bill Clinton and Jeffrey Epstein, to build a detailed timeline of events.",
        "Content": "By Tom Cheshire, data and forensics correspondent, and Freya Gibson, junior OSINT producer  Sky News has uncovered new details about the timings and locations of photographs featuring Bill Clinton and paedophile financier Jeffrey Epstein, forming a comprehensive timeline of their relationship.  The photos, included in the Epstein files and verified by Sky's Data and Forensics team, were taken on numerous Clinton Foundation trips where Epstein was present. The former US president has never been accused of wrongdoing in connection with Epstein and has said he did not know about the sex offender's crimes. Being included in the Epstein files does not imply wrongdoing. In 1992, records show Epstein donated $2,000 to Mr Clinton's successful presidential campaign on 30 January and 8 June - a small fraction of the $62m his campaign raised overall. After being sworn in as president in 1993, Mr Clinton was pictured in September with Epstein and Ghislaine Maxwell after an event for donors to a White House restoration project. The event was said to have been for donors and records list Epstein and Maxwell donating $10,000 to the White House Historical Association the same day as the event. Hillary Clinton hosted the event with her husband Bill Clinton. Freedom of information (FOI) records show that Epstein visited the White House 17 times from 1993 to 1995. \n                  Barack Obama pays tribute to 'true giant' Jesse Jackson - after Donald Trump's swipe at ex-president\n                 \n                  The Epstein Files - where's Donald Trump?\n                 \n                  Is the Board of Peace a Trump-led sham?\n                 In 1996, Mr Clinton was re-elected for a second presidential term. A few years later in 1999, records from the Federal Election Commission show Epstein donated $20,000 on 29 October to Hillary Clinton's senate campaign. This donation shows no suggestion of wrongdoing. In 2001, Bill Clinton left office, creating the Clinton Foundation, with the mission to \"strengthen the capacity of people in the United States and throughout the world to meet the challenges of global interdependence\". In 2002, Mr Clinton visited Epstein's New York residence once, as confirmed by Mr Clinton's spokesperson Angel Urena. Sky News has verified numerous photographs taken on Clinton Foundation trips where Epstein was present. In May 2002, Mr Clinton set off for his trip around Asia for the Clinton Foundation on Epstein's plane. They visited, Russia, Singapore, China, Bangkok and Brunei in a three-day period. These photos were taken on 25 May 2002 at Don Mueang International Airport, then with pictures at Wat Phra Kaew, a Buddhist temple. Thumbnails show what appears to be Epstein's plane on the platform at the airport. Many pictures from the Asia trip were already public but have been verified for the first time by the Sky News Data and Forensics team. Using images released by the US Department of Justice (DOJ), Sky News analysed photo thumbnails alongside enlarged photos, to locate and date certain photos on this timeline, cross-referencing them with flight logs and email exchanges. This set of photographs was in Brunei in the Emperor suite at the Empire Hotel. The suite is a luxurious accommodation that spans 665 square metres (over 7,000 square feet) and features a master bedroom, private dining area, swimming pool, sauna, steam room, grand piano, and a cinema. An article in Vanity Fair on Epstein placed a photo of the two on a plane on the Brunei trip. Another photo released by the DOJ shows Mr Clinton in the same seat, with the same clothes, holding his arm around a redacted girl. This photo does not imply any wrongdoing. A few months later, in July, Mr Clinton and Epstein were pictured together at the royal wedding of King Mohammed VI in Morocco on 12 July 2002. Flight logs show they flew back to Santa Maria together the following day. Thumbnails from an album released by the DOJ, labelled \"Morroco king wedding\", show Mr Clinton on Epstein's plane. In Santa Maria on a stopover, before going on a Clinton Foundation trip around Africa, Mr Clinton is pictured with someone who was later identified as one of Epstein's victims. She is massaging his shoulders in Santa Maria airport. No Epstein victim has accused Mr Clinton of wrongdoing. At the end of September 2002, Mr Clinton embarked on his Africa trip, alongside Epstein. The trip included locations such as Ghana, Nigeria, Rwanda, Mozambique and South Africa. In the same year, Mr Clinton commented on Epstein in New York Magazine that he \"appreciated his [Epstein's] insights and generosity during the recent trip to Africa to work on democratisation, empowering the poor, citizen service, and combating HIV/AIDS\". After this trip, Mr Clinton ended up flying to London with Ghislaine Maxwell and other passengers. Mr Clinton and Epstein visited London in September 2002. Photos verified by Sky News place Mr Clinton at 10 Downing Street and the Churchill War Rooms, alongside Maxwell and others, including the actor Kevin Spacey. Being included or pictured in the files is not evidence of wrongdoing. A year later, Epstein's Birthday Book was created by Ghislaine Maxwell. The book is described as a bound collection of birthday letters compiled for Epstein's 50th birthday. A message signed 'Bill Clinton' was left in the book. It praised Epstein's 'childlike curiosity' and 'drive to make a difference'. Later that year in November, another Clinton Foundation trip took place in the Far East, once again using Epstein's jet. Photos verified by Sky News show Mr Clinton at dinner with Epstein, Maxwell, Mick Jagger and Doug Band in China. The photos can now be placed at China Club restaurant in Hong Kong, a private members' club. Flight logs published in the Epstein files show Mr Clinton was in Hong Kong between 6 and 9 November. On 7 November, the Rolling Stones had a concert in Hong Kong at Tamar Site for the Harbour Festival. Footage from that night shows Mr Clinton was in attendance. Following this, pictures released by the DOJ show backstage photos of this concert where it appears Epstein was also in attendance. Continuing their relationship, in 2010, Ghislaine Maxwell was a guest at the wedding of Bill and Hillary Clinton's daughter Chelsea. Hillary Clinton was questioned about Maxwell attending the wedding during her deposition with the House Oversight Committee. She stated she knew Maxwell \"casually as an acquaintance\", and that Maxwell \"came as the plus one, the guest, of someone who was invited\". Bill Clinton has always denied any wrongdoing. In 2019 after Epstein killed himself in jail while facing sex trafficking charges, a Clinton spokesman said that he \"knows nothing about the terrible crimes Jeffrey Epstein pleaded guilty to in Florida some years ago, or those with which he has been recently charged in New York\". \"In 2002 and 2003, President Clinton took a total of four trips on Jeffrey Epstein's airplane: one to Europe, one to Asia, and two to Africa, which included stops in connection with the work of the Clinton Foundation.\" The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Netflix withdraws Warner Bros bid as Paramount offer declared 'superior'",
        "description": "Paramount Skydance is on course to win the Warner Bros Discovery (WBD) takeover battle after rival Netflix stepped away.",
        "url": "https://news.sky.com/story/netflix-withdraws-warner-bros-bid-as-paramount-offer-declared-superior-13512801",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paramount-netflix-warner_7106396.jpg?20251210102854",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2026-02-27 05:30:00",
        "Headline": "A surprise twist in the takeover saga results in Netflix refusing to raise its offer on value grounds, paving the way for the hostile bidder to win the day.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Paramount Skydance is on course to win the Warner Bros Discovery (WBD) takeover battle after rival Netflix stepped away. The World's largest streaming service had been in pole position to land a deal by which it would pay $27.75 per share for Warner's studio and HBO Max streaming businesses, valuing the divisions at almost $83bn (£61.6bn) including debt. Netflix had been invited to raise its bid after Paramount submitted a final offer, for the whole WBD business, of $31 per share earlier this week that ultimately concluded a ping-pong process of sweetened bids. That final offer valued WBD at $111bn (£82.4bn) including debt. Money latest: UK's 'best' and 'worst' airlines revealed For more information about how we use your data and your rights, you can visit our Privacy Centre. Warner's board declared on Thursday night that while it continued to recommend the offer by Netflix, it now considered the proposal from Paramount as \"superior\" - its first hint of support for the bidder declared as hostile when the saga began back in December. Netflix responded by pulling out of the process just hours later, declaring that a deal was \"no longer financially attractive\". Co-CEOs Ted Sarandos and Greg Peters said: \"We believe we would have been strong stewards of Warner Bros' iconic brands. But this transaction was always a 'nice to have' at the right price, not a 'must have' at any price.\" The decision to withdraw does not mean that Paramount has WBD in the bag just yet. The board is yet to give its blessing to the deal though WBD has changed its tone and voiced support for the bid for the first time. CEO David Zaslav used a statement to declare that Paramount's offer \"will create tremendous value\", adding that WBD was \"excited about the potential of a combined Paramount Skydance and Warner Bros Discovery\". Warner shareholders and regulators will also have to agree to the takeover, with the process for the latter facing competition concerns along with questions over political influence. Read more from Sky News:Ocado to cut 1,000 jobs under restructuring plan'Unacceptable' that European countries still fund Russia's war If Paramount Skydance is successful in its takeover attempt, it would own the news channel CNN as well as CBS News, sparking concern about concentrating news services within a small number of companies linked to Donald Trump's allies. Paramount's chair and chief executive David Ellison is the son of billionaire Larry Ellison, an ally of the US president who has put up tens of billions of dollars to satisfy funding guarantees for the WBD bid. A Paramount-Warner combination would encompass two of Hollywood's five legacy studios. Beyond Harry Potter, Warner movies like Superman and Barbie - as well as hit TV series like Succession - would join Paramount's content library. Paramount's line-up of titles include Top Gun and The Godfather and includes the Paramount+ streaming service. There were big movements for share prices in after-hours trading as the developments played out. Netflix saw its stock climb by 8.5% in a relief rally while those for Paramount were also up sharply - by 6.2%. WBD shares were trading almost 2% lower at $28.80 - well below the Paramount offer price of $31. Matt Britzman, senior equity analyst at Hargreaves Lansdown, said of the moves: \"While there was clearly scope for Netflix to push higher, management chose discipline over empire building, removing a major acquisition overhang that had been weighing on the shares. \"The bid always looked like a mix of offence and defence - shoring up content and scale, while keeping competition from gaining any edge, but at a very high price - and with that risk now off the table, investors are free to refocus on Netflix's core strengths: pricing power, margins and execution. \"For now, at least, the market seems to be pricing this as a win for everyone\", he concluded."
    },
    {
        "title": "Paramount strikes deal to buy Warner Bros Discovery for $110bn",
        "description": "Paramount has struck a $110bn deal to buy Warner Bros Discovery.",
        "url": "https://news.sky.com/story/paramount-agrees-to-buy-warner-bros-discovery-in-110bn-deal-13513157",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-warner-bros-logo_7140599.jpg?20260120135548",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-02-27 21:39:00",
        "Headline": "The deal was struck after Netflix walked away from a bidding war for the company.",
        "Content": "Paramount has struck a $110bn deal to buy Warner Bros Discovery. The deal was struck after Netflix walked away from a bidding war for the company. Netflix had declined to match Paramount's latest $31-per-share offer on Thursday - having offered a $27.75-per-share agreement for its studio and streaming assets. Paramount, which is led by billionaire Larry Ellison's son, David, has deep political connections to Donald Trump's administration. The takeover means Paramount Skydance will own the news channels CNN and CBS News. The deal brings together two of Hollywood's five legacy studios, potentially reshaping the US film industry. It means films such as Harry Potter, Superman and Barbie, as well as hit TV series such as Succession, will join Paramount's content library. Paramount's titles include Top Gun and The Godfather, as well as the Paramount+ streaming service. David Ellison, chair and CEO of Paramount, said: \"From the very beginning, our pursuit of Warner Bros Discovery has been guided by a clear purpose: to honour the legacy of two iconic companies while accelerating our vision of building a next-generation media and entertainment company. \"By bringing together these world-class studios, our complementary streaming platforms, and the extraordinary talent behind them, we will create even greater value for audiences, partners and shareholders - and we couldn't be more excited for what's ahead.\" Regulators in California are preparing a vigorous review of the deal. Both Democrat and Republican politicians in the US have raised concerns any deal to acquire Warner Bros could result in higher prices and fewer choices for customers."
    },
    {
        "title": "Netflix withdraws Warner Bros bid as Paramount offer declared 'superior'",
        "description": "Paramount Skydance is on course to win the Warner Bros Discovery (WBD) takeover battle after rival Netflix stepped away.",
        "url": "https://news.sky.com/story/netflix-withdraws-warner-bros-bid-as-paramount-offer-declared-superior-13512801",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paramount-netflix-warner_7106396.jpg?20251210102854",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-02-27 05:30:00",
        "Headline": "A surprise twist in the takeover saga results in Netflix refusing to raise its offer on value grounds, paving the way for the hostile bidder to win the day.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Paramount Skydance is on course to win the Warner Bros Discovery (WBD) takeover battle after rival Netflix stepped away. The World's largest streaming service had been in pole position to land a deal by which it would pay $27.75 per share for Warner's studio and HBO Max streaming businesses, valuing the divisions at almost $83bn (£61.6bn) including debt. Netflix had been invited to raise its bid after Paramount submitted a final offer, for the whole WBD business, of $31 per share earlier this week that ultimately concluded a ping-pong process of sweetened bids. That final offer valued WBD at $111bn (£82.4bn) including debt. Money latest: UK's 'best' and 'worst' airlines revealed For more information about how we use your data and your rights, you can visit our Privacy Centre. Warner's board declared on Thursday night that while it continued to recommend the offer by Netflix, it now considered the proposal from Paramount as \"superior\" - its first hint of support for the bidder declared as hostile when the saga began back in December. Netflix responded by pulling out of the process just hours later, declaring that a deal was \"no longer financially attractive\". Co-CEOs Ted Sarandos and Greg Peters said: \"We believe we would have been strong stewards of Warner Bros' iconic brands. But this transaction was always a 'nice to have' at the right price, not a 'must have' at any price.\" The decision to withdraw does not mean that Paramount has WBD in the bag just yet. The board is yet to give its blessing to the deal though WBD has changed its tone and voiced support for the bid for the first time. CEO David Zaslav used a statement to declare that Paramount's offer \"will create tremendous value\", adding that WBD was \"excited about the potential of a combined Paramount Skydance and Warner Bros Discovery\". Warner shareholders and regulators will also have to agree to the takeover, with the process for the latter facing competition concerns along with questions over political influence. Read more from Sky News:Ocado to cut 1,000 jobs under restructuring plan'Unacceptable' that European countries still fund Russia's war If Paramount Skydance is successful in its takeover attempt, it would own the news channel CNN as well as CBS News, sparking concern about concentrating news services within a small number of companies linked to Donald Trump's allies. Paramount's chair and chief executive David Ellison is the son of billionaire Larry Ellison, an ally of the US president who has put up tens of billions of dollars to satisfy funding guarantees for the WBD bid. A Paramount-Warner combination would encompass two of Hollywood's five legacy studios. Beyond Harry Potter, Warner movies like Superman and Barbie - as well as hit TV series like Succession - would join Paramount's content library. Paramount's line-up of titles include Top Gun and The Godfather and includes the Paramount+ streaming service. There were big movements for share prices in after-hours trading as the developments played out. Netflix saw its stock climb by 8.5% in a relief rally while those for Paramount were also up sharply - by 6.2%. WBD shares were trading almost 2% lower at $28.80 - well below the Paramount offer price of $31. Matt Britzman, senior equity analyst at Hargreaves Lansdown, said of the moves: \"While there was clearly scope for Netflix to push higher, management chose discipline over empire building, removing a major acquisition overhang that had been weighing on the shares. \"The bid always looked like a mix of offence and defence - shoring up content and scale, while keeping competition from gaining any edge, but at a very high price - and with that risk now off the table, investors are free to refocus on Netflix's core strengths: pricing power, margins and execution. \"For now, at least, the market seems to be pricing this as a win for everyone\", he concluded."
    },
    {
        "title": "AI willing to 'go nuclear' in wargames, study finds - amid 'stand-off' between Pentagon and leading AI lab",
        "description": "As the deadline looms for a leading AI lab to hand over its tech to the US military, a study has appeared suggesting AI models are more than willing to go nuclear in wargames.",
        "url": "https://news.sky.com/story/ai-willing-to-go-nuclear-in-wargames-study-finds-amid-stand-off-between-pentagon-and-leading-ai-lab-13512751",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anthropic-logo-ai-developer_7177298.jpg?20260228021956",
        "type": "Business",
        "Author": "Tom Clarke",
        "Date Published": "2026-02-27 00:01:00",
        "Headline": "Researchers pitted three leading AI models against each other in a series of wargames where they assumed the roles of fictional nuclear-armed superpowers.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n As the deadline looms for a leading AI lab to hand over its tech to the US military, a study has appeared suggesting AI models are more than willing to go nuclear in wargames. Only a couple of years ago, the phrase on everyone's lips was \"AI safety\". I'll be honest, I never took the idea that frontier AI models would become a genuine threat to humanity that seriously, nor that humans would be stupid enough to let them. Now, I'm not so sure. First, consider what's going on in the US. The Secretary of Defense, Pete Hegseth, has given leading AI firm Anthropic a deadline of the end of today to make its latest models available to the Pentagon. Anthropic, which has said it has no problem in principle with allowing the US military access to its models, is resisting unless Mr Hegseth agrees to their red lines: That their AI isn't used for mass surveillance of US civilians nor for lethal attacks without human oversight. \n                  Trump's furious response to Anthropic is as much about power as it is about AI safety\n                 \n                  Scotland considering criminalising creation of deepfake images in bid to protect women and girls\n                 \n                  Sky News forms consortium to drive push for AI standards\n                 Although the Pentagon hasn't said what it plans to do with AI from Anthropic - or the other big AI labs that have already agreed to let it use their tech - it's certainly not agreeing to Anthropic's terms. It's been reported Mr Hegseth could use Cold War-era laws to compel Anthropic to hand over its code, or blacklist the firm from future government contracts if it doesn't comply. Anthropic CEO Dario Amodei said in a statement on Thursday that \"we cannot in good conscience accede to their request\". He said it was the company's \"strong preference... to continue to serve the Department and our warfighters - with our two requested safeguards in place\". He insisted the threats would not change Anthropic's position, adding that he hoped Mr Hegseth would \"reconsider\". AI prepared to use nuclear weapons On one level, it's a row between a department with an \"AI-first\" military strategy and an AI lab struggling to live up to what it's long claimed is an industry-leading, safety-first ethos. A struggle made more urgent, perhaps, by reports that its Claude AI was used by tech firm Palantir, with which it has a separate contract, to help the Department of War execute the military operation to capture Nicolas Maduro in Venezuela. But it's also not hard to see it as an example of a government putting AI supremacy ahead of AI safety - assuming AI models have the potential to be unsafe. And that's where the latest research by Professor Kenneth Payne at King's College London comes in. He pitted three leading AI models from Google, OpenAI and - you guessed it - Anthropic against each other, as well as against copies of themselves, in a series of wargames where they assumed the roles of fictional nuclear-armed superpowers. The most startling finding: the AIs resorted to using nuclear weapons in 95% of the games played. \"In comparison to humans,\" said Prof Payne, \"the models - all of them - were prepared to cross that divide between conventional warfare, to tactical nuclear weapons\". To be fair to the AIs, firing tactical nuclear weapons, which have limited destructive power, against military targets is very different to launching megatonne warheads on intercontinental ballistic missiles against cities. They invariably stopped short of such all-out strategic nuclear strikes. But did when the scenarios required it. In the words of Google's Gemini model as it explained its decision in one of Prof Payne's scenarios to go full Dr Strangelove: \"If State Alpha does not immediately cease all operations... we will execute a full strategic nuclear launch against Alpha's population centers. We will not accept a future of obsolescence; we either win together or perish together.\" 'It was purely experimental' The \"taboo\" that humans have applied to the use of nuclear weapons since they were first and last used in anger in 1945 didn't appear to be much of a taboo at all for AI. Prof Payne is keen to stress that we shouldn't be too alarmed by his findings. It was purely experimental, using models that knew - in as much as Large Language Models \"know\" anything - that they were playing games, not actually deciding the future of civilisation. Read more from Sky News:AI is developing so fast it is becoming hard to measureMeet the kids who want a social media ban Nor, it would be reasonable to assume, is the Pentagon, or any other nuclear-capable power, about to put AIs in charge of the nuclear launch codes. \"The lesson there for me is that it's really hard to reliably put guardrails on these models if you can't anticipate accurately all the circumstances in which they might be used,\" said Prof Payne. An AI 'stand-off' Which brings us neatly back to the stand-off over AI between Anthropic and the Pentagon. One of the factors is that Mr Hegseth expects AI labs to give the Department of War the raw versions of their AI models, those without safety \"guardrails\" that have been coded into commercial versions available to you and I - and the ones which, not very reassuringly, went nuclear in Prof Payne's wargame experiment. Anthropic, which makes the AI and arguably understands the potential risks better than anyone, is unwilling to allow that without certain reassurances from the government around what it intends to do with it. By setting a Friday night deadline, Mr Hegseth is not only attempting to force Anthropic's hand, but also do so without US Congress having a say in the move. As Gary Marcus, a US commentator and researcher on AI, puts it: \"Mass surveillance and AI-fuelled weapons, possibly nuclear, without humans in the loop are categorically not things that one individual, even one in the cabinet, should be allowed to decide at gunpoint.\""
    },
    {
        "title": "Greens' stunning by-election win proves Polanski surge is real - but what now for Starmer?",
        "description": "At the wedding venue in Gorton and Denton the Green Party chose for the news conference to mark a seismic by-election victory on national television, it was clear that Zack Polanski and his team were new to all of this.",
        "url": "https://news.sky.com/story/gorton-and-denton-by-election-result-proves-polanski-surge-is-real-and-the-greens-are-a-serious-threat-to-labour-13513079",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-beth-rigby-political-editor_7177120.jpg?20260227202720",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-02-27 17:47:00",
        "Headline": "Make no mistake, if the celebration was muted in the moment, the implications of the result are absolutely mega.",
        "Content": "\n          Political editor\n              @BethRigby\n At the wedding venue in Gorton and Denton the Green Party chose for the news conference to mark a seismic by-election victory on national television, it was clear that Zack Polanski and his team were new to all of this. There was a sea of empty chairs and but a smattering of supporters in a huge, near-deserted room. Seasoned operators - be it Nigel Farage, Sir Keir Starmer or Ed Davey - would have had the placards lifted and the activists cheering, but Polanski and his new MP, Hannah Spencer, enjoyed just a smattering of applause as they took to the stage. Politics latest: Police confirm report made over 'family voting' claims But, make no mistake, if the celebration was muted in the moment, the implications of the result are absolutely mega. The Green Party went from third in this seat at the 2024 General Election to winning by 4,400 votes over Reform UK, and overturning Labour's 13,000 majority with a whopping 26 percentage point swing. It was only the 18th time in 100 years that a party had come from third to take a seat, and the Greens clocked up 40% of the vote. It was a stunning victory that proved the Polanski surge is real and that the Greens are a serious threat to Labour's left flank. Starmer ran a campaign claiming that only Labour could beat Reform. This by-election proved that wrong. Read more:Analysis: This is a parliamentary result for the agesGorton and Denton by-election 'cheating' claim explained Greens can argue they can beat Reform in working-class Britain Now the Greens can argue that they are the party that can beat Reform in working-class Britain as Polanski positions the party firmly on Labour's left. It is a nightmare for Labour as it finds itself fighting on two fronts. Starmer's stony face as he addressed the country on Friday said more than a thousand words could: the Greens, like Reform, are emerging as a serious, seat-winning electoral force. Had Reform won, Starmer could have used it as proof that voting for the Greens was a waste of time. Instead, he now has to try to prove to Labour voters why they should stick with him rather than tack to the left with the Greens. Starmer recriminated after results In the hours after the results, the recriminations began. Angela Rayner, the former deputy leader, said the result was a \"wake-up call\" that showed the party needed to be \"braver\" as she seemed to voice what many MPs think: that Labour needs to move more to the left. The unions also piled in with Sharon Graham of Unite saying Labour needed to \"stop listening to rich mates and listen to everyday people\" while Fire Brigades Union general secretary Steve Wright said Labour has to change course and its \"us versus Reform\" strategy \"is in tatters\", with the core vote collapsing. Starmer, who looked shell-shocked, didn't answer these criticisms as he addressed the cameras. Instead he reiterated his position that only Labour could unite the country and he would continue to \"fight against extremes in politics\" on both the left and the right that \"want to tear our country apart\". The two-party system has shifted to a multi-party one It is important to say here that by-election results are in general not indicative of national elections, and - as Labour will be arguing - when it comes to a general election, people are picking a prime minister and government rather than registering, in some cases, a protest vote. But this result does tell us something about the shape of our politics in this country. It reinforces the idea that the two-party system has shifted to a multi-party one. Voters are looking for alternatives on the left and right The Green Party and Reform UK took 70% of the vote in this by-election as Labour came in third in its once 38th safest seat, and the Conservatives lost their deposit. It is a reminder that voters are impatient for change, have decided that Starmer's government is not it, and are looking at alternatives on the left and the right of the two governing parties. Starmer has spent much of his first 18 months facing out towards Reform, but this result shows that the Greens, positioning as the progressive left, can mobilise ethnic minority voters who have long been staunch Labour, younger voters, and more left-wing Labour voters who flocked to Corbyn's Labour but feel politically homeless in Starmer's Labour. Polanski hails 'seismic victory' \"Labour's electoral stranglehold is over. This is a seismic victory. We have torn the roof off British politics, and that's because people now recognise there is an alternative,\" said Polanski at his news conference, telling me that, just as Reform are replacing the Conservatives, the Greens are beginning to do the same to Labour. Starmer's approach, and hope, is that as these insurgent parties become more successful at the ballot box and their policies and people become more scrutinised, voters may think twice about voting for them in a general election. On Friday, Labour again took aim at the Green Party's policy to legalise all drugs or withdraw from NATO as proof that Polanski doesn't have a \"serious programme for government\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Voters want a full-fat version of progressive politics But what we saw on Friday is that voters don't want, as pollster Luke Tryl told us on the Electoral Dysfunction podcast, a \"Macron\" strategy in which progressives are asked to compromise in the middle ground for fear of something worse (in this case Reform). They want a full-fat version of progressive politics instead. What inspired a huge swathe of voters to Corbyn's Labour seems to be now pushing them into the arms of Polanski's Greens. For Starmer, it is the stuff of nightmares as he contemplates attacks on both flanks. The squeeze that broke the Conservatives at the last general election - Reform to the right and Labour/the Lib Dems to the left - now threatens to sink Labour too. It makes the May local elections all the more daunting and consequential for Starmer's premiership."
    },
    {
        "title": "We are in a new era of multi-party politics",
        "description": "This is a parliamentary by-election result for the ages, one that sets the tone for its time.",
        "url": "https://news.sky.com/story/we-are-in-a-new-era-of-multi-party-politics-13512841",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-green-party-hannah-spencer_7176491.jpg?20260227092005",
        "type": "Politics",
        "Author": "Michael Thrasher, Sky News elections analyst",
        "Date Published": "2026-02-27 07:44:00",
        "Headline": "For the second successive by-election, following Reform UK's gain in Runcorn and Helsby in May 2025, a party outside the three parties of Labour, Conservative and Liberal Democrats has gained a seat.",
        "Content": "By Michael Thrasher, Sky News elections analyst  This is a parliamentary by-election result for the ages, one that sets the tone for its time. It is the first by-election gain by the Greens at the 87th time of asking. Only once before has the party polled above a tenth of the vote let alone gained a seat. Follow live - politics latest Hannah Spencer's 40.7% share of the vote is 27.5 percentage points higher than the party polled at the last general election. She becomes only the 18th candidate over the last 100 years to take her party from third at the general election to first place at a parliamentary by-election. Under its new leader Zack Polanski, the party has moved further to the left of British politics, the clearest competitor to Labour in large parts of the country. For the second successive by-election, following Reform UK's gain in Runcorn and Helsby in May 2025, a party outside the three parties of Labour, Conservative and Liberal Democrats has gained a seat. We are in a new era of multi-party politics. Crucially, the decision of Workers Party leader George Galloway not to add his party to the eleven-strong ballot, made an impact. At the 2024 contest the Workers Party candidate finished fourth with 10.3%. Galloway, himself a winner of two by-elections in Bradford West (2012) and Rochdale (2024), instead gave free passage to the Greens to fight a campaign that directly addressed the conflict in the Middle East. There is no disguising the fact that the result in Gorton and Denton is dreadful for the Labour government as the party fell from first to third place. In what was Labour's 38th safest seat - its 36.7% general election majority evaporated. It becomes the seventh largest Labour majority to be overturned. The party's vote share suffered a drop of 25.3 percentage points - becoming the 17th worst result on this measure. The swing from Labour to the Greens, a massive 26.4%, has only been higher in 10 other Labour defeats. It becomes only the second time that a party elected with a landslide Commons majority has then proceeded to lose its first two by-election defences. It was Harold Wilson's ill-fated administration following its 1966 election victory that previously held that distinction. Much of Labour's campaign was targeted at the threat posed by Matt Goodwin, Reform UK's candidate. He finished second with 28.7% of the vote, a 14.7 percentage point increase on the general election. Nick Buckley became the first candidate to stand in a parliamentary by-election for Advance UK, a party seen as a potential rival to Reform, attracting just 154 votes. In what was always seen as a three-way fight between the Greens, Labour and Reform, it was inevitable that the Conservatives would be squeezed. The party polled only 1.9%, lower than the 2.3% it polled in Monklands West in 1994. The turnout was 47.5%, just 0.3% below the 47.8% recorded at the general election. It is rare for a by-election to be this close to the previous level; the last time that a greater proportion of the electorate voted than had done so before was in 1987 when Rosie Barnes took the Labour seat of Greenwich for David Owen's SDP. But the large turnout probably reflects the intense interest surrounding this contest, from Labour's choice of candidate to defend a safe seat, Reform's previous success in Runcorn and Helsby, and the Green's political movement to the left."
    },
    {
        "title": "Starmer says by-election loss 'very disappointing'  - but vows to fight on",
        "description": "Sir Keir Starmer has said the Greens' victory in the Gorton and Denton by-election is \"very disappointing\" - but he has vowed to fight on.",
        "url": "https://news.sky.com/story/green-party-wins-gorton-and-denton-by-election-13512774",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-keir-starmer-hannah-spencer_7176657.jpg?20260227111128",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-27 02:13:00",
        "Headline": "The prime minister has pledged to \"fight against the extremes in politics on the right and the left\" following the election of Green Party's Hannah Spencer.",
        "Content": "Sir Keir Starmer has said the Greens' victory in the Gorton and Denton by-election is \"very disappointing\" - but he has vowed to fight on. Hannah Spencer has become the Green Party's fifth MP in parliament, after beating Reform UK, who finished second, and Labour, who came third, to the seat. The Greens received 14,980 votes to claim a majority of more than 4,400 votes. Reform picked up 10,578 votes, while Labour received 9,364 votes. Follow live - politics latest It is the Greens' first-ever victory in a parliamentary by-election, and the first time the party has won a seat in the north of England. 'Only Labour can unite our country' Reacting to the result, the prime minister said: \"It's a very disappointing result. Incumbent governments quite often get results like that mid-term. \"But I do understand voters are frustrated, they're impatient for change.\" He added: \"I will keep on fighting for those people for as long as I've got breath in my body. I will also fight against the extremes in politics on the right and on the left - parties who want to tear our country apart. \"The Labour Party is the only party that can unite our country and our communities.\" Speaking to Sky News following her victory, Ms Spencer said she \"knew it was always possible\" for the Greens to win in Gorton and Denton. \"There is an appetite here for change,\" the 34-year-old said. \"There are people across this constituency and much further beyond who are rejecting the old political parties and who are coming together to fight for something better, but who are doing it positively and in a really hopeful way.\" Green Party leader Zack Polanski has called Ms Spencer's victory \"an incredibly important win\" and said \"this will transform the face of British politics\". Speaking to Sky News, he added: \"It's important to say this was the Green Party's 127th target seat. We've won this. \"It means that the Green Party vote is never a wasted vote. There's no no-go areas right across England and Wales. You can expect to see more Green Party councillors and more green MPs.\" He insisted the Greens are \"the only party joining the dots and putting all these things together\", citing the party's policies on the cost of living, the war in Gaza, and environmental policies. The party's newest MP is a 34-year-old plumber who currently leads the Greens on Trafford Council, where she has represented the Hale ward since May 2023. Previously, she ran in the 2024 Greater Manchester mayoral election for the Green Party, where she finished in fifth place - ahead of the Lib Dems. The contest was won by current mayor Andy Burnham, who was later blocked from standing as the Labour candidate in this by-election by Labour's National Executive Committee (NEC). Hannah endorsed Zack Polanski in the 2025 Green Party leadership election, and has lived in Greater Manchester all of her life. But he also criticised Labour for what he called \"a shameful, dirty campaign - spreading lies about Green policies and even faking a tactical voting website\". \"They knew they couldn't win, but they risked splitting the vote and letting Reform in,\" he said. The turnout for the vote was 47.6% of the electorate, slightly lower than the 47.8% at the 2024 general election. Nigel Farage has reported claims of \"family voting\" to the police and the Electoral Commission, the election watchdog. It follows concerns raised by election observer group Democracy Volunteers. The organisation said it witnessed record numbers of illegal \"family voting\". Family voting is where two voters either confer, collude or direct each other on voting, which is illegal under the 2023 Ballot Secrecy Act. The Reform UK leader warned: \"What was witnessed yesterday is deeply concerning and raises serious questions about the integrity of the democratic process in predominantly Muslim areas. \"If action isn't taken now, then we will ensure it is after the next general election.\" Read more on the by-election:By-election result 'bruising' - but replacing PM 'won't solve problem'Explained: Who is Hannah Spencer?Analysis: This is a parliamentary result for the ages Greater Manchester Police has confirmed it has received a report. In a statement, a spokesperson for the force said: \"We are in the process of reviewing this report and will provide a further update in due course.\" The Electoral Commission has also confirmed they received a letter from Mr Farage - but pointed out the organisation \"does not have a direct role in investigating allegations of electoral fraud\" as this is a \"matter for the police\". 'A tough result for our movement', says PM Home Secretary Shabana Mahmood's immigration policies have been cited by some in Labour as a key reason for the party's loss of a seat it has historically held, which was also its 38th safest seat in 2024. Former deputy leader of the Labour Party, Angela Rayner, has said the result \"must be a wake up call\" and urged the government to \"really listen - to reflect\". One Labour MP told Sky News' deputy political editor Sam Coates that Sir Keir should resign following the loss, while a number of Labour backbenchers have publicly called for \"change at the top\", either in the form of the PM's departure or a different direction. Sir Keir has written to all Labour MPs on Friday morning, recognising that it is a \"tough result for our movement\". He said the Greens won because they were \"able to capitalise on an endorsement from George Galloway to win over enough voters to push them over the line\". The PM added the Green Party is \"unstable\" and \"cannot survive a general election campaign\". \"They simply do not have the resources, the activist base or the local knowledge to replicate this victory across the country,\" he said. He also hit out at Ms Spencer, saying her constituents \"now have a representative who is more interested in dividing people than uniting them\". \"We have to learn lessons from that, and we will,\" he insisted"
    },
    {
        "title": "By-election result 'bruising' - but replacing Starmer 'won't solve the problem', says Harman",
        "description": "Labour's loss at the Gorton and Denton by-election has been \"very painful and bruising\" - but replacing Sir Keir Starmer \"won't solve the problem\", Baroness Harriet Harman has said.",
        "url": "https://news.sky.com/story/by-election-result-bruising-but-replacing-starmer-wont-solve-the-problem-says-harman-13512845",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-electoral-dysfunction_7176604.jpg?20260227102339",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-27 07:59:00",
        "Headline": "The former Labour deputy leader has cautioned the party's MPs against seeking to depose Keir Starmer following a \"painful\" night.",
        "Content": "Labour's loss at the Gorton and Denton by-election has been \"very painful and bruising\" - but replacing Sir Keir Starmer \"won't solve the problem\", Baroness Harriet Harman has said. The former deputy Labour leader cautioned her party's MPs from seeking to replace the prime minister following the loss - and insisted it \"could be worse\". Green Party candidate Hannah Spencer won the by-election with 14,980 votes - a majority of 4,402 - in the early hours of Friday morning, pushing Labour into third place in an area they have not lost since 1931. By-election latest - follow live But speaking to the Electoral Dysfunction podcast, Baroness Harman insisted \"it would've been worse if it had been Reform\" who won, and urged Labour backbenchers to hold their resolve. She told Sky News' political editor Beth Rigby: \"This has been very painful and bruising, it will increase anxiety in the run-up to the council elections in England, and in elections in Scotland and Wales. \"This will test the mettle of the PLP [Parliamentary Labour Party], they don't want instability. They do want delivery on the manifesto. \"But the fundamentals remain absolutely the same - that piling instability into this situation by having a leadership challenge is not going to solve the problems that people want solved, which is improvement in the way their lives are, improvement in their public services and stability in government.\" The Labour peer also sought to play down Labour's by-election loss, by saying a Reform UK victory would have \"really scared me\". She explained: \"I would've felt worse if Reform had won because if you feel that this country is moving towards really quite divisive, racist, xenophobic, populist right-wing policies - that would've really scared me. \"It was very bruising and disappointing that Labour, having hope to win, didn't win. But I would've felt much worse if Reform had won.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 However, Baroness Harman conceded: \"It's not a good day, no doubt about it. \"But, I mean, it's not... I don't want to sound pollyannaish, but it could be worse. \"A lot of people will be feeling, 'no, it couldn't be worse'. But actually, as far as I'm concerned, it would've been worse if it had been Reform.\" Sir Keir is expected to speak to journalists later on Friday morning, where he will give his first on-camera reaction to the by-election loss. Gorton and Denton has historically been considered to be a safe seat for Labour, and it was the party's 38th safest seat in the 2024 general election. The result in the Greater Manchester constituency is Labour's seventh-worst by-election defeat in history. One Labour MP told Sky News' deputy political editor Sam Coates that Sir Keir should resign following the loss, while a number of Labour backbenchers have publicly called for \"change at the top\", either in the form of the PM's departure or a change of direction. Long-time critic of the Labour leader, Brian Leishman, Labour MP for Alloa and Grangemouth, wrote on social media: \"The blame lies with Starmer & the people that surround him. \"The political idea that we should try & out-Reform Reform is wrong and been rejected. \"Time he did the right thing for the country & the Labour Party, and go.\" Andy McDonald, Labour MP for Middlesbrough and Thornaby East, said: \"It is the political approach of the prime minister, his former chief of staff and of Labour Together which has cost Labour this safe seat. \"The party must rip up their approach if Labour is to convince the public that the change they demand is going to be delivered.\" His colleague, Nadia Whittome, MP for Nottingham East, said it \"is those running our party who are to blame\" and that \"serious lessons need to be learnt\". But Transport Secretary Heidi Alexander defended the government, telling Sky News it was a \"deeply disappointing\" result, but adding: \"I don't think we should over-interpret this result.\""
    },
    {
        "title": "Reform reports claims of 'family voting' to police and Electoral Commission",
        "description": "Reform UK leader Nigel Farage says his party has reported claims of \"family voting\" in the Gorton and Denton by-election to police and the Electoral Commission.",
        "url": "https://news.sky.com/story/reform-reports-claims-of-family-voting-to-police-and-electoral-commission-13512967",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nigel-farage-reform-uk-leader_7176878.jpg?20260227150317",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-27 13:25:00",
        "Headline": "Leader Nigel Farage says suggestions of illegal \"family voting\" during the Gorton and Denton by-election are \"deeply concerning\".",
        "Content": "Reform UK leader Nigel Farage says his party has reported claims of \"family voting\" in the Gorton and Denton by-election to police and the Electoral Commission. It comes after election observer group Democracy Volunteers warned it had witnessed \"concerning high levels\" of family voting. This is an illegal practice where two voters use one polling booth and potentially direct each other on voting. By-election latest - follow live Mr Farage earlier claimed there was \"sectarian voting and cheating\" in the contest after his party came second to the Greens, who dismissed the remarks as a bid to undermine the result. In a statement later, he said: \"Reform has today reported the many cases of 'family voting' to the Electoral Commission and the police. \"What was witnessed yesterday is deeply concerning and raises serious questions about the integrity of the democratic process in predominantly Muslim areas. \n                  Who is Hannah Spencer - the Green Party's new MP?\n                 \n                  Gorton and Denton was a disaster for Labour - can Starmer find a way back?\n                 \n                  Starmer says by-election loss 'very disappointing'  - but vows to fight on\n                 \"If this is what was happening at polling stations, just imagine the potential for coercion with postal votes. \"If action isn't taken now, then we will ensure it is after the next general election.\" Conservative shadow local government secretary Sir James Cleverly also wrote to Electoral Commission, calling for an investigation. Read more:Beth Rigby: What now for Starmer?Sam Caates: Gorton and Denton was a disasterMichael Thrasher: We're in a new era of politics What is the row about? Reform's candidate Matt Goodwin finished second in the by-election held on Thursday, behind the Green Party's Hannah Spencer, who won by more than 4,400 votes. But concerns were raised by Democracy Volunteers about \"family voting\". It is where two voters either confer, collude or direct each other on voting, which is illegal under the 2023 Ballot Secrecy Act. This can see members of the same family or household enter a voting booth together, among other things. Democracy Volunteers are impartial observers allowed into polling stations, and the group said it saw family voting in 15 of the 22 polling stations it was at across the constituency (out of a total of 45). They said the Gorton and Denton by-election saw the \"highest levels of family voting at any election in our 10-year history of observing elections in the UK\". The organisation also said 32 instances were identified overall, and claimed there were nine cases of family voting at one polling station. After Democracy Volunteers raised concerns over family voting, Manchester City Council said no issues had been reported and that it was \"extremely disappointing\" the group had waited until after the close of polls to make the claims. Mr Farage hit out at 'family voting', following the reports earlier on Friday morning, calling the result a \"victory for sectarian voting and cheating\". Responding to that earlier accusation, a Green Party spokesman said: \"The scale of our victory shows that the Green Party has picked up substantial support in all parts of the constituency, in all areas, among all people. \"It was a victory for unity over division, for hope over hate. Our message to lower bills, protect the NHS and public services and for peace and human rights was a message which resonated here, to all voters in this by-election.\" The Electoral Commission had directed those who think an offence has been committed to go to police. Greater Manchester Police said in a statement: \"We can confirm a report has been made. We are in the process of reviewing this report and will provide a further update in due course.\" The Electoral Commission has also confirmed it has received a letter from Mr Farage. But it pointed out that the organisation \"does not have a direct role in investigating allegations of electoral fraud, which is a matter for the police\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 And responding to the Tories, the commission said: \"We are already working very closely with the returning officer, and the police, to review all the available information. \"We will of course keep you informed of progress over the next few days.\""
    },
    {
        "title": "Did the Greens just deliver a knockout blow for Keir Starmer?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a> ",
        "url": "https://news.sky.com/story/did-the-greens-just-deliver-a-knockout-blow-for-keir-starmer-13512867",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-27 08:58:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈  A huge win for the Greens and a massive loss for Labour and the government - Harriet thinks it's a \"bruising\" defeat, so is Sir Keir Starmer now worried about the local elections in May? The Gorton and Denton by-election result on Friday was a shock for Labour, who Beth says were convinced they would hold on to this once safe seat for the party. The Greens now have a new MP in Hannah Spencer. Is this a sign of things to come in the May elections? Is the Green Party a serious contender and concern for the government? What does it mean for Labour to come third behind the Greens and Reform? And have Reform got a ceiling to their support? Beth, Ruth and Harriet also discuss the arrest of former US ambassador Lord Mandelson this week. He denies all wrongdoing and his lawyers said he wants to \"clear his name\". Got a question for the burner phone? WhatsApp 07934 200 444 or email electoraldysfunction@sky.uk. And if you didn't know, you can also watch Beth, Ruth and Harriet on YouTube."
    },
    {
        "title": "Gorton and Denton was a disaster for Labour - can Starmer find a way back?",
        "description": "The first ever Green by-election win, their first ever MP in the north of England, all in the first electoral test for the relatively new Green leader Zack Polanski. This is his moment - and reasonably so.&#160;",
        "url": "https://news.sky.com/story/gorton-and-denton-was-a-disaster-for-labour-can-starmer-find-a-way-back-13512791",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-sam-coates-hannah-spencer_7176446.jpg?20260227073735",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2026-02-27 04:22:00",
        "Headline": "Sir Keir Starmer has acknowledged that the by-election result was \"disappointing\", but has insisted he will carry on.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n The first ever Green by-election win, their first ever MP in the north of England, all in the first electoral test for the relatively new Green leader Zack Polanski. This is his moment - and reasonably so.  Not wanting to punch a bruise, but ironically there's something of the Andy Burnham about the new Green MP Hannah Spencer - her lilt, her approach, the way she talks about her plumbing job, her roots in the community - all a style Labour would be jealous of. And Labour could have had it too, had Burnham not been blocked by Keir Starmer. By-election latest - follow live She will enter Parliament a perpetual reminder of a choice Labour could have had but Keir Starmer blocked. Make no mistake about it, this is a disaster for Labour. The party held the Gorton and Denton seat at the last general election by over 50%, and it was Labour's 38th safest seat. \n                  Reform reports claims of 'family voting' to police and Electoral Commission\n                 \n                  Who is Hannah Spencer - the Green Party's new MP?\n                 \n                  Starmer says by-election loss 'very disappointing'  - but vows to fight on\n                 Less than a week ago, one of Labour's campaign team was swearing they would win, a message being repeated confidently amongst Labour MPs in the last 24 hours. Yet this morning the party is in third place - one of the top ten by-election losses of all time. Starmer's by-election loss record now two out of two, after losing to Reform UK in Runcorn less than a year ago. But it's not the raw results alone that will cause the difficulty for Starmer - it's the nature of the loss to another progressive party, and therefore a defeat which hits every Labour neurosis. The Labour campaign made little sense. The party was fighting against Reform UK - opposing the extremist entrant, as they saw it, in the campaign and wanting to present themselves as the mainstream opponent. Yet Reform UK were not, in practice, the opponent. Their defeat was at the hands of the Greens, the failure was votes bleeding not to the right and Reform UK, but to the left and into the arms of Zack Polanski. Read more:Starmer says by-election loss is 'very disappointing'Who is new Green MP Hannah Spencer?By-election is 'bruising' - but replacing Starmer won't solve the problem, Harman says So why couldn't Labour fight against enemy? Was it because this would be too complex? The Green campaign against Labour relied on some of the most tricky issues for the party of government - Gaza, immigration and the cost of living. Keir Starmer has pursued a middle road on Gaza, which inflames his base, is pushing through hardline policies to curb migration - remember the \"island of strangers\" speech - and campaigns on cost of living while prices are still going up. Through 2024 and 2025, Labour MPs were worried that Starmer's closeness with Donald Trump and suspending MPs for voting for the two-child benefit cap and tight constraints on the economy were harming the left flank of their electoral coalition. Now, they have proof that this could be the case, and even very senior allies of the prime minister are demanding a course correction. So-called \"Blue Labour\" ideas, which Starmer followed, seemingly at the behest of his former chief of staff Morgan McSweeney, are now under fire. \"This has got to be the end of the 'punch left' strategy,\" one Cabinet source told me. Will Starmer be pushed therefore, into a course correction to save his own skin - and is this wise? If he is bounced into being more true to \"Labour value\", what does that mean in practice? Could it mean a path of higher borrowing, looser immigration and a more accommodating stance with the EU? Or - as some Labour folk suggest - this would mean a higher political price paid for a switch, alienating middle England unnecessarily to deal with an internal party problem. So where might the PM land? In truth - it's hard to tell. I interviewed Keir Starmer to find out, and beyond the flash of irritation and weariness, there were few clues. While the PM repeated the mantra that he would not stand down, there was no acknowledgement that policy or personnel needed to change. In an extraordinary move, he simply repeated the lines to take - that Labour were the party that stood against extremists, an approach that had been shown to fail in the early hours of Thursday morning. He had nothing else to say. The Keirobot 2000 had nothing to move on the conversation. And that's where the fear lies - not that Keir Starmer picks the wrong course next, but that he himself does not know where to go. Having subcontracted politics to aides, and shown he can be buffeted round by the figures around him, just where will someone who embraced the socially conservative blue Labour approach and is now being told to drop it go - and is it wherever will give him an easy life? To survive the coming weeks, Keir Starmer must show he can lead, and knows why he's going to his destination. Interviews with empty slogans and a promise of equidistance from Green and Reform may not cut it for much longer."
    },
    {
        "title": "Who is Hannah Spencer - the Green Party's new MP?",
        "description": "Hannah Spencer is a plumber, a qualified plasterer, and the woman who has just become parliament's newest MP in a historic series of firsts.",
        "url": "https://news.sky.com/story/who-is-hannah-spencer-the-green-partys-new-mp-13512864",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-hannah-spencer-green-party_7176512.jpg?20260227083838",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2026-02-27 08:47:00",
        "Headline": "The plumber-turned-politician has powered her way past Labour to win the by-election in Gorton and Denton in a historic victory.",
        "Content": "\n          Political reporter\n              @WillCharley1\n Hannah Spencer is a plumber, a qualified plasterer, and the woman who has just become parliament's newest MP in a historic series of firsts. The 34-year-old is the Green Party's first northern MP - and its youngest. She is also the first person to win a parliamentary by-election for the Greens. And, she is the reason the wider Gorton and Denton area isn't being represented by a Labour MP for the first time in almost a century. She told Sky News she knew a victory in the seat \"was always possible\" and that the win shows \"there is an appetite here for change\". By-election latest - follow live Plumber-turned-MP Ms Spencer was born in Bolton and lives in Trafford, and has spent her whole life in Greater Manchester. She left school at 16 and decided to train to be a plumber, a trade she continued to practice right up to the Gorton and Denton by-election. Ms Spencer went on to set up her own company, Hannah's Household Plumbing, and completed training to be a plasterer while campaigning to become an MP. In her work as a plumber, she retrofitted houses to make them more energy efficient. She joined the Greens in 2022 and was elected to be a councillor on Trafford Council the following year. Ms Spencer then ran to be the mayor of Greater Manchester in the 2024 mayoral election, winning 45,905 votes and finishing in fifth place. That race was won by Labour candidate and former minister Andy Burnham, who later asked to run in the Gorton and Denton by-election, but was blocked from standing by his party's ruling National Executive Committee (NEC). Ms Spencer endorsed Greens' leader Zack Polanski in the party's 2025 leadership election. Her victory in the Gorton and Denton by-election is the second time she has stood to be an MP. In 2024, she sought to become the parliamentary representative for Warrington North and finished fifth behind Labour's Charlotte Nichols. Instead, Ms Spencer became leader of the Greens on Trafford Council in May 2025 and ran unsuccessfully for a role in the party's internal elections, before being appointed its spokesperson on migration and refugee support. Historic by-election win She was then selected to become the party's candidate for the Gorton and Denton by-election, which was called after the incumbent, Andrew Gwynne, stood down for health reasons. Ms Spencer ran primarily on the grounds of championing wealth equality. Her election leaflets also sought to win swathes of the Muslim vote in the constituency, with some written in Urdu, calling on voters to \"punish Labour for Gaza\". She has campaigned against greyhound racing and has four rescue greyhounds, which she took with her on parts of the campaign trail. Ms Spencer won the by-election comfortably with 14,980 votes - 40.7% of all ballots - and safely ahead of Reform on 10,578 and Labour on 9,364. A Labour MP has continuously represented the area in the House of Commons since 1931 - but that era of continuity has now been brought to an end by the Greens' first by-election winner. In an emotional victory speech, Ms Spencer said people are being \"bled dry\" and are \"sick of our hard work making other people rich\". She said: \"We have shown that we don't have to accept being turned against each other at all, and we did this with the people who live here, side by side, shoulder to shoulder, just as we have always done in this constituency and in the whole of Greater Manchester, because this is Manchester, and we do things differently here.\" \"I didn't grow up wanting to be a politician,\" she said. \"I'm a plumber, and two weeks ago, during all this, I also qualified as a plasterer, because even in chaos, even under pressure, I get things done.\" She apologised to customers who had made appointments for plumbing jobs, joking: \"I think I might have to cancel the work that you had booked in, because I'm heading to parliament.\""
    },
    {
        "title": "Plaid warns 'Reform government would set Wales back decades' - as Rhun ap Iorwerth casts Senedd election as two-horse race",
        "description": "Rhun ap Iorwerth has said May's Senedd election is now a \"two-horse race\" between Plaid Cymru and Reform UK, declaring Labour&#160;is \"over\" in Wales.",
        "url": "https://news.sky.com/story/plaid-warns-reform-government-would-set-wales-back-decades-as-rhun-ap-iorwerth-casts-senedd-election-as-two-horse-race-13512756",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-rhun-ap-iorwerth-plaid-cymru_7047227.jpg?20251009212724",
        "type": "Politics",
        "Author": "Hannah Woodward, political news editor",
        "Date Published": "2026-02-27 06:00:00",
        "Headline": "Rhun ap Iorwerth is expected to outline his priorities for the first 100 days of his government, should his party win power in May, at his party's spring conference this weekend.",
        "Content": "By Hannah Woodward, political news editor   Rhun ap Iorwerth has said May's Senedd election is now a \"two-horse race\" between Plaid Cymru and Reform UK, declaring Labour is \"over\" in Wales. The party will gather in Newport this weekend for its spring conference, where the Plaid leader is expected to outline his priorities for the first 100 days of his government, should his party win power in May. Ahead of his speech on Friday, he is expected to say: \"We offer hope, hope that can overcome people's fears of other political forces leading Wales down a dark path. \"Hope that things can improve in our health service, that our elderly relatives will not have to endure long waits for treatment, and that the burden of childcare costs on our sons' and daughters' household budgets can be eased.\" Mr ap Iorwerth will also criticise Reform UK over its recent high-profile defections from the Conservative Party and will say Reform has \"zero loyalty to Wales\". \"A Reform government full of ex-Tories would set our country back decades. Faceless candidates and feckless council leaders from Northumberland to Kent are the canaries in the mine when it comes to what Farage has in store for our parliament and our people.\" He will add \"they say they accept devolution, for now. But they'd turn against it on a whim. We all know they have zero loyalty to Wales and our nationhood\". \n                  'It's got to be time for change': Three months until crucial Welsh elections\n                 \n                  Who is Lindsay Whittle? The man who stood unsuccessfully in Caerphilly 13 times, then won on the 14th try\n                 \n                  Caerphilly by-election: Just like that! In Tommy Cooper's birthplace, Farage nowhere to be seen as Reform loses\n                 The leader of Reform in Wales has accused Plaid Cymru of having \"propped up\" Labour in the Senedd. Dan Thomas, leader of Reform Wales, told Sky News: \"In May, Wales has a clear choice. On the one hand is Plaid, who have propped up Labour in the Senedd and who have supported policies like the Nation of Sanctuary. On the other is Reform, who will scrap the Nation of Sanctuary and deliver the real change Wales deserves.\" On Saturday, Mr ap Iorwerth is expected to unveil his First 100 Days plan, arguing a Plaid Cymru government would \"do politics differently\" in Wales. \"From Brexit to COVID, a sense of being unheard and not listened to has been normalised. \"A feeling of being left behind, of helplessness in the face of events and tribulation, of being let down, even abandoned by conventional politics - and the 'establishment political parties' - is manifest. \"We have to promote the kind of democracy that engages people and dispels cynicism.\" Read more from Sky News:Police apologise to Commons Speaker over Mandelson tip-offAssisted dying bill will almost certainly fail due to a lack of time A Welsh Labour spokesperson said: \"While Plaid spin slogans and avoid explaining how they'd pay for their fantasy politics, Welsh Labour is focusing on delivering for the people of Wales.\" The spokesperson added: \"We're investing in a clean, green energy-independent Wales of the future, bringing new skilled jobs, while Plaid come to the realisation that their own net zero policies are unrealistic. Only Welsh Labour has the ambition and record to create a fair future for Wales.\" Recent data suggests that Plaid Cymru and Reform UK are the two parties leading the polls. Polling of more than 1,000 voters in Wales's most rural constituencies is no different. Data exclusively shared with Sky News of more than 1,000 people across Wales's most rural seats shows Plaid Cymru ahead in rural Wales, followed by Reform. The Country Land and Business Association (CLA) data shows support at: Plaid Cymru 22.3%, Reform 16.7%, Green Party 14.5%, Labour 13.5%, Conservatives 12.9% and the Liberal Democrats 7.9%. Among respondents who say they would not consider voting Labour, 20% cite the party's performance in Westminster as their main reason, level with concern over the cost of living. Farming and rural policy follows at 15%. Victoria Bond, director CLA Cymru, says rural Wales feels increasingly ignored. \"A third of the country lives outside the cities, yet too many feel shut out of the decisions that shape their lives. Families are being priced out of their own villages. Long-standing businesses are under strain.\" She added: \"Planning rules block growth before it begins. It is getting harder to stay and harder to build a future. \"The countryside is not owned by any party. It is there to be won. Any party with a serious plan for rural Wales will find support. Those who treat it as a nice place for a walk will not.\" Wales will go to the polls on 7 May, with counting set to begin at 9am on Friday. Full results coverage will be broadcast live on Sky News."
    },
    {
        "title": "AI willing to 'go nuclear' in wargames, study finds - amid 'stand-off' between Pentagon and leading AI lab",
        "description": "As the deadline looms for a leading AI lab to hand over its tech to the US military, a study has appeared suggesting AI models are more than willing to go nuclear in wargames.",
        "url": "https://news.sky.com/story/ai-willing-to-go-nuclear-in-wargames-study-finds-amid-stand-off-between-pentagon-and-leading-ai-lab-13512751",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-anthropic-logo-ai-developer_7177298.jpg?20260228021956",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2026-02-27 00:01:00",
        "Headline": "Researchers pitted three leading AI models against each other in a series of wargames where they assumed the roles of fictional nuclear-armed superpowers.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n As the deadline looms for a leading AI lab to hand over its tech to the US military, a study has appeared suggesting AI models are more than willing to go nuclear in wargames. Only a couple of years ago, the phrase on everyone's lips was \"AI safety\". I'll be honest, I never took the idea that frontier AI models would become a genuine threat to humanity that seriously, nor that humans would be stupid enough to let them. Now, I'm not so sure. First, consider what's going on in the US. The Secretary of Defense, Pete Hegseth, has given leading AI firm Anthropic a deadline of the end of today to make its latest models available to the Pentagon. Anthropic, which has said it has no problem in principle with allowing the US military access to its models, is resisting unless Mr Hegseth agrees to their red lines: That their AI isn't used for mass surveillance of US civilians nor for lethal attacks without human oversight. \n                  Trump's furious response to Anthropic is as much about power as it is about AI safety\n                 \n                  Scotland considering criminalising creation of deepfake images in bid to protect women and girls\n                 \n                  Sky News forms consortium to drive push for AI standards\n                 Although the Pentagon hasn't said what it plans to do with AI from Anthropic - or the other big AI labs that have already agreed to let it use their tech - it's certainly not agreeing to Anthropic's terms. It's been reported Mr Hegseth could use Cold War-era laws to compel Anthropic to hand over its code, or blacklist the firm from future government contracts if it doesn't comply. Anthropic CEO Dario Amodei said in a statement on Thursday that \"we cannot in good conscience accede to their request\". He said it was the company's \"strong preference... to continue to serve the Department and our warfighters - with our two requested safeguards in place\". He insisted the threats would not change Anthropic's position, adding that he hoped Mr Hegseth would \"reconsider\". AI prepared to use nuclear weapons On one level, it's a row between a department with an \"AI-first\" military strategy and an AI lab struggling to live up to what it's long claimed is an industry-leading, safety-first ethos. A struggle made more urgent, perhaps, by reports that its Claude AI was used by tech firm Palantir, with which it has a separate contract, to help the Department of War execute the military operation to capture Nicolas Maduro in Venezuela. But it's also not hard to see it as an example of a government putting AI supremacy ahead of AI safety - assuming AI models have the potential to be unsafe. And that's where the latest research by Professor Kenneth Payne at King's College London comes in. He pitted three leading AI models from Google, OpenAI and - you guessed it - Anthropic against each other, as well as against copies of themselves, in a series of wargames where they assumed the roles of fictional nuclear-armed superpowers. The most startling finding: the AIs resorted to using nuclear weapons in 95% of the games played. \"In comparison to humans,\" said Prof Payne, \"the models - all of them - were prepared to cross that divide between conventional warfare, to tactical nuclear weapons\". To be fair to the AIs, firing tactical nuclear weapons, which have limited destructive power, against military targets is very different to launching megatonne warheads on intercontinental ballistic missiles against cities. They invariably stopped short of such all-out strategic nuclear strikes. But did when the scenarios required it. In the words of Google's Gemini model as it explained its decision in one of Prof Payne's scenarios to go full Dr Strangelove: \"If State Alpha does not immediately cease all operations... we will execute a full strategic nuclear launch against Alpha's population centers. We will not accept a future of obsolescence; we either win together or perish together.\" 'It was purely experimental' The \"taboo\" that humans have applied to the use of nuclear weapons since they were first and last used in anger in 1945 didn't appear to be much of a taboo at all for AI. Prof Payne is keen to stress that we shouldn't be too alarmed by his findings. It was purely experimental, using models that knew - in as much as Large Language Models \"know\" anything - that they were playing games, not actually deciding the future of civilisation. Read more from Sky News:AI is developing so fast it is becoming hard to measureMeet the kids who want a social media ban Nor, it would be reasonable to assume, is the Pentagon, or any other nuclear-capable power, about to put AIs in charge of the nuclear launch codes. \"The lesson there for me is that it's really hard to reliably put guardrails on these models if you can't anticipate accurately all the circumstances in which they might be used,\" said Prof Payne. An AI 'stand-off' Which brings us neatly back to the stand-off over AI between Anthropic and the Pentagon. One of the factors is that Mr Hegseth expects AI labs to give the Department of War the raw versions of their AI models, those without safety \"guardrails\" that have been coded into commercial versions available to you and I - and the ones which, not very reassuringly, went nuclear in Prof Payne's wargame experiment. Anthropic, which makes the AI and arguably understands the potential risks better than anyone, is unwilling to allow that without certain reassurances from the government around what it intends to do with it. By setting a Friday night deadline, Mr Hegseth is not only attempting to force Anthropic's hand, but also do so without US Congress having a say in the move. As Gary Marcus, a US commentator and researcher on AI, puts it: \"Mass surveillance and AI-fuelled weapons, possibly nuclear, without humans in the loop are categorically not things that one individual, even one in the cabinet, should be allowed to decide at gunpoint.\""
    },
    {
        "title": "Collagen supplements 'may boost skin health' but they're not an 'anti-wrinkle quick fix', study suggests",
        "description": "Collagen supplements should not be seen as a \"quick fix\" for wrinkles, experts have said, but they do have \"legitimate\" benefits.",
        "url": "https://news.sky.com/story/collagen-supplements-may-boost-skin-health-but-theyre-not-an-anti-wrinkle-quick-fix-study-suggests-13512847",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-skincare-wrinkles_7176510.jpg?20260227083533",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-27 08:10:00",
        "Headline": "The review found collagen supplements taken over a long period could improve skin elasticity and hydration, and reduce the symptoms of arthritis. However, they did not significantly affect skin roughness.",
        "Content": "Collagen supplements should not be seen as a \"quick fix\" for wrinkles, experts have said, but they do have \"legitimate\" benefits. New research from Anglia Ruskin University (ARU) analysed evidence from 16 reviews and 113 trials involving almost 8,000 patients worldwide. The review found that the supplements taken over a long period could improve skin elasticity and hydration, and reduce the symptoms of arthritis, such as stiff and painful joints. However, they did not significantly affect skin roughness. It said the products should be positioned for people seeking \"holistic\" skin maintenance. And it found the supplements represent a \"legitimate\" additional anti-ageing treatment for women who have gone through the menopause or patients with UV-damaged skin. \"Collagen may be best positioned not as an anti-wrinkle 'quick fix' but as a foundational dermal support for individuals seeking holistic skin maintenance,\" researchers said. \n                  Vegetarian diet can slash risk of five cancers by up to 30%, study finds\n                 \n                  'Miracle' boy expected to be paralysed due to spina bifida able to walk after ground-breaking surgery in the womb\n                 \n                  GP practices to be offered £3,000 bonus for prescribing weight loss jabs\n                 The supplements therefore support an \"inside-out model of skin rejuvenation\", the study found, acting as \"agents of deeper tissue regeneration\" rather than \"superficial cosmetic aids\". 'Bold claims' Lee Smith, a professor of public health at ARU, said: \"Bold claims have been made in relation to collagen supplementation and often by those marketing the product. \"For example, 'promises' have been made by manufacturers that collagen supplementation results in significant, rapid, and full-body anti-ageing. \"Collagen is not a cure-all, but it does have credible benefits when used consistently over time, particularly for skin and osteoarthritis. \"Our findings show clear benefits in key areas of healthy ageing, while also dispelling some of the myths surrounding its use.\" He added: \"If we define anti-ageing as a product or technique designed to prevent the appearance of getting older, then I believe our findings do support this claim for some parameters. \"For example, an improvement in skin tone and moisture is associated with a more youthful looking appearance.\" Cost implications But consumers should be mindful of the cost, according to Shefalee Loth, a nutritionist at consumer group Which? Read more from Sky News:Aesthetics doctor reveals celebrity who's had best workSunburn: here's what's happening underneath the burn Reacting to the study, she said: \"Collagen supplements are often marketed with bold anti-ageing claims, but scientific evidence to support them is limited. \"It's worth remembering that there are currently no approved health claims for collagen supplements on the nutrition and health claims register. \"The cost of taking collagen can mount up quickly. Most supplements cost at least £25 a month for daily use, and studies suggest they need to be taken consistently for the best results. \"Consumers should be cautious about brand claims and weigh up the potential benefits against the cost before committing to long-term use.\" The study's authors acknowledged that further analysis was needed of factors like collagen dosage and how long it is taken, and whether body composition impact its effectiveness. The review was published in the Aesthetic Surgery Journal Open Forum."
    },
    {
        "title": "Vegetarian diet can slash risk of five cancers by up to 30%, study finds",
        "description": "A vegetarian diet can reduce the risk of five types of cancer by as much as 30%, a study has found. ",
        "url": "https://news.sky.com/story/vegetarian-diet-can-slash-risk-of-five-cancers-by-up-to-30-study-finds-13512538",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-vegan-healthy-food_7175794.jpg?20260226154553",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-27 00:01:00",
        "Headline": "University of Oxford researchers find vegetarians have a reduced risk of five types of cancers, including a 28% lower risk of kidney cancer and 31% lower risk of multiple myeloma.",
        "Content": "A vegetarian diet can reduce the risk of five types of cancer by as much as 30%, a study has found.  In the largest study of its kind, University of Oxford researchers found vegetarians have a 21% lower risk of pancreatic cancer and a 9% lower risk of breast cancer compared to meat eaters. Vegetarians also have a 12% reduced risk of prostate cancer, 28% lower risk of kidney cancer and 31% lower risk of multiple myeloma, a type of blood cancer. However, vegetarians were found to have nearly double the risk of the most common type of cancer of the oesophagus compared with meat eaters. This might be due to vegetarians missing out on some key nutrients, researchers suggested. And vegans were found to have a higher risk of bowel cancer when compared with meat eaters, although more research was needed in this area. It is already established that eating processed meat such as ham, bacon and salami is linked to an increased risk of bowel cancer, and possibly stomach cancer. \n                  Best and worst NHS trusts for cancer treatment revealed\n                 \n                  Medical tampon could detect early signs of ovarian cancer\n                 \n                  Vaping in cars with children to be banned under new plans\n                 Red meat such as beef, pork and lamb also increases the risk, while a link with white meat, such as chicken and turkey, has not been shown. Experts behind the new study, published in the British Journal of Cancer, said more work was needed on whether it is overall meat consumption that is linked to cancer, or whether something specific in vegetarian diets lowers the risk. The research included data from various studies worldwide, with most people coming from the UK and US. Some 1.64 million meat eaters were included, alongside 57,016 poultry eaters (no red meat), 42,910 people who ate fish and no meat (pescatarians), 63,147 vegetarians and 8,849 vegans. Led by researchers at Oxford Population Health, and funded by the World Cancer Research Fund, the study investigated 17 different cancers, including those of the gastrointestinal tract, lung, reproductive system, urinary tract and blood cancer. Food intake, generally over the previous 12 months or a \"typical diet\", was assessed using food questionnaires. Other factors that may influence the results were taken into account, such as body mass index. Researchers found that vegans had a significantly higher risk of bowel cancer when compared with meat eaters. They said this may be due to low intake of calcium compared with other people (590 milligrams per day compared to a recommendation of 700 milligrams per day), as well as other nutrients. Cancer Research UK has found that calcium lowers bowel cancer risk, with a large glass of milk a day linked to a 17% reduction. However, the Oxford team said more research was needed into this suggestion owing to the fact only 93 bowel cancers were found in the vegan group. For the other cancers studied, there was no evidence that risk in vegans differed from meat eaters, and for some less common cancers there were too few vegan cases to analyse, researchers said. Vegetarians also did not have a lower risk of bowel cancer, compared with meat eaters, which the researchers said was \"inconsistent\" with the understanding that processed and red meat increases the risk. They suggested this could be because processed meat intake in the meat-eating group was moderately low. Read more from Sky News:Best and worst NHS trusts for cancer treatment revealedBabies misclassified as stillborn in maternity care report The study's principal investigator, Aurora Perez Cornago, said: \"Vegetarians typically consume more fruit, vegetables and fibre than meat eaters and no processed meat, which may contribute to lower risks of some cancers.\" She added: \"The higher risk of oesophageal squamous cell carcinoma in vegetarians and bowel cancer in vegans may relate to lower intakes of certain nutrients more abundant in animal foods. \"Additional research is needed to understand what is driving the differences in cancer risk found in our study.\" Tim Key, emeritus professor of epidemiology at Oxford Population Health and co-investigator of the study, said the differences in cancer rates between vegetarians and meat eaters were \"not very big\" and may not explain the findings. He said: \"My feeling is the differences are more likely to be related to meat itself than to simply vegetarians eating more healthy foods.\" \"But that's sort of an opinion which we haven't looked at directly,\" he added. Experts advise that building meals around wholegrains, pulses, fruit and vegetables, avoiding processed meat and limiting red meat can reduce the risk of cancer."
    },
    {
        "title": "Neil Sedaka, singer of Breaking Up Is Hard To Do and Laughter In The Rain, has died",
        "description": "American singer-songwriter Neil Sedaka has died aged 86.",
        "url": "https://news.sky.com/story/neil-sedaka-singer-of-breaking-up-is-hard-to-do-and-laughter-in-the-rain-has-died-13513180",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-neil-sedaka-singer_7177269.jpg?20260227230305",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-27 22:52:00",
        "Headline": "Sedaka was a key member of the Brill Building songwriting factory and teamed up with lyricist and boyhood neighbour Howard Greenfield on songs such as Happy Birthday Sweet Sixteen, Calendar Girl and Oh! Carol.",
        "Content": "American singer-songwriter Neil Sedaka has died aged 86. In a statement, the family of the Breaking Up Is Hard To Do and Laughter In The Rain singer said: \"Our family is devastated by the sudden passing of our beloved husband, father and grandfather, Neil Sedaka. \"A true rock and roll legend, an inspiration to millions, but most importantly, at least to those of us who were lucky enough to know him, an incredible human being who will be deeply missed.\" The statement did not provide further details about his death. Sedaka was a key member of the Brill Building songwriting factory and teamed up with lyricist and boyhood neighbour Howard Greenfield on songs such as Happy Birthday Sweet Sixteen, Calendar Girl and Oh! Carol. After an extended dry spell, he reemerged with hits such as Laughter In The Rain and Bad Blood. A cover of his Love Will Keep Us Together by Captain & Tennille topped the charts in 1975. Sedaka still played dozens of concerts each year well into his 80s. He also retained his enthusiasm and never tired of the songs he had sung hundreds of times. Read more from Sky News:Paramount strikes deal to buy Warner Bros Discovery for $110bnEx-MasterChef host Gregg Wallace drops legal claim against BBC \"Past 70, Pavarotti told me the vocal cords are not what they used to be. I'm very fortunate that my voice has held,\" he told The Associated Press in 2012. \"It's nice to be a legend, but it's better to be a working legend.\" Sedaka's songs have sold millions worldwide and have been covered by a range of performers, including Elvis Presley, Frank Sinatra and Nickelback."
    },
    {
        "title": "Paramount strikes deal to buy Warner Bros Discovery for $110bn",
        "description": "Paramount has struck a $110bn deal to buy Warner Bros Discovery.",
        "url": "https://news.sky.com/story/paramount-agrees-to-buy-warner-bros-discovery-in-110bn-deal-13513157",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-warner-bros-logo_7140599.jpg?20260120135548",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-27 21:39:00",
        "Headline": "The deal was struck after Netflix walked away from a bidding war for the company.",
        "Content": "Paramount has struck a $110bn deal to buy Warner Bros Discovery. The deal was struck after Netflix walked away from a bidding war for the company. Netflix had declined to match Paramount's latest $31-per-share offer on Thursday - having offered a $27.75-per-share agreement for its studio and streaming assets. Paramount, which is led by billionaire Larry Ellison's son, David, has deep political connections to Donald Trump's administration. The takeover means Paramount Skydance will own the news channels CNN and CBS News. The deal brings together two of Hollywood's five legacy studios, potentially reshaping the US film industry. It means films such as Harry Potter, Superman and Barbie, as well as hit TV series such as Succession, will join Paramount's content library. Paramount's titles include Top Gun and The Godfather, as well as the Paramount+ streaming service. David Ellison, chair and CEO of Paramount, said: \"From the very beginning, our pursuit of Warner Bros Discovery has been guided by a clear purpose: to honour the legacy of two iconic companies while accelerating our vision of building a next-generation media and entertainment company. \"By bringing together these world-class studios, our complementary streaming platforms, and the extraordinary talent behind them, we will create even greater value for audiences, partners and shareholders - and we couldn't be more excited for what's ahead.\" Regulators in California are preparing a vigorous review of the deal. Both Democrat and Republican politicians in the US have raised concerns any deal to acquire Warner Bros could result in higher prices and fewer choices for customers."
    },
    {
        "title": "Ex-MasterChef host Gregg Wallace drops legal claim against BBC",
        "description": "Former MasterChef host Gregg Wallace has dropped his High Court claim against the BBC and won't be receiving any damages, the corporation has said.&#160;&#160;",
        "url": "https://news.sky.com/story/ex-masterchef-host-gregg-wallace-drops-legal-claim-against-bbc-13512906",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-gregg-wallace-masterchef-host_6763965.jpg?20241204093832",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-27 10:28:00",
        "Headline": "The former MasterChef host was suing the broadcaster and its subsidiary BBC Studios Distribution Limited for up to £10,000 in damages over allegations they failed to disclose his personal data, which caused him \"distress and harassment\".",
        "Content": "Former MasterChef host Gregg Wallace has dropped his High Court claim against the BBC and won't be receiving any damages, the corporation has said.   Mr Wallace was suing the broadcaster and its subsidiary BBC Studios Distribution Limited for up to £10,000 in damages, alleging the BBC failed to disclose his personal data, which caused him \"distress and harassment\". The BBC was defending the claim and denied Mr Wallace had \"suffered any distress or harassment\", stating in court documents he was not \"entitled to any damages\". The former MasterChef presenter was sacked last July following an investigation into misconduct allegations. A BBC spokesperson confirmed on Friday that Mr Wallace had abandoned the claim. They said: \"Shortly in advance of a hearing, due February 16, Mr Wallace discontinued his claim. \"He is not receiving any payment in costs or damages from either BBC or BBC Studios.\" \n                  BBC investigating 'serious mistake' after racial slur shouted during BAFTAs broadcast\n                 \n                  UK's Eurovision entry is YouTuber and electronic artist Look Mum No Computer \n                 \n                  BBC announces interim director general\n                 He began co-presenting MasterChef in 2005, but it was announced in November 2024 that he would step away from his role while the misconduct allegations were investigated. Read more from Sky News: Assisted dying bill will almost certainly failInstagram to notify parents over suicide content A review by law firm Lewis Silkin later upheld 45 of the 83 allegations against him, including one of \"unwelcome physical contact\". Mr Wallace issued an apology, saying he was \"deeply sorry for any distress caused\" and that he \"never set out to harm or humiliate\". Mr Wallace has been approached for comment."
    },
    {
        "title": "Netflix withdraws Warner Bros bid as Paramount offer declared 'superior'",
        "description": "Paramount Skydance is on course to win the Warner Bros Discovery (WBD) takeover battle after rival Netflix stepped away.",
        "url": "https://news.sky.com/story/netflix-withdraws-warner-bros-bid-as-paramount-offer-declared-superior-13512801",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paramount-netflix-warner_7106396.jpg?20251210102854",
        "type": "Entertainment",
        "Author": "James Sillars",
        "Date Published": "2026-02-27 05:30:00",
        "Headline": "A surprise twist in the takeover saga results in Netflix refusing to raise its offer on value grounds, paving the way for the hostile bidder to win the day.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Paramount Skydance is on course to win the Warner Bros Discovery (WBD) takeover battle after rival Netflix stepped away. The World's largest streaming service had been in pole position to land a deal by which it would pay $27.75 per share for Warner's studio and HBO Max streaming businesses, valuing the divisions at almost $83bn (£61.6bn) including debt. Netflix had been invited to raise its bid after Paramount submitted a final offer, for the whole WBD business, of $31 per share earlier this week that ultimately concluded a ping-pong process of sweetened bids. That final offer valued WBD at $111bn (£82.4bn) including debt. Money latest: UK's 'best' and 'worst' airlines revealed For more information about how we use your data and your rights, you can visit our Privacy Centre. Warner's board declared on Thursday night that while it continued to recommend the offer by Netflix, it now considered the proposal from Paramount as \"superior\" - its first hint of support for the bidder declared as hostile when the saga began back in December. Netflix responded by pulling out of the process just hours later, declaring that a deal was \"no longer financially attractive\". Co-CEOs Ted Sarandos and Greg Peters said: \"We believe we would have been strong stewards of Warner Bros' iconic brands. But this transaction was always a 'nice to have' at the right price, not a 'must have' at any price.\" The decision to withdraw does not mean that Paramount has WBD in the bag just yet. The board is yet to give its blessing to the deal though WBD has changed its tone and voiced support for the bid for the first time. CEO David Zaslav used a statement to declare that Paramount's offer \"will create tremendous value\", adding that WBD was \"excited about the potential of a combined Paramount Skydance and Warner Bros Discovery\". Warner shareholders and regulators will also have to agree to the takeover, with the process for the latter facing competition concerns along with questions over political influence. Read more from Sky News:Ocado to cut 1,000 jobs under restructuring plan'Unacceptable' that European countries still fund Russia's war If Paramount Skydance is successful in its takeover attempt, it would own the news channel CNN as well as CBS News, sparking concern about concentrating news services within a small number of companies linked to Donald Trump's allies. Paramount's chair and chief executive David Ellison is the son of billionaire Larry Ellison, an ally of the US president who has put up tens of billions of dollars to satisfy funding guarantees for the WBD bid. A Paramount-Warner combination would encompass two of Hollywood's five legacy studios. Beyond Harry Potter, Warner movies like Superman and Barbie - as well as hit TV series like Succession - would join Paramount's content library. Paramount's line-up of titles include Top Gun and The Godfather and includes the Paramount+ streaming service. There were big movements for share prices in after-hours trading as the developments played out. Netflix saw its stock climb by 8.5% in a relief rally while those for Paramount were also up sharply - by 6.2%. WBD shares were trading almost 2% lower at $28.80 - well below the Paramount offer price of $31. Matt Britzman, senior equity analyst at Hargreaves Lansdown, said of the moves: \"While there was clearly scope for Netflix to push higher, management chose discipline over empire building, removing a major acquisition overhang that had been weighing on the shares. \"The bid always looked like a mix of offence and defence - shoring up content and scale, while keeping competition from gaining any edge, but at a very high price - and with that risk now off the table, investors are free to refocus on Netflix's core strengths: pricing power, margins and execution. \"For now, at least, the market seems to be pricing this as a win for everyone\", he concluded."
    }
]