[
    {
        "title": "Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear",
        "description": "An emergency news conference in the Downing Street briefing room and the prime minister the gravest I've seen.",
        "url": "https://news.sky.com/story/a-grave-pm-sets-out-scale-of-greenland-crisis-13496387",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7140148.jpg?20260120012744",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-19 20:42:00",
        "Headline": "Sir Keir Starmer left us in no doubt that we are facing the most serious crisis in the transatlantic relationship in decades, with huge uncertainty about what comes next.",
        "Content": "\n          Political editor\n              @BethRigby\n An emergency news conference in the Downing Street briefing room and the prime minister the gravest I've seen. He came to level with the public about the predicament we are in, and the consequences for us all should President Donald Trump follow through on his threat to slap tariffs on the UK and take control of Greenland. He left the audience in no doubt that we are facing the most serious crisis in the transatlantic relationship in decades, with huge uncertainty about what comes next. Sir Keir Starmer was the most forthright I have seen him as he broke with President Trump, strongly criticising tariffs and insisting that on the matter of Greenland, the UK would not bend, whatever the consequences as he reminded the US that alliances were built on partnership, \"not pressure\". But the prime minister also used this moment to try to de-escalate, as he stressed the importance of the US-UK relationship and dodged the matter of retaliatory tariffs in an effort to avoid any further poking of the bear. It doesn't, by the way, mean the UK has ruled this option out - rather it is not a preferred solution and London would rather talk about other options. But the UK pointedly chose at this moment not to follow the EU by raising the prospect of retaliatory tariffs. That EU package, I'm told, could be released on Thursday. Transatlantic relations between the US and Europe are facing an unprecedented challenge due to Donald Trump's desire to annex Greenland. The arctic island is part of Denmark, a NATO ally with which the US has a defensive pact, but that hasn't dissuaded Trump. Warning against the influence of Russia and China, he claims he needs the territory for security reasons. And he hasn’t ruled out seizing it by force; offering a guarded “no comment” when asked by our US partner network NBC News. In a bid to allay the president’s fears, several European nations contributed troops to a reconnaissance mission in Greenland. But Trump said they were deployed “for purposes unknown” and seemed to interpret their presence as a message to the US. So he sent a message back – threatening to slap eight European countries with 10% tariffs from 1 February, raising to 25% from 1 June, unless the US is allowed to buy the territory. Sky understands that Trump has conceded, in a phone call with Sir Keir Starmer, that he may have misinterpreted the reason for the troops’ deployment in Greenland. But he has doubled down on the threatened tariffs – which the prime minister says are “completely wrong” – telling NBC he “100%” intends to impose them. The economic impact is already being felt in stock markets of the nations involved. Read more:Trump's extraordinary letter to NorwayWill EU unleash its most powerful trade weapon? As I understand it, the prime minister is also \"very unlikely\" to attend Davos this week, given that there is no big set pieces on multilateral issues - be that Ukraine or Greenland, for now, that are likely to be resolved. Instead, Keir Starmer will press on with his preferred method - talking intensely behind closed doors while saying as little as possible in public. Danish minister reveals depth of rift But if the prime minister doesn't want to reveal what is being said in private, the gravity of this rupture in the transatlantic alliance was laid bare by the Danish foreign minister and former prime minister, Lars Rasmussen - in London for talks with the foreign secretary - as he recounted the meeting he'd had with Vice President JD Vance and Secretary of State Marco Rubio in Washington last week. \"The meeting we had last week left me with the clear impression that the president, honestly and full-heartedly, wants to acquire Greenland. But we also made it crystal clear that this is a red line,\" he told me in an interview after his meeting with Yvette Cooper. \"We agreed to disagree. The concerns raised at the meeting and also in public, about security in the Arctic - [Trump's] concerns - we want to accommodate. Therefore, we agreed that we should move this dialogue from social media and Truth Social and other arenas into a meeting room where we could discuss whether there could be a solution building on what we already have agreed in the past.\" Up for discussion was the US massively increasing its presence in Greenland, and the stepping up of NATO on the island, as well as guarantees stopping any presence of China in Greenland stretching out for 10, 20 or 30 years. \"I thought, we have managed not to solve the problem, but to find a pathway forward. It was disrupted by the statement from the president. And that's a reality of life,\" said Mr Rasmussen, as he spoke of his appreciation of the UK and other allies coming to stand by the Danes' side. Bur what it also reveals is the depth of this transatlantic rift over Greenland. Hours after the prime minister suggested he didn't think President Trump would send in troops to Greenland and called on the US to resolve these differences through dialogue, the US president told reporters he would impose 10% tariffs on the UK and other European countries that had sent troops to Greenland for a NATO exercise last week, and refused to rule out military force. Europe's last hope to rein in Trump? That we are in this situation a year into the Trump presidency is shocking and bewildering. For decades, the transatlantic alliance has framed our world order. Now that is being undone as President Trump exercises the law of power rather than working in the rule of law that has governed international relations since the Second World War. Escalation in Greenland would rupture the NATO alliance should the leading member move directly into conflict with another partner, the Danes, who stood with the US after 9/11, suffering similar amounts of casualties to the US in Afghanistan. It would trigger a trade war that would do all of us harm. It could result in the US withdrawing from Ukraine and embolden a Russian aggressor on the edge of Europe. The consequences are as unimaginable as they are serious. But ultimately, President Trump knows he has the economic and military power to face down Europe, and it will take more than European diplomacy to persuade him to back down. With the US president due at the annual World Economic Forum summit in Davos on Wednesday, huge attention will be paid to what he has to say in Switzerland - but it will be back in Washington where the difference might be made, as Mr Trump draws fire back home from Republicans in Congress. If the Europeans can't rein him in, will his domestic lawmakers? Republican House Speaker Mike Johnson met with Sir Keir in London on Monday, with the prime minister reiterating his position on Greenland and tariffs. The best hope the Europeans have is to persuade Congress to act. The transatlantic relationship is, after all, bigger and more enduring than one man."
    },
    {
        "title": "What it's like to live next to a 25,000-tonne illegal waste dump - with rats everywhere",
        "description": "A mother has told Sky News how her home has become a \"prison\" which forced her eight-year-old son to move out - after 25,000 tonnes of illegally dumped waste burned for nine days last year.",
        "url": "https://news.sky.com/story/what-its-like-to-live-next-to-a-25000-tonne-illegal-waste-dump-with-rats-everywhere-13496321",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nicha-rowson-dan-whitehead_7140142.jpg?20260120011012",
        "type": "Home",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-19 17:22:00",
        "Headline": "Dumping started at the site in Bickershaw, Wigan in late 2024. More than a year later, nothing has been done to clear the site - and families living just metres away are still suffering.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n A mother has told Sky News how her home has become a \"prison\" which forced her eight-year-old son to move out - after 25,000 tonnes of illegally dumped waste burned for nine days last year. Nicha Rowson, who lives just metres from a major illegal waste site in Bickershaw, Wigan, said the 17-month ordeal has \"teared our family apart\". The smell of the dump makes Nicha's son Oliver, who has autism, so physically ill that he moved out to live with his grandmother. \"It's put stress on our family, our mental health isn't great. It's like being separated parents. Even though me and my partner are together, we're sharing the child with the grandparents,\" Nicha said. \"I can't keep saying, 'oh soon it'll be cleared up' because it isn't. I don't know what else I can tell my child, why he has to live in this prison. Because it is, it's like a prison.\" The family home has had such a major rat infestation that the family were forced to tear down their ceiling to tackle the issue. Nicha also found a dead rat in her living room. \"We could see rats running along our fences, running around the street at the front, they were just everywhere.\" Sky News has been investigating how, across the country, waste crime is a growing scourge and a booming business being exploited by criminal gangs.  Being paid to remove rubbish only to dump it illegally without sorting it or paying tax is an easy way of making huge amounts of money, with poorly enforced legal repercussions and a huge cost to the environment.  It's something the previous head of the Environment Agency called \"the new narcotics\". - It's thought a fifth of all waste in England is being illegally managed - That's around 34 million tonnes a year, enough to fill about four million skips - It costs the economy around a billion pounds a year, with legitimate operators thought to be losing a further £3bn from missed business Last July,  we tracked down a group of suspected organised fly-tippers who waved wads of cash on TikTok after dumping waste in the countryside.\n Nicha said she feels like she's \"failing\" as a parent. \"I'm fighting and fighting, and I'm not winning the battle. At the end of the day if my child has to move out to be healthy, then that's what he has to do. But it's hard.\" The dumping started on Bolton House Road in the autumn of 2024, and within a few months, mountains of waste formed in the quiet scrapyard. Read more: Rats, flies and maggots plague Wigan residents In July of last year, in the middle of a heatwave, a major incident was declared when the tip caught fire, forcing the local primary school to close for several days, and several residents were sent to hospital. The fire burned for nine days, which caused such a strain on resources that residents had no water for days. Nicha feels abandoned by the Environment Agency (EA) and the local council. \"All the way through we've been begging for help, we've done the professional emails but in the end we've resorted to saying this is inhumane, we're living in a prison, we need some help, and they're just ignoring us,\" she said. If you have been affected by fly-tipping, email news@skynews.com or send us a message on Whatsapp Some 200 miles away, a similarly sized site in Kidlington, Oxfordshire made headlines before Christmas, with dumping starting there last summer. But the EA has said it will spend £9.6m clearing the site in what they say is an \"exceptional decision\", leading the local MP Josh Simons to accuse it of seeming to apply \"exceptional circumstances to middle-class areas in Oxford but not working-class towns in Wigan\". \"When primary school kids are inhaling flames from a dump that's on fire, declared as a major incident, why does that not count as an exceptional circumstance?\" he said in a post on X. This divide was also raised in the House of Lords last week by Baroness Sheehan, the chair of the Lords' environment and climate change committee. She told Sky News: \"The nature of the waste in the Bickershaw site, it's hazardous waste, it is rotting waste. It really should be a high priority for the safety of the residents and the school children there.\" Nicha says she feels like the authorities \"don't care\" about her and her husband's plight. \"We're working hard, we're both self-employed working six, seven days a week, and we've got to the point now where our house isn't worth anything, and no one gives a hoot - no one cares,\" she said. \"Because of the tip, the smells… it devalued our house [that] if we sold it, we might not get enough to cover the mortgage that's outstanding on it. \"My message to the Environment Agency is to stop thinking about the money and passing the buck - think about the mental and physical health of the residents.\" What's being done about it? A spokesperson for the EA told Sky News that they are paying to clear the Kidlington site due to \"new information [that] has come to light about the rapidly escalating fire risks with potential to close the A34 major highway and impact key electrical supplies\". The spokesperson continued: \"This does not undermine the real impacts to the local community in Wigan, and we are doing everything within our power to ensure that the perpetrators pay the price to clean up the site, rather than taxpayers.\" Wigan Council is paying for a part of the site to be cleared where the waste has spilled onto a nature reserve that the council owns. A spokesperson said this clear up \"will come at a cost to the council\" and that the council \"understands the difficulties that residents living close to the illegal waste site at Bolton House Road have endured and would like to see the entire site cleared as a matter of priority\". \"The leader of the council, David Molyneux MBE, has written to the chief executive of the Environment Agency to understand why funding was made available for the waste site in Oxfordshire, but not for Bolton House Road,\" the spokesperson has said. \"The council would like to call on the government to make funding available - via the Environment Agency or other department - as has been done for other sites, given the risks the site poses and the detrimental impact this has had on neighbouring residents and the adjacent primary school.\""
    },
    {
        "title": "'Crimes are going unpunished,' say government sources - with too many officers pulled off street",
        "description": "Local police forces are not equipped to fight crime, government sources have told Sky News, with thousands of officers pulled off the street into desk jobs in the past decade.",
        "url": "https://news.sky.com/story/crimes-are-going-unpunished-say-government-sources-with-too-many-officers-pulled-off-street-13496379",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-polic-police-officers_7140137.jpg?20260120002533",
        "type": "Home",
        "Author": "Ali Fortescue",
        "Date Published": "2026-01-19 20:26:00",
        "Headline": "It comes after figures reveal thousands of officers are moved from the frontline to the back office.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n Local police forces are not equipped to fight crime, government sources have told Sky News, with thousands of officers pulled off the street into desk jobs in the past decade. \"Crimes on our streets are going unpunished\" and are \"plaguing communities\", a senior source warned, as the government prepares to announce significant reforms to policing this month. Home Office figures shared with Sky News show the number of trained uniformed police officers in back-office roles like HR and IT support has surged by 40% in the past six years to more than 12,600. Meanwhile, the number of visible frontline officers has fallen to around 67,000, down from more than 70,000 a decade ago. Government sources blamed \"arbitrary\" headcount targets, which they suggest incentivise hiring officers to desk jobs. The Officer Maintenance Grant, introduced under Boris Johnson's government, is expected to be scrapped and replaced with protected funding for neighbourhood officers. It comes as the Metropolitan Police Commissioner Sir Mark Rowley has called for a dramatic overhaul of the policing system as he said the current model is \"out of date\". Speaking to Sky's Trevor Phillips, Sir Mark said he believed there should be a reduction in the 43 police forces across England and Wales as a shake-up of the system is \"overdue\". Shoplifting top of public concern Internal Home Office polling, shared with Sky News, found that shoplifting is the crime people worry about most, along with anti-social behaviour, including concerns about drugs and knife crime. Shop theft has risen by 72% since 2010 and reached record levels in the year ending March 2025, with fewer than one in five incidents resulting in a charge. A government source admitted many town centres feel \"abandoned\" as officers are \"increasingly burdened by bureaucracy and stuck behind desks instead of out on the frontline\". They said \"criminals feel they can cause havoc on our streets with impunity\". 'A reactive service' The government has pledged 13,000 more neighbourhood officers by the end of the parliament and has committed to a record £18.4bn police funding settlement announced last week. Policing has become a \"reactive service focused on crisis response, rather than fighting crime\", a government source said."
    },
    {
        "title": "'Nowhere to hide' for water companies, vows government in industry shake up",
        "description": "The creaking water industry is set for a \"once-in-a-generation set of reforms\", the government has said as it proposes new legislation to overhaul the system.",
        "url": "https://news.sky.com/story/nowhere-to-hide-for-water-companies-vows-government-in-industry-shake-up-13496279",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mogden-sewage-treatment_6969742.jpg?20250721101325",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-19 15:18:00",
        "Headline": "Water companies to be subject to \"MOTs\" under new government plans aiming to preempt rather than remedy major failures, such as the recent water shortages in south-east England.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The creaking water industry is set for a \"once-in-a-generation set of reforms\", the government has said as it proposes new legislation to overhaul the system. Nightmare situations such as taps running dry in Kent and Sussex recently would be avoided, the government says, thanks to a new proactive system that would perform \"MOTs\" on water companies to preempt major failures. Ministers are set to unveil a series of reforms in parliament on Tuesday as they move ahead with a major shake-up in the industry in England and Wales, including abolishing the current system of overlapping regulators. Public confidence in the old way collapsed as sewage spills grew and pipes crumbled, while water company bosses enjoyed ever bigger bonuses. The new plans, outlined in a White Paper on Tuesday, would create one single regulator, as well as an ombudsman to make it easier for bill-payers to complain about their suppliers. But campaigners and the water industry have warned the proposals won't come in soon or reach far enough. 'Nowhere to hide' \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  What UK social media ban on children could look like - as government considers action\n                 \n                  What it's like to live next to a 25,000 tonne illegal waste dump\n                 The environment secretary Emma Reynolds called the proposals a \"once-in-a-generation set of reforms\" to tackle water pollution and \"poor performance by water companies\". Under the government's proposals, water companies will have to perform health checks on their infrastructure to proactively identify problems with pipes or sewage treatment works before they fail. A new chief engineer at the regulator will also bring back hands-on checks of infrastructure, something not seen for 20 years. Ms Reynolds told Sky News: \"We're going to move away from a system whereby water companies mark their own homework to having a new regulator - abolishing Ofwat - with more teeth, so that there'll be nowhere to hide for poor performance.\" It comes as complaints to the consumer body, the Consumer Council for Water, rose 50% in the last year while trust hit an \"all time low\". Its chief executive Mike Keil said: \"The miserable disruption inflicted on people in parts of Sussex and Kent in recent weeks underlines why meaningful change in the way water companies are regulated and treat their customers is desperately needed.\" He welcome the proposed new ombudsman, which would have legal powers to resolve disputes and force water companies to compensate for problems. Public outcry over water companies The planned changes come as part of the government's response to public fury over rising bills, sewage pollution and large payouts for executives. Last year it commissioned an independent review that made 88 recommendations to repair one of the world's only fully privatised water systems. But it ruled out re-nationalisation of the water industry, which it sees as too expensive and disruptive, but which some campaigners say is the only solution. James Wallace, CEO of River Action, said the government \"recognises the scale of the freshwater emergency, but lacks the urgency and bold reform to tackle it\". He said none of the proposals would \"make a meaningful difference\" without tackling privatisation, which is the \"root cause of this crisis\". Water companies also warned the changes might come in too slowly. The government expects them before the next general election, but can't yet put a date on it. A spokesperson for the industry body Water UK said: \"We cannot afford for any more long-term decisions to be taken by a system everyone knows has failed. \"The need for major reform has long since been agreed. Delivery now needs to catch up.\" The proposals so far were also light on reforms to other sectors that pollute Britain's waterways, such as farms, housing and roads - though more detail is expected in the White Paper on Tuesday."
    },
    {
        "title": "Prince Harry: It's his biggest case against the press and the stakes are high for the duke and the publisher of the Daily Mail ",
        "description": "He's spent years fighting the tabloids, but arriving at the High Court was a moment Prince Harry wanted the cameras to capture.",
        "url": "https://news.sky.com/story/prince-harry-its-his-biggest-case-against-the-press-and-the-stakes-are-high-for-the-duke-and-the-publisher-of-the-daily-mail-13496351",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7139526.jpg?20260119101141",
        "type": "Home",
        "Author": "Laura Bundock",
        "Date Published": "2026-01-19 19:39:00",
        "Headline": "The Duke of Sussex and other household names - including Sir Elton John and Elizabeth Hurley - are suing the publishers of the Daily Mail over alleged historical privacy breaches in a landmark trial at the High Court.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n He's spent years fighting the tabloids, but arriving at the High Court was a moment Prince Harry wanted the cameras to capture. This is his last legal challenge against the British press. It's also his biggest, and with reputations on the line, the stakes for all sides are high. Day one, and the battlelines are being bullishly drawn. What happened on day one - recap Harry and the other high-profile co-claimants all allege that Associated Newspapers (ANL) published stories about them using information that was illegally obtained by private investigators hacking phones, deceptively \"blagging\" private information and planting bugs in homes and cars. Their barrister told the court there was a culture of unlawful information gathering at ANL. That its use was \"clear, systemic and sustained\". He also claimed the newspaper group knew what had been going on and knew there were \"skeletons in the closet\". ANL strongly denies any wrongdoing, insisting its stories were properly sourced, with Harry's own friends often the source of the leak. We now know that Prince Harry's claim centres around 14 articles published between 2001 and 2013. Many focus on his relationship with Chelsy Davy. He says the intrusion was terrifying, creating distrust and suspicion, and leaving him paranoid beyond belief. The Duke of Sussex seemed upbeat as he arrived and left the High Court. He spent the day sitting quietly in court 76 listening intently. These legal challenges have become his personal crusade. He once said changing the media landscape would be his life's work. That work is well under way. 👉 Listen to Sky News Daily on your podcast app 👈 But this claim against the Mail could be his most challenging. It will pitch the prince against one of Fleet Street's most fearsome editors, Paul Dacre. Neither wants to back down and both will soon have their moment in court. With all the claimants due to give evidence, this nine-week case has a long way to run. Read more on Sky News:Harry vs the Daily Mail explainedHarry's security set-up review Prince Harry certainly seems more relaxed. He smiled and waved as he arrived at court. He's already secured a victory and apologies from two other tabloids - winning in part his case against the Daily Mirror and settling with The Sun. His last chapter is just beginning; this is his final chance to try and expose what he believes are the dark arts of British newspapers. ANL are ready to defend its journalism. No wonder many are calling this the 'super case' of the year."
    },
    {
        "title": "How deadly train crash unfolded in Spain - and why it's been described as 'truly strange'",
        "description": "A faulty rail joint may be key to understanding the cause of one of Spain's deadliest railway disasters in years, experts have said.",
        "url": "https://news.sky.com/story/spain-train-crash-how-it-unfolded-13496307",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-spain-train-crash_7139965.png?20260119194059",
        "type": "Home",
        "Author": "the Sky News Data &amp; Forensics team",
        "Date Published": "2026-01-19 16:45:00",
        "Headline": "The Sky News Data & Forensics team has pieced together how the worst rail disaster in Spain since 2013 came about.",
        "Content": "By the Sky News Data & Forensics team  A faulty rail joint may be key to understanding the cause of one of Spain's deadliest railway disasters in years, experts have said. At least 40 people were killed and 159 injured in a high-speed collision between two trains on Sunday. Here, the Sky News Data & Forensics team looks at how the crash unfolded. Follow Spain train crash updates live A timeline of the crash Before the crash, a train run by private company Iryo and carrying around 300 passengers departed from Malaga on a journey to the capital Madrid at 6.40pm (5.40pm GMT). The other train, which was carrying nearly 200 people and managed by Spain's public train company Renfe, departed Madrid for Huelva in the south at 6.05pm local time (5.05pm GMT). Around 7.45pm local time (6.45pm GMT), the tail end of the first train travelling from Malaga to Madrid derailed and jumped onto the opposite side of the tracks. It then crashed into the other train near the town of Adamuz in the province of Cordoba, around 230 miles south of Madrid. At the time of the crash, both trains were travelling at more than 120mph. Footage showed passengers climbing out of smashed windows after the crash, with emergency services on the scene. The injured were taken to a nearby hospital. 'A truly strange' incident Spain's transport minister Oscar Puente said the cause of the crash was unknown, but called it \"a truly strange\" incident because it happened on a flat stretch of track that had been renovated in May. He said the back of the Iryo train had derailed and then veered across the other track, slamming into the front of the Renfe train and knocking its first two carriages off the track and down a 4 metre slope. The worst damage was to the front section of the Renfe train, he added. Mr Puente shared a picture showing the system used to monitor the infrastructure and movement of all trains along the network. The map showed the live positions of the two trains just under two hours after the crash happened, with red lines indicating the track was blocked. Investigators say faulty joint could be key to crash An initial investigation has identified a faulty joint as key to the train crash, Reuters reported, citing a source. The news agency said technicians identified some wear on the joint between sections of the rail, known as a fishplate, which they said showed the fault had been there for some time. Ian Prosser, former HM chief inspector of railways, said the derailment was most likely due to a track issue, such as a broken rail. \"The most likely case would be a track fault of some sort or something went wrong with the train,\" he said. \"But that would be very rare.\" High-speed train crashes on straight rail lines, as happened in this case, are also rare, Mr Prosser said. \"It takes quite a long time for a train to actually come and sort of stop,\" he added. \"So at that speed would be travelling for quite some time after the actual initial impact.\" Human error 'ruled out' Earlier, the president of Spain's national railway company Renfe, Alvaro Fernandez Heredia, had said \"human error could be ruled out\". The Iryo train had been built in 2022, with its last inspection carried out on 15 January this year. The track the crash occurred on was also new, having been completely renovated last May, with an investment of €700m (£607m). However, it still had issues, with a Spanish train drivers' union warning rail operator Adif of the heavy wear and tear on the tracks, including the one where the two trains collided, in a letter last August. In October last year, rail unions approached the government to request a reduction of speed to avoid accidents on the line. Spain's rail safety record Spain's railway safety agency (AESF) has recorded between 42 and 98 significant rail accidents per year since 2006, with the most accidents in 2007 and 2023, at 98 and 77 respectively. Those years saw a particularly high number of level crossing and personal injury accidents, with the agency highlighting the notably lower figure for 2024, at 57 compared with 77, was mainly due to a reduction in those types of incidents rather than in collisions and derailments. In 2024, one in five incidents in Spain were caused by derailment - five times the EU average of 4%, with the country recording a smaller proportion of level crossings and other personal injury incidents than the EU average. Some 18 people were killed in railway accidents in Spain in 2024, the equivalent of around one person per 1,000km of railway tracks, leaving Spain among the countries with the lowest level of rail fatalities in the EU, according to the European Commission. The worst Spanish railway accident this century was a train derailment in Santiago de Compostela in July 2013, which killed 79 people. Prosecutors set to open criminal probe as soon as possible Sources from Spain's interior ministry told Sky News local prosecutors are waiting for the report from police, and are then set to open a criminal probe as soon as possible. Asked by reporters how long an inquiry into the crash's cause could take, the transport minister Mr Puente said it could be a month. Spain's Prime Minister Pedro Sanchez expressed his condolences to the victims' families in a post on X, writing: \"Tonight is a night of deep pain for our country.\" On Monday night, as many of the injured left hospital, some family members were still scouring social media and hospitals for more information about their missing loved ones. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Gwyneth Paltrow, Cindy Crawford and Donatella Versace lead tributes to designer Valentino",
        "description": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\".",
        "url": "https://news.sky.com/story/italian-fashion-designer-valentino-dies-13496264",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gwyneth-paltrow-valentino_7140067.jpg?20260119220310",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-19 14:31:00",
        "Headline": "Tributes pour in from leading politicians and actors for the designer - best known for creating his signature 'Valentino red'.",
        "Content": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\". He died on Monday at his home in Rome, surrounded by his loved ones, his foundation announced today. He was 93. A lying in state will be held on Wednesday and Thursday to honour him. His funeral is set to take place in Rome on Friday. Hollywood star Gwyneth Paltrow, who wore a Valentino gown for her wedding to Brad Falchuk, said on Instagram: \"I was so lucky to know and love Valentino - to know the real man, in private. \"The man who was in love with beauty, his family, his muses, his friends. His dogs, his gardens, and a good Hollywood story. \"I loved him so much. I loved how he always pestered me to \"at least wear a little mascara\" when I came to dinner. I loved his naughty laugh. \n                  Greenland latest: Trump admits he may have been misinformed over European troops in territory, Sky News told\n                 \n                  Trump's extraordinary letter to Norway about Greenland - in full and fact-checked\n                 \n                  How deadly train crash unfolded in Spain - and why it's been described as 'truly strange'\n                 \"This feels like the end of an era. He will be deeply missed by me and all who loved him. Rest in peace, Vava.\" Fashion designer Donatella Versace also said in a post: \"Today, we lost a true maestro who will forever be remembered for his art. \"My thoughts go to Giancarlo, who never left his side for all these years. \"He will never be forgotten.\" Born Valentino Garavani, he became known simply as Valentino - sharing the name with his eponymous fashion line. The label is best known for creating \"Valentino red\" - a dark shade of red that would feature heavily in their dresses. Italian Prime Minister Giorgia Meloni was among a list of leading politicians to pay tribute to the designer on social media.She said: \"Valentino, undisputed master of style and elegance and eternal symbol of Italian high fashion. \"Today, Italy loses a legend, but his legacy will continue to inspire generations. Thank you for everything.\" Deputy prime minister Antonio Tajani described him as a \"leading figure\" of global fashion in a post on X. His foundation added: \"Valentino Garavani was not only a constant guide and inspiration for all of us, but a true source of light, creativity and vision.\" Model Cindy Crawford said in a post on Instagram that she was \"heartbroken\" by his loss. She said: \"I will always be grateful for the years I had the privilege of working closely with him.\" Valentino dresses became a mainstay on Hollywood red carpets - from Reese Witherspoon, Jennifer Lopez and Cate Blanchett among the stars to have worn him. Other famous names include Julia Roberts, Princess Diana and former first lady Jacqueline Kennedy - who wore his dresses throughout her mourning period for John F. Kennedy. He later developed a friendship with Anne Hathaway - even making an appearance in 2006 film The Devil Wears Prada. Despite retiring almost two decades ago, his fashion line continues to be a staple at award shows. At this month's Golden Globe awards actors Hannah Einbinder and Colman Domingo wore outfits bearing his name. Born in Voghera, northern Italy, the designer first made his name after setting up a fashion house in Paris. He later returned to his home country to set up the fashion house alongside long-time business partner Giancarlo Giammetti. His works were best known for their opulence, often incorporating vivid colours and ornate designs at a time when much of the fashion world was looking towards minimalist design. He once famously said: \"I know what women want. They want to be beautiful.\" His career stretched from the 1960s through to his retirement in 2008."
    },
    {
        "title": "Yorkshire Cold War nuclear bunker hangs on a cliff edge and is close to falling into the sea ",
        "description": "A Cold War nuclear bunker hanging from a cliff edge could now be just weeks, if not days, away from falling into the sea.",
        "url": "https://news.sky.com/story/yorkshire-cold-war-nuclear-bunker-hangs-on-a-cliff-edge-and-is-close-to-falling-into-the-sea-13496395",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nuclear-bunker_7139961.jpg?20260119193628",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-19 21:02:00",
        "Headline": "The bunker was built around 50 years ago, but is now close to falling into the North Sea as the coastline is eroding by more than 6ft a year",
        "Content": "A Cold War nuclear bunker hanging from a cliff edge could now be just weeks, if not days, away from falling into the sea. The bunker - built around 70 years ago as a look-out post - is precariously hanging off the Holderness coastline in Tunstall, East Yorkshire. Amateur historian Davey Robinson, who is using a drone to film its final days, told Sky News's The UK Tonight with Sarah-Jane Mee programme: \"We were first told about it back in 2025 - it was quite wedged into the cliff still at that point. \"After that, we kept popping back. \"In November, we went and had a look. Four weeks later, we popped back and it had sunk down a foot and a half. \"You can go back to 2003 on Google Earth - it's unbelievable how much land has gone.\" Read more from Sky News:How the Spain crash unfoldedWhat did Trump write to Greenland? \n                  Body recovered in search for teenager swept into sea\n                 \n                  Footage of explosion as ship crashes into tanker shown in court\n                 \n                  Mother named as victim of Withernsea drowning, daughter still missing\n                 East Riding of Yorkshire Council urged people to avoid the area amid fears that it could go any day. They have told residents to always \"maintain a safe distance to the base of eroding cliffs due to the risks associated\". Known as the Tunstall ROC (Royal Observer Corps) Post, the bunker is believed to have been built in 1959 - before it was decommissioned in the early 1990s. It comes as the Environment Agency warns that East Yorkshire has some of the fastest eroding coastline in the UK. The Holderness coastline is eroding at an average annual rate of about 6.5ft (2m), they claim."
    },
    {
        "title": "Fighting erupts near prisons holding IS extremists in Syria a day after Kurdish-led SDF agreed ceasefire with Damascus",
        "description": "Fighting has broken out between Syrian government troops and the Kurdish-led Syrian Democratic Forces (SDF), just a day after a ceasefire was announced by the country's state media.",
        "url": "https://news.sky.com/story/fighting-erupts-near-prisons-holding-is-extremists-in-syria-a-day-after-kurdish-led-sdf-agreed-ceasefire-with-damascus-13496377",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-syrian-raqqa_7139985.jpg?20260119201517",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-19 20:17:00",
        "Headline": "Several SDF fighters were killed in the battles after talks failed to reach a positive outcome following days of deadly fighting during which government forces captured wide areas of northeast Syria from the group.",
        "Content": "Fighting has broken out between Syrian government troops and the Kurdish-led Syrian Democratic Forces (SDF), just a day after a ceasefire was announced by the country's state media. Several SDF fighters were killed and more than a dozen others wounded in Monday's clashes, the group said, as violence erupted around two prisons holding members of the Islamic State group in the northeast of the country. On Sunday, SDF negotiators agreed a truce in principle with Damascus, but a member of the SDF team, said to include chief commander Mazloum Abdi, told Sky News the talks failed to reach a positive outcome. The deal, which was signed remotely, appeared to end days of deadly fighting during which government forces captured wide areas of northeast Syria from the SDF. Further negotiations were due to take place on Monday, but the source said discussions broke down as fighting continued. Government forces were to blame, having violated the ceasefire, the source said, warning that if attacks persisted, SDF fighters could not disarm and must continue to defend themselves. The SDF, which was the main US-backed force that fought IS in Syria, controls more than a dozen prisons in the northeast where some 9,000 IS members have been held for years without trial. \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  Has Trump and Starmer's 'special relationship' turned toxic? \n                 \n                  Trump to take advantage of deal-making paradise in Davos following Greenland threat\n                 Among those detained are extremists thought to have been responsible for atrocities in Syria and Iraq after IS declared a caliphate in June 2014 over large parts of the two countries.Some of those being held at the Shaddadi Prison in the town of Shaddadeh took advantage of the chaos to escape, the army said in a statement. The SDF admitted it had lost control of the site, around 31 miles (50km) from the border with Iraq. Nine of its fighters were killed and 20 others wounded in fighting around another prison, al-Aqtan, northeast of the northern city of Raqqa, the group said. Read more:'Experienced terrorist' killed by US in SyriaRapper on 'massacre' in Iran A US convoy was seen entering the prison area, apparently to mediate between the two sides, an Associated Press reporter said. Washington has good relations with both sides. Earlier on Monday, the Syrian government had warned the SDF not to use \"cases of terrorism for political blackmail,\" saying it is ready to implement international law regarding the detainees. In a statement, Damascus warned the SDF's command not to help IS detainees flee or open up prisons it controls \"as a revenge measure or for political pressure\". IS was defeated in Iraq in 2017 and in Syria two years later, but the group's sleeper cells still carry out deadly attacks in both countries."
    },
    {
        "title": "Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear",
        "description": "An emergency news conference in the Downing Street briefing room and the prime minister the gravest I've seen.",
        "url": "https://news.sky.com/story/a-grave-pm-sets-out-scale-of-greenland-crisis-13496387",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7140148.jpg?20260120012744",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-19 20:42:00",
        "Headline": "Sir Keir Starmer left us in no doubt that we are facing the most serious crisis in the transatlantic relationship in decades, with huge uncertainty about what comes next.",
        "Content": "\n          Political editor\n              @BethRigby\n An emergency news conference in the Downing Street briefing room and the prime minister the gravest I've seen. He came to level with the public about the predicament we are in, and the consequences for us all should President Donald Trump follow through on his threat to slap tariffs on the UK and take control of Greenland. He left the audience in no doubt that we are facing the most serious crisis in the transatlantic relationship in decades, with huge uncertainty about what comes next. Sir Keir Starmer was the most forthright I have seen him as he broke with President Trump, strongly criticising tariffs and insisting that on the matter of Greenland, the UK would not bend, whatever the consequences as he reminded the US that alliances were built on partnership, \"not pressure\". But the prime minister also used this moment to try to de-escalate, as he stressed the importance of the US-UK relationship and dodged the matter of retaliatory tariffs in an effort to avoid any further poking of the bear. It doesn't, by the way, mean the UK has ruled this option out - rather it is not a preferred solution and London would rather talk about other options. But the UK pointedly chose at this moment not to follow the EU by raising the prospect of retaliatory tariffs. That EU package, I'm told, could be released on Thursday. Transatlantic relations between the US and Europe are facing an unprecedented challenge due to Donald Trump's desire to annex Greenland. The arctic island is part of Denmark, a NATO ally with which the US has a defensive pact, but that hasn't dissuaded Trump. Warning against the influence of Russia and China, he claims he needs the territory for security reasons. And he hasn’t ruled out seizing it by force; offering a guarded “no comment” when asked by our US partner network NBC News. In a bid to allay the president’s fears, several European nations contributed troops to a reconnaissance mission in Greenland. But Trump said they were deployed “for purposes unknown” and seemed to interpret their presence as a message to the US. So he sent a message back – threatening to slap eight European countries with 10% tariffs from 1 February, raising to 25% from 1 June, unless the US is allowed to buy the territory. Sky understands that Trump has conceded, in a phone call with Sir Keir Starmer, that he may have misinterpreted the reason for the troops’ deployment in Greenland. But he has doubled down on the threatened tariffs – which the prime minister says are “completely wrong” – telling NBC he “100%” intends to impose them. The economic impact is already being felt in stock markets of the nations involved. Read more:Trump's extraordinary letter to NorwayWill EU unleash its most powerful trade weapon? As I understand it, the prime minister is also \"very unlikely\" to attend Davos this week, given that there is no big set pieces on multilateral issues - be that Ukraine or Greenland, for now, that are likely to be resolved. Instead, Keir Starmer will press on with his preferred method - talking intensely behind closed doors while saying as little as possible in public. Danish minister reveals depth of rift But if the prime minister doesn't want to reveal what is being said in private, the gravity of this rupture in the transatlantic alliance was laid bare by the Danish foreign minister and former prime minister, Lars Rasmussen - in London for talks with the foreign secretary - as he recounted the meeting he'd had with Vice President JD Vance and Secretary of State Marco Rubio in Washington last week. \"The meeting we had last week left me with the clear impression that the president, honestly and full-heartedly, wants to acquire Greenland. But we also made it crystal clear that this is a red line,\" he told me in an interview after his meeting with Yvette Cooper. \"We agreed to disagree. The concerns raised at the meeting and also in public, about security in the Arctic - [Trump's] concerns - we want to accommodate. Therefore, we agreed that we should move this dialogue from social media and Truth Social and other arenas into a meeting room where we could discuss whether there could be a solution building on what we already have agreed in the past.\" Up for discussion was the US massively increasing its presence in Greenland, and the stepping up of NATO on the island, as well as guarantees stopping any presence of China in Greenland stretching out for 10, 20 or 30 years. \"I thought, we have managed not to solve the problem, but to find a pathway forward. It was disrupted by the statement from the president. And that's a reality of life,\" said Mr Rasmussen, as he spoke of his appreciation of the UK and other allies coming to stand by the Danes' side. Bur what it also reveals is the depth of this transatlantic rift over Greenland. Hours after the prime minister suggested he didn't think President Trump would send in troops to Greenland and called on the US to resolve these differences through dialogue, the US president told reporters he would impose 10% tariffs on the UK and other European countries that had sent troops to Greenland for a NATO exercise last week, and refused to rule out military force. Europe's last hope to rein in Trump? That we are in this situation a year into the Trump presidency is shocking and bewildering. For decades, the transatlantic alliance has framed our world order. Now that is being undone as President Trump exercises the law of power rather than working in the rule of law that has governed international relations since the Second World War. Escalation in Greenland would rupture the NATO alliance should the leading member move directly into conflict with another partner, the Danes, who stood with the US after 9/11, suffering similar amounts of casualties to the US in Afghanistan. It would trigger a trade war that would do all of us harm. It could result in the US withdrawing from Ukraine and embolden a Russian aggressor on the edge of Europe. The consequences are as unimaginable as they are serious. But ultimately, President Trump knows he has the economic and military power to face down Europe, and it will take more than European diplomacy to persuade him to back down. With the US president due at the annual World Economic Forum summit in Davos on Wednesday, huge attention will be paid to what he has to say in Switzerland - but it will be back in Washington where the difference might be made, as Mr Trump draws fire back home from Republicans in Congress. If the Europeans can't rein him in, will his domestic lawmakers? Republican House Speaker Mike Johnson met with Sir Keir in London on Monday, with the prime minister reiterating his position on Greenland and tariffs. The best hope the Europeans have is to persuade Congress to act. The transatlantic relationship is, after all, bigger and more enduring than one man."
    },
    {
        "title": "What it's like to live next to a 25,000-tonne illegal waste dump - with rats everywhere",
        "description": "A mother has told Sky News how her home has become a \"prison\" which forced her eight-year-old son to move out - after 25,000 tonnes of illegally dumped waste burned for nine days last year.",
        "url": "https://news.sky.com/story/what-its-like-to-live-next-to-a-25000-tonne-illegal-waste-dump-with-rats-everywhere-13496321",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nicha-rowson-dan-whitehead_7140142.jpg?20260120011012",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-19 17:22:00",
        "Headline": "Dumping started at the site in Bickershaw, Wigan in late 2024. More than a year later, nothing has been done to clear the site - and families living just metres away are still suffering.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n A mother has told Sky News how her home has become a \"prison\" which forced her eight-year-old son to move out - after 25,000 tonnes of illegally dumped waste burned for nine days last year. Nicha Rowson, who lives just metres from a major illegal waste site in Bickershaw, Wigan, said the 17-month ordeal has \"teared our family apart\". The smell of the dump makes Nicha's son Oliver, who has autism, so physically ill that he moved out to live with his grandmother. \"It's put stress on our family, our mental health isn't great. It's like being separated parents. Even though me and my partner are together, we're sharing the child with the grandparents,\" Nicha said. \"I can't keep saying, 'oh soon it'll be cleared up' because it isn't. I don't know what else I can tell my child, why he has to live in this prison. Because it is, it's like a prison.\" The family home has had such a major rat infestation that the family were forced to tear down their ceiling to tackle the issue. Nicha also found a dead rat in her living room. \"We could see rats running along our fences, running around the street at the front, they were just everywhere.\" Sky News has been investigating how, across the country, waste crime is a growing scourge and a booming business being exploited by criminal gangs.  Being paid to remove rubbish only to dump it illegally without sorting it or paying tax is an easy way of making huge amounts of money, with poorly enforced legal repercussions and a huge cost to the environment.  It's something the previous head of the Environment Agency called \"the new narcotics\". - It's thought a fifth of all waste in England is being illegally managed - That's around 34 million tonnes a year, enough to fill about four million skips - It costs the economy around a billion pounds a year, with legitimate operators thought to be losing a further £3bn from missed business Last July,  we tracked down a group of suspected organised fly-tippers who waved wads of cash on TikTok after dumping waste in the countryside.\n Nicha said she feels like she's \"failing\" as a parent. \"I'm fighting and fighting, and I'm not winning the battle. At the end of the day if my child has to move out to be healthy, then that's what he has to do. But it's hard.\" The dumping started on Bolton House Road in the autumn of 2024, and within a few months, mountains of waste formed in the quiet scrapyard. Read more: Rats, flies and maggots plague Wigan residents In July of last year, in the middle of a heatwave, a major incident was declared when the tip caught fire, forcing the local primary school to close for several days, and several residents were sent to hospital. The fire burned for nine days, which caused such a strain on resources that residents had no water for days. Nicha feels abandoned by the Environment Agency (EA) and the local council. \"All the way through we've been begging for help, we've done the professional emails but in the end we've resorted to saying this is inhumane, we're living in a prison, we need some help, and they're just ignoring us,\" she said. If you have been affected by fly-tipping, email news@skynews.com or send us a message on Whatsapp Some 200 miles away, a similarly sized site in Kidlington, Oxfordshire made headlines before Christmas, with dumping starting there last summer. But the EA has said it will spend £9.6m clearing the site in what they say is an \"exceptional decision\", leading the local MP Josh Simons to accuse it of seeming to apply \"exceptional circumstances to middle-class areas in Oxford but not working-class towns in Wigan\". \"When primary school kids are inhaling flames from a dump that's on fire, declared as a major incident, why does that not count as an exceptional circumstance?\" he said in a post on X. This divide was also raised in the House of Lords last week by Baroness Sheehan, the chair of the Lords' environment and climate change committee. She told Sky News: \"The nature of the waste in the Bickershaw site, it's hazardous waste, it is rotting waste. It really should be a high priority for the safety of the residents and the school children there.\" Nicha says she feels like the authorities \"don't care\" about her and her husband's plight. \"We're working hard, we're both self-employed working six, seven days a week, and we've got to the point now where our house isn't worth anything, and no one gives a hoot - no one cares,\" she said. \"Because of the tip, the smells… it devalued our house [that] if we sold it, we might not get enough to cover the mortgage that's outstanding on it. \"My message to the Environment Agency is to stop thinking about the money and passing the buck - think about the mental and physical health of the residents.\" What's being done about it? A spokesperson for the EA told Sky News that they are paying to clear the Kidlington site due to \"new information [that] has come to light about the rapidly escalating fire risks with potential to close the A34 major highway and impact key electrical supplies\". The spokesperson continued: \"This does not undermine the real impacts to the local community in Wigan, and we are doing everything within our power to ensure that the perpetrators pay the price to clean up the site, rather than taxpayers.\" Wigan Council is paying for a part of the site to be cleared where the waste has spilled onto a nature reserve that the council owns. A spokesperson said this clear up \"will come at a cost to the council\" and that the council \"understands the difficulties that residents living close to the illegal waste site at Bolton House Road have endured and would like to see the entire site cleared as a matter of priority\". \"The leader of the council, David Molyneux MBE, has written to the chief executive of the Environment Agency to understand why funding was made available for the waste site in Oxfordshire, but not for Bolton House Road,\" the spokesperson has said. \"The council would like to call on the government to make funding available - via the Environment Agency or other department - as has been done for other sites, given the risks the site poses and the detrimental impact this has had on neighbouring residents and the adjacent primary school.\""
    },
    {
        "title": "Brooklyn Peltz Beckham 'doesn't want to reconcile with family'",
        "description": "Brooklyn Peltz Beckham has broken his silence about his estrangement from his parents, saying he does not want to reconcile with his family.",
        "url": "https://news.sky.com/story/brooklyn-beckham-doesnt-want-to-reconcile-with-family-13496393",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckham-david-beckham_7140029.jpg?20260119210741",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-19 20:58:00",
        "Headline": "In a long statement on Instagram, the 26-year-old said he was standing up for himself for the first time in his life.",
        "Content": "Brooklyn Peltz Beckham has broken his silence about his estrangement from his parents, saying he does not want to reconcile with his family. In a statement shared on his Instagram story, the 26-year-old offered his explanation for the alleged rift. He wrote: \"I have been silent for years and made every effort to keep these matters private. \"I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life. \"All we want [is] peace, privacy and happiness for us and our future family.\" His statement, which Sky News is not reproducing in full, runs across multiple stories on Instagram, where he has 16.1 million followers. Brooklyn, the son of footballer David Beckham and former Spice Girl, Victoria Beckham, married Nicola Peltz in 2022, the daughter of American billionaire businessman Nelson Peltz and former model Claudia Heffner Peltz. \n                  David and Victoria Beckham recreate purple wedding look for 25th anniversary\n                 \n                  Nicola Peltz Beckham denies claims of a 'feud' with Victoria Beckham over wedding dress\n                 \n                  Brooklyn Beckham:  David shares first pictures of son's wedding to Nicola Peltz, telling US actress 'welcome to the family'\n                 The couple live together in Los Angeles. Sky arts and entertainment correspondent, Katie Spencer, said the distance between him and his family had been interpreted in the media as evidence of her controlling influence. Ms Spencer said today's statement was about challenging that suggestion. \"He has made this extraordinary six-page statement saying that the narrative that his wife is controlling him is completely backwards,\" she said. She also highlighted how the rift in the Beckham family had become evident from their public appearances. She said: \"The publicity surrounding the Beckhams is they present a united front. \"The whole family turn out for family gatherings, they are photographed and what have you, and since the eldest son of the Beckhams has been married, he hasn't really popped up at a lot of these sorts of family events. \"He was noticeably absent from significant events like his dad's 50th. There was no comment made when his dad was knighted. \"At Christmas, the papers reported that he'd blocked his mum for liking quite a sort of innocuous, innocent post that he'd made about cooking.\" She added: \"So often they [David and Victoria] have controlled when and where we hear from them. \"They have opted more recently to speak in their own documentaries, rather than give loads of interviews to the press. \"So this is a very different side to the Beckham family that we are seeing.\" It has been widely reported that Brooklyn did not attend his dad's birthday celebrations.Brooklyn now claims he was in the UK, but that his dad only agreed to see him under the condition that his wife was not invited. David and Victoria Beckham have been contacted for comment."
    },
    {
        "title": "Prince Harry: It's his biggest case against the press and the stakes are high for the duke and the publisher of the Daily Mail ",
        "description": "He's spent years fighting the tabloids, but arriving at the High Court was a moment Prince Harry wanted the cameras to capture.",
        "url": "https://news.sky.com/story/prince-harry-its-his-biggest-case-against-the-press-and-the-stakes-are-high-for-the-duke-and-the-publisher-of-the-daily-mail-13496351",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7139526.jpg?20260119101141",
        "type": "UK",
        "Author": "Laura Bundock",
        "Date Published": "2026-01-19 19:39:00",
        "Headline": "The Duke of Sussex and other household names - including Sir Elton John and Elizabeth Hurley - are suing the publishers of the Daily Mail over alleged historical privacy breaches in a landmark trial at the High Court.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n He's spent years fighting the tabloids, but arriving at the High Court was a moment Prince Harry wanted the cameras to capture. This is his last legal challenge against the British press. It's also his biggest, and with reputations on the line, the stakes for all sides are high. Day one, and the battlelines are being bullishly drawn. What happened on day one - recap Harry and the other high-profile co-claimants all allege that Associated Newspapers (ANL) published stories about them using information that was illegally obtained by private investigators hacking phones, deceptively \"blagging\" private information and planting bugs in homes and cars. Their barrister told the court there was a culture of unlawful information gathering at ANL. That its use was \"clear, systemic and sustained\". He also claimed the newspaper group knew what had been going on and knew there were \"skeletons in the closet\". ANL strongly denies any wrongdoing, insisting its stories were properly sourced, with Harry's own friends often the source of the leak. We now know that Prince Harry's claim centres around 14 articles published between 2001 and 2013. Many focus on his relationship with Chelsy Davy. He says the intrusion was terrifying, creating distrust and suspicion, and leaving him paranoid beyond belief. The Duke of Sussex seemed upbeat as he arrived and left the High Court. He spent the day sitting quietly in court 76 listening intently. These legal challenges have become his personal crusade. He once said changing the media landscape would be his life's work. That work is well under way. 👉 Listen to Sky News Daily on your podcast app 👈 But this claim against the Mail could be his most challenging. It will pitch the prince against one of Fleet Street's most fearsome editors, Paul Dacre. Neither wants to back down and both will soon have their moment in court. With all the claimants due to give evidence, this nine-week case has a long way to run. Read more on Sky News:Harry vs the Daily Mail explainedHarry's security set-up review Prince Harry certainly seems more relaxed. He smiled and waved as he arrived at court. He's already secured a victory and apologies from two other tabloids - winning in part his case against the Daily Mirror and settling with The Sun. His last chapter is just beginning; this is his final chance to try and expose what he believes are the dark arts of British newspapers. ANL are ready to defend its journalism. No wonder many are calling this the 'super case' of the year."
    },
    {
        "title": "Yorkshire Cold War nuclear bunker hangs on a cliff edge and is close to falling into the sea ",
        "description": "A Cold War nuclear bunker hanging from a cliff edge could now be just weeks, if not days, away from falling into the sea.",
        "url": "https://news.sky.com/story/yorkshire-cold-war-nuclear-bunker-hangs-on-a-cliff-edge-and-is-close-to-falling-into-the-sea-13496395",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nuclear-bunker_7139961.jpg?20260119193628",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-19 21:02:00",
        "Headline": "The bunker was built around 50 years ago, but is now close to falling into the North Sea as the coastline is eroding by more than 6ft a year",
        "Content": "A Cold War nuclear bunker hanging from a cliff edge could now be just weeks, if not days, away from falling into the sea. The bunker - built around 70 years ago as a look-out post - is precariously hanging off the Holderness coastline in Tunstall, East Yorkshire. Amateur historian Davey Robinson, who is using a drone to film its final days, told Sky News's The UK Tonight with Sarah-Jane Mee programme: \"We were first told about it back in 2025 - it was quite wedged into the cliff still at that point. \"After that, we kept popping back. \"In November, we went and had a look. Four weeks later, we popped back and it had sunk down a foot and a half. \"You can go back to 2003 on Google Earth - it's unbelievable how much land has gone.\" Read more from Sky News:How the Spain crash unfoldedWhat did Trump write to Greenland? \n                  Body recovered in search for teenager swept into sea\n                 \n                  Footage of explosion as ship crashes into tanker shown in court\n                 \n                  Mother named as victim of Withernsea drowning, daughter still missing\n                 East Riding of Yorkshire Council urged people to avoid the area amid fears that it could go any day. They have told residents to always \"maintain a safe distance to the base of eroding cliffs due to the risks associated\". Known as the Tunstall ROC (Royal Observer Corps) Post, the bunker is believed to have been built in 1959 - before it was decommissioned in the early 1990s. It comes as the Environment Agency warns that East Yorkshire has some of the fastest eroding coastline in the UK. The Holderness coastline is eroding at an average annual rate of about 6.5ft (2m), they claim."
    },
    {
        "title": "'Nowhere to hide' for water companies, vows government in industry shake up",
        "description": "The creaking water industry is set for a \"once-in-a-generation set of reforms\", the government has said as it proposes new legislation to overhaul the system.",
        "url": "https://news.sky.com/story/nowhere-to-hide-for-water-companies-vows-government-in-industry-shake-up-13496279",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mogden-sewage-treatment_6969742.jpg?20250721101325",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-19 15:18:00",
        "Headline": "Water companies to be subject to \"MOTs\" under new government plans aiming to preempt rather than remedy major failures, such as the recent water shortages in south-east England.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The creaking water industry is set for a \"once-in-a-generation set of reforms\", the government has said as it proposes new legislation to overhaul the system. Nightmare situations such as taps running dry in Kent and Sussex recently would be avoided, the government says, thanks to a new proactive system that would perform \"MOTs\" on water companies to preempt major failures. Ministers are set to unveil a series of reforms in parliament on Tuesday as they move ahead with a major shake-up in the industry in England and Wales, including abolishing the current system of overlapping regulators. Public confidence in the old way collapsed as sewage spills grew and pipes crumbled, while water company bosses enjoyed ever bigger bonuses. The new plans, outlined in a White Paper on Tuesday, would create one single regulator, as well as an ombudsman to make it easier for bill-payers to complain about their suppliers. But campaigners and the water industry have warned the proposals won't come in soon or reach far enough. 'Nowhere to hide' \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  What UK social media ban on children could look like - as government considers action\n                 \n                  What it's like to live next to a 25,000 tonne illegal waste dump\n                 The environment secretary Emma Reynolds called the proposals a \"once-in-a-generation set of reforms\" to tackle water pollution and \"poor performance by water companies\". Under the government's proposals, water companies will have to perform health checks on their infrastructure to proactively identify problems with pipes or sewage treatment works before they fail. A new chief engineer at the regulator will also bring back hands-on checks of infrastructure, something not seen for 20 years. Ms Reynolds told Sky News: \"We're going to move away from a system whereby water companies mark their own homework to having a new regulator - abolishing Ofwat - with more teeth, so that there'll be nowhere to hide for poor performance.\" It comes as complaints to the consumer body, the Consumer Council for Water, rose 50% in the last year while trust hit an \"all time low\". Its chief executive Mike Keil said: \"The miserable disruption inflicted on people in parts of Sussex and Kent in recent weeks underlines why meaningful change in the way water companies are regulated and treat their customers is desperately needed.\" He welcome the proposed new ombudsman, which would have legal powers to resolve disputes and force water companies to compensate for problems. Public outcry over water companies The planned changes come as part of the government's response to public fury over rising bills, sewage pollution and large payouts for executives. Last year it commissioned an independent review that made 88 recommendations to repair one of the world's only fully privatised water systems. But it ruled out re-nationalisation of the water industry, which it sees as too expensive and disruptive, but which some campaigners say is the only solution. James Wallace, CEO of River Action, said the government \"recognises the scale of the freshwater emergency, but lacks the urgency and bold reform to tackle it\". He said none of the proposals would \"make a meaningful difference\" without tackling privatisation, which is the \"root cause of this crisis\". Water companies also warned the changes might come in too slowly. The government expects them before the next general election, but can't yet put a date on it. A spokesperson for the industry body Water UK said: \"We cannot afford for any more long-term decisions to be taken by a system everyone knows has failed. \"The need for major reform has long since been agreed. Delivery now needs to catch up.\" The proposals so far were also light on reforms to other sectors that pollute Britain's waterways, such as farms, housing and roads - though more detail is expected in the White Paper on Tuesday."
    },
    {
        "title": "'Crimes are going unpunished,' say government sources - with too many officers pulled off street",
        "description": "Local police forces are not equipped to fight crime, government sources have told Sky News, with thousands of officers pulled off the street into desk jobs in the past decade.",
        "url": "https://news.sky.com/story/crimes-are-going-unpunished-say-government-sources-with-too-many-officers-pulled-off-street-13496379",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-polic-police-officers_7140137.jpg?20260120002533",
        "type": "UK",
        "Author": "Ali Fortescue",
        "Date Published": "2026-01-19 20:26:00",
        "Headline": "It comes after figures reveal thousands of officers are moved from the frontline to the back office.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n Local police forces are not equipped to fight crime, government sources have told Sky News, with thousands of officers pulled off the street into desk jobs in the past decade. \"Crimes on our streets are going unpunished\" and are \"plaguing communities\", a senior source warned, as the government prepares to announce significant reforms to policing this month. Home Office figures shared with Sky News show the number of trained uniformed police officers in back-office roles like HR and IT support has surged by 40% in the past six years to more than 12,600. Meanwhile, the number of visible frontline officers has fallen to around 67,000, down from more than 70,000 a decade ago. Government sources blamed \"arbitrary\" headcount targets, which they suggest incentivise hiring officers to desk jobs. The Officer Maintenance Grant, introduced under Boris Johnson's government, is expected to be scrapped and replaced with protected funding for neighbourhood officers. It comes as the Metropolitan Police Commissioner Sir Mark Rowley has called for a dramatic overhaul of the policing system as he said the current model is \"out of date\". Speaking to Sky's Trevor Phillips, Sir Mark said he believed there should be a reduction in the 43 police forces across England and Wales as a shake-up of the system is \"overdue\". Shoplifting top of public concern Internal Home Office polling, shared with Sky News, found that shoplifting is the crime people worry about most, along with anti-social behaviour, including concerns about drugs and knife crime. Shop theft has risen by 72% since 2010 and reached record levels in the year ending March 2025, with fewer than one in five incidents resulting in a charge. A government source admitted many town centres feel \"abandoned\" as officers are \"increasingly burdened by bureaucracy and stuck behind desks instead of out on the frontline\". They said \"criminals feel they can cause havoc on our streets with impunity\". 'A reactive service' The government has pledged 13,000 more neighbourhood officers by the end of the parliament and has committed to a record £18.4bn police funding settlement announced last week. Policing has become a \"reactive service focused on crisis response, rather than fighting crime\", a government source said."
    },
    {
        "title": "Social media ban for children being considered by UK government",
        "description": "Ministers are launching a consultation on banning under-16s from social media after coming under pressure from dozens of their own backbench MPs.",
        "url": "https://news.sky.com/story/ministers-to-launch-consultation-on-australia-style-under-16s-social-media-ban-13496366",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pupils-phone_7129375.jpg?20260107181913",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-19 19:44:00",
        "Headline": "The education secretary is also issuing stronger guidance to schools about banning mobile phones, which will come into effect from the summer term.",
        "Content": "Ministers are launching a consultation on banning under-16s from social media after coming under pressure from dozens of their own backbench MPs. After initially opposing such a ban, the government's position softened in recent days, and ministers will now consult on whether to bring in an Australia-style policy. Read more: How Australia's social media ban works The consultation will also explore ways to improve the accuracy of age assurance technology to enforce minimum age limits for certain content, assess whether the digital age of consent is too low, and examine removing or limiting certain functions that drive addictive behaviours, such as social media \"streaks\" and the ability to scroll infinitely. The Department for Education is also publishing strengthened guidance on the use of mobile phones in schools in England, making it clearer they should be \"phone-free environments\" - but will not be legislating for a total ban. Another Starmer U-turn? These announcements come after Labour MPs, campaigners, and the Conservative opposition put pressure on the government to do more to protect young people online. Although Sir Keir Starmer was initially opposed to a blanket ban on under-16s being on social media, his hand was likely to be forced on Wednesday by a vote in the House of Lords on a Tory amendment to the Children's Wellbeing and Schools Bill, which would regulate social media platforms \"to use highly-effective age assurance measures to prevent children under 16 from accessing services\". If passed, it would then be debated in the Commons, and one Labour MP told our political reporter Faye Brown there was \"no way\" the government could whip the Parliamentary Labour Party against it, which could trigger another welfare-style rebellion - something ministers hope this consultation will avoid. The amendment has been tabled by Conservative former schools minister Lord Nash, who said the government's announcement of a consultation \"offers nothing for the hundreds of thousands of parents, teachers, medical professionals, senior police officers, national security experts and parliamentarians of all parties who have been calling for a raising of the age limit for social media\". He added: \"The longer we delay, the more children we fail. I continue to urge all peers to back my amendment on Wednesday, which would begin to end the catastrophic harm being done to a generation.\" Esther Ghey, mother of the murdered teenager Brianna, and other bereaved parents, also wrote to the prime minister and other party leaders on Tuesday, urging them to back Lord Nash's amendment, saying it \"sends an important and unambiguous message that social media is not appropriate for children under the age of 16\". We are prepared to take action, says minister Technology Secretary Liz Kendall has issued a statement saying ministers already intended to go further than the existing Online Safety Act. She said: \"Through the Online Safety Act, this government has already taken clear, concrete steps to deliver a safer online world for our children and young people. \"These laws were never meant to be the end point, and we know parents still have serious concerns. That is why I am prepared to take further action. \"Technology has huge potential - to create jobs, transform public services and improve lives. But we will only seize on that potential if people know they and their children are safe online. \"We are determined to ensure technology enriches children's lives, not harms them - and to give every child the childhood they deserve.\" 'Phones have no place in schools' More immediately, the government is strengthening the guidance on the use of mobile phones in schools in England, making it clearer that they should be \"phone-free environments\" - but stopping short of an outright ban in law. Ofsted will now examine individual schools' policies on mobile phones and how effectively they are implemented when judging behaviour during inspections, and support for schools available to those struggling to implement bans. Data from the department shows that 99.9% of primary schools and 90% of secondary schools already have mobile phone policies in place - but 58% of secondary school pupils reported mobile phones being used without permission in at least some lessons, rising to 65% of pupils aged 14 to 16. Education Secretary Bridget Phillipson said: \"We have been clear that mobile phones have no place in our schools, but now we're going further through tougher guidance and stronger enforcement. \"Our Attendance and Behaviour Hubs will support schools that are struggling to effectively implement phone bans so all our children can learn in phone-free environments.\" Ofsted boss Sir Martyn Oliver added: \"My message to headteachers is you now have all the backing - and the backing of my inspectors - to ban mobile phones in schools immediately.\" The new guidance will come into effect from the start of the summer term after Easter. Chris Sherwood, chief executive at the NSPCC, welcomed the government consultation, saying tech companies \"have prioritised profit over children's safety\". \"Taking forward measures to ensure products are safe by design would be a vital step in redressing that balance,\" he added."
    },
    {
        "title": "Prince Harry v Mail: Publisher accused of 'wrecking lives', as string of high-profile figures mentioned in court",
        "description": "Prince Harry has personally attended the first day of his trial against Daily Mail publisher Associated Newspapers Limited (ANL) at the Royal Courts of Justice in Central London.",
        "url": "https://news.sky.com/story/prince-harry-v-mail-publisher-accused-of-wrecking-lives-as-string-of-high-profile-figures-mentioned-in-court-13496303",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7139524.jpg?20260119101124",
        "type": "UK",
        "Author": "Bethany Minelle and Gemma Peplow, arts and entertainment reporters",
        "Date Published": "2026-01-19 16:27:00",
        "Headline": "Prince Harry was in court, along with Liz Hurley, her son Damian, and Sadie Frost, as the court heard the publisher had spent more than £3m on private investigators. ANL strongly denies any wrongdoing.",
        "Content": "By Bethany Minelle and Gemma Peplow, arts and entertainment reporters  Prince Harry has personally attended the first day of his trial against Daily Mail publisher Associated Newspapers Limited (ANL) at the Royal Courts of Justice in Central London. He, along with co-claimants Sir Elton John and his husband David Furnish, campaigner Baroness Doreen Lawrence, politician Sir Simon Hughes, and actresses Sadie Frost and Liz Hurley, all allege ANL had a practice of \"clear systematic and sustained use of unlawful information gathering\". Allegations range from tapping their phones and bugging their homes to obtaining medical records by deception. ANL strongly denies any wrongdoing. Monday saw the opening arguments from the claimants - all represented by barrister David Sherborne - who said the publisher \"knew they had skeletons in their closet,\" telling the court the Daily Mail and Mail on Sunday were engaged in unlawful information-gathering (UIG) over \"at least two decades\". He also said ANL's denials of unlawful acts to the Leveson Inquiry in 2011 were \"not true\". In written submissions, Mr Sherborne said alleged unlawful acts \"range through a period from 1993 to 2011, even continuing beyond until 2018.\" Written submissions from the claimants accused the publisher of having a \"culture of unlawful information gathering that wrecked the lives of so many\". Analysis: His biggest case against the press - and the stakes are high Along with stories about the seven claimants, articles about other high-profile figures, including former home secretary David Blunkett, comedian Ronnie Barker's son, actress Billie Piper and her ex-husband Chris Evans and Tony Blair's son, Euan, were also brought up in court. Documents released by the court showed that ANL journalists had spent well in excess of £3m on private investigators in the relevant period, including thousands of pounds paid to a \"talented\" voice actor, known as a \"blagger\" (someone, often a private investigator, who obtains private, confidential information by deception). Prince Harry left 'paranoid' and 'isolated,' court hears Prince Harry's case is based on 14 articles, published between 2001 and 2013, including several articles about his then-girlfriend Chelsy Davy, and another about the princes' distress over photos of their late mother, Princess Diana, in her final moments, published in an Italian magazine. Mr Sherborne said: \"It is evident from the articles and the evidence of the Duke of Sussex that the targeting of him has had a profoundly distressing effect\". He said episodes of pleaded unlawful information gathering were described by the royal as \"disturbing to feel that my every move, thought or feeling was being tracked and monitored just for the Mail to make money out of it\", and an \"intrusion [that] was terrifying\" for loved ones. Mr Sherborne went on to say Prince Harry said it created \"a massive strain\" on personal relationships, while invidiously \"creating distrust and suspicion\", and \"driving me paranoid beyond belief, isolating me\". Prince Harry will give evidence in court on Thursday. In written submissions, the royal said: \"I find it deeply troubling that Associated used phrases such as 'sources', 'friends' and the like as a device to hide unlawful information-gathering.\" However, in response to Harry's claims, ANL said in their written submissions: \"At all material times, the Duke of Sussex's social circle was known to be a good source of leaks or disclosure of information to the media about what he got up to in his private life.\" Sadie Frost describes 'violation' in written submission Deeply personal details about actress Sadie Frost were detailed in her claim, which the court will later hear, including her diagnosis of an ectopic pregnancy and subsequent termination. Documents released by the court included what Frost said were \"verbatim quotations\" from phone conversations with her then-husband Jude Law, including a \"heated argument\" about his then-girlfriend Sienna Miller and details over their childcare, which were then used to inform articles published by ANL. Describing her distress in a written submission, Frost said: \"The stories they wrote violated me, my friends and family, and my children who were still so small, and they made me believe that I could not trust anyone. They were always written so close to home, like it was someone who knew me really well that was talking to the journalists. That is what I suspected at the time.\" Sir Elton and David Furnish 'outraged' by alleged theft In written submissions, Sir Elton and Mr Furnish - whose case includes articles with details about their sons and Sir Elton's health - said they felt their home and the safety of their children had been \"violated\" by alleged unlawful news gathering. The court was told the couple, who followed Monday's proceedings on a live video-link, also felt \"outrage\" at the alleged \"stealing\" of their son Zachary's birth certificate and medical details after he was born. Baroness Lawrence - the mother of murdered teenager Stephen Lawrence - said she felt like a \"victim all over again\", adding, \"I remember feeling like I could not even grieve the injustice of what was happening privately, even for a day, or to prepare my children for the news before the world found out.\" ANL say the information was gathered in legal ways, including journalists' contacts, spokespeople, freelance journalists, photographers, news agencies and prior newspaper and magazine articles. Antony White KC, for ANL, also told the court it was \"a striking feature of the case that none of the articles were the subject of complaint by the claimants at the time of publication\". Arts and entertainment correspondent Prince Harry and the other claimants in this case are adamant the stories they are bringing forward contain information that could only have been gathered unlawfully. The publishers of the Daily Mail, however, maintain their journalists always used legitimate sources. Here's a look at some of the headlines.  Harry takes Chelsy on make-or-break holiday  This article, published by the Daily Mail on 8 December 2007, is one of 14 that Harry is bringing before the court. It includes intimate details of the romantic relationship he was in at the time with Chelsy Davy, such as details of their holiday in Africa and her plans to quit university. Now, Harry says the only conceivable way to find out information such as flight details was to do so through his partner, because he flew under a pseudonym, and that neither he nor Ms Davy were sharing private information with others. But the journalist who wrote the story claims her information came from sources she developed at Leeds University who were friends with Ms Davy.  Princes and Palace clash on 'all-night' Diana Party  This article, published in the Mail on Sunday on 20 May 2007, was about alleged tensions in the Royal Household over plans to hold an event after a memorial concert for Princess Diana, and hopes that Sir Elton John would attend.  Sir Elton says he was having private, direct conversations with Prince Harry only – so how could the newspaper know? Well, the Mail's journalist says it's highly likely to have been sourced from information provided by Lady Elizabeth Anson - a first cousin of the late Queen, who worked as a party planner.  Elton: I'm the daddy; He is named the 'Father' of surrogate son on official document – and David Furnish is 'Mother'  Sir Elton and David Furnish say this article, published in the Daily Mail on 30 December 2010, was homophobic in tone and that they were shocked at how the Mail had been able to obtain a copy of their son's birth certificate before they did. They alleged this was done through blagging – in other words, someone pretending to be either them or someone close to them. But not so, argues the Mail - thenewspaper says the article's writer telephoned the local registrar's office and introduced himself as a journalist.\n  Mummy's little boy - But 'Daddy' is still in denial as Liz gives birth  The Daily Mail had exclusive information on the birth of Hurley's baby - confidential medical information - in this article published in April 2002. The actress says these details could only have come from private conversations. However, one of the arguments from the Mail journalist who wrote the story is that it was partly written from a news agency report that was later recalled, but also that Hurley herself had been talking openly about the birth around that time. The case was brought in 2022, and the following year, ANL failed to have the case thrown out on the basis that it was \"time-barred\" or brought too late. It is Prince Harry's third battle with the UK press, following his win against Mirror Group Newspapers in 2023. He settled a claim against News Group Newspapers, the publisher of the Sun and the now-defunct News Of The World, last January. The trial, which is expected to last nine weeks, continues."
    },
    {
        "title": "Trump's extraordinary letter to Norway about Greenland - in full and fact-checked",
        "description": "The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary. ",
        "url": "https://news.sky.com/story/trumps-extraordinary-letter-to-norway-about-greenland-in-full-and-fact-checked-13496272",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-greenland_7127625.jpg?20260106015144",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2026-01-19 15:40:00",
        "Headline": "Sky News went through Donald Trump's letter to his Norwegian counterpart on the issue of Greenland to fact check the president's claims.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary.  In it, the US leader rails against the decision not to award him the Nobel Peace Prize and repeats his threats over Greenland. Here is the full text - click on highlighted words and phrases for context and fact-checking: Read more:The misunderstanding that may have triggered latest Greenland threatWhat Trump tariff threat could mean for Europe Mr Trump's message was issued in response to a text he received from Norway's Prime Minister Jonas Gahr Stoere. Mr Stoere sent the message on behalf of himself and Finnish President Alexander Stubb. In it, he wrote: \"Dear Mr President, dear Donald - on the contact across ‍the Atlantic - on Greenland, Gaza, Ukraine - and your tariff announcement yesterday. \"You know our position on these issues. But we believe we all should ‌work to take this down and de-escalate - so much is happening around us where we ‌need to stand together. \"We are proposing a call with you later today - with both of us or ​separately - give us a hint of what you prefer! Best - Alex and Jonas.\""
    },
    {
        "title": "How deadly train crash unfolded in Spain - and why it's been described as 'truly strange'",
        "description": "A faulty rail joint may be key to understanding the cause of one of Spain's deadliest railway disasters in years, experts have said.",
        "url": "https://news.sky.com/story/spain-train-crash-how-it-unfolded-13496307",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-spain-train-crash_7139965.png?20260119194059",
        "type": "World",
        "Author": "the Sky News Data &amp; Forensics team",
        "Date Published": "2026-01-19 16:45:00",
        "Headline": "The Sky News Data & Forensics team has pieced together how the worst rail disaster in Spain since 2013 came about.",
        "Content": "By the Sky News Data & Forensics team  A faulty rail joint may be key to understanding the cause of one of Spain's deadliest railway disasters in years, experts have said. At least 40 people were killed and 159 injured in a high-speed collision between two trains on Sunday. Here, the Sky News Data & Forensics team looks at how the crash unfolded. Follow Spain train crash updates live A timeline of the crash Before the crash, a train run by private company Iryo and carrying around 300 passengers departed from Malaga on a journey to the capital Madrid at 6.40pm (5.40pm GMT). The other train, which was carrying nearly 200 people and managed by Spain's public train company Renfe, departed Madrid for Huelva in the south at 6.05pm local time (5.05pm GMT). Around 7.45pm local time (6.45pm GMT), the tail end of the first train travelling from Malaga to Madrid derailed and jumped onto the opposite side of the tracks. It then crashed into the other train near the town of Adamuz in the province of Cordoba, around 230 miles south of Madrid. At the time of the crash, both trains were travelling at more than 120mph. Footage showed passengers climbing out of smashed windows after the crash, with emergency services on the scene. The injured were taken to a nearby hospital. 'A truly strange' incident Spain's transport minister Oscar Puente said the cause of the crash was unknown, but called it \"a truly strange\" incident because it happened on a flat stretch of track that had been renovated in May. He said the back of the Iryo train had derailed and then veered across the other track, slamming into the front of the Renfe train and knocking its first two carriages off the track and down a 4 metre slope. The worst damage was to the front section of the Renfe train, he added. Mr Puente shared a picture showing the system used to monitor the infrastructure and movement of all trains along the network. The map showed the live positions of the two trains just under two hours after the crash happened, with red lines indicating the track was blocked. Investigators say faulty joint could be key to crash An initial investigation has identified a faulty joint as key to the train crash, Reuters reported, citing a source. The news agency said technicians identified some wear on the joint between sections of the rail, known as a fishplate, which they said showed the fault had been there for some time. Ian Prosser, former HM chief inspector of railways, said the derailment was most likely due to a track issue, such as a broken rail. \"The most likely case would be a track fault of some sort or something went wrong with the train,\" he said. \"But that would be very rare.\" High-speed train crashes on straight rail lines, as happened in this case, are also rare, Mr Prosser said. \"It takes quite a long time for a train to actually come and sort of stop,\" he added. \"So at that speed would be travelling for quite some time after the actual initial impact.\" Human error 'ruled out' Earlier, the president of Spain's national railway company Renfe, Alvaro Fernandez Heredia, had said \"human error could be ruled out\". The Iryo train had been built in 2022, with its last inspection carried out on 15 January this year. The track the crash occurred on was also new, having been completely renovated last May, with an investment of €700m (£607m). However, it still had issues, with a Spanish train drivers' union warning rail operator Adif of the heavy wear and tear on the tracks, including the one where the two trains collided, in a letter last August. In October last year, rail unions approached the government to request a reduction of speed to avoid accidents on the line. Spain's rail safety record Spain's railway safety agency (AESF) has recorded between 42 and 98 significant rail accidents per year since 2006, with the most accidents in 2007 and 2023, at 98 and 77 respectively. Those years saw a particularly high number of level crossing and personal injury accidents, with the agency highlighting the notably lower figure for 2024, at 57 compared with 77, was mainly due to a reduction in those types of incidents rather than in collisions and derailments. In 2024, one in five incidents in Spain were caused by derailment - five times the EU average of 4%, with the country recording a smaller proportion of level crossings and other personal injury incidents than the EU average. Some 18 people were killed in railway accidents in Spain in 2024, the equivalent of around one person per 1,000km of railway tracks, leaving Spain among the countries with the lowest level of rail fatalities in the EU, according to the European Commission. The worst Spanish railway accident this century was a train derailment in Santiago de Compostela in July 2013, which killed 79 people. Prosecutors set to open criminal probe as soon as possible Sources from Spain's interior ministry told Sky News local prosecutors are waiting for the report from police, and are then set to open a criminal probe as soon as possible. Asked by reporters how long an inquiry into the crash's cause could take, the transport minister Mr Puente said it could be a month. Spain's Prime Minister Pedro Sanchez expressed his condolences to the victims' families in a post on X, writing: \"Tonight is a night of deep pain for our country.\" On Monday night, as many of the injured left hospital, some family members were still scouring social media and hospitals for more information about their missing loved ones. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "What we know so far about the fatal train crash in Spain",
        "description": "At least 40 people have been killed and 170 others injured after two high-speed trains derailed in southern Spain on Sunday.",
        "url": "https://news.sky.com/story/what-we-know-so-far-about-the-fatal-train-crash-in-spain-13496110",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-spain-train-crash_7139395.jpg?20260119081944",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-19 08:45:00",
        "Headline": "The number of people killed has been rising since the crash on Sunday night, with Spain's transport minister warning the count is \"not final\".",
        "Content": "At least 40 people have been killed and 170 others injured after two high-speed trains derailed in southern Spain on Sunday. The trains, travelling to and from Madrid, crashed in Adamuz with hundreds of passengers on board. Here's everything we know so far. How did the crash happen? Iryo, a high-speed train operator in Spain, said its 6189 service was travelling between Malaga and Madrid with around 300 people on board when it derailed. After derailing, it jumped on to the track in the opposite direction and hit an oncoming train carrying around 200 passengers travelling from Madrid to Huelva. The Iryo train was travelling at about 130mph, while the second train was travelling at roughly 127mph, sources from the Spanish transport ministry told Sky News. Follow Spain train crash updates live Spain's railway infrastructure company ADIF said the crash happened at 7.45pm (6.45pm UK time), about 10 minutes after the Iryo train left Cordoba. The second train, which took the brunt of the impact, was operated by Spain's public train company Renfe. Spain's transport minister Oscar Puente said the back part of the first train derailed and slammed into the head of the other train, knocking its first two carriages off the track and down a four-metre slope. The worst damage was to the front section of the Renfe train, he said. While the Iryo train had been evacuated within hours of the incident, the Renfe carriages were badly damaged, with twisted metal and people trapped, according to Cordoba fire chief Paco Carmona. \"We have to remove the bodies to reach anyone who is still alive. It is proving to be a complicated task,\" he told Spanish outlet RTVE. Number of people killed 'not final' The number of people killed has been rising since the incident, and transport minister Mr Puente suggested this would continue throughout Monday morning. Posting on social media on his way to the site, he said the count of people killed was \"not final\". El Pais newspaper reported that the 27-year-old driver of the Madrid to Huelva train was among those killed. The Andalucian emergency services said 122 patients had been treated for injuries, with 43 still in hospital as of Monday afternoon, while the rest had been discharged. Among those in hospital, 12 were in intensive care, they said. What caused the crash? Officials have said the cause of the crash is still unknown, with Mr Puente calling it \"a truly strange\" incident. He noted that the derailment occurred on a flat stretch of track that had been renovated in May. Fernandez Heredia, the president of Renfe, said it was \"too early\" to know the cause, adding the incident was particularly unusual because it occurred on a straight section of the track, with active safety systems. The Iryo train, which was the first to come off its tracks, was last inspected four days ago, the affected parent company, Italy's Trenitalia, confirmed to Sky News. \"We already know from the speed records that the trains were travelling at a speed lower than that assigned to the section,\" he said. He suggested the cause could be related \"to some issue with the rolling stock or the infrastructure\". Sources from Spain's interior ministry told Sky News that local prosecutors are waiting for the report from police and are then set to open a criminal probe as soon as possible. An investigation into the cause of the incident could take around a month. 'There were people screaming' Passengers on the trains have been describing their experiences. Bianca Birleanu, 23, who was travelling on the train from Madrid to Huelva, told Spain's El Pais newspaper: \"We felt the first jolt and, in a fraction of a second, another very strong one. \"The table in front of our seat fell on top of us, the lights went out, and the carriage roof collapsed.\" Her partner, Jorge Garcia, also 23, added: \"Carriage number two was all rubble, a mangled mess. And the other one was also badly damaged, everything was destroyed.\" Another passenger on the second train, who was not identified, told public broadcaster RTVE: \"There were people screaming, their bags fell from the shelves. I was travelling to Huelva in the fourth carriage, the last, luckily.\" Salvador Jimenez, a journalist for RTVE who was on board the Iryo train, said passengers used emergency hammers to smash the windows and climb out. One eyewitness recounted how he carried a boy on his back after the crash, and told reporters on Sunday night that he was still looking for the boy's mother and a friend of his, who were with him on the train. What's happening now? All high-speed train traffic between Madrid and Andalusia has been suspended because of the incident. Services between Madrid, Cordoba, Seville, Malaga, Huelva, Cadiz, Algeciras, and Granada will remain suspended at least for the rest of Monday, according to ADIF. ADIF, Renfe and Iryo have said they have set up support spaces at some of the affected stations to assist relatives of the victims, and have made psychological support available. Spain's prime minister Pedro Sanchez has declared three days of mourning for the victims, starting from midnight on Monday and running through to Thursday. \"Today is a very painful day for all of us,\" he said during a news conference held by the site of the crash on Monday afternoon. \"I would like to offer you... the warmest embrace from all of us,\" Mr Sanchez said, addressing \"the victims, the families, the loved ones and those left behind\". He promised \"full transparency\" in uncovering the causes behind the accident, adding: \"We will get to the truth. We will find the answers.\""
    },
    {
        "title": "Trump to take advantage of deal-making paradise in Davos following Greenland threat",
        "description": "This time last year Donald Trump was beamed into Davos from Washington to deliver a virtual address that put business and political leaders on notice; the free-trading, liberal economic model, reaffirmed and celebrated every January at the World Economic Forum, was over.",
        "url": "https://news.sky.com/story/trump-to-take-advantage-of-deal-making-paradise-in-davos-following-greenland-threat-13496293",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-wef-davos_7139806.jpg?20260119155906",
        "type": "World",
        "Author": "Paul Kelso",
        "Date Published": "2026-01-19 16:09:00",
        "Headline": "The most valuable deals at the World Economic Forum this week may be diplomatic.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n This time last year Donald Trump was beamed into Davos from Washington to deliver a virtual address that put business and political leaders on notice; the free-trading, liberal economic model, reaffirmed and celebrated every January at the World Economic Forum, was over. Back then, shell-shocked European leaders and central bankers emerged from the hall wondering if he was serious. Twelve months on, there can be no doubt, and the US president will be in the Alps in-person to emphatically underline the point. President Trump will lead an 80-strong US delegation including five members of the cabinet and his most influential policy and diplomatic advisors. Money latest: Market sell-off deepens after Trump threat to Europe It amounts to an almighty American flex at what remains the highest-powered intersection of global business and politics, and he arrives with policy chaos flowing in his slipstream like contrails from Air Force One. The tariffs threatened against Greenland's Nordic and northern European allies, including the UK, are both the most serious rift in transatlantic relations in decades, and just another expression of the president's willingness to deploy economic weapons against allies as well as adversaries. It comes just a fortnight after the return of US gunboat diplomacy in Venezuela, where the prize is not apparently democracy but oil, with 50 million barrels as a down payment. And all of this as economies were recalibrating following the indiscriminate 'Liberation Day' tariffs of last April. What happens next, as ever, depends in large part on Trump, but Davos at least provides a platform for negotiations. The leaders of six of the G7 nations will be in Switzerland this week - Sir Keir Starmer is the odd one out, although that could change - along with senior executives from major players in tech, banking and investment, oil and gas, and mining. French President Emmanuel Macron will set out his position in a speech on Tuesday, as will EU President Ursula Von der Lyon. In between they will hear from Chinese Vice Premier He Lifeng, one of the few who may be enjoying the spectacle of old Atlantic allies at each others' throats. Read more:Trump's extraordinary letter to Norway about Greenland - in full and fact-checkedGreenland row: What Trump tariff threat could mean for Europe's economies Trump's presence was always going to shape this edition of the WEF's annual meeting, although the diplomatic focus was expected to be Ukraine, and the prospect of a reconstruction deal leveraging western capital for post-war reconstruction. Volodymyrr Zelenskyy may once again have to vie for American attention. Part conference, part trade fair, part global summit, Davos has become infamous precisely because it draws the richest and most powerful, and you don't have to be a cynic to wonder what really goes on here. Publicly it is largely a talking shop, with myriad panels and discussions promising thought leadership on themes that broadly support the WEF's neo-liberal economic mission - to save the world and get rich trying (I paraphrase). Behind the scenes it is a deal-making paradise. A measure of Davos's role in greasing the wheels of commerce is the number of blue-chip chief executives who attend religiously every year without ever making a speech, appearing on a public panel or answering a journalist's question. \"I can do more valuable meetings in three days in Davos than in three months at home,\" says one chief executive. Among those hustling for a share of the action are governments eager to make the case for investment to corporations who can deliver capital, jobs and growth. Chancellor Rachel Reeves will lead the British delegation this year, appearing on panels and scheduled to hold a round-table meeting with bosses convened by Jamie Dimon, head of JPMorgan, one of the world's largest banks. She will hope to get a hearing above the diplomatic noise, but this year the most valuable deals sealed in the snow may be political."
    },
    {
        "title": "Fighting erupts near prisons holding IS extremists in Syria a day after Kurdish-led SDF agreed ceasefire with Damascus",
        "description": "Fighting has broken out between Syrian government troops and the Kurdish-led Syrian Democratic Forces (SDF), just a day after a ceasefire was announced by the country's state media.",
        "url": "https://news.sky.com/story/fighting-erupts-near-prisons-holding-is-extremists-in-syria-a-day-after-kurdish-led-sdf-agreed-ceasefire-with-damascus-13496377",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-syrian-raqqa_7139985.jpg?20260119201517",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-19 20:17:00",
        "Headline": "Several SDF fighters were killed in the battles after talks failed to reach a positive outcome following days of deadly fighting during which government forces captured wide areas of northeast Syria from the group.",
        "Content": "Fighting has broken out between Syrian government troops and the Kurdish-led Syrian Democratic Forces (SDF), just a day after a ceasefire was announced by the country's state media. Several SDF fighters were killed and more than a dozen others wounded in Monday's clashes, the group said, as violence erupted around two prisons holding members of the Islamic State group in the northeast of the country. On Sunday, SDF negotiators agreed a truce in principle with Damascus, but a member of the SDF team, said to include chief commander Mazloum Abdi, told Sky News the talks failed to reach a positive outcome. The deal, which was signed remotely, appeared to end days of deadly fighting during which government forces captured wide areas of northeast Syria from the SDF. Further negotiations were due to take place on Monday, but the source said discussions broke down as fighting continued. Government forces were to blame, having violated the ceasefire, the source said, warning that if attacks persisted, SDF fighters could not disarm and must continue to defend themselves. The SDF, which was the main US-backed force that fought IS in Syria, controls more than a dozen prisons in the northeast where some 9,000 IS members have been held for years without trial. \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  Has Trump and Starmer's 'special relationship' turned toxic? \n                 \n                  Trump to take advantage of deal-making paradise in Davos following Greenland threat\n                 Among those detained are extremists thought to have been responsible for atrocities in Syria and Iraq after IS declared a caliphate in June 2014 over large parts of the two countries.Some of those being held at the Shaddadi Prison in the town of Shaddadeh took advantage of the chaos to escape, the army said in a statement. The SDF admitted it had lost control of the site, around 31 miles (50km) from the border with Iraq. Nine of its fighters were killed and 20 others wounded in fighting around another prison, al-Aqtan, northeast of the northern city of Raqqa, the group said. Read more:'Experienced terrorist' killed by US in SyriaRapper on 'massacre' in Iran A US convoy was seen entering the prison area, apparently to mediate between the two sides, an Associated Press reporter said. Washington has good relations with both sides. Earlier on Monday, the Syrian government had warned the SDF not to use \"cases of terrorism for political blackmail,\" saying it is ready to implement international law regarding the detainees. In a statement, Damascus warned the SDF's command not to help IS detainees flee or open up prisons it controls \"as a revenge measure or for political pressure\". IS was defeated in Iraq in 2017 and in Syria two years later, but the group's sleeper cells still carry out deadly attacks in both countries."
    },
    {
        "title": "Gwyneth Paltrow, Cindy Crawford and Donatella Versace lead tributes to designer Valentino",
        "description": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\".",
        "url": "https://news.sky.com/story/italian-fashion-designer-valentino-dies-13496264",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gwyneth-paltrow-valentino_7140067.jpg?20260119220310",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-19 14:31:00",
        "Headline": "Tributes pour in from leading politicians and actors for the designer - best known for creating his signature 'Valentino red'.",
        "Content": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\". He died on Monday at his home in Rome, surrounded by his loved ones, his foundation announced today. He was 93. A lying in state will be held on Wednesday and Thursday to honour him. His funeral is set to take place in Rome on Friday. Hollywood star Gwyneth Paltrow, who wore a Valentino gown for her wedding to Brad Falchuk, said on Instagram: \"I was so lucky to know and love Valentino - to know the real man, in private. \"The man who was in love with beauty, his family, his muses, his friends. His dogs, his gardens, and a good Hollywood story. \"I loved him so much. I loved how he always pestered me to \"at least wear a little mascara\" when I came to dinner. I loved his naughty laugh. \n                  Greenland latest: Trump admits he may have been misinformed over European troops in territory, Sky News told\n                 \n                  Trump's extraordinary letter to Norway about Greenland - in full and fact-checked\n                 \n                  How deadly train crash unfolded in Spain - and why it's been described as 'truly strange'\n                 \"This feels like the end of an era. He will be deeply missed by me and all who loved him. Rest in peace, Vava.\" Fashion designer Donatella Versace also said in a post: \"Today, we lost a true maestro who will forever be remembered for his art. \"My thoughts go to Giancarlo, who never left his side for all these years. \"He will never be forgotten.\" Born Valentino Garavani, he became known simply as Valentino - sharing the name with his eponymous fashion line. The label is best known for creating \"Valentino red\" - a dark shade of red that would feature heavily in their dresses. Italian Prime Minister Giorgia Meloni was among a list of leading politicians to pay tribute to the designer on social media.She said: \"Valentino, undisputed master of style and elegance and eternal symbol of Italian high fashion. \"Today, Italy loses a legend, but his legacy will continue to inspire generations. Thank you for everything.\" Deputy prime minister Antonio Tajani described him as a \"leading figure\" of global fashion in a post on X. His foundation added: \"Valentino Garavani was not only a constant guide and inspiration for all of us, but a true source of light, creativity and vision.\" Model Cindy Crawford said in a post on Instagram that she was \"heartbroken\" by his loss. She said: \"I will always be grateful for the years I had the privilege of working closely with him.\" Valentino dresses became a mainstay on Hollywood red carpets - from Reese Witherspoon, Jennifer Lopez and Cate Blanchett among the stars to have worn him. Other famous names include Julia Roberts, Princess Diana and former first lady Jacqueline Kennedy - who wore his dresses throughout her mourning period for John F. Kennedy. He later developed a friendship with Anne Hathaway - even making an appearance in 2006 film The Devil Wears Prada. Despite retiring almost two decades ago, his fashion line continues to be a staple at award shows. At this month's Golden Globe awards actors Hannah Einbinder and Colman Domingo wore outfits bearing his name. Born in Voghera, northern Italy, the designer first made his name after setting up a fashion house in Paris. He later returned to his home country to set up the fashion house alongside long-time business partner Giancarlo Giammetti. His works were best known for their opulence, often incorporating vivid colours and ornate designs at a time when much of the fashion world was looking towards minimalist design. He once famously said: \"I know what women want. They want to be beautiful.\" His career stretched from the 1960s through to his retirement in 2008."
    },
    {
        "title": "Gunmen abduct more than 150 Christians in mass kidnapping",
        "description": "Armed bandits have kidnapped more than 150 Christians in simultaneous attacks on a number of churches in Nigeria.",
        "url": "https://news.sky.com/story/gunmen-abduct-more-than-150-christians-in-mass-kidnapping-13496319",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nigeria-kidnappings_7139887.jpg?20260119174028",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-19 17:19:00",
        "Headline": "It comes after Donald Trump launched strikes against Islamic State targets in the north of Nigeria.",
        "Content": "Armed bandits have kidnapped more than 150 Christians in simultaneous attacks on a number of churches in Nigeria. The attack occurred on Sunday in Kurmin Wali, a community in the Kajuru area of northern Nigeria, while church services were under way. Different sources gave different tallies of how many people were taken, but initial reporting suggests there were up to 177 abductees. Usman Danlami Stingo, who represents the area in the state parliament, said: \"As of yesterday, 177 people were missing, and 11 came back. So we have 168 still missing.\" Reverend John Hayab, chairman of the Christian Association of Nigeria, said 172 worshippers were kidnapped, but nine later escaped, leaving ‍163 still held. Police confirmed dozens of people had been abducted by gunmen armed with \"sophisticated weapons\", but said they were still confirming how many. A police spokesperson said the area was remote and hard to ‌reach due to bad roads, so reliable information was difficult to obtain. Troops and other security agencies had been deployed in a bid to track the abductors and rescue the captives, they added. It's believed that a Catholic church and two churches from the Cherubim and Seraphim denomination were targeted. No group has yet taken responsibility for the kidnapping. Read more:At least 30 killed as gunmen storm village in NigeriaTrump's claims ISIS targeted in Nigeria 'sketchy' Mass kidnappings are increasingly common in Nigeria, with armed gangs targeting remote communities where the security and government presence is limited. The attacks on churches have sparked claims of religious persecution by Donald Trump and others, although the Nigerian government says the security crisis is not a \"Christian genocide.\" Nonetheless, on Christmas Day, US strikes rained down near Sokoto - a Muslim-majority city in the north of the country - allegedly targeting an Islamic State group in what Trump called a \"Christmas present\"."
    },
    {
        "title": "Ring Nebula: What is mysterious iron 'bar' in space?",
        "description": "Astronomers have spotted a mysterious cloud in the shape of a bar 2,600 light-years from Earth.",
        "url": "https://news.sky.com/story/ring-nebula-what-is-mysterious-iron-bar-in-space-13496185",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ring-nebula-space_7139605.jpg?20260119112938",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-19 11:34:00",
        "Headline": "Researchers have discovered a strange shape within a well-known nebula, which has offered a potential insight into the fate of the Earth.",
        "Content": "Astronomers have spotted a mysterious cloud in the shape of a bar 2,600 light-years from Earth. It appears in the Ring nebula, also called Messier 57, which consists of the glowing remains of what was once a sun-like star in the constellation Lyra. Researchers said it is possible the cloud of iron atoms in the shape of a bar is the remnants of a rocky planet which was vaporised when the star threw off its outer layers. It has been speculated that Earth could face the same fate when the sun goes through a similar process, billions of years from now. The iron atoms stretch about 3.7 trillion miles (six trillion kilometres) long across the face ⁠of the nebula, which has been studied extensively since its discovery by French astronomer Charles Messier in 1779. Researchers made the observation using a new instrument called WEAVE, short for WHT Enhanced Area Velocity Explorer, on the William Herschel Telescope, located on La Palma in the Canary Islands. \"It is exciting to see ‌that even a very familiar object - much studied over many decades - can throw up a new surprise when observed in a new way,\" said astronomer Roger Wesson of Cardiff University and ‌University College London. \n                  New moon discovered orbiting ice giant Uranus\n                 \n                  'Cataclysmic' collision of giant asteroids discovered by scientists a 'unique glimpse' into how planets are formed\n                 \n                  Image from James Webb telescope captures heart of Milky Way in 'unprecedented detail'\n                 The research was published in the journal Monthly Notices of the Royal Astronomical Society. The Ring Nebula is believed to have formed roughly 4,000 years ago, very recently in cosmic time. It is mostly made up of hydrogen and helium. The nebula formed when a star about twice the sun's mass ran out of nuclear fuel in its core, swelled up into what is called a red giant. It then expelled its outer layers before becoming a compact stellar remnant known as a white dwarf, about the size of Earth. 'This is weird' Study co-author Janet Drew, from University College London, said the iron bar is intriguing: \"No other chemical element that we have detected seems to sit in this same bar. This is weird, frankly. \"Its importance lies in the simple fact that we have no ready ‌explanation for it, yet.\" She added: \"The origin of the iron might trace back to the vaporisation of a planet. ⁠But there could be another way to make the feature that doesn't involve a planet.\" Read more from Sky News:Space telescope offers stunning viewExtra moon found orbiting UranusDiscovery from Earth-like exoplanet Mr Wesson admitted it was a puzzling structure: \"A planet like ‌the Earth would contain enough iron to form the bar, but how it would end up in a bar shape has no ‍good explanation.\" About 3,000 such nebulae are known in our galaxy, and studying them lets astronomers examine the life stage of stars."
    },
    {
        "title": "Donald Trump's peace board invitation is a gift for Vladimir Putin - but it will disgust Ukraine",
        "description": "So invading your neighbour is apparently no barrier to being an arbiter of peace.",
        "url": "https://news.sky.com/story/donald-trumps-peace-board-invitation-is-a-gift-for-vladimir-putin-but-it-will-disgust-ukraine-13496257",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-vladimir-putin-russia_7139746.jpg?20260119143937",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2026-01-19 14:10:00",
        "Headline": "The peace board is meant to oversee a ceasefire in Gaza, even though that is precisely what Donald Trump has failed to broker in Ukraine.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n So invading your neighbour is apparently no barrier to being an arbiter of peace. If the irony's lost on Donald Trump, it certainly will not be on Ukrainians. Having lived under Russian missile attacks for nearly four years, Kyiv will no doubt be disgusted by the American president's invitation to Vladimir Putin to join his \"board of peace\" on Gaza. It's designed to oversee a ceasefire, even though that's precisely what Mr Trump has failed to broker in Ukraine. \"No ceasefire until a full peace deal\" remains Moscow's mantra, as it continues to refuse Kyiv's demands to pause hostilities along the current frontlines. The invitation, as yet unconfirmed by the White House, appears to say a lot about Mr Trump's approach to Russia and the war in Ukraine. Instead of a pariah, he sees Mr Putin as a partner. This invitation will only add to Europe's growing suspicions that, when it comes to peace talks, Washington heavily favours Moscow. For Mr Putin, it's a gift - another step out of international isolation and towards rehabilitation. His acceptance might prompt some to resign their positions from the board (how does Tony Blair feel about sharing a stage with someone accused of war crimes?), while others might decline to join. But, even so, it still gives Mr Putin a seat at the table once again. And Gaza may be only the beginning, of course. Mr Trump reportedly wants the board's work to be expanded to resolve other conflicts, too. Could Ukraine be one of them? Now, surely, that's an offer too good for the Russian leader to refuse. Read more from Sky News:Trump links Greenland threats to peace prize snub'Major risk' to global economy from increased tariffs, IMF says  There are concerns that the board could undermine the role of the UN, of which Russia is a permanent Security Council member. But I don't think Mr Putin will be too bothered about that. Anything that weakens the existing world order tends to make the Kremlin happy, especially if Volodymyr Zelenskyy is not invited."
    },
    {
        "title": "Bodies of 23 recovered from shopping centre fire in Pakistan, as dozens remain missing",
        "description": "Rescuers have recovered the bodies of at least 23 people killed in a massive fire at a shopping centre in Pakistan, with dozens still missing.",
        "url": "https://news.sky.com/story/bodies-of-23-recovered-from-shopping-centre-fire-in-pakistan-as-dozens-remain-missing-13496194",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pakistan-karachi-fire_7139658.jpg?20260119125243",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-19 12:00:00",
        "Headline": "Firefighters extinguished the blaze at the multi-storey Gul Plaza in the country's largest city of Karachi late on Sunday, nearly 24 hours after it erupted.",
        "Content": "Rescuers have recovered the bodies of at least 23 people killed in a massive fire at a shopping centre in Pakistan, with dozens still missing. Firefighters extinguished the blaze at the multi-storey Gul Plaza in the country's largest city of Karachi late on Sunday, nearly 24 hours after it erupted. Rescue teams were then able to enter the building to retrieve the dead, with authorities fearing the number killed could rise as they search for 46 more people, according to city police chief Asad Raza. He told the Associated Press news agency that only six bodies had been identified so far. The rest will need DNA testing because the \"bodies were beyond recognition\", police surgeon Dr Summaiya Sye said. Footage showed flames tearing through the building as firefighters worked through the night to put out the fire. Most of the building had crumbled by Monday afternoon, with cranes surrounding the remaining structure amid fears it might fall down. The fire spread rapidly through shops storing cosmetics, garments and plastic goods, according to the city's chief rescue officer, Dr Abid Jalal Shaikh. The Sindh provincial chief minister told a news conference that those killed included a firefighter. Murad Ali Shah said the government would provide 10 million rupees (£82,000) in compensation to the family of each person killed. He said 80 people were injured in the blaze, with 22 already released from hospital. Read more from Sky News:Putin invited to join 'Peace Council' for Gaza, Kremlin saysBoy and man critically hurt after three shark attacks in two days 'Heads will roll' On Sunday night, people chanted anti-government slogans and protested about the response time from the fire department when Karachi's mayor Murtaza Wahab visited the site, local media reported. Rescue services said they first received an emergency call at 10.38pm (5.38pm GMT) on Sunday, reporting ground-floor shops were on fire, and by the time firefighters arrived, the flames had already spread to the upper floors and engulfed much of the building. Firefighters said Gul Plaza's lack of ventilation caused thick smoke to fill the building, slowing efforts to reach people trapped inside. Mr Shah said: \"I'm admitting that there are faults. I can't say whose fault this is. An ​inquiry will be conducted and heads will roll.\" The cause of the fire is not yet known and police said an investigation is under way. A history of deadly fires Karachi has a history of deadly fires, with most buildings in the city and elsewhere in the country lacking fire prevention and firefighting systems. In November 2023, 10 people were killed and 22 injured in a fire at another shopping centre in the city. In 2012, a massive fire at a garment factory in the city killed 260 people."
    },
    {
        "title": "Trump's extraordinary letter to Norway about Greenland - in full and fact-checked",
        "description": "The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary. ",
        "url": "https://news.sky.com/story/trumps-extraordinary-letter-to-norway-about-greenland-in-full-and-fact-checked-13496272",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-greenland_7127625.jpg?20260106015144",
        "type": "US",
        "Author": "Michael Drummond",
        "Date Published": "2026-01-19 15:40:00",
        "Headline": "Sky News went through Donald Trump's letter to his Norwegian counterpart on the issue of Greenland to fact check the president's claims.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n The letter from US President Donald Trump to the prime minister of Norway over his demand to take \"complete and total control of Greenland\" is extraordinary.  In it, the US leader rails against the decision not to award him the Nobel Peace Prize and repeats his threats over Greenland. Here is the full text - click on highlighted words and phrases for context and fact-checking: Read more:The misunderstanding that may have triggered latest Greenland threatWhat Trump tariff threat could mean for Europe Mr Trump's message was issued in response to a text he received from Norway's Prime Minister Jonas Gahr Stoere. Mr Stoere sent the message on behalf of himself and Finnish President Alexander Stubb. In it, he wrote: \"Dear Mr President, dear Donald - on the contact across ‍the Atlantic - on Greenland, Gaza, Ukraine - and your tariff announcement yesterday. \"You know our position on these issues. But we believe we all should ‌work to take this down and de-escalate - so much is happening around us where we ‌need to stand together. \"We are proposing a call with you later today - with both of us or ​separately - give us a hint of what you prefer! Best - Alex and Jonas.\""
    },
    {
        "title": "Greenland row: What Trump tariff threat could mean for Europe's economies",
        "description": "\"A trade war is in no one's interest\".",
        "url": "https://news.sky.com/story/greenland-row-what-trump-tariff-threat-could-mean-for-europes-economies-13496195",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-starmer-tariffs_6873130.png?20250401172413",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2026-01-19 11:58:00",
        "Headline": "We have seen Donald Trump go after allies before as part of his bid to return jobs and manufacturing to the US, but this time, his tariff weapons are aimed solely at fellow NATO countries over their refusal to sanction his purchase of Greenland.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n \"A trade war is in no one's interest\". These were Sir Keir Starmer's words on Monday as he ruled out imposing retaliatory tariffs on the United States since Donald Trump raised the stakes in his battle with Europe for control of Greenland. The US president has threatened further trade charges against his NATO allies unless he gets his way. Here, Sky News explains the details behind those threats and what they could mean for Western economies at a time when their military alliance is under threat in a way never seen before. Money latest: How financial markets have reacted to Trump threats What is Trump up to? The US president wants to buy Greenland, citing national security grounds, in the strategically important Arctic. \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  Fighting erupts near prisons holding IS extremists in Syria a day after Kurdish-led SDF agreed ceasefire with Damascus\n                 \n                  Has Trump and Starmer's 'special relationship' turned toxic? \n                 The territory also has a vast mineral wealth. But this demand is unacceptable to Danish-controlled Greenland and Europe's leaders, who argue that ownership is a matter for the people of Greenland and Denmark. What has the president threatened? Mr Trump said at the weekend he would deploy a phased increase in trade tariffs on NATO allies refusing to support his plan. As such, he wants to charge Denmark, Norway, Sweden, the UK, France, Germany, the Netherlands and Finland a 10% tariff \"on any and all goods\" sent to the US from 1 February. The aim is to make their goods less attractive to US importers, harming European companies and economies in the process. This 10% tariff would increase to 25% from June unless a deal is agreed. Starmer says Trump not prepared to use military force to take Greenland - latest updates What does this mean in practice? Essentially, it gives European nations less than two weeks to come up with a plan to satisfy Trump or face new tariffs. Is this a play by the president? While it is clear he is deadly serious about securing Greenland, we have seen before that negative reactions on financial markets to trade war threats have driven changes of heart at the White House. Climbdowns over the worst of his plans last year gave rise to the acronym TACO - Trump Always Chickens Out - among market participants. It is already clear that the prospect of an escalated dispute with NATO allies is not going down well. The dollar has weakened, oil prices have fallen, and European stock markets have tumbled in their first reaction. US markets are closed for the day for a public holiday. The International Monetary Fund (IMF) - the world's lender of last resort - has warned of a \"major risk\" to the global economy if Mr Trump follows through. Read more:The misunderstanding that may have triggered Trump's Greenland threatHow NATO's collective defence clause works If enacted, what damage could these tariffs inflict on the UK economy? The UK has already been paying a 10% rate on most goods since last April as part of the president's trade war. That figure is on top of pre-existing tariff rates and other fees. But some goods, like cars, are subject to no tariffs through later agreements, but a quota system limits the tariff exemptions to set volumes. The US is the UK's largest single trading partner but services account for almost two thirds of total exports to America on an annual basis. These services, such as financial and legal services, are not goods and therefore not subject to tariffs. Carmakers and pharmaceutical firms are at the top of the tree in terms of exported goods. Any new tariffs would be damaging to them and wider output at a time when UK growth is already in the doldrums, partly as a result of Trump's trade taxes to date. Analysis by Capital Economics on Monday suggested a \"worse-case scenario could reduce UK GDP by 0.30-0.75%\", risking recession. Chief UK economist Paul Dales said: \"The long-term political and geopolitical consequences would be much greater. One could be that the UK is nudged closer to the EU, at least when it comes to trade in goods.\" One UK exporter of automotive parts to the US told Sky News it was to invest in a US manufacturing site to get around the \"volatility\" of the Trump 2.0 era, as 30% of its output currently crosses the Atlantic. The chief executive and founder of Ryse 3D, Mitchell Barnes, said: \"The US opportunity is obviously a lot bigger, it's a lot larger market, so it would be a case of a split operation. \"You'd have US customers served from the US and UK customers, European customers, served from the UK. That would make so much more sense for ourselves.\" What about the EU? The broad US additional tariff rate for EU nations currently stands at 15%. Exports of goods, such as those from the manufacturing engine room of its economy, Germany, dominate its trade with the US. France, unlike the UK, wants to impose retaliatory tariffs and other measures on the US in the event of trade tariffs being raised by the US president. The deployment of the EU's so-called trade bazooka will be discussed at a meeting of leaders later this week, but all signs are that the vast majority want a diplomatic solution rather than risk a protracted fight."
    },
    {
        "title": "Zootropolis 2 becomes Hollywood's highest-grossing animated film of all time",
        "description": "Zootropolis 2 is now Hollywood's highest-grossing animated film of all time, earning $1.7bn (&#163;1.3bn) at the box office globally.&#160;",
        "url": "https://news.sky.com/story/zootropolis-2-becomes-hollywoods-highest-grossing-animated-film-of-all-time-13496204",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-zootopia-2-film-disney_7139659.jpg?20260119125246",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-19 12:45:00",
        "Headline": "Disney’s record-breaking animated sequel surpasses Inside Out 2, sets fastest $1bn milestone, and ranks among the top-10 highest-grossing films of all time.",
        "Content": "Zootropolis 2 is now Hollywood's highest-grossing animated film of all time, earning $1.7bn (£1.3bn) at the box office globally.  The Walt Disney Animation Studios' film has surpassed the former record holder Inside Out 2, which earned $1.69bn (£1.26b) following its 2024 release. The film, also known as Zootopia 2 in some countries, is now among the top-10 highest-grossing films of all time worldwide, along with Avengers: Endgame, Star Wars: The Force Awakens and Titanic. \"This milestone belongs first and foremost to the fans around the world whose enthusiasm made it possible,\" said Alan Bergman, co-chairman, Disney Entertainment. \"Zootopia 2 is an extraordinary achievement, and we're grateful to everyone who helped bring it to life.\" While Zootropolis 2 has broken Hollywood records, China's Ne Zha 2 remains the top-grossing animated film worldwide after taking $2.2bn (£1.65bn) last year. Released in November, Zootropolis 2 is the sequel to the 2016 film and follows rabbit police officer Judy Hopps (voiced by Ginnifer Goodwin) as she reunites with reformed con-artist fox Nick Wilde (Jason Bateman) to track down a mysterious new reptilian resident, Gary De'Snake (Ke Huy Quan). Read more from Sky News:Players and officials could face action after AFCON final chaosPutin invited to join 'Peace Council' for Gaza Zootropolis 2 set a record for the biggest opening weekend for an animated film when it debuted in the US over Thanksgiving, earning $559.5m (£417.2m) in five days. It also became the fastest animated Hollywood movie to surpass $1bn (£750m) in global box office earnings."
    },
    {
        "title": "Trump to take advantage of deal-making paradise in Davos following Greenland threat",
        "description": "This time last year Donald Trump was beamed into Davos from Washington to deliver a virtual address that put business and political leaders on notice; the free-trading, liberal economic model, reaffirmed and celebrated every January at the World Economic Forum, was over.",
        "url": "https://news.sky.com/story/trump-to-take-advantage-of-deal-making-paradise-in-davos-following-greenland-threat-13496293",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-wef-davos_7139806.jpg?20260119155906",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2026-01-19 16:09:00",
        "Headline": "The most valuable deals at the World Economic Forum this week may be diplomatic.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n This time last year Donald Trump was beamed into Davos from Washington to deliver a virtual address that put business and political leaders on notice; the free-trading, liberal economic model, reaffirmed and celebrated every January at the World Economic Forum, was over. Back then, shell-shocked European leaders and central bankers emerged from the hall wondering if he was serious. Twelve months on, there can be no doubt, and the US president will be in the Alps in-person to emphatically underline the point. President Trump will lead an 80-strong US delegation including five members of the cabinet and his most influential policy and diplomatic advisors. Money latest: Market sell-off deepens after Trump threat to Europe It amounts to an almighty American flex at what remains the highest-powered intersection of global business and politics, and he arrives with policy chaos flowing in his slipstream like contrails from Air Force One. The tariffs threatened against Greenland's Nordic and northern European allies, including the UK, are both the most serious rift in transatlantic relations in decades, and just another expression of the president's willingness to deploy economic weapons against allies as well as adversaries. It comes just a fortnight after the return of US gunboat diplomacy in Venezuela, where the prize is not apparently democracy but oil, with 50 million barrels as a down payment. And all of this as economies were recalibrating following the indiscriminate 'Liberation Day' tariffs of last April. What happens next, as ever, depends in large part on Trump, but Davos at least provides a platform for negotiations. The leaders of six of the G7 nations will be in Switzerland this week - Sir Keir Starmer is the odd one out, although that could change - along with senior executives from major players in tech, banking and investment, oil and gas, and mining. French President Emmanuel Macron will set out his position in a speech on Tuesday, as will EU President Ursula Von der Lyon. In between they will hear from Chinese Vice Premier He Lifeng, one of the few who may be enjoying the spectacle of old Atlantic allies at each others' throats. Read more:Trump's extraordinary letter to Norway about Greenland - in full and fact-checkedGreenland row: What Trump tariff threat could mean for Europe's economies Trump's presence was always going to shape this edition of the WEF's annual meeting, although the diplomatic focus was expected to be Ukraine, and the prospect of a reconstruction deal leveraging western capital for post-war reconstruction. Volodymyrr Zelenskyy may once again have to vie for American attention. Part conference, part trade fair, part global summit, Davos has become infamous precisely because it draws the richest and most powerful, and you don't have to be a cynic to wonder what really goes on here. Publicly it is largely a talking shop, with myriad panels and discussions promising thought leadership on themes that broadly support the WEF's neo-liberal economic mission - to save the world and get rich trying (I paraphrase). Behind the scenes it is a deal-making paradise. A measure of Davos's role in greasing the wheels of commerce is the number of blue-chip chief executives who attend religiously every year without ever making a speech, appearing on a public panel or answering a journalist's question. \"I can do more valuable meetings in three days in Davos than in three months at home,\" says one chief executive. Among those hustling for a share of the action are governments eager to make the case for investment to corporations who can deliver capital, jobs and growth. Chancellor Rachel Reeves will lead the British delegation this year, appearing on panels and scheduled to hold a round-table meeting with bosses convened by Jamie Dimon, head of JPMorgan, one of the world's largest banks. She will hope to get a hearing above the diplomatic noise, but this year the most valuable deals sealed in the snow may be political."
    },
    {
        "title": "'Major risk' to global economy from increased tariffs, IMF says",
        "description": "Higher levels of tariffs and increased geopolitical threats are a \"major risk\" to the global economy, the International Monetary Fund (IMF) has said.",
        "url": "https://news.sky.com/story/major-risk-to-global-economy-from-increased-tariffs-imf-says-13496112",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-imf-economy_6117647.jpg?20230411065631",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-19 08:54:00",
        "Headline": "Amid the warning, a research firm has forecast UK economic growth could be lower due to the threatened increased tax on exports to the US.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Higher levels of tariffs and increased geopolitical threats are a \"major risk\" to the global economy, the International Monetary Fund (IMF) has said. It comes as US President Donald Trump is once again threatening to raise taxes imposed on imports, this time against eight European countries for not supporting his plan to take over the semi-autonomous Danish territory of Greenland. Tariffs of 10% would take effect on 1 February for Denmark, Norway, Sweden, France, Germany, the UK, the Netherlands and Finland, a rate that would then climb to 25% on 1 June if no deal was in place to purchase Greenland. Money blog: Big energy providers named among worst in new rankings On the day that Washington-based UN financial agency the IMF published its six-monthly analysis of economic trends, called the World Economic Outlook (WEO), its chief economist Pierre-Olivier Gourinchas was asked about the latest trade threats from the US. \"This volatility is bad for business decisions. It's bad for investment. It's bad for consumption. It leads to a state of uncertainty. And for the increased precautionary saving. So it affects global activity downward,\" Mr Gourinchas said. \"So, going forward, this is a major risk. This is something that could mature and impact growth if we have higher levels of tariffs, if we have higher levels of geopolitical tension.\" \n                  High street giant Next has bumper Christmas but remains cautious amid worsening UK jobs market\n                 \n                  Major FTSE record as much about companies not in the index as the ones that are\n                 \n                  Rachel Reeves's spring statement date is revealed\n                 The harms could come to both the US and countries hit with the tariffs, he said. \"Who stands to lose more, that's the right way to frame it, because as we all know, there are no winners in a trade war and that's the thing to remember.\" \"Of course, it's also hurting other countries, so this is a situation where tariffs and retaliation, that increase in tariffs, would put downward pressure on global activity\". Read more from Sky News:Analysis - Unleashing Europe's most powerful trade weapon on US not unthinkable What about the UK economy? As one of the countries threatened by the levies, the UK would be directly harmed. Research firm Capital Economics estimated the tariffs would \"add to the existing pain\" for UK car and pharmaceutical manufacturers. In a worst-case scenario, they could reduce UK economic growth by 0.3% to 0.75%. \"The long-term political and geopolitical consequences would be much greater,\" said Paul Dales, Capital Economics' chief UK economist. \"One could be that the UK is nudged closer to the EU, at least when it comes to trade in goods.\" For now, the IMF has left its forecasts for the UK economy unchanged. A key measure of economic growth, gross domestic product (GDP), is forecast to be 1.3% in 2026 and 1.5% in 2027, according to forecasts completed in December. Price rises are expected to slow with inflation anticipated to fall to 2% at the end of this year, the IMF added. This, however, is due to lower wages as unemployment rises. But with lower inflation comes lower borrowing costs. The IMF has expressed what many traders believe, that the Bank of England will continue to lower interest rates through 2026. Market reaction As seen in times of other tariff threats, there's been a stock market sell-off. In the UK, that's meant the benchmark stock index, the FTSE 100 index of most valuable London Stock Exchange-listed companies, was down more than 0.5%. In Europe more broadly, it's a sea of red with big losses being recorded, particularly in Scandinavian countries."
    },
    {
        "title": "Greenland row: What Trump tariff threat could mean for Europe's economies",
        "description": "\"A trade war is in no one's interest\".",
        "url": "https://news.sky.com/story/greenland-row-what-trump-tariff-threat-could-mean-for-europes-economies-13496195",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-starmer-tariffs_6873130.png?20250401172413",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-19 11:58:00",
        "Headline": "We have seen Donald Trump go after allies before as part of his bid to return jobs and manufacturing to the US, but this time, his tariff weapons are aimed solely at fellow NATO countries over their refusal to sanction his purchase of Greenland.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n \"A trade war is in no one's interest\". These were Sir Keir Starmer's words on Monday as he ruled out imposing retaliatory tariffs on the United States since Donald Trump raised the stakes in his battle with Europe for control of Greenland. The US president has threatened further trade charges against his NATO allies unless he gets his way. Here, Sky News explains the details behind those threats and what they could mean for Western economies at a time when their military alliance is under threat in a way never seen before. Money latest: How financial markets have reacted to Trump threats What is Trump up to? The US president wants to buy Greenland, citing national security grounds, in the strategically important Arctic. \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  Fighting erupts near prisons holding IS extremists in Syria a day after Kurdish-led SDF agreed ceasefire with Damascus\n                 \n                  Has Trump and Starmer's 'special relationship' turned toxic? \n                 The territory also has a vast mineral wealth. But this demand is unacceptable to Danish-controlled Greenland and Europe's leaders, who argue that ownership is a matter for the people of Greenland and Denmark. What has the president threatened? Mr Trump said at the weekend he would deploy a phased increase in trade tariffs on NATO allies refusing to support his plan. As such, he wants to charge Denmark, Norway, Sweden, the UK, France, Germany, the Netherlands and Finland a 10% tariff \"on any and all goods\" sent to the US from 1 February. The aim is to make their goods less attractive to US importers, harming European companies and economies in the process. This 10% tariff would increase to 25% from June unless a deal is agreed. Starmer says Trump not prepared to use military force to take Greenland - latest updates What does this mean in practice? Essentially, it gives European nations less than two weeks to come up with a plan to satisfy Trump or face new tariffs. Is this a play by the president? While it is clear he is deadly serious about securing Greenland, we have seen before that negative reactions on financial markets to trade war threats have driven changes of heart at the White House. Climbdowns over the worst of his plans last year gave rise to the acronym TACO - Trump Always Chickens Out - among market participants. It is already clear that the prospect of an escalated dispute with NATO allies is not going down well. The dollar has weakened, oil prices have fallen, and European stock markets have tumbled in their first reaction. US markets are closed for the day for a public holiday. The International Monetary Fund (IMF) - the world's lender of last resort - has warned of a \"major risk\" to the global economy if Mr Trump follows through. Read more:The misunderstanding that may have triggered Trump's Greenland threatHow NATO's collective defence clause works If enacted, what damage could these tariffs inflict on the UK economy? The UK has already been paying a 10% rate on most goods since last April as part of the president's trade war. That figure is on top of pre-existing tariff rates and other fees. But some goods, like cars, are subject to no tariffs through later agreements, but a quota system limits the tariff exemptions to set volumes. The US is the UK's largest single trading partner but services account for almost two thirds of total exports to America on an annual basis. These services, such as financial and legal services, are not goods and therefore not subject to tariffs. Carmakers and pharmaceutical firms are at the top of the tree in terms of exported goods. Any new tariffs would be damaging to them and wider output at a time when UK growth is already in the doldrums, partly as a result of Trump's trade taxes to date. Analysis by Capital Economics on Monday suggested a \"worse-case scenario could reduce UK GDP by 0.30-0.75%\", risking recession. Chief UK economist Paul Dales said: \"The long-term political and geopolitical consequences would be much greater. One could be that the UK is nudged closer to the EU, at least when it comes to trade in goods.\" One UK exporter of automotive parts to the US told Sky News it was to invest in a US manufacturing site to get around the \"volatility\" of the Trump 2.0 era, as 30% of its output currently crosses the Atlantic. The chief executive and founder of Ryse 3D, Mitchell Barnes, said: \"The US opportunity is obviously a lot bigger, it's a lot larger market, so it would be a case of a split operation. \"You'd have US customers served from the US and UK customers, European customers, served from the UK. That would make so much more sense for ourselves.\" What about the EU? The broad US additional tariff rate for EU nations currently stands at 15%. Exports of goods, such as those from the manufacturing engine room of its economy, Germany, dominate its trade with the US. France, unlike the UK, wants to impose retaliatory tariffs and other measures on the US in the event of trade tariffs being raised by the US president. The deployment of the EU's so-called trade bazooka will be discussed at a meeting of leaders later this week, but all signs are that the vast majority want a diplomatic solution rather than risk a protracted fight."
    },
    {
        "title": "Trade war 'not the right way to resolve our differences', says Sir Keir Starmer ",
        "description": "A trade war is \"not the right way to resolve differences\" within an alliance, Sir Keir Starmer has said.&#160;",
        "url": "https://news.sky.com/story/trade-war-not-the-right-way-to-resolve-our-differences-says-sir-keir-starmer-13496151",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-news-conference_7139451.jpg?20260119092353",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-19 11:20:00",
        "Headline": "Sir Keir has ruled out retaliatory tariffs in response to Donald Trump's threat over Greenland. ",
        "Content": "A trade war is \"not the right way to resolve differences\" within an alliance, Sir Keir Starmer has said.  At a Downing Street press conference to address the Greenland crisis, the prime minister appeared to rule out slapping the US with retaliatory tariffs. Politics live: What does the UK do next on Greenland?  It comes after Donald Trump threatened the UK and other European nations with a 10% tariff on all goods from February, increasing to 25% from June, until a deal is reached for Washington to purchase the self-autonomous Danish island. Sir Keir said using tariffs against allies is \"completely wrong\" and \"not the right way to resolve differences\". However, asked by Sky News' political editor Beth Rigby if he is planning retaliatory tariffs, Sir Keir said: \"A tariff war isn't in anybody's interests and therefore what I want to do is to avoid a tariff war because it will be businesses, workers and families across the country that will be hit by a trade war.\" He said he will engage with European allies and with Mr Trump, adding: \"We must find a pragmatic, sensible, sustained way through this that avoids some of the consequences that will be very serious for our country.\" The US president has not ruled out military action to achieve his aim of taking Greenland, which he wants because of its strategic Arctic location and mineral wealth. Sir Keir said he does not think Mr Trump is genuinely considering that option, telling reporters: \"I think that this can be resolved and should be resolved through calm discussion.\" The UK has insisted the US should have no say in Greenland's future, echoing Europe's position. Read more:The misunderstanding that may have triggered Trump's threatStarmer begins pushback against Trump In an announcement on Saturday night, Mr Trump said the tariffs \"on any and all goods\" sent to the US would hit the UK, Denmark, Norway, Sweden, France, Germany, the Netherlands and Finland. Sir Keir responded on X, saying the decision was \"completely wrong\" and reiterated his position that the future of Greenland is \"a matter for the Greenlanders and the Danes\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 He also told Mr Trump the tariffs were wrong in a subsequent phone call on Sunday, the prime minister's spokesperson said. However, at the press conference on Monday, Sir Keir insisted the US \"remains a close ally\". He said: \"The US remains a close ally on defence, on security and on intelligence, on nuclear capability, we've worked very closely with the United States, and we must never lose sight of our national interest in that,\" he said. \"But we must stand up for our values. We must be clear about the principles that we are applying here, and we'll continue to do so on the question of tariffs.\""
    },
    {
        "title": "Norwegian sovereign fund in selloff of London-listed stocks",
        "description": "Norway's sovereign wealth fund has embarked on a major selloff of its holdings in London-listed companies, even as Rachel Reeves hailed \"a new golden age\" for the City.",
        "url": "https://news.sky.com/story/norwegian-sovereign-fund-in-selloff-of-london-listed-stocks-13496215",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-city-of-london-walkie-talkie_6970595.jpg?20250722105518",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-19 13:00:00",
        "Headline": "Norges Bank Investment Management, which oversees Norway's vast oil wealth, has started selling a \"significant\" number of holdings in UK-quoted small- and mid-cap stocks in recent weeks, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Norway's sovereign wealth fund has embarked on a major selloff of its holdings in London-listed companies, even as Rachel Reeves hailed \"a new golden age\" for the City. Sky News has learnt that Norges Bank Investment Management (NBIM), the $2 trillion fund which invests revenues generated from the country's oil and gas resources, has begun offloading its stakes in a large number of small-cap and mid-sized companies quoted on the London Stock Exchange. Money blog: Big energy providers named among worst in new rankings City sources said that \"scores\" of companies had been included in the selloff, with several institutional investment groups having seen specific NBIM asset management mandates curtailed in recent weeks. The disposal plan comes with the FTSE-100, London's blue-chip index, having surged to a string of record highs despite growing geopolitical volatility. On Monday, the chancellor said reforms aimed at making its easier and cheaper to float in London \"Two years ago, some said the City's best days were behind it. They were wrong,\" she claimed. \n                  FTSE 100 bosses' pay overtakes typical worker's annual salary in less than three days of 2026, says new research\n                 \n                  Rush for gold and US oil shares after Trump's Venezuela strike\n                 \n                  Major FTSE record as much about companies not in the index as the ones that are\n                 \"We have taken a significant step forward today and I look forward to continuing to work closely with everyone here to ensure that our capital markets remain world-leading. \"As the FTSE 100 reaches record highs and global firms once again choose London, we are seeing the first signs of a new golden age for the City.\" When approached for comment in December, a spokesperson for NBIM said it had not reduced its exposure to the UK, although when pressed again last week, the fund declined to comment on its sale of UK equity holdings. The Norwegian fund's selloff of UK-listed companies is thought not to have affected its holdings in larger businesses quoted on the London market."
    },
    {
        "title": "Fantasy Football Hub tech provider Scoreline nets funding boost",
        "description": "The sports technology group behind Fantasy Football Hub has scored a multimillion pound funding boost from a syndicate of investors.",
        "url": "https://news.sky.com/story/fantasy-football-hub-tech-provider-scoreline-nets-funding-boost-13496141",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-micah-richards-motd_6746424.jpg?20260119103822",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-19 10:02:00",
        "Headline": "Scoreline, which counts Micah Richards as an investor and ambassador, will this week announce a multimillion-pound fundraising led by Seat Unique backer Nickleby Capital, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The sports technology group behind Fantasy Football Hub has scored a multimillion pound funding boost from a syndicate of investors. Sky News understands that Scoreline, which counts the Sky Sports football pundit and former Manchester City defender Micah Richards among its investors, will announce a $6m (£4.5m) fundraising later this week. The funding round has been led by Nickleby Capital, a backer of the premium ticketing and hospitality platform Seat Unique. Money blog: Big energy providers named among worst in new rankings  Other participating investors include Dopamine Sports Ventures and Winforton Investments, according to the company. Scoreline uses AI to deliver subscriber-based content which provides fans with data, insight and analytics to aid management of their fantasy sports teams. Its flagship product, FFH, focuses on English football's top flight and has 800,000 members, including 60,000 subscribers who pay to access more advanced services such as 'My Team', which features AI-inspired player recommendations. \n                  Fantasy Premier League 2022/23: Gameweek 15 tips and advice from experts\n                 Scoreline is now launching Wickets.ai in a bid to capitalise on the rapid growth in demand for fantasy cricket. The fantasy cricket market for the Indian Premier League (IPL) is said to attract more than 200 million players. \"This funding lets us scale our AI-powered platform from football to a global audience across more sports, starting with cricket,\" said Dr Thomas. \"Our goal is simple: make fantasy easier, smarter, and more fun for every fan.\" The company cited research suggesting that fantasy sports players spend as much as seven hours each week researching their team selections, with more than half claiming to care more about their fantasy team winning than their real team. \"Scoreline has proven you can generate valuable fantasy sports insights at scale,\" said Saav Shah, managing partner at Nickleby Capital. \"The combination of validated product-market fit, proprietary AI, and expansion into cricket makes this a compelling opportunity.\" According to figures referred to by Scoreline, the global market for fantasy sports games and content is expected to be worth $105bn by 2033."
    },
    {
        "title": "Nearly six million people have overpaid tax",
        "description": "More than 5.6 million people overpaid tax in the 2023/24 financial year, new figures from HMRC reveal.",
        "url": "https://news.sky.com/story/nearly-six-million-people-have-overpaid-tax-13496221",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-money-blog-payslip_7091483.jpg?20251125132022",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2026-01-19 13:11:00",
        "Headline": "Experts have blamed tax code issuing errors and complicated rules for the overpayment.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n More than 5.6 million people overpaid tax in the 2023/24 financial year, new figures from HMRC reveal. In total, taxpayers overpaid £3.5bn in income tax, with experts blaming tax code issuing errors and complicated rules. Tax codes are issued by HMRC and are used by employers or pension providers to work out how much income tax to take from your pay or pension. Find tips and personal finances news in the Money blog But HMRC can make mistakes and issue the wrong code, which means more - or less - of your income can be taken incorrectly. The tax office can issue the incorrect tax codes due to: Neela Chauhan, partner at UHY Hacker Young, an accountancy firm that uncovered the figures through a Freedom of Information request, said HMRC wouldn't always correct mistakes automatically and the onus was on taxpayers to check they're on the right tax code. \"Millions of people are paying the wrong amount of tax simply because HMRC is almost guessing what they earn. For too many people, this will go completely unnoticed,\" she said. \"Individuals must check their tax codes and year-end PAYE summaries for mistakes. Particularly those with any form of non-PAYE income or company benefits.\""
    },
    {
        "title": "'I'm a plumber - here's the problem with new builds and heat pumps... and my tips to cut call-out costs'",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, we speak to someone from a different profession to discover what it's really like. This week we chat to plumber and gas engineer Leah Carney.",
        "url": "https://news.sky.com/story/im-a-plumber-heres-the-problem-with-new-builds-and-heat-pumps-and-my-tips-to-cut-call-out-costs-13496219",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-money-blog-plumber_7139300.jpg?20260119063814",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-19 13:02:00",
        "Headline": "The best tip to keep your boiler in good condition and the skill everyone should know - a plumber and gas engineer gives the Money blog an exclusive insight in this week's careers feature.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, we speak to someone from a different profession to discover what it's really like. This week we chat to plumber and gas engineer Leah Carney. Apprentice plumbers typically earn... between £18-19k, but this goes up closer to £28-29k once they're newly qualified. At the top-end, those running a limited company can earn more than £70k. Specialist certificates have an impact on what you can charge too, like whether or not you're Gas Safe. I don't believe many plumbers would appreciate haggling... as the price is going to so many unseen costs, planning and sourcing. Fixing a problem before it becomes bad is a good way to reduce parts and labour. Also, if it is a small job or quite common, buying some products themselves can save on time charged. I sometimes do work for free... for charity, disabled or elderly clients who are financially in need or who have paid someone to do work that was done poorly but then had no means to pay a new person to fix that work. I am often asked what made me choose plumbing as a female... Although I don't mind this question, it continues to highlight that people's perceptions are yet to be changed by seeing a female in a physical, sometimes unglamorous, role. I've had to overcome misconceptions about what I'm capable of. It's a sad fact that I have experienced sexism and racism at times. But I've never looked at it like I'm the odd one out. When I'm on a job, I know that I can do anything the next guy can because I trust my knowledge and experience. New builds do suffer from a lot of issues... not just with plumbing. The plumbing is installed with a rush, things are forgotten by plumbers and installed without care or thought of longevity due to high demand on creating homes quickly, and sometimes cutting cost of materials and skilled labour. I encounter these issues mainly in larger new build flats - it can be baths, showers or toilets leaking. I am very eco-conscious and do like the technology of heat pumps but... they are not suited to a huge amount of homes in the country due to lack of space, money or the upgrades homes need. Boilers are compact and I think that if they engineer a similar concept from heat pumps or electric boilers into our standard boilers this could pave the way. My top tip for making sure your boiler is in top condition is... having a strip down clean of your boiler every five years alongside a chemical clean. Find tips and personal finance news in the Money blog The most common causes of a blocked pipe are... large food items, cooking grease or hair. These are always the things I find. Always use a food trap or hair trap in the sink and bath, wipe your cooking grease with paper and then dispose of these in the bin. Also, good old bicarbonate and white vinegar down a drain every so often can help dislodge build up. One skill everyone should know is... how to check for leaks and everyone should have a pair of grips, a screwdriver and a drill. The most popular appliance people want fitted is... a new shower. A lot of customers struggle with water pressure and deteriorating shower valves again due to limescale. The worst job I have completed was... a bad leak into a customer's living room. They had a bathroom above and after investigating all obvious areas I considered the toilet, which had tall boxing behind the pipework. After removing a piece of the boxing in I discovered that the toilet connector was dislodged - all of the tissue and everything passing through the toilet was just sitting on top of the ceiling and seeping through into the living room. This was the worst as this had to be fixed and we were dealing with foul stuff, as you can imagine! A lot of people work from home now so... they may not see anyone else during the day... so this could be a time for them to connect. I enjoy talking with customers, I find meeting different people interesting. Plumber burn-out and loneliness is a big issue... the skills gap is also a huge challenge and one I am personally passionate about tackling. I especially want to see more young women entering the trade. BIKBBI (now BIFIS) shared research earlier this year, revealing that only 3% of installers have entered the sector in the past year. I think that could be because, when you're at school, you're pushed into university if you're seen as academic and pushed into trades if you're not. As someone who's done both, I don't think that's fair or accurate. More from this series:Secrets of a cabbieI make thousands photographing celebsI'm a child psychiatrist I work five days a week, easily over 60/70 hours, running a business... Probably more if I include weekend invoicing, quoting and running the business. I am fortunate to be able to take as much holiday as I wish, but this is within reason, limiting a holiday to two weeks maximum at a time. The most common issue I get called out for is... leaking faucets, taps, showers, baths etc. Some products are made cheaply and the hard water and limescale build-up will clog the working mechanism, meaning a constant drip or leak is created over time. This would average a cost fix including a new part and labour of around £150-300."
    },
    {
        "title": "Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear",
        "description": "An emergency news conference in the Downing Street briefing room and the prime minister the gravest I've seen.",
        "url": "https://news.sky.com/story/a-grave-pm-sets-out-scale-of-greenland-crisis-13496387",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7140148.jpg?20260120012744",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-19 20:42:00",
        "Headline": "Sir Keir Starmer left us in no doubt that we are facing the most serious crisis in the transatlantic relationship in decades, with huge uncertainty about what comes next.",
        "Content": "\n          Political editor\n              @BethRigby\n An emergency news conference in the Downing Street briefing room and the prime minister the gravest I've seen. He came to level with the public about the predicament we are in, and the consequences for us all should President Donald Trump follow through on his threat to slap tariffs on the UK and take control of Greenland. He left the audience in no doubt that we are facing the most serious crisis in the transatlantic relationship in decades, with huge uncertainty about what comes next. Sir Keir Starmer was the most forthright I have seen him as he broke with President Trump, strongly criticising tariffs and insisting that on the matter of Greenland, the UK would not bend, whatever the consequences as he reminded the US that alliances were built on partnership, \"not pressure\". But the prime minister also used this moment to try to de-escalate, as he stressed the importance of the US-UK relationship and dodged the matter of retaliatory tariffs in an effort to avoid any further poking of the bear. It doesn't, by the way, mean the UK has ruled this option out - rather it is not a preferred solution and London would rather talk about other options. But the UK pointedly chose at this moment not to follow the EU by raising the prospect of retaliatory tariffs. That EU package, I'm told, could be released on Thursday. Transatlantic relations between the US and Europe are facing an unprecedented challenge due to Donald Trump's desire to annex Greenland. The arctic island is part of Denmark, a NATO ally with which the US has a defensive pact, but that hasn't dissuaded Trump. Warning against the influence of Russia and China, he claims he needs the territory for security reasons. And he hasn’t ruled out seizing it by force; offering a guarded “no comment” when asked by our US partner network NBC News. In a bid to allay the president’s fears, several European nations contributed troops to a reconnaissance mission in Greenland. But Trump said they were deployed “for purposes unknown” and seemed to interpret their presence as a message to the US. So he sent a message back – threatening to slap eight European countries with 10% tariffs from 1 February, raising to 25% from 1 June, unless the US is allowed to buy the territory. Sky understands that Trump has conceded, in a phone call with Sir Keir Starmer, that he may have misinterpreted the reason for the troops’ deployment in Greenland. But he has doubled down on the threatened tariffs – which the prime minister says are “completely wrong” – telling NBC he “100%” intends to impose them. The economic impact is already being felt in stock markets of the nations involved. Read more:Trump's extraordinary letter to NorwayWill EU unleash its most powerful trade weapon? As I understand it, the prime minister is also \"very unlikely\" to attend Davos this week, given that there is no big set pieces on multilateral issues - be that Ukraine or Greenland, for now, that are likely to be resolved. Instead, Keir Starmer will press on with his preferred method - talking intensely behind closed doors while saying as little as possible in public. Danish minister reveals depth of rift But if the prime minister doesn't want to reveal what is being said in private, the gravity of this rupture in the transatlantic alliance was laid bare by the Danish foreign minister and former prime minister, Lars Rasmussen - in London for talks with the foreign secretary - as he recounted the meeting he'd had with Vice President JD Vance and Secretary of State Marco Rubio in Washington last week. \"The meeting we had last week left me with the clear impression that the president, honestly and full-heartedly, wants to acquire Greenland. But we also made it crystal clear that this is a red line,\" he told me in an interview after his meeting with Yvette Cooper. \"We agreed to disagree. The concerns raised at the meeting and also in public, about security in the Arctic - [Trump's] concerns - we want to accommodate. Therefore, we agreed that we should move this dialogue from social media and Truth Social and other arenas into a meeting room where we could discuss whether there could be a solution building on what we already have agreed in the past.\" Up for discussion was the US massively increasing its presence in Greenland, and the stepping up of NATO on the island, as well as guarantees stopping any presence of China in Greenland stretching out for 10, 20 or 30 years. \"I thought, we have managed not to solve the problem, but to find a pathway forward. It was disrupted by the statement from the president. And that's a reality of life,\" said Mr Rasmussen, as he spoke of his appreciation of the UK and other allies coming to stand by the Danes' side. Bur what it also reveals is the depth of this transatlantic rift over Greenland. Hours after the prime minister suggested he didn't think President Trump would send in troops to Greenland and called on the US to resolve these differences through dialogue, the US president told reporters he would impose 10% tariffs on the UK and other European countries that had sent troops to Greenland for a NATO exercise last week, and refused to rule out military force. Europe's last hope to rein in Trump? That we are in this situation a year into the Trump presidency is shocking and bewildering. For decades, the transatlantic alliance has framed our world order. Now that is being undone as President Trump exercises the law of power rather than working in the rule of law that has governed international relations since the Second World War. Escalation in Greenland would rupture the NATO alliance should the leading member move directly into conflict with another partner, the Danes, who stood with the US after 9/11, suffering similar amounts of casualties to the US in Afghanistan. It would trigger a trade war that would do all of us harm. It could result in the US withdrawing from Ukraine and embolden a Russian aggressor on the edge of Europe. The consequences are as unimaginable as they are serious. But ultimately, President Trump knows he has the economic and military power to face down Europe, and it will take more than European diplomacy to persuade him to back down. With the US president due at the annual World Economic Forum summit in Davos on Wednesday, huge attention will be paid to what he has to say in Switzerland - but it will be back in Washington where the difference might be made, as Mr Trump draws fire back home from Republicans in Congress. If the Europeans can't rein him in, will his domestic lawmakers? Republican House Speaker Mike Johnson met with Sir Keir in London on Monday, with the prime minister reiterating his position on Greenland and tariffs. The best hope the Europeans have is to persuade Congress to act. The transatlantic relationship is, after all, bigger and more enduring than one man."
    },
    {
        "title": "Social media ban for children being considered by UK government",
        "description": "Ministers are launching a consultation on banning under-16s from social media after coming under pressure from dozens of their own backbench MPs.",
        "url": "https://news.sky.com/story/ministers-to-launch-consultation-on-australia-style-under-16s-social-media-ban-13496366",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pupils-phone_7129375.jpg?20260107181913",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-19 19:44:00",
        "Headline": "The education secretary is also issuing stronger guidance to schools about banning mobile phones, which will come into effect from the summer term.",
        "Content": "Ministers are launching a consultation on banning under-16s from social media after coming under pressure from dozens of their own backbench MPs. After initially opposing such a ban, the government's position softened in recent days, and ministers will now consult on whether to bring in an Australia-style policy. Read more: How Australia's social media ban works The consultation will also explore ways to improve the accuracy of age assurance technology to enforce minimum age limits for certain content, assess whether the digital age of consent is too low, and examine removing or limiting certain functions that drive addictive behaviours, such as social media \"streaks\" and the ability to scroll infinitely. The Department for Education is also publishing strengthened guidance on the use of mobile phones in schools in England, making it clearer they should be \"phone-free environments\" - but will not be legislating for a total ban. Another Starmer U-turn? These announcements come after Labour MPs, campaigners, and the Conservative opposition put pressure on the government to do more to protect young people online. Although Sir Keir Starmer was initially opposed to a blanket ban on under-16s being on social media, his hand was likely to be forced on Wednesday by a vote in the House of Lords on a Tory amendment to the Children's Wellbeing and Schools Bill, which would regulate social media platforms \"to use highly-effective age assurance measures to prevent children under 16 from accessing services\". If passed, it would then be debated in the Commons, and one Labour MP told our political reporter Faye Brown there was \"no way\" the government could whip the Parliamentary Labour Party against it, which could trigger another welfare-style rebellion - something ministers hope this consultation will avoid. The amendment has been tabled by Conservative former schools minister Lord Nash, who said the government's announcement of a consultation \"offers nothing for the hundreds of thousands of parents, teachers, medical professionals, senior police officers, national security experts and parliamentarians of all parties who have been calling for a raising of the age limit for social media\". He added: \"The longer we delay, the more children we fail. I continue to urge all peers to back my amendment on Wednesday, which would begin to end the catastrophic harm being done to a generation.\" Esther Ghey, mother of the murdered teenager Brianna, and other bereaved parents, also wrote to the prime minister and other party leaders on Tuesday, urging them to back Lord Nash's amendment, saying it \"sends an important and unambiguous message that social media is not appropriate for children under the age of 16\". We are prepared to take action, says minister Technology Secretary Liz Kendall has issued a statement saying ministers already intended to go further than the existing Online Safety Act. She said: \"Through the Online Safety Act, this government has already taken clear, concrete steps to deliver a safer online world for our children and young people. \"These laws were never meant to be the end point, and we know parents still have serious concerns. That is why I am prepared to take further action. \"Technology has huge potential - to create jobs, transform public services and improve lives. But we will only seize on that potential if people know they and their children are safe online. \"We are determined to ensure technology enriches children's lives, not harms them - and to give every child the childhood they deserve.\" 'Phones have no place in schools' More immediately, the government is strengthening the guidance on the use of mobile phones in schools in England, making it clearer that they should be \"phone-free environments\" - but stopping short of an outright ban in law. Ofsted will now examine individual schools' policies on mobile phones and how effectively they are implemented when judging behaviour during inspections, and support for schools available to those struggling to implement bans. Data from the department shows that 99.9% of primary schools and 90% of secondary schools already have mobile phone policies in place - but 58% of secondary school pupils reported mobile phones being used without permission in at least some lessons, rising to 65% of pupils aged 14 to 16. Education Secretary Bridget Phillipson said: \"We have been clear that mobile phones have no place in our schools, but now we're going further through tougher guidance and stronger enforcement. \"Our Attendance and Behaviour Hubs will support schools that are struggling to effectively implement phone bans so all our children can learn in phone-free environments.\" Ofsted boss Sir Martyn Oliver added: \"My message to headteachers is you now have all the backing - and the backing of my inspectors - to ban mobile phones in schools immediately.\" The new guidance will come into effect from the start of the summer term after Easter. Chris Sherwood, chief executive at the NSPCC, welcomed the government consultation, saying tech companies \"have prioritised profit over children's safety\". \"Taking forward measures to ensure products are safe by design would be a vital step in redressing that balance,\" he added."
    },
    {
        "title": "Trade war 'not the right way to resolve our differences', says Sir Keir Starmer ",
        "description": "A trade war is \"not the right way to resolve differences\" within an alliance, Sir Keir Starmer has said.&#160;",
        "url": "https://news.sky.com/story/trade-war-not-the-right-way-to-resolve-our-differences-says-sir-keir-starmer-13496151",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-news-conference_7139451.jpg?20260119092353",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-19 11:20:00",
        "Headline": "Sir Keir has ruled out retaliatory tariffs in response to Donald Trump's threat over Greenland. ",
        "Content": "A trade war is \"not the right way to resolve differences\" within an alliance, Sir Keir Starmer has said.  At a Downing Street press conference to address the Greenland crisis, the prime minister appeared to rule out slapping the US with retaliatory tariffs. Politics live: What does the UK do next on Greenland?  It comes after Donald Trump threatened the UK and other European nations with a 10% tariff on all goods from February, increasing to 25% from June, until a deal is reached for Washington to purchase the self-autonomous Danish island. Sir Keir said using tariffs against allies is \"completely wrong\" and \"not the right way to resolve differences\". However, asked by Sky News' political editor Beth Rigby if he is planning retaliatory tariffs, Sir Keir said: \"A tariff war isn't in anybody's interests and therefore what I want to do is to avoid a tariff war because it will be businesses, workers and families across the country that will be hit by a trade war.\" He said he will engage with European allies and with Mr Trump, adding: \"We must find a pragmatic, sensible, sustained way through this that avoids some of the consequences that will be very serious for our country.\" The US president has not ruled out military action to achieve his aim of taking Greenland, which he wants because of its strategic Arctic location and mineral wealth. Sir Keir said he does not think Mr Trump is genuinely considering that option, telling reporters: \"I think that this can be resolved and should be resolved through calm discussion.\" The UK has insisted the US should have no say in Greenland's future, echoing Europe's position. Read more:The misunderstanding that may have triggered Trump's threatStarmer begins pushback against Trump In an announcement on Saturday night, Mr Trump said the tariffs \"on any and all goods\" sent to the US would hit the UK, Denmark, Norway, Sweden, France, Germany, the Netherlands and Finland. Sir Keir responded on X, saying the decision was \"completely wrong\" and reiterated his position that the future of Greenland is \"a matter for the Greenlanders and the Danes\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 He also told Mr Trump the tariffs were wrong in a subsequent phone call on Sunday, the prime minister's spokesperson said. However, at the press conference on Monday, Sir Keir insisted the US \"remains a close ally\". He said: \"The US remains a close ally on defence, on security and on intelligence, on nuclear capability, we've worked very closely with the United States, and we must never lose sight of our national interest in that,\" he said. \"But we must stand up for our values. We must be clear about the principles that we are applying here, and we'll continue to do so on the question of tariffs.\""
    },
    {
        "title": "Robert Jenrick 'told Kemi Badenoch to kick Liz Truss out' of the Conservatives",
        "description": "Robert Jenrick claims he told Kemi Badenoch to kick former prime minister Liz Truss out of the Conservative Party because of her \"cackhanded\" mini budget. ",
        "url": "https://news.sky.com/story/robert-jenrick-told-kemi-badenoch-to-kick-liz-truss-out-of-the-conservatives-13496078",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-liz-truss-frost-conservative_7009502.jpg?20250902180752",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-19 07:27:00",
        "Headline": "The Reform defector claims the Conservatives are \"never going to change\", but admits he made mistakes as a Tory minister. ",
        "Content": "Robert Jenrick claims he told Kemi Badenoch to kick former prime minister Liz Truss out of the Conservative Party because of her \"cackhanded\" mini budget.  The former shadow justice secretary, who defected to Reform last week, told Sky News Mornings with Ridge and Frost that Ms Badenoch's refusal to do so was one of the reasons he decided to leave. Politics live: PM to make Downing Street speech He said: \"If I'd been leader of the Conservative Party, and that's obviously ancient history now, I would have chucked Liz Truss out of the party because the mini budget was careless and cackhanded. \"It did cause in the moment, real harm to people.. people's house sales fell through, they were worried about their mortgages, investments, their pensions. That's wrong. \"That is not somebody who should be a member of your political party.\" He added: \"And the point I was making is, has the Conservative Party changed? I don't believe it has. \n                  Social media ban for children being considered by UK government\n                 \n                  Defection of Tory MP Andrew Rosindell to Reform leaves Kemi Badenoch in an uncomfortable position\n                 \n                  Jenrick defection makes it more likely Reform will win general election, says senior party figure Zia Yusuf\n                 \"If the party has really changed, why wouldn't you kick Liz Truss out? You know, I've told Kemi to do that. She chose not to do it. And it speaks to a broader truth.\" Ms Truss resigned after 44 days as prime minister after her mini budget of unfunded tax cuts spooked the markets. She lost her seat at the 2024 general election, which kicked the Tories out of power after 14 years. Mr Jenrick, who had served many ministerial roles, lost to Ms Badenoch in the subsequent Conservative Party leadership race. He denied jumping ship because he sensed he couldn't oust her. He said the Conservatives have \"still got the cast of characters who made those mistakes at the helm\". \"The arsonists are still there,\" he added. \"Why would anyone trust them once again? And I concluded, it's never going to change\". He accepted that \"there were things I got wrong\", and said he could have achieved more in his housing brief. Asked whether he is really prepared to leave his ambitions to lead a political party behind he said: \"It is my view that Nigel's is a very strong leader. He is the leader of this party. That is there is no question of that whatsoever.\" Ms Truss, responding to claims Mr Jenrick made about her in The Times, posted on X: \"Robert Jenrick may have joined Reform but who is he getting his orders from? Trojan horse.\""
    },
    {
        "title": "Call for urgent Holyrood statement after Glasgow health board's hospital infections admission",
        "description": "Neil Gray is being urged to make an urgent statement amid a health board's admission there was probably a \"causal connection\" between infections suffered by patients and the water system at Scotland's superhospital.",
        "url": "https://news.sky.com/story/call-for-urgent-holyrood-statement-after-glasgow-health-boards-hospital-infections-admission-13496161",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-neil-gray-health-secretary_7139561.jpg?20260119105630",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-19 10:45:00",
        "Headline": "Health Secretary Neil Gray is being urged to face questions following closing submissions made by NHS Greater Glasgow and Clyde to the Scottish Hospitals Inquiry.",
        "Content": "Neil Gray is being urged to make an urgent statement amid a health board's admission there was probably a \"causal connection\" between infections suffered by patients and the water system at Scotland's superhospital. The Scottish Conservatives are demanding the health secretary face questions at Holyrood following closing submissions made by NHS Greater Glasgow and Clyde (NHSGGC) to the Scottish Hospitals Inquiry. The inquiry has been examining the design and construction of the Queen Elizabeth University Hospital (QEUH) in Glasgow and the Royal Hospital for Children (RHC), which are on the same campus. It was launched in the wake of deaths linked to infections, including that of 10-year-old Milly Main. Milly died in 2017 after contracting an infection within the RHC's cancer ward. Ahead of final oral hearings, set to begin on Tuesday, NHSGGC said it has been \"broadly acknowledged that there is no definite link between infections and the water system\". However, it said it accepts it is \"more likely than not that a material proportion of the additional environmentally relevant blood stream infections (BSI) in the paediatric haemato-oncology population between 2016 and 2018 had a connection to the state of the hospital water system\". The health board said that, as previously stated, the rate of infection steadily decreased after remedial measures were started, including those pertaining to the water system, in 2018. It noted: \"NHSGGC accepts that, on the balance of probabilities, there is a causal connection between some infections suffered by patients and the hospital environment, in particular the water system.\" The health board added it \"departs from its earlier submissions in this regard, having heard all expert evidence\". Dr Sandesh Gulhane, shadow health secretary for the Scottish Tories, said Mr Gray must address parliament to reassure patients and \"spell out\" what government ministers \"knew and when\". The MSP added: \"The public deserve clarity and accountability on this huge and growing scandal.\" Dr Gulhane said \"grieving families deserve answers\" as he branded NHSGGC's eleventh-hour admission as \"cynical and shameful\". He said: \"Full transparency from all involved is essential. That's why the Scottish Conservatives are demanding an urgent statement from Neil Gray.\" Read more from Sky News:Trade war 'not the right way to resolve our differences', says PMPutin invited to join 'Peace Council' for Gaza, Kremlin says The Scottish government previously said it established a statutory public inquiry \"so that families could get answers to their questions, and so that lessons can be learned for future hospital projects\". A spokesperson added: \"As an independent core participant of the inquiry, the Scottish government is committed to assisting the inquiry and therefore it would be inappropriate to comment any further at this time.\""
    },
    {
        "title": "Social media ban for children being considered by UK government",
        "description": "Ministers are launching a consultation on banning under-16s from social media after coming under pressure from dozens of their own backbench MPs.",
        "url": "https://news.sky.com/story/ministers-to-launch-consultation-on-australia-style-under-16s-social-media-ban-13496366",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pupils-phone_7129375.jpg?20260107181913",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-19 19:44:00",
        "Headline": "The education secretary is also issuing stronger guidance to schools about banning mobile phones, which will come into effect from the summer term.",
        "Content": "Ministers are launching a consultation on banning under-16s from social media after coming under pressure from dozens of their own backbench MPs. After initially opposing such a ban, the government's position softened in recent days, and ministers will now consult on whether to bring in an Australia-style policy. Read more: How Australia's social media ban works The consultation will also explore ways to improve the accuracy of age assurance technology to enforce minimum age limits for certain content, assess whether the digital age of consent is too low, and examine removing or limiting certain functions that drive addictive behaviours, such as social media \"streaks\" and the ability to scroll infinitely. The Department for Education is also publishing strengthened guidance on the use of mobile phones in schools in England, making it clearer they should be \"phone-free environments\" - but will not be legislating for a total ban. Another Starmer U-turn? These announcements come after Labour MPs, campaigners, and the Conservative opposition put pressure on the government to do more to protect young people online. Although Sir Keir Starmer was initially opposed to a blanket ban on under-16s being on social media, his hand was likely to be forced on Wednesday by a vote in the House of Lords on a Tory amendment to the Children's Wellbeing and Schools Bill, which would regulate social media platforms \"to use highly-effective age assurance measures to prevent children under 16 from accessing services\". If passed, it would then be debated in the Commons, and one Labour MP told our political reporter Faye Brown there was \"no way\" the government could whip the Parliamentary Labour Party against it, which could trigger another welfare-style rebellion - something ministers hope this consultation will avoid. The amendment has been tabled by Conservative former schools minister Lord Nash, who said the government's announcement of a consultation \"offers nothing for the hundreds of thousands of parents, teachers, medical professionals, senior police officers, national security experts and parliamentarians of all parties who have been calling for a raising of the age limit for social media\". He added: \"The longer we delay, the more children we fail. I continue to urge all peers to back my amendment on Wednesday, which would begin to end the catastrophic harm being done to a generation.\" Esther Ghey, mother of the murdered teenager Brianna, and other bereaved parents, also wrote to the prime minister and other party leaders on Tuesday, urging them to back Lord Nash's amendment, saying it \"sends an important and unambiguous message that social media is not appropriate for children under the age of 16\". We are prepared to take action, says minister Technology Secretary Liz Kendall has issued a statement saying ministers already intended to go further than the existing Online Safety Act. She said: \"Through the Online Safety Act, this government has already taken clear, concrete steps to deliver a safer online world for our children and young people. \"These laws were never meant to be the end point, and we know parents still have serious concerns. That is why I am prepared to take further action. \"Technology has huge potential - to create jobs, transform public services and improve lives. But we will only seize on that potential if people know they and their children are safe online. \"We are determined to ensure technology enriches children's lives, not harms them - and to give every child the childhood they deserve.\" 'Phones have no place in schools' More immediately, the government is strengthening the guidance on the use of mobile phones in schools in England, making it clearer that they should be \"phone-free environments\" - but stopping short of an outright ban in law. Ofsted will now examine individual schools' policies on mobile phones and how effectively they are implemented when judging behaviour during inspections, and support for schools available to those struggling to implement bans. Data from the department shows that 99.9% of primary schools and 90% of secondary schools already have mobile phone policies in place - but 58% of secondary school pupils reported mobile phones being used without permission in at least some lessons, rising to 65% of pupils aged 14 to 16. Education Secretary Bridget Phillipson said: \"We have been clear that mobile phones have no place in our schools, but now we're going further through tougher guidance and stronger enforcement. \"Our Attendance and Behaviour Hubs will support schools that are struggling to effectively implement phone bans so all our children can learn in phone-free environments.\" Ofsted boss Sir Martyn Oliver added: \"My message to headteachers is you now have all the backing - and the backing of my inspectors - to ban mobile phones in schools immediately.\" The new guidance will come into effect from the start of the summer term after Easter. Chris Sherwood, chief executive at the NSPCC, welcomed the government consultation, saying tech companies \"have prioritised profit over children's safety\". \"Taking forward measures to ensure products are safe by design would be a vital step in redressing that balance,\" he added."
    },
    {
        "title": "'Nowhere to hide' for water companies, vows government in industry shake up",
        "description": "The creaking water industry is set for a \"once-in-a-generation set of reforms\", the government has said as it proposes new legislation to overhaul the system.",
        "url": "https://news.sky.com/story/nowhere-to-hide-for-water-companies-vows-government-in-industry-shake-up-13496279",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mogden-sewage-treatment_6969742.jpg?20250721101325",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-19 15:18:00",
        "Headline": "Water companies to be subject to \"MOTs\" under new government plans aiming to preempt rather than remedy major failures, such as the recent water shortages in south-east England.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The creaking water industry is set for a \"once-in-a-generation set of reforms\", the government has said as it proposes new legislation to overhaul the system. Nightmare situations such as taps running dry in Kent and Sussex recently would be avoided, the government says, thanks to a new proactive system that would perform \"MOTs\" on water companies to preempt major failures. Ministers are set to unveil a series of reforms in parliament on Tuesday as they move ahead with a major shake-up in the industry in England and Wales, including abolishing the current system of overlapping regulators. Public confidence in the old way collapsed as sewage spills grew and pipes crumbled, while water company bosses enjoyed ever bigger bonuses. The new plans, outlined in a White Paper on Tuesday, would create one single regulator, as well as an ombudsman to make it easier for bill-payers to complain about their suppliers. But campaigners and the water industry have warned the proposals won't come in soon or reach far enough. 'Nowhere to hide' \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  What UK social media ban on children could look like - as government considers action\n                 \n                  What it's like to live next to a 25,000 tonne illegal waste dump\n                 The environment secretary Emma Reynolds called the proposals a \"once-in-a-generation set of reforms\" to tackle water pollution and \"poor performance by water companies\". Under the government's proposals, water companies will have to perform health checks on their infrastructure to proactively identify problems with pipes or sewage treatment works before they fail. A new chief engineer at the regulator will also bring back hands-on checks of infrastructure, something not seen for 20 years. Ms Reynolds told Sky News: \"We're going to move away from a system whereby water companies mark their own homework to having a new regulator - abolishing Ofwat - with more teeth, so that there'll be nowhere to hide for poor performance.\" It comes as complaints to the consumer body, the Consumer Council for Water, rose 50% in the last year while trust hit an \"all time low\". Its chief executive Mike Keil said: \"The miserable disruption inflicted on people in parts of Sussex and Kent in recent weeks underlines why meaningful change in the way water companies are regulated and treat their customers is desperately needed.\" He welcome the proposed new ombudsman, which would have legal powers to resolve disputes and force water companies to compensate for problems. Public outcry over water companies The planned changes come as part of the government's response to public fury over rising bills, sewage pollution and large payouts for executives. Last year it commissioned an independent review that made 88 recommendations to repair one of the world's only fully privatised water systems. But it ruled out re-nationalisation of the water industry, which it sees as too expensive and disruptive, but which some campaigners say is the only solution. James Wallace, CEO of River Action, said the government \"recognises the scale of the freshwater emergency, but lacks the urgency and bold reform to tackle it\". He said none of the proposals would \"make a meaningful difference\" without tackling privatisation, which is the \"root cause of this crisis\". Water companies also warned the changes might come in too slowly. The government expects them before the next general election, but can't yet put a date on it. A spokesperson for the industry body Water UK said: \"We cannot afford for any more long-term decisions to be taken by a system everyone knows has failed. \"The need for major reform has long since been agreed. Delivery now needs to catch up.\" The proposals so far were also light on reforms to other sectors that pollute Britain's waterways, such as farms, housing and roads - though more detail is expected in the White Paper on Tuesday."
    },
    {
        "title": "Finger prick blood test trial 'could revolutionise' Alzheimer's diagnosis, say experts",
        "description": "A new trial has been launched which could see a finger prick blood test \"revolutionise\" the diagnosis of Alzheimer's, experts have said.",
        "url": "https://news.sky.com/story/finger-prick-blood-test-trial-could-revolutionise-alzheimers-diagnosis-say-experts-13496188",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-blood-test-alzheimers_7127867.jpg?20260106101403",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-19 13:29:00",
        "Headline": "Testing for Alzheimer's currently sees people undergo a specialised brain scan or invasive spinal fluid tests - but if the new trial is successful, this could dramatically change.",
        "Content": "A new trial has been launched which could see a finger prick blood test \"revolutionise\" the diagnosis of Alzheimer's, experts have said. The simple procedure could be performed in GP surgeries and would be quick and cheap, replacing the current invasive and expensive methods of diagnosing the disease. If trials are successful, experts believe it could \"pave the way\" for improved diagnosis of all neurodegenerative conditions and slow the progression of Alzheimer's in its early stages. At present, a definitive diagnosis of Alzheimer's can only be given if people have a specialised brain scan or invasive spinal fluid tests. The new test aims to pick up three proteins known to be associated with Alzheimer's. Some 883 of the 1,000 people needed for the new Bio-Hermes-002 trial have already been enrolled globally, including people from the UK, US and Canada. More than 360 people from this group have already completed the test. The trial includes people with no cognitive issues, those with mild cognitive impairment and some with mild to moderate Alzheimer's disease. The trial of the new test is being led by medical research organisation LifeArc and the Global Alzheimer's Platform Foundation, with support from the UK Dementia Research Institute. LifeArc said the trial \"aims to validate, in a large-scale, internationally diverse population\" the finger-prick-based approach to identifying Alzheimer's. It also comes after other \"breakthrough\" research showed blood tests could help identify the early signs of Alzheimer's. Read more from Sky News:Starmer warns Trump over Greenland tariffsDoctors give health warning over tech and devices Professor Henrik Zetterberg, of the UK Dementia Research Institute, said: \"Importantly, the results will be compared against current gold standard diagnostic techniques. \"If successful, being able to diagnose Alzheimer's with a minimally invasive, cost-effective method will revolutionise diagnostics in this area and pave the way for improved diagnosis of all neurodegenerative conditions.\" Dr Giovanna Lalli, of LifeArc, said there had been \"substantial progress\" in developing ways to identify Alzheimer's before symptoms emerge, but added: \"Developing cheaper, scalable and more accessible tests is vital in the battle against this devastating condition.\" The trial is expected to end in 2028."
    },
    {
        "title": "Ring Nebula: What is mysterious iron 'bar' in space?",
        "description": "Astronomers have spotted a mysterious cloud in the shape of a bar 2,600 light-years from Earth.",
        "url": "https://news.sky.com/story/ring-nebula-what-is-mysterious-iron-bar-in-space-13496185",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-ring-nebula-space_7139605.jpg?20260119112938",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-19 11:34:00",
        "Headline": "Researchers have discovered a strange shape within a well-known nebula, which has offered a potential insight into the fate of the Earth.",
        "Content": "Astronomers have spotted a mysterious cloud in the shape of a bar 2,600 light-years from Earth. It appears in the Ring nebula, also called Messier 57, which consists of the glowing remains of what was once a sun-like star in the constellation Lyra. Researchers said it is possible the cloud of iron atoms in the shape of a bar is the remnants of a rocky planet which was vaporised when the star threw off its outer layers. It has been speculated that Earth could face the same fate when the sun goes through a similar process, billions of years from now. The iron atoms stretch about 3.7 trillion miles (six trillion kilometres) long across the face ⁠of the nebula, which has been studied extensively since its discovery by French astronomer Charles Messier in 1779. Researchers made the observation using a new instrument called WEAVE, short for WHT Enhanced Area Velocity Explorer, on the William Herschel Telescope, located on La Palma in the Canary Islands. \"It is exciting to see ‌that even a very familiar object - much studied over many decades - can throw up a new surprise when observed in a new way,\" said astronomer Roger Wesson of Cardiff University and ‌University College London. \n                  New moon discovered orbiting ice giant Uranus\n                 \n                  'Cataclysmic' collision of giant asteroids discovered by scientists a 'unique glimpse' into how planets are formed\n                 \n                  Image from James Webb telescope captures heart of Milky Way in 'unprecedented detail'\n                 The research was published in the journal Monthly Notices of the Royal Astronomical Society. The Ring Nebula is believed to have formed roughly 4,000 years ago, very recently in cosmic time. It is mostly made up of hydrogen and helium. The nebula formed when a star about twice the sun's mass ran out of nuclear fuel in its core, swelled up into what is called a red giant. It then expelled its outer layers before becoming a compact stellar remnant known as a white dwarf, about the size of Earth. 'This is weird' Study co-author Janet Drew, from University College London, said the iron bar is intriguing: \"No other chemical element that we have detected seems to sit in this same bar. This is weird, frankly. \"Its importance lies in the simple fact that we have no ready ‌explanation for it, yet.\" She added: \"The origin of the iron might trace back to the vaporisation of a planet. ⁠But there could be another way to make the feature that doesn't involve a planet.\" Read more from Sky News:Space telescope offers stunning viewExtra moon found orbiting UranusDiscovery from Earth-like exoplanet Mr Wesson admitted it was a puzzling structure: \"A planet like ‌the Earth would contain enough iron to form the bar, but how it would end up in a bar shape has no ‍good explanation.\" About 3,000 such nebulae are known in our galaxy, and studying them lets astronomers examine the life stage of stars."
    },
    {
        "title": "Brooklyn Peltz Beckham 'doesn't want to reconcile with family'",
        "description": "Brooklyn Peltz Beckham has broken his silence about his estrangement from his parents, saying he does not want to reconcile with his family.",
        "url": "https://news.sky.com/story/brooklyn-beckham-doesnt-want-to-reconcile-with-family-13496393",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckham-david-beckham_7140029.jpg?20260119210741",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-19 20:58:00",
        "Headline": "In a long statement on Instagram, the 26-year-old said he was standing up for himself for the first time in his life.",
        "Content": "Brooklyn Peltz Beckham has broken his silence about his estrangement from his parents, saying he does not want to reconcile with his family. In a statement shared on his Instagram story, the 26-year-old offered his explanation for the alleged rift. He wrote: \"I have been silent for years and made every effort to keep these matters private. \"I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life. \"All we want [is] peace, privacy and happiness for us and our future family.\" His statement, which Sky News is not reproducing in full, runs across multiple stories on Instagram, where he has 16.1 million followers. Brooklyn, the son of footballer David Beckham and former Spice Girl, Victoria Beckham, married Nicola Peltz in 2022, the daughter of American billionaire businessman Nelson Peltz and former model Claudia Heffner Peltz. \n                  David and Victoria Beckham recreate purple wedding look for 25th anniversary\n                 \n                  Nicola Peltz Beckham denies claims of a 'feud' with Victoria Beckham over wedding dress\n                 \n                  Brooklyn Beckham:  David shares first pictures of son's wedding to Nicola Peltz, telling US actress 'welcome to the family'\n                 The couple live together in Los Angeles. Sky arts and entertainment correspondent, Katie Spencer, said the distance between him and his family had been interpreted in the media as evidence of her controlling influence. Ms Spencer said today's statement was about challenging that suggestion. \"He has made this extraordinary six-page statement saying that the narrative that his wife is controlling him is completely backwards,\" she said. She also highlighted how the rift in the Beckham family had become evident from their public appearances. She said: \"The publicity surrounding the Beckhams is they present a united front. \"The whole family turn out for family gatherings, they are photographed and what have you, and since the eldest son of the Beckhams has been married, he hasn't really popped up at a lot of these sorts of family events. \"He was noticeably absent from significant events like his dad's 50th. There was no comment made when his dad was knighted. \"At Christmas, the papers reported that he'd blocked his mum for liking quite a sort of innocuous, innocent post that he'd made about cooking.\" She added: \"So often they [David and Victoria] have controlled when and where we hear from them. \"They have opted more recently to speak in their own documentaries, rather than give loads of interviews to the press. \"So this is a very different side to the Beckham family that we are seeing.\" It has been widely reported that Brooklyn did not attend his dad's birthday celebrations.Brooklyn now claims he was in the UK, but that his dad only agreed to see him under the condition that his wife was not invited. David and Victoria Beckham have been contacted for comment."
    },
    {
        "title": "Prince Harry v Mail: Publisher accused of 'wrecking lives', as string of high-profile figures mentioned in court",
        "description": "Prince Harry has personally attended the first day of his trial against Daily Mail publisher Associated Newspapers Limited (ANL) at the Royal Courts of Justice in Central London.",
        "url": "https://news.sky.com/story/prince-harry-v-mail-publisher-accused-of-wrecking-lives-as-string-of-high-profile-figures-mentioned-in-court-13496303",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7139524.jpg?20260119101124",
        "type": "Entertainment",
        "Author": "Bethany Minelle and Gemma Peplow, arts and entertainment reporters",
        "Date Published": "2026-01-19 16:27:00",
        "Headline": "Prince Harry was in court, along with Liz Hurley, her son Damian, and Sadie Frost, as the court heard the publisher had spent more than £3m on private investigators. ANL strongly denies any wrongdoing.",
        "Content": "By Bethany Minelle and Gemma Peplow, arts and entertainment reporters  Prince Harry has personally attended the first day of his trial against Daily Mail publisher Associated Newspapers Limited (ANL) at the Royal Courts of Justice in Central London. He, along with co-claimants Sir Elton John and his husband David Furnish, campaigner Baroness Doreen Lawrence, politician Sir Simon Hughes, and actresses Sadie Frost and Liz Hurley, all allege ANL had a practice of \"clear systematic and sustained use of unlawful information gathering\". Allegations range from tapping their phones and bugging their homes to obtaining medical records by deception. ANL strongly denies any wrongdoing. Monday saw the opening arguments from the claimants - all represented by barrister David Sherborne - who said the publisher \"knew they had skeletons in their closet,\" telling the court the Daily Mail and Mail on Sunday were engaged in unlawful information-gathering (UIG) over \"at least two decades\". He also said ANL's denials of unlawful acts to the Leveson Inquiry in 2011 were \"not true\". In written submissions, Mr Sherborne said alleged unlawful acts \"range through a period from 1993 to 2011, even continuing beyond until 2018.\" Written submissions from the claimants accused the publisher of having a \"culture of unlawful information gathering that wrecked the lives of so many\". Analysis: His biggest case against the press - and the stakes are high Along with stories about the seven claimants, articles about other high-profile figures, including former home secretary David Blunkett, comedian Ronnie Barker's son, actress Billie Piper and her ex-husband Chris Evans and Tony Blair's son, Euan, were also brought up in court. Documents released by the court showed that ANL journalists had spent well in excess of £3m on private investigators in the relevant period, including thousands of pounds paid to a \"talented\" voice actor, known as a \"blagger\" (someone, often a private investigator, who obtains private, confidential information by deception). Prince Harry left 'paranoid' and 'isolated,' court hears Prince Harry's case is based on 14 articles, published between 2001 and 2013, including several articles about his then-girlfriend Chelsy Davy, and another about the princes' distress over photos of their late mother, Princess Diana, in her final moments, published in an Italian magazine. Mr Sherborne said: \"It is evident from the articles and the evidence of the Duke of Sussex that the targeting of him has had a profoundly distressing effect\". He said episodes of pleaded unlawful information gathering were described by the royal as \"disturbing to feel that my every move, thought or feeling was being tracked and monitored just for the Mail to make money out of it\", and an \"intrusion [that] was terrifying\" for loved ones. Mr Sherborne went on to say Prince Harry said it created \"a massive strain\" on personal relationships, while invidiously \"creating distrust and suspicion\", and \"driving me paranoid beyond belief, isolating me\". Prince Harry will give evidence in court on Thursday. In written submissions, the royal said: \"I find it deeply troubling that Associated used phrases such as 'sources', 'friends' and the like as a device to hide unlawful information-gathering.\" However, in response to Harry's claims, ANL said in their written submissions: \"At all material times, the Duke of Sussex's social circle was known to be a good source of leaks or disclosure of information to the media about what he got up to in his private life.\" Sadie Frost describes 'violation' in written submission Deeply personal details about actress Sadie Frost were detailed in her claim, which the court will later hear, including her diagnosis of an ectopic pregnancy and subsequent termination. Documents released by the court included what Frost said were \"verbatim quotations\" from phone conversations with her then-husband Jude Law, including a \"heated argument\" about his then-girlfriend Sienna Miller and details over their childcare, which were then used to inform articles published by ANL. Describing her distress in a written submission, Frost said: \"The stories they wrote violated me, my friends and family, and my children who were still so small, and they made me believe that I could not trust anyone. They were always written so close to home, like it was someone who knew me really well that was talking to the journalists. That is what I suspected at the time.\" Sir Elton and David Furnish 'outraged' by alleged theft In written submissions, Sir Elton and Mr Furnish - whose case includes articles with details about their sons and Sir Elton's health - said they felt their home and the safety of their children had been \"violated\" by alleged unlawful news gathering. The court was told the couple, who followed Monday's proceedings on a live video-link, also felt \"outrage\" at the alleged \"stealing\" of their son Zachary's birth certificate and medical details after he was born. Baroness Lawrence - the mother of murdered teenager Stephen Lawrence - said she felt like a \"victim all over again\", adding, \"I remember feeling like I could not even grieve the injustice of what was happening privately, even for a day, or to prepare my children for the news before the world found out.\" ANL say the information was gathered in legal ways, including journalists' contacts, spokespeople, freelance journalists, photographers, news agencies and prior newspaper and magazine articles. Antony White KC, for ANL, also told the court it was \"a striking feature of the case that none of the articles were the subject of complaint by the claimants at the time of publication\". Arts and entertainment correspondent Prince Harry and the other claimants in this case are adamant the stories they are bringing forward contain information that could only have been gathered unlawfully. The publishers of the Daily Mail, however, maintain their journalists always used legitimate sources. Here's a look at some of the headlines.  Harry takes Chelsy on make-or-break holiday  This article, published by the Daily Mail on 8 December 2007, is one of 14 that Harry is bringing before the court. It includes intimate details of the romantic relationship he was in at the time with Chelsy Davy, such as details of their holiday in Africa and her plans to quit university. Now, Harry says the only conceivable way to find out information such as flight details was to do so through his partner, because he flew under a pseudonym, and that neither he nor Ms Davy were sharing private information with others. But the journalist who wrote the story claims her information came from sources she developed at Leeds University who were friends with Ms Davy.  Princes and Palace clash on 'all-night' Diana Party  This article, published in the Mail on Sunday on 20 May 2007, was about alleged tensions in the Royal Household over plans to hold an event after a memorial concert for Princess Diana, and hopes that Sir Elton John would attend.  Sir Elton says he was having private, direct conversations with Prince Harry only – so how could the newspaper know? Well, the Mail's journalist says it's highly likely to have been sourced from information provided by Lady Elizabeth Anson - a first cousin of the late Queen, who worked as a party planner.  Elton: I'm the daddy; He is named the 'Father' of surrogate son on official document – and David Furnish is 'Mother'  Sir Elton and David Furnish say this article, published in the Daily Mail on 30 December 2010, was homophobic in tone and that they were shocked at how the Mail had been able to obtain a copy of their son's birth certificate before they did. They alleged this was done through blagging – in other words, someone pretending to be either them or someone close to them. But not so, argues the Mail - thenewspaper says the article's writer telephoned the local registrar's office and introduced himself as a journalist.\n  Mummy's little boy - But 'Daddy' is still in denial as Liz gives birth  The Daily Mail had exclusive information on the birth of Hurley's baby - confidential medical information - in this article published in April 2002. The actress says these details could only have come from private conversations. However, one of the arguments from the Mail journalist who wrote the story is that it was partly written from a news agency report that was later recalled, but also that Hurley herself had been talking openly about the birth around that time. The case was brought in 2022, and the following year, ANL failed to have the case thrown out on the basis that it was \"time-barred\" or brought too late. It is Prince Harry's third battle with the UK press, following his win against Mirror Group Newspapers in 2023. He settled a claim against News Group Newspapers, the publisher of the Sun and the now-defunct News Of The World, last January. The trial, which is expected to last nine weeks, continues."
    },
    {
        "title": "Gwyneth Paltrow, Cindy Crawford and Donatella Versace lead tributes to designer Valentino",
        "description": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\".",
        "url": "https://news.sky.com/story/italian-fashion-designer-valentino-dies-13496264",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gwyneth-paltrow-valentino_7140067.jpg?20260119220310",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-19 14:31:00",
        "Headline": "Tributes pour in from leading politicians and actors for the designer - best known for creating his signature 'Valentino red'.",
        "Content": "Tributes have flooded in for designer Valentino, who has been hailed as an \"eternal symbol of Italian high fashion\". He died on Monday at his home in Rome, surrounded by his loved ones, his foundation announced today. He was 93. A lying in state will be held on Wednesday and Thursday to honour him. His funeral is set to take place in Rome on Friday. Hollywood star Gwyneth Paltrow, who wore a Valentino gown for her wedding to Brad Falchuk, said on Instagram: \"I was so lucky to know and love Valentino - to know the real man, in private. \"The man who was in love with beauty, his family, his muses, his friends. His dogs, his gardens, and a good Hollywood story. \"I loved him so much. I loved how he always pestered me to \"at least wear a little mascara\" when I came to dinner. I loved his naughty laugh. \n                  Greenland latest: Trump admits he may have been misinformed over European troops in territory, Sky News told\n                 \n                  Trump's extraordinary letter to Norway about Greenland - in full and fact-checked\n                 \n                  How deadly train crash unfolded in Spain - and why it's been described as 'truly strange'\n                 \"This feels like the end of an era. He will be deeply missed by me and all who loved him. Rest in peace, Vava.\" Fashion designer Donatella Versace also said in a post: \"Today, we lost a true maestro who will forever be remembered for his art. \"My thoughts go to Giancarlo, who never left his side for all these years. \"He will never be forgotten.\" Born Valentino Garavani, he became known simply as Valentino - sharing the name with his eponymous fashion line. The label is best known for creating \"Valentino red\" - a dark shade of red that would feature heavily in their dresses. Italian Prime Minister Giorgia Meloni was among a list of leading politicians to pay tribute to the designer on social media.She said: \"Valentino, undisputed master of style and elegance and eternal symbol of Italian high fashion. \"Today, Italy loses a legend, but his legacy will continue to inspire generations. Thank you for everything.\" Deputy prime minister Antonio Tajani described him as a \"leading figure\" of global fashion in a post on X. His foundation added: \"Valentino Garavani was not only a constant guide and inspiration for all of us, but a true source of light, creativity and vision.\" Model Cindy Crawford said in a post on Instagram that she was \"heartbroken\" by his loss. She said: \"I will always be grateful for the years I had the privilege of working closely with him.\" Valentino dresses became a mainstay on Hollywood red carpets - from Reese Witherspoon, Jennifer Lopez and Cate Blanchett among the stars to have worn him. Other famous names include Julia Roberts, Princess Diana and former first lady Jacqueline Kennedy - who wore his dresses throughout her mourning period for John F. Kennedy. He later developed a friendship with Anne Hathaway - even making an appearance in 2006 film The Devil Wears Prada. Despite retiring almost two decades ago, his fashion line continues to be a staple at award shows. At this month's Golden Globe awards actors Hannah Einbinder and Colman Domingo wore outfits bearing his name. Born in Voghera, northern Italy, the designer first made his name after setting up a fashion house in Paris. He later returned to his home country to set up the fashion house alongside long-time business partner Giancarlo Giammetti. His works were best known for their opulence, often incorporating vivid colours and ornate designs at a time when much of the fashion world was looking towards minimalist design. He once famously said: \"I know what women want. They want to be beautiful.\" His career stretched from the 1960s through to his retirement in 2008."
    },
    {
        "title": "Prince Harry: It's his biggest case against the press and the stakes are high for the duke and the publisher of the Daily Mail ",
        "description": "He's spent years fighting the tabloids, but arriving at the High Court was a moment Prince Harry wanted the cameras to capture.",
        "url": "https://news.sky.com/story/prince-harry-its-his-biggest-case-against-the-press-and-the-stakes-are-high-for-the-duke-and-the-publisher-of-the-daily-mail-13496351",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7139526.jpg?20260119101141",
        "type": "Entertainment",
        "Author": "Laura Bundock",
        "Date Published": "2026-01-19 19:39:00",
        "Headline": "The Duke of Sussex and other household names - including Sir Elton John and Elizabeth Hurley - are suing the publishers of the Daily Mail over alleged historical privacy breaches in a landmark trial at the High Court.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n He's spent years fighting the tabloids, but arriving at the High Court was a moment Prince Harry wanted the cameras to capture. This is his last legal challenge against the British press. It's also his biggest, and with reputations on the line, the stakes for all sides are high. Day one, and the battlelines are being bullishly drawn. What happened on day one - recap Harry and the other high-profile co-claimants all allege that Associated Newspapers (ANL) published stories about them using information that was illegally obtained by private investigators hacking phones, deceptively \"blagging\" private information and planting bugs in homes and cars. Their barrister told the court there was a culture of unlawful information gathering at ANL. That its use was \"clear, systemic and sustained\". He also claimed the newspaper group knew what had been going on and knew there were \"skeletons in the closet\". ANL strongly denies any wrongdoing, insisting its stories were properly sourced, with Harry's own friends often the source of the leak. We now know that Prince Harry's claim centres around 14 articles published between 2001 and 2013. Many focus on his relationship with Chelsy Davy. He says the intrusion was terrifying, creating distrust and suspicion, and leaving him paranoid beyond belief. The Duke of Sussex seemed upbeat as he arrived and left the High Court. He spent the day sitting quietly in court 76 listening intently. These legal challenges have become his personal crusade. He once said changing the media landscape would be his life's work. That work is well under way. 👉 Listen to Sky News Daily on your podcast app 👈 But this claim against the Mail could be his most challenging. It will pitch the prince against one of Fleet Street's most fearsome editors, Paul Dacre. Neither wants to back down and both will soon have their moment in court. With all the claimants due to give evidence, this nine-week case has a long way to run. Read more on Sky News:Harry vs the Daily Mail explainedHarry's security set-up review Prince Harry certainly seems more relaxed. He smiled and waved as he arrived at court. He's already secured a victory and apologies from two other tabloids - winning in part his case against the Daily Mirror and settling with The Sun. His last chapter is just beginning; this is his final chance to try and expose what he believes are the dark arts of British newspapers. ANL are ready to defend its journalism. No wonder many are calling this the 'super case' of the year."
    },
    {
        "title": "Zootropolis 2 becomes Hollywood's highest-grossing animated film of all time",
        "description": "Zootropolis 2 is now Hollywood's highest-grossing animated film of all time, earning $1.7bn (&#163;1.3bn) at the box office globally.&#160;",
        "url": "https://news.sky.com/story/zootropolis-2-becomes-hollywoods-highest-grossing-animated-film-of-all-time-13496204",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-zootopia-2-film-disney_7139659.jpg?20260119125246",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-19 12:45:00",
        "Headline": "Disney’s record-breaking animated sequel surpasses Inside Out 2, sets fastest $1bn milestone, and ranks among the top-10 highest-grossing films of all time.",
        "Content": "Zootropolis 2 is now Hollywood's highest-grossing animated film of all time, earning $1.7bn (£1.3bn) at the box office globally.  The Walt Disney Animation Studios' film has surpassed the former record holder Inside Out 2, which earned $1.69bn (£1.26b) following its 2024 release. The film, also known as Zootopia 2 in some countries, is now among the top-10 highest-grossing films of all time worldwide, along with Avengers: Endgame, Star Wars: The Force Awakens and Titanic. \"This milestone belongs first and foremost to the fans around the world whose enthusiasm made it possible,\" said Alan Bergman, co-chairman, Disney Entertainment. \"Zootopia 2 is an extraordinary achievement, and we're grateful to everyone who helped bring it to life.\" While Zootropolis 2 has broken Hollywood records, China's Ne Zha 2 remains the top-grossing animated film worldwide after taking $2.2bn (£1.65bn) last year. Released in November, Zootropolis 2 is the sequel to the 2016 film and follows rabbit police officer Judy Hopps (voiced by Ginnifer Goodwin) as she reunites with reformed con-artist fox Nick Wilde (Jason Bateman) to track down a mysterious new reptilian resident, Gary De'Snake (Ke Huy Quan). Read more from Sky News:Players and officials could face action after AFCON final chaosPutin invited to join 'Peace Council' for Gaza Zootropolis 2 set a record for the biggest opening weekend for an animated film when it debuted in the US over Thanksgiving, earning $559.5m (£417.2m) in five days. It also became the fastest animated Hollywood movie to surpass $1bn (£750m) in global box office earnings."
    },
    {
        "title": "Sky News to launch new late-night show The Wrap, hosted by Anna Botting and Gillian Joseph",
        "description": "Sky News has announced a brand new late-night show - The Wrap - fronted by Anna Botting and Gillian Joseph.",
        "url": "https://news.sky.com/story/sky-news-to-launch-new-late-night-show-the-wrap-hosted-by-anna-botting-and-gillian-joseph-13496168",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gillian-joseph-anna-botting_7139569.png?20260119110312",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-19 10:51:00",
        "Headline": "Starting next Monday, the new-look broadcast will focus on debating, analysing and making sense of the day's news, and will run from 10pm until midnight.",
        "Content": "Sky News has announced a brand new late-night show - The Wrap - fronted by Anna Botting and Gillian Joseph. Launching on 26 January, the new-look broadcast will focus on debating, analysing and making sense of the day's news, not just reporting it, and will run from 10pm until midnight. Moving away from the traditional round-up, The Wrap will feature high-profile panellists, from leading experts and journalists to special guests, for a live, fast-moving conversation. Botting, who is one of Sky News' longest-serving presenters - having joined in 1995 and reported on some of the biggest stories - will host from Monday to Thursday. She said the new show's format \"means we can be even more nimble at adapting to breaking news\", adding: \"Think of it as a hub for debate and analysis, with our brilliant guests, available wherever you choose to watch.\" \"Having seen the industry transform over my 35 years as a journalist, I'm thrilled to be part of this bold and dynamic new chapter.\" And with more than 30 years of broadcasting under her belt, with coverage for Sky of every UK general election since 2001, Joseph will lead the Friday to Sunday broadcasts. \n                  Greenland latest: Starmer was the gravest I've ever seen him as scale of NATO crisis becomes clear\n                 \n                  What UK social media ban on children could look like - as government considers action\n                 \n                  What it's like to live next to a 25,000 tonne illegal waste dump\n                 She added: \"Audiences today don't just want to know what's happened, they want to understand why it matters. \"The Wrap gives us the space to unpack the stories shaping our world, and hear different perspectives. I'm genuinely excited to share this new show.\" Read more from Sky News:Iraq veterans living with 'ticking time bomb'Jenrick 'told Badenoch to kick Truss out' of Tories David Rhodes, executive chairman of Sky News, said in a statement: \"The 10pm slot has been a cornerstone of Sky News for years. \"Anna and Gillian remain at the helm, now leading greater conversation, explanation and debate. \"More than the news at 10, The Wrap will have a new format that increasingly values context and live discussion alongside breaking news, ensuring audiences get 'The Full Story, First'.\""
    }
]