[
    {
        "title": "New Epstein files offer level of insight we never expected",
        "description": "This is the kind of detail Andrew Mountbatten-Windsor and Sarah Ferguson never wanted us to see. It's embarrassing and exposing.",
        "url": "https://news.sky.com/story/new-epstein-files-offer-level-of-insight-we-never-expected-13501258",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-duke-of-york_7056916.jpg?20251031093012",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-01-30 22:10:00",
        "Headline": "Andrew Mountbatten-Windsor is under renewed pressure after the release of new pages from the Epstein files.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n This is the kind of detail Andrew Mountbatten-Windsor and Sarah Ferguson never wanted us to see. It's embarrassing and exposing. We've known for some time about the closeness between the Yorks and Jeffrey Epstein but if genuine these emails give us a new level of insight, about their interactions with the convicted paedophile, what they shared with him and just how much they saw him as a friend and close confidante. From the emails we can see he was apparently welcomed into the fold and the inner sanctum of their palace life. Offered the chance to come into Buckingham Palace in September 2010, invited to Andrew's birthday party at St James's Palace in February 2010, all after his conviction for soliciting prostitution in 2008 and his release in 2009. From the discussions about him lending them money and the exchanges about Andrew being set up with women, you can see he was clearly trusted with their innermost secrets. Epstein files latest: More than three million pages being released It is the obsequious tone with which they write to him which will inevitably anger the victims. It feels like Andrew and Sarah were dependent on him, whether for money or contacts. It appears Epstein had made it that way, made himself invaluable to them, which chimes with Sarah Ferguson's claim last year that she had to appear loyal because he was blackmailing her. Date of the emails is key But away from what's written in the emails, it's when they were written that is also exposing. Just look at the dates and they appear to challenge Andrew and Sarah's recollections of when they apparently tried to cut ties with Epstein. In June 2008, Epstein pleaded guilty to those paedophile charges, he was then released in July 2009. Yet all the email correspondence we see in this latest release of files was sent after they would have known the crimes he'd admitted. Just a month after Epstein was released Sarah Ferguson sent the email describing him as the \"brother she always wished for\". Read more:Andrew Mountbatten-Windsor officially stripped of two more titlesGhislaine Maxwell set to appear before US Congress Andrew claimed in that Newsnight interview that they were photographed together in Central Park in December 2010 because he was trying to honourably end their relationship, and yet in February 2011, they were exchanging emails which appear to suggest Epstein was helping the Yorks with money. It is important to say that the documents don't expose any new accusations of wrongdoing, to this day Andrew has vehemently denied all the allegations against him; the Metropolitan Police also said last year they don't intend to look any further at the suggestions he asked his close protection officer to dig dirt on his accuser Virginia Giuffre. Difficult reading for Royal Family But that doesn't stop this again being really difficult reading for the rest of the Royal Family, further ramping up the scrutiny around Andrew. It will also no doubt embolden those who have called for Andrew to tell-all, whether it's Epstein's victims or the US congress committee who invited him to speak to them about what he knew and what he saw. It has to be pointed out that Andrew Mountbatten-Windsor and Sarah Ferguson are inevitably at the top of everyone's search list. It means that we are inevitably going to report more on documents related to them, and with other high-profile individuals also linked to Epstein they will no doubt find that unfair. But as the brother and ex-sister-in-law of the King it is right that we should be able to question and probe how close they were, these documents giving us again that opportunity, and a level of insight we never expected. Sarah Ferguson has previously said: \"I would never have anything to do with Jeffrey Epstein ever again. I abhor paedophilia and any sexual abuse of children. It was a gigantic error of judgment.\" Sky News has approached Andrew Mountbatten-Windsor and Sarah Ferguson for comment."
    },
    {
        "title": "Former CNN presenter Don Lemon charged after covering anti-ICE protest in Minnesota",
        "description": "Don Lemon has been charged with federal civil rights crimes over the anti-ICE church protest in Minnesota, the Department of Homeland Security has said.",
        "url": "https://news.sky.com/story/former-cnn-presenter-don-lemon-charged-after-covering-anti-ice-protest-in-minnesota-13501191",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minnesota-cnn_7150745.jpg?20260130185924",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-30 18:19:00",
        "Headline": "The 59-year-old, now an independent journalist, livestreamed the demonstration, which took place inside a church on 18 January. ",
        "Content": "Don Lemon has been charged with federal civil rights crimes over the anti-ICE church protest in Minnesota, the Department of Homeland Security has said. The charges include conspiracy and interfering with the First Amendment rights of worshippers. The 59-year-old was one of four people detained in connection with the protest inside Cities Church in St Paul during a service on 18 January. Lemon livestreamed the demonstration, which took place because activists alleged that a pastor associated with the church also held a leadership role within Immigration and Customs Enforcement (ICE). Lemon has maintained he was observing the protest as a reporter. US attorney general Pam Bondi confirmed the arrests on social media on Friday. She wrote: \"At my direction, early this morning federal agents arrested Don Lemon, Trahern Jeen Crews, Georgia Fort, and Jamael Lydell Lundy, in connection with the coordinated attack on Cities Church in St. Paul, Minnesota. \n                  Nicki Minaj and Donald Trump - what's that about?\n                 \n                  ICE agents involved in fatal Minneapolis shooting of Alex Pretti placed on administrative leave\n                 \n                  ICE agents to have role at Winter Olympics - as crackdown's 'public face' to leave Minneapolis\n                 \"More details soon.\" Abbe Lowell, Lemon's attorney, called the arrest an \"unprecedented attack on the First Amendment\" - which includes freedom of the press - and said his client will \"fight these charges vigorously and thoroughly in court\". Mr Lowell said: \"Don has been a journalist for 30 years, and his constitutionally protected work in Minneapolis was no different than what he has always done. \"Instead of investigating the federal agents who killed two peaceful Minnesota protesters, the Trump Justice Department is devoting its time, attention and resources to this arrest, and that is the real indictment of wrongdoing in this case. \"This unprecedented attack on the First Amendment and transparent attempt to distract attention from the many crises facing this administration will not stand.\" Mr Lowell said Lemon had been in Los Angeles covering the upcoming Grammy Awards at the time of his arrest. In a statement, CNN also criticised the arrest of their former presenter, and said it \"raises profoundly concerning questions about press freedom\". It comes as US deputy attorney general Todd Blanche confirmed the DoJ had opened a federal investigation into a potential civil rights violation regarding the killing of Alex Pretti, who was shot and killed by border control agents last Saturday. Mr Blanche said: \"We're looking at everything that would shed light on that day.\" The killing of the 37-year-old ICU nurse came weeks after Renee Good was shot dead in her car, less than a mile from where Mr Pretti was fatally shot. Read more from Sky News:Luigi Mangione will not face death penalty if convictedTrump reveals his 'great' pick for US central bank boss Homeland Security spokesperson Tricia McLaughlin said earlier this week that two agents who fired their guns during Mr Pretti's shooting have been placed on administrative leave."
    },
    {
        "title": "Starmer hails China reset a success - but not everyone is convinced",
        "description": "Keir Starmer describes himself as a \"British pragmatist\" who takes a \"common sense\" approach. When it comes to global affairs, and domestic ones too, he isn't one to grandstand, he'd rather try to get things done.",
        "url": "https://news.sky.com/story/starmer-hails-china-reset-a-success-but-not-everyone-is-convinced-13501085",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-beth-china-starmer_7150525.png?20260130144834",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-30 13:59:00",
        "Headline": "For a British prime minister struggling to grow the economy, drumming up business with China will take priority over obvious differences around human rights.",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer describes himself as a \"British pragmatist\" who takes a \"common sense\" approach. When it comes to global affairs, and domestic ones too, he isn't one to grandstand, he'd rather try to get things done. That has been the entire tenor of his three-day visit to China as the former human rights lawyer-turned prime minister seeks tor reset Britain's relationship with China. Ask him about Donald Trump's warning that it's \"very dangerous\" for the UK to seek closer ties with China, and Starmer swerves. Ask him about the plight of the pro-democracy campaigner Jimmy Lai, imprisoned in Hong Kong, and he says the issues has been raised, but he doesn't want to go into it. Ask him whether he agrees with Mark Carney critique that the middle powers need to work together to counter the rise of great powers - the US and China, he distances. He is, if you like, making pragmatic choices to find favour with the big beast nations - be it on Jimmy Lai, or the building of a super embassy for China, or allowing Trump to troll him on a variety of subjects according to his fancy. Starmer keeps his head down and ploughs on. His supporters say this pragmatism delivers results, be it a better trade deal with the US, or the prospect of great investment and trade with the world's second-biggest economy China. \n                  China lifts sanctions on MPs and peers, Starmer says \n                 \n                  What does Starmer really want from China?\n                 \n                  Starmer in China to improve British economy, Harriet Harman says\n                 His detractors argue that the UK is supine and the prime minister is leaving his country to the mercy of much bigger powers. Canadian Prime Minister Mark Carney sees a third way. \"Great powers can afford, for now, to go it alone. They have the market size, the military capacity and the leverage to dictate terms. Middle powers do not. The middle powers must act together, because if we're not at the table, we're on the menu,\" he told the annual Davos summit earlier this month. As Trump comes for Carney - his recent visit to China and narrow trade deals prompted Trump to threaten 100% tariffs - Starmer ducks for cover. When I asked him in Shanghai whether he agreed with Carney's critique of the shifting global order, well he does not. \"I've talked to Mark Carney a lot, but we're living in a very volatile world. \"My compass is always the national interest of the United Kingdom, and I'm very clear that that means that we maintain and build on our close relationship with the US; that we build a stronger and closer relationship with Europe, but that we also are confident and engaging outwardly and that means with China.\" \"I take the view that it's in the UK's national interest to maintain our relationship with the US. \"It's close on defence, security, intelligence, actually on trade and prosperity as well. \"On Europe, I want to do more on defence and security and one trade. But on the outgoing world, I mean China as well. We need to be outward, engaging. And that's been the stance of the government since the beginning.\" As Starmer tows a line, Trump is rattled by the behaviour of allies. \"I think its very dangerous for them to do that,\" he said when asked about the UK seeking closer ties with China. But he reserved most of his ire for Canada: \"It's even more dangerous, I think, for Canada to get into business with China. Canada is not doing well. They're doing very poorly, and you can't look at China as the answer.\" Read more from Sky News:Sir Keir Starmer in China: What will be on the table?China lifts sanctions on MPs and peersChina trip's exquisite optics for 'world's most reliable superpower' But the UK is looking to China as part of the answer as it deepens trade ties, and the three-day tour was an exercise in trying to put differences aside as Starmer seeks a reset that the UK needs more than Beijing. Starmer comes away from China with sanctions on six parliamentarians, barred from visiting China for speaking out on human rights issues, lifted. There is a tariff cut on whiskey imports from 10% to 5%, and the deal in principle for visa-free travel for up to 30 days - a big win for business. It is, the No 10 delegation says, \"not a one-and-done trip\", but the beginning of a deeper reset. The prime minister told me that he hoped President Xi would visit in the UK in 2027 when it hosts the G20. It will be the first time in over 10 years that the Chinese leader has set foot on British soil. But the reasons for freezing relations remain. For all the warm handshakes and words, there are deep differences and areas of discomfort between Britain's democracy and China's autocracy. Rifts between the two nations were in part caused in response to China's crackdown in Hong Kong. The imprisonment of British pro-democracy campaigner Jimmy Lai remains a contentious issue. Keir Starmer says he raised the matter with President Xi. When I asked if he specifically raised Lai's name, he said yes. But as for Lai's release, the PM said he wouldn't get into the deals. \"I am absolutely clear about, the raising, the manner in which we raised it and the importance of raising it. What you can't do is sit back at home with your head in the sand saying, I'm not going to talk to you…if you're just sitting outside the room, refuse to engage, you can't even have the conversation.\" But there are plenty of opponents back home who disagree with the engagement. Nusrat Ghani, one of the five MPs sanctioned in 2021, posted on X: \"MPs agreed that the Chinese Communist Party was orchestrating a genocide against the Uyghur people. The sanctions were meant to intimidate us MPs and prevent us from doing our jobs without fear or favour. Bartering our MP sanctions doesn't change those facts nor help others in the UK targeted by CCP and sanctioned by them.\" Kemi Badenoch, the Conservative leader, has also been highly critical, concerned about national security, the crackdown on political freedoms in Hong Kong and Chinese \"undermining\" of the UK economy - be it through cheap Chinese goods that undermine British manufacturing, overreliance on Chinese technology or Chinese influence in critical infrastructure. So when the UK hailed a $15bn (£12bn) investment in AstraZeneca on the trip over, having paused a £200m investment at a Cambridge research site last September which was due to create 1,000 jobs, shadow business secretary Andrew Griffith was blunt in his assessment. \"AstraZeneca's a great British company but under this government it's investing everywhere in the world other than its UK home. When we are losing investment to communist China, alarm bells should be ringing in No 10 Downing Street.\" Others ask what has he actually come back with? He has not secured the scale of trade deals struck by PM Carney, and I am told by one person in the UK delegation that after Britain's snub of President Xi, it will take some time to rebuild ties. But for Starmer, the prize is deepening economic ties, more investment and trade. For a British prime minister struggling to grow this economy, drumming up more business with the world's second largest economy - even if you don't much like its political system, or choice of allies such as Russia - can be chalked up as a win. You can perhaps swallow some of that if you can agree, as Starmer did on Thursday, to launch a \"feasibility study\" on a bilateral services pact. The UK had a £10bn surplus in services with China in the year to last June. It is a market ripe for growth. For this former human rights lawyer turned self-avowed pragmatist, drumming up business will both take priority over obvious differences around human rights, espionage and China's continued support of Russia during the years of war in Ukraine. Carney argues that middle powers need to push back the superpowers, but Starmer seems happy to try to comply. It matters less to him if he is at the mercy of the US or China, if it means he can help deliver back home. The Chinese will next month welcome in the year of the horse in 2026, a creature which in their zodiac represents action, speed and breakthrough. Starmer is going to need all of that in spades if he is to usher in a year that will cut the cost of living back home. He will leave Shanghai with the hope that this visit might help - but it's going to require a lot more work, not just with Beijing, but with his other superpower too."
    },
    {
        "title": "What do we know about the number of people killed in Iran protests?",
        "description": "Thousands of people have been killed in Iran's deadly protests, but deaths are still being verified, with conflicting reports. Here's what we know.",
        "url": "https://news.sky.com/story/what-do-we-know-about-the-number-of-people-killed-in-iran-protests-13501129",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dxf-teaser_7137212.jpg?20260130170320",
        "type": "Home",
        "Author": "Alicja Hagopian, data journalist",
        "Date Published": "2026-01-30 15:51:00",
        "Headline": "Estimates from human rights organisations and doctors range from over 5,000 at the conservative end to 33,000 by one count, and even as high as 50,000, according to one unverified claim.",
        "Content": "By Alicja Hagopian, data journalist  Thousands of people have been killed in Iran's deadly protests, but deaths are still being verified, with conflicting reports. Here's what we know. Estimates from human rights organisations and doctors, independent of the Iranian regime's official figures, range from over 5,000 at the conservative end to 33,000 by one count, and even as high as 50,000, according to one unverified claim. Iranian authorities imposed a near-total internet blackout, which has only partially lifted, from 8 to 27 January. As a result, it has been near-impossible to verify the true number of people who have been killed in the brutal crackdown. Nicholas Hopton, former UK ambassador to Iran from 2016 to 2018, told Sky News that Iranian authorities were limiting information on the number of people killed. \"It is becoming increasingly clear since the internet coverage has been partially restored in the last week, that many thousands, possibly tens of thousands of innocent people, were killed during the crackdown by the Islamic regime,\" he said. The Iranian Islamic Republic previously said 3,117 people have been killed, claiming the majority of these deaths were security forces and civilians, not protesters. But this number has been questioned by doctors, diplomats and human rights organisations. \"One should view any statistics being given by the Iranian authorities with a big dose of scepticism,\" Mr Hopton added. The UN's special rapporteur on Iran, Mai Soto, has said at least 5,000 people have been killed at a \"minimum\" - substantially more than the authorities' claims. Human rights agencies also warn the numbers are much higher. The US-based Human Rights Activists News Agency (HRANA) has independently verified 6,540 deaths so far, with a further 17,091 cases under review, bringing the possible total up to over 23,500. It said just 214 deaths verified so far have been government-affiliated, such as security forces, while the majority, 6,148, have been protesters, 123 were under 18 and 55 were civilians. Doctors claim tens of thousands have been killed Meanwhile, two doctors have told Sky News they believe tens of thousands of people have been killed. Germany-based eye surgeon Dr Amir-Mobarez Parasta claimed major hospitals and clinics inside Iran have seen over 25,000 clinically recorded deaths as of 23 January. Dr Parasta is a supporter of Reza Pahlavi, the son of the former shah of Iran, who lives in the US and is a prominent voice encouraging protests against the regime. He said he had collected the figures from a network of doctors and medical professionals across Iran, and claimed they had been verified by at least two individuals in each hospital or clinic where the data was from. Sky News has not seen the clinical reports he cited and is unable to independently verify the figure. Dr Yaser Rahmani-Rad, a specialist in internal medicine at a Tehran hospital who was previously arrested in 2023 for treating protesters, also believes the number of people killed is in the tens of thousands. Some doctors have been arrested for treating protesters during this bout of unrest, Sky News previously reported. High number of deaths recorded in capital Of the deaths Dr Parasta claims have been clinically recorded, a third (8,354) were in Tehran alone. As the nation's capital and largest city, Tehran was a hotbed of protest activity and is widely considered to be the location of the first protests on 28 December. Nearly 900 protests were identified between 28 December and 13 January, through research from Sky News and the Institute for the Study of War (ISW). Dr Parasta's report estimates that with a lack of data from areas across Iran and around 15% of deaths likely being underreported at this stage, the true number of people who have died is likely higher - at least 33,130. Former UN prosecutor and human rights lawyer Payam Akhavan told Sky News he believes that estimate is credible, though Dr Parasta said he considers his figure to be \"conservative\". \"Our ongoing data collection shows a continued and significant rise in hospital-reported deaths, reflecting both the sustained intensity of the violence and the severe strain on an already overwhelmed healthcare system,\" he said. The son of the former shah of Iran, Reza Pahlavi, has said the figure could be as high as 50,000 dead, without providing evidence to support the claim. A 'massacre' amid internet blackouts  On 8 January, observed protest activity reached its peak and the internet blackout began. Now, reports from doctors suggest the days which followed were the deadliest for protesters. \"The concentration and scale of fatalities during this period compel us to speak of a massacre-level event,\" Dr Parasta told Sky News. Sky News has verified footage from several locations around Iran during this period, which appears to show security forces opening fire on protesters. One picture posted on social media shows a machine gun mounted on top of a military vehicle in Tehran. Mr Hopton, the former ambassador, said 8 and 9 January were particularly fatal. Dr Rahmani-Rad, who is based in Tehran, said: \"What happened in Iran over those two days is something the world has never seen with its own eyes. \"I still cannot believe that something like this actually happened. I still haven't fully accepted it.\" Putting the numbers into perspective  Defining the number of those killed in previous protests in Iran is similarly contentious, with competing narratives from authorities and human rights organisations. During the Iranian Revolution in 1979 - previously believed to be the most violent in Iran's history - it is estimated between 532 and 2,781 people died, according to military historian Spencer C Tucker, who has written several books on revolutions and the Middle East. The Iranian regime has put this figure much higher, at 60,000 deaths, which Mr Tucker claims is \"grossly overstated […] for propaganda purposes\". Former ambassador Mr Hopton said: \"Already, a lot more people have been killed in these protests than at any time since the 1979 revolution. But we just don't know the statistics yet.\" Human rights organisations said at least 550 people died in protests following the death of Mahsa Amini in 2022, while Iranian authorities claimed the figure was lower at 202. Yet the scale of fatalities in the latest protests is, by the authorities' own admission, undoubtedly larger than in 2022 - leading Dr Rahmani-Rad to call the brutality \"unprecedented in history\". \"The only thing I can do is hope that the world becomes aware of what happened in Iran, that people around the world understand exactly what took place,\" he told Sky News. Sky News has approached the Iranian embassy for confirmation of the number of people killed, but received no response. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Leading UK hospital in Cambridge under 'rapid but thorough' review",
        "description": "One of the country's leading neuroscience units is under urgent review following concerns about the service.",
        "url": "https://news.sky.com/story/leading-uk-hospital-in-cambridge-under-rapid-but-thorough-review-13501195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-addenbrookes-hospital_6869032.jpg?20250327222817",
        "type": "Home",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2026-01-30 18:06:00",
        "Headline": " Addenbrooke's Hospital in Cambridge had already been under investigation over the practices of a suspended surgeon.",
        "Content": "By Laura Bundock, health correspondent  One of the country's leading neuroscience units is under urgent review following concerns about the service. The neuroscience service at Addenbrooke's Hospital in Cambridge helps treat complex brain injuries and head trauma cases. The hospital's trust, Cambridge University Hospitals (CUH), took the unusual step of ordering a \"rapid but thorough\" review which will look at a \"number of clinical teams\". The review will be independent and carried out by two official health bodies. Suspended surgeon It comes just months after Sky News revealed another investigation at the same hospital into a suspended orthopaedic paediatric surgeon. An independent review was ordered into Kuldeep Stohr last year after serious issues were found with some of her surgeries on children. Read more:Anger as report exposes hospital's failingsHospital accused of 'covering up' concerns The report found the trust had missed multiple opportunities to act on concerns raised about her surgeries. Addenbrooke's is a world-renowned hospital benefitting from the prestige of close associations with Cambridge University. 'The review is examining a number of clinical teams' The rapid independent investigation into the neuroscience service will finish by the end of February, with the findings sent to the trust by the summer. CUH says it will publish the results and act on all the recommendations. It's understood the review will look at the whole service and not one individual. A CUH spokesperson said: \"Patient safety is our highest priority. We continually review outcomes across our services to identify where improvements can be made and to ensure patients receive the best possible care. \"The review is examining a number of clinical teams to identify opportunities to strengthen clinical governance arrangements.\""
    },
    {
        "title": "Father 'wants answers' after five-month-old son was fed now-recalled Nestle baby formula ",
        "description": "A father whose son needed hospital treatment after being fed a now-recalled batch of Nestle baby formula has told Sky News he wants \"answers\" after putting his \"faith and trust\" in the brand.",
        "url": "https://news.sky.com/story/father-wants-answers-after-five-month-old-son-was-fed-now-recalled-nestle-baby-formula-13501174",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rhys-edwards-nestle-baby-formula_7150641.jpg?20260130165507",
        "type": "Home",
        "Author": "Katerina Vittozzi",
        "Date Published": "2026-01-30 17:21:00",
        "Headline": "The infant, who was sick \"all day\", was found to have been fed tins of SMA formula, since recalled by the food and drink giant after investigators found cereulide, a toxin that can cause vomiting and diarrhoea.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n A father whose son needed hospital treatment after being fed a now-recalled batch of Nestle baby formula has told Sky News he wants \"answers\" after putting his \"faith and trust\" in the brand. The UK Food Standards Agency (FSA) has said it found cereulide, a toxin that can cause vomiting and diarrhoea, in batches of formula produced by food and drink giant Nestle. FSA investigators, along with the UK Health Security Agency (HSA), have been looking into more than 60 batches of Nestle SMA formula since they were recalled earlier this month. At the time of recall, Nestle said it was due to the \"potential presence\" of the heat-resistant toxin and that the move was out of an \"abundance of caution\". The FSA, when asked by Sky News, did not confirm how many batches their tests had revealed to be affected. To date, there have been no confirmed links of illness to the recalled batches. Rhys Edwards' five-month-old son fell ill soon after the New Year. \n                  Starmer hails China reset a success - but not everyone is convinced\n                 \n                  Epstein sent thousands of pounds to Mandelson's husband for osteopathy fees, files show\n                 \n                  New Epstein files offer level of insight we never expected\n                 Mr Edwards, who works in construction, said the boy \"started vomiting and we were obviously a little bit concerned, but we didn't think it was anything, just general kids' stuff. \"And then the next day he started vomiting, full on, all day.\" Mr Edwards took his son to the GP, who sent them to hospital because of concerns about the baby's blood glucose levels and dehydration. While at hospital, a relative sent Mr Edwards information about the Nestle recall. After checking their tins of SMA formula, the family discovered they'd been giving their son one of the affected batches. Mr Edwards said: \"You feel guilty in a way that you've given them this stuff that's potentially got [the toxin] in. It's horrible. \"As parents, it is bewildering, the massive range of formulas on the shelves. So you pick a brand, and you think, 'Okay, this brand is going to be great. It's Nestle.' \"So, you kind of place your faith and your trust in them that all these checks are carried out and that they've got quality control procedures in place to prevent things like this from happening.\" The family, who live in Jersey, immediately switched formula, but Mr Edwards says his son's symptoms continued for several days and he received further hospital treatment again after \"struggling to feed\". Mr Edwards, who has reported his case to Nestle, said his child has \"actually slipped a weight percentile\" and he wants \"answers\" and \"lessons learnt\". In a statement, the FSA said that the problem is down to an ingredient in the formula, an oil, provided by a third-party supplier. It's a supplier Nestle shares with Danone, which has also recalled one batch of its Aptamil baby formula. Following the FSA testing, a Nestle spokesperson said the company \"moved quickly and decisively to voluntarily issue a recall notice on 5th January 2026. \"This was due to the possible presence of cereulide in certain products because of an ingredient used in specific batches. Read more on Sky News:Mother calls for baby formula investigationMultiple baby formula recalls \"We want to reassure everyone that there has been no change to the scope or nature of this recall, and we thank everyone who has got in touch with us for their patience and apologise again that we have had to take this action.\" Earlier this week, Danone said in a statement that its priority \"is to ensure that parents and healthcare professionals can continue to place their trust in the safety and quality of our infant formula products. \"Parents can contact Danone's careline if they have any questions or concerns.\""
    },
    {
        "title": "Starmer hails China reset a success - but not everyone is convinced",
        "description": "Keir Starmer describes himself as a \"British pragmatist\" who takes a \"common sense\" approach. When it comes to global affairs, and domestic ones too, he isn't one to grandstand, he'd rather try to get things done.",
        "url": "https://news.sky.com/story/starmer-hails-china-reset-a-success-but-not-everyone-is-convinced-13501085",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-beth-china-starmer_7150525.png?20260130144834",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-30 13:59:00",
        "Headline": "For a British prime minister struggling to grow the economy, drumming up business with China will take priority over obvious differences around human rights.",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer describes himself as a \"British pragmatist\" who takes a \"common sense\" approach. When it comes to global affairs, and domestic ones too, he isn't one to grandstand, he'd rather try to get things done. That has been the entire tenor of his three-day visit to China as the former human rights lawyer-turned prime minister seeks tor reset Britain's relationship with China. Ask him about Donald Trump's warning that it's \"very dangerous\" for the UK to seek closer ties with China, and Starmer swerves. Ask him about the plight of the pro-democracy campaigner Jimmy Lai, imprisoned in Hong Kong, and he says the issues has been raised, but he doesn't want to go into it. Ask him whether he agrees with Mark Carney critique that the middle powers need to work together to counter the rise of great powers - the US and China, he distances. He is, if you like, making pragmatic choices to find favour with the big beast nations - be it on Jimmy Lai, or the building of a super embassy for China, or allowing Trump to troll him on a variety of subjects according to his fancy. Starmer keeps his head down and ploughs on. His supporters say this pragmatism delivers results, be it a better trade deal with the US, or the prospect of great investment and trade with the world's second-biggest economy China. \n                  China lifts sanctions on MPs and peers, Starmer says \n                 \n                  What does Starmer really want from China?\n                 \n                  Starmer in China to improve British economy, Harriet Harman says\n                 His detractors argue that the UK is supine and the prime minister is leaving his country to the mercy of much bigger powers. Canadian Prime Minister Mark Carney sees a third way. \"Great powers can afford, for now, to go it alone. They have the market size, the military capacity and the leverage to dictate terms. Middle powers do not. The middle powers must act together, because if we're not at the table, we're on the menu,\" he told the annual Davos summit earlier this month. As Trump comes for Carney - his recent visit to China and narrow trade deals prompted Trump to threaten 100% tariffs - Starmer ducks for cover. When I asked him in Shanghai whether he agreed with Carney's critique of the shifting global order, well he does not. \"I've talked to Mark Carney a lot, but we're living in a very volatile world. \"My compass is always the national interest of the United Kingdom, and I'm very clear that that means that we maintain and build on our close relationship with the US; that we build a stronger and closer relationship with Europe, but that we also are confident and engaging outwardly and that means with China.\" \"I take the view that it's in the UK's national interest to maintain our relationship with the US. \"It's close on defence, security, intelligence, actually on trade and prosperity as well. \"On Europe, I want to do more on defence and security and one trade. But on the outgoing world, I mean China as well. We need to be outward, engaging. And that's been the stance of the government since the beginning.\" As Starmer tows a line, Trump is rattled by the behaviour of allies. \"I think its very dangerous for them to do that,\" he said when asked about the UK seeking closer ties with China. But he reserved most of his ire for Canada: \"It's even more dangerous, I think, for Canada to get into business with China. Canada is not doing well. They're doing very poorly, and you can't look at China as the answer.\" Read more from Sky News:Sir Keir Starmer in China: What will be on the table?China lifts sanctions on MPs and peersChina trip's exquisite optics for 'world's most reliable superpower' But the UK is looking to China as part of the answer as it deepens trade ties, and the three-day tour was an exercise in trying to put differences aside as Starmer seeks a reset that the UK needs more than Beijing. Starmer comes away from China with sanctions on six parliamentarians, barred from visiting China for speaking out on human rights issues, lifted. There is a tariff cut on whiskey imports from 10% to 5%, and the deal in principle for visa-free travel for up to 30 days - a big win for business. It is, the No 10 delegation says, \"not a one-and-done trip\", but the beginning of a deeper reset. The prime minister told me that he hoped President Xi would visit in the UK in 2027 when it hosts the G20. It will be the first time in over 10 years that the Chinese leader has set foot on British soil. But the reasons for freezing relations remain. For all the warm handshakes and words, there are deep differences and areas of discomfort between Britain's democracy and China's autocracy. Rifts between the two nations were in part caused in response to China's crackdown in Hong Kong. The imprisonment of British pro-democracy campaigner Jimmy Lai remains a contentious issue. Keir Starmer says he raised the matter with President Xi. When I asked if he specifically raised Lai's name, he said yes. But as for Lai's release, the PM said he wouldn't get into the deals. \"I am absolutely clear about, the raising, the manner in which we raised it and the importance of raising it. What you can't do is sit back at home with your head in the sand saying, I'm not going to talk to you…if you're just sitting outside the room, refuse to engage, you can't even have the conversation.\" But there are plenty of opponents back home who disagree with the engagement. Nusrat Ghani, one of the five MPs sanctioned in 2021, posted on X: \"MPs agreed that the Chinese Communist Party was orchestrating a genocide against the Uyghur people. The sanctions were meant to intimidate us MPs and prevent us from doing our jobs without fear or favour. Bartering our MP sanctions doesn't change those facts nor help others in the UK targeted by CCP and sanctioned by them.\" Kemi Badenoch, the Conservative leader, has also been highly critical, concerned about national security, the crackdown on political freedoms in Hong Kong and Chinese \"undermining\" of the UK economy - be it through cheap Chinese goods that undermine British manufacturing, overreliance on Chinese technology or Chinese influence in critical infrastructure. So when the UK hailed a $15bn (£12bn) investment in AstraZeneca on the trip over, having paused a £200m investment at a Cambridge research site last September which was due to create 1,000 jobs, shadow business secretary Andrew Griffith was blunt in his assessment. \"AstraZeneca's a great British company but under this government it's investing everywhere in the world other than its UK home. When we are losing investment to communist China, alarm bells should be ringing in No 10 Downing Street.\" Others ask what has he actually come back with? He has not secured the scale of trade deals struck by PM Carney, and I am told by one person in the UK delegation that after Britain's snub of President Xi, it will take some time to rebuild ties. But for Starmer, the prize is deepening economic ties, more investment and trade. For a British prime minister struggling to grow this economy, drumming up more business with the world's second largest economy - even if you don't much like its political system, or choice of allies such as Russia - can be chalked up as a win. You can perhaps swallow some of that if you can agree, as Starmer did on Thursday, to launch a \"feasibility study\" on a bilateral services pact. The UK had a £10bn surplus in services with China in the year to last June. It is a market ripe for growth. For this former human rights lawyer turned self-avowed pragmatist, drumming up business will both take priority over obvious differences around human rights, espionage and China's continued support of Russia during the years of war in Ukraine. Carney argues that middle powers need to push back the superpowers, but Starmer seems happy to try to comply. It matters less to him if he is at the mercy of the US or China, if it means he can help deliver back home. The Chinese will next month welcome in the year of the horse in 2026, a creature which in their zodiac represents action, speed and breakthrough. Starmer is going to need all of that in spades if he is to usher in a year that will cut the cost of living back home. He will leave Shanghai with the hope that this visit might help - but it's going to require a lot more work, not just with Beijing, but with his other superpower too."
    },
    {
        "title": "Epstein sent thousands of pounds to Mandelson's husband for osteopathy fees, files show",
        "description": "Jeffrey Epstein wired thousands of pounds after Lord Peter Mandelson's husband asked him to pay for his osteopathy course fees, according to emails included in newly released Epstein files. ",
        "url": "https://news.sky.com/story/epstein-sent-thousands-of-pounds-to-mandelsons-husband-for-osteopathy-fees-files-show-13501237",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-peter-mandelson_7150837.jpg?20260130212842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-30 21:05:00",
        "Headline": "In September 2009, Lord Mandelson's husband sent Jeffrey Epstein a message mentioning emails about \"osteo course expenses\". Epstein replied saying he would wire the loan \"immediately\". ",
        "Content": "Jeffrey Epstein wired thousands of pounds after Lord Peter Mandelson's husband asked him to pay for his osteopathy course fees, according to emails included in newly released Epstein files.  More than three million documents were published by the US Department of Justice on Friday relating to disgraced paedophile financier Epstein. On 7 September 2009, Lord Mandelson's husband, Reinaldo Avila da Silva, sent Epstein a message saying: \"I sent you a couple of emails last week regarding my osteo course expenses, incl fee, anatomical models, lap top if you can help me with this. I hope you received them.\" Epstein files latest: More than three million pages being released He said the annual fee was £3,225, then explained the school accepts bank transfer and provided the account details. Avila da Silva went on to thank Epstein for \"anything you can help me with\". The late financier replied later the same day, saying: \"I will wire your loan amount immediated'y [sic].\" \n                  Epstein files release - saying everything and nothing at the same time\n                 \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  Ghislaine Maxwell set to appear before US Congress in Epstein probe\n                 Avila da Silva followed up on the money in a later email. He said: \"Just sent an email back to Rich regarding the £10,000 with my personal bank details. \"I would like to clarify if this amount includes my school fees or if the amount of £3,225 (school fee) will be sent directly to the school itself.\" Read more:Mandelson apologises for continuing friendship with EpsteinWhat do we know about Mandelson's relationship with Epstein?Analysis: New Epstein files offer level of insight we never expected Epstein told him: \"includedd [sic].\" Avila da Silva later sent him another email thanking him for the money. It read: \"Just a brief note to thank you for the money which arrived in my account this morning.\" Being mentioned in the Epstein files is not a sign of wrongdoing. Lord Mandelson said in a statement: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" Epstein had pleaded guilty in 2008 to soliciting prostitution and soliciting a minor. Lord Mandelson said earlier this month his friendship with Epstein had been a \"most terrible mistake\". He has continued to deny he was aware of Epstein's crimes, having previously claimed that the disgraced financier did not share the details of his sex life with him because he is gay. Lord Mandelson was sacked as ambassador in September by Prime Minister Sir Keir Starmer as historic emails between him and Epstein were published, revealing the pair's relationship was \"materially different\" to what he had disclosed to the government."
    },
    {
        "title": "New Epstein files offer level of insight we never expected",
        "description": "This is the kind of detail Andrew Mountbatten-Windsor and Sarah Ferguson never wanted us to see. It's embarrassing and exposing.",
        "url": "https://news.sky.com/story/new-epstein-files-offer-level-of-insight-we-never-expected-13501258",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-duke-of-york_7056916.jpg?20251031093012",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2026-01-30 22:10:00",
        "Headline": "Andrew Mountbatten-Windsor is under renewed pressure after the release of new pages from the Epstein files.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n This is the kind of detail Andrew Mountbatten-Windsor and Sarah Ferguson never wanted us to see. It's embarrassing and exposing. We've known for some time about the closeness between the Yorks and Jeffrey Epstein but if genuine these emails give us a new level of insight, about their interactions with the convicted paedophile, what they shared with him and just how much they saw him as a friend and close confidante. From the emails we can see he was apparently welcomed into the fold and the inner sanctum of their palace life. Offered the chance to come into Buckingham Palace in September 2010, invited to Andrew's birthday party at St James's Palace in February 2010, all after his conviction for soliciting prostitution in 2008 and his release in 2009. From the discussions about him lending them money and the exchanges about Andrew being set up with women, you can see he was clearly trusted with their innermost secrets. Epstein files latest: More than three million pages being released It is the obsequious tone with which they write to him which will inevitably anger the victims. It feels like Andrew and Sarah were dependent on him, whether for money or contacts. It appears Epstein had made it that way, made himself invaluable to them, which chimes with Sarah Ferguson's claim last year that she had to appear loyal because he was blackmailing her. Date of the emails is key But away from what's written in the emails, it's when they were written that is also exposing. Just look at the dates and they appear to challenge Andrew and Sarah's recollections of when they apparently tried to cut ties with Epstein. In June 2008, Epstein pleaded guilty to those paedophile charges, he was then released in July 2009. Yet all the email correspondence we see in this latest release of files was sent after they would have known the crimes he'd admitted. Just a month after Epstein was released Sarah Ferguson sent the email describing him as the \"brother she always wished for\". Read more:Andrew Mountbatten-Windsor officially stripped of two more titlesGhislaine Maxwell set to appear before US Congress Andrew claimed in that Newsnight interview that they were photographed together in Central Park in December 2010 because he was trying to honourably end their relationship, and yet in February 2011, they were exchanging emails which appear to suggest Epstein was helping the Yorks with money. It is important to say that the documents don't expose any new accusations of wrongdoing, to this day Andrew has vehemently denied all the allegations against him; the Metropolitan Police also said last year they don't intend to look any further at the suggestions he asked his close protection officer to dig dirt on his accuser Virginia Giuffre. Difficult reading for Royal Family But that doesn't stop this again being really difficult reading for the rest of the Royal Family, further ramping up the scrutiny around Andrew. It will also no doubt embolden those who have called for Andrew to tell-all, whether it's Epstein's victims or the US congress committee who invited him to speak to them about what he knew and what he saw. It has to be pointed out that Andrew Mountbatten-Windsor and Sarah Ferguson are inevitably at the top of everyone's search list. It means that we are inevitably going to report more on documents related to them, and with other high-profile individuals also linked to Epstein they will no doubt find that unfair. But as the brother and ex-sister-in-law of the King it is right that we should be able to question and probe how close they were, these documents giving us again that opportunity, and a level of insight we never expected. Sarah Ferguson has previously said: \"I would never have anything to do with Jeffrey Epstein ever again. I abhor paedophilia and any sexual abuse of children. It was a gigantic error of judgment.\" Sky News has approached Andrew Mountbatten-Windsor and Sarah Ferguson for comment."
    },
    {
        "title": "Epstein files: Key findings so far after more than three million pages released",
        "description": "More than three million pages related to the late sex offender Jeffrey Epstein are being released, the US Department of Justice has announced.&#160;",
        "url": "https://news.sky.com/story/epstein-files-key-findings-so-far-after-more-than-three-million-pages-released-13501245",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein_7116472.jpg?20251220230347",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-30 21:34:00",
        "Headline": "Email exchanges, as well as thousands of videos and images, are included in the latest release from the US Department of Justice.",
        "Content": "More than three million pages related to the late sex offender Jeffrey Epstein are being released, the US Department of Justice has announced.  Email exchanges, as well as more than 2,000 videos and 180,000 images, are included in the latest release. Deputy attorney general Todd Blanche said there have been \"extensive redactions\" to the documents, the disclosure of which \"would constitute a clearly unwarranted invasion of personal privacy\". Mr Blanche said: \"The categories of documents withheld include those permitted under the act to be withheld, files that contain personally identifiable information of victims, personal and medical files and similar files. \"With the exception of [Ghislaine] Maxwell, we did not redact images of any man unless it was impossible to redact the woman without also redacting the man.\" Epstein was found dead in his Manhattan prison cell in August 2019, shortly after he was arrested on sex trafficking charges. High-profile figures have been named in the latest tranche of documents, but that alone does not suggest wrongdoing. Here are the key findings from the Epstein files so far. Follow live - Epstein files latest Sarah Ferguson called Epstein the 'brother I have always wished for' Sarah Ferguson, the former wife of Andrew Mountbatten-Windsor, thanked Epstein for being \"the brother I have always wished for\" in an email sent on 3 August 2009. She also told him that she has \"never been more touched by a friend's kindness than your compliment to me in front of my girls\". In another email, Ferguson called him \"my dear spectacular and special friend\". Her interview with the Evening Standard on 7 March 2011 saw her apologise for accepting £15,000 from Epstein. \"I would never have anything to do with Jeffrey Epstein ever again. I abhor paedophilia and any sexual abuse of children. It was a gigantic error of judgment.\" Just by being mentioned in these documents is not a sign of wrongdoing. Andrew promised Epstein 'lots of privacy' at Buckingham Palace Emails suggest Andrew invited Epstein to Buckingham Palace in September 2010 and promised \"lots of privacy\". After Epstein requested \"private time\", Andrew told him \"alternatively we should have dinner at Buckingham Palace and lots of privacy\". In a statement issued on 17 October 2025, Andrew reiterated that he \"vigorously\" denies the accusations against him. Email exchange about 'beautiful' girl In an email exchange in August 2010, Epstein told Andrew he had \"a friend who I think you might enjoy having dinner with\" and disclosed the dates she would be in London. Epstein said she is 26, Russian, \"beautiful, trustworthy and yes she has your email\". Andrew has reiterated that he \"vigorously\" denies the accusations against him. Ghislaine Maxwell's mugshot Among the trove of files released by the justice department is a police booking intake form for Ghislaine Maxwell, Epstein's former girlfriend who is currently serving a 20-year federal prison sentence for sex trafficking. The intake form includes pictures of Maxwell in an orange jumpsuit, with the date of arrest listed as 2 July 2020. Maxwell appealed against her conviction to the US Supreme Court in October, but it refused to hear her case. Epstein sent money to Lord Mandelson's husband Epstein sent thousands of pounds to Lord Peter Mandelson's husband, Reinaldo Avila da Silva, to help pay for his osteopathy course fees, emails included in the files show. Mr Avila da Silva sent Epstein an email in September 2009 about \"my osteo course expenses, incl fee, anatomical models, lap top if you can help me with this.\" He said the annual fee was £3,225 and went on to thank Epstein for \"anything you can help me with\". Epstein replied the same day: \"I will wire your loan amount immediated'y.\" In a later email, Mr Avila da Silva followed up \"regarding the £10,000 with my personal bank details\" and asked \"if this amount includes my school fees or if the amount of £3,225 (school fee) will be sent directly to the school itself.\" Epstein told him: \"includedd.\" Read more from Sky News:Mangione will not face death penalty if convicted of CEO killingCatherine O'Hara, who starred in Home Alone, has died Mr Avila da Silva later sent him another message confirming receipt of the cash: \"Just a brief note to thank you for the money which arrived in my account this morning.\" Lord Mandelson, the UK's former ambassador to the US, said: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. \"I apologise unequivocally for doing so to the women and girls who suffered.\" He previously said he wished \"I'd never met him [Epstein] in the first place\" and called his friendship with him a \"most terrible mistake\". Just being mentioned in these documents is not a sign of wrongdoing."
    },
    {
        "title": "Father 'wants answers' after five-month-old son was fed now-recalled Nestle baby formula ",
        "description": "A father whose son needed hospital treatment after being fed a now-recalled batch of Nestle baby formula has told Sky News he wants \"answers\" after putting his \"faith and trust\" in the brand.",
        "url": "https://news.sky.com/story/father-wants-answers-after-five-month-old-son-was-fed-now-recalled-nestle-baby-formula-13501174",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rhys-edwards-nestle-baby-formula_7150641.jpg?20260130165507",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2026-01-30 17:21:00",
        "Headline": "The infant, who was sick \"all day\", was found to have been fed tins of SMA formula, since recalled by the food and drink giant after investigators found cereulide, a toxin that can cause vomiting and diarrhoea.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n A father whose son needed hospital treatment after being fed a now-recalled batch of Nestle baby formula has told Sky News he wants \"answers\" after putting his \"faith and trust\" in the brand. The UK Food Standards Agency (FSA) has said it found cereulide, a toxin that can cause vomiting and diarrhoea, in batches of formula produced by food and drink giant Nestle. FSA investigators, along with the UK Health Security Agency (HSA), have been looking into more than 60 batches of Nestle SMA formula since they were recalled earlier this month. At the time of recall, Nestle said it was due to the \"potential presence\" of the heat-resistant toxin and that the move was out of an \"abundance of caution\". The FSA, when asked by Sky News, did not confirm how many batches their tests had revealed to be affected. To date, there have been no confirmed links of illness to the recalled batches. Rhys Edwards' five-month-old son fell ill soon after the New Year. \n                  Starmer hails China reset a success - but not everyone is convinced\n                 \n                  Epstein sent thousands of pounds to Mandelson's husband for osteopathy fees, files show\n                 \n                  New Epstein files offer level of insight we never expected\n                 Mr Edwards, who works in construction, said the boy \"started vomiting and we were obviously a little bit concerned, but we didn't think it was anything, just general kids' stuff. \"And then the next day he started vomiting, full on, all day.\" Mr Edwards took his son to the GP, who sent them to hospital because of concerns about the baby's blood glucose levels and dehydration. While at hospital, a relative sent Mr Edwards information about the Nestle recall. After checking their tins of SMA formula, the family discovered they'd been giving their son one of the affected batches. Mr Edwards said: \"You feel guilty in a way that you've given them this stuff that's potentially got [the toxin] in. It's horrible. \"As parents, it is bewildering, the massive range of formulas on the shelves. So you pick a brand, and you think, 'Okay, this brand is going to be great. It's Nestle.' \"So, you kind of place your faith and your trust in them that all these checks are carried out and that they've got quality control procedures in place to prevent things like this from happening.\" The family, who live in Jersey, immediately switched formula, but Mr Edwards says his son's symptoms continued for several days and he received further hospital treatment again after \"struggling to feed\". Mr Edwards, who has reported his case to Nestle, said his child has \"actually slipped a weight percentile\" and he wants \"answers\" and \"lessons learnt\". In a statement, the FSA said that the problem is down to an ingredient in the formula, an oil, provided by a third-party supplier. It's a supplier Nestle shares with Danone, which has also recalled one batch of its Aptamil baby formula. Following the FSA testing, a Nestle spokesperson said the company \"moved quickly and decisively to voluntarily issue a recall notice on 5th January 2026. \"This was due to the possible presence of cereulide in certain products because of an ingredient used in specific batches. Read more on Sky News:Mother calls for baby formula investigationMultiple baby formula recalls \"We want to reassure everyone that there has been no change to the scope or nature of this recall, and we thank everyone who has got in touch with us for their patience and apologise again that we have had to take this action.\" Earlier this week, Danone said in a statement that its priority \"is to ensure that parents and healthcare professionals can continue to place their trust in the safety and quality of our infant formula products. \"Parents can contact Danone's careline if they have any questions or concerns.\""
    },
    {
        "title": "Prison officer told inmate 'I'm literally praying to have your babies', court hears",
        "description": "A prison officer told an inmate \"I'm literally praying to have your babies\" and she smuggled contraband materials into jail for him, a court has heard.",
        "url": "https://news.sky.com/story/prison-officer-told-inmate-im-literally-praying-to-have-your-babies-court-hears-13501125",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lindholme-prison-doncaster_7150592.jpg?20260130155314",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-30 15:39:00",
        "Headline": "A judge at Sheffield Crown Court described it as \"arguably the worst case\" of a prison officer relationship with an inmate he had ever dealt with.",
        "Content": "A prison officer told an inmate \"I'm literally praying to have your babies\" and she smuggled contraband materials into jail for him, a court has heard. Charlotte Winstanley, 27, was in a \"romantic and intimate\" relationship with gang member Jabhari Blair, 30, for three years, Sheffield Crown Court was told. The judge, Jeremy Richardson KC, described it as \"arguably the worst case\" of a prison officer relationship with an inmate he had ever dealt with. Winstanley smuggled a mobile phone into HMP Lindholme, near Doncaster, over which they sent intimate photos and videos, the court heard. In texts read to the court on Friday, the pair described Mondays as their \"date nights\". What did the messages say? One message from the prison officer to the inmate read: \"I'm literally praying to have your babies.\" \n                  86 arrests after protesters breach Wormwood Scrubs prison grounds holding Palestine Action-linked activist\n                 \n                  UK prisons to learn from Ukraine's anti-drone measures to fight jail drops\n                 \n                  Government spending £4m a year on empty prison, MP report finds\n                 Another from Winstanley said: \"Life starts now, baby. Every sacrifice I make I do so I can be with you.\" A third read: \"I love my job but I love you more.\" One message from Blair indicated that he \"can't wait to give Miss Winstanley a beautiful baby\", prosecutor Aaron Dinnes told the judge. Prison cameras also picked up intimate moments of them touching and disappearing together into rooms, the court heard. 'Link to outside' Winstanley acted as Blair's \"link to outside\", with investigators finding a link he provided to the Argos website, detailing items he wanted smuggling into prison, and she even visited his mother at her home in Leeds, said the prosecutor. Mr Dinnes said Winstanley tipped off Blair about prisoner movements, other inmates' healthcare and a search of his own cell. This was particularly serious because Blair belonged to an organised crime group who was jailed for 12-and-a-half years for violence in 2014, Mr Dinnes told the court. He said Blair pledged to use his prison contacts to make sure Winstanley would \"remain protected\" and had \"told her that somebody was ready to fight immediately, if necessary\". Read more from Sky News:MND drug a lifeline for some - 'mental torture' for othersAI mammograms result in fewer aggressive breast cancers - study The court heard how Winstanley only finished her training as a prison officer in April 2022 but had worked in the prison before this as an operational support officer. Part of her training had specifically focused on relationships and corruption, the court heard. 'Recipe for disaster' Khadim Al'Hassan, defending Winstanley, told the judge his client was only 22 when she began work at the prison and Blair was her first \"boyfriend\" since she was a teenager. He said her lack of maturity and life experience was a \"recipe for disaster\". Judge Jeremy Richardson KC told Winstanley and Blair: \"This is arguably the worst case of its kind I have personally dealt with. \"It must be immediate custody but I'm not sure I should rush to judgment.\" When will pair be sentenced? The judge said he would consider the case before sentencing the pair on Monday. Winstanley cried in the dock as the judge said to her: \"For a prison officer, young or old, to have conducted a sexual affair with a prisoner is bad enough. \"For it to be over a prolonged period of time worsens the matter. \"And, then, to be a party to smuggling in various items and to brazen it out when prison officials raise issues and give you an opportunity to confess - and it gets worse.\" He told Blair he had \"corrupted a prison officer\" and this was \"about as bad as it gets\". The judge remanded both defendants in custody. Winstanley, of Coronation Road, Doncaster, has admitted misconduct in public office and transmitting a photograph from inside a prison. Blair, who is a serving prisoner but formerly from Leeds, has admitted possessing cannabis and prohibited items, namely a phone and a USB stick."
    },
    {
        "title": "Leading UK hospital in Cambridge under 'rapid but thorough' review",
        "description": "One of the country's leading neuroscience units is under urgent review following concerns about the service.",
        "url": "https://news.sky.com/story/leading-uk-hospital-in-cambridge-under-rapid-but-thorough-review-13501195",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-addenbrookes-hospital_6869032.jpg?20250327222817",
        "type": "UK",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2026-01-30 18:06:00",
        "Headline": " Addenbrooke's Hospital in Cambridge had already been under investigation over the practices of a suspended surgeon.",
        "Content": "By Laura Bundock, health correspondent  One of the country's leading neuroscience units is under urgent review following concerns about the service. The neuroscience service at Addenbrooke's Hospital in Cambridge helps treat complex brain injuries and head trauma cases. The hospital's trust, Cambridge University Hospitals (CUH), took the unusual step of ordering a \"rapid but thorough\" review which will look at a \"number of clinical teams\". The review will be independent and carried out by two official health bodies. Suspended surgeon It comes just months after Sky News revealed another investigation at the same hospital into a suspended orthopaedic paediatric surgeon. An independent review was ordered into Kuldeep Stohr last year after serious issues were found with some of her surgeries on children. Read more:Anger as report exposes hospital's failingsHospital accused of 'covering up' concerns The report found the trust had missed multiple opportunities to act on concerns raised about her surgeries. Addenbrooke's is a world-renowned hospital benefitting from the prestige of close associations with Cambridge University. 'The review is examining a number of clinical teams' The rapid independent investigation into the neuroscience service will finish by the end of February, with the findings sent to the trust by the summer. CUH says it will publish the results and act on all the recommendations. It's understood the review will look at the whole service and not one individual. A CUH spokesperson said: \"Patient safety is our highest priority. We continually review outcomes across our services to identify where improvements can be made and to ensure patients receive the best possible care. \"The review is examining a number of clinical teams to identify opportunities to strengthen clinical governance arrangements.\""
    },
    {
        "title": "Accidentally freed sex offender jailed for punching and biting police officers",
        "description": "A convicted sex offender who was accidentally freed from jail has been sentenced to 26 weeks in prison for punching and biting two police officers.",
        "url": "https://news.sky.com/story/accidentally-freed-sex-offender-jailed-for-punching-and-biting-police-officers-13501083",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brahim-kaddour-cherif_7074623.jpg?20251107110616",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-30 13:58:00",
        "Headline": "An Algerian asylum seeker, who became the centre of a nationwide manhunt after he was wrongly freed from prison, has been handed a 26-week jail sentence for assaulting two police officers.",
        "Content": "A convicted sex offender who was accidentally freed from jail has been sentenced to 26 weeks in prison for punching and biting two police officers. Brahim Kaddour-Cherif, 24, was at the centre of a nationwide manhunt after he was mistakenly released from HMP Wandsworth, south west London, on 29 October last year. The Algerian asylum seeker was arrested in Finsbury Park, north London, on 7 November. The blunder was among a number of wrongful inmate releases, that engulfed the government in a political crisis and led to promises of tougher security measures. Kaddour-Cherif was facing three live criminal cases and was under investigation for a fourth when he was freed. At Highbury Corner Magistrates' Court on Friday, Kaddour-Cherif was sentenced to 26 weeks in prison for assaulting two police officers at Blackhorse Road Underground station, east London, on 20 July. Off-duty police constable Bradley Glynn saw Kaddour-Cherif take a mobile phone from a sleeping passenger while on the Tube. \n                  Asylum seeker jailed for murdering hotel worker Rhiannon Skye Whyte in Walsall\n                 \n                  Paedophile nursery worker Vincent Chan admits 30 new charges\n                 \n                  Newborn baby in 'serious condition' after mother hit by e-bike while pregnant\n                 PC Glynn snatched the phone out of Kaddour-Cherif's pocket and handed it back to the owner and ordered him to get off the train. Prosecutor Kevin Kendridge said PC Glynn shouted \"thief\" in a bid to get Kaddour-Cherif to go away, after he looked like he was trying to reboard the train. \"(Kaddour-Cherif) punched him to the left side of his head with a closed fist, and the off-duty officer punched the defendant back,\" Mr Kendridge said. PC Jason Norton, who was on duty at the station, attempted to defend PC Glynn as Kaddour-Cherif threw several punches, the court heard. \"Together they tried to take control of the defendant, but he managed to punch PC Glynn again and also bite him,\" Mr Kendridge said. \"He slammed PC Norton against a wall and dug his face into PC Norton's arm, at which point the officer shouted 'don't bite me'.\" The court was shown pictures of bite marks left on one of the officer's arms. At a hearing earlier in January, Kaddour-Cherif pleaded guilty to two charges of assaulting an emergency worker, but insisted he did not know at the time that the two men were police officers. Magistrate Elizabeth Robb sentenced Kaddour-Cherif to 26 weeks in prison and ordered him to pay £154 in compensation to the officers. \"It was a serious assault in both cases, prolonged and quite nasty,\" she said. Addressing the court over videolink from HMP Pentonville, Kaddour-Cherif contested the version of events and accused his lawyers of not reading his statement. \"How could I fight two guys? It was two on one. I'm not that strong,\" he said. \"They are lying.\" He also claimed he had been attacked and stabbed in prison. Read more from Sky News:Asylum seeker jailed for murdering hotel workerTwo men arrested over rubbish dumped in Oxfordshire Kaddour-Cherif has overstayed his visa since 2020, and has racked up a string of convictions. He became a registered sex offender in November 2024 after he was convicted of exposing himself in a London park. Prison authorities let Kaddour-Cherif go on 29 October 2025 after he was found not guilty of breaching the conditions of the sex offender register, without realising that he was supposed to be held in custody to await another trial for burglary. After being arrested and returned to custody, he pleaded guilty to the burglary and knife offences, as well as failing to surrender to a court, and he was sentenced on Tuesday this week to 188 days in prison."
    },
    {
        "title": "China lifts sanctions on MPs and peers, Starmer says ",
        "description": "China has lifted restrictions on some British MPs and peers and will now allow all parliamentarians to visit the country, Sir Keir Starmer has said.",
        "url": "https://news.sky.com/story/china-lifts-sanctions-on-mps-and-peers-starmer-says-13500981",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kier-starmer-beth-rigby_7150320.jpg?20260130114316",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-30 10:05:00",
        "Headline": "The prime minister said the country has removed restrictions that prevented some parliamentarians from visiting, but one of those sanctioned said: \"It's not a win, it's a capitulation.\"",
        "Content": "China has lifted restrictions on some British MPs and peers and will now allow all parliamentarians to visit the country, Sir Keir Starmer has said. Speaking to Sky News's political editor Beth Rigby, the prime minister said the sanctions have been a \"real cause for concern across parliament\", and he had raised the issue with China's President Xi Jinping during the trip. \"As a result [of discussions], it's clear from the Chinese that the restrictions no longer apply,\" Sir Keir said. \"President Xi said what that means is that all parliamentarians are free to travel to China.\" Politics Hub: Follow the latest updates It's understood the UK will not be lifting any sanctions on Chinese officials in return. China sanctioned five Conservative MPs and two members of the House of Lords in 2021, which was seen as retaliation for sanctions by the UK and other countries on several Chinese officials for their connection to reports of human rights violations. They were banned from entering China, Hong Kong and Macau. The MPs sanctioned were former Tory leader Sir Iain Duncan Smith, Nusrat Ghani, Neil O'Brien, and former security minister Tom Tugendhat, as well as Tim Loughton, who stood down from the Commons at the 2024 general election. China also sanctioned Labour peer and human rights barrister Baroness Helena Kennedy, and crossbench peer Lord David Alton. All are fierce critics of China. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Mr Tugendhat told Sky News that Sir Keir had \"traded away sanctions that mean nothing to us\". \"He's traded away, for six people, these sanctions as though somehow it's a win. It's not a win, it's a capitulation,\" he said. In a statement, the seven current and former parliamentarians said it appeared sanctions on former MP Mr Loughton had not been lifted. The statement said: \"The selective lifting of sanctions solely on sitting parliamentarians is wrong. Parliament exists to represent and defend the people of the United Kingdom. Seeking or accepting preferential treatment for current MPs and peers sends a damaging signal that some are more deserving of protection than others.\" Mr Loughton told Sky News he didn't know whether he was still sanctioned or not. He said he would be \"delighted\" to be unsanctioned, \"but not as part of a grubby deal\" that could mean the \"UK government's going to go light on [China's] enormous human rights abuses\". Responding to criticism that he shouldn't have visited China in the first place due to the country's human rights abuses, Sir Keir said he wouldn't have been able to get the sanctions lifted had he not made the visit. \"That's something that couldn't have happened if we weren't here, having the leader-to-leader exchange. It doesn't happen if you stick your head in the sand,\" he told Sky News. The prime minister also told Rigby he had raised the case of imprisoned British-Chinese dual national Jimmy Lai with Mr Xi. Mr Lai, who is a Hong Kong media tycoon and pro-democracy campaigner, has been held in a high-security prison for five years and in December was found guilty of national security offences. Sir Keir refused to say whether any progress had been made in securing Mr Lai's release: \"I won't go into the details, but I'm absolutely clear about raising it, the manner in which we raised it and the importance of raising it.\" He said it wasn't \"awkward\" to raise the case with Mr Xi, and said, as with discussing the sanctioned parliamentarians, \"the purpose of engaging is to seize the opportunities that open up as a result of engagement\". Asked what security precautions he had taken on visiting China amid concerns he could be bugged, the prime minister said: \"On a visit like this, of course, we took the necessary precautions.\" However, he said he wasn't advised to dress under bed covers, as Theresa May was when she visited China as prime minister in 2018."
    },
    {
        "title": "What do we know about the number of people killed in Iran protests?",
        "description": "Thousands of people have been killed in Iran's deadly protests, but deaths are still being verified, with conflicting reports. Here's what we know.",
        "url": "https://news.sky.com/story/what-do-we-know-about-the-number-of-people-killed-in-iran-protests-13501129",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dxf-teaser_7137212.jpg?20260130170320",
        "type": "World",
        "Author": "Alicja Hagopian, data journalist",
        "Date Published": "2026-01-30 15:51:00",
        "Headline": "Estimates from human rights organisations and doctors range from over 5,000 at the conservative end to 33,000 by one count, and even as high as 50,000, according to one unverified claim.",
        "Content": "By Alicja Hagopian, data journalist  Thousands of people have been killed in Iran's deadly protests, but deaths are still being verified, with conflicting reports. Here's what we know. Estimates from human rights organisations and doctors, independent of the Iranian regime's official figures, range from over 5,000 at the conservative end to 33,000 by one count, and even as high as 50,000, according to one unverified claim. Iranian authorities imposed a near-total internet blackout, which has only partially lifted, from 8 to 27 January. As a result, it has been near-impossible to verify the true number of people who have been killed in the brutal crackdown. Nicholas Hopton, former UK ambassador to Iran from 2016 to 2018, told Sky News that Iranian authorities were limiting information on the number of people killed. \"It is becoming increasingly clear since the internet coverage has been partially restored in the last week, that many thousands, possibly tens of thousands of innocent people, were killed during the crackdown by the Islamic regime,\" he said. The Iranian Islamic Republic previously said 3,117 people have been killed, claiming the majority of these deaths were security forces and civilians, not protesters. But this number has been questioned by doctors, diplomats and human rights organisations. \"One should view any statistics being given by the Iranian authorities with a big dose of scepticism,\" Mr Hopton added. The UN's special rapporteur on Iran, Mai Soto, has said at least 5,000 people have been killed at a \"minimum\" - substantially more than the authorities' claims. Human rights agencies also warn the numbers are much higher. The US-based Human Rights Activists News Agency (HRANA) has independently verified 6,540 deaths so far, with a further 17,091 cases under review, bringing the possible total up to over 23,500. It said just 214 deaths verified so far have been government-affiliated, such as security forces, while the majority, 6,148, have been protesters, 123 were under 18 and 55 were civilians. Doctors claim tens of thousands have been killed Meanwhile, two doctors have told Sky News they believe tens of thousands of people have been killed. Germany-based eye surgeon Dr Amir-Mobarez Parasta claimed major hospitals and clinics inside Iran have seen over 25,000 clinically recorded deaths as of 23 January. Dr Parasta is a supporter of Reza Pahlavi, the son of the former shah of Iran, who lives in the US and is a prominent voice encouraging protests against the regime. He said he had collected the figures from a network of doctors and medical professionals across Iran, and claimed they had been verified by at least two individuals in each hospital or clinic where the data was from. Sky News has not seen the clinical reports he cited and is unable to independently verify the figure. Dr Yaser Rahmani-Rad, a specialist in internal medicine at a Tehran hospital who was previously arrested in 2023 for treating protesters, also believes the number of people killed is in the tens of thousands. Some doctors have been arrested for treating protesters during this bout of unrest, Sky News previously reported. High number of deaths recorded in capital Of the deaths Dr Parasta claims have been clinically recorded, a third (8,354) were in Tehran alone. As the nation's capital and largest city, Tehran was a hotbed of protest activity and is widely considered to be the location of the first protests on 28 December. Nearly 900 protests were identified between 28 December and 13 January, through research from Sky News and the Institute for the Study of War (ISW). Dr Parasta's report estimates that with a lack of data from areas across Iran and around 15% of deaths likely being underreported at this stage, the true number of people who have died is likely higher - at least 33,130. Former UN prosecutor and human rights lawyer Payam Akhavan told Sky News he believes that estimate is credible, though Dr Parasta said he considers his figure to be \"conservative\". \"Our ongoing data collection shows a continued and significant rise in hospital-reported deaths, reflecting both the sustained intensity of the violence and the severe strain on an already overwhelmed healthcare system,\" he said. The son of the former shah of Iran, Reza Pahlavi, has said the figure could be as high as 50,000 dead, without providing evidence to support the claim. A 'massacre' amid internet blackouts  On 8 January, observed protest activity reached its peak and the internet blackout began. Now, reports from doctors suggest the days which followed were the deadliest for protesters. \"The concentration and scale of fatalities during this period compel us to speak of a massacre-level event,\" Dr Parasta told Sky News. Sky News has verified footage from several locations around Iran during this period, which appears to show security forces opening fire on protesters. One picture posted on social media shows a machine gun mounted on top of a military vehicle in Tehran. Mr Hopton, the former ambassador, said 8 and 9 January were particularly fatal. Dr Rahmani-Rad, who is based in Tehran, said: \"What happened in Iran over those two days is something the world has never seen with its own eyes. \"I still cannot believe that something like this actually happened. I still haven't fully accepted it.\" Putting the numbers into perspective  Defining the number of those killed in previous protests in Iran is similarly contentious, with competing narratives from authorities and human rights organisations. During the Iranian Revolution in 1979 - previously believed to be the most violent in Iran's history - it is estimated between 532 and 2,781 people died, according to military historian Spencer C Tucker, who has written several books on revolutions and the Middle East. The Iranian regime has put this figure much higher, at 60,000 deaths, which Mr Tucker claims is \"grossly overstated […] for propaganda purposes\". Former ambassador Mr Hopton said: \"Already, a lot more people have been killed in these protests than at any time since the 1979 revolution. But we just don't know the statistics yet.\" Human rights organisations said at least 550 people died in protests following the death of Mahsa Amini in 2022, while Iranian authorities claimed the figure was lower at 202. Yet the scale of fatalities in the latest protests is, by the authorities' own admission, undoubtedly larger than in 2022 - leading Dr Rahmani-Rad to call the brutality \"unprecedented in history\". \"The only thing I can do is hope that the world becomes aware of what happened in Iran, that people around the world understand exactly what took place,\" he told Sky News. Sky News has approached the Iranian embassy for confirmation of the number of people killed, but received no response. The Data x Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Gazans face question of returning to devastated homeland as Rafah crossing reopens",
        "description": "The reopening of the Rafah crossing feels like it should be an important moment. Symbolically, it is. From Sunday, people will be able to cross from Gaza to Egypt, and back again. Sort of.",
        "url": "https://news.sky.com/story/gazans-face-question-of-returning-to-devastated-homeland-as-rafah-crossing-reopens-13501090",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-rafah-crossing-gaza_7146115.jpg?20260130141830",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-30 14:10:00",
        "Headline": "The reopening will also allow as many as 20,000 to leave Gaza for medical treatment.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n The reopening of the Rafah crossing feels like it should be an important moment. Symbolically, it is. From Sunday, people will be able to cross from Gaza to Egypt, and back again. Sort of. As ever, the headline is one thing and the detail is quite another. The Rafah Crossing will be open, but in a very limited way. For one thing, the only people who will be allowed to travel from Egypt into Gaza will be those who left Gaza during the war. The number of people allowed to return in this way will be limited, reportedly to 150 per day. It's understood that Israel will not put a limit on the number of people it allows to leave. Each person who plans to use the crossing will have to apply in advance for security screening, which will be carried out by the Shin Bet, Israel's security service. Those leaving Gaza will then undergo a screening on the ground, carried out by officials from Egypt and the European Union, with the EU acting as monitors. The Palestinian Authority will also have officials at the crossing. It will be complicated and, when the crossing first opens, there will no doubt be friction in the system. Israel will, I am told, have no personnel on the ground, but will be involved remotely, using facial recognition technology to check each person leaving the Strip to look for those that it considers to be dangerous extremists. There will, however, be a much more tangible Israeli presence for those going the other direction - from Egypt back into Gaza. There, having come through security checks on the Egyptian side, people will have to go through an Israeli checkpoint before being permitted to enter Gaza. Expect this process to be laborious. The Gaza side of the crossing has been under Israeli military control since May 2024, when Israel troops took control of that area. Its reopening was part of the American-led peace plan. Palestinian officials suggest that around 100,000 people have fled Gaza since the war began. Read more from Sky News:Guardiola gives speech in support of Palestinian childrenA warning to the West from inside IS camp With the reopening of the Rafah crossing, many will now face the question of whether they wish to return to their homes, knowing that much of the Strip has been reduced to rubble. Half of it is also under military occupation, with a so-called \"yellow line\" dividing Gaza into two between the Israel-occupied half and the remainder, where Hamas remains largely in control. The reopening of the crossing will also allow for thousands of people who require medical treatment to be taken out of Gaza - a number that, the World Health Organisation has suggested, could be nearly 20,000."
    },
    {
        "title": "Pep Guardiola gives passionate speech in support of Palestinian children",
        "description": "&#8203;&#8203;&#8203;&#8203;&#8203;&#8203;&#8203;Pep Guardiola has given a passionate speech in support of Palestinian children and called for action.",
        "url": "https://news.sky.com/story/pep-guardiola-gives-passionate-speech-in-support-of-palestinian-children-13501005",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pep-guardiola-barcelona_7150252.jpg?20260130105016",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-30 10:58:00",
        "Headline": "The Manchester City boss' appearance at a rally in Barcelona last night comes in the midst of the football season, with his team scheduled to play on Sunday.",
        "Content": "​​​​​​​Pep Guardiola has given a passionate speech in support of Palestinian children and called for action. The Manchester City manager missed his usual pre-weekend news conference on Friday after speaking at a charity concert in Barcelona on Thursday evening. Guardiola wore a keffiyeh scarf as he spoke of his pain at seeing children suffering. \"Good evening, salam alaikum, how wonderful,\" the 55-year-old said at the event. \"When I see a child in these past two years with these images on social media, on television, recording himself, pleading, 'where is my mother?' among the rubble and he still doesn't know it. \"And I always think: 'What must they be thinking?' And I think we have left them alone, abandoned. \"I always imagine them saying: 'Where are you? Come help us.' \"And even now, we haven't done it. Perhaps because those in power are cowards, because they basically send innocent young people to kill innocent people.\" He called for a \"step forward\" as he made what he called \"a statement for Palestine and... a statement for humanity\". Manchester City had said that Guardiola would miss Friday's news conference for personal reasons, with assistant Pep Lijnders taking his place to preview Sunday's match against Tottenham Hotspur. Read more from Sky News:Israel says Rafah crossing will have 'limited' reopeningAnalysis: Trump's peace board invitation is gift for Putin Despite a fragile ceasefire being agreed between Hamas and Israel in October, more than 400 Palestinians are reported to have been killed in the months since, according to Gaza's health ministry. Israel's military now accepts that around 70,000 Palestinians have been killed during ‌the war in Gaza, according to Israeli media citing senior military officials."
    },
    {
        "title": "Venezuela approves bill to open up oil sector to private firms as US eases sanctions",
        "description": "Venezuela's interim president Delcy Rodriguez has signed a law opening the country's oil sector to privatisation.",
        "url": "https://news.sky.com/story/venezuela-approves-bill-to-open-up-oil-sector-to-private-firms-as-us-eases-sanctions-13500974",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-venezuela-delcy-rodriguez_7150392.jpg?20260130123455",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-30 09:53:00",
        "Headline": "A bill that will end the monopoly of state-owned Petroleos de Venezuela SA in the oil sector has been passed by Venezuela's National Assembly, less than a month after the US captured Nicolas Maduro.",
        "Content": "Venezuela's interim president Delcy Rodriguez has signed a law opening the country's oil sector to privatisation. The National Assembly approved the bill to lure in foreign investment on Thursday - as the US eased sanctions on Venezuela's oil industry. The move authorises US firms to buy, sell, transport, store and refine Venezuelan crude oil, but does not lift existing US sanctions on production. A White House official said more announcements ​on the easing of sanctions would follow. Venezuelan legislators approved the overhaul of the country's oil sector less than a month after a US military operation to seize former president Nicolas Maduro. The legislation promises to give private companies control over the production and sale of oil, ending the monopoly of state-owned Petroleos de Venezuela SA. A private company \"will assume full management of the activities at its own expense, account, and risk, after demonstrating its financial and technical capacity through a business plan approved by\" Venezuela's oil ministry, under the new law. The legislation will also allow for disputes to be settled independently, rather than through the Venezuelan courts, in a move that has been viewed as vital to guarding against future expropriation. The revised law would also modify extraction taxes, setting a royalty cap rate of 30% and allowing the executive branch to set percentages for each project based on capital investment needs, competitiveness and other factors. The ⁠reforms are expected to encourage increases in oil and gas production and foreign investment following a $100bn reconstruction plan for the industry proposed by US President Donald Trump this month. Ms Rodriguez's government expects the changes to serve as assurances for major US oil companies that have so far hesitated about returning to Venezuela. Some of those companies lost investments when the ruling party enacted the existing law two decades ago to favour Venezuela's state-run oil company, PDVSA. \"We're talking about the future. We are talking about the country that we are going to give to our children,\" Ms Rodriguez said of the reforms. The proposal was submitted, discussed and approved in less than two weeks. Oil workers dressed in red jumpsuits and hard hats celebrated the bill's approval, waving Venezuelan flags inside the legislative palace in Caracas. Read more from Sky News:Trump endorses deal with Democrats to avert shutdownSurvivors struggle in massive Mozambique floods The White House has previously said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation. The oil - worth upwards of $2bn (£1.48bn) - will be taken from storage by ships and brought directly to US unloading docks, the president said on on his social media platform Truth Social earlier this month. Ms Rodriguez spoke with Mr Trump and US secretary of state Marco Rubio on Thursday. Days earlier, Mr Rubio told a US Senate hearing how the administration planned to manage the sale of tens of millions of barrels of oil from Venezuela. Thursday's events pave the way for yet another radical geopolitical and economic shift in Venezuela - which has the largest proven reserves of crude in the world. Maduro's predecessor Hugo Chavez made heavy state control over the oil industry a pillar of his socialist-inspired revolution. First-elected in 1998, he expanded social services, including housing and education, funded by oil revenues."
    },
    {
        "title": "Trump endorses deal struck with Democrats to avert government shutdown",
        "description": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security.",
        "url": "https://news.sky.com/story/trump-endorses-deal-struck-with-democrats-to-avert-government-shutdown-13500874",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-cabinet-meeting_7149661.jpg?20260129164331",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-30 00:20:00",
        "Headline": "The move comes as the US reels from the deaths of two protesters at the hands of federal agents in Minneapolis.",
        "Content": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security. The move comes as the US reels from the deaths of two protesters at the hands of federal agents in Minneapolis. \"Republicans and Democrats have come together to get the vast majority of the government funded until September\" while extending current funding for Homeland Security, Mr Trump said in a Truth Social post on Thursday evening. He said he hoped members of both parties would cast a \"much needed Bipartisan 'YES' vote\". The two sides have agreed to separate homeland security funding from a bigger spending bill and fund the Homeland department for two weeks while they debate Democratic demands for curbs on the US Immigration and Customs Enforcement agency. The deal follows a Democrats vote to block legislation to fund the DHS on Thursday. They have been pushing to remove funding for the DHS, of which ICE is a part, from the $1.2tn government spending package after the killing of Alex Pretti by federal agents in Minneapolis on Saturday. Passage of the agreement was delayed late on Thursday as Senate leaders were still working to win enough support for the package. Mr Trump earlier told his cabinet that he was optimistic of avoiding a shutdown. The rare bipartisan talks between Mr Trump and Senate Democratic leader Chuck Schumer came after calls by senators in both parties for a full investigation into Mr Pretti's killing. The standoff has threatened to plunge the nation into another shutdown, just two months after Democrats blocked a spending bill over expiring federal healthcare subsidies. The government was closed for 43 days as Republicans refused to negotiate. The shutdown ended when a small group of moderate Democrats tore away to strike a deal with Republicans, but Democrats are more unified this time after the fatal shootings of Mr Pretti and Renee Good by federal agents. Read more:Alex Pretti clashed with federal agents week before deathIt's genuinely frightening to wonder where America goes next 👉 Follow Trump100 on your podcast app 👈  Meanwhile, a new poll shows Mr Trump's approval rating has dropped during his administration's immigration crackdown. The research, conducted by Pew between 20 and 26 January, shows the US president's approval rating stands at 37%, down from 40% last Autumn. Half of the Americans surveyed say the administration's actions have been worse than they expected. Asked specifically about immigration policies, 74% of Americans believe it's acceptable for ordinary people to record ICE arrests. More than half (59%) said it's acceptable for people to share information about where ICE operations are taking place."
    },
    {
        "title": "Epstein files: Key findings so far after more than three million pages released",
        "description": "More than three million pages related to the late sex offender Jeffrey Epstein are being released, the US Department of Justice has announced.&#160;",
        "url": "https://news.sky.com/story/epstein-files-key-findings-so-far-after-more-than-three-million-pages-released-13501245",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein_7116472.jpg?20251220230347",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 21:34:00",
        "Headline": "Email exchanges, as well as thousands of videos and images, are included in the latest release from the US Department of Justice.",
        "Content": "More than three million pages related to the late sex offender Jeffrey Epstein are being released, the US Department of Justice has announced.  Email exchanges, as well as more than 2,000 videos and 180,000 images, are included in the latest release. Deputy attorney general Todd Blanche said there have been \"extensive redactions\" to the documents, the disclosure of which \"would constitute a clearly unwarranted invasion of personal privacy\". Mr Blanche said: \"The categories of documents withheld include those permitted under the act to be withheld, files that contain personally identifiable information of victims, personal and medical files and similar files. \"With the exception of [Ghislaine] Maxwell, we did not redact images of any man unless it was impossible to redact the woman without also redacting the man.\" Epstein was found dead in his Manhattan prison cell in August 2019, shortly after he was arrested on sex trafficking charges. High-profile figures have been named in the latest tranche of documents, but that alone does not suggest wrongdoing. Here are the key findings from the Epstein files so far. Follow live - Epstein files latest Sarah Ferguson called Epstein the 'brother I have always wished for' Sarah Ferguson, the former wife of Andrew Mountbatten-Windsor, thanked Epstein for being \"the brother I have always wished for\" in an email sent on 3 August 2009. She also told him that she has \"never been more touched by a friend's kindness than your compliment to me in front of my girls\". In another email, Ferguson called him \"my dear spectacular and special friend\". Her interview with the Evening Standard on 7 March 2011 saw her apologise for accepting £15,000 from Epstein. \"I would never have anything to do with Jeffrey Epstein ever again. I abhor paedophilia and any sexual abuse of children. It was a gigantic error of judgment.\" Just by being mentioned in these documents is not a sign of wrongdoing. Andrew promised Epstein 'lots of privacy' at Buckingham Palace Emails suggest Andrew invited Epstein to Buckingham Palace in September 2010 and promised \"lots of privacy\". After Epstein requested \"private time\", Andrew told him \"alternatively we should have dinner at Buckingham Palace and lots of privacy\". In a statement issued on 17 October 2025, Andrew reiterated that he \"vigorously\" denies the accusations against him. Email exchange about 'beautiful' girl In an email exchange in August 2010, Epstein told Andrew he had \"a friend who I think you might enjoy having dinner with\" and disclosed the dates she would be in London. Epstein said she is 26, Russian, \"beautiful, trustworthy and yes she has your email\". Andrew has reiterated that he \"vigorously\" denies the accusations against him. Ghislaine Maxwell's mugshot Among the trove of files released by the justice department is a police booking intake form for Ghislaine Maxwell, Epstein's former girlfriend who is currently serving a 20-year federal prison sentence for sex trafficking. The intake form includes pictures of Maxwell in an orange jumpsuit, with the date of arrest listed as 2 July 2020. Maxwell appealed against her conviction to the US Supreme Court in October, but it refused to hear her case. Epstein sent money to Lord Mandelson's husband Epstein sent thousands of pounds to Lord Peter Mandelson's husband, Reinaldo Avila da Silva, to help pay for his osteopathy course fees, emails included in the files show. Mr Avila da Silva sent Epstein an email in September 2009 about \"my osteo course expenses, incl fee, anatomical models, lap top if you can help me with this.\" He said the annual fee was £3,225 and went on to thank Epstein for \"anything you can help me with\". Epstein replied the same day: \"I will wire your loan amount immediated'y.\" In a later email, Mr Avila da Silva followed up \"regarding the £10,000 with my personal bank details\" and asked \"if this amount includes my school fees or if the amount of £3,225 (school fee) will be sent directly to the school itself.\" Epstein told him: \"includedd.\" Read more from Sky News:Mangione will not face death penalty if convicted of CEO killingCatherine O'Hara, who starred in Home Alone, has died Mr Avila da Silva later sent him another message confirming receipt of the cash: \"Just a brief note to thank you for the money which arrived in my account this morning.\" Lord Mandelson, the UK's former ambassador to the US, said: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. \"I apologise unequivocally for doing so to the women and girls who suffered.\" He previously said he wished \"I'd never met him [Epstein] in the first place\" and called his friendship with him a \"most terrible mistake\". Just being mentioned in these documents is not a sign of wrongdoing."
    },
    {
        "title": "Luigi Mangione will not face death penalty over killing of CEO, judge rules",
        "description": "A US judge has ruled that Luigi Mangione will not face the death penalty if he is convicted over the killing of UnitedHealthcare CEO Brian Thompson.",
        "url": "https://news.sky.com/story/luigi-mangione-will-not-face-death-penalty-over-killing-of-ceo-judge-rules-13501115",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-luigi-mangione-court_7114246.jpg?20260130192714",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 15:12:00",
        "Headline": " A federal murder charge against Mangione was dismissed by US District Judge Margaret Garnett, who found it was technically flawed.",
        "Content": "A US judge has ruled that Luigi Mangione will not face the death penalty if he is convicted over the killing of UnitedHealthcare CEO Brian Thompson. US District Judge Margaret Garnett dismissed a federal murder charge against Mangione, finding it was technically flawed. She also dismissed a gun charge, but left in place stalking charges that carry a maximum punishment of life in prison. The 27-year-old has pleaded not guilty. Mangione also faces nine counts in a case brought by New York state prosecutors, including second-degree murder and various weapons charges. He has pleaded not guilty in that case too. In order to seek the death penalty, prosecutors were required to show Mangione killed Mr Thompson while committing another \"crime of violence\". Judge Garnett said stalking did not fit that definition, citing case law and legal precedents. She noted her decision to dismiss the federal murder charge was to \"foreclose the death penalty as an available punishment to be considered by the jury\". The ruling was a setback for the Trump administration, which had called Mr Thompson's death a \"premeditated, cold-blooded assassination\". Prosecutors have 30 days to appeal the ruling. Judge Garnett also ruled that prosecutors would be able to use evidence collected from Mangione's backpack during his arrest, which included a 9mm handgun and a notebook in which authorities said Mangione described his intent to \"wack\" an insurance executive. Mangione's lawyers had sought to dismiss that evidence from trial, arguing the search was illegal because police had not yet obtained a warrant. Mr Thompson was killed on 4 December 2024 as he walked to a New York City hotel for his company's annual investor conference. Video footage showed a masked gunman shooting the 50-year-old from behind. Police said the words \"delay\", \"deny\" and \"depose\" were written on the ammunition, an apparent reference to a phrase used to describe how insurers avoid paying claims. Mangione, an Ivy League graduate, was arrested five days later in Pennsylvania. After several days of court proceedings there, Mangione was transferred to the Metropolitan Detention Center in Brooklyn, where he is currently being held. Jury selection in the federal case is scheduled to begin on 8 September. The state trial has not been scheduled yet. However, the Manhattan district attorney's office sent a letter on Wednesday urging the judge in that case to set a trial date of 1 July. Read more from Sky News:Trump reveals his 'great' pick for US central bank bossICE victim seen in earlier clash with agents in new footage The ruling comes a day after a 36-year-old man was charged with impersonating an FBI agent in an apparent bid to free Mangione from jail. Authorities said Mark Anderson, from Minnesota, was arrested after claiming he was an FBI agent in possession of paperwork \"signed by a judge\" authorising the release of a specific inmate, whom a law enforcement source identified as Mangione. After searching his bag, officers found a barbecue fork and a circular steel blade that resembled a pizza cutter, according to a complaint filed against Anderson."
    },
    {
        "title": "Epstein sent thousands of pounds to Mandelson's husband for osteopathy fees, files show",
        "description": "Jeffrey Epstein wired thousands of pounds after Lord Peter Mandelson's husband asked him to pay for his osteopathy course fees, according to emails included in newly released Epstein files. ",
        "url": "https://news.sky.com/story/epstein-sent-thousands-of-pounds-to-mandelsons-husband-for-osteopathy-fees-files-show-13501237",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-peter-mandelson_7150837.jpg?20260130212842",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 21:05:00",
        "Headline": "In September 2009, Lord Mandelson's husband sent Jeffrey Epstein a message mentioning emails about \"osteo course expenses\". Epstein replied saying he would wire the loan \"immediately\". ",
        "Content": "Jeffrey Epstein wired thousands of pounds after Lord Peter Mandelson's husband asked him to pay for his osteopathy course fees, according to emails included in newly released Epstein files.  More than three million documents were published by the US Department of Justice on Friday relating to disgraced paedophile financier Epstein. On 7 September 2009, Lord Mandelson's husband, Reinaldo Avila da Silva, sent Epstein a message saying: \"I sent you a couple of emails last week regarding my osteo course expenses, incl fee, anatomical models, lap top if you can help me with this. I hope you received them.\" Epstein files latest: More than three million pages being released He said the annual fee was £3,225, then explained the school accepts bank transfer and provided the account details. Avila da Silva went on to thank Epstein for \"anything you can help me with\". The late financier replied later the same day, saying: \"I will wire your loan amount immediated'y [sic].\" \n                  Epstein files release - saying everything and nothing at the same time\n                 \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  Ghislaine Maxwell set to appear before US Congress in Epstein probe\n                 Avila da Silva followed up on the money in a later email. He said: \"Just sent an email back to Rich regarding the £10,000 with my personal bank details. \"I would like to clarify if this amount includes my school fees or if the amount of £3,225 (school fee) will be sent directly to the school itself.\" Read more:Mandelson apologises for continuing friendship with EpsteinWhat do we know about Mandelson's relationship with Epstein?Analysis: New Epstein files offer level of insight we never expected Epstein told him: \"includedd [sic].\" Avila da Silva later sent him another email thanking him for the money. It read: \"Just a brief note to thank you for the money which arrived in my account this morning.\" Being mentioned in the Epstein files is not a sign of wrongdoing. Lord Mandelson said in a statement: \"I was wrong to believe Epstein following his conviction and to continue my association with him afterwards. I apologise unequivocally for doing so to the women and girls who suffered.\" Epstein had pleaded guilty in 2008 to soliciting prostitution and soliciting a minor. Lord Mandelson said earlier this month his friendship with Epstein had been a \"most terrible mistake\". He has continued to deny he was aware of Epstein's crimes, having previously claimed that the disgraced financier did not share the details of his sex life with him because he is gay. Lord Mandelson was sacked as ambassador in September by Prime Minister Sir Keir Starmer as historic emails between him and Epstein were published, revealing the pair's relationship was \"materially different\" to what he had disclosed to the government."
    },
    {
        "title": "Epstein files release - saying everything and nothing at the same time",
        "description": "It was instantly overwhelming and strangely anticlimactic.",
        "url": "https://news.sky.com/story/epstein-files-release-saying-everything-and-nothing-at-the-same-time-13501275",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jeffrey-epstein-department-of-justice_7118865.jpg?20260131005704",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2026-01-30 23:48:00",
        "Headline": "For years, the name Epstein has hovered like a cloud over American power, promising thunder, delivering mostly rain.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It was instantly overwhelming and strangely anticlimactic. The Epstein drop came not with revelation but with weight. A digital thud. More than three million pages flooded the public square. Epstein files latest: More than three million pages being released For years, the name Epstein has hovered like a cloud over American power, promising thunder, delivering mostly rain. The latest release did nothing to change that dynamic. It was framed as transparency but felt more like looking through clouded glass. \n                  Epstein files: Key findings so far after more than three million pages released\n                 \n                  Epstein sent thousands of pounds to Mandelson's husband for osteopathy fees, files show\n                 \n                  Ghislaine Maxwell set to appear before US Congress in Epstein probe\n                 Names, dates, emails, logs - raw material - spilled into the open without guidance. The scale itself became the message: information overload. Too much to digest all at once. It is the bureaucratic equivalent of saying everything and saying nothing at the same time. In theory, the truth is here. In practice, it is buried beneath its own mass. The public had spent six weeks since the deadline waiting for this moment. Phones pinged, threads formed and by mid-morning, speculation was rife. Anticipation surged online, driven by hope - always renewed, always disappointed. Redactions loomed everywhere, thick black bars standing in the way of clarity. The names of victims were rightly protected but the result was a drop sanitised to the point of numbness. Politically, the drop functioned less as a reckoning than as a pressure release valve. The Trump administration can point to compliance, to procedure, to disclosure as an act of good faith. Read more:New Epstein files offer level of insight we never expectedEpstein sent thousands of pounds to Mandelson's husband, files show To critics, it is a policy of strategic exhaustion: flood the zone, let the public drown in documents, and wait for attention to wane. Both interpretations can be true at the same time. The American system is remarkably adept at turning moral crisis into administrative process. What makes the Epstein case uniquely corrosive is not just his crimes, horrific as they were, but the enduring suggestion of proximity to power. Each release opens the same wound - not \"What did Epstein do?\" but \"Who knew, who enabled, and who walked away untouched?\" These millions of pages offer only fragments of answers, none sturdy enough to carry accountability. The shadow network around Jeffrey Epstein remains just that - a shadow. We may learn more as the days go on, but even if we don't, incomplete transparency alters the historical record. Journalists, researchers and advocates will mine these files for years, stitching together timelines, patterns and silences. The work of truth rarely arrives in a single explosion. More often, it evolves slowly, stubbornly and against resistance."
    },
    {
        "title": "Former CNN presenter Don Lemon charged after covering anti-ICE protest in Minnesota",
        "description": "Don Lemon has been charged with federal civil rights crimes over the anti-ICE church protest in Minnesota, the Department of Homeland Security has said.",
        "url": "https://news.sky.com/story/former-cnn-presenter-don-lemon-charged-after-covering-anti-ice-protest-in-minnesota-13501191",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minnesota-cnn_7150745.jpg?20260130185924",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 18:19:00",
        "Headline": "The 59-year-old, now an independent journalist, livestreamed the demonstration, which took place inside a church on 18 January. ",
        "Content": "Don Lemon has been charged with federal civil rights crimes over the anti-ICE church protest in Minnesota, the Department of Homeland Security has said. The charges include conspiracy and interfering with the First Amendment rights of worshippers. The 59-year-old was one of four people detained in connection with the protest inside Cities Church in St Paul during a service on 18 January. Lemon livestreamed the demonstration, which took place because activists alleged that a pastor associated with the church also held a leadership role within Immigration and Customs Enforcement (ICE). Lemon has maintained he was observing the protest as a reporter. US attorney general Pam Bondi confirmed the arrests on social media on Friday. She wrote: \"At my direction, early this morning federal agents arrested Don Lemon, Trahern Jeen Crews, Georgia Fort, and Jamael Lydell Lundy, in connection with the coordinated attack on Cities Church in St. Paul, Minnesota. \n                  Nicki Minaj and Donald Trump - what's that about?\n                 \n                  ICE agents involved in fatal Minneapolis shooting of Alex Pretti placed on administrative leave\n                 \n                  ICE agents to have role at Winter Olympics - as crackdown's 'public face' to leave Minneapolis\n                 \"More details soon.\" Abbe Lowell, Lemon's attorney, called the arrest an \"unprecedented attack on the First Amendment\" - which includes freedom of the press - and said his client will \"fight these charges vigorously and thoroughly in court\". Mr Lowell said: \"Don has been a journalist for 30 years, and his constitutionally protected work in Minneapolis was no different than what he has always done. \"Instead of investigating the federal agents who killed two peaceful Minnesota protesters, the Trump Justice Department is devoting its time, attention and resources to this arrest, and that is the real indictment of wrongdoing in this case. \"This unprecedented attack on the First Amendment and transparent attempt to distract attention from the many crises facing this administration will not stand.\" Mr Lowell said Lemon had been in Los Angeles covering the upcoming Grammy Awards at the time of his arrest. In a statement, CNN also criticised the arrest of their former presenter, and said it \"raises profoundly concerning questions about press freedom\". It comes as US deputy attorney general Todd Blanche confirmed the DoJ had opened a federal investigation into a potential civil rights violation regarding the killing of Alex Pretti, who was shot and killed by border control agents last Saturday. Mr Blanche said: \"We're looking at everything that would shed light on that day.\" The killing of the 37-year-old ICU nurse came weeks after Renee Good was shot dead in her car, less than a mile from where Mr Pretti was fatally shot. Read more from Sky News:Luigi Mangione will not face death penalty if convictedTrump reveals his 'great' pick for US central bank boss Homeland Security spokesperson Tricia McLaughlin said earlier this week that two agents who fired their guns during Mr Pretti's shooting have been placed on administrative leave."
    },
    {
        "title": "Trump reveals his 'great' pick for US central bank boss",
        "description": "Donald Trump has revealed his pick to become the world's most powerful central banker, declaring Kevin Warsh \"may be the best\" ever.",
        "url": "https://news.sky.com/story/trump-reveals-his-great-pick-for-us-central-bank-boss-13500929",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-fed-kevin-warsh_7150052.jpg?20260130074659",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2026-01-30 12:10:00",
        "Headline": "Kevin Warsh is not seen as the interest rate cut champion feared by financial markets and economists, amid continuing worries over the Fed's independence.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed his pick to become the world's most powerful central banker, declaring Kevin Warsh \"may be the best\" ever. Mr Warsh, a former member of the Federal Reserve's board of governors, will \"never let you down\" as chair of the country's central bank, the president said in a Truth Social post. It ends months of speculation on whether he would choose a puppet to force through US interest rate cuts. Rumours around his potential appointment played out on financial markets overnight and contributed to a strengthening of the Trump-hit dollar and downwards shifts in many dollar-priced commodities such as gold and oil. Money latest: Five tax allowances that can protect your take-home pay Mr Warsh is widely seen as a cautious advocate of interest rate cuts. They are being demanded by the president to boost economic growth. \n                  Venezuela approves bill to open up oil sector to private firms as US eases sanctions\n                 \n                  Nicki Minaj and Donald Trump - what's that about?\n                 \n                  Trump endorses deal struck with Democrats to avert government shutdown\n                 He has also spoken of the need to shrink the Fed's balance sheet - a policy that is generally supportive of higher interest rates, helping to balance his possible approach. He has, however, spoken of the need to loosen post-financial crisis regulations on banks. The market reaction suggests that Mr Trump's pick is not seen as the champion for interest rate cuts that investors had feared, potentially eroding some concerns about the independence of the Federal Reserve. \"I have known Kevin for a long period of time, and have no doubt that he will go down as one of the GREAT Fed Chairmen, maybe the best\", Mr Trump wrote. \"On top of everything else, he is 'central casting, and he will never let you down.\" The appointment is important globally because the fate of the world's largest economy has ramifications for everything in the financial system. The central bank is a crucial balancing tool - especially in an era of high uncertainty, and most of that emanates from the United States itself. A new Fed chair is needed because the incumbent is due to stand down in May after two terms. President Trump appointed Jay Powell during his first stint in the White House, but he has long criticised the Fed under Mr Powell's leadership and threatened to fire him on many occasions. Mr Powell is currently the subject of a Department of Justice investigation into Fed renovation costs - an inquiry he has dismissed as being part of the Trump administration's efforts to influence decisions by securing a voting majority on its rate-setting panel. The political row has seen both Democrats and Republicans on the Senate's influential banking committee come out in support of Mr Powell. It is the same committee that is now tasked with saying yea or nay to Mr Warsh's appointment. Read more:Trump suffers setback in bid to fire Fed governor Nick Kennedy, currency strategist at Lloyds Banking Group, said: \"Warsh is my preferred candidate but it didn't look promising for a while. \"From a policy perspective, his track record is more on the hawkish side [more cautious over rate cuts] and he is academically aligned with the administration on wanting a smaller balance sheet. \"In the interview process you have to be aligned with what Trump wants on policy rates. I don't think this is a role you would want to step into if you were in conflict with that. \"So, that idea that this is good for the dollar is going to be short-lived,\" he concluded."
    },
    {
        "title": "Trump endorses deal struck with Democrats to avert government shutdown",
        "description": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security.",
        "url": "https://news.sky.com/story/trump-endorses-deal-struck-with-democrats-to-avert-government-shutdown-13500874",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-cabinet-meeting_7149661.jpg?20260129164331",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 00:20:00",
        "Headline": "The move comes as the US reels from the deaths of two protesters at the hands of federal agents in Minneapolis.",
        "Content": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security. The move comes as the US reels from the deaths of two protesters at the hands of federal agents in Minneapolis. \"Republicans and Democrats have come together to get the vast majority of the government funded until September\" while extending current funding for Homeland Security, Mr Trump said in a Truth Social post on Thursday evening. He said he hoped members of both parties would cast a \"much needed Bipartisan 'YES' vote\". The two sides have agreed to separate homeland security funding from a bigger spending bill and fund the Homeland department for two weeks while they debate Democratic demands for curbs on the US Immigration and Customs Enforcement agency. The deal follows a Democrats vote to block legislation to fund the DHS on Thursday. They have been pushing to remove funding for the DHS, of which ICE is a part, from the $1.2tn government spending package after the killing of Alex Pretti by federal agents in Minneapolis on Saturday. Passage of the agreement was delayed late on Thursday as Senate leaders were still working to win enough support for the package. Mr Trump earlier told his cabinet that he was optimistic of avoiding a shutdown. The rare bipartisan talks between Mr Trump and Senate Democratic leader Chuck Schumer came after calls by senators in both parties for a full investigation into Mr Pretti's killing. The standoff has threatened to plunge the nation into another shutdown, just two months after Democrats blocked a spending bill over expiring federal healthcare subsidies. The government was closed for 43 days as Republicans refused to negotiate. The shutdown ended when a small group of moderate Democrats tore away to strike a deal with Republicans, but Democrats are more unified this time after the fatal shootings of Mr Pretti and Renee Good by federal agents. Read more:Alex Pretti clashed with federal agents week before deathIt's genuinely frightening to wonder where America goes next 👉 Follow Trump100 on your podcast app 👈  Meanwhile, a new poll shows Mr Trump's approval rating has dropped during his administration's immigration crackdown. The research, conducted by Pew between 20 and 26 January, shows the US president's approval rating stands at 37%, down from 40% last Autumn. Half of the Americans surveyed say the administration's actions have been worse than they expected. Asked specifically about immigration policies, 74% of Americans believe it's acceptable for ordinary people to record ICE arrests. More than half (59%) said it's acceptable for people to share information about where ICE operations are taking place."
    },
    {
        "title": "Melania's non-documentary might end up a box office flop - but she won't mind",
        "description": "\"Purposeful storytelling\" is how Melania Trump herself describes what audiences will find in her cinematic debut.",
        "url": "https://news.sky.com/story/melanias-non-documentary-might-end-up-a-box-office-flop-but-she-wont-mind-13501084",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-melania-trump-new-york_7148599.jpg?20260130140618",
        "type": "US",
        "Author": "Katie Spencer",
        "Date Published": "2026-01-30 13:55:00",
        "Headline": "Amazon has forked out eye-watering sums for the enigmatic first lady's \"deliberate act of authorship\" - just don't call it a documentary.",
        "Content": "\n          Arts and entertainment correspondent\n       \"Purposeful storytelling\" is how Melania Trump herself describes what audiences will find in her cinematic debut. In many ways, that sums this film up. While Amazon paid an eye-watering fee for the documentary, don't expect a warts-and-all unflinching record of what the first lady did in the 20 days leading up to the 2025 presidential inauguration. The trailer alone is glamorous, funny and clearly carefully curated. Her own team say she had strong creative input into the film and, as one of the executive producers, it's likely the deal came with final cut approval. \"Some have called this a documentary, it is not,\" she said in a speech at the film's premiere. \"My film is a very deliberate act of authorship. Inviting you to witness events and emotions through a window of rich imagery. \n                  Amazon to cut 16,000 jobs globally to streamline operations\n                 \n                  Best and worst parcel delivery companies revealed\n                 \n                  Apple and Amazon defy expectations with latest results\n                 \"It is a created experience that offers perspectives, insights, and moments that only few have seen.\" And she's right, this is a unique record with Amazon boasting \"exclusive footage capturing critical meetings and private conversations\". But the reason we haven't typically seen access like this before is that presidents and first ladies generally don't pursue outside business ventures while in office. And that comes down to potential conflicts of interest. For example, Barack and Michelle Obama's mega multi-million dollar book deal was only announced shortly after he left office. Of course, technically the first lady signed this deal and filmed this before she was in office. And it was, by all accounts, quite the deal. Amazon is believed to have spent $35m on marketing the film, on top of the $40m it spent in a bidding war to win the rights. Of that initial $40m - Melania reportedly got $28m. Read more from Sky News:Toxin found in Nestle baby formulaPep Guardiola gives speech on Palestine The streamer has effectively argued that she's worth it - that it believes the perceived audience interest justifies that amount. Some critics have pointed out that Amazon is a company with many government contracts and this could have been a way to curry favour with the new administration. When a reporter at the premiere challenged the president on how the New York Times had called it an act of corporate corruption, Trump hit back that it was \"fake news\". \"I think it's a very important movie... It shows life in the White House. It's a big deal actually.\" Then there's the filmmaker attached to this documentary... Brett Ratner. Best known for the Rush Hour franchise, he has been persona non grata in Hollywood for about a decade. He hasn't directed a movie since 2014 after being exiled at the height of the MeToo movement following accusations of sexual harassment and misconduct by several women, which he categorically denies. This film effectively marks his big comeback. It's also led to him being asked to make other movies including Rush Hour 4. And while Ratner must be overjoyed to be back, reportedly two-thirds of the crew that worked on this have asked not to have their names credited. Melania is thought to be opening with screenings in around 1,500 cinemas - not just in America but globally and in the UK. While on social media President Trump has written: \"MELANIA, the Movie, is a MUST WATCH... Get your tickets today - Selling out, FAST!\" So far, UK ticket sales seem to have been a bit limp. At the time of writing this, looking at a dozen London cinemas' Friday night screenings, there are plenty of seats available. Is there enough international interest to get people paying out for popcorn to watch it? Will it be a box office flop? Well, documentaries historically never fare particularly well in cinemas. And of course, if you're Melania, that doesn't really matter. She's already been paid and gets to tell the story that she wants to tell."
    },
    {
        "title": "Nicki Minaj and Donald Trump - what's that about?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>",
        "url": "https://news.sky.com/story/why-is-nicki-minaj-queen-of-rap-befriending-donald-trump-13500876",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-100-podcast-teaser_7149999.jpg?20260130061733",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 05:00:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   The president and Nicki Minaj get cosy. What's that all about? We have a new video of an altercation between Alex Pretti and ICE agents, days before his death. What does it tell us? Donald Trump is back with his cabinet for the first meeting of 2026. Plenty mentioned… including Iran. Are we moments away from the US launching strikes on Iran? Plus - why is the FBI seizing voter rolls relating to an election six years ago? And is this foreshadowing what could happen in November's midterm elections? You can watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "Queen won't tour in US because it's 'a dangerous place'",
        "description": "Legendary Queen guitarist Brian May has said the band will not tour in the US any time soon, saying it has become \"a dangerous place\".",
        "url": "https://news.sky.com/story/queen-wont-tour-in-us-because-its-a-dangerous-place-13500965",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brian-may-queen_7150194.jpg?20260130095153",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-30 09:29:00",
        "Headline": "The band has not played a show since February 2014, but it appears that if they were to announce new gigs they would not be stateside.",
        "Content": "Legendary Queen guitarist Brian May has said the band will not tour in the US any time soon, saying it has become \"a dangerous place\". The band has not played a show since February 2014, but it appears that if they were to announce new gigs they would not be stateside. In comments to the Daily Mail, Sir Brian said: \"America is a dangerous place at the moment, so you have to take that into account. \"It's very sad because I feel like Queen grew up in America and we love it, but it's not what it was. \"Everyone is thinking twice about going there at the moment.\" It comes as concerns about extra checks at the border and political tensions appear to be deterring travellers from visiting America. Read more from Sky News:Former Little Mix singer says mum first noticed twins' conditionBBC announces interim director general Sir Brian also said he would not play at Glastonbury Festival next year, despite it being in the UK and not the US. This, he says, is because he disagrees with the practice of badger culling in farming."
    },
    {
        "title": "Trump reveals his 'great' pick for US central bank boss",
        "description": "Donald Trump has revealed his pick to become the world's most powerful central banker, declaring Kevin Warsh \"may be the best\" ever.",
        "url": "https://news.sky.com/story/trump-reveals-his-great-pick-for-us-central-bank-boss-13500929",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-fed-kevin-warsh_7150052.jpg?20260130074659",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-30 12:10:00",
        "Headline": "Kevin Warsh is not seen as the interest rate cut champion feared by financial markets and economists, amid continuing worries over the Fed's independence.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has revealed his pick to become the world's most powerful central banker, declaring Kevin Warsh \"may be the best\" ever. Mr Warsh, a former member of the Federal Reserve's board of governors, will \"never let you down\" as chair of the country's central bank, the president said in a Truth Social post. It ends months of speculation on whether he would choose a puppet to force through US interest rate cuts. Rumours around his potential appointment played out on financial markets overnight and contributed to a strengthening of the Trump-hit dollar and downwards shifts in many dollar-priced commodities such as gold and oil. Money latest: Five tax allowances that can protect your take-home pay Mr Warsh is widely seen as a cautious advocate of interest rate cuts. They are being demanded by the president to boost economic growth. \n                  Venezuela approves bill to open up oil sector to private firms as US eases sanctions\n                 \n                  Nicki Minaj and Donald Trump - what's that about?\n                 \n                  Trump endorses deal struck with Democrats to avert government shutdown\n                 He has also spoken of the need to shrink the Fed's balance sheet - a policy that is generally supportive of higher interest rates, helping to balance his possible approach. He has, however, spoken of the need to loosen post-financial crisis regulations on banks. The market reaction suggests that Mr Trump's pick is not seen as the champion for interest rate cuts that investors had feared, potentially eroding some concerns about the independence of the Federal Reserve. \"I have known Kevin for a long period of time, and have no doubt that he will go down as one of the GREAT Fed Chairmen, maybe the best\", Mr Trump wrote. \"On top of everything else, he is 'central casting, and he will never let you down.\" The appointment is important globally because the fate of the world's largest economy has ramifications for everything in the financial system. The central bank is a crucial balancing tool - especially in an era of high uncertainty, and most of that emanates from the United States itself. A new Fed chair is needed because the incumbent is due to stand down in May after two terms. President Trump appointed Jay Powell during his first stint in the White House, but he has long criticised the Fed under Mr Powell's leadership and threatened to fire him on many occasions. Mr Powell is currently the subject of a Department of Justice investigation into Fed renovation costs - an inquiry he has dismissed as being part of the Trump administration's efforts to influence decisions by securing a voting majority on its rate-setting panel. The political row has seen both Democrats and Republicans on the Senate's influential banking committee come out in support of Mr Powell. It is the same committee that is now tasked with saying yea or nay to Mr Warsh's appointment. Read more:Trump suffers setback in bid to fire Fed governor Nick Kennedy, currency strategist at Lloyds Banking Group, said: \"Warsh is my preferred candidate but it didn't look promising for a while. \"From a policy perspective, his track record is more on the hawkish side [more cautious over rate cuts] and he is academically aligned with the administration on wanting a smaller balance sheet. \"In the interview process you have to be aligned with what Trump wants on policy rates. I don't think this is a role you would want to step into if you were in conflict with that. \"So, that idea that this is good for the dollar is going to be short-lived,\" he concluded."
    },
    {
        "title": "Trump endorses deal struck with Democrats to avert government shutdown",
        "description": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security.",
        "url": "https://news.sky.com/story/trump-endorses-deal-struck-with-democrats-to-avert-government-shutdown-13500874",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-cabinet-meeting_7149661.jpg?20260129164331",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-30 00:20:00",
        "Headline": "The move comes as the US reels from the deaths of two protesters at the hands of federal agents in Minneapolis.",
        "Content": "Donald Trump has endorsed a spending deal negotiated by US Senate Republicans and Democrats that would stave off a government shutdown and temporarily fund the Department of Homeland Security. The move comes as the US reels from the deaths of two protesters at the hands of federal agents in Minneapolis. \"Republicans and Democrats have come together to get the vast majority of the government funded until September\" while extending current funding for Homeland Security, Mr Trump said in a Truth Social post on Thursday evening. He said he hoped members of both parties would cast a \"much needed Bipartisan 'YES' vote\". The two sides have agreed to separate homeland security funding from a bigger spending bill and fund the Homeland department for two weeks while they debate Democratic demands for curbs on the US Immigration and Customs Enforcement agency. The deal follows a Democrats vote to block legislation to fund the DHS on Thursday. They have been pushing to remove funding for the DHS, of which ICE is a part, from the $1.2tn government spending package after the killing of Alex Pretti by federal agents in Minneapolis on Saturday. Passage of the agreement was delayed late on Thursday as Senate leaders were still working to win enough support for the package. Mr Trump earlier told his cabinet that he was optimistic of avoiding a shutdown. The rare bipartisan talks between Mr Trump and Senate Democratic leader Chuck Schumer came after calls by senators in both parties for a full investigation into Mr Pretti's killing. The standoff has threatened to plunge the nation into another shutdown, just two months after Democrats blocked a spending bill over expiring federal healthcare subsidies. The government was closed for 43 days as Republicans refused to negotiate. The shutdown ended when a small group of moderate Democrats tore away to strike a deal with Republicans, but Democrats are more unified this time after the fatal shootings of Mr Pretti and Renee Good by federal agents. Read more:Alex Pretti clashed with federal agents week before deathIt's genuinely frightening to wonder where America goes next 👉 Follow Trump100 on your podcast app 👈  Meanwhile, a new poll shows Mr Trump's approval rating has dropped during his administration's immigration crackdown. The research, conducted by Pew between 20 and 26 January, shows the US president's approval rating stands at 37%, down from 40% last Autumn. Half of the Americans surveyed say the administration's actions have been worse than they expected. Asked specifically about immigration policies, 74% of Americans believe it's acceptable for ordinary people to record ICE arrests. More than half (59%) said it's acceptable for people to share information about where ICE operations are taking place."
    },
    {
        "title": "Gupta steel empire dismantling continues with Hartlepool pipes sale",
        "description": "The dismantling of Sanjeev Gupta's British business empire is accelerating after advisers were hired to find a buyer for a steel production business which supplies oil giants including BP and Shell.",
        "url": "https://news.sky.com/story/gupta-steel-empire-dismantling-continues-with-hartlepool-pipes-sale-13500998",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liberty-steel-sanjeev-gupta_6997489.jpg?20250822104041",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-30 10:34:00",
        "Headline": "The division of Liberty Steel which makes pipes for oil giants including BP and Shell has been put up for sale on an accelerated basis, with bids being sought in the next fortnight, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The dismantling of Sanjeev Gupta's British business empire is accelerating after advisers were hired to find a buyer for a steel production business which supplies oil giants including BP and Shell. Sky News has learnt that Liberty Steel's Hartlepool-based steel pipes unit, which employs about 170 people, is hunting a buyer within weeks. Industry sources said that BTG Advisory, also known as Begbies Traynor, had been hired to handle the sale process. Prospective buyers have been sounded out in recent days. Money latest: EasyJet hits out at EU's free cabin bag plan The Liberty Pipes business, which also counts Equinor among its customers, has been loss-making in recent years. It is part of Mr Gupta's Liberty Steel Group, which in turn is owned by the embattled businessman's GFG Alliance. \n                  Trump reveals his 'great' pick for US central bank boss\n                 \n                  EasyJet hits out at EU's free cabin bag plan; warm home discount extended | Money\n                 \n                  Trump endorses deal struck with Democrats to avert government shutdown\n                 Last summer, the bulk of his British operations, known as Speciality Steel UK (SSUK), were placed into liquidation after a judge ruled them to be \"hopelessly insolvent\". A sale process being overseen by the Official Receiver is well underway and has drawn interest from more than a handful of parties. These include Arabian Gulf Steel Industries, Sky News reported this month, while The Sunday Times also named EIG Global Trust, a cryptocurrency fund, and 7 Steel, as rival bidders. Mr Gupta has himself been exploring a possible offer, with backing from the American fund management giant BlackRock. The Insolvency Service recently said: \"We can confirm that the Official Receiver continues to progress bids for the sale of Speciality Steel UK. \"The sales process is ongoing, with the aim to complete a sale at the earliest opportunity.\" The Liberty Pipes division is recently understood to have delivered 51,000 tonnes of steel pipe to a huge carbon cluster project on Teesside which has also faced criticism for placing a separate order for Chinese-made, rather than British, steel. Sir Keir Starmer's visit to China this week was expected to include some reference to the future of British Steel, which is owned by China's Jingye Group but under the control of the UK government. Bids for the Liberty Pipes business are understood to be being sought by 10 February. It was unclear on Friday whether the pipes unit would have a viable future unless a buyer is found. A Liberty Steel spokesperson said: \"The directors of Liberty Pipes Hartlepool have launched an accelerated sales process for the company and its assets to identify the right industrial or strategic investor to support continued production and deliver a long-term sustainable business. \"A targeted sale transaction, if concluded, would protect skilled employment, maximise asset value, and deliver the most favourable outcome for the company's stakeholders. \"The process is expected to progress on an accelerated timeline, with a target to complete by 20 February.\" \"The company is working on an exciting sales pipeline for the coming years encompassing carbon capture, hydrogen infrastructure, LNG and oil and gas projects across the UK, EU, Americas, the Middle East and Asia.\""
    },
    {
        "title": "Starmer hails China reset a success - but not everyone is convinced",
        "description": "Keir Starmer describes himself as a \"British pragmatist\" who takes a \"common sense\" approach. When it comes to global affairs, and domestic ones too, he isn't one to grandstand, he'd rather try to get things done.",
        "url": "https://news.sky.com/story/starmer-hails-china-reset-a-success-but-not-everyone-is-convinced-13501085",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-beth-china-starmer_7150525.png?20260130144834",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-30 13:59:00",
        "Headline": "For a British prime minister struggling to grow the economy, drumming up business with China will take priority over obvious differences around human rights.",
        "Content": "\n          Political editor\n              @BethRigby\n Keir Starmer describes himself as a \"British pragmatist\" who takes a \"common sense\" approach. When it comes to global affairs, and domestic ones too, he isn't one to grandstand, he'd rather try to get things done. That has been the entire tenor of his three-day visit to China as the former human rights lawyer-turned prime minister seeks tor reset Britain's relationship with China. Ask him about Donald Trump's warning that it's \"very dangerous\" for the UK to seek closer ties with China, and Starmer swerves. Ask him about the plight of the pro-democracy campaigner Jimmy Lai, imprisoned in Hong Kong, and he says the issues has been raised, but he doesn't want to go into it. Ask him whether he agrees with Mark Carney critique that the middle powers need to work together to counter the rise of great powers - the US and China, he distances. He is, if you like, making pragmatic choices to find favour with the big beast nations - be it on Jimmy Lai, or the building of a super embassy for China, or allowing Trump to troll him on a variety of subjects according to his fancy. Starmer keeps his head down and ploughs on. His supporters say this pragmatism delivers results, be it a better trade deal with the US, or the prospect of great investment and trade with the world's second-biggest economy China. \n                  China lifts sanctions on MPs and peers, Starmer says \n                 \n                  What does Starmer really want from China?\n                 \n                  Starmer in China to improve British economy, Harriet Harman says\n                 His detractors argue that the UK is supine and the prime minister is leaving his country to the mercy of much bigger powers. Canadian Prime Minister Mark Carney sees a third way. \"Great powers can afford, for now, to go it alone. They have the market size, the military capacity and the leverage to dictate terms. Middle powers do not. The middle powers must act together, because if we're not at the table, we're on the menu,\" he told the annual Davos summit earlier this month. As Trump comes for Carney - his recent visit to China and narrow trade deals prompted Trump to threaten 100% tariffs - Starmer ducks for cover. When I asked him in Shanghai whether he agreed with Carney's critique of the shifting global order, well he does not. \"I've talked to Mark Carney a lot, but we're living in a very volatile world. \"My compass is always the national interest of the United Kingdom, and I'm very clear that that means that we maintain and build on our close relationship with the US; that we build a stronger and closer relationship with Europe, but that we also are confident and engaging outwardly and that means with China.\" \"I take the view that it's in the UK's national interest to maintain our relationship with the US. \"It's close on defence, security, intelligence, actually on trade and prosperity as well. \"On Europe, I want to do more on defence and security and one trade. But on the outgoing world, I mean China as well. We need to be outward, engaging. And that's been the stance of the government since the beginning.\" As Starmer tows a line, Trump is rattled by the behaviour of allies. \"I think its very dangerous for them to do that,\" he said when asked about the UK seeking closer ties with China. But he reserved most of his ire for Canada: \"It's even more dangerous, I think, for Canada to get into business with China. Canada is not doing well. They're doing very poorly, and you can't look at China as the answer.\" Read more from Sky News:Sir Keir Starmer in China: What will be on the table?China lifts sanctions on MPs and peersChina trip's exquisite optics for 'world's most reliable superpower' But the UK is looking to China as part of the answer as it deepens trade ties, and the three-day tour was an exercise in trying to put differences aside as Starmer seeks a reset that the UK needs more than Beijing. Starmer comes away from China with sanctions on six parliamentarians, barred from visiting China for speaking out on human rights issues, lifted. There is a tariff cut on whiskey imports from 10% to 5%, and the deal in principle for visa-free travel for up to 30 days - a big win for business. It is, the No 10 delegation says, \"not a one-and-done trip\", but the beginning of a deeper reset. The prime minister told me that he hoped President Xi would visit in the UK in 2027 when it hosts the G20. It will be the first time in over 10 years that the Chinese leader has set foot on British soil. But the reasons for freezing relations remain. For all the warm handshakes and words, there are deep differences and areas of discomfort between Britain's democracy and China's autocracy. Rifts between the two nations were in part caused in response to China's crackdown in Hong Kong. The imprisonment of British pro-democracy campaigner Jimmy Lai remains a contentious issue. Keir Starmer says he raised the matter with President Xi. When I asked if he specifically raised Lai's name, he said yes. But as for Lai's release, the PM said he wouldn't get into the deals. \"I am absolutely clear about, the raising, the manner in which we raised it and the importance of raising it. What you can't do is sit back at home with your head in the sand saying, I'm not going to talk to you…if you're just sitting outside the room, refuse to engage, you can't even have the conversation.\" But there are plenty of opponents back home who disagree with the engagement. Nusrat Ghani, one of the five MPs sanctioned in 2021, posted on X: \"MPs agreed that the Chinese Communist Party was orchestrating a genocide against the Uyghur people. The sanctions were meant to intimidate us MPs and prevent us from doing our jobs without fear or favour. Bartering our MP sanctions doesn't change those facts nor help others in the UK targeted by CCP and sanctioned by them.\" Kemi Badenoch, the Conservative leader, has also been highly critical, concerned about national security, the crackdown on political freedoms in Hong Kong and Chinese \"undermining\" of the UK economy - be it through cheap Chinese goods that undermine British manufacturing, overreliance on Chinese technology or Chinese influence in critical infrastructure. So when the UK hailed a $15bn (£12bn) investment in AstraZeneca on the trip over, having paused a £200m investment at a Cambridge research site last September which was due to create 1,000 jobs, shadow business secretary Andrew Griffith was blunt in his assessment. \"AstraZeneca's a great British company but under this government it's investing everywhere in the world other than its UK home. When we are losing investment to communist China, alarm bells should be ringing in No 10 Downing Street.\" Others ask what has he actually come back with? He has not secured the scale of trade deals struck by PM Carney, and I am told by one person in the UK delegation that after Britain's snub of President Xi, it will take some time to rebuild ties. But for Starmer, the prize is deepening economic ties, more investment and trade. For a British prime minister struggling to grow this economy, drumming up more business with the world's second largest economy - even if you don't much like its political system, or choice of allies such as Russia - can be chalked up as a win. You can perhaps swallow some of that if you can agree, as Starmer did on Thursday, to launch a \"feasibility study\" on a bilateral services pact. The UK had a £10bn surplus in services with China in the year to last June. It is a market ripe for growth. For this former human rights lawyer turned self-avowed pragmatist, drumming up business will both take priority over obvious differences around human rights, espionage and China's continued support of Russia during the years of war in Ukraine. Carney argues that middle powers need to push back the superpowers, but Starmer seems happy to try to comply. It matters less to him if he is at the mercy of the US or China, if it means he can help deliver back home. The Chinese will next month welcome in the year of the horse in 2026, a creature which in their zodiac represents action, speed and breakthrough. Starmer is going to need all of that in spades if he is to usher in a year that will cut the cost of living back home. He will leave Shanghai with the hope that this visit might help - but it's going to require a lot more work, not just with Beijing, but with his other superpower too."
    },
    {
        "title": "China lifts sanctions on MPs and peers, Starmer says ",
        "description": "China has lifted restrictions on some British MPs and peers and will now allow all parliamentarians to visit the country, Sir Keir Starmer has said.",
        "url": "https://news.sky.com/story/china-lifts-sanctions-on-mps-and-peers-starmer-says-13500981",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kier-starmer-beth-rigby_7150320.jpg?20260130114316",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-30 10:05:00",
        "Headline": "The prime minister said the country has removed restrictions that prevented some parliamentarians from visiting, but one of those sanctioned said: \"It's not a win, it's a capitulation.\"",
        "Content": "China has lifted restrictions on some British MPs and peers and will now allow all parliamentarians to visit the country, Sir Keir Starmer has said. Speaking to Sky News's political editor Beth Rigby, the prime minister said the sanctions have been a \"real cause for concern across parliament\", and he had raised the issue with China's President Xi Jinping during the trip. \"As a result [of discussions], it's clear from the Chinese that the restrictions no longer apply,\" Sir Keir said. \"President Xi said what that means is that all parliamentarians are free to travel to China.\" Politics Hub: Follow the latest updates It's understood the UK will not be lifting any sanctions on Chinese officials in return. China sanctioned five Conservative MPs and two members of the House of Lords in 2021, which was seen as retaliation for sanctions by the UK and other countries on several Chinese officials for their connection to reports of human rights violations. They were banned from entering China, Hong Kong and Macau. The MPs sanctioned were former Tory leader Sir Iain Duncan Smith, Nusrat Ghani, Neil O'Brien, and former security minister Tom Tugendhat, as well as Tim Loughton, who stood down from the Commons at the 2024 general election. China also sanctioned Labour peer and human rights barrister Baroness Helena Kennedy, and crossbench peer Lord David Alton. All are fierce critics of China. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Mr Tugendhat told Sky News that Sir Keir had \"traded away sanctions that mean nothing to us\". \"He's traded away, for six people, these sanctions as though somehow it's a win. It's not a win, it's a capitulation,\" he said. In a statement, the seven current and former parliamentarians said it appeared sanctions on former MP Mr Loughton had not been lifted. The statement said: \"The selective lifting of sanctions solely on sitting parliamentarians is wrong. Parliament exists to represent and defend the people of the United Kingdom. Seeking or accepting preferential treatment for current MPs and peers sends a damaging signal that some are more deserving of protection than others.\" Mr Loughton told Sky News he didn't know whether he was still sanctioned or not. He said he would be \"delighted\" to be unsanctioned, \"but not as part of a grubby deal\" that could mean the \"UK government's going to go light on [China's] enormous human rights abuses\". Responding to criticism that he shouldn't have visited China in the first place due to the country's human rights abuses, Sir Keir said he wouldn't have been able to get the sanctions lifted had he not made the visit. \"That's something that couldn't have happened if we weren't here, having the leader-to-leader exchange. It doesn't happen if you stick your head in the sand,\" he told Sky News. The prime minister also told Rigby he had raised the case of imprisoned British-Chinese dual national Jimmy Lai with Mr Xi. Mr Lai, who is a Hong Kong media tycoon and pro-democracy campaigner, has been held in a high-security prison for five years and in December was found guilty of national security offences. Sir Keir refused to say whether any progress had been made in securing Mr Lai's release: \"I won't go into the details, but I'm absolutely clear about raising it, the manner in which we raised it and the importance of raising it.\" He said it wasn't \"awkward\" to raise the case with Mr Xi, and said, as with discussing the sanctioned parliamentarians, \"the purpose of engaging is to seize the opportunities that open up as a result of engagement\". Asked what security precautions he had taken on visiting China amid concerns he could be bugged, the prime minister said: \"On a visit like this, of course, we took the necessary precautions.\" However, he said he wasn't advised to dress under bed covers, as Theresa May was when she visited China as prime minister in 2018."
    },
    {
        "title": "Starmer in China to improve British economy, Harriet Harman says",
        "description": "Sir Keir Starmer is visiting China to improve the UK's economy, Harriet Harman has said.",
        "url": "https://news.sky.com/story/starmer-in-china-to-improve-british-economy-harriet-harman-says-13500657",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-electoral-dysfunction_7149807.png?20260129201001",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-30 05:00:00",
        "Headline": "The prime minister's visit is focused on economic ties and does not stop the government from managing challenges from the country, the former minister tells the Electoral Dysfunction podcast.",
        "Content": "Sir Keir Starmer is visiting China to improve the UK's economy, Harriet Harman has said. The former Labour cabinet minister told Beth Rigby on the Electoral Dysfunction podcast that the prime minister's trip to the world's second-largest economy was intended to improve the financial situation of voters in the UK. However, she said the government would remain \"clear-eyed\" about potential threats from Beijing. Politics live: Starmer strikes deals on visas and whisky After meeting with Chinese President Xi Jinping, Sir Keir confirmed UK citizens would get 30-day visa-free entry to China, and that whisky tariffs would be halved. Ms Harman said: \"The overwhelming imperative for the government is to get growth in the UK economy and for people's living standards to improve. \"And China being the second-largest economy in the world with increasing difficulties with the US. \n                  Starmer hails China reset a success - but not everyone is convinced\n                 \n                  China lifts sanctions on MPs and peers, Starmer says \n                 \n                  What does Starmer really want from China?\n                 \"You know, it's just, as he said, it's the pragmatism, and when [Sir Keir] was speaking with the business delegation on camera, saying, actually, this is all about people back home. \"I think that you can see, and he's obviously radiating out to the Chinese as well, a very clear focus on this. \"They're not going all around the houses on this. This is about the economy.\" Rigby pointed out that the trip could potentially open the door for the government to invite Mr Xi to visit the UK, as he did in 2015. \"[It] would be a massive deal if the UK government is prepared to allow Xi to visit, given that the Chinese government had sanctioned British parliamentarians from coming to China,\" Sky's political editor said. Read more:Sky News podcasts busy on awards nightStarmer's China trip contrasts Trump chaos Ms Harman said: \"This is about more trade, it's about more investment. \"And obviously they're managing all the other things like the banning of the MPs, like the security issues, like the espionage. \"So those all things have got to be managed, and that's why they say, we're going to be clear-eyed about this. So we are not forgetting about those problems. \"But it's just the economy stupid, isn't it?\""
    },
    {
        "title": "What does Starmer really want from China?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/what-does-starmer-really-want-from-china-13500757",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-electoral-dysfunction_7039456.png?20251030132307",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-30 05:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Beth joins the prime minister on his historic trip to China, where he has met the country's president, Xi Jinping. It's a trip that has sparked debate back in the UK, amid worries over espionage and security. But has it helped reset relations? And what does Starmer really hope to achieve from his visit?  Beth, Harriet and Ruth discuss. Plus, Beth brings us all the behind-the-scenes gossip from the trip - including what it was like on the PM's plane and what gift Starmer bought for Xi. Meanwhile, back in the UK, listeners have been sending in their questions about the recent Conservative defections to Reform UK. Has Nigel Farage managed to quieten his critics, now his party includes experience of government? And with the Tory right increasingly jumping ship, how has Kemi Badenoch handled the growing number of defections? Harriet and Ruth tackle your questions. You can WhatsApp the podcast at 07934 200 444 or email electoraldysfunction@sky.uk. And if you didn't know, you can also watch Beth, Ruth and Harriet on YouTube."
    },
    {
        "title": "Postcode lottery means groundbreaking MND drug is a lifeline for some - but 'mental torture' for others",
        "description": "Eleanor Dalley didn't think she'd live to see 50 after being diagnosed with motor neurone disease (MND) in 2019.",
        "url": "https://news.sky.com/story/postcode-lottery-means-groundbreaking-mnd-drug-is-a-lifeline-for-some-but-mental-torture-for-others-13500695",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eleanor-dalley-mnd_7149779.jpg?20260129191139",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2026-01-30 00:01:00",
        "Headline": "Eleanor Dalley and Lillia Jakeman both have motor neurone disease,  but only one has been granted access to a breakthrough treatment that can halt its symptoms. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Eleanor Dalley didn't think she'd live to see 50 after being diagnosed with motor neurone disease (MND) in 2019. There is no cure, and most people die within a few years as they lose their ability to move, eat, talk and breathe. But for Eleanor, there was a lifeline - a breakthrough drug that has stopped the condition in its tracks. \"It's a miracle to be honest, it's like I've frozen in time,\" the mum-of-one told Sky News. MND affects the brain and nerves, causing muscles to get progressively weaker. While Eleanor has lost some movement in her legs, her symptoms have not got any worse - allowing her to reach milestones she did not think she would live to see. \"My worst fear was that I'd be dead within a year,\" Eleanor said. \"I would put things on TV that would make me cry, so that I could say it was the TV that was making me cry, but it wasn't really. It was me worrying about, I'm not going to see my daughter grow up or I'm not going to get to 50. \"Having this new drug has meant I've achieved all those things. \"But I'm really lucky - and not everybody is getting that same opportunity.\" The drug, Tofersen, is the first effective treatment for MND symptoms. Eleanor was able to get it through an early access programme ran by its manufacturer Biogen, which is currently offering it to the NHS for free. However, it requires regular spinal injections, and while the drug itself is free, some NHS trusts say they don't have the staff or resources to administer it. These issues have resulted in a postcode lottery for access, with people like 19-year-old Lillia Jakeman losing out. 'Mental torture' \"It's like a carrot that's dangled, and then it's taken away,\" said Lillia's stepmum Rachel, a GP of 30 years. \"It's a very cruel, unjust situation.\" Lillia was diagnosed with MND in August, when she was given a leaflet about Tofersen. However, she has not been able to access the treatment upon referral. She now uses a wheelchair, while her upper arms are getting weaker, affecting her ability to do what she loves. \"One of the biggest things for her is that she used to love doing Lego and artwork, and [now] she can't,\" said Rachel. \"She's still got a degree of thumb function, so she can use an electric wheelchair, she can do certain things. But the point is that Tofersen needs to be given to these patients as early as possible to preserve function, and you know every day matters. \"Lillia describes it really as mental torture, not knowing when you wake up the next day, whether you might have lost something, some other function that's gone.\" The All Party Parliamentary Group on MND, chaired by Labour MP Ian Byrne, said it was aware of 20 people unable to access Tofersen and four people who had died while awaiting treatment. The drug is for those with an inherited form of MND called SOD1 - which makes up 2% of cases. Caroline Nokes, Lillia's local MP and a senior Conservative backbencher, said it should not be difficult to extend access to a small handful of people. She joined Lillia's family and Mr Byrne in handing in a petition to Downing Street on Wednesday, calling for the government to intervene. NHS 'red tape' The issue has sparked wider concern about accessing new treatments on the NHS, given the millions of pounds being invested in the life sciences sector on research projects and clinical trials. Tofersen received marketing authorisation in July from the UK's Medicines and Healthcare Regulatory Agency. Read more:Ex-England rugby captain Lewis Moody reveals MND diagnosis'Game changer' test could spot signs of MND earlier However the National Institute for Health and Care Excellence (NICE) is the body that advises whether drugs should be made available for routine funding on the NHS. It will begin its evaluation process for Tofersen in March, but it is not clear how long it will take. Ministers are said to be reluctant to interfere as they feel this would undermine the official process. Professor Ammar Al-Chalabi, a consultant neurologist at King's College Hospital, said there needed to be a simpler system. He said: \"The government would like us to be a science superpower, and for motor neurone disease, we really are. \"And this drug is available but it's not available to patients despite the scientific breakthrough, what does that say? \"What's the purpose of finding these new treatments if they're not available on the NHS? The pathway has to be complete.\" A Department of Health and Social Care spokesperson said: \"We are committed to improving care for people with motor neurone disease like Lillia and ensuring they receive the support and treatment they need. \"Tofersen is approved for use in the UK and NICE is working with the manufacturer on whether to recommend it for routine funding by the NHS. \"If recommended, NHS England will work to make it available to NHS patients as rapidly as possible.\""
    },
    {
        "title": "Postcode lottery means groundbreaking MND drug is a lifeline for some - but 'mental torture' for others",
        "description": "Eleanor Dalley didn't think she'd live to see 50 after being diagnosed with motor neurone disease (MND) in 2019.",
        "url": "https://news.sky.com/story/postcode-lottery-means-groundbreaking-mnd-drug-is-a-lifeline-for-some-but-mental-torture-for-others-13500695",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eleanor-dalley-mnd_7149779.jpg?20260129191139",
        "type": "Technology",
        "Author": "Faye Brown",
        "Date Published": "2026-01-30 00:01:00",
        "Headline": "Eleanor Dalley and Lillia Jakeman both have motor neurone disease,  but only one has been granted access to a breakthrough treatment that can halt its symptoms. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Eleanor Dalley didn't think she'd live to see 50 after being diagnosed with motor neurone disease (MND) in 2019. There is no cure, and most people die within a few years as they lose their ability to move, eat, talk and breathe. But for Eleanor, there was a lifeline - a breakthrough drug that has stopped the condition in its tracks. \"It's a miracle to be honest, it's like I've frozen in time,\" the mum-of-one told Sky News. MND affects the brain and nerves, causing muscles to get progressively weaker. While Eleanor has lost some movement in her legs, her symptoms have not got any worse - allowing her to reach milestones she did not think she would live to see. \"My worst fear was that I'd be dead within a year,\" Eleanor said. \"I would put things on TV that would make me cry, so that I could say it was the TV that was making me cry, but it wasn't really. It was me worrying about, I'm not going to see my daughter grow up or I'm not going to get to 50. \"Having this new drug has meant I've achieved all those things. \"But I'm really lucky - and not everybody is getting that same opportunity.\" The drug, Tofersen, is the first effective treatment for MND symptoms. Eleanor was able to get it through an early access programme ran by its manufacturer Biogen, which is currently offering it to the NHS for free. However, it requires regular spinal injections, and while the drug itself is free, some NHS trusts say they don't have the staff or resources to administer it. These issues have resulted in a postcode lottery for access, with people like 19-year-old Lillia Jakeman losing out. 'Mental torture' \"It's like a carrot that's dangled, and then it's taken away,\" said Lillia's stepmum Rachel, a GP of 30 years. \"It's a very cruel, unjust situation.\" Lillia was diagnosed with MND in August, when she was given a leaflet about Tofersen. However, she has not been able to access the treatment upon referral. She now uses a wheelchair, while her upper arms are getting weaker, affecting her ability to do what she loves. \"One of the biggest things for her is that she used to love doing Lego and artwork, and [now] she can't,\" said Rachel. \"She's still got a degree of thumb function, so she can use an electric wheelchair, she can do certain things. But the point is that Tofersen needs to be given to these patients as early as possible to preserve function, and you know every day matters. \"Lillia describes it really as mental torture, not knowing when you wake up the next day, whether you might have lost something, some other function that's gone.\" The All Party Parliamentary Group on MND, chaired by Labour MP Ian Byrne, said it was aware of 20 people unable to access Tofersen and four people who had died while awaiting treatment. The drug is for those with an inherited form of MND called SOD1 - which makes up 2% of cases. Caroline Nokes, Lillia's local MP and a senior Conservative backbencher, said it should not be difficult to extend access to a small handful of people. She joined Lillia's family and Mr Byrne in handing in a petition to Downing Street on Wednesday, calling for the government to intervene. NHS 'red tape' The issue has sparked wider concern about accessing new treatments on the NHS, given the millions of pounds being invested in the life sciences sector on research projects and clinical trials. Tofersen received marketing authorisation in July from the UK's Medicines and Healthcare Regulatory Agency. Read more:Ex-England rugby captain Lewis Moody reveals MND diagnosis'Game changer' test could spot signs of MND earlier However the National Institute for Health and Care Excellence (NICE) is the body that advises whether drugs should be made available for routine funding on the NHS. It will begin its evaluation process for Tofersen in March, but it is not clear how long it will take. Ministers are said to be reluctant to interfere as they feel this would undermine the official process. Professor Ammar Al-Chalabi, a consultant neurologist at King's College Hospital, said there needed to be a simpler system. He said: \"The government would like us to be a science superpower, and for motor neurone disease, we really are. \"And this drug is available but it's not available to patients despite the scientific breakthrough, what does that say? \"What's the purpose of finding these new treatments if they're not available on the NHS? The pathway has to be complete.\" A Department of Health and Social Care spokesperson said: \"We are committed to improving care for people with motor neurone disease like Lillia and ensuring they receive the support and treatment they need. \"Tofersen is approved for use in the UK and NICE is working with the manufacturer on whether to recommend it for routine funding by the NHS. \"If recommended, NHS England will work to make it available to NHS patients as rapidly as possible.\""
    },
    {
        "title": "Genes play a big part in driving lifespan, scientists find",
        "description": "The genes you inherit play a bigger role in determining your lifespan than previously thought, according to a new study.",
        "url": "https://news.sky.com/story/genes-play-a-big-part-in-driving-lifespan-scientists-find-13500963",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dna-genetics-generic_7150241.jpg?20260130104143",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-30 09:04:00",
        "Headline": "How long a person lives may not only be down to their lifestyle - but their genetic makeup too, research suggests.",
        "Content": "The genes you inherit play a bigger role in determining your lifespan than previously thought, according to a new study. Previous studies have concluded genetics plays a 6% to 33% role in how long a person lives - but new research published in the journal, Science, has boosted that figure to as high as 55%. Ben Shenhar, lead author of the study, from the Weizmann Institute of Science in Israel, said: \"Lifespan is undoubtedly shaped by many factors including lifestyle, genes and, importantly, randomness - take for example genetically identical organisms raised in similar environments that die ​at different times. \"In our work, we tried to give a handle on the amount of variance between different people that can be ‍attributed to genetics. \"Our study tried to partition the longevity factors into genetics and 'everything else'. The 'everything else' is around 50% of the pile.\" Researchers looked at historical data from human twin studies and found factors such as deaths caused by violence, accidents and infectious diseases had not been taken into account. The cause of death was absent, which provided merely the age at death. So if one twin died at age 90 of natural causes and the other at age 30 ​due to an infectious disease, it could provide a misleading impression about the role of hereditary characteristics in lifespan. Researchers re-ran their analysis, accounting for the fact that vulnerability to infections and falls rises as people get older. The findings still revealed that genetic makeup contributes to around 50% of life expectancy. \"The number that we got is not out of nowhere,\" Mr Shenhar, who researches the physics of aging, told Sky's US partner network NBC News. \"If you look at twin studies on pretty much anything in humans, you get this 50%. \"If you look at the heritability of age of onset at menopause, which is an age-related decline, that is also around 50%.\" He also pointed to centenarians - people who live past 100. \"These people are not just clawing their way to 100,\" he said. \"No, they have protective genes that protect against the harms of age.\" Read more from Sky News:Groundbreaking MND drug a lifeline for some -'mental torture' for othersAI mammograms result in fewer aggressive breast cancers, study suggests Study prompts fierce debate While genetics may play a larger role in lifespan than previously thought, Eric Verdin, president and chief executive of the Buck Institute for Research on Aging in California, who was not involved in the study, cautioned a healthy lifestyle cannot be discounted. \"There are multiple genes that have been shown to be associated with aging, but if you study many centenarians, you don't find these genes in all of them,\" he said. He warned \"the depressing thing\" about the new study \"is that it makes people be fatalistic\". \"'It doesn't matter what I do. Why should I try to live better and not drink and do sport if it's determined by genes basically?'\" he said. Mr Shenhar said \"that is not our message, not at all\". \"The message of our paper is not that lifestyle, exercise and diet are not important,\" he said. \"That is not our message, not at all. Even if your genetics gives you a particular potential or range for what your natural lifespan would be, depending on lifestyle, that might shift slightly one way or another. So it's still important.\""
    },
    {
        "title": "AI-assisted mammograms result in fewer aggressive and advanced breast cancers, study suggests",
        "description": "AI-supported mammography results in fewer aggressive and advanced breast cancers, according to a study.",
        "url": "https://news.sky.com/story/ai-assisted-mammograms-result-in-fewer-aggressive-and-advanced-breast-cancers-study-suggests-13500748",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-breast-cancer_6500457.jpg?20240325124831",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-30 00:01:00",
        "Headline": "The AI was trained and tested with more than 200,000 breast exams from various institutions in more than 10 countries.",
        "Content": "AI-supported mammography results in fewer aggressive and advanced breast cancers, according to a study. It detected more women with clinically relevant cancers and the authors say there's a case for implementing it in screening programmes. The randomised control trial involved more than 100,000 Swedish women. Cancer diagnoses after AI-supported mammography were 12% lower, and the women were less likely to be diagnosed with more aggressive and advanced breast cancer in the years that followed. European guidelines recommend two radiologists read mammograms but some cancers still go undetected after screening. Estimates suggest 20-30% of breast cancers diagnosed after a negative screening and before the next scheduled one (interval cancers) could have been identified at the initial appointment. Previous studies and interim results of the Swedish trial found using AI increased detection compared with standard screening - but a key question has been if it translates into a reduction in interval cancers. \n                  UK rolls out free AI training, but will it save your job?\n                 \n                  Actors' union offered better deal over AI protections\n                 \n                  Sadiq Khan: AI could usher in new era of mass unemployment\n                 The women who took part in the trial were randomly assigned to either AI-assisted screening or standard double reading by radiologists. The AI was trained and tested with more than 200,000 breast exams from more than 10 countries. During the two years that followed, there were 1.55 interval cancers per 1,000 women in the AI group, compared with 1.76 interval in the control group: a 12% reduction.Eight-one percent of cancer cases were also detected at screening that used AI, compared with 74% of cancer cases in the control group. The rate of false positives was similar for both groups, at 1.5% in the AI group and 1.4% in the control group. The results from the trial have been published in The Lancet medical journal. Read more from Sky News:X to block Grok AI from undressing images of real peopleMenopause 'triggers loss of brain matter' Lead author Dr Kristina Lang, from Lund University, said the study - which took place between 2021 and 2022 - was the biggest so far to look at AI use in cancer screening in general. \"It finds that AI-supported screening improves the early detection of clinically relevant breast cancers, which led to fewer aggressive or advanced cancers diagnosed in between screenings,\" she said. Dr Lang said using AI in healthcare \"must be done cautiously\" with constant checks to \"ensure we have good data on how AI influences different regional and national screening programmes\". Jessie Gommers, a PhD student involved in the study, said AI-assisted mammography still needs at least one human radiologist but the results \"potentially justify using AI to ease the substantial pressure on radiologists' workloads\" - which could cut waiting times for patients."
    },
    {
        "title": "Melania's non-documentary might end up a box office flop - but she won't mind",
        "description": "\"Purposeful storytelling\" is how Melania Trump herself describes what audiences will find in her cinematic debut.",
        "url": "https://news.sky.com/story/melanias-non-documentary-might-end-up-a-box-office-flop-but-she-wont-mind-13501084",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-melania-trump-new-york_7148599.jpg?20260130140618",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2026-01-30 13:55:00",
        "Headline": "Amazon has forked out eye-watering sums for the enigmatic first lady's \"deliberate act of authorship\" - just don't call it a documentary.",
        "Content": "\n          Arts and entertainment correspondent\n       \"Purposeful storytelling\" is how Melania Trump herself describes what audiences will find in her cinematic debut. In many ways, that sums this film up. While Amazon paid an eye-watering fee for the documentary, don't expect a warts-and-all unflinching record of what the first lady did in the 20 days leading up to the 2025 presidential inauguration. The trailer alone is glamorous, funny and clearly carefully curated. Her own team say she had strong creative input into the film and, as one of the executive producers, it's likely the deal came with final cut approval. \"Some have called this a documentary, it is not,\" she said in a speech at the film's premiere. \"My film is a very deliberate act of authorship. Inviting you to witness events and emotions through a window of rich imagery. \n                  Amazon to cut 16,000 jobs globally to streamline operations\n                 \n                  Best and worst parcel delivery companies revealed\n                 \n                  Apple and Amazon defy expectations with latest results\n                 \"It is a created experience that offers perspectives, insights, and moments that only few have seen.\" And she's right, this is a unique record with Amazon boasting \"exclusive footage capturing critical meetings and private conversations\". But the reason we haven't typically seen access like this before is that presidents and first ladies generally don't pursue outside business ventures while in office. And that comes down to potential conflicts of interest. For example, Barack and Michelle Obama's mega multi-million dollar book deal was only announced shortly after he left office. Of course, technically the first lady signed this deal and filmed this before she was in office. And it was, by all accounts, quite the deal. Amazon is believed to have spent $35m on marketing the film, on top of the $40m it spent in a bidding war to win the rights. Of that initial $40m - Melania reportedly got $28m. Read more from Sky News:Toxin found in Nestle baby formulaPep Guardiola gives speech on Palestine The streamer has effectively argued that she's worth it - that it believes the perceived audience interest justifies that amount. Some critics have pointed out that Amazon is a company with many government contracts and this could have been a way to curry favour with the new administration. When a reporter at the premiere challenged the president on how the New York Times had called it an act of corporate corruption, Trump hit back that it was \"fake news\". \"I think it's a very important movie... It shows life in the White House. It's a big deal actually.\" Then there's the filmmaker attached to this documentary... Brett Ratner. Best known for the Rush Hour franchise, he has been persona non grata in Hollywood for about a decade. He hasn't directed a movie since 2014 after being exiled at the height of the MeToo movement following accusations of sexual harassment and misconduct by several women, which he categorically denies. This film effectively marks his big comeback. It's also led to him being asked to make other movies including Rush Hour 4. And while Ratner must be overjoyed to be back, reportedly two-thirds of the crew that worked on this have asked not to have their names credited. Melania is thought to be opening with screenings in around 1,500 cinemas - not just in America but globally and in the UK. While on social media President Trump has written: \"MELANIA, the Movie, is a MUST WATCH... Get your tickets today - Selling out, FAST!\" So far, UK ticket sales seem to have been a bit limp. At the time of writing this, looking at a dozen London cinemas' Friday night screenings, there are plenty of seats available. Is there enough international interest to get people paying out for popcorn to watch it? Will it be a box office flop? Well, documentaries historically never fare particularly well in cinemas. And of course, if you're Melania, that doesn't really matter. She's already been paid and gets to tell the story that she wants to tell."
    },
    {
        "title": "Queen joins Rivals stars to pay respects to longstanding friend Dame Jilly Cooper at memorial",
        "description": "The Queen was among a list of well-known faces who paid their respects to Dame Jilly Cooper at a memorial in London on Friday.",
        "url": "https://news.sky.com/story/queen-pays-respect-to-longstanding-friend-dame-jilly-cooper-at-memorial-13501006",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-aidan-turner-victoria-smurfit_7150269.jpg?20260130110648",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-30 10:39:00",
        "Headline": "Stars from film, TV and literature arrived in central London to  pay respects to the renowned author, who died in October last year.",
        "Content": "The Queen was among a list of well-known faces who paid their respects to Dame Jilly Cooper at a memorial in London on Friday. The legendary author died unexpectedly in October at the age of 88 from injuries sustained from a fall. On Friday, stars from the film, sport and literary worlds turned out to pay their respects. In attendance were actors Danny Dyer, David Tennant, Aidan Turner, Bella Maclean and Victoria Smurfit, who star in Disney TV show Rivals. The show is adapted from Cooper's 1988 novel of the same name. Arsenal legend Tony Adams, comedian Helen Lederer and actress Lisa Maxwell were among the first to arrive. Dame Jilly Cooper's literary agent Felicity Blunt also arrived alongside her husband, actor Stanley Tucci. Blunt wore a tote bag that said \"I love Jilly Cooper\" on it. Tucci paid tribute to the late author, telling reporters: \"She lived an incredible life. \"She also changed the lives of so many people for the better with her books, my wife being one of them. \"She was an extraordinary person, a brilliant writer, nice person and naughty.\" Queen Camilla, a longstanding friend of Cooper's, wore a blue coat dress to the memorial. The pair had a close friendship, with the Queen telling a literary festival shortly after her death: \"She came to a party here a few years ago where, I hope, she uttered her immortal line, 'I'm going to get so absolutely plastered tonight, darling. I love you so much, I want to see two of you'. \"Dear Jilly, how we'd love to have seen just one of you here with us today.\" Read more from Sky News:Queen won't tour in us because it is too \"dangerous\"Is Trump about to attack Iran The Queen's former husband, Andrew Parker-Bowles, and their son Tom were also in attendance. In a touching moment, the Queen posed with a picture of Cooper alongside the Dean of Southwark, Mark Oakley. As the day wore on, other famous names from sport and TV arrived - including broadcasters Gyles Brandreth and Clare Balding."
    },
    {
        "title": "Queen won't tour in US because it's 'a dangerous place'",
        "description": "Legendary Queen guitarist Brian May has said the band will not tour in the US any time soon, saying it has become \"a dangerous place\".",
        "url": "https://news.sky.com/story/queen-wont-tour-in-us-because-its-a-dangerous-place-13500965",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brian-may-queen_7150194.jpg?20260130095153",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-30 09:29:00",
        "Headline": "The band has not played a show since February 2014, but it appears that if they were to announce new gigs they would not be stateside.",
        "Content": "Legendary Queen guitarist Brian May has said the band will not tour in the US any time soon, saying it has become \"a dangerous place\". The band has not played a show since February 2014, but it appears that if they were to announce new gigs they would not be stateside. In comments to the Daily Mail, Sir Brian said: \"America is a dangerous place at the moment, so you have to take that into account. \"It's very sad because I feel like Queen grew up in America and we love it, but it's not what it was. \"Everyone is thinking twice about going there at the moment.\" It comes as concerns about extra checks at the border and political tensions appear to be deterring travellers from visiting America. Read more from Sky News:Former Little Mix singer says mum first noticed twins' conditionBBC announces interim director general Sir Brian also said he would not play at Glastonbury Festival next year, despite it being in the UK and not the US. This, he says, is because he disagrees with the practice of badger culling in farming."
    }
]