[
    {
        "title": "ICE shooting: This could be a moment of reckoning for America - and battle lines are being drawn",
        "description": "It was over in a second - three shots fired - but this fatal ICE shooting will have lengthy repercussions.",
        "url": "https://news.sky.com/story/minneapolis-becomes-flashpoint-once-again-as-battle-lines-are-drawn-after-ice-shots-fired-13491845",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-vehicle-minneapolis_7129313.jpg?20260107172411",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2026-01-07 23:10:00",
        "Headline": "An ICE agent shot and killed a woman in Minneapolis after she allegedly attempted to run over an officer, a claim that has been challenged by the city's mayor. ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It was over in a second - three shots fired - but this fatal ICE shooting will have lengthy repercussions. Minneapolis becomes a flashpoint, exposing deep fractures over immigration and how it's being enforced. Minneapolis shooting as it happened A woman has been shot dead by an Immigration and Customs Enforcement agent in Minneapolis. Tensions have been high in the city due to the deployment of ICE officers for a crackdown tied in part to allegations of fraud involving Somali residents. Department of Homeland Security spokeswoman Tricia McLaughlin claimed the deceased was shot when she attempted to \"weaponise\" her vehicle and run over an officer. Trump has backed that version of events in a social media post. Minneapolis mayor Jacob Frey has called the claims \"bullshit\" and criticised ICE, while Kamala Harris has accused Trump of \"gaslighting\". Read our full report here. Protestors were already on the streets, resisting the large-scale deployment of ICE agents in Minnesota. Now, the battle lines are being drawn by both sides. President Donald Trump is claiming the immigration officer acted in self-defence. \"Don't believe the propaganda,\" Governor Tim Walz posted. \"I've seen the video,\" he added. Trump's 2024 election rival, Kamala Harris, accused the president of \"gaslighting\". There are several videos in circulation, each side using them to support its account of what happened. Several eyewitnesses are strenuously denying the Trump administration's version of events. Tension had been building for weeks, with 2,000 agents deployed to Minnesota in December. The Twin Cities have seen the largest immigration enforcement operation in any US city. ICE is the federal US Immigration and Customs Enforcement agency responsible for homeland security investigations and removal operations against people the US decides are in the country illegally. Its operations have ramped up significantly as part of the Trump administration's immigration crackdown. Sky News has previously witnessed people being taken off the streets by officers and bundled into vehicles, including in Washington DC. The mayor, Jacob Frey, isn't mincing his words, telling ICE to \"get the f*** out\". But it's not the first time Mr Frey has led his city through a controversy of this nature. He rose to prominence following the murder of George Floyd in 2020. So, he knows how tragedies like this can become moments of reckoning that sweep America."
    },
    {
        "title": "Mounjaro and Wegovy may need to be continued for life, new research suggests",
        "description": "The weight loss jabs Mounjaro and Wegovy may need to be continued for life to keep obesity under control, new research suggests.",
        "url": "https://news.sky.com/story/mounjaro-and-wegovy-may-need-to-be-continued-for-life-new-research-suggests-13491633",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Home",
        "Author": "Thomas Moore",
        "Date Published": "2026-01-07 16:59:00",
        "Headline": "Almost two million British adults have used the weight loss jabs in the last year. The overwhelming majority are paying privately.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n The weight loss jabs Mounjaro and Wegovy may need to be continued for life to keep obesity under control, new research suggests. The finding will dismay people who are stretching their household finances to afford treatment, which can cost up to Â£300 a month depending on the dose and drug. Almost two million British adults have used the jabs in the last year. And the overwhelming majority are paying privately. According to the new research, around half of users stop treatment within a year. That's often because of side effects or cost. But it then takes an average of just one and a half years for people to put back on all the weight they've lost, results published in the British Medical Journal reveal. Professor Susan Jebb, an expert on diet and population health at the University of Oxford, told Sky News it suggests treatment may need to be long-term. \"Most people who are living with obesity, who have all that genetic and metabolic predisposition to gain weight, are going to need lifelong support of some kind,\" she said. \"Whether that's lifelong medication or whether it's medication at intervals combined with some other treatments, we just don't yet know. \"The big unanswered question is how do you help people keep the weight off. And that is a different process than is necessary for losing weight.\" Read more:Weight loss jabs conditionally backed to tackle obesity by WHO'Irresponsible' weight loss ads banned by watchdog Rosie Parsons lost eight stone while taking Wegovy, dropping from 19.5 stone to a little over 11 stone. But when her weight loss began to slow, she questioned the value of spending around Â£175 a month on the drug. She tried using Mounjaro, which is even more powerful, but the gastrointestinal side effects were too much. In the four months since stopping treatment she put on four stone - half of what she lost. \"I'm just trying to figure out what to do,\" she said. \"It's difficult when the price of everything has gone up so much as well. \"It probably does mean that I'll need to be on those drugs for life. But it's how to afford that because I can't get treatment through the NHS.\" Rosie still finds it reasonably straightforward to have a healthy diet during the day. But without the jabs, the sugar cravings return in the evening. Between 40% and 70% of the risk of obesity is determined by genetics. Inheriting the wrong genes doesn't make obesity inevitable, but it makes it harder to control weight - particularly when unhealthy food is cheap and abundant. How the weight loss drugs work isn't fully understood. They mimic gastric hormones and make people feel fuller for longer. But they also have an effect on the brain. The research shows that people put on weight four times faster after quitting the jabs than coming off a diet. Scientists say that may be because the biological switches that drive obesity are suddenly flicked back on when treatment with such powerful drugs is stopped. Sam West, another of the Oxford researchers, said: \"They're not a silver bullet, they don't fix it long-term. While you take them, they are incredibly effective. But when you stop taking them, the weight regain occurs rapidly.\""
    },
    {
        "title": "Tracking the sanctioned oil tanker's attempt to escape seizure by the US ",
        "description": "For more than two weeks, Sky News' Data and Forensics team has plotted the movements of the US-sanctioned oil tanker Marinera.",
        "url": "https://news.sky.com/story/tracking-the-sanctioned-oil-tankers-attempt-to-escape-seizure-by-the-us-13491637",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dxf-us_7129282.jpg?20260107170459",
        "type": "Home",
        "Author": "Freya Gibson, Annoa Abekah-Mensah, Ben van der Merwe and Lydia Morrish, Data and Forensics",
        "Date Published": "2026-01-07 16:53:00",
        "Headline": "The US-sanctioned Marinera oil tanker undertook multiple efforts to hide its identity before its seizure off the coast of Iceland.",
        "Content": "By Freya Gibson, Annoa Abekah-Mensah, Ben van der Merwe and Lydia Morrish, Data and Forensics  For more than two weeks, Sky News' Data and Forensics team has plotted the movements of the US-sanctioned oil tanker Marinera. The ship undertook multiple efforts to hide its identity before its seizure on 7 January off the coast of Iceland. On Wednesday, 7 January, the US military said it captured the vessel, previously named Bella 1, following a weeks-long pursuit across the Atlantic. The Royal Air Force and Royal Navy provided support for the Marinera's seizure, according to the Ministry of Defence, including the provision of state-of-the-art refuelling ship RFA Tideforce. Flight tracking data showed several US aircraft, including US Air Force special operations, arriving and leaving RAF bases and UK airports in the hours prior to the seizure. Sky News analysis shows the tanker's journey from Iran over nearly two months and its apparent attempts to evade detection. How the Marinera's voyage unfolded Ship-tracking AIS location data from 3 September placed the tanker approximately 9km from the Strait of Hormuz, according to Global Fishing Watch. However, the satellite image below, also taken on 3 September, shows Bella 1 more than 700km away. It was stationed at Kharg Island, Iran's primary oil export facility, where analytics company Kpler says it loaded crude oil. The discrepancy between the AIS data and the satellite imagery suggests the tanker was providing a fake signal to hide its location, a practice known as \"spoofing\". The ship's signal was restored once it had left Iranian waters, and on 13 November it began its journey. The AIS data later shows the tanker at Egypt's Suez South anchorage, where it remained between 23 and 26 November. The Suez region is a major transport route for oil and gas. Oil can be offloaded at the Suez South anchorage, primarily through ship-to-ship transfers or pipeline systems. Sky News cannot confirm whether the Bella 1 offloaded oil here. We can be confident that the tanker was here on these dates because vessels in the area are required to transmit accurate locations. On 3 December, the ship passed through another area with mandatory location reporting, the Strait of Gibraltar, before continuing its journey across the Atlantic. It was last spotted by AIS systems on 17 December in the Caribbean, near Antigua and Barbuda. Reports suggest that the US Coast Guard attempted to board the tanker on the 20 December, stating that the United States had a seizure warrant and that the vessel was not flying a valid national flag. Under international law, vessels are required to be registered under a particular country, and this country is relied upon for protection. The Bella 1 was flying the flag of Guyana, but the US said it had not actually registered with the country. Sky News analysis has found that 40 sanctioned tankers are currently flying the Guyanese flag, despite not one of them being actually registered in Guyana. One day after the US Coast Guard reportedly attempted to board the Bella 1, it was recorded making 39 distress calls between 12.26pm and 17.13pm. These distress calls helped us locate the primary position of the tanker that day, which was just over 500km from the coast of Antigua and Barbuda, shown on the map below. When the ship next appeared, on 1 January, it had travelled more than 3,000 km to the North Atlantic, changed its name to \"Marinera\" and adopted a Russian flag. Sky News analysis found that at least 21 other sanctioned oil tankers have also changed their flags to Russia in the past month. That's more than changed flags during the whole of 2024. Five ships changed to Russian flags in just two days following the first seizure of a Venezuela-linked tanker by the US on 10 December. Of the 22 tankers that have adopted Russian flags in the past month, at least 11 have previously visited both Venezuelan and Russian ports. The seizure of the Marinera  By 7 January, the Marinera was passing between Iceland and Scotland, escorted by a Russian submarine according to reports in the Wall Street Journal. Shipping analytics company Windward said the ship was likely heading for the Russian arctic port of Murmansk. At around 11.26am, the Marinera made a sudden southbound turn. It was later seen at 1.18pm, heading east towards Scotland, according to data shared by TankerTrackers. At 1.43pm, the US European Command announced it had seized the vessel for violations of US sanctions. Speaking to Sky News, Mark Cancian, a senior advisor on defence and security at the Centre for Strategic and International Studies (CSIS), said that the helicopters used to board the Marinera were short-ranged. \"Either they came from the US air base on Keflavik, in which case the Icelandic government had to agree, or from a sea platform like the Special Ops mothership,\" he said. Following the seizure, Russia's transport ministry issued a statement saying that the act had violated maritime law. \"In accordance with the 1982 UN Convention on the Law of the Sea, freedom of navigation applies in waters on the high seas, and no state has the right to use force against vessels duly registered in the jurisdictions of other states,\" the statement read. The transport ministry also confirmed that Russia had granted the tanker a temporary permit to fly its flag. The US also announced that it had seized another tanker, M/T Sophia, shortly after announcing the capture of Marinera. US Southern Command stated that the vessel had been \"conducting illicit activities\" in the Caribbean Sea. The United States has now seized at least four sanctioned tankers linked to Venezuela, following the capture of vessels Skipper and Centuries in December last year. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "'Dereliction of duty': Met Police relaxed vetting to meet recruitment targets",
        "description": "Serial rapists David Carrick and Cliff Mitchell were among more than 130 Metropolitan Police officers and staff wrongly hired or allowed to keep working as vetting was relaxed in a recruitment drive, a review has found.",
        "url": "https://news.sky.com/story/dereliction-of-duty-met-police-relaxed-vetting-to-meet-recruitment-targets-13491670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-carrick-cliff-mitchell_7129880.png?20260108001233",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2026-01-07 18:20:00",
        "Headline": "Thousands of officers and staff were hired or retained without proper checks, with more than 130 going on to commit misconduct or crimes.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Serial rapists David Carrick and Cliff Mitchell were among more than 130 Metropolitan Police officers and staff wrongly hired or allowed to keep working as vetting was relaxed in a recruitment drive, a review has found. Thousands of recruits joined the force without undergoing proper checks as bosses abandoned national guidelines amid efforts to meet the Tory government's policy to recruit 20,000 officers in England and Wales. Home Secretary Shabana Mahmood called the failings \"a dereliction of the Met's duty to keep London safe\" as she ordered the police inspectorate to carry out an urgent independent probe. Mitchell, 26, who was given a life sentence in 2024 for attacks on two victims over nine years, was initially rejected from the force because of a previous allegation of child rape. But a vetting panel, aimed at reducing disproportionality towards ethnic minority groups, overturned the decision and he joined the force in August 2020. Carrick, 51, who is one of the UK's worst ever sex offenders, had joined the Met in 2001 but a re-vetting error in 2017 meant he was allowed to work as an armed officer until he was arrested in 2021. He is serving 37 life sentences. They are among 131 officers and staff known to have committed crimes or misconduct after not being properly vetted in the decade to April 2023. This includes serious sexual offences, racism, drugs misuse, driving offences, affray, or working while intoxicated. But an internal review published on Thursday says an estimated 1,200 out of the 27,300 applicants to the Met in the period may have had their vetting refused had it been done properly. An estimated 250 people may have been found unsuitable to join the force among 17,355 who may not have had references taken between 2018 and April 2022. The now scrapped vetting panel also overturned the rejection of at least 114 people out of 505 of the cases reviewed, with 25 of them, including Mitchell, going on to commit misconduct or be accused of a crime. The review focused on the period immediately before and during the police recruitment drive from January 2018 to the end of March 2023. Met blames 'political interventions' Britain's largest police force blamed pressures to recruit 4,557 extra officers, \"heightened by political interventions and adverse financial consequences\" for deviating from Authorised Professional Practice over the period. This included the automatic transfer of vetting from other police forces into the Met. The review found 5,100 recruits were subject to limited vetting, such as not being checked against Special Branch or MoD indices, along with 3,338 serving officers and staff due for vetting renewal. 'Not all cops are bad' The Met says it has taken action to clean up the workforce and tighten vetting standards, with around 1,500 officers sacked since Met Commissioner Mark Rowley took over the force in September 2022. Just eight serving officers or staff members from the thousands affected are still said to be of \"concern\". Assistant Commissioner Rachel Williams said: \"The vast majority run towards danger on a daily basis and their integrity is not in question. \"Don't think all our officers and staff are bad people.\" The Home Office has ordered the Inspector of Constabulary to look at how the systematic failures within the Met were allowed to happen and assess whether other forces across England and Wales may have deviated from vetting standards. Ms Mahmood, said:  \"Abandoning vetting checks on officers was a dereliction of the Met's duty to keep London safe. \"Londoners rightly expect officers to undergo robust checks so that the brightest and best - not criminals - are policing our streets. \"I have asked the Chief Inspector of Constabulary to carry out an inspection as I seek to restore trust in the force's ability to protect and serve the public.\""
    },
    {
        "title": "Coming to Greenland makes you realise how preposterous Trump's claims to territory are",
        "description": "It takes coming to Greenland to realise quite how preposterous Donald Trump's claims to the place are.",
        "url": "https://news.sky.com/story/coming-to-greenland-makes-you-realise-how-preposterous-trumps-claims-to-territory-are-13491743",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-nuuk_7129862.jpg?20260107234340",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-07 21:06:00",
        "Headline": "Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n It takes coming to Greenland to realise quite how preposterous Donald Trump's claims to the place are. There are his comments that its waters are infested with Russian and Chinese ships, for instance. \"This is crazy nonsense,\" one member of Greenland's ruling coalition told us. MP Nivi Rosing says Greenlanders are taking Trump seriously though. \"I'm personally afraid that he has to have a reason to take over our country by saying, oh, they have Russian and Chinese ships in their waters, which we don't have,\" she says. For the record, there is no evidence of an armada of hostile enemy vessels marauding the waters of Greenland nor has the Trump administration offered any. There are those who say that this is all Trumpian bluster. Don't take him literally. Greenlanders cannot afford to be so nonchalant. Ex-ambassador to the US, Peter Mandelson, expresses such sentiments in The Spectator. He says: \"The future of Greenland is being misunderstood. Trump is not going to 'invade' it. He doesn't need to. He's already there. What will happen is that the threats to Arctic security posed by China and Russia will crystallise in European minds.\" The threat to take it over, he implies, is a ruse to knock Western heads together to accept a \"considerably beefed-up role and status and military deployment by America\". Try telling that to Greenlanders facing repeated threats from a predatory US president. If it is just a device to improve Arctic security, they would say, Trump is sure going a strange way about it. Under a 1951 treaty with Denmark, the US could reopen all the bases it had here in the Second World War and more. It does not take an invasion, annexation or the hyperbolic threat of one to do so. Read more from Sky News:How oil tankers tried to avoid seizure by USUS aims to control Venezuela oil sales 'indefinitely' For the people of Greenland and their political masters in Denmark, Mandelson might look a little naive. They fear this is more about Trump's baser instincts, his need for glory, to be the first US president in decades to acquire territory and expand America's borders. And they are upset and angry with him. ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ Klaus Iversen served in the Danish military in Greenland and knows the sacrifices Danes have made more than many for America's security. To be told Denmark is not pulling its weight is deeply offensive to veterans like him. He says: \"I feel offended, I feel sad. I have colleagues who died in Afghanistan and Iraq supporting the Americans down there, so of course we find that extremely strange and saddening.\" There is a long-running resentment of Danish rule among many here. Accusations it has taken Greenland's mineral wealth and not paid back enough. Claims it has not invested enough in critical infrastructure, from roads to welfare. But they value everything their connection with Europe brings them here - the free education, the free health service, the cultural ties, the $500m (Â£370m) in annual financial aid. Polls and last year's election suggest there is no appetite for exchanging that for an uncertain future with the US. Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first."
    },
    {
        "title": "Time for your dog to go vegan? Canine food counts for 1% of UK greenhouse gas emissions, survey shows",
        "description": "Dog food in the UK counts for around 1% of the country's total greenhouse gas emissions, according to the findings of an environmental survey.",
        "url": "https://news.sky.com/story/time-for-your-dog-to-go-vegan-canine-food-counts-for-1-of-uk-greenhouse-gas-emissions-survey-shows-13491567",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dog-carbon_7129254.jpg?20260107164157",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-07 14:33:00",
        "Headline": "Wet, raw and meat-rich products are associated with substantially higher greenhouse gas emissions than dry dog food, the analysis found.",
        "Content": "Dog food in the UK counts for around 1% of the country's total greenhouse gas emissions, according to the findings of an environmental survey. The analysis also reveals striking differences in the climate impact of commercial dog foods, with the highest-impact foods responsible for up to 65 times more emissions than the lowest-rated options. Wet, raw and meat-rich products are associated with substantially higher greenhouse gas emissions than dry dog food, the study found. Scientists from the Universities of Edinburgh and Exeter used ingredient and nutrient labelling information to calculate the carbon footprint of almost 1,000 commercially available dog foods, based on emissions generated during the production of ingredients. Their sample included a selection of dry, wet and raw foods, including plant-based and grain-free options. The findings highlight the need for greater transparency and better labelling of dog food ingredients to help consumers make informed choices, as pet ownership continues to rise, experts say. John Harvey, a researcher at the University of Edinburgh, said there seem to be more foods that are plant-based now available on the market. The research found that plant-based foods were typically lower-impact options, especially in the case of wet foods. Read more from Sky News:Waterstones owner lines up RothschildNew road safety measures 'not enough' But if dog owners use meat products that otherwise would go to waste, they can potentially be lower impact than some plant proteins. Mr Harvey, who has a background as a practicing veterinary surgeon, said some owners are moving towards choosing plant-based options, but it's a small percentage and the push has actually been towards high-meat content. He said there is no evidence to suggest that dogs require really high-meat content. On food labelling, Mr Harvey told Sky News: \"We need to be able to tell whether meat in dog food is potentially of a type that might otherwise be fed to humans, or if it's actually meat - which are things like offcuts, things like liver - that would otherwise potentially be waste product from the human food chain, which has a much lower impact.\" Mr Harvey said dog food labels don't let you know what's in the food, making it difficult to independently look at what the environment impact of that food would be. Clearer labelling is really important, he added."
    },
    {
        "title": "New app will allow pupils to view GCSE results digitally from summer 2026",
        "description": "Year 11 pupils in England will soon be able to access their GCSE results on their phones, under government plans to modernise how exam records are stored and shared.",
        "url": "https://news.sky.com/story/new-app-will-allow-pupils-to-view-gcse-results-digitally-from-summer-2026-13491659",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pupils-phone_7129375.jpg?20260107181913",
        "type": "Home",
        "Author": "Anjum Peerbacos",
        "Date Published": "2026-01-07 17:57:00",
        "Headline": "The government says the app, the Education Record, will reduce reliance on paper certificates, which can be lost or damaged. ",
        "Content": "\n          Education reporter\n       Year 11 pupils in England will soon be able to access their GCSE results on their phones, under government plans to modernise how exam records are stored and shared. The Department for Education has announced the national rollout of a new app, the Education Record, which allows students to view their GCSE results digitally from summer 2026. This will make it easier for young people to enrol in further education or prove their qualifications to future employers. Under the plans, pupils will still attend school on results day to receive their grades in person from 9am. Results will then appear on the app later the same morning, from 11am. The government says the app will reduce reliance on paper certificates, which can be lost or damaged, and will give employers faster access to verified education records. Schools and colleges will also be able to see key information about incoming students, including whether they need to resit English or maths GCSEs, have special educational needs, or are eligible for free school meals. Skills minister Jacqui Smith said the new system would bring exam records \"into the 21st century\". \"This app gives young people instant access to their results whenever they need them, while freeing up teachers and college staff from unnecessary paperwork,\" she said. A good use of money? The Education Record app has already been piloted in parts of Greater Manchester and the West Midlands, where around 4,000 pupils at 29 schools accessed their GCSE results digitally last summer. Earlier technical pilots took place in Coventry and Oldham. Ms Smith told Sky News the app, which has cost Â£5.5m over the past two years, has \"been recognised and welcomed by the students and the schools and colleges\". But Robert Logan, principal at Hathershaw College in Oldham, where the pilot took place, said he would rather have money to repair his school building with \"bricks and mortar\" and \"train teachers to the highest possible standard, so children have the best educational outcomes\". Mr Logan also said he would like to see the SEND (special education needs and disabilities) funding gap addressed. Read more from Sky News:Storm Goretti to hitKevin Keegan diagnosed with cancer The app did pose some issues: students need to possess an appropriate smartphone - if the device is too old, the app cannot be downloaded. Students will also need to have the necessary data capability to download the app, which will also need to be downloaded by the college or sixth form. But Paul Whiteman, general secretary of school leaders' union NAHT, described the expansion as \"a sensible development\", adding that including post-16 qualifications in future could make the system even more useful. Schools and colleges are being encouraged to sign up to the Education Record system ahead of GCSE results day in August 2026. The Department for Education also is committed to increasing its funding for the condition of school and college buildings, investing Â£3bn per year by 2034-35."
    },
    {
        "title": "Tribute paid to teenager who died in crash - after police told family he survived",
        "description": "Tributes have been paid to a teenager who died in a car crash - after police told his family he survived.",
        "url": "https://news.sky.com/story/tribute-paid-to-teenager-who-died-in-crash-after-police-told-family-he-survived-13491749",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-joshua-johnson-south-yorkshire-police_7129597.jpg?20260107210534",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-07 21:04:00",
        "Headline": "Mr Johnson's family said: \"What we have been through and are continuing to go through is unimaginable.\"",
        "Content": "Tributes have been paid to a teenager who died in a car crash - after police told his family he survived. In a statement, Joshua Johnson's family said they had been through an \"unimaginable\" ordeal. The 18-year-old died following a collision in Rotherham on 13 December. South Yorkshire Police (SYP) initially identified the victim as 17-year-old Trevor Wynn, alongside a teenage girl who was also killed in the collision on Todwick Road. Mr Johnson, meanwhile, was under sedation in hospital, the force had said. But now SYP has referred itself to the police watchdog after \"information came to light\" which revealed it was actually Mr Johnson who died, and Mr Wynn who remained in hospital. \"That information was, in fact, the patient waking up and saying, 'I'm Trevor',\" Sky News correspondent Emma Birchley explained. Further checks, including forensic testing, confirmed a mistake had been made. In a tribute released via police, Mr Johnson's family said: \"What we have been through and are continuing to go through is unimaginable. \"From the moment we were told about the collision in December, ourselves and many loved ones have spent hours in hospital with who we now know to be Trevor. \"We never wanted him to be alone. Only those we shared this time could understand how this went on for so long.\" Mr Johnson's family said he was \"a loveable, gentle giant\". \"Whilst he was 18 and exploring his independence, he was ever so genuine in his care for others - us, his brother, his grandparents, his extended family, and his many friends,\" they added. \"Neither us nor Josh's brother can imagine life without him, and as we adjust to this new world and only just begin our journey with grief, we ask that our privacy is respected,\" the statement concluded. Assistant Chief Constable Colin McFarlane said the mix-up came as \"a huge shock to everyone, and we recognise the additional trauma this may cause\". He continued: \"We are supporting Trevor and all the families through this and have engaged specialist agencies to help provide that support. \"I have also offered to meet with both sets of parents, as I am sure they will have many questions, most of which we are not able to answer yet, but we are absolutely committed to understanding how this happened so it cannot happen again. \"We have taken the decision to refer ourselves to the Independent Office for Police Conduct (IOPC). \"We will co-operate fully with any subsequent investigation and will be led by the IOPC on the next steps to determine how this happened, and how we can ensure this never happens again in the future.\" An 18-year-old has been arrested on suspicion of causing death by dangerous driving, and a 19-year-old has also been arrested on suspicion of perverting the course of justice. Both remain on bail pending further enquiries."
    },
    {
        "title": "'Dereliction of duty': Met Police relaxed vetting to meet recruitment targets",
        "description": "Serial rapists David Carrick and Cliff Mitchell were among more than 130 Metropolitan Police officers and staff wrongly hired or allowed to keep working as vetting was relaxed in a recruitment drive, a review has found.",
        "url": "https://news.sky.com/story/dereliction-of-duty-met-police-relaxed-vetting-to-meet-recruitment-targets-13491670",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-carrick-cliff-mitchell_7129880.png?20260108001233",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2026-01-07 18:20:00",
        "Headline": "Thousands of officers and staff were hired or retained without proper checks, with more than 130 going on to commit misconduct or crimes.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n Serial rapists David Carrick and Cliff Mitchell were among more than 130 Metropolitan Police officers and staff wrongly hired or allowed to keep working as vetting was relaxed in a recruitment drive, a review has found. Thousands of recruits joined the force without undergoing proper checks as bosses abandoned national guidelines amid efforts to meet the Tory government's policy to recruit 20,000 officers in England and Wales. Home Secretary Shabana Mahmood called the failings \"a dereliction of the Met's duty to keep London safe\" as she ordered the police inspectorate to carry out an urgent independent probe. Mitchell, 26, who was given a life sentence in 2024 for attacks on two victims over nine years, was initially rejected from the force because of a previous allegation of child rape. But a vetting panel, aimed at reducing disproportionality towards ethnic minority groups, overturned the decision and he joined the force in August 2020. Carrick, 51, who is one of the UK's worst ever sex offenders, had joined the Met in 2001 but a re-vetting error in 2017 meant he was allowed to work as an armed officer until he was arrested in 2021. He is serving 37 life sentences. They are among 131 officers and staff known to have committed crimes or misconduct after not being properly vetted in the decade to April 2023. This includes serious sexual offences, racism, drugs misuse, driving offences, affray, or working while intoxicated. But an internal review published on Thursday says an estimated 1,200 out of the 27,300 applicants to the Met in the period may have had their vetting refused had it been done properly. An estimated 250 people may have been found unsuitable to join the force among 17,355 who may not have had references taken between 2018 and April 2022. The now scrapped vetting panel also overturned the rejection of at least 114 people out of 505 of the cases reviewed, with 25 of them, including Mitchell, going on to commit misconduct or be accused of a crime. The review focused on the period immediately before and during the police recruitment drive from January 2018 to the end of March 2023. Met blames 'political interventions' Britain's largest police force blamed pressures to recruit 4,557 extra officers, \"heightened by political interventions and adverse financial consequences\" for deviating from Authorised Professional Practice over the period. This included the automatic transfer of vetting from other police forces into the Met. The review found 5,100 recruits were subject to limited vetting, such as not being checked against Special Branch or MoD indices, along with 3,338 serving officers and staff due for vetting renewal. 'Not all cops are bad' The Met says it has taken action to clean up the workforce and tighten vetting standards, with around 1,500 officers sacked since Met Commissioner Mark Rowley took over the force in September 2022. Just eight serving officers or staff members from the thousands affected are still said to be of \"concern\". Assistant Commissioner Rachel Williams said: \"The vast majority run towards danger on a daily basis and their integrity is not in question. \"Don't think all our officers and staff are bad people.\" The Home Office has ordered the Inspector of Constabulary to look at how the systematic failures within the Met were allowed to happen and assess whether other forces across England and Wales may have deviated from vetting standards. Ms Mahmood, said:  \"Abandoning vetting checks on officers was a dereliction of the Met's duty to keep London safe. \"Londoners rightly expect officers to undergo robust checks so that the brightest and best - not criminals - are policing our streets. \"I have asked the Chief Inspector of Constabulary to carry out an inspection as I seek to restore trust in the force's ability to protect and serve the public.\""
    },
    {
        "title": "Mounjaro and Wegovy may need to be continued for life, new research suggests",
        "description": "The weight loss jabs Mounjaro and Wegovy may need to be continued for life to keep obesity under control, new research suggests.",
        "url": "https://news.sky.com/story/mounjaro-and-wegovy-may-need-to-be-continued-for-life-new-research-suggests-13491633",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "UK",
        "Author": "Thomas Moore",
        "Date Published": "2026-01-07 16:59:00",
        "Headline": "Almost two million British adults have used the weight loss jabs in the last year. The overwhelming majority are paying privately.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n The weight loss jabs Mounjaro and Wegovy may need to be continued for life to keep obesity under control, new research suggests. The finding will dismay people who are stretching their household finances to afford treatment, which can cost up to Â£300 a month depending on the dose and drug. Almost two million British adults have used the jabs in the last year. And the overwhelming majority are paying privately. According to the new research, around half of users stop treatment within a year. That's often because of side effects or cost. But it then takes an average of just one and a half years for people to put back on all the weight they've lost, results published in the British Medical Journal reveal. Professor Susan Jebb, an expert on diet and population health at the University of Oxford, told Sky News it suggests treatment may need to be long-term. \"Most people who are living with obesity, who have all that genetic and metabolic predisposition to gain weight, are going to need lifelong support of some kind,\" she said. \"Whether that's lifelong medication or whether it's medication at intervals combined with some other treatments, we just don't yet know. \"The big unanswered question is how do you help people keep the weight off. And that is a different process than is necessary for losing weight.\" Read more:Weight loss jabs conditionally backed to tackle obesity by WHO'Irresponsible' weight loss ads banned by watchdog Rosie Parsons lost eight stone while taking Wegovy, dropping from 19.5 stone to a little over 11 stone. But when her weight loss began to slow, she questioned the value of spending around Â£175 a month on the drug. She tried using Mounjaro, which is even more powerful, but the gastrointestinal side effects were too much. In the four months since stopping treatment she put on four stone - half of what she lost. \"I'm just trying to figure out what to do,\" she said. \"It's difficult when the price of everything has gone up so much as well. \"It probably does mean that I'll need to be on those drugs for life. But it's how to afford that because I can't get treatment through the NHS.\" Rosie still finds it reasonably straightforward to have a healthy diet during the day. But without the jabs, the sugar cravings return in the evening. Between 40% and 70% of the risk of obesity is determined by genetics. Inheriting the wrong genes doesn't make obesity inevitable, but it makes it harder to control weight - particularly when unhealthy food is cheap and abundant. How the weight loss drugs work isn't fully understood. They mimic gastric hormones and make people feel fuller for longer. But they also have an effect on the brain. The research shows that people put on weight four times faster after quitting the jabs than coming off a diet. Scientists say that may be because the biological switches that drive obesity are suddenly flicked back on when treatment with such powerful drugs is stopped. Sam West, another of the Oxford researchers, said: \"They're not a silver bullet, they don't fix it long-term. While you take them, they are incredibly effective. But when you stop taking them, the weight regain occurs rapidly.\""
    },
    {
        "title": "Cyber flashing just become a priority offence - here's what changes from today",
        "description": "Cyber flashing became illegal in 2024. Now, the government is making it a priority offence, putting the pressure on tech companies to do something about it.&#160;",
        "url": "https://news.sky.com/story/cyber-flashing-just-become-a-priority-offence-heres-what-changes-from-today-13491697",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-cyberflashing-bumble_7129509.jpg?20260107202454",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-07 19:48:00",
        "Headline": "By making cyber flashing a priority offence, the government is signalling to the regulator and tech firms that it takes this crime particularly seriously.",
        "Content": "\n          Science and technology reporter\n       Cyber flashing became illegal in 2024. Now, the government is making it a priority offence, putting the pressure on tech companies to do something about it.Â  Cyber flashing is when someone sends a non-consensual explicit picture - best known as a \"dick pic\". It's most often women on the receiving end and, according to research by dating app Bumble, the adults most likely to receive those images are women between 40 and 45 years old. That being said, it's an extremely common experience online, with one in three teenage girls saying they've received an unwanted sexual image, according to YouGov data. What changes now? Under the Online Safety Act, which began being fully enforced in July last year, online platforms have to make sure they're not hosting illegal content. If they are, they can be fined 10% of their revenue by Ofcom, the UK's communications regulator, or Â£18m, whichever is higher. By making cyber flashing a priority offence, the government is signalling to the regulator and tech firms that it takes this crime particularly seriously. \"The bar is much higher on what platforms need to do,\" said Kanishka Narayan, the minister for AI and online safety, to Sky News. Platforms like dating and social media apps will now need to do three things: ðŸž— Assess the risk of cyber flashing specificallyðŸž— Proactively take steps to prevent it, rather than reacting after it's happenedðŸž— Build safety features against cyber flashing into the design of their products Can tech firms actually stop cyber flashing? Cyber flashing isn't particularly hard to stop, from a technology point of view. Bumble has been filtering lewd messages since 2019 and open-sourced the technology four years ago. \"We trained it on a lot of data sets of both lewd, non-lewd images and that's how we've been able to achieve a model with about 98% accuracy,\" said Namrata Haribal, product manager for safety at Bumble. Read more technology news:Illegal child abuse material generated by GrokRobots with human-type capabilities are comingPorn users 'still seeing porn with no age checks' Almost all major platforms now have some sort of technology like this in place, designed to spot explicit images and intervene before they're seen by someone who doesn't want to see it. Mr Narayan insists the upgrading of cyber flashing to a priority offence is crucial, though. \"Whilst there's been a drop in cyber flashing as a result of it already being an offence under the Online Safety Act, by making it a priority offence, we want to stamp it out even further,\" he said. \"Because we also heard that despite the drop, there are still too many instances of women and girls in particular experiencing this.\" Will cyber flashing becoming a priority offence make a difference? The minister says yes, but Professor Clare McGlynn, professor of law at Durham University, isn't so sure. She's been campaigning for better cyber flashing rules for years. \"This is a very welcome first step,\" said Prof McGlynn to Sky News. \"But the most significant aspect is, Is it going to be enforced? That comes down to the regulator Ofcom.\" Rape pornography and non-consensual intimate imagery are also both priority offences, and yet both types of image abuse can still be found online, says Prof McGlynn. \"That's because the Online Safety Act and Ofcom have just not enforced it properly.\""
    },
    {
        "title": "New app will allow pupils to view GCSE results digitally from summer 2026",
        "description": "Year 11 pupils in England will soon be able to access their GCSE results on their phones, under government plans to modernise how exam records are stored and shared.",
        "url": "https://news.sky.com/story/new-app-will-allow-pupils-to-view-gcse-results-digitally-from-summer-2026-13491659",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pupils-phone_7129375.jpg?20260107181913",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2026-01-07 17:57:00",
        "Headline": "The government says the app, the Education Record, will reduce reliance on paper certificates, which can be lost or damaged. ",
        "Content": "\n          Education reporter\n       Year 11 pupils in England will soon be able to access their GCSE results on their phones, under government plans to modernise how exam records are stored and shared. The Department for Education has announced the national rollout of a new app, the Education Record, which allows students to view their GCSE results digitally from summer 2026. This will make it easier for young people to enrol in further education or prove their qualifications to future employers. Under the plans, pupils will still attend school on results day to receive their grades in person from 9am. Results will then appear on the app later the same morning, from 11am. The government says the app will reduce reliance on paper certificates, which can be lost or damaged, and will give employers faster access to verified education records. Schools and colleges will also be able to see key information about incoming students, including whether they need to resit English or maths GCSEs, have special educational needs, or are eligible for free school meals. Skills minister Jacqui Smith said the new system would bring exam records \"into the 21st century\". \"This app gives young people instant access to their results whenever they need them, while freeing up teachers and college staff from unnecessary paperwork,\" she said. A good use of money? The Education Record app has already been piloted in parts of Greater Manchester and the West Midlands, where around 4,000 pupils at 29 schools accessed their GCSE results digitally last summer. Earlier technical pilots took place in Coventry and Oldham. Ms Smith told Sky News the app, which has cost Â£5.5m over the past two years, has \"been recognised and welcomed by the students and the schools and colleges\". But Robert Logan, principal at Hathershaw College in Oldham, where the pilot took place, said he would rather have money to repair his school building with \"bricks and mortar\" and \"train teachers to the highest possible standard, so children have the best educational outcomes\". Mr Logan also said he would like to see the SEND (special education needs and disabilities) funding gap addressed. Read more from Sky News:Storm Goretti to hitKevin Keegan diagnosed with cancer The app did pose some issues: students need to possess an appropriate smartphone - if the device is too old, the app cannot be downloaded. Students will also need to have the necessary data capability to download the app, which will also need to be downloaded by the college or sixth form. But Paul Whiteman, general secretary of school leaders' union NAHT, described the expansion as \"a sensible development\", adding that including post-16 qualifications in future could make the system even more useful. Schools and colleges are being encouraged to sign up to the Education Record system ahead of GCSE results day in August 2026. The Department for Education also is committed to increasing its funding for the condition of school and college buildings, investing Â£3bn per year by 2034-35."
    },
    {
        "title": "Tribute paid to teenager who died in crash - after police told family he survived",
        "description": "Tributes have been paid to a teenager who died in a car crash - after police told his family he survived.",
        "url": "https://news.sky.com/story/tribute-paid-to-teenager-who-died-in-crash-after-police-told-family-he-survived-13491749",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-joshua-johnson-south-yorkshire-police_7129597.jpg?20260107210534",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-07 21:04:00",
        "Headline": "Mr Johnson's family said: \"What we have been through and are continuing to go through is unimaginable.\"",
        "Content": "Tributes have been paid to a teenager who died in a car crash - after police told his family he survived. In a statement, Joshua Johnson's family said they had been through an \"unimaginable\" ordeal. The 18-year-old died following a collision in Rotherham on 13 December. South Yorkshire Police (SYP) initially identified the victim as 17-year-old Trevor Wynn, alongside a teenage girl who was also killed in the collision on Todwick Road. Mr Johnson, meanwhile, was under sedation in hospital, the force had said. But now SYP has referred itself to the police watchdog after \"information came to light\" which revealed it was actually Mr Johnson who died, and Mr Wynn who remained in hospital. \"That information was, in fact, the patient waking up and saying, 'I'm Trevor',\" Sky News correspondent Emma Birchley explained. Further checks, including forensic testing, confirmed a mistake had been made. In a tribute released via police, Mr Johnson's family said: \"What we have been through and are continuing to go through is unimaginable. \"From the moment we were told about the collision in December, ourselves and many loved ones have spent hours in hospital with who we now know to be Trevor. \"We never wanted him to be alone. Only those we shared this time could understand how this went on for so long.\" Mr Johnson's family said he was \"a loveable, gentle giant\". \"Whilst he was 18 and exploring his independence, he was ever so genuine in his care for others - us, his brother, his grandparents, his extended family, and his many friends,\" they added. \"Neither us nor Josh's brother can imagine life without him, and as we adjust to this new world and only just begin our journey with grief, we ask that our privacy is respected,\" the statement concluded. Assistant Chief Constable Colin McFarlane said the mix-up came as \"a huge shock to everyone, and we recognise the additional trauma this may cause\". He continued: \"We are supporting Trevor and all the families through this and have engaged specialist agencies to help provide that support. \"I have also offered to meet with both sets of parents, as I am sure they will have many questions, most of which we are not able to answer yet, but we are absolutely committed to understanding how this happened so it cannot happen again. \"We have taken the decision to refer ourselves to the Independent Office for Police Conduct (IOPC). \"We will co-operate fully with any subsequent investigation and will be led by the IOPC on the next steps to determine how this happened, and how we can ensure this never happens again in the future.\" An 18-year-old has been arrested on suspicion of causing death by dangerous driving, and a 19-year-old has also been arrested on suspicion of perverting the course of justice. Both remain on bail pending further enquiries."
    },
    {
        "title": "Starmer 'sets out his position on Greenland' in call with Donald Trump",
        "description": "Sir Keir Starmer has set out his position on Greenland in a call with US President Donald Trump, Downing Street says.",
        "url": "https://news.sky.com/story/sir-keir-starmer-set-out-his-position-on-greenland-in-call-with-donald-trump-tonight-no-10-13491833",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7129882.jpg?20260108004851",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-07 22:46:00",
        "Headline": "The prime minister discussed Greenland and the boarding of the sanctioned tanker Bella 1 in a call with the US president, Number 10 said.",
        "Content": "Sir Keir Starmer has set out his position on Greenland in a call with US President Donald Trump, Downing Street says. Mr Trump has been vocal about his desire to annex the territory, despite it being part of Denmark - a NATO ally. A spokesman for the prime minister said the call also included a discussion about the interception of the Bella 1 tanker, sometimes called the Marinera, which involved US and UK military forces. The No 10 spokesperson said: \"The prime minister spoke with President Trump this evening. \"They discussed the joint operation to intercept the Bella 1 as part of shared efforts to crack down on sanctions busting, recent progress on Ukraine and the US operation in Venezuela. \"The prime minister also set out his position on Greenland.\" That position was revealed in a joint statement on Tuesday, when European allies, including the UK, reasserted that \"Greenland belongs to its people. It is for Denmark and Greenland, and them only, to decide on matters concerning Denmark and Greenland\". Fears that the US will act against Greenland have mounted following the arrest of Venezuelan president Nicolas Maduro in an audacious American raid on Caracas. In the aftermath, Mr Trump left the door open to further interventions in the western hemisphere by citing the Monroe Doctrine. The policy, named after former president James Monroe, asserts the right of the US to intervene in foreign affairs across the Americas in its own interest. Mr Trump calls it the Donroe Doctrine, adapting it with his own name. Against this backdrop, the US president has repeatedly raised the spectre of action over Greenland. On Monday, he spoke to Sky's US partner network NBC News about Greenland, saying that \"we need it for national security, right now\". Despite opposition from Mr Trump's NATO allies, a subsequent statement from the White House pushed the envelope further by insisting that \"utilizing the â€ŒUS military is â€always an option\". Danish Prime Minister Mette Frederiksen has warned that any such action against Greenland would spell the end of NATO. ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ Earlier, the UK's defence secretary used a statement to the Commons to explain that no UK personnel took part in the boarding of the Bella 1, but that UK forces supported the operation \"at the request of the US\". John Healey said the oil tanker intercepted by the US was \"falsely flagged\" and that it is a \"sanctioned, stateless vessel\". It was intercepted between Iceland and Scotland as it headed towards Russia on Wednesday."
    },
    {
        "title": "Time for your dog to go vegan? Canine food counts for 1% of UK greenhouse gas emissions, survey shows",
        "description": "Dog food in the UK counts for around 1% of the country's total greenhouse gas emissions, according to the findings of an environmental survey.",
        "url": "https://news.sky.com/story/time-for-your-dog-to-go-vegan-canine-food-counts-for-1-of-uk-greenhouse-gas-emissions-survey-shows-13491567",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dog-carbon_7129254.jpg?20260107164157",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-07 14:33:00",
        "Headline": "Wet, raw and meat-rich products are associated with substantially higher greenhouse gas emissions than dry dog food, the analysis found.",
        "Content": "Dog food in the UK counts for around 1% of the country's total greenhouse gas emissions, according to the findings of an environmental survey. The analysis also reveals striking differences in the climate impact of commercial dog foods, with the highest-impact foods responsible for up to 65 times more emissions than the lowest-rated options. Wet, raw and meat-rich products are associated with substantially higher greenhouse gas emissions than dry dog food, the study found. Scientists from the Universities of Edinburgh and Exeter used ingredient and nutrient labelling information to calculate the carbon footprint of almost 1,000 commercially available dog foods, based on emissions generated during the production of ingredients. Their sample included a selection of dry, wet and raw foods, including plant-based and grain-free options. The findings highlight the need for greater transparency and better labelling of dog food ingredients to help consumers make informed choices, as pet ownership continues to rise, experts say. John Harvey, a researcher at the University of Edinburgh, said there seem to be more foods that are plant-based now available on the market. The research found that plant-based foods were typically lower-impact options, especially in the case of wet foods. Read more from Sky News:Waterstones owner lines up RothschildNew road safety measures 'not enough' But if dog owners use meat products that otherwise would go to waste, they can potentially be lower impact than some plant proteins. Mr Harvey, who has a background as a practicing veterinary surgeon, said some owners are moving towards choosing plant-based options, but it's a small percentage and the push has actually been towards high-meat content. He said there is no evidence to suggest that dogs require really high-meat content. On food labelling, Mr Harvey told Sky News: \"We need to be able to tell whether meat in dog food is potentially of a type that might otherwise be fed to humans, or if it's actually meat - which are things like offcuts, things like liver - that would otherwise potentially be waste product from the human food chain, which has a much lower impact.\" Mr Harvey said dog food labels don't let you know what's in the food, making it difficult to independently look at what the environment impact of that food would be. Clearer labelling is really important, he added."
    },
    {
        "title": "Football legend Kevin Keegan diagnosed with cancer, family says",
        "description": "Football legend Kevin Keegan has been diagnosed with cancer, his family has said.",
        "url": "https://news.sky.com/story/football-legend-kevin-keegan-diagnosed-with-cancer-family-says-13491664",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kevin-keegan-kevinkeegan_7129369.jpg?20260107181117",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-07 17:54:00",
        "Headline": "Keegan is closely associated with the Premier League teams Liverpool and Newcastle, the latter he both played for and managed, twice, and is affectionately known as \"King Kev\" for his footballing exploits.Â ",
        "Content": "Football legend Kevin Keegan has been diagnosed with cancer, his family has said. The former England forward and manager, 74, was recently admitted to hospital due to \"ongoing abdominal symptoms\", a statement said. \"These investigations have revealed a diagnosis of cancer, for which Kevin will undergo treatment,\" it added. \"Kevin is grateful to the medical team for their intervention and ongoing care. \"During this difficult time, the family are requesting privacy, and will be making no further comment.\" Newcastle United wished Keegan \"a full and speedy recovery\" and said: \"King Kev. We're with you every step of the way.\" Liverpool FC also posted on X saying: \"The thoughts and support of everyone at Liverpool FC and Forever Reds are with Kevin Keegan after he was diagnosed with cancer.\" Keegan is closely associated with the Premier League teams Liverpool and Newcastle, the latter he both played for and managed, twice, and is affectionately known as \"King Kev\" for his footballing exploits. Keegan won three First Division titles while a player at Liverpool as well as an FA Cup, two Charity Shields, two UEFA Cups and the European Cup. He also had stints at Southampton, Scunthorpe and for Hamburger SV in Germany. He won 63 England caps, scoring 21 goals, playing at the 1982 World Cup and was also later captain of the national team. Keegan was twice named European Footballer of the Year while at Hamburg and returned to England to play for Southampton and Newcastle before retiring as a player in 1984. He became England manager in 1999, having initially taken on the job following Glenn Hoddle's departure. Having overseen a disappointing Euro 2000 campaign, Keegan resigned on the back of defeat by Germany at Wembley Stadium, the last match at the national stadium before it was rebuilt. His last managerial job was his fairytale return to Newcastle United in 2008 but he quickly fell out with then owner Mike Ashley and eventually won a constructive dismissal lawsuit against the club. Newcastle United went on to be relegated that season."
    },
    {
        "title": "Tracking the sanctioned oil tanker's attempt to escape seizure by the US ",
        "description": "For more than two weeks, Sky News' Data and Forensics team has plotted the movements of the US-sanctioned oil tanker Marinera.",
        "url": "https://news.sky.com/story/tracking-the-sanctioned-oil-tankers-attempt-to-escape-seizure-by-the-us-13491637",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dxf-us_7129282.jpg?20260107170459",
        "type": "World",
        "Author": "Freya Gibson, Annoa Abekah-Mensah, Ben van der Merwe and Lydia Morrish, Data and Forensics",
        "Date Published": "2026-01-07 16:53:00",
        "Headline": "The US-sanctioned Marinera oil tanker undertook multiple efforts to hide its identity before its seizure off the coast of Iceland.",
        "Content": "By Freya Gibson, Annoa Abekah-Mensah, Ben van der Merwe and Lydia Morrish, Data and Forensics  For more than two weeks, Sky News' Data and Forensics team has plotted the movements of the US-sanctioned oil tanker Marinera. The ship undertook multiple efforts to hide its identity before its seizure on 7 January off the coast of Iceland. On Wednesday, 7 January, the US military said it captured the vessel, previously named Bella 1, following a weeks-long pursuit across the Atlantic. The Royal Air Force and Royal Navy provided support for the Marinera's seizure, according to the Ministry of Defence, including the provision of state-of-the-art refuelling ship RFA Tideforce. Flight tracking data showed several US aircraft, including US Air Force special operations, arriving and leaving RAF bases and UK airports in the hours prior to the seizure. Sky News analysis shows the tanker's journey from Iran over nearly two months and its apparent attempts to evade detection. How the Marinera's voyage unfolded Ship-tracking AIS location data from 3 September placed the tanker approximately 9km from the Strait of Hormuz, according to Global Fishing Watch. However, the satellite image below, also taken on 3 September, shows Bella 1 more than 700km away. It was stationed at Kharg Island, Iran's primary oil export facility, where analytics company Kpler says it loaded crude oil. The discrepancy between the AIS data and the satellite imagery suggests the tanker was providing a fake signal to hide its location, a practice known as \"spoofing\". The ship's signal was restored once it had left Iranian waters, and on 13 November it began its journey. The AIS data later shows the tanker at Egypt's Suez South anchorage, where it remained between 23 and 26 November. The Suez region is a major transport route for oil and gas. Oil can be offloaded at the Suez South anchorage, primarily through ship-to-ship transfers or pipeline systems. Sky News cannot confirm whether the Bella 1 offloaded oil here. We can be confident that the tanker was here on these dates because vessels in the area are required to transmit accurate locations. On 3 December, the ship passed through another area with mandatory location reporting, the Strait of Gibraltar, before continuing its journey across the Atlantic. It was last spotted by AIS systems on 17 December in the Caribbean, near Antigua and Barbuda. Reports suggest that the US Coast Guard attempted to board the tanker on the 20 December, stating that the United States had a seizure warrant and that the vessel was not flying a valid national flag. Under international law, vessels are required to be registered under a particular country, and this country is relied upon for protection. The Bella 1 was flying the flag of Guyana, but the US said it had not actually registered with the country. Sky News analysis has found that 40 sanctioned tankers are currently flying the Guyanese flag, despite not one of them being actually registered in Guyana. One day after the US Coast Guard reportedly attempted to board the Bella 1, it was recorded making 39 distress calls between 12.26pm and 17.13pm. These distress calls helped us locate the primary position of the tanker that day, which was just over 500km from the coast of Antigua and Barbuda, shown on the map below. When the ship next appeared, on 1 January, it had travelled more than 3,000 km to the North Atlantic, changed its name to \"Marinera\" and adopted a Russian flag. Sky News analysis found that at least 21 other sanctioned oil tankers have also changed their flags to Russia in the past month. That's more than changed flags during the whole of 2024. Five ships changed to Russian flags in just two days following the first seizure of a Venezuela-linked tanker by the US on 10 December. Of the 22 tankers that have adopted Russian flags in the past month, at least 11 have previously visited both Venezuelan and Russian ports. The seizure of the Marinera  By 7 January, the Marinera was passing between Iceland and Scotland, escorted by a Russian submarine according to reports in the Wall Street Journal. Shipping analytics company Windward said the ship was likely heading for the Russian arctic port of Murmansk. At around 11.26am, the Marinera made a sudden southbound turn. It was later seen at 1.18pm, heading east towards Scotland, according to data shared by TankerTrackers. At 1.43pm, the US European Command announced it had seized the vessel for violations of US sanctions. Speaking to Sky News, Mark Cancian, a senior advisor on defence and security at the Centre for Strategic and International Studies (CSIS), said that the helicopters used to board the Marinera were short-ranged. \"Either they came from the US air base on Keflavik, in which case the Icelandic government had to agree, or from a sea platform like the Special Ops mothership,\" he said. Following the seizure, Russia's transport ministry issued a statement saying that the act had violated maritime law. \"In accordance with the 1982 UN Convention on the Law of the Sea, freedom of navigation applies in waters on the high seas, and no state has the right to use force against vessels duly registered in the jurisdictions of other states,\" the statement read. The transport ministry also confirmed that Russia had granted the tanker a temporary permit to fly its flag. The US also announced that it had seized another tanker, M/T Sophia, shortly after announcing the capture of Marinera. US Southern Command stated that the vessel had been \"conducting illicit activities\" in the Caribbean Sea. The United States has now seized at least four sanctioned tankers linked to Venezuela, following the capture of vessels Skipper and Centuries in December last year. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "What we know about 'ghost fleet' oil tankers seized by US - as Russia responds",
        "description": "America has seized two sanctioned oil tankers linked to Venezuela in back-to-back operations in the North Atlantic and the Caribbean.",
        "url": "https://news.sky.com/story/what-we-know-about-us-seizure-of-russian-flagged-oil-tanker-linked-to-venezuela-13491539",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tanker-russia-venezuele_7129072.jpg?20260107192739",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-07 13:18:00",
        "Headline": "The US has seized two vessels in close succession - one in the North Atlantic and another in the Caribbean - with one Russian politician calling it \"outright piracy\".",
        "Content": "America has seized two sanctioned oil tankers linked to Venezuela in back-to-back operations in the North Atlantic and the Caribbean. US forces boarded the Marinera - originally known as the Bella 1 - between Iceland and Scotland as it headed towards Russia on Wednesday. Two US officials told Reuters a Russian submarine and warship had been close by. Pete Hegseth, the US defence secretary, posted on X: \"The blockade of sanctioned and illicit Venezuelan oil remains in FULL EFFECT - anywhere in the world.\" Live updates on tanker seizures and Trump's Greenland threat Why was it seized? The US had been pursuing the Marinera for two weeks since it slipped through a \"blockade\" around Venezuela. It was sanctioned in 2024 for allegedly smuggling cargo for a company linked to Lebanese militant group Hezbollah. The US Coast Guard tried to intercept it last month but it refused to be boarded. The ship was sailing under a Guyana flag when it left the Caribbean but re-registered under a Russian flag. UK Defence Secretary John Healey said it had a \"nefarious history\" and was \"part of a Russian-Iranian axis of sanctions evasion which is fuelling terrorism, conflict, and misery from the Middle East to Ukraine\". Both seized ships are part of a \"ghost fleet\" carrying oil from Russia, Iran and Venezuela against Western sanctions - mostly to customers in Asia - according to US homeland security security Kristi Noem. Was the UK involved? Britain provided \"enabling support\", including the use of bases, to US forces intercepting the Russian-flagged tanker. \"RFA Tideforce [often used as a refuelling vessel] provided support for US forces pursuing and interdicting the Bella 1, while the RAF provided surveillance support from the air,\" said the Ministry of Defence. Mr Healey said UK forces had shown \"skill and professionalism in support of a successful US interception\" and called it \"part of global efforts to crack down on sanctions busting\". What has Russia said?  Russia's transport ministry confirmed the tanker was boarded at 3pm Moscow time - and called the US raid illegal as the ship was not in any country's territorial waters. In a statement, it said \"freedom of navigation applies in waters on the high seas, and no state has the right to use force against vessels duly registered in the jurisdictions of other states\". A senior politician from President Putin's party, Andrei Klishas, called the seizure an act of \"outright piracy\", according to Russian state news agency TASS. TASS said the foreign ministry had demanded Russian citizens on board are allowed to return home and have their rights respected. Seizure follows capture of Venezuela's president The Bella 1/ Marinera is the latest tanker to be targeted as part of President Trump's campaign to pressure Venezuela. It also comes days after US special forces captured the country's president, Nicolas Maduro, in Caracas and took him to the United States. He's been accused of being involved in a drug smuggling operation to the US - which he denies. Mr Maduro's deputy has been sworn in, but Mr Trump has said America will \"take control\" of Venezuela for the time-being and is open about wanting to profit from its vast oil reserves. Following the ships' seizure, the US said it was selectively rolling back sanctions on oil blockaded in Venezuela so it can be shipped and sold worldwide. Proceeds will be distributed to the US and Venezuela at the \"discretion\" of President Trump's government. What other tanker was seized? The US also intercepted another Venezuela-linked tanker, M Sophia, near the northeast coast of South America in a pre-dawn raid on Wednesday. Dramatic footage shows special forces boarding the vessel from a helicopter and taking control. The Panama-flagged ship is also under sanctions and departed Venezuela in the last few days - with its tracking transponder off - as part of a fleet carrying oil to China. White House press secretary Karoline Leavitt said It was operating \"illicitly\" and the US Coast Guard was now escorting it to America."
    },
    {
        "title": "US aims to control Venezuela oil sales 'indefinitely'",
        "description": "The White House has said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation.",
        "url": "https://news.sky.com/story/trump-announces-high-quality-oil-deal-with-venezuela-13491348",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-us_7128529.jpg?20260107011906",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-07 01:08:00",
        "Headline": "Venezuela is sitting on the world's biggest reserves of heavy oil, ahead of the likes of Canada and Russia, and the US president wants to take advantage.",
        "Content": "The White House has said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation. Mr Trump first announced on Tuesday night that Venezuela's interim government would be \"turning over\" between 30 and 50 million barrels of \"high quality\" oil to the US. The oil - worth upwards of $2bn (Â£1.48bn) - will be taken from storage by ships and brought directly to US unloading docks, the president said on Truth Social. It will be sold at its market price and the money generated from the sales will be controlled by Mr Trump himself, his statement added. Catch on latest updates on Venezuela and Greenland Energy secretary Chris Wright, who has been asked to execute the plan, later told an industry conference in Florida on Wednesday: \"We need to have that leverage and that control of those oil sales to drive the changes that simply must â€‹happen in Venezuela.\" Mr Trump has been open about his plans for Venezuela's oil reserves since the capture and arrest of president Nicolas Maduro in an audacious American raid on Caracas. He has suggested US oil companies could be up and running in the country within 18 months, and threatened Venezuela's interim regime with more miliary intervention if it doesn't cooperate. Part of its plan involves \"selectively\" easing US sanctions governing Venezuelan oil flows. It was also confirmed that US authorities had boarded the empty Russian-flagged Marinera tanker, formerly known earlier in its voyage as the Ghanian-registered Bella 1, in the north Atlantic, citing \"sanctions violations\". A second, apparently China-bound, \"dark fleet\" tanker called the Sophia was later apprehended in the Caribbean Sea for the same reason. The seizures seem set to inflame tensions with Russia and China over US control of Venezuelan oil. The White House confirmed that the president would meet US oil company executives, to discuss opportunities for investment in Venezuela, on Friday. There is currently only one US multinational oil company in Venezuela - Chevron. Another two, Exxon Mobil and ConocoPhillips, left after Maduro's predecessor, Hugo Chavez, nationalised the oil industry, rendering them superfluous. Venezuela is sitting on the world's biggest reserves of heavy oil, ahead of the likes of Canada and Russia. Last month, the US blocked oil tankers from leaving the country and seized several tankers in international waters as part of efforts to enforce its sanctions on Venezuela's oil industry. Reports have claimed that bosses from US oil companies are expected to visit the White House as early as Thursday to discuss investments in Venezuela. Read more from Sky News:More heavy snow to hit UKBritish troops in Ukraine if peace deal struck Mr Trump's announcement came after he boasted about the US military operation in Venezuela during a speech in Washington, describing it as \"an amazing military feat\". A Pentagon official said at least seven US service members were injured during the operation, while Venezuela's military said at least 24 of its military officers were killed. Venezuela's acting president Delcy Rodriguez, who was only sworn in on Monday, said in a televised address that there was \"no external agent\" governing the country. Mr Trump's administration is not only being open about its plans for Venezuela, but also its ambitions for Greenland. The White House has suggested it would be open to using military force to seize the mineral-rich Arctic territory from NATO ally Denmark."
    },
    {
        "title": "Coming to Greenland makes you realise how preposterous Trump's claims to territory are",
        "description": "It takes coming to Greenland to realise quite how preposterous Donald Trump's claims to the place are.",
        "url": "https://news.sky.com/story/coming-to-greenland-makes-you-realise-how-preposterous-trumps-claims-to-territory-are-13491743",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-nuuk_7129862.jpg?20260107234340",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-07 21:06:00",
        "Headline": "Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n It takes coming to Greenland to realise quite how preposterous Donald Trump's claims to the place are. There are his comments that its waters are infested with Russian and Chinese ships, for instance. \"This is crazy nonsense,\" one member of Greenland's ruling coalition told us. MP Nivi Rosing says Greenlanders are taking Trump seriously though. \"I'm personally afraid that he has to have a reason to take over our country by saying, oh, they have Russian and Chinese ships in their waters, which we don't have,\" she says. For the record, there is no evidence of an armada of hostile enemy vessels marauding the waters of Greenland nor has the Trump administration offered any. There are those who say that this is all Trumpian bluster. Don't take him literally. Greenlanders cannot afford to be so nonchalant. Ex-ambassador to the US, Peter Mandelson, expresses such sentiments in The Spectator. He says: \"The future of Greenland is being misunderstood. Trump is not going to 'invade' it. He doesn't need to. He's already there. What will happen is that the threats to Arctic security posed by China and Russia will crystallise in European minds.\" The threat to take it over, he implies, is a ruse to knock Western heads together to accept a \"considerably beefed-up role and status and military deployment by America\". Try telling that to Greenlanders facing repeated threats from a predatory US president. If it is just a device to improve Arctic security, they would say, Trump is sure going a strange way about it. Under a 1951 treaty with Denmark, the US could reopen all the bases it had here in the Second World War and more. It does not take an invasion, annexation or the hyperbolic threat of one to do so. Read more from Sky News:How oil tankers tried to avoid seizure by USUS aims to control Venezuela oil sales 'indefinitely' For the people of Greenland and their political masters in Denmark, Mandelson might look a little naive. They fear this is more about Trump's baser instincts, his need for glory, to be the first US president in decades to acquire territory and expand America's borders. And they are upset and angry with him. ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ Klaus Iversen served in the Danish military in Greenland and knows the sacrifices Danes have made more than many for America's security. To be told Denmark is not pulling its weight is deeply offensive to veterans like him. He says: \"I feel offended, I feel sad. I have colleagues who died in Afghanistan and Iraq supporting the Americans down there, so of course we find that extremely strange and saddening.\" There is a long-running resentment of Danish rule among many here. Accusations it has taken Greenland's mineral wealth and not paid back enough. Claims it has not invested enough in critical infrastructure, from roads to welfare. But they value everything their connection with Europe brings them here - the free education, the free health service, the cultural ties, the $500m (Â£370m) in annual financial aid. Polls and last year's election suggest there is no appetite for exchanging that for an uncertain future with the US. Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first."
    },
    {
        "title": "Funeral held for French movie and style icon Brigitte Bardot",
        "description": "Brigitte Bardot's funeral has been held with a private service in Saint-Tropez.",
        "url": "https://news.sky.com/story/funeral-held-for-french-movie-and-style-icon-brigitte-bardot-13491465",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brigitte-bardot-funeral_7128802.jpg?20260107102836",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-07 10:48:00",
        "Headline": "The French film legend died on 28 December at the age of 91 at her home in Saint-Tropez in southern France.",
        "Content": "Brigitte Bardot's funeral has been held with a private service in Saint-Tropez. The French movie and style icon died on 28 December at the age of 91 at her home in the French Riviera resort, where she lived for more than half a century. Her husband, Bernard d'Ormale, revealed in an interview with Paris Match magazine that she had died from cancer after undergoing two operations. Crowds gathered along the streets and applauded as the late film star's coffin arrived at the Notre-Dame-de-l'Assomption Catholic Church. People again applauded as the coffin was driven through the streets after the funeral. The service was attended by family and guests, which included French far-right leader Marine Le Pen, who was pictured arriving at the church. Guests also included people invited to the funeral by the Brigitte Bardot Foundation for the protection of animals. In a speech at the service, Max Guazzini, a friend and secretary general of the foundation, said: \"All the animals she saved and she loved form a procession behind herâ€¦ thousands of animals say: Brigitte, we will miss you, we love you so much, thank you.\" In his interview released on Tuesday evening, Bardot's husband said the film legend had been \"conscious and concerned about the fate of animals until the very end\". Hundreds of people gathered in the coastal town to follow the farewell on large screens set up at the port and on two plazas. After the church service, Bardot was buried \"in the strictest privacy\" at a cemetery overlooking the Mediterranean Sea, according to the Saint-Tropez town hall. A public homage was also held at a nearby site in Saint-Tropez. Bardot's renowned sex symbol status was set in stone in 1956 with her portrayal of a rebellious teenager in And God Created Woman. Directed by her then-husband Roger Vadim and in line with the sexual liberation of the age, the movie featured Bardot dancing naked on tables, captivating audiences and scandalising censors in equal measure. Read more from Sky News:Timothee Chalamet among winners at Critics Choice AwardsHollywood star says he isn't behind $100k fundraiser She became a global icon and starred in more than 40 films. But she turned away from public life in 1973, aged 39, and gave her attention to animal rights, calling it her \"only battle\"."
    },
    {
        "title": "Man jailed for supplying thousands of small boats and engines to Channel people smugglers",
        "description": "A Turkish national has been jailed for 11 years after being found guilty of supplying thousands of small boats and engines used by people smugglers to transport asylum seekers across the English Channel.",
        "url": "https://news.sky.com/story/man-jailed-for-supplying-hundreds-of-small-boats-and-engines-to-channel-people-smugglers-13491372",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-adem-savas-people-smuggling_7128681.jpg?20260107090849",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-07 09:09:00",
        "Headline": "Adem Savas was accused of supplying engines and boats to people smugglers, shipping the boats from Turkey and storing them in Germany until they were transported to northern France.",
        "Content": "A Turkish national has been jailed for 11 years after being found guilty of supplying thousands of small boats and engines used by people smugglers to transport asylum seekers across the English Channel. Adem Savas was also fined â‚¬400,000 (Â£346,000). The 45-year-old was arrested after arriving at Schiphol airport in Amsterdam in November 2024 and stood trial in Bruges, Belgium, for alleged involvement in people smuggling operations. He was accused of supplying engines and boats to people smugglers, shipping the boats from Turkey and storing them in Germany until they were transported to northern France. Savas was initially identified by the UK's National Crime Agency (NCA) after an investigation into Kurdish crime boss Hewa Rahimpur. Rahimpur headed a major Europe-wide smuggling ring thought to be behind the movement of more than 10,000 migrants in small boat crossings to the UK. He was arrested in 2022 near Ilford in east London and extradited to Belgium, where he was jailed for 11 years in October 2023, a sentence later increased to 13 years on appeal. Europe correspondent Adem SavasÂ was at the centre of an international smuggling network that started in the Middle East, ran through Turkey, Germany, the Netherlands, Belgium, France and finally the UK. It is a sophisticated operation, and it doesn't simply start on the northern French coast. Over the years, I have spent a lot of time in northern Iraq meeting families of those who died trying to cross the Channel, other families determined to make the journey regardless of the risk, and the smugglers who help them on their way. I've seen them liaise with contacts across Europe, taking and passing on vast sums of money and often caring little for the human lives they're controlling. Savas's conviction and imprisonment represent a major success for the police in Britain and their European counterparts, but he has already been replaced: last year more than 41,000 migrants crossed the Channel to the UK, the second-highest number on record. As long as there is money to be made, and big money at that, there will be a smuggling industry. Analysis of phones and devices seized during his arrest revealed Savas was his key supplier of boats and engines, and investigators believe he supplied equipment used in half of all Channel crossings in 2023. \n                  Power to seize phones from small boat migrants comes into force\n                 \n                  Migrant crossing figures for 2025 'politically toxic' for PM\n                 \n                  Migrant small boat Channel crossings in 2025 are second highest ever\n                 The NCA said Savas was the main importer of cheap outboard engines sourced from China, the type most frequently used by people smuggling gangs in the Channel. The agency said Savas was thought to have supplied equipment used in thousands of small boat crossings to the UK between 2019 and 2024. Charging around Â£4,000 on average for packages of boats and engines, he is thought to have made millions. Criminals shared Sky News report on fatal Channel crossing After 27 migrants died when their boat sank in the Channel in November 2021, Rahimpur sent Savas images of a white rubber boat and a screenshot of a Sky News article showing how an identical boat had been used in the fatal crossing. Equipment supplied by Savas 'likely involved in numerous fatal events' NCA director general of operations Rob Jones said: \"Adem Savas was without doubt the most significant supplier of boats and engines to people smuggling gangs involved in organising deadly crossings in the Channel, the head of a criminal network stretching across Europe to the beaches of northern France and across into the UK. \"He pretended to run a legitimate maritime supply company, but in reality he knew exactly how the equipment he provided would be used. He also knew exactly how unsuitable it was for long sea crossings. \"Boats and engines supplied by Savas were likely involved in numerous fatal events in the Channel - he made money from each of those.\" Three other defendants were sentenced to 12 and 13 years in prison in absentia, and their arrest has been ordered. They were fined â‚¬600,000 (Â£520,000). Savas also had $100,000 (Â£74,000) in assets seized."
    },
    {
        "title": "Lawyer for Rob Reiner's son withdraws from case",
        "description": "The arraignment of Rob Reiner's son over the killing of his parents has been delayed after his high-profile defence lawyer withdrew from the case.&#160;",
        "url": "https://news.sky.com/story/lawyer-for-rob-reiners-son-withdraws-from-case-13491699",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-actor_7112544.jpg?20251217002123",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-07 19:50:00",
        "Headline": " Nick Reiner's arraignment has been delayed until February after his lawyer, Alan Jackson, withdrew from the case due to \"circumstances beyond our control\". Reiner is now represented by a public defender.",
        "Content": "The arraignment of Rob Reiner's son over the killing of his parents has been delayed after his high-profile defence lawyer withdrew from the case.Â  A judge agreed to Alan Jackson's request to exit the case during a Los Angeles Superior Court hearing on Wednesday, at which Nick Reiner, 32, was expected to be arraigned and enter a plea. The hearing took place roughly three weeks after actor-director Rob Reiner and his wife of 36 years, Michele Singer Reiner, were found dead with stab wounds in their upscale home in Los Angeles. Mr Jackson said \"circumstances beyond our control' were behind the move, without providing specifics. He said he is \"legally and ethically prohibited from explaining all the reasons\" behind his decision, adding he expects Reiner's public defender to \"step in and very capably protect Nick Reiner's interests\". \"We know the legal process will reveal the true facts of the circumstances surrounding this case,\" Mr Jackson said. Deputy public defender Kimberly Greene has now taken over as Nick Reiner's lawyer, and the judge has delayed the arraignment until 23 February. \n                  Trump latest: UK involved in US seizure of oil tanker in North Atlantic - as Russia sends warning\n                 \n                  Tracking the sanctioned oil tanker's attempt to escape seizure by the US \n                 \n                  What we know about 'ghost fleet' oil tankers seized by US - as Russia responds\n                 Ms Greene said she spoke to Reiner briefly on Wednesday morning to alert him of the change in his counsel. She said Reiner was \"understanding\" of the situation. During a brief court appearance, Reiner spoke only to agree to the delay. He stood behind glass in a custody area of the courtroom, wearing a brown jail suit with his hair shaved. At one point, Reiner stood on his tiptoes to peek over the lawyers' heads and look at the audience. Read more from Sky News:Football legend Kevin Keegan diagnosed with cancerStorm Goretti to hit with more heavy snow Nathan Hochman, district attorney for Los Angeles County, said his office will ensure Reiner's new lawyer receives \"all the facts necessary to effectively represent their client\". \"I'm fully confident that a jury will convict Nick Reiner beyond reasonable doubt of the brutal murder of his parents... and do so unanimously.\" Mr Hochman said the charges against Reiner carry a maximum sentence of the death penalty. Execution is a legal punishment in several US states, including California, where Nick Reiner was arrested and will be tried. The Reiner family released a statement following the change of legal representation. A spokesperson said: \"They have the utmost trust in the legal process and will not comment further on matters related to the legal proceedings.\" Rob Reiner, 78, and wife Michele Singer Reiner, 70, were killed early on the morning of 14 December in their home in the upscale Brentwood section of Los Angeles. Authorities said they were found in the late afternoon and died from \"multiple sharp force injuries\". Before picking up the Reiner case, Alan Jackson had represented high-profile clients, including convicted sex offender Harvey Weinstein during his 2022 trial. Mr Jackson also defended Kevin Spacey in a 2019 sexual assault case, in which the actor faced allegations of groping an 18-year-old man. The charges were subsequently dropped by prosecutors."
    },
    {
        "title": "ICE shooting: This could be a moment of reckoning for America - and battle lines are being drawn",
        "description": "It was over in a second - three shots fired - but this fatal ICE shooting will have lengthy repercussions.",
        "url": "https://news.sky.com/story/minneapolis-becomes-flashpoint-once-again-as-battle-lines-are-drawn-after-ice-shots-fired-13491845",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-vehicle-minneapolis_7129313.jpg?20260107172411",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2026-01-07 23:10:00",
        "Headline": "An ICE agent shot and killed a woman in Minneapolis after she allegedly attempted to run over an officer, a claim that has been challenged by the city's mayor. ",
        "Content": "\n          US correspondent\n              @skydavidblevins\n It was over in a second - three shots fired - but this fatal ICE shooting will have lengthy repercussions. Minneapolis becomes a flashpoint, exposing deep fractures over immigration and how it's being enforced. Minneapolis shooting as it happened A woman has been shot dead by an Immigration and Customs Enforcement agent in Minneapolis. Tensions have been high in the city due to the deployment of ICE officers for a crackdown tied in part to allegations of fraud involving Somali residents. Department of Homeland Security spokeswoman Tricia McLaughlin claimed the deceased was shot when she attempted to \"weaponise\" her vehicle and run over an officer. Trump has backed that version of events in a social media post. Minneapolis mayor Jacob Frey has called the claims \"bullshit\" and criticised ICE, while Kamala Harris has accused Trump of \"gaslighting\". Read our full report here. Protestors were already on the streets, resisting the large-scale deployment of ICE agents in Minnesota. Now, the battle lines are being drawn by both sides. President Donald Trump is claiming the immigration officer acted in self-defence. \"Don't believe the propaganda,\" Governor Tim Walz posted. \"I've seen the video,\" he added. Trump's 2024 election rival, Kamala Harris, accused the president of \"gaslighting\". There are several videos in circulation, each side using them to support its account of what happened. Several eyewitnesses are strenuously denying the Trump administration's version of events. Tension had been building for weeks, with 2,000 agents deployed to Minnesota in December. The Twin Cities have seen the largest immigration enforcement operation in any US city. ICE is the federal US Immigration and Customs Enforcement agency responsible for homeland security investigations and removal operations against people the US decides are in the country illegally. Its operations have ramped up significantly as part of the Trump administration's immigration crackdown. Sky News has previously witnessed people being taken off the streets by officers and bundled into vehicles, including in Washington DC. The mayor, Jacob Frey, isn't mincing his words, telling ICE to \"get the f*** out\". But it's not the first time Mr Frey has led his city through a controversy of this nature. He rose to prominence following the murder of George Floyd in 2020. So, he knows how tragedies like this can become moments of reckoning that sweep America."
    },
    {
        "title": "Coming to Greenland makes you realise how preposterous Trump's claims to territory are",
        "description": "It takes coming to Greenland to realise quite how preposterous Donald Trump's claims to the place are.",
        "url": "https://news.sky.com/story/coming-to-greenland-makes-you-realise-how-preposterous-trumps-claims-to-territory-are-13491743",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-nuuk_7129862.jpg?20260107234340",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-07 21:06:00",
        "Headline": "Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n It takes coming to Greenland to realise quite how preposterous Donald Trump's claims to the place are. There are his comments that its waters are infested with Russian and Chinese ships, for instance. \"This is crazy nonsense,\" one member of Greenland's ruling coalition told us. MP Nivi Rosing says Greenlanders are taking Trump seriously though. \"I'm personally afraid that he has to have a reason to take over our country by saying, oh, they have Russian and Chinese ships in their waters, which we don't have,\" she says. For the record, there is no evidence of an armada of hostile enemy vessels marauding the waters of Greenland nor has the Trump administration offered any. There are those who say that this is all Trumpian bluster. Don't take him literally. Greenlanders cannot afford to be so nonchalant. Ex-ambassador to the US, Peter Mandelson, expresses such sentiments in The Spectator. He says: \"The future of Greenland is being misunderstood. Trump is not going to 'invade' it. He doesn't need to. He's already there. What will happen is that the threats to Arctic security posed by China and Russia will crystallise in European minds.\" The threat to take it over, he implies, is a ruse to knock Western heads together to accept a \"considerably beefed-up role and status and military deployment by America\". Try telling that to Greenlanders facing repeated threats from a predatory US president. If it is just a device to improve Arctic security, they would say, Trump is sure going a strange way about it. Under a 1951 treaty with Denmark, the US could reopen all the bases it had here in the Second World War and more. It does not take an invasion, annexation or the hyperbolic threat of one to do so. Read more from Sky News:How oil tankers tried to avoid seizure by USUS aims to control Venezuela oil sales 'indefinitely' For the people of Greenland and their political masters in Denmark, Mandelson might look a little naive. They fear this is more about Trump's baser instincts, his need for glory, to be the first US president in decades to acquire territory and expand America's borders. And they are upset and angry with him. ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ Klaus Iversen served in the Danish military in Greenland and knows the sacrifices Danes have made more than many for America's security. To be told Denmark is not pulling its weight is deeply offensive to veterans like him. He says: \"I feel offended, I feel sad. I have colleagues who died in Afghanistan and Iraq supporting the Americans down there, so of course we find that extremely strange and saddening.\" There is a long-running resentment of Danish rule among many here. Accusations it has taken Greenland's mineral wealth and not paid back enough. Claims it has not invested enough in critical infrastructure, from roads to welfare. But they value everything their connection with Europe brings them here - the free education, the free health service, the cultural ties, the $500m (Â£370m) in annual financial aid. Polls and last year's election suggest there is no appetite for exchanging that for an uncertain future with the US. Trump officials say they are confident the US will acquire Greenland one way or another by the end of his term in office. They should perhaps have tried talking to its people first."
    },
    {
        "title": "What we know about 'ghost fleet' oil tankers seized by US - as Russia responds",
        "description": "America has seized two sanctioned oil tankers linked to Venezuela in back-to-back operations in the North Atlantic and the Caribbean.",
        "url": "https://news.sky.com/story/what-we-know-about-us-seizure-of-russian-flagged-oil-tanker-linked-to-venezuela-13491539",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tanker-russia-venezuele_7129072.jpg?20260107192739",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-07 13:18:00",
        "Headline": "The US has seized two vessels in close succession - one in the North Atlantic and another in the Caribbean - with one Russian politician calling it \"outright piracy\".",
        "Content": "America has seized two sanctioned oil tankers linked to Venezuela in back-to-back operations in the North Atlantic and the Caribbean. US forces boarded the Marinera - originally known as the Bella 1 - between Iceland and Scotland as it headed towards Russia on Wednesday. Two US officials told Reuters a Russian submarine and warship had been close by. Pete Hegseth, the US defence secretary, posted on X: \"The blockade of sanctioned and illicit Venezuelan oil remains in FULL EFFECT - anywhere in the world.\" Live updates on tanker seizures and Trump's Greenland threat Why was it seized? The US had been pursuing the Marinera for two weeks since it slipped through a \"blockade\" around Venezuela. It was sanctioned in 2024 for allegedly smuggling cargo for a company linked to Lebanese militant group Hezbollah. The US Coast Guard tried to intercept it last month but it refused to be boarded. The ship was sailing under a Guyana flag when it left the Caribbean but re-registered under a Russian flag. UK Defence Secretary John Healey said it had a \"nefarious history\" and was \"part of a Russian-Iranian axis of sanctions evasion which is fuelling terrorism, conflict, and misery from the Middle East to Ukraine\". Both seized ships are part of a \"ghost fleet\" carrying oil from Russia, Iran and Venezuela against Western sanctions - mostly to customers in Asia - according to US homeland security security Kristi Noem. Was the UK involved? Britain provided \"enabling support\", including the use of bases, to US forces intercepting the Russian-flagged tanker. \"RFA Tideforce [often used as a refuelling vessel] provided support for US forces pursuing and interdicting the Bella 1, while the RAF provided surveillance support from the air,\" said the Ministry of Defence. Mr Healey said UK forces had shown \"skill and professionalism in support of a successful US interception\" and called it \"part of global efforts to crack down on sanctions busting\". What has Russia said?  Russia's transport ministry confirmed the tanker was boarded at 3pm Moscow time - and called the US raid illegal as the ship was not in any country's territorial waters. In a statement, it said \"freedom of navigation applies in waters on the high seas, and no state has the right to use force against vessels duly registered in the jurisdictions of other states\". A senior politician from President Putin's party, Andrei Klishas, called the seizure an act of \"outright piracy\", according to Russian state news agency TASS. TASS said the foreign ministry had demanded Russian citizens on board are allowed to return home and have their rights respected. Seizure follows capture of Venezuela's president The Bella 1/ Marinera is the latest tanker to be targeted as part of President Trump's campaign to pressure Venezuela. It also comes days after US special forces captured the country's president, Nicolas Maduro, in Caracas and took him to the United States. He's been accused of being involved in a drug smuggling operation to the US - which he denies. Mr Maduro's deputy has been sworn in, but Mr Trump has said America will \"take control\" of Venezuela for the time-being and is open about wanting to profit from its vast oil reserves. Following the ships' seizure, the US said it was selectively rolling back sanctions on oil blockaded in Venezuela so it can be shipped and sold worldwide. Proceeds will be distributed to the US and Venezuela at the \"discretion\" of President Trump's government. What other tanker was seized? The US also intercepted another Venezuela-linked tanker, M Sophia, near the northeast coast of South America in a pre-dawn raid on Wednesday. Dramatic footage shows special forces boarding the vessel from a helicopter and taking control. The Panama-flagged ship is also under sanctions and departed Venezuela in the last few days - with its tracking transponder off - as part of a fleet carrying oil to China. White House press secretary Karoline Leavitt said It was operating \"illicitly\" and the US Coast Guard was now escorting it to America."
    },
    {
        "title": "Mayor swears and tells ICE to 'get out' after woman shot dead by immigration agent in Minneapolis",
        "description": "A woman has been shot dead by an Immigration and Customs Enforcement (ICE) agent in Minneapolis.",
        "url": "https://news.sky.com/story/woman-dies-after-being-shot-by-us-immigration-enforcement-officer-during-targeted-operation-in-minneapolis-13491663",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minneapolis-ice_7129250.jpg?20260107164112",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-07 17:54:00",
        "Headline": "An ICE agent shot and killed a woman in Minneapolis after she allegedly attempted to run over an officer, a claim that has been challenged by the city's mayor. ",
        "Content": "A woman has been shot dead by an Immigration and Customs Enforcement (ICE) agent in Minneapolis. The city council identified the dead woman as Renee Nicole Good, who was \"out caring for her neighboursthis morning and her life was taken today at the hands of the federal government.\" Minneapolis shooting as it happened Tensions have been high in the city in recent days, due to the deployment of ICE officers to the streets. Department of Homeland Security (DHS) spokeswoman Tricia McLaughlin claimed the deceased was shot when she sought to \"weaponise\" her vehicle and allegedly attempted to run over an officer. However, in a news conference, Minneapolis mayor Jacob Frey called those claims \"bullshit\" and criticised ICE for its operations, telling officers to \"get the f*** out\" of the US city. \"They are already trying to spin this as an action of self-defence. Having seen the video myself, I want to tell everybody directly, that is bullshit,\" he said. Secretary of homeland security, Kristi Noem, is already insisting ICE operations will continue in Minneapolis, while the FBI has launched an investigation. What is ICE? ICE is the federal US Immigration and Customs Enforcement agency responsible for homeland security investigations and removal operations against people the US decides are in the country illegally. Its operations have ramped up significantly as part of the Trump administration's immigration crackdown. Sky News has witnessed people being taken off the streets by officers and bundled into vehicles. What does the video of Minneapolis shooting show? Video of the shooting shared on social media by witnesses shows officers approaching an SUV stopped across the middle of the road, and demanding the driver open the door and grabbing the handle. The vehicle moves forward and a different ICE officer standing near the vehicle, on the driver's side, pulls his gun and fires two shots into the SUV at close range, jumping back as the car moves toward him. The SUV then hit two parked cars before crashing to a stop. Writing on Truth Social, President Donald Trump said the woman driving the car was \"very disorderly, obstructing and resisting\" and she then \"violently, willfully, and viciously ran over the ICE Officer who seems to have shot her in self defense\". He said the ICE officer is \"now recovering in hospital\" and blamed the incident on the 'Radical Left' for 'threatening, assaulting, and targeting our Law Enforcement Officers\". Former vice president Kamala Harris, who lost to Mr Trump in the 2024 election, accused him of \"pure gaslighting\". \"A full and fair investigation at the state level is absolutely necessary,\" she said on X. US correspondent It was over in a second - three shots fired - but the fatal ICE shooting will have lengthy repercussions. Minneapolis becomes a flashpoint, exposing deep fractures over immigration and how itâ€™s being enforced. Protestors were already on the streets, resisting the large-scale deployment of ICE agents in Minnesota. Now, the battle lines are being drawn by both sides. President Trump is claiming the immigration officer acted in self-defence. \"Donâ€™t believe the propaganda,\" Governor Tim Walz posted, \"Iâ€™ve seen the video,\" he added. There are several videos in circulation, each side using them to support its account of what happened. Several eyewitnesses are strenuously denying the Trump administrationâ€™s version of events. Tension had been building for weeks, with 2,000 agents deployed to Minnesota in December. The Twin Cities have seen the largest immigration enforcement operation in any US city. The Mayor, Jacob Frey, isnâ€™t mincing his words, telling ICE to \"Get the f*** out.\" But itâ€™s not the first time heâ€™s led his city through a controversy of this nature. He rose to prominence following the murder of George Floyd in 2020. So he knows how tragedies like this can become moments of reckoning that sweep America. ICE officer 'feared for his life' The DHS earlier said it had launched what it called the largest immigration enforcement operation ever carried out by the agency in Minnesota, with 2,000 federal agents and officers expected in the Minneapolis area for a crackdown tied in part to allegations of fraud involving Somali residents. Ms McLaughlin said: \"Today, ICE officers in Minneapolis were conducting targeted operations when rioters began blocking ICE officers and one of these violent rioters weaponised her vehicle, attempting to run over our law enforcement officers in an attempt to kill them-an act of domestic terrorism. \"An ICE officer, fearing for his life, the lives of his fellow law enforcement and the safety of the public, fired defensive shots. \"He used his training and saved his own life and that of his fellow officers. \"The alleged perpetrator was hit and is deceased.\" Victim 'tried to flee' One eyewitness, Emily Heller, told Sky's partner network in the US, NBC News, that the woman appeared to be trying to flee when she was shot. \"They went up to her car and started trying to open her door, and that's when I'm sure she got spooked and tried to flee,\" the 39-year-old said. \"So she reversed a little bit and then angled her wheels so she could drive away, and as she was trying to move forward, one of the ICE agents stepped in front of her vehicle and reached across the hood and fired his weapon about three or four times and shot her in the face.\" A large group of protesters gathered at the scene of the shooting, where they expressed anger at law enforcement officers. Dozens of people could be seen taking turns to lay flowers inside a circle of lit candles as a vigil formed. Minneapolis police chief Brian O'Hara did not indicate the woman had been attempting to harm anyone, confirming she had been using her vehicle to block the roadway on Portland Avenue. He said the woman had been shot in the head, and there was no indication she was the target of \"any law enforcement investigation or activity.\" \"At some point a federal law enforcement officer approached her on foot and the vehicle began to drive off,\" the chief said. \"At least two shots were fired. The vehicle then crashed on the side of the roadway.\" Ms Noem branded the incident as an \"act of domestic terrorism\". She alleged the woman had \"attempted to run them over and rammed them with her vehicle\". \"An officer of ours acted quickly and defensively, shot, to protect himself and the people around him,\" she said. Mr Frey criticised ICE and accused law enforcement of pushing a \"garbage narrative\" about the shooting. \"They are not here to cause safety in this city. What they are doing is not to provide safety in America,\" he said. \"What they are doing is causing chaos and distrustâ€¦ They're ripping families apart. They're sowing chaos on our streets and in this case quite literally killing people.\" 'Don't believe this propaganda' Minnesota governor Tim Walz, who this week announced he would not be seeking reelection to a third term, wrote on X: \"I've seen the video. Don't believe this propaganda machine. The state will ensure there is a full, fair, and expeditious investigation to ensure accountability and justice.\" But Ms Noem lashed out at both men, claiming that \"by not working with us, Governor Walz and Mayor Frey are putting those criminals and prioritising them over our children and our grandchildren\". The shooting occurred in a residential neighbourhood south of downtown Minneapolis, just a mile (1.6km) from where George Floyd was killed in 2020."
    },
    {
        "title": "Tracking the sanctioned oil tanker's attempt to escape seizure by the US ",
        "description": "For more than two weeks, Sky News' Data and Forensics team has plotted the movements of the US-sanctioned oil tanker Marinera.",
        "url": "https://news.sky.com/story/tracking-the-sanctioned-oil-tankers-attempt-to-escape-seizure-by-the-us-13491637",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dxf-us_7129282.jpg?20260107170459",
        "type": "US",
        "Author": "Freya Gibson, Annoa Abekah-Mensah, Ben van der Merwe and Lydia Morrish, Data and Forensics",
        "Date Published": "2026-01-07 16:53:00",
        "Headline": "The US-sanctioned Marinera oil tanker undertook multiple efforts to hide its identity before its seizure off the coast of Iceland.",
        "Content": "By Freya Gibson, Annoa Abekah-Mensah, Ben van der Merwe and Lydia Morrish, Data and Forensics  For more than two weeks, Sky News' Data and Forensics team has plotted the movements of the US-sanctioned oil tanker Marinera. The ship undertook multiple efforts to hide its identity before its seizure on 7 January off the coast of Iceland. On Wednesday, 7 January, the US military said it captured the vessel, previously named Bella 1, following a weeks-long pursuit across the Atlantic. The Royal Air Force and Royal Navy provided support for the Marinera's seizure, according to the Ministry of Defence, including the provision of state-of-the-art refuelling ship RFA Tideforce. Flight tracking data showed several US aircraft, including US Air Force special operations, arriving and leaving RAF bases and UK airports in the hours prior to the seizure. Sky News analysis shows the tanker's journey from Iran over nearly two months and its apparent attempts to evade detection. How the Marinera's voyage unfolded Ship-tracking AIS location data from 3 September placed the tanker approximately 9km from the Strait of Hormuz, according to Global Fishing Watch. However, the satellite image below, also taken on 3 September, shows Bella 1 more than 700km away. It was stationed at Kharg Island, Iran's primary oil export facility, where analytics company Kpler says it loaded crude oil. The discrepancy between the AIS data and the satellite imagery suggests the tanker was providing a fake signal to hide its location, a practice known as \"spoofing\". The ship's signal was restored once it had left Iranian waters, and on 13 November it began its journey. The AIS data later shows the tanker at Egypt's Suez South anchorage, where it remained between 23 and 26 November. The Suez region is a major transport route for oil and gas. Oil can be offloaded at the Suez South anchorage, primarily through ship-to-ship transfers or pipeline systems. Sky News cannot confirm whether the Bella 1 offloaded oil here. We can be confident that the tanker was here on these dates because vessels in the area are required to transmit accurate locations. On 3 December, the ship passed through another area with mandatory location reporting, the Strait of Gibraltar, before continuing its journey across the Atlantic. It was last spotted by AIS systems on 17 December in the Caribbean, near Antigua and Barbuda. Reports suggest that the US Coast Guard attempted to board the tanker on the 20 December, stating that the United States had a seizure warrant and that the vessel was not flying a valid national flag. Under international law, vessels are required to be registered under a particular country, and this country is relied upon for protection. The Bella 1 was flying the flag of Guyana, but the US said it had not actually registered with the country. Sky News analysis has found that 40 sanctioned tankers are currently flying the Guyanese flag, despite not one of them being actually registered in Guyana. One day after the US Coast Guard reportedly attempted to board the Bella 1, it was recorded making 39 distress calls between 12.26pm and 17.13pm. These distress calls helped us locate the primary position of the tanker that day, which was just over 500km from the coast of Antigua and Barbuda, shown on the map below. When the ship next appeared, on 1 January, it had travelled more than 3,000 km to the North Atlantic, changed its name to \"Marinera\" and adopted a Russian flag. Sky News analysis found that at least 21 other sanctioned oil tankers have also changed their flags to Russia in the past month. That's more than changed flags during the whole of 2024. Five ships changed to Russian flags in just two days following the first seizure of a Venezuela-linked tanker by the US on 10 December. Of the 22 tankers that have adopted Russian flags in the past month, at least 11 have previously visited both Venezuelan and Russian ports. The seizure of the Marinera  By 7 January, the Marinera was passing between Iceland and Scotland, escorted by a Russian submarine according to reports in the Wall Street Journal. Shipping analytics company Windward said the ship was likely heading for the Russian arctic port of Murmansk. At around 11.26am, the Marinera made a sudden southbound turn. It was later seen at 1.18pm, heading east towards Scotland, according to data shared by TankerTrackers. At 1.43pm, the US European Command announced it had seized the vessel for violations of US sanctions. Speaking to Sky News, Mark Cancian, a senior advisor on defence and security at the Centre for Strategic and International Studies (CSIS), said that the helicopters used to board the Marinera were short-ranged. \"Either they came from the US air base on Keflavik, in which case the Icelandic government had to agree, or from a sea platform like the Special Ops mothership,\" he said. Following the seizure, Russia's transport ministry issued a statement saying that the act had violated maritime law. \"In accordance with the 1982 UN Convention on the Law of the Sea, freedom of navigation applies in waters on the high seas, and no state has the right to use force against vessels duly registered in the jurisdictions of other states,\" the statement read. The transport ministry also confirmed that Russia had granted the tanker a temporary permit to fly its flag. The US also announced that it had seized another tanker, M/T Sophia, shortly after announcing the capture of Marinera. US Southern Command stated that the vessel had been \"conducting illicit activities\" in the Caribbean Sea. The United States has now seized at least four sanctioned tankers linked to Venezuela, following the capture of vessels Skipper and Centuries in December last year. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "US aims to control Venezuela oil sales 'indefinitely'",
        "description": "The White House has said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation.",
        "url": "https://news.sky.com/story/trump-announces-high-quality-oil-deal-with-venezuela-13491348",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-us_7128529.jpg?20260107011906",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-07 01:08:00",
        "Headline": "Venezuela is sitting on the world's biggest reserves of heavy oil, ahead of the likes of Canada and Russia, and the US president wants to take advantage.",
        "Content": "The White House has said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation. Mr Trump first announced on Tuesday night that Venezuela's interim government would be \"turning over\" between 30 and 50 million barrels of \"high quality\" oil to the US. The oil - worth upwards of $2bn (Â£1.48bn) - will be taken from storage by ships and brought directly to US unloading docks, the president said on Truth Social. It will be sold at its market price and the money generated from the sales will be controlled by Mr Trump himself, his statement added. Catch on latest updates on Venezuela and Greenland Energy secretary Chris Wright, who has been asked to execute the plan, later told an industry conference in Florida on Wednesday: \"We need to have that leverage and that control of those oil sales to drive the changes that simply must â€‹happen in Venezuela.\" Mr Trump has been open about his plans for Venezuela's oil reserves since the capture and arrest of president Nicolas Maduro in an audacious American raid on Caracas. He has suggested US oil companies could be up and running in the country within 18 months, and threatened Venezuela's interim regime with more miliary intervention if it doesn't cooperate. Part of its plan involves \"selectively\" easing US sanctions governing Venezuelan oil flows. It was also confirmed that US authorities had boarded the empty Russian-flagged Marinera tanker, formerly known earlier in its voyage as the Ghanian-registered Bella 1, in the north Atlantic, citing \"sanctions violations\". A second, apparently China-bound, \"dark fleet\" tanker called the Sophia was later apprehended in the Caribbean Sea for the same reason. The seizures seem set to inflame tensions with Russia and China over US control of Venezuelan oil. The White House confirmed that the president would meet US oil company executives, to discuss opportunities for investment in Venezuela, on Friday. There is currently only one US multinational oil company in Venezuela - Chevron. Another two, Exxon Mobil and ConocoPhillips, left after Maduro's predecessor, Hugo Chavez, nationalised the oil industry, rendering them superfluous. Venezuela is sitting on the world's biggest reserves of heavy oil, ahead of the likes of Canada and Russia. Last month, the US blocked oil tankers from leaving the country and seized several tankers in international waters as part of efforts to enforce its sanctions on Venezuela's oil industry. Reports have claimed that bosses from US oil companies are expected to visit the White House as early as Thursday to discuss investments in Venezuela. Read more from Sky News:More heavy snow to hit UKBritish troops in Ukraine if peace deal struck Mr Trump's announcement came after he boasted about the US military operation in Venezuela during a speech in Washington, describing it as \"an amazing military feat\". A Pentagon official said at least seven US service members were injured during the operation, while Venezuela's military said at least 24 of its military officers were killed. Venezuela's acting president Delcy Rodriguez, who was only sworn in on Monday, said in a televised address that there was \"no external agent\" governing the country. Mr Trump's administration is not only being open about its plans for Venezuela, but also its ambitions for Greenland. The White House has suggested it would be open to using military force to seize the mineral-rich Arctic territory from NATO ally Denmark."
    },
    {
        "title": "'QAnon Shaman' turns against Donald Trump and says he will run for Arizona governor",
        "description": "The 'QAnon Shaman', who became the face of the US Capitol riots, has turned against US President Donald Trump and said he will run for Arizona governor.",
        "url": "https://news.sky.com/story/qanon-shaman-turns-against-donald-trump-and-says-he-will-run-for-arizona-governor-13491408",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-capitol_7128677.jpg?20260107090551",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-07 08:53:00",
        "Headline": "Four years on from supporting Donald Trump in the Capitol riots, the man behind the day's most striking image hits out at the administration.",
        "Content": "The 'QAnon Shaman', who became the face of the US Capitol riots, has turned against US President Donald Trump and said he will run for Arizona governor. Jacob Angeli-Chansley, who prefers to be known as Jake Angeli, was pictured painted in red, white and blue among the rioters who stormed the building on 6 January 2021, wearing a fur headdress with horns. He also carried a spear draped in the American flag and shouted into a bullhorn. Mr Angeli was jailed for 41 months, which was the toughest sentence handed out in around 675 riot prosecutions, with prosecutors describing him as the \"public face of the Capitol riot\". He served 27 months before being released early for good behaviour in 2023 - and he was pardoned by Mr Trump when he took office on 20 January last year, along with others convicted or charged over the riots. Now, Mr Angeli, 38, said he has turned his back on Mr Trump and will run for governor in his home state of Arizona in November. He plans to run as an independent. Mr Angeli told The Times: \"All warfare is based on deception and the American people have had war declared on them.\" He added: \"Since I'm one of the only people that seem to have their wits about them and understand what's actually going on in the world, it is up to me, as far as I'm concerned, to do something about these problems.\" He went on to describe the current Trump administration as \"a corrupt disaster\" - citing its relationship with Israel and behaviour over the Jeffrey Epstein files. On the dramatic removal of Venezuela's leader Nicolas Maduro by US special forces last week, Mr Angeli accused Mr Trump of \"essentially using the American military to commit the armed robbery of a nation\". Read more from Sky News:White House: Greenland military action 'always an option'US troops injured during operation to capture Maduro On the US president's actions since returning to office, he told the newspaper the Trump administration was \"just lies, bro, because they're Israel First\", adding: \"We don't have our own government.\" During his sentencing hearing in 2021, Mr Angeli expressed remorse for his \"indefensible\" actions on 6 January 2021. His lawyer, Albert Watkins, also told a court hearing that Mr Angeli no longer wanted to be known as the \"QAnon Shaman\", according to a report at the time by Sky News' US partner network NBC."
    },
    {
        "title": "CIA turncoat who sold out to Soviet Russia dies in prison aged 84",
        "description": "A CIA turncoat who orchestrated one of the most damaging intelligence breaches in American history by selling secrets to the Soviet Union and Russia has died in prison.",
        "url": "https://news.sky.com/story/cia-turncoat-who-sold-out-to-soviet-russia-dies-in-prison-aged-84-13491351",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-aldrich-ames-cia_7128541.jpg?20260107040755",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-07 03:55:00",
        "Headline": "Aldrich Ames said he had financial troubles, but it all came crashing down when the FBI was tipped off to his unexplained wealth.",
        "Content": "A CIA turncoat who orchestrated one of the most damaging intelligence breaches in American history by selling secrets to the Soviet Union and Russia has died in prison. Aldrich Ames admitted receiving $2.5m (Â£1.85m) from Moscow after betraying Western intelligence assets from 1985 until his arrest in 1994. The identities of 10 Russian officials and one Eastern European who were spying for the US or UK were among his disclosures, and his betrayal has been blamed for the executions of Western agents working behind the Iron Curtain. The 31-year CIA veteran, who also revealed spy satellite operations, eavesdropping, and general spy procedures, later pleaded guilty without a trial to espionage and tax evasion. He was sentenced to life in prison without parole in 1994. His wife, Rosario, pleaded guilty to lesser charges and was sentenced to 63 months in prison. A spokesperson for the Bureau of Prisons confirmed Ames died behind bars in Maryland on Monday. He was 84. Ames said he felt \"profound shame and guilt\" for \"this betrayal of trust, done for the basest motives\". 'Spy wars' He also admitted to The Washington Post before sentencing that he had \"financial troubles, immediate and continuing\". But he downplayed the consequences of his actions, saying he had not \"noticeably damaged\" the US nor \"noticeably aided\" Moscow. \"These spy wars are a sideshow which have had no real impact on our significant security interests over the years,\" he told the court. According to an FBI history of the case, Ames, who spoke Russian, was working in the Soviet division at CIA headquarters in Langley, Virginia, when he was first approached by the KGB. He continued passing secrets to the Soviets while stationed in Rome and after returning to Washington. But the FBI opened an investigation in May 1993 after being tipped off about Ames's unexplained wealth. What followed was a 10-month probe, comprising intense physical and electronic surveillance. Read more:Reform's ex-Wales leader jailed over pro-Russian bribesBriton who volunteered as spy for Russia jailed On 13 October 1993, Ames made a chalk mark on a mailbox to confirm to his Russian contacts that he would meet them in Bogota, Colombia, where he was later observed with his handler. But when he planned a trip to Moscow as part of his official duties, a plan to arrest him was approved."
    },
    {
        "title": "Warner Bros shareholders urged to reject amended Paramount bid",
        "description": "The board of Warner Bros Discovery (WBD) has urged its shareholders to reject an amended hostile bid by Paramount Skydance while maintaining its unanimous support for a rival offer by Netflix.",
        "url": "https://news.sky.com/story/warner-bros-shareholders-urged-to-reject-amended-paramount-bid-13491513",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paramount-netflix-warner_7106396.jpg?20251210102854",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-07 12:37:00",
        "Headline": "Commitments made by Paramount Skydance just before Christmas, largely concerning  the financing of its plans, have been rejected as too risky by the WBD board. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The board of Warner Bros Discovery (WBD) has urged its shareholders to reject an amended hostile bid by Paramount Skydance while maintaining its unanimous support for a rival offer by Netflix. A letter to investors said the updated $108.4bn all-cash offer from Paramount, for the whole business, involved an \"extraordinary amount of debt financing\" that represented a risk to any deal completing. Paramount's bid was hostile, through a direct approach to WBD's shareholders, as the board had already thrown its weight behind the $72bn ($54bn) cash and stock offer made by Netflix in early December. It reiterated that continued support for the Netflix bid in the letter and dismissed claims by Paramount that its offer was \"superior\". Money latest: The postcodes eligible for cold weather payment The Netflix bid comprises WBD TV and film studios, their respective back catalogues including Harry Potter and Game of Thrones, alongside the HBO Max streaming service. Paramount made its case to WBD investors as it remained unclear whether the streaming market dominance enjoyed by Netflix would prove a stumbling block to its takeover deal, given likely interest from competition regulators. \n                  US aims to control Venezuela oil sales 'indefinitely'\n                 \n                  Waterstones owner lines up Rothschild to book listing slot\n                 \n                  Cheap Eats: Tommy Banks on his train station debate over a toastie, weight loss drugs and why you're using salt wrong\n                 David Ellison, chairman and CEO of Paramount, said when the hostile bid was launched: \"Our public offer, which is on the same terms we provided to the Warner Bros Discovery Board of Directors in private, provides superior value, and a more certain and quicker path to completion. \"We believe the WBD Board of Directors is pursuing an inferior proposal which exposes shareholders to a mix of cash and stock, an uncertain future trading value of the Global Networks linear cable business and a challenging regulatory approval process.\" He urged them to \"maximise\" the value of their investment. WBD shares are currently trading around the $28 per share mark. The cash and stock deal offered by Netflix is valued at $27.75 per Warner share. Paramount's offer stacks up at $30 per share. While Netflix's offer has a lower headline value, financial analysts have said it presents a clearer financing structure and fewer execution risks than Paramount's bid for the entire company, including its cable TV business. Read more from Sky News:Bosses courted to join PM's China tripMusk's AI 'creating absolutely appalling' images The Warner Bros board told shareholders the Paramount financing plan would saddle the smaller Hollywood studio with $87bn in debt. It said the revised offer, which included a commitment to use $40bn in equity personally guaranteed by Mr Ellison's father - the Oracle billionaire co-founder Larry Ellison - remained inadequate. It cited \"the insufficient value it would provide, the lack of certainty in PSKY's ability to complete the offer, and the risks and costs borne by WBD shareholders should PSKY fail to complete the offer\"."
    },
    {
        "title": "US aims to control Venezuela oil sales 'indefinitely'",
        "description": "The White House has said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation.",
        "url": "https://news.sky.com/story/trump-announces-high-quality-oil-deal-with-venezuela-13491348",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-us_7128529.jpg?20260107011906",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-07 01:08:00",
        "Headline": "Venezuela is sitting on the world's biggest reserves of heavy oil, ahead of the likes of Canada and Russia, and the US president wants to take advantage.",
        "Content": "The White House has said it aims to control sales of Venezuela's oil \"indefinitely\" as the Trump administration draws up plans for US oil companies to return to the nation. Mr Trump first announced on Tuesday night that Venezuela's interim government would be \"turning over\" between 30 and 50 million barrels of \"high quality\" oil to the US. The oil - worth upwards of $2bn (Â£1.48bn) - will be taken from storage by ships and brought directly to US unloading docks, the president said on Truth Social. It will be sold at its market price and the money generated from the sales will be controlled by Mr Trump himself, his statement added. Catch on latest updates on Venezuela and Greenland Energy secretary Chris Wright, who has been asked to execute the plan, later told an industry conference in Florida on Wednesday: \"We need to have that leverage and that control of those oil sales to drive the changes that simply must â€‹happen in Venezuela.\" Mr Trump has been open about his plans for Venezuela's oil reserves since the capture and arrest of president Nicolas Maduro in an audacious American raid on Caracas. He has suggested US oil companies could be up and running in the country within 18 months, and threatened Venezuela's interim regime with more miliary intervention if it doesn't cooperate. Part of its plan involves \"selectively\" easing US sanctions governing Venezuelan oil flows. It was also confirmed that US authorities had boarded the empty Russian-flagged Marinera tanker, formerly known earlier in its voyage as the Ghanian-registered Bella 1, in the north Atlantic, citing \"sanctions violations\". A second, apparently China-bound, \"dark fleet\" tanker called the Sophia was later apprehended in the Caribbean Sea for the same reason. The seizures seem set to inflame tensions with Russia and China over US control of Venezuelan oil. The White House confirmed that the president would meet US oil company executives, to discuss opportunities for investment in Venezuela, on Friday. There is currently only one US multinational oil company in Venezuela - Chevron. Another two, Exxon Mobil and ConocoPhillips, left after Maduro's predecessor, Hugo Chavez, nationalised the oil industry, rendering them superfluous. Venezuela is sitting on the world's biggest reserves of heavy oil, ahead of the likes of Canada and Russia. Last month, the US blocked oil tankers from leaving the country and seized several tankers in international waters as part of efforts to enforce its sanctions on Venezuela's oil industry. Reports have claimed that bosses from US oil companies are expected to visit the White House as early as Thursday to discuss investments in Venezuela. Read more from Sky News:More heavy snow to hit UKBritish troops in Ukraine if peace deal struck Mr Trump's announcement came after he boasted about the US military operation in Venezuela during a speech in Washington, describing it as \"an amazing military feat\". A Pentagon official said at least seven US service members were injured during the operation, while Venezuela's military said at least 24 of its military officers were killed. Venezuela's acting president Delcy Rodriguez, who was only sworn in on Monday, said in a televised address that there was \"no external agent\" governing the country. Mr Trump's administration is not only being open about its plans for Venezuela, but also its ambitions for Greenland. The White House has suggested it would be open to using military force to seize the mineral-rich Arctic territory from NATO ally Denmark."
    },
    {
        "title": "Waterstones owner lines up Rothschild to book listing slot",
        "description": "The owner of Waterstones is close to hiring bankers to work on a multibillion-pound listing of the transatlantic bookseller.",
        "url": "https://news.sky.com/story/waterstones-owner-lines-up-rothschild-to-book-listing-slot-13491519",
        "image_url": "https://e3.365dm.com/20/05/1920x1080/skynews-waterstones-bookshop_4995493.jpg?20200521134740",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-07 12:51:00",
        "Headline": "The company run by James Daunt, who also founded the eponymous books retailer, is lining up Rothschild to advise on a prospective multibillion-pound stock market flotation, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of Waterstones is close to hiring bankers to work on a multibillion-pound listing of the transatlantic bookseller. Sky News has learnt that Elliott Management is preparing to appoint Rothschild to act as an independent adviser on its flotation options, with a public market debut likely to take place as soon as the second quarter of this year. Sources said that Rothschild's likely engagement was the clearest sign so far that London is well-placed to triumph over New York in the battle to stage the listing of one of the world's leading book retailers. As well as Waterstones, the group also owns Barnes & Noble, which trades from hundreds of stores in the US. In Britain, the company trades from about 315 stores and employs roughly 4,000 people. It has been transformed under the leadership of James Daunt, founder of the eponymous retail chain, which is separately owned by him. Sky News reported in October that Mr Daunt had been among the attendees at a roundtable hosted by Rachel Reeves, the chancellor, in an attempt to promote the London Stock Exchange as a listing venue. \n                  Warner Bros shareholders urged to reject amended Paramount bid\n                 \n                  US aims to control Venezuela oil sales 'indefinitely'\n                 \n                  Cheap Eats: Tommy Banks on his train station debate over a toastie, weight loss drugs and why you're using salt wrong\n                 Last month, the Financial Times said the company had kicked off talks with potential advisers on a deal. A number of other banks will be appointed in the coming months to oversee the public listing and share sale. Elliott declined to comment."
    },
    {
        "title": "Cheap Eats: Tommy Banks on his train station debate over a toastie, weight loss drugs and why you're using salt wrong",
        "description": "Every month we interview top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. This week, we speak to Great British Menu winner, Michelin-starred chef and restaurateur Tommy Banks.",
        "url": "https://news.sky.com/story/cheap-eats-tommy-banks-on-his-train-station-debate-over-a-toastie-weight-loss-drugs-and-why-youre-using-salt-wrong-13491431",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-tommy-banks-money-blog_7127903.jpg?20260106104113",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-07 09:47:00",
        "Headline": "Great British Menu winner Tommy Banks tells the Money blog about the \"political decisions\" hurting hospitality in our monthly Cheap Eats feature.",
        "Content": "Every month we interview top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. This week, we speak to Great British Menu winner, Michelin-starred chef and restaurateur Tommy Banks. When I was growing up my mum and dad ran a bed and breakfast... It did mean that every day was basically breakfast service in our house. Everything was just to a fine art and I probably didn't realise at the time, but it definitely had an influence on me. Because it was on a farm, my dad would collect the eggs every morning and then he would crack them all on to saucers. Then he would grade them on look and quality, and then he would decide which ones to use for each job. So only the ones in his A grade would get poached, and then it would be fried, and then scrambled would be the lowest grade. When the family took over the (now Michelin-starred) Black Swan in North Yorkshire, I was 17... I did one year of A-levels, was politely asked not to come back for a second year and started working. It was very much make it up as you go along and figure it out. But that's nearly 20 years ago now. Follow the latest consumer news here Everyone lowered prices during the 2008 crash, but we put them up... The crash was really tough on many industries, but hospitality in particular is one of the first things that suffers when people don't have money. What we noticed was that everybody was doing cheap deals, two-for-ones, all this sort of thing was the rage at the time. But realistically, you don't travel into the middle of nowhere for a bargain. So we actually put our prices up and we tried to make it more of an experience rather than just doing what everyone else did. That's easier said than done when you've got no idea what you're doing as a 21-year-old, but I think it was a sound strategy. It is probably quite an interesting strategy for today's market as well. It can be a race to the bottom if you're not careful. I won a Michelin star when I was very young and didn't have it all figured out at all. I had huge imposter syndrome... I felt very insecure about my ability and very insecure about the sort of plaudits that were coming my way. You don't really learn anything from someone giving you a compliment, do you? You only learn from mistakes and from going through tough times. I journal every day and it's very rare that I write anything negative about the future... I was really poorly when I was 18. I got ulcerative colitis. My grandfather, whom I was very, very close to, died, and the stress of that caused my body to start eating itself. I was really poorly for about a year. I had a colostomy bag and was in and out of hospital, having three bouts of major surgery. I always wanted to try to turn a negative into a positive and that's certainly what gave me a quite insatiable drive for success. If I'd never been ill, I'd have just dossed around like any other lad my age, getting drunk, playing sport and doing all the other things that you want to do when you're that age. \n                  Cheap Eats: 'I'm a head chef - this is what you should tip and one thing I hate that some customers do'\n                 \n                  Cheap Eats: Top chef on spag bol hack, the Burger King item you can't beat, and two things customers should stop doing\n                 \n                  Cheap Eats: 'It's just bizarre' - top chef vents about two things customers do in 2025\n                 In a lot of ways, COVID had quite a positive impact... because it definitely encouraged people to be way more creative with their outlooks and more entrepreneurial. I think people diversified their offerings and you see that from the number of people who added their businesses to things like Uber Eats, because they're looking at different ways of getting to the customer. The challenges are clear though... People don't have as much money to spend. There's a clear trend towards less drinking and earlier dining, especially. And it hasn't maybe affected us as much because of our location and what we do. But talking to more casual businesses, especially in London, the invention or the take-up of weight loss drugs has had a massive effect on that area of the market because people are literally eating less. Good for the customer, terrible for the operator... From a consumer point of view, the changes are really good because there's now a more diverse, better-quality hospitality industry. It's terrible for the operator, though, because the margins are tiny and people are going out of business. The biggest effects on the industry have been political choices... Increasing the minimum wage is a good thing for people who can have more money, but increasing the younger level of minimum wage decreases the job prospects of young people. Take the hike to employer national insurance - when you add in what is essentially a tax on jobs, you are going to see many redundancies. The national insurance increase, coupled with the living wage increase last year, added Â£250,000 to our wage bill. We just used to make really nice food but... the creative skill of the chef now is more how you create something that people really want to buy, but at the price point that they're willing to pay, while still having a margin. It's a nearly impossible thing. Most businesses are operating at break-even or below. Fish costs have gone up astronomically... One of my signature dishes is a turbot dish, which I did on Great British Menu many years ago. And when we had it on the menu in 2017, we would pay Â£18 a kilo for the whole fish. When I wanted to buy the turbot about a month ago, it was Â£86 a kilo. An operational change that I've made is going to sound really basic but... actually just better reporting, measuring everything. Every point of a percentage actually really matters in an industry that's operating at break-even. Read more from Cheap Eats:'I'm a head chef - this is what you should tip and one thing I hate that some customers do'Top chef on spag bol hack, the Burger King item you can't beat, and two things customers should stop doingFortnum and Mason's pastry guru reveals supermarket dessert he loves I always see UK Hospitality campaigning for a VAT cut... and great, I'm all for that. What I would do, though, is give businesses 10% off the first 10% that they turn over and then businesses are incentivised to increase their turnover because they get a tax break. If you want to encourage growth, you would incentivise them financially? Why do they not do that? All they do is just tax us again. I was waiting for a train the other day at York Station and there was a little independent selling coffee... and they had a cheese and ham toastie for Â£7. I heard someone just be like, \"Â£7 for a toastie?\" I was like, \"It's not seven quid though, is it?\" Just take off the VAT as the starting point, and think about how much it costs to rent in the station. People don't consider the overheads and the costs of running something. Everything is so instant now... You can do everything on your phone, AI does half the stuff for us. But there's something old school about hospitality. Something about human interaction and breaking bread and spending that time together that just cannot be replaced with technology. And I think that's what still excites me. I just don't think it'll ever go out of fashion to spend time with loved ones and enjoy great hospitality and human interaction. Why can't we celebrate this? The most memorable customer I've had was a very famous American chef... called Thomas Keller, who has several three-Michelin-starred restaurants in America. And he came for dinner at the Black Swan. It was quite a few years ago now, but obviously everyone was so nervous. It was probably the most important chef in the world coming for dinner. He came in and the first thing he did is fist-bump everyone and ask if he could go into the kitchen. He asked \"How you doing guys?\" I just thought, \"Wow, what a way to put everybody at ease.\" A behind-the-scenes moment from Great British Menu that viewers don't get to see is... how challenging it is to operate at that sort of level day after day, after day, after day, over a filming day that can be 14 or 15 hours. When your adrenaline is that high, it actually gets to the point where it's a real case of stamina. And I think sometimes people watch the show and go, \"God, that person just fell apart when it came to the judges\", and that might be because they're absolutely spent and exhausted. The standards have got higher and higher and higher every year on Great British Menu... One chef who probably stands out above all would be Spencer Metzger. He really nailed Great British Menu. People who do well practise and practise and practise and practise. One technique to make cheap products taste even better is... knowing how to use salt. It would make a massive difference to a lot of people's food. That sounds awful. A lot of people will cook without any salt and then add it at the end. But salt is a chemical you need to add throughout the cooking process. That's how you achieve the depth of flavour and an overall feeling of being seasoned. If you add salt at the end, food will taste bland and salty. Because you just taste the salt. There are quite a few cheat codes that work quite well... if I'm trying to cook quickly and cheaply, I will use things like Worcester sauce or Marmite, which are really umami, but they're really cheap. If I were trying to make something really quickly and not spend loads of money on expensive beef stock and things like that, a little spoonful of Marmite and a little bit of Worcester sauce would really increase the seasoning without really adding much cost to the dish. We spoke to Tommy Banks following the launch of his Classic British menu, available exclusively on Uber Eats this past December in London, Manchester, and Liverpool. The menu reimagined dishes from the last 400 years, celebrating tradition with a refreshingly contemporary touch."
    },
    {
        "title": "Bosses courted to join PM's China trip as embassy verdict looms",
        "description": "Downing Street is courting business leaders to accompany Sir Keir Starmer on his first bilateral visit to Beijing even as a decision looms on whether to approve China's controversial new embassy in London.",
        "url": "https://news.sky.com/story/bosses-courted-to-join-pms-china-trip-as-embassy-verdict-looms-13491462",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-starmer-xi_7050426.jpg?20251014015646",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-07 11:29:00",
        "Headline": "Some executives have expressed doubt about whether Sir Keir Starmer's trip will take place this month unless China's controversial new London embassy is approved beforehand, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Downing Street is courting business leaders to accompany Sir Keir Starmer on his first bilateral visit to Beijing even as a decision looms on whether to approve China's controversial new embassy in London. Sky News understands that officials have begun contacting corporate executives to gauge their appetite to join the prime minister on a trip slated to take place towards the end of the month. The date of the visit has yet to be specified, but is expected after the World Economic Forum in Davos concludes on 23 January. A number of business leaders who spoke to Sky News have expressed doubt that the trip will take place at all unless the embassy is approved. The government has committed to delivering its verdict on or before 20 January, and reports in recent weeks have suggested that it will go ahead following a green light from Britain's security services. Business leaders have joined prime ministers on a series of bilateral visits to Beijing, including during the premiership of David Cameron, who hailed a \"golden era\" of relations between the two countries. The last such occasion was in 2018, when Theresa May unveiled billions of pounds of business deals involving British and Chinese companies. The relationship has cooled significantly in recent times amid geopolitical stresses, and there remain doubts over whether other bilateral economic forums between Britain and China will take place this year. Read more from Sky News:Money blog: Chef on his row over a toastieMusk's AI 'creating absolutely appalling' images \"We had the golden age, which then flipped to an ice age,\" the PM said in a speech last month. \"We reject that binary choice,\" he said, adding that China was a \"nation of immense scale, ambition and ingenuity\" and \"a defining force in technology, in trade and global governance\". Downing Street declined to comment on the PM's prospective visit to China, while the Ministry of Housing, Communities and Local Government, which is overseeing the embassy approval process, also declined to comment.  "
    },
    {
        "title": "London Heathrow, Gatwick, City and Bristol airports have hiked their drop-off charges already this year",
        "description": "Four major UK airports have increased their drop-off fees during the first week of 2026.",
        "url": "https://news.sky.com/story/london-heathrow-gatwick-city-and-bristol-airports-have-hiked-their-drop-off-charges-already-this-year-13491445",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-airport-drop-off-fees_6966755.jpg?20250717084227",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-07 10:09:00",
        "Headline": "People are now being charged as much as Â£10 for drop-offs, with increasing costs blamed for the rise.",
        "Content": "Four major UK airports have increased their drop-off fees during the first week of 2026. London City Airport ended its reign as the only airport in the capital not charging drivers for dropping off loved ones by introducing an Â£8 fee. The charge must be paid for parking for up to five minutes - every additional minute after that will cost Â£1 until you hit the maximum 10-minute stay. Follow the latest consumer news here The airport said the fee will help to \"maintain efficient access to the forecourt and support the best possible access for everyone\". Blue badge holders and black cabs are exempt from the charge. Gatwick Airport has become the most expensive airport for drop-offs, upping its fee from Â£7 to Â£10 for 10 minutes. \n                  Warner Bros shareholders urged to reject amended Paramount bid\n                 \n                  US aims to control Venezuela oil sales 'indefinitely'\n                 \n                  Waterstones owner lines up Rothschild to book listing slot\n                 The airport - the second busiest in the UK after Heathrow - only raised its prices to Â£7 in May last year. It said increasing costs, including a more than doubling of its business rates, were behind the hike. It also told Money that it was \"not aware\" of any further increases coming this year, or a review of the current fee. Read more from Money:'My sister doesn't have internet or a smartphone - how can get get online when she's on benefits?''Can I stop my neighbour using Ring doorbell? She's spying on me''Can they really fine me Â£170 for overstaying by one minute?' London Heathrow increased its charge from Â£6 to Â£7 on New Year's Day, and introduced a new 10-minute rule in drop-off areas, with drivers who stay any longer facing a fine. It did confirm to Money that no more increases were planned for this year. Bristol Airport pushed its fees up from Â£7 to Â£8.50 for up to 10 minutes of parking. Drivers staying between 10 and 20 minutes have also seen their charge go up from Â£9 to Â£10.50. Blue Badge holders are able to use the drop-off car park for an extended stay of 40 minutes, but that will also increase from Â£7 to Â£8.50."
    },
    {
        "title": "Starmer 'sets out his position on Greenland' in call with Donald Trump",
        "description": "Sir Keir Starmer has set out his position on Greenland in a call with US President Donald Trump, Downing Street says.",
        "url": "https://news.sky.com/story/sir-keir-starmer-set-out-his-position-on-greenland-in-call-with-donald-trump-tonight-no-10-13491833",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7129882.jpg?20260108004851",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-07 22:46:00",
        "Headline": "The prime minister discussed Greenland and the boarding of the sanctioned tanker Bella 1 in a call with the US president, Number 10 said.",
        "Content": "Sir Keir Starmer has set out his position on Greenland in a call with US President Donald Trump, Downing Street says. Mr Trump has been vocal about his desire to annex the territory, despite it being part of Denmark - a NATO ally. A spokesman for the prime minister said the call also included a discussion about the interception of the Bella 1 tanker, sometimes called the Marinera, which involved US and UK military forces. The No 10 spokesperson said: \"The prime minister spoke with President Trump this evening. \"They discussed the joint operation to intercept the Bella 1 as part of shared efforts to crack down on sanctions busting, recent progress on Ukraine and the US operation in Venezuela. \"The prime minister also set out his position on Greenland.\" That position was revealed in a joint statement on Tuesday, when European allies, including the UK, reasserted that \"Greenland belongs to its people. It is for Denmark and Greenland, and them only, to decide on matters concerning Denmark and Greenland\". Fears that the US will act against Greenland have mounted following the arrest of Venezuelan president Nicolas Maduro in an audacious American raid on Caracas. In the aftermath, Mr Trump left the door open to further interventions in the western hemisphere by citing the Monroe Doctrine. The policy, named after former president James Monroe, asserts the right of the US to intervene in foreign affairs across the Americas in its own interest. Mr Trump calls it the Donroe Doctrine, adapting it with his own name. Against this backdrop, the US president has repeatedly raised the spectre of action over Greenland. On Monday, he spoke to Sky's US partner network NBC News about Greenland, saying that \"we need it for national security, right now\". Despite opposition from Mr Trump's NATO allies, a subsequent statement from the White House pushed the envelope further by insisting that \"utilizing the â€ŒUS military is â€always an option\". Danish Prime Minister Mette Frederiksen has warned that any such action against Greenland would spell the end of NATO. ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ Earlier, the UK's defence secretary used a statement to the Commons to explain that no UK personnel took part in the boarding of the Bella 1, but that UK forces supported the operation \"at the request of the US\". John Healey said the oil tanker intercepted by the US was \"falsely flagged\" and that it is a \"sanctioned, stateless vessel\". It was intercepted between Iceland and Scotland as it headed towards Russia on Wednesday."
    },
    {
        "title": "Farage warns Trump invading Greenland 'would be the end of NATO' ",
        "description": "Nigel Farage said he doesn't think Donald Trump will invade Greenland as that \"would be the end of NATO\". ",
        "url": "https://news.sky.com/story/farage-warns-trump-invading-greenland-would-be-the-end-of-nato-13491459",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-greenland-protesrt_7128161.jpg?20260106150110",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-07 10:43:00",
        "Headline": "The White House has said \"US military is always an option\" for acquiring Greenland.",
        "Content": "Nigel Farage said he doesn't think Donald Trump will invade Greenland as that \"would be the end of NATO\".  The Reform UK leader stressed he hadn't spoken with the US president about this issue but he doesn't think he will follow through on his threats. Politics live: Sir Keir Starmer to face Kemi Badenoch for first time in 2026 President Trump has been vocal about his desire to annex the self-governing island, despite it being part of Denmark - a NATO ally. The White House has said the \"US military is always an option\" in taking over Greenland, which it wants because of its strategic Arctic location and mineral resources. At a press conference in London, Mr Farage said the president has \"been rather busy\" and he hasn't spoken with him. But he added: \"Ever since 2016, the narrative has been that Trump wants to destroy NATO, but actually, whenever I talked to Trump in 2016 about NATO, he's always said, no, that's not right. I want to strengthen NATO.\" \n                  Great British Railways: How much of your cash has been spent on trains rebrand?\n                 \n                  Politics latest: Mission to capture oil tanker  was 'lawful', says defence secretary\n                 \n                  Starmer 'sets out his position on Greenland' in call with Donald Trump\n                 He pointed to the fact President Trump's interventions have led to an increase in promised defence spending across Europe. He said: \"In many ways, he has strengthened NATO. However, if he were to do this using military force, that probably would be the end of NATO which is why he won't do it, in my opinion.\" He added: \"Would I stand up to him now? The great thing of being friends with people is friends don't always agree with everything that the other one says.\" Read more:The MP who tabled 342 questions in a dayFuneral held for Brigitte Bardot In recent days, Danish Prime Minister Mette Frederiksen has warned that US military action to seize the territory would spell the end of NATO. And in a joint statement on Tuesday, European leaders including Sir Keir Starmer and Emmanuel Macron said they will \"not stop defending\" Greenland's territorial integrity. But a later statement from the White House showed no sign of toning down the rhetoric - and defended potentially taking a military approach, insisting it is \"always an option\" open to the president. \"President Trump has made it well known that acquiring Greenland â€Œis a national security priority â€Œof the United States, and it's vital â€‹to deter our adversaries in the Arctic region,\" it said. \"The â€president and his team are discussing a range of options to pursue this important â€Œforeign policy goal, â and of course, utilising the â€ŒUS military is â€always an option at the commander-in-chief's disposal.\""
    },
    {
        "title": "Illegal child abuse material generated by X's artificial intelligence Grok, says UK watchdog",
        "description": "Criminals have used Grok, Elon Musk's AI, to create child sexual abuse imagery, the Internet Watch Foundation (IWF) has reported.",
        "url": "https://news.sky.com/story/illegal-child-abuse-material-generated-by-xs-artificial-intelligence-grok-says-uk-watchdog-13491658",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-grok-xai_7129355.jpg?20260107175939",
        "type": "Politics",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-07 17:54:00",
        "Headline": "For days, the Internet Watch Foundation has received reports from internet users that Grok has created child abuse images, but that content hadn't crossed the threshold into illegal content. Now it has.",
        "Content": "\n          Science and technology reporter\n       Criminals have used Grok, Elon Musk's AI, to create child sexual abuse imagery, the Internet Watch Foundation (IWF) has reported. For days, the IWF has been receiving reports from internet users that Grok had created child abuse images, but that content hadn't crossed the threshold into illegal content. Now, it has, says the IWF. It is one of the few organisations around the world that is allowed to proactively track down child abuse material and found the material in a dark web forum. The users sharing the material boasted about how they'd used Grok to create it. \"Following reports that the AI chatbot Grok has generated sexual imagery of children, we can confirm our analysts have discovered criminal imagery of children aged between 11 and 13 which appears to have been created using the tool,\" said Ngaire Alexander, head of hotline at the IWF. X and xAI, both owned by billionaire Elon Musk, have come under fire in recent days after numerous users, mainly women, posted saying they'd seen AI-generated sexual images of themselves on X. \n                  Robots with human-type capabilities are coming this year, says Nvidia CEO\n                 \n                  Ofcom makes 'urgent contact' with X over concerns Grok AI can generate 'sexualised images of children'\n                 \n                  Is the AI bubble about to burst? If so the consequences could be dire\n                 Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. There are also several cases where Grok has created sexualised images of children, according to analysis by news agency Reuters. Ms Alexander added: \"The imagery we have seen so far is not on X itself, but a dark web forum where users claim they have used Grok Imagine to create the imagery, which includes sexualised and topless imagery of girls. \"The imagery we have seen would be considered Category C imagery under UK law. \"The user then uses the Grok imagery as a jumping off point to create much more extreme, Category A, video using a different AI tool. The harms are rippling out. \"There is no excuse for releasing products to the global public which can be used to abuse and hurt people, especially children. Read more technology news:Robots with human-type capabilities are comingPorn users 'still seeing porn with no age checks' Both Ofcom and the Technology Secretary Liz Kendall have warned X to take action over the abusive imagery being created by its AI. Yesterday, Ms Kendall said: \"What we have been seeing online in recent days has been absolutely appalling, and unacceptable in decent society.\" \"X needs to deal with this urgently. It is absolutely right that Ofcom is looking into this as a matter of urgency and it has my full backing to take any enforcement action it deems necessary.\" In an interview with Sky News, the minister for AI and online safety, Kanishka Narayan, said the images being created by Grok were \"completely unacceptable\". He was asked whether the government was willing to risk its relationship with the Trump administration in order to fully enforce the UK's online safety rules against X. President Trump and his administration, as well as Elon Musk, have been vocal critics of the UK and EU authorities when they try to take action against US companies. \"The American president is as against child sexual abuse and violence against women and girls as I think that the British public and the British government is,\" said Mr Narayan. \"So that's the first thing to say. \"The second thing to say is that this is an area of domestic policy. We will continue to make sure that the public is kept safe from those egregious examples of both sexual abuse and sexual harassment online.\" On Wednesday, Mr Musk said a new version of Grok had been released and urged users to update their app, although it was not immediately clear what updates the new version contained. The tech tycoon has previously insisted that \"anyone using Grok to make illegal content will suffer the same consequences as if they uploaded illegal content\". X has said it takes action against illegal content, including child sexual abuse material, \"by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary\". Sky News has contacted X for comment."
    },
    {
        "title": "Call for monthly student loan payments 'backed by dozens of Labour MPs'",
        "description": "Students should be paid their maintenance loans monthly instead of per term to help them with the cost of living crisis, a group of Labour MPs is urging the government.",
        "url": "https://news.sky.com/story/call-for-monthly-student-loan-payments-backed-by-dozens-of-labour-mps-13491611",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lecture-hall-students_7129411.jpg?20260107191630",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2026-01-07 16:05:00",
        "Headline": "A backbench Labour MP has called for a shake-up of maintenance loans so they are paid monthly instead of three times a year, to help students manage their finances.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Students should be paid their maintenance loans monthly instead of per term to help them with the cost of living crisis, a group of Labour MPs is urging the government. Dozens of Labour backbenchers are supporting a bill that would bring England's maintenance loan system in line with Scotland's. Politics live: UK armed forces support US seizure of tanker Currently, students in England receive their loans in three lump sums over the academic year. For those receiving the maximum Â£10.5k annually outside London, this equates to Â£3.5k payments every four months, which they need to make last. Labour MP Luke Charters, who is proposing the bill, told Sky News that \"lots of students are maxing their overdrafts and credit cards\" because they are struggling to manage their budgets. \"Could you imagine having your salary drop three times a year and getting four months all at once? It's really, really a difficult balance for students at the moment,\" he said. The bill, supported by the National Union of Students (NUS) and dozens of regional student unions, also proposes giving students their first payment in advance of term starting so they can buy supplies and pay their rent deposit, which is often due before September. \n                  A-level results show deepening inequality despite vows to tackle attainment gaps\n                 \n                  Going to university is not what it once was - and students face a very different question\n                 \n                  Bereaved parents criticise review into student suicides for 'dodging real issue'\n                 In a speech in parliament introducing the bill on Wednesday, the York Outer MP said this was impacting working-class students who cannot rely on their parents. \"Pots and pans, rent deposits, books, software, travel passes, course subscriptions, these costs all stack up,\" he said. \"I heard of a student who couldn't afford the train to university because their student finance hadn't arrived. Starting uni should be memorable, not miserable.\" Rise in student support for Greens The bill comes amid growing concern from within Labour about the need to do more to ease the cost of living crisis for young people. Around 60 MPs are in a university WhatsApp group to discuss how to improve higher education and Labour's offer to students, Sky News has learned. The Green Party came second in seats across major university cities at the general election, including in Leeds, Manchester and Sheffield. A YouGov poll in July showed nearly half of 18-24-year-olds were open to voting Green - and that was before the election of the new media-savvy leader Zack Polanski. Mr Polanski wants to scrap university tuition fees - a promise Prime Minister Sir Keir Starmer made when he stood for Labour leader but later rowed back on, blaming the economy. Manchester Rusholme MP Afzal Khan, who is one of the 11 sponsors of Mr Charters' bill, said this plan was not about the next election but about improving things for young people \"who have it really tough\". He said there is a \"clear interest\" across the party to help out students and this proposal is about trying to \"get some publicity and put it on the radar\". Read more from Sky News:Farage says US invading Greenland 'would be end of NATO'The MP who tabled 342 questions in a single day Mr Charters used the 10-minute rule process, which is a mechanism for backbench MPs to shine a spotlight on an issue they want to build pressure on. It is formally supported by 11 Labour MPs, the maximum amount allowed to sponsor this sort of bill, but he said it has the support of \"dozens\" of his colleagues as well as student unions representing a third of all students. Amira Campbell, the president of the NUS, said student finance is \"in dire need of reform and a review into the payment plan is a great place to start\". However it would need the support of the government to become a reality. Mr Charters said he was \"confident the government is listening\". Sky News has contacted the department for education for comment. What has government done about university fees? The government has already pledged to reintroduce maintenance grants for the most disadvantaged students in England from 2028, which unlike loans, do not have to be paid back. However, last year ministers also announced that tuition fees will increase every year in line with inflation from 2026 onwards. And measures in Rachel Reeves' budget in November also mean that many graduates face paying more tax, as the salary threshold at which loans must start to be repaid is being frozen for three years. Mr Charters, 30, who will be affected by that policy, said successive governments have ignored students and graduates and there needs to be a better offer. He told Sky News: \"I'm on plan two. I'm paying off my loan. I'm one of the youngest MPs in parliament. For successive governments going back decades, parliament has not talked enough about student issues. I say enough's enough.\""
    },
    {
        "title": "New restrictions: Government plans every driver will care about ",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>ðŸ‘‰Listen to Politics at Sam and Anne's on your podcast appðŸ‘ˆ</a>",
        "url": "https://news.sky.com/story/new-restrictions-government-plans-every-driver-will-care-about-13491181",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-07 08:24:00",
        "Headline": "No subtitle found",
        "Content": "ðŸ‘‰Listen to Politics at Sam and Anne's on your podcast appðŸ‘ˆ Three things from Sam Coates and Anne McElvoy to start your political day.  What the government is having to deal with: the unpredictability of Donald Trump. Just as Britain signs up to troops in Ukraine if there's a peace deal, it's having to use its best diplomatic language on what the president is thinking about Greenland. What the government wants to deal with: publishing the road safety strategy, which is something every driver will have a view on. What some government sources are thinking: Sam's got a story about whether AI is to blame for a massive rise in the number of Written Parliamentary Questions in the Commons. You can vote for Politics at Sam and Anne's in the people's choice category at the Political Podcast Awards here."
    },
    {
        "title": "Bosses courted to join PM's China trip as embassy verdict looms",
        "description": "Downing Street is courting business leaders to accompany Sir Keir Starmer on his first bilateral visit to Beijing even as a decision looms on whether to approve China's controversial new embassy in London.",
        "url": "https://news.sky.com/story/bosses-courted-to-join-pms-china-trip-as-embassy-verdict-looms-13491462",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-starmer-xi_7050426.jpg?20251014015646",
        "type": "Politics",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-07 11:29:00",
        "Headline": "Some executives have expressed doubt about whether Sir Keir Starmer's trip will take place this month unless China's controversial new London embassy is approved beforehand, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Downing Street is courting business leaders to accompany Sir Keir Starmer on his first bilateral visit to Beijing even as a decision looms on whether to approve China's controversial new embassy in London. Sky News understands that officials have begun contacting corporate executives to gauge their appetite to join the prime minister on a trip slated to take place towards the end of the month. The date of the visit has yet to be specified, but is expected after the World Economic Forum in Davos concludes on 23 January. A number of business leaders who spoke to Sky News have expressed doubt that the trip will take place at all unless the embassy is approved. The government has committed to delivering its verdict on or before 20 January, and reports in recent weeks have suggested that it will go ahead following a green light from Britain's security services. Business leaders have joined prime ministers on a series of bilateral visits to Beijing, including during the premiership of David Cameron, who hailed a \"golden era\" of relations between the two countries. The last such occasion was in 2018, when Theresa May unveiled billions of pounds of business deals involving British and Chinese companies. The relationship has cooled significantly in recent times amid geopolitical stresses, and there remain doubts over whether other bilateral economic forums between Britain and China will take place this year. Read more from Sky News:Money blog: Chef on his row over a toastieMusk's AI 'creating absolutely appalling' images \"We had the golden age, which then flipped to an ice age,\" the PM said in a speech last month. \"We reject that binary choice,\" he said, adding that China was a \"nation of immense scale, ambition and ingenuity\" and \"a defining force in technology, in trade and global governance\". Downing Street declined to comment on the PM's prospective visit to China, while the Ministry of Housing, Communities and Local Government, which is overseeing the embassy approval process, also declined to comment.  "
    },
    {
        "title": "MPs would vote on deployment of troops to Ukraine, Starmer says",
        "description": "MPs would get to vote on any potential deployment of troops to Ukraine, Sir Keir Starmer has said after he committed to sending a peacekeeping force to Ukraine in the event of a ceasefire with Russia.",
        "url": "https://news.sky.com/story/mps-would-vote-on-deployment-of-troops-to-ukraine-starmer-says-13491501",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-pmqs_7128974.jpg?20260107125212",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-07 12:13:00",
        "Headline": "The prime minister said military plans \"were drawn up some months ago\" and deployment \"would only be after a ceasefire to support Ukraine's capabilities\".",
        "Content": "MPs would get to vote on any potential deployment of troops to Ukraine, Sir Keir Starmer has said after he committed to sending a peacekeeping force to Ukraine in the event of a ceasefire with Russia. The prime minister told MPs: \"I will keep the House updated as the situation develops. And were troops to be deployed under the declaration signed, I would put that matter to the House for a vote.\" Speaking at PMQs, he added that military plans \"were drawn up some months ago\" and deployment \"would only be after a ceasefire to support Ukraine's capabilities\". Ukraine latest - follow live It comes after Sir Keir and French President Emmanuel Macron held a meeting of the coalition of the willing in Paris on Tuesday. At the meeting, the two nations signed a joint declaration pledging to deploy troops to Ukraine in the event of a peace deal being agreed with Russia, to guarantee the nation's security. The agreement states a \"multinational force for Ukraine\" would be deployed to the eastern European country to deter further attacks from Russia and bolster security guarantees. Sir Keir had previously stated the UK might deploy troops to Ukraine following a peace deal, but the agreement now creates the legal framework for allowing British and French troops to operate there. As well as ensuring soldiers would be deployed on Ukrainian soil, the agreement also covers protection for Ukraine's skies and sea. Additionally, the declaration states the two countries would establish \"military hubs\" in Ukraine, so military equipment could be deployed for defensive needs. Sir Keir accused of being 'scared' Tory leader Kemi Badenoch criticised Sir Keir for not announcing the agreement in a formal statement to the House of Commons. She accused him of \"not wanting\" MPs to ask him questions and of being \"scared\". \"The last few days have seen significant international events - the US operation in Venezuela, threats towards Greenland and an agreement to put British troops on the ground in Ukraine - so it is frankly astonishing that the prime minister is not making a full statement to parliament today,\" Ms Badenoch said. She added that this showed a \"fundamental lack of respect\" for MPs and their constituents. Sir Keir replied there will be a statement to the Commons \"at the earliest opportunity\". Read more from Sky News:Bosses courted to join PM's China tripMP who tabled 342 questions in a day He also stressed MPs would get to debate the matter as part of the vote. \"If there were a decision to deploy, under the agreement that was signed yesterday, then I would put that matter to this House for a debate beforehand and for a vote on that deployment - that is consistent with recent practice and I'll adhere to that,\" he said."
    },
    {
        "title": "Cyber flashing just become a priority offence - here's what changes from today",
        "description": "Cyber flashing became illegal in 2024. Now, the government is making it a priority offence, putting the pressure on tech companies to do something about it.&#160;",
        "url": "https://news.sky.com/story/cyber-flashing-just-become-a-priority-offence-heres-what-changes-from-today-13491697",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-cyberflashing-bumble_7129509.jpg?20260107202454",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-07 19:48:00",
        "Headline": "By making cyber flashing a priority offence, the government is signalling to the regulator and tech firms that it takes this crime particularly seriously.",
        "Content": "\n          Science and technology reporter\n       Cyber flashing became illegal in 2024. Now, the government is making it a priority offence, putting the pressure on tech companies to do something about it.Â  Cyber flashing is when someone sends a non-consensual explicit picture - best known as a \"dick pic\". It's most often women on the receiving end and, according to research by dating app Bumble, the adults most likely to receive those images are women between 40 and 45 years old. That being said, it's an extremely common experience online, with one in three teenage girls saying they've received an unwanted sexual image, according to YouGov data. What changes now? Under the Online Safety Act, which began being fully enforced in July last year, online platforms have to make sure they're not hosting illegal content. If they are, they can be fined 10% of their revenue by Ofcom, the UK's communications regulator, or Â£18m, whichever is higher. By making cyber flashing a priority offence, the government is signalling to the regulator and tech firms that it takes this crime particularly seriously. \"The bar is much higher on what platforms need to do,\" said Kanishka Narayan, the minister for AI and online safety, to Sky News. Platforms like dating and social media apps will now need to do three things: ðŸž— Assess the risk of cyber flashing specificallyðŸž— Proactively take steps to prevent it, rather than reacting after it's happenedðŸž— Build safety features against cyber flashing into the design of their products Can tech firms actually stop cyber flashing? Cyber flashing isn't particularly hard to stop, from a technology point of view. Bumble has been filtering lewd messages since 2019 and open-sourced the technology four years ago. \"We trained it on a lot of data sets of both lewd, non-lewd images and that's how we've been able to achieve a model with about 98% accuracy,\" said Namrata Haribal, product manager for safety at Bumble. Read more technology news:Illegal child abuse material generated by GrokRobots with human-type capabilities are comingPorn users 'still seeing porn with no age checks' Almost all major platforms now have some sort of technology like this in place, designed to spot explicit images and intervene before they're seen by someone who doesn't want to see it. Mr Narayan insists the upgrading of cyber flashing to a priority offence is crucial, though. \"Whilst there's been a drop in cyber flashing as a result of it already being an offence under the Online Safety Act, by making it a priority offence, we want to stamp it out even further,\" he said. \"Because we also heard that despite the drop, there are still too many instances of women and girls in particular experiencing this.\" Will cyber flashing becoming a priority offence make a difference? The minister says yes, but Professor Clare McGlynn, professor of law at Durham University, isn't so sure. She's been campaigning for better cyber flashing rules for years. \"This is a very welcome first step,\" said Prof McGlynn to Sky News. \"But the most significant aspect is, Is it going to be enforced? That comes down to the regulator Ofcom.\" Rape pornography and non-consensual intimate imagery are also both priority offences, and yet both types of image abuse can still be found online, says Prof McGlynn. \"That's because the Online Safety Act and Ofcom have just not enforced it properly.\""
    },
    {
        "title": "New app will allow pupils to view GCSE results digitally from summer 2026",
        "description": "Year 11 pupils in England will soon be able to access their GCSE results on their phones, under government plans to modernise how exam records are stored and shared.",
        "url": "https://news.sky.com/story/new-app-will-allow-pupils-to-view-gcse-results-digitally-from-summer-2026-13491659",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-pupils-phone_7129375.jpg?20260107181913",
        "type": "Technology",
        "Author": "Anjum Peerbacos",
        "Date Published": "2026-01-07 17:57:00",
        "Headline": "The government says the app, the Education Record, will reduce reliance on paper certificates, which can be lost or damaged. ",
        "Content": "\n          Education reporter\n       Year 11 pupils in England will soon be able to access their GCSE results on their phones, under government plans to modernise how exam records are stored and shared. The Department for Education has announced the national rollout of a new app, the Education Record, which allows students to view their GCSE results digitally from summer 2026. This will make it easier for young people to enrol in further education or prove their qualifications to future employers. Under the plans, pupils will still attend school on results day to receive their grades in person from 9am. Results will then appear on the app later the same morning, from 11am. The government says the app will reduce reliance on paper certificates, which can be lost or damaged, and will give employers faster access to verified education records. Schools and colleges will also be able to see key information about incoming students, including whether they need to resit English or maths GCSEs, have special educational needs, or are eligible for free school meals. Skills minister Jacqui Smith said the new system would bring exam records \"into the 21st century\". \"This app gives young people instant access to their results whenever they need them, while freeing up teachers and college staff from unnecessary paperwork,\" she said. A good use of money? The Education Record app has already been piloted in parts of Greater Manchester and the West Midlands, where around 4,000 pupils at 29 schools accessed their GCSE results digitally last summer. Earlier technical pilots took place in Coventry and Oldham. Ms Smith told Sky News the app, which has cost Â£5.5m over the past two years, has \"been recognised and welcomed by the students and the schools and colleges\". But Robert Logan, principal at Hathershaw College in Oldham, where the pilot took place, said he would rather have money to repair his school building with \"bricks and mortar\" and \"train teachers to the highest possible standard, so children have the best educational outcomes\". Mr Logan also said he would like to see the SEND (special education needs and disabilities) funding gap addressed. Read more from Sky News:Storm Goretti to hitKevin Keegan diagnosed with cancer The app did pose some issues: students need to possess an appropriate smartphone - if the device is too old, the app cannot be downloaded. Students will also need to have the necessary data capability to download the app, which will also need to be downloaded by the college or sixth form. But Paul Whiteman, general secretary of school leaders' union NAHT, described the expansion as \"a sensible development\", adding that including post-16 qualifications in future could make the system even more useful. Schools and colleges are being encouraged to sign up to the Education Record system ahead of GCSE results day in August 2026. The Department for Education also is committed to increasing its funding for the condition of school and college buildings, investing Â£3bn per year by 2034-35."
    },
    {
        "title": "Illegal child abuse material generated by X's artificial intelligence Grok, says UK watchdog",
        "description": "Criminals have used Grok, Elon Musk's AI, to create child sexual abuse imagery, the Internet Watch Foundation (IWF) has reported.",
        "url": "https://news.sky.com/story/illegal-child-abuse-material-generated-by-xs-artificial-intelligence-grok-says-uk-watchdog-13491658",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-grok-xai_7129355.jpg?20260107175939",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-07 17:54:00",
        "Headline": "For days, the Internet Watch Foundation has received reports from internet users that Grok has created child abuse images, but that content hadn't crossed the threshold into illegal content. Now it has.",
        "Content": "\n          Science and technology reporter\n       Criminals have used Grok, Elon Musk's AI, to create child sexual abuse imagery, the Internet Watch Foundation (IWF) has reported. For days, the IWF has been receiving reports from internet users that Grok had created child abuse images, but that content hadn't crossed the threshold into illegal content. Now, it has, says the IWF. It is one of the few organisations around the world that is allowed to proactively track down child abuse material and found the material in a dark web forum. The users sharing the material boasted about how they'd used Grok to create it. \"Following reports that the AI chatbot Grok has generated sexual imagery of children, we can confirm our analysts have discovered criminal imagery of children aged between 11 and 13 which appears to have been created using the tool,\" said Ngaire Alexander, head of hotline at the IWF. X and xAI, both owned by billionaire Elon Musk, have come under fire in recent days after numerous users, mainly women, posted saying they'd seen AI-generated sexual images of themselves on X. \n                  Robots with human-type capabilities are coming this year, says Nvidia CEO\n                 \n                  Ofcom makes 'urgent contact' with X over concerns Grok AI can generate 'sexualised images of children'\n                 \n                  Is the AI bubble about to burst? If so the consequences could be dire\n                 Since the start of the new year, X users - mainly women - have reported that accounts have used Grok to generate images of them without clothing. There are also several cases where Grok has created sexualised images of children, according to analysis by news agency Reuters. Ms Alexander added: \"The imagery we have seen so far is not on X itself, but a dark web forum where users claim they have used Grok Imagine to create the imagery, which includes sexualised and topless imagery of girls. \"The imagery we have seen would be considered Category C imagery under UK law. \"The user then uses the Grok imagery as a jumping off point to create much more extreme, Category A, video using a different AI tool. The harms are rippling out. \"There is no excuse for releasing products to the global public which can be used to abuse and hurt people, especially children. Read more technology news:Robots with human-type capabilities are comingPorn users 'still seeing porn with no age checks' Both Ofcom and the Technology Secretary Liz Kendall have warned X to take action over the abusive imagery being created by its AI. Yesterday, Ms Kendall said: \"What we have been seeing online in recent days has been absolutely appalling, and unacceptable in decent society.\" \"X needs to deal with this urgently. It is absolutely right that Ofcom is looking into this as a matter of urgency and it has my full backing to take any enforcement action it deems necessary.\" In an interview with Sky News, the minister for AI and online safety, Kanishka Narayan, said the images being created by Grok were \"completely unacceptable\". He was asked whether the government was willing to risk its relationship with the Trump administration in order to fully enforce the UK's online safety rules against X. President Trump and his administration, as well as Elon Musk, have been vocal critics of the UK and EU authorities when they try to take action against US companies. \"The American president is as against child sexual abuse and violence against women and girls as I think that the British public and the British government is,\" said Mr Narayan. \"So that's the first thing to say. \"The second thing to say is that this is an area of domestic policy. We will continue to make sure that the public is kept safe from those egregious examples of both sexual abuse and sexual harassment online.\" On Wednesday, Mr Musk said a new version of Grok had been released and urged users to update their app, although it was not immediately clear what updates the new version contained. The tech tycoon has previously insisted that \"anyone using Grok to make illegal content will suffer the same consequences as if they uploaded illegal content\". X has said it takes action against illegal content, including child sexual abuse material, \"by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary\". Sky News has contacted X for comment."
    },
    {
        "title": "Mounjaro and Wegovy may need to be continued for life, new research suggests",
        "description": "The weight loss jabs Mounjaro and Wegovy may need to be continued for life to keep obesity under control, new research suggests.",
        "url": "https://news.sky.com/story/mounjaro-and-wegovy-may-need-to-be-continued-for-life-new-research-suggests-13491633",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2026-01-07 16:59:00",
        "Headline": "Almost two million British adults have used the weight loss jabs in the last year. The overwhelming majority are paying privately.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n The weight loss jabs Mounjaro and Wegovy may need to be continued for life to keep obesity under control, new research suggests. The finding will dismay people who are stretching their household finances to afford treatment, which can cost up to Â£300 a month depending on the dose and drug. Almost two million British adults have used the jabs in the last year. And the overwhelming majority are paying privately. According to the new research, around half of users stop treatment within a year. That's often because of side effects or cost. But it then takes an average of just one and a half years for people to put back on all the weight they've lost, results published in the British Medical Journal reveal. Professor Susan Jebb, an expert on diet and population health at the University of Oxford, told Sky News it suggests treatment may need to be long-term. \"Most people who are living with obesity, who have all that genetic and metabolic predisposition to gain weight, are going to need lifelong support of some kind,\" she said. \"Whether that's lifelong medication or whether it's medication at intervals combined with some other treatments, we just don't yet know. \"The big unanswered question is how do you help people keep the weight off. And that is a different process than is necessary for losing weight.\" Read more:Weight loss jabs conditionally backed to tackle obesity by WHO'Irresponsible' weight loss ads banned by watchdog Rosie Parsons lost eight stone while taking Wegovy, dropping from 19.5 stone to a little over 11 stone. But when her weight loss began to slow, she questioned the value of spending around Â£175 a month on the drug. She tried using Mounjaro, which is even more powerful, but the gastrointestinal side effects were too much. In the four months since stopping treatment she put on four stone - half of what she lost. \"I'm just trying to figure out what to do,\" she said. \"It's difficult when the price of everything has gone up so much as well. \"It probably does mean that I'll need to be on those drugs for life. But it's how to afford that because I can't get treatment through the NHS.\" Rosie still finds it reasonably straightforward to have a healthy diet during the day. But without the jabs, the sugar cravings return in the evening. Between 40% and 70% of the risk of obesity is determined by genetics. Inheriting the wrong genes doesn't make obesity inevitable, but it makes it harder to control weight - particularly when unhealthy food is cheap and abundant. How the weight loss drugs work isn't fully understood. They mimic gastric hormones and make people feel fuller for longer. But they also have an effect on the brain. The research shows that people put on weight four times faster after quitting the jabs than coming off a diet. Scientists say that may be because the biological switches that drive obesity are suddenly flicked back on when treatment with such powerful drugs is stopped. Sam West, another of the Oxford researchers, said: \"They're not a silver bullet, they don't fix it long-term. While you take them, they are incredibly effective. But when you stop taking them, the weight regain occurs rapidly.\""
    },
    {
        "title": "Robots with human-type capabilities are coming this year, says Nvidia CEO",
        "description": "Are the robots coming?",
        "url": "https://news.sky.com/story/robots-with-human-type-capabilities-are-coming-this-year-says-nvidia-ceo-13491412",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-robots-electronics-trade-show_7128711.jpg?20260107093122",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2026-01-07 08:57:00",
        "Headline": "Jensen Huang, one of the most powerful figures in global technology, promised the world will see \"some pretty amazing things\" this year.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n Are the robots coming? Jensen Huang certainly thinks so. \"This year,\" he replied, when I asked him when robots were going to have human-level capabilities. \"Because I know how fast the technology's moving. \"You're going to see some pretty amazing things,\" he told me. The CEO of Nvidia - possibly the most powerful figure in global technology - is not alone. There's a widespread feeling in tech that artificial intelligence is ready to escape the screen and enter the physical world. At the Consumer Electronics Show (CES), the world's biggest tech conference, there are robots everywhere you turn. Vacuum cleaner robots. Lawnmower robots. Farming robots. And lots and lots of humanoid robots - creepy or cool, depending on how you see these things (sometimes - often - both). Being the big trend of CES can be a curse. Many technologies hyped to the sky at the annual tech fair have failed to live up to their potential. And it is hard to match the experience of interacting with these robots to the unbridled optimism of figures like Huang. Many of the robots at CES are so basic they're not really robots at all, at least in the sense of being autonomous - as soon as anything gets even a little complicated, someone with a remote control rushes across to take over. That makes them little better than an extremely expensive toy. But the excitement about robotics isn't just hype because there is already a powerful, real example of a robot that has passed what you might call the physical Turing Test - that is, the moment when you can't tell the difference between human and machine. Self-driving cars are roaming the streets of several cities in the US, including the ones around CES, and will be brought to London in 2026. Roads might be a relatively controlled environment, but they are still extremely chaotic, and the risk of getting something wrong is enormous. If robots can handle that situation, the thinking goes, they should be ready for pretty much anything. A lot of the excitement in tech about robotics stems from that example, and from the growth in the capacities of generative AI. 'We have the brain to put inside the robots' If you can get the AI model to run on the device, they reckon you can effectively give the robot a generative AI brain. \"We finally have the core ingredient to build the missing piece of robots, which was the robot brain,\" says Rev Lebaredian, vice president of Omniverse and Simulation Technology at Nvidia. \"Once we could do that, then it started making sense to build the robot bodies, because we have the brain to put inside them.\" The movement of those robot bodies is improving very quickly too, as the techniques which enabled AI to read, write and talk seem to transfer over to physical interaction. It seems to many as if the core technological challenges of robotics have at last been cracked. \"I think in general, everybody who is in this industry, who is on the frontier of this research, believes we now have the basic ingredients to build everything we need for the kinds of robots we've been imagining,\" says Lebaredian. 'Robots will create jobs' There's a common consensus that the home is a step too far for robots at the moment. It's too messy, too potentially dangerous and consumers are too price-conscious. Instead, the focus for companies like Boston Dynamics - arguably the world's leading robotics company - is industry. \"We think you need to start on industry first,\" says Robert Playter, CEO of Boston Dynamics. \"We think it's going to be 2028, 2030 when we have robots deployed in factories and probably be five years after that before they're really affordable and in the home.\" Factories are a bit like roads - mostly controlled environments where the goals are very clear. So you can see the appeal for tech companies. Of course, the people who work in those factories will worry about their jobs. I asked Huang if that concerned him. \"Having robots will create jobs,\" he replied. \"We have a labour shortage in the world, not by one or 2,000 people, by tens of millions of people. And it's going to get worse because of population decline. \"And so, we need to have more, if you will, AI immigrants to help us in the manufacturing floors and do the type of work that maybe we decided not to do anymore.\" Read more: Humanoid machine performs real-world task Playter of Boston Dynamics agrees. \"What we've seen when we actually deploy robots with our customers - for example, we have a robot that unloads trailers. \"People are happy to get out of that job, and they'll go do some other job in the warehouse. They'll operate the robot. The people who were unloading the trailer now operate the robot. \"I think there's a huge opportunity to really let the robots do the truly dirty and dangerous stuff.\" Of course, no one can say for sure. But if robots improve in the way the tech industry expects, we might get to find out fairly soon."
    },
    {
        "title": "Nearly half of porn users are still seeing porn with no age checks, says survey",
        "description": "Almost half of pornography users have accessed adult sites without government-mandated age checks since the measure came into force, new research shows.",
        "url": "https://news.sky.com/story/nearly-half-of-porn-users-are-still-seeing-porn-with-no-age-checks-says-survey-13491347",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-laptop-internet_7128528.jpg?20260107011454",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-07 00:59:00",
        "Headline": "Campaigners have warned that adults who don't want to verify their identities to access porn are turning to riskier websites.",
        "Content": "Almost half of pornography users have accessed adult sites without government-mandated age checks since the measure came into force, new research shows. Since the law changed in July, 45% of 1,469 adults who use porn have gone on websites without age checks to avoid submitting their personal information, a poll by the Lucy Faithfull Foundation found. The research also showed that 29% of pornography users had used a VPN to avoid age checks on websites that do require them. A VPN - or virtual private network - can be used to mask a users' location, allowing them to connect to the internet as though they were in a different country. Now the charity is sounding the alarm, warning that adults who don't want to share their identity are turning to riskier sites where they are more likely to see child abuse images. Alexandra Bailey, the foundation's head of psychology and an associate professor at the University of Roehampton, said: \"These sites can expose people to harmful material, including illegal content depicting child sexual abuse. \"Even if you're not looking for it, you could encounter it - and that can have serious, life-changing consequences.\" The foundation, which aims to stop people viewing child abuse images, commissioned a survey of 3,724 adults in November. The survey showed 39% of the people that had visited unregulated porn sites had reported seeing content that made them uncomfortable, and 40% had been put off visiting the same site again. Rule changes introduced under the Online Safety Act (OSA) last year stipulate that porn websites should have strong age checks in place to stop children accessing harmful material. In December, Ofcom fined AVS group - which runs 18 adult websites - Â£1m for not having strong enough age checks, plus Â£50,000 for failing to respond to information requests. 'Even more robust' laws needed Now the Internet Watch Foundation is calling for even tougher rules to restrict access to adult material. Its chief executive, Kerry Smith, said it's \"highly concerning that age verification measures are not being implemented on certain platforms\". \"Safeguards on pornography sites are essential to protect children from accessing pornography, which we know, if viewed at a young age, can normalise harmful sexual behaviours and leave children more vulnerable to grooming from predators,\" she added. \"There needs to be strong enforcement of the OSA to ensure robust and meaningful safety measures are put in place on pornography platforms, including the use of deterrence messaging and signposting for adults to appropriate support services. \"We would also encourage the government to bring in even more robust legislation, so online pornography is treated just as it is in the offline world.\" Read more from Sky News:Trump announces Venezuela oil dealUS prepared to take Greenland militarily An Ofcom spokesperson said: \"Change is happening, and the tide on online safety is beginning to turn for the better. \"Last year saw important changes for people, with new measures across many sites and apps now better protecting UK users from harmful content, particularly children. \"But we need to see much more from tech companies this year, and we'll use our full powers if they fall short.\""
    },
    {
        "title": "Funeral held for French movie and style icon Brigitte Bardot",
        "description": "Brigitte Bardot's funeral has been held with a private service in Saint-Tropez.",
        "url": "https://news.sky.com/story/funeral-held-for-french-movie-and-style-icon-brigitte-bardot-13491465",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brigitte-bardot-funeral_7128802.jpg?20260107102836",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-07 10:48:00",
        "Headline": "The French film legend died on 28 December at the age of 91 at her home in Saint-Tropez in southern France.",
        "Content": "Brigitte Bardot's funeral has been held with a private service in Saint-Tropez. The French movie and style icon died on 28 December at the age of 91 at her home in the French Riviera resort, where she lived for more than half a century. Her husband, Bernard d'Ormale, revealed in an interview with Paris Match magazine that she had died from cancer after undergoing two operations. Crowds gathered along the streets and applauded as the late film star's coffin arrived at the Notre-Dame-de-l'Assomption Catholic Church. People again applauded as the coffin was driven through the streets after the funeral. The service was attended by family and guests, which included French far-right leader Marine Le Pen, who was pictured arriving at the church. Guests also included people invited to the funeral by the Brigitte Bardot Foundation for the protection of animals. In a speech at the service, Max Guazzini, a friend and secretary general of the foundation, said: \"All the animals she saved and she loved form a procession behind herâ€¦ thousands of animals say: Brigitte, we will miss you, we love you so much, thank you.\" In his interview released on Tuesday evening, Bardot's husband said the film legend had been \"conscious and concerned about the fate of animals until the very end\". Hundreds of people gathered in the coastal town to follow the farewell on large screens set up at the port and on two plazas. After the church service, Bardot was buried \"in the strictest privacy\" at a cemetery overlooking the Mediterranean Sea, according to the Saint-Tropez town hall. A public homage was also held at a nearby site in Saint-Tropez. Bardot's renowned sex symbol status was set in stone in 1956 with her portrayal of a rebellious teenager in And God Created Woman. Directed by her then-husband Roger Vadim and in line with the sexual liberation of the age, the movie featured Bardot dancing naked on tables, captivating audiences and scandalising censors in equal measure. Read more from Sky News:Timothee Chalamet among winners at Critics Choice AwardsHollywood star says he isn't behind $100k fundraiser She became a global icon and starred in more than 40 films. But she turned away from public life in 1973, aged 39, and gave her attention to animal rights, calling it her \"only battle\"."
    },
    {
        "title": "Lawyer for Rob Reiner's son withdraws from case",
        "description": "The arraignment of Rob Reiner's son over the killing of his parents has been delayed after his high-profile defence lawyer withdrew from the case.&#160;",
        "url": "https://news.sky.com/story/lawyer-for-rob-reiners-son-withdraws-from-case-13491699",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-reiner-actor_7112544.jpg?20251217002123",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-07 19:50:00",
        "Headline": " Nick Reiner's arraignment has been delayed until February after his lawyer, Alan Jackson, withdrew from the case due to \"circumstances beyond our control\". Reiner is now represented by a public defender.",
        "Content": "The arraignment of Rob Reiner's son over the killing of his parents has been delayed after his high-profile defence lawyer withdrew from the case.Â  A judge agreed to Alan Jackson's request to exit the case during a Los Angeles Superior Court hearing on Wednesday, at which Nick Reiner, 32, was expected to be arraigned and enter a plea. The hearing took place roughly three weeks after actor-director Rob Reiner and his wife of 36 years, Michele Singer Reiner, were found dead with stab wounds in their upscale home in Los Angeles. Mr Jackson said \"circumstances beyond our control' were behind the move, without providing specifics. He said he is \"legally and ethically prohibited from explaining all the reasons\" behind his decision, adding he expects Reiner's public defender to \"step in and very capably protect Nick Reiner's interests\". \"We know the legal process will reveal the true facts of the circumstances surrounding this case,\" Mr Jackson said. Deputy public defender Kimberly Greene has now taken over as Nick Reiner's lawyer, and the judge has delayed the arraignment until 23 February. \n                  Trump latest: UK involved in US seizure of oil tanker in North Atlantic - as Russia sends warning\n                 \n                  Tracking the sanctioned oil tanker's attempt to escape seizure by the US \n                 \n                  What we know about 'ghost fleet' oil tankers seized by US - as Russia responds\n                 Ms Greene said she spoke to Reiner briefly on Wednesday morning to alert him of the change in his counsel. She said Reiner was \"understanding\" of the situation. During a brief court appearance, Reiner spoke only to agree to the delay. He stood behind glass in a custody area of the courtroom, wearing a brown jail suit with his hair shaved. At one point, Reiner stood on his tiptoes to peek over the lawyers' heads and look at the audience. Read more from Sky News:Football legend Kevin Keegan diagnosed with cancerStorm Goretti to hit with more heavy snow Nathan Hochman, district attorney for Los Angeles County, said his office will ensure Reiner's new lawyer receives \"all the facts necessary to effectively represent their client\". \"I'm fully confident that a jury will convict Nick Reiner beyond reasonable doubt of the brutal murder of his parents... and do so unanimously.\" Mr Hochman said the charges against Reiner carry a maximum sentence of the death penalty. Execution is a legal punishment in several US states, including California, where Nick Reiner was arrested and will be tried. The Reiner family released a statement following the change of legal representation. A spokesperson said: \"They have the utmost trust in the legal process and will not comment further on matters related to the legal proceedings.\" Rob Reiner, 78, and wife Michele Singer Reiner, 70, were killed early on the morning of 14 December in their home in the upscale Brentwood section of Los Angeles. Authorities said they were found in the late afternoon and died from \"multiple sharp force injuries\". Before picking up the Reiner case, Alan Jackson had represented high-profile clients, including convicted sex offender Harvey Weinstein during his 2022 trial. Mr Jackson also defended Kevin Spacey in a 2019 sexual assault case, in which the actor faced allegations of groping an 18-year-old man. The charges were subsequently dropped by prosecutors."
    }
]