[
    {
        "title": "Powerful 8.8-magnitude earthquake causes tsunami in Russia's Far East - with warnings issued for Japan, Hawaii and Alaska",
        "description": "A powerful 8.8-magnitude earthquake has struck off Russia's far eastern Kamchatka Peninsula, causing a tsunami.",
        "url": "https://news.sky.com/story/powerful-87-magnitude-earthquake-causes-tsunami-in-russias-far-east-with-warnings-issued-for-japan-hawaii-and-alaska-13403770",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-japan-tsunami_6977425.png?20250730030455",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-29 21:07:00",
        "Headline": "No subtitle found",
        "Content": "A powerful 8.8-magnitude earthquake has struck off Russia's far eastern Kamchatka Peninsula, causing a tsunami. A tsunami of up to four metres (13 feet) was recorded in Kamchatka Peninsula, leading to evacuations and damaging buildings, officials said. Tsunami warnings have been issued for Japan, the Philippines, Hawaii and parts of Alaska in the US. The Honolulu Department of Emergency Management in Hawaii has called for the evacuation of some coastal areas, writing on X: \"Take Action! Destructive tsunami waves expected.\" Kamchatka Governor Vladimir Solodov had earlier said: \"Today's earthquake was serious and the strongest in decades of tremors.\" Several people in the region sought medical assistance following the quake, Oleg Melnikov, regional health minister told Russia's Tass state news agency. \"Unfortunately, there are some people injured during the seismic event. Some were hurt while running outside, and one patient jumped out of a window. A woman was also injured inside the new airport terminal,\" Mr Melnikov said. Russia's Tass news agency reported from the biggest city nearby, Petropavlovsk-Kamchatsky, that many people ran out into the street, while cabinets toppled inside homes, mirrors were broken, cars swayed on roads and balconies on buildings shook noticeably. Power outages and mobile phone service failures were also reported in the capital of the Kamchatka region. A regional branch of Russia's geophysical service has said that \"significant, noticeable\" aftershocks with magnitudes of up to 7.5 after expected to continue for at least another month. Japan issued a tsunami warning, saying it expects waves as high as three metres to arrive along large coastal areas along the Pacific Ocean. It has ordered the evacuation of some areas. The National Tsunami Warning Center, based in Alaska, issued a tsunami warning for parts of the Alaska Aleutian Islands. A tsunami warning also was extended to the US state of Hawaii, with the National Weather Service's Pacific Tsunami Warning Center saying a tsunami from the quake had been generated that could cause damage along the coastlines of all the Hawaiian islands. A tsunami \"watch\" was issued for portions of the West Coast, including California, Oregon, and Washington. The US Geological Survey said the earthquake was shallow at a depth of 19.3 km (12 miles), and was centred about 125 km (80 miles) east-southeast of Petropavlovsk-Kamchatsky, a city of 165,000 along the coast of Avacha Bay. It revised the magnitude up twice from 8.0 and 8.7 to 8.8 earlier. Meanwhile, New Zealand's disaster management agency has warned that the country's coastal areas could expect \"strong and unusual currents and unpredictable surges at the shore\". In a national advisory alert, Civil Defence New Zealand said there was no immediate need to evacuate but said citizens should stay away from beaches and shore areas. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Trump claims Epstein 'stole' Prince Andrew accuser Virginia Giuffre from his Mar-a-Lago resort",
        "description": "Donald Trump has claimed billionaire paedophile Jeffrey Epstein \"stole\" prominent accuser Virginia Giuffre and other young women from his Mar-a-Lago resort in Florida.",
        "url": "https://news.sky.com/story/trump-claims-epstein-stole-prince-andrew-accuser-virginia-giuffre-from-his-mar-a-lago-resort-13403791",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/37bea1abcc33a8e39ce42e8d0bc25548c490d7a08c49bd761eb8b6c1b3b25461_6972827.jpg?20250730030740",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-29 22:08:00",
        "Headline": "The US president has made the remarks after facing growing pressure in recent weeks to release files related to the Epstein case.",
        "Content": "Donald Trump has claimed billionaire paedophile Jeffrey Epstein \"stole\" prominent accuser Virginia Giuffre and other young women from his Mar-a-Lago resort in Florida. Ms Giuffre became a household name after she sued Prince Andrew for sexual abuse in August 2021 - saying he had sex with her when she was 17 and had been trafficked by his friend Epstein. Prince Andrew reached an out-of-court settlement with Ms Giuffre but has repeatedly denied the claims and has not been charged with any criminal offences. Mr Trump made his remarks about Ms Giuffre as his administration has faced growing pressure in recent weeks, including from within his \"MAGA\" base, to release files related to Epstein after he promised to do so during his 2024 presidential campaign. The US president was speaking to reporters on Tuesday when he was asked about comments he made over the weekend about a falling-out with Epstein over employees taken from his business. \"He took people that worked for me. And I told him, 'Don't do it anymore.' And he did it,\" Mr Trump told reporters while on board Air Force One as he returned to the US from Scotland. \"I said, 'Stay the hell out of here',\" the US president added. Pressed about whether any of the employees he referred to were young women, Mr Trump said many of them worked in the spa at Mar-a-Lago. \"The answer is yes, they were in the spa,\" he said. \"I told him, I said, 'Listen, we don't want you taking our people, whether it was spa or not spa.' ... And he was fine. And then not too long after that, he did it again.\" Asked if Ms Giuffre was one of the employees poached by Epstein, the US president replied: \"I think she worked at the spa... I think so. I think that was one of the people. He stole her, and by the way, she had no complaints about us, as you know, none whatsoever.\"  The White House said in a statement last week that Mr Trump banned Epstein from Mar-a-Lago because he was acting like a \"creep\". Epstein took his own life in a Manhattan prison cell in August 2019 as he awaited trial on sex trafficking charges. On Tuesday, lawyer's for his former girlfriend Ghislaine Maxwell, who is serving 20 years in prison for recruiting young girls for the financier, said that they are open to her answering more questions from US Congress if she is granted immunity from future prosecution. However a spokeswoman for the House Oversight Committee, which requested the interview with Maxwell, said the panel would not consider granting the immunity she requested. The former British socialite was interviewed inside a Florida courthouse by US Deputy Attorney General Todd Blanche last week. Officials have not publicly disclosed what she said. Mr Blanche had earlier said that Maxwell would be interviewed because of Mr Trump's directive to gather and release any credible evidence about others who may have committed crimes in relation to the Epstein case. Separately, Maxwell's lawyers have urged the Supreme Court to review her conviction, saying she did not receive a fair trial. They also say that one way she would testify \"openly and honestly, in public\", is in the event of a pardon by Mr Trump, who has told reporters that such a move is within his rights but that he has not been not asked to make it. What had Ms Giuffre said about Mar-a-Lago? Ms Giuffre, who took her own life in April, claimed Maxwell spotted her while she was working as a spa attendant at Mar-a-Lago when she was a teenager in 2000. She added that Maxwell hired her as Epstein's masseuse, which led to sexual abuse. She accused Epstein of pressuring her into having sex with powerful men. Why is the Epstein case such a problem for Trump? Rumours have circulated since Epstein's death about who he may have supplied underage girls to and who visited his private island. Some of those rumours quickly spiralled into conspiracy theories, which Mr Trump fanned the flames of during his campaign for a second term. Mr Trump promised to release more Epstein files to the public if he was elected president for a second time - but is now facing a backlash from his voter base after carrying out a complete U-turn on the move."
    },
    {
        "title": "Starmer's plan to recognise Palestinian state labelled 'appeasement towards jihadist terrorists' by Netanyahu",
        "description": "Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu.",
        "url": "https://news.sky.com/story/starmers-plan-to-recognise-palestinian-state-labelled-appeasement-towards-jihadist-terrorists-by-netanyahu-13403756",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-food-aid_6976538.jpg?20250729081053",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-29 20:37:00",
        "Headline": "The prime minister's plan was welcomed by some, while he was accused by others of pandering to his MPs and France.",
        "Content": " Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu. The prime minister said the UK will recognise a Palestinian state by September unless Israel takes \"substantive steps\" to end the situation in Gaza, Israel agrees to a ceasefire, commits to a long-term sustainable peace, allows the UN to restart aid supplies and does not annexe the West Bank. About 250 MPs from all parties - half of them Labour - had signed a letter last week calling for Sir Keir to immediately recognise a Palestinian state. Politics latest: PM's Palestine plan labelled 'absurd' Sir Keir said that by giving Israel a deadline of 9 September UN meeting, he hoped this would play a part \"in changing the conditions on the ground, and making sure aid gets into making sure that there is hope of a two-state solution for the future\". But Mr Netanyahu condemned the plan, saying Sir Keir \"rewards Hamas's monstrous terrorism and punishes its victims\". \"A jihadist state on Israel's border today will threaten Britain tomorrow,\" he wrote on X. \n                  What does recognising a Palestinian state mean?\n                 \n                  Sir Keir Starmer's significant breakthrough on Gaza won't please everyone\n                 \n                  UK to recognise Palestine as a state in September - unless Israel meets conditions\n                 \"Appeasement towards jihadist terrorists always fails. It will fail you too. It will not happen.\" The Israelis also accused Sir Keir of pandering to his MPs and France, after Emmanuel Macron committed to recognising a Palestinian state last week, and harming efforts to release Israeli hostages. Lib Dems and Greens: 'Bargaining chip' Sir Keir also faced accusations of using Palestinian state recognition as a \"bargaining chip\" by both the Lib Dems and the Green Party. Lib Dem leader Sir Ed Davey said a Palestinian state should have been recognised \"months ago\" and \"far greater action\" is needed to stop the humanitarian disaster in Gaza. Green Party foreign affairs spokesperson Ellie Chowns, who wants immediate state recognition, said it was a \"cynical political gesture\". Humza Yousaf, Scotland's former SNP first minister, who revealed a family member was killed in Gaza days ago, told Sky News statehood \"shouldn't be dependent\" upon the conditions Sir Keir has set for Israel, but is the \"inalienable right\" of the Palestinian people. The British Palestinian Committee, representing Palestinian interests in the UK, described conditions as \"absurd and performative\". UK Jewish groups seek clarity The Board of Deputies of British Jews, the UK's largest Jewish organisation, said it was \"seeking urgent clarification\" that the UK will not recognise Palestine as a state if Israeli hostages remain in Hamas captivity, or if Hamas keeps rejecting a ceasefire deal. The Labour Friends of Israel group said it has \"shared goals\" with the government but state recognition \"will be a merely symbolic act unless the UK uses its influence to establish the principles of a meaningful pathway to a Palestinian state\". Read more: What does recognising a Palestinian state mean?Children 'eating out of piles of garbage' as time runs out for Gaza Sarah Champion, Labour MP and chair of the international development committee, who started the MP letter calling for state recognition, said she was \"delighted and relieved\". However, she added: \"I'm troubled our recognition appears conditional on Israel's actions.\" When Foreign Secretary David Lammy announced the plan at a UN meeting, he received applause. Not many other Labour MPs commented. Tories accuse Starmer of appeasing MPs Conservative leader Kemi Badenoch accused Sir Keir of being more focused on a \"political problem for the Labour Party\" than other issues facing the UK. \"Recognising a Palestinian state won't bring the hostages home, won't end the war and won't get aid into Gaza,\" she posted on X. \"This is political posturing at its very worst.\" Tory shadow foreign secretary Priti Patel said the announcement was \"to appease his backbenchers\" as \"he knows that promises to recognise Palestine will not secure lasting peace\". Trump did not discuss statehood with Starmer Donald Trump said he and Sir Keir \"never did discuss\" the PM's plan to recognise a Palestinian state during their meetings in Scotland the day before.  However, Tammy Bruce, spokeswoman for the US state department, said Sir Keir's plan is a \"slap in the face for the victims of October 7\", which \"rewards Hamas\", the Telegraph reported."
    },
    {
        "title": "CTE: Brain disease linked to head impacts in sport 'could have contributed' to Manhattan mass shooting",
        "description": "The man who shot dead four people inside a New York City skyscraper had left a note claiming he had CTE, a brain disease that has been linked to American football.",
        "url": "https://news.sky.com/story/cte-brain-disease-linked-to-head-impacts-in-sport-could-have-contributed-to-manhattan-mass-shooting-13403633",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-cte-nfl-martha-kelner_6460529.jpg?20240218181610",
        "type": "Home",
        "Author": "Martha Kelner",
        "Date Published": "2025-07-29 16:43:00",
        "Headline": "An expert tells Sky News a link between CTE and violent crime can't be ruled out after a man who shot dead four people left a note saying he wanted his brain studied for the condition.",
        "Content": "\n          US correspondent\n              @marthakelner\n  The man who shot dead four people inside a New York City skyscraper had left a note claiming he had CTE, a brain disease that has been linked to American football. It's believed the gunman, 27-year-old Shane Tamura, was targeting the headquarters of the NFL but took the wrong lift. The NFL occupies floors five to eight in the skyscraper - but Tamura ended up on floor 33. He had driven from Las Vegas, almost the breadth of the country, to reach 345 Park Avenue, in the heart of midtown Manhattan. CTE can only be diagnosed by studying the brain after death, but in a three-page note discovered by police, Tamura made repeated references to the condition. In his note, which was written on notepad paper and using a variety of ink, he writes: \"CTE study my brain please. I'm sorry.\" And again: \"Please study brain for CTE. I'm sorry.\" \n                  Powerful 8.8-magnitude earthquake causes tsunami in Russia's Far East - with warnings issued for Japan, Hawaii and Alaska\n                 \n                  Trump claims Epstein 'stole' Prince Andrew accuser Virginia Giuffre from his Mar-a-Lago resort\n                 \n                  Sean 'Diddy' Combs asks judge to release him on $50m bond as he awaits sentencing\n                 He also refers to Terry Long, a former NFL player who starred for the Pittsburgh Steelers. He was diagnosed with CTE after drinking anti-freeze to take his own life 20 years ago. Of course, there can be no conceivable justification to commit such a horrific act. But the attacker's note will bolster calls for more investigation into a possible link between head injuries on the football field and violent crime. Tamura never played for the NFL but had a very successful high school career in Southern California and was well liked by his coaches and teammates.  It's not known what he did after high school, however he seemed to harbour animosity towards the NFL. \"The league knowingly concealed the dangers to our brains to maximize profits,\" he writes in his note. \"They failed us.\" A Sky News investigation last year explored the link between CTE and violent attacks, including mass murder. We looked at the case of Noah Green, who was 25 when he crashed into a security cordon protecting the Capitol Building in Washington DC and stabbed police officer William Evans, killing him, before he was shot dead. It was a murder which seemed to have little to do with American football.  But Green's mother, Mazie, told me she believes his crime was caused by brain injuries sustained on the American football field. He had been a star player in high school but she said his personality changed after repeated concussions. \"He started these bad headaches. Real bad headaches,\" she said \"He's like, 'I've got to get out of the country. They're going to kill me'.\" Mazie believes Noah was suffering paranoia. After his death, the FBI recommended that his brain be examined. The diagnosis came back as stage 1 Chronic Traumatic Encephalopathy, or CTE. It is a disease caused by repetitive head trauma. Symptoms include paranoia, aggression and impulse control problems. The theory of a link between CTE and violent crime is increasingly cited in court. Kellen Winslow, a former NFL player, argued for his sentence for multiple rapes to be reduced because of head trauma on the football field. Former San Francisco 49ers star Phillip Adams shocked the country when he shot dead six people, including grandparents and their two grandchildren, then himself, in 2021. He had severe CTE. Read more from Sky News:Manhunt after couple hiking with kids killed in ArkansasOzzy Osbourne cortege to travel through Birmingham Brain banks, including the National Sports Brain Bank in Pittsburgh, ask former footballers to donate their brains for study after death. Dr Julia Kofler told me she can't rule out a link between CTE and violent crime. \"It's really difficult to draw any conclusions about what motivates someone to commit a crime based just on their pathology,\" she said. \"We certainly know that neurodegenerative diseases can cause all sorts of different, behavioural changes and changes in executive function and judgment. So it certainly could have contributed.\" The horrific mass murder committed by Shane Tamura, coupled with ramblings about CTE in the note he left behind, will intensify calls for further scrutiny of safety precautions that might be taken in contact sports."
    },
    {
        "title": "Father and son named as victims in central London stabbing",
        "description": "Two men stabbed to death at a business premises in central London were father and son, say police.",
        "url": "https://news.sky.com/story/father-and-son-named-as-victims-in-central-london-stabbing-13403755",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-long-lane-southwark_6976930.jpg?20250729134502",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-29 20:37:00",
        "Headline": "Officers also confirm a 31-year-old man has been arrested on suspicion of murder and is currently in hospital.",
        "Content": "Two men stabbed to death at a business premises in central London were father and son, say police. Terry McMillan, 58, from Chislehurst, Bromley, was pronounced dead at the scene and Brendan McMillan, 27, died in hospital. Three other men were taken to hospital. The attack happened around 1pm on Monday at a property in Long Lane, an east-west road in Southwark that leads to Borough station. A 31-year-old man was arrested on suspicion of murder. Police say he remains in hospital and his condition is not life threatening. Old Colfeians Rugby Club, based in Eltham, called Brendan McMillan a \"member of our family\" and said his father was a \"long-time supporter and sponsor of the club\". It called Brendan \"one of the kindest, funniest, most genuine people you could ever meet\" who was \"forever smiling, always cracking a joke and always full of life\". Terry McMillan set up a property and investment company in 1998, according to The McMillan Family Trust, a charity that helps children from underprivileged backgrounds. Read more from Sky News:Five boys arrested on suspicion of attempted murderPolice investigate Tommy Robinson video after assault claims A police statement on Tuesday added: \"The incident took place in a business premises and a crime scene is in place at a nearby hotel where the arrested man went into. \"We are aware of speculation the man was staying at the hotel, this is not the case.\""
    },
    {
        "title": "Police investigate assault as video appears to show Tommy Robinson at station",
        "description": "Police investigating an alleged assault at St Pancras station in London are looking to bring a 42-year-old man into custody.",
        "url": "https://news.sky.com/story/police-investigate-assault-as-video-appears-to-show-tommy-robinson-at-station-13403457",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tommy-robinson-court_6956041.jpg?20250703103257",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-29 13:46:00",
        "Headline": "It comes after footage emerged purporting to show right-wing activist Tommy Robinson walking back and forth next to a man lying motionless at St Pancras.",
        "Content": "Police investigating an alleged assault at St Pancras station in London are looking to bring a 42-year-old man into custody. British Transport Police said the suspect, from Bedfordshire, boarded a flight out of the country in the early hours of Tuesday morning. Officers were called to the scene just after 8.40pm on Monday following reports of an assault. A man was taken to hospital with serious injuries which are not thought to be life-threatening. \"Detectives are continuing to work closely to progress the investigation and bring the man into custody for questioning,\" a statement reads. It comes after footage emerged purporting to show right-wing activist Tommy Robinson walking back and forth next to a man lying motionless at St Pancras. A concerned onlooker calls for help before Robinson shouts: \"You saw him. He came at me bruv, you saw that, he came at me\". \n                  Tommy Robinson due to be released from prison in days after sentence reduced\n                 \n                  Tommy Robinson loses Court of Appeal challenge against prison sentence\n                 \n                  Tommy Robinson loses bid to challenge prison segregation in High Court\n                 The video does not show the moment the man was allegedly attacked. Read more from Sky News: Ozzy Osbourne cortege to travel through BirminghamTeenage girl dies after being pulled from the sea Robinson, whose real name is Stephen Yaxley-Lennon, has since reposted a tweet which claimed he acted in self-defence. A London Ambulance Service spokesperson said: \"We were called at 8.40pm on Monday July 28 to reports of an assault at St Pancras International Rail Station, NW1. \"We sent an ambulance crew to the scene and treated a man before taking him to a major trauma centre.\" Sky News has approached Robinson for comment."
    },
    {
        "title": "Five boys arrested on suspicion of attempted murder after 14-year-old stabbed in Newham",
        "description": "Five boys have been arrested on suspicion of attempted murder after a teenager was stabbed in east London. ",
        "url": "https://news.sky.com/story/five-boys-arrested-on-suspicion-of-attempted-murder-after-stabbing-of-teenager-in-newham-13403581",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-newham-stabbing-charlemont-road_6977294.jpg?20250729202535",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-29 15:02:00",
        "Headline": "Anyone with dashcam or mobile phone footage that may be helpful is asked to contact Metropolitan Police.",
        "Content": "Five boys have been arrested on suspicion of attempted murder after a teenager was stabbed in east London.  Police were called at 4pm on Saturday to reports of a stabbing in Charlemont Road, Newham. A 14-year-old boy was taken to hospital with serious injuries and remains in a life-threatening condition. Four of the boys - who are aged 14-17 - remain in custody and one has been released on bail. Detective Inspector Joshua Palmer, from Metropolitan Police, said: \"This was a horrific attack on a teenager, witnessed by numerous members of the public. \"At this very early stage of the investigation, there doesn't appear to be an obvious motive for the attack. \"We are urgently trying to gather as much information as possible. \n                  Father and son named as victims in central London stabbing\n                 \n                  Man arrested on suspicion of murder after stabbing at London business\n                 \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \"If you were near Charlemont Road on the day of the incident, please check your phone for any footage you may have. \"I would urge anyone with dashcam or mobile phone footage from the area to contact the police. It may be crucial in our investigation.\" Read more from Sky News:Police investigate Tommy Robinson video over assault claimsHundreds of thousands protest against internet safety rules Anyone with information is asked to call 101 - or to remain anonymous contact Crimestoppers on 0800 555 111."
    },
    {
        "title": "English cricket goes into bat with bulk of £520m Hundred windfall",
        "description": "English cricket's governing body will on Wednesday hail a landmark moment for the sport when it announces that three-quarters of the deals to bring in new investors to The Hundred have been completed.",
        "url": "https://news.sky.com/story/english-cricket-goes-into-bat-with-bulk-of-163520m-hundred-windfall-13403654",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-the-hundred-cricket_6828032.jpg?20250729193438",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-29 17:35:00",
        "Headline": "The ECB will announce on Wednesday that six of the eight Hundred franchise stake sales have been completed days before the 2025 tournament gets under way, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n English cricket's governing body will on Wednesday hail a landmark moment for the sport when it announces that three-quarters of the deals to bring in new investors to The Hundred have been completed. Sky News understands that the England and Wales Cricket Board (ECB) plans to issue a statement confirming that it has received proceeds from the sale of stakes in Birmingham Phoenix, London Spirit, Manchester Originals, Northern Superchargers, Southern Brave and Welsh Fire. The two other franchise deals - involving the Oval Invincibles and Nottinghamshire's Trent Rockets - will be completed on October 1, the ECB is expected to say. One insider said a statement was likely to be issued on Wednesday, although they cautioned that the timing could slip. When all eight deals are concluded, they will generate a collective windfall of £520m for the sport's strained coffers. Last week, Sky News revealed that unresolved talks between India's richest family and Surrey County Cricket Club - which hosts the Oval Invincibles Hundred team - were threatening to delay the delivery of a vast windfall for the sport. One of the outstanding issues relates to the name under which the Oval Invincibles will play in future years, with the Ambani family keen to use a derivative of the Mumbai Indians brand that it also owns. \n                  The Hundred: Steve Smith to play in 2025 but Ben Stokes opts out; Meg Lanning and Rashid Khan will also play\n                 \n                  Microsoft and Google chiefs in £295m deal for London Spirit Hundred\n                 \n                  Cricket chiefs stage live 'super-over' shootout for Hundred stakes\n                 This week's announcement will come after months of talks after the ECB and the eight Hundred-playing counties agreed exclusivity periods with their preferred investors. The backers include some of the world's most prominent financiers, billionaires and technology executives. Following protracted talks, the ECB has agreed to revised terms with the investors, with host venues now retaining control of their teams' intellectual property rights. The investors will also hold an effective veto over future expansion of the Hundred, while the ECB will be barred from launching any other short-form professional version of the sport while the Hundred remains operational. Meanwhile, the governing body will retain full ownership of the competition itself as well as controlling the regulation of it and the window within which it can be played each year. The ECB has been waiting for investors in the eight franchises to sign participation agreements since an auction in February, which valued the participating teams at just over £975m. Some of the deals involve the investors owning 49% of their respective franchise, while India's Sun TV Network has taken full ownership of Yorkshire's Northern Superchargers. The proceeds of its stake sales will be distributed to all of English cricket's professional counties as well as £50m being delivered to the grassroots game. The windfalls are being seen as a lifeline for many cash-strapped counties which have been struggling under significant debt piles for many years. The most valuable Hundred sale saw a group of technology tycoons, including executives from Google and Microsoft, paying about £145m for a 49% stake in Lord's-based London Spirit. This year's tournament kicks off next week with fixtures including a clash between the two London-based franchises. The ECB declined to comment."
    },
    {
        "title": "Minister 'weaponising' Savile will make Labour MPs queasy - but there's a bigger risk",
        "description": "Sometimes governments blindly idle into political fights and sometimes they go windmilling in with purpose.",
        "url": "https://news.sky.com/story/minister-weaponising-savile-will-make-labour-mps-queasy-but-theres-a-bigger-risk-13403669",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/b01eb9d2fc329cc13875ddcd5c21bb3e89e37630cfdfd540ce9ae0e49231a35d_6976607.jpg?20250729144125",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-07-29 18:13:00",
        "Headline": "The last politician to invoke Jimmy Savile was Boris Johnson when he accused Sir Keir Starmer of failing to investigate him when he headed the CPS. The episode led to the resignation of Mr Johnson's top policy aide.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Sometimes governments blindly idle into political fights and sometimes they go windmilling in with purpose. The extraordinary row picked by Peter Kyle on Sky News on Tuesday is most definitely the latter of these two. The science secretary's reference to Jimmy Savile was no slip of the tongue. Ministers seem to believe Reform UK has made a misjudgement in pledging to scrap internet safety laws, given the massive unease across the country about what children are viewing online. As a result, Kyle is trying to point at their position by stoking a spat with (some would say) inflammatory language that sucks up media attention. It's not exactly a new technique. Think back to 2023 and Labour did something very similar when it ran attack ads accusing Rishi Sunak of not wanting to lock up child abusers - in a bid to draw attention to the criminal justice system. Go even further back, and it's essentially the same strategy employed on the red Brexit bus in 2016 with its pledge to divert money from the EU to the NHS. All heavily disputable claims that are made to start a row and move the spotlight on to a politically convenient topic. But the risk inherent in tactics like this is that it makes some on your own side feel a little icky. The last politician to invoke Jimmy Savile as part of a political attack was Boris Johnson when he accused Sir Keir Starmer of failing to investigate the serial child abuser when he was the country's head prosecutor. That led to the resignation of the then prime minister's top policy aide. Read more from Sky News:Police investigate Tommy Robinson video over assault claimsHow Corbyn's party is preparing to take on Labour There will be plenty in Labour who feel similarly queasy about a cabinet minister weaponising one of the country's most notorious paedophiles to lay into an opposition party. The bigger risk though is whether Peter Kyle will really emerge victorious from this fight. Nigel Farage is going for the Online Safety Act in part because it fits with his party's narrative around mainstream politics trying to silence the concerns of ordinary people. Those disenfranchised sections of society are a key group of voters that Reform are trying to reach. Whether they are outweighed by those put off the party by its recent pronouncements remains to be seen. But for now, this seems to be a fight that Nigel Farage is also keen to have."
    },
    {
        "title": "Starmer's plan to recognise Palestinian state labelled 'appeasement towards jihadist terrorists' by Netanyahu",
        "description": "Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu.",
        "url": "https://news.sky.com/story/starmers-plan-to-recognise-palestinian-state-labelled-appeasement-towards-jihadist-terrorists-by-netanyahu-13403756",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-food-aid_6976538.jpg?20250729081053",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-29 20:37:00",
        "Headline": "The prime minister's plan was welcomed by some, while he was accused by others of pandering to his MPs and France.",
        "Content": " Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu. The prime minister said the UK will recognise a Palestinian state by September unless Israel takes \"substantive steps\" to end the situation in Gaza, Israel agrees to a ceasefire, commits to a long-term sustainable peace, allows the UN to restart aid supplies and does not annexe the West Bank. About 250 MPs from all parties - half of them Labour - had signed a letter last week calling for Sir Keir to immediately recognise a Palestinian state. Politics latest: PM's Palestine plan labelled 'absurd' Sir Keir said that by giving Israel a deadline of 9 September UN meeting, he hoped this would play a part \"in changing the conditions on the ground, and making sure aid gets into making sure that there is hope of a two-state solution for the future\". But Mr Netanyahu condemned the plan, saying Sir Keir \"rewards Hamas's monstrous terrorism and punishes its victims\". \"A jihadist state on Israel's border today will threaten Britain tomorrow,\" he wrote on X. \n                  What does recognising a Palestinian state mean?\n                 \n                  Sir Keir Starmer's significant breakthrough on Gaza won't please everyone\n                 \n                  UK to recognise Palestine as a state in September - unless Israel meets conditions\n                 \"Appeasement towards jihadist terrorists always fails. It will fail you too. It will not happen.\" The Israelis also accused Sir Keir of pandering to his MPs and France, after Emmanuel Macron committed to recognising a Palestinian state last week, and harming efforts to release Israeli hostages. Lib Dems and Greens: 'Bargaining chip' Sir Keir also faced accusations of using Palestinian state recognition as a \"bargaining chip\" by both the Lib Dems and the Green Party. Lib Dem leader Sir Ed Davey said a Palestinian state should have been recognised \"months ago\" and \"far greater action\" is needed to stop the humanitarian disaster in Gaza. Green Party foreign affairs spokesperson Ellie Chowns, who wants immediate state recognition, said it was a \"cynical political gesture\". Humza Yousaf, Scotland's former SNP first minister, who revealed a family member was killed in Gaza days ago, told Sky News statehood \"shouldn't be dependent\" upon the conditions Sir Keir has set for Israel, but is the \"inalienable right\" of the Palestinian people. The British Palestinian Committee, representing Palestinian interests in the UK, described conditions as \"absurd and performative\". UK Jewish groups seek clarity The Board of Deputies of British Jews, the UK's largest Jewish organisation, said it was \"seeking urgent clarification\" that the UK will not recognise Palestine as a state if Israeli hostages remain in Hamas captivity, or if Hamas keeps rejecting a ceasefire deal. The Labour Friends of Israel group said it has \"shared goals\" with the government but state recognition \"will be a merely symbolic act unless the UK uses its influence to establish the principles of a meaningful pathway to a Palestinian state\". Read more: What does recognising a Palestinian state mean?Children 'eating out of piles of garbage' as time runs out for Gaza Sarah Champion, Labour MP and chair of the international development committee, who started the MP letter calling for state recognition, said she was \"delighted and relieved\". However, she added: \"I'm troubled our recognition appears conditional on Israel's actions.\" When Foreign Secretary David Lammy announced the plan at a UN meeting, he received applause. Not many other Labour MPs commented. Tories accuse Starmer of appeasing MPs Conservative leader Kemi Badenoch accused Sir Keir of being more focused on a \"political problem for the Labour Party\" than other issues facing the UK. \"Recognising a Palestinian state won't bring the hostages home, won't end the war and won't get aid into Gaza,\" she posted on X. \"This is political posturing at its very worst.\" Tory shadow foreign secretary Priti Patel said the announcement was \"to appease his backbenchers\" as \"he knows that promises to recognise Palestine will not secure lasting peace\". Trump did not discuss statehood with Starmer Donald Trump said he and Sir Keir \"never did discuss\" the PM's plan to recognise a Palestinian state during their meetings in Scotland the day before.  However, Tammy Bruce, spokeswoman for the US state department, said Sir Keir's plan is a \"slap in the face for the victims of October 7\", which \"rewards Hamas\", the Telegraph reported."
    },
    {
        "title": "Sir Keir Starmer's significant breakthrough on Gaza won't please everyone",
        "description": "At the weekend, Downing Street said recognition of Palestine was \"a matter of when, not if\".",
        "url": "https://news.sky.com/story/sir-keir-starmers-significant-breakthrough-on-gaza-wont-please-everyone-13403683",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-starmer_6977350.jpg?20250729215027",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-07-29 18:38:00",
        "Headline": "Was it pressure from MPs and cabinet ministers that forced the PM to change his position? Almost certainly. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  At the weekend, Downing Street said recognition of Palestine was \"a matter of when, not if\". So why now? \"We will recognise the state of Palestine in September before the United Nations General Assembly\", Sir Keir Starmer announced on Tuesday, in what looks like another U-turn. Politics latest: PM's Palestine plan 'absurd' Was it pressure from the more than 250 MPs, most of whom are Labour, who wrote to the prime minister last week calling for recognition? Almost certainly. The PM has a lot of form now for bowing to pressure from Labour MPs poised to rebel against government policy. The demand to the PM in the letter orchestrated by Labour MP Sarah Champion, who chairs the all-party international development select committee, was for the government to recognise Palestine at the United Nations conference on the Middle East currently taking place in New York. \n                  What does recognising a Palestinian state mean?\n                 \n                  UK to recognise Palestine as a state in September - unless Israel meets conditions\n                 \n                  Children 'eating out of piles of garbage' as time runs out for Gaza\n                 Foreign Secretary David Lammy was cheered and applauded when he repeated the pledge made by Sir Keir in a near-empty room in Downing Street to TV cameras and just two journalists. But there are conditions. And the early response from the Israelis was not encouraging.  First, the PM said, \"end the appalling situation in Gaza\", then \"a ceasefire, no annexation in the West Bank and a long-term peace process that delivers a two-state solution\". Good luck, as they say, with that. If the shift in the PM's position wasn't the result of pressure from MPs, was it a potential mutiny inside the cabinet? It followed a lengthy cabinet meeting after ministers were dragged from their sun beds and allowed to dial in remotely rather than turn up at 10 Downing Street in person.  It was reported before the meeting that seven cabinet ministers, including big hitters Mr Lammy and the Deputy Prime Minister Angela Rayner, backed recognising Palestine. So yes, the PM could see that the way cabinet ministers were moving and holding out against recognition was becoming unsustainable. Was it the result of pressure from President Macron. That was certainly a major factor too. After \"le bromance\" during the president's state visit, the two leaders spoke at length at the weekend. Asked what difference recognising Palestine would make in practice, Sir Keir said the aim was that it would help improve conditions on the ground in Gaza. Read more:British Palestinians attack PM's planExplainer: Recognising a Palestinian state?Gaza children 'eating out of piles of garbage' Ahead of his statement, the PM briefed Israel's Prime Minister Benjamin Netanyahu and the King of Jordan, whose country is spearheading the air drops of aid into Gaza. More phone calls with world leaders are planned in the coming hours. Sir Keir wouldn't answer a question about what assurances he'd received from President Trump during their talks in Scotland about using his influence with the Israeli PM to allow aid into Gaza. That is the most urgent priority, as the PM acknowledged. And since President Trump, speaking about the horrible TV pictures from Gaza, memorably said \"you can't fake that\" and \"every ounce of food\" should be allowed in, it seems he did indeed listen to Sir Keir's pleas in Scotland. So even if he has indeed bowed to pressure from MPs and cabinet ministers, Sir Keir has achieved a significant breakthrough in the past 48 hours or so. He won't please everyone, obviously, but no politician ever did in the Middle East."
    },
    {
        "title": "Southport remembers 'three little angels' one years on from attack",
        "description": "At St Marie's Catholic Church in Southport, small photos of Bebe King, Elsie Dot Stancombe and Alice da Silva Aguiar stood on the altar. Candles burned next to them.",
        "url": "https://news.sky.com/story/southport-remembers-three-little-angels-one-years-on-from-attack-13403592",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southport-anniversary_6977120.jpg?20250729163651",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-07-29 15:12:00",
        "Headline": "Southport's Town Hall Gardens was the focal point of public mourning, as people came to place flowers, toys and cards in memory of the victims who were killed.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n At St Marie's Catholic Church in Southport, small photos of Bebe King, Elsie Dot Stancombe and Alice da Silva Aguiar stood on the altar. Candles burned next to them. During lunchtime mass, Father John Heneghan, who gave Alice her first communion and then conducted her funeral, spoke quietly of the \"three little angels\" lost a year ago. A town and a community, in small and quiet ways, remembered a horror that still haunts them. St Marie's was one of the locations chosen for the people of Southport to come and reflect, pray or light a candle in memory of the awful events of 29 July last year.  Throughout the day, a handful of people have paused for a moment at community centres, libraries and churches. The town had opted for very little outward show of commemoration. After discussions, including with the families of the victims, they asked for people to instead donate to local causes, including the charities set up by those families themselves - Elsie's Story, Bebe's Hive and Alice's WonderDance. \n                  Southport stabbing victim reveals how she survived attack - and fears 'it could happen again'\n                 \n                  Is the government preparing for a summer of riots? \n                 \n                  Prevent scheme needs to 'rapidly' adapt to online world, review finds after failures in Southport case\n                 They requested no flowers at the scene of the attack or the schools the girls attended. \"Let us continue to honour the lives of Alice, Bebe and Elsie,\" the leader and chair of Sefton Council said in a letter to the community, \"not only through remembrance but by holding onto the values they embodied - joy, creativity, kindness, and love.\" Read more from Sky News:Victim reveals how she survived attack Analysis: Southport 'cover-up' confusionMissed chances to stop Rudakubana At 3pm, people stopped to observe the three-minute silence in the town centre. A few wiped away tears before spontaneous applause broke out. In Southport's Town Hall Gardens, which was the focal point of the public mourning a year ago, people again came to place flowers, toys and cards in memory of the victims. Stones bearing messages of support to the families were also placed there. \"God bless to you three little angels,\" read one card."
    },
    {
        "title": "Resident doctors threaten further strikes as government rules out additional pay hikes",
        "description": "Resident doctors are not ruling out further strike action as their current walkout comes to an end, with some demands still unmet.",
        "url": "https://news.sky.com/story/resident-doctors-threaten-further-strikes-as-government-rules-out-additional-pay-hikes-13403600",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-st-thomas-hospital_6973197.jpg?20250725082603",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-29 15:28:00",
        "Headline": "Resident doctors say they remain open to negotiations, but the NHS maintains \"there is no more money to negotiate\".",
        "Content": "Resident doctors are not ruling out further strike action as their current walkout comes to an end, with some demands still unmet. The latest strike began on Friday amid an ongoing row over pay and is expected to last until 7am on Wednesday. Hospital leaders have urged the British Medical Association (BMA) and the government to end the strikes, which caused widespread disruptions throughout the NHS in England. The BMA's Resident Doctors Committee (RDC) says it is ready for further talks with the government but has yet to be contacted by Health Secretary Wes Streeting. Dozens of resident doctors, previously called junior doctors, took part in a picket line on Tuesday at King George Hospital in Ilford, a facility serving the constituents of the health secretary. \"Unfortunately, we haven't heard from him yet. That doesn't mean that he's not going to call us tomorrow - our door is always open,\" said Dr Melissa Ryan, who co-chairs the committee alongside Dr Ross Nieuwoudt. Dr Nieuwoudt said: \"There does not need to be a single other day of industrial action at all. \n                  Starmer's plan to recognise Palestinian state labelled 'appeasement towards jihadist terrorists' by Netanyahu\n                 \n                  Sir Keir Starmer's significant breakthrough on Gaza won't please everyone\n                 \n                  Southport remembers 'three little angels' one years on from attack\n                 \"All Wes Streeting needs to do is come to us now and talk to us now, because that's what doctors want and that's what patients need.\" The union has also launched a related dispute with the government over limited training spots, as this year, over 30,000 resident doctors competed for only 10,000 specialty places. Read more:Conservatives vow to ban doctor strikesResident doctors' strike explained A recent poll of 4,400 doctors found that 52% finishing their second training year lack confirmed employment for August. Dr Layla McCay, director of policy at NHS Confederation, said: \"Resident doctors have recently had a very substantial increase in their pay and the government has been pretty clear that at the moment, there isn't more money to be negotiated.\" Dr McCay said the government \"is keen\" to discuss non-pay issues, such as workforce conditions. \"I think that the hope of all healthcare leaders is that the BMA will get around the table with the government and figure out a solution to this, because what absolutely nobody wants to see is any further cases of industrial action after this one.\" Streeting has said the union can't \"hold the country to ransom\" following a 28.9% pay increase over the past three years, the highest in the public sector. The BMA has said pay for resident doctors has declined by a fifth since 2008, once inflation is taken into account, despite this uplift. Meanwhile, health workers represented by the GMB and Unite unions have also turned down a government offer, raising the likelihood of additional industrial action within the NHS. Nurses are also expected to turn down the pay deal later this week. The Royal College of Nursing, which represents hundreds of thousands of nurses across the NHS in England, is balloting its members on the 3.6% pay award offered for 2025/26 in England. A recent YouGov poll found that public opinion in Britain is divided over nurses striking for better pay. Among 4,300 adults surveyed, 19% \"strongly support\" nurse strikes, while 28% offer some support. In contrast, 23% \"strongly oppose\" the strikes, and 20% \"somewhat oppose\" them."
    },
    {
        "title": "Father and son named as victims in central London stabbing",
        "description": "Two men stabbed to death at a business premises in central London were father and son, say police.",
        "url": "https://news.sky.com/story/father-and-son-named-as-victims-in-central-london-stabbing-13403755",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-long-lane-southwark_6976930.jpg?20250729134502",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-29 20:37:00",
        "Headline": "Officers also confirm a 31-year-old man has been arrested on suspicion of murder and is currently in hospital.",
        "Content": "Two men stabbed to death at a business premises in central London were father and son, say police. Terry McMillan, 58, from Chislehurst, Bromley, was pronounced dead at the scene and Brendan McMillan, 27, died in hospital. Three other men were taken to hospital. The attack happened around 1pm on Monday at a property in Long Lane, an east-west road in Southwark that leads to Borough station. A 31-year-old man was arrested on suspicion of murder. Police say he remains in hospital and his condition is not life threatening. Old Colfeians Rugby Club, based in Eltham, called Brendan McMillan a \"member of our family\" and said his father was a \"long-time supporter and sponsor of the club\". It called Brendan \"one of the kindest, funniest, most genuine people you could ever meet\" who was \"forever smiling, always cracking a joke and always full of life\". Terry McMillan set up a property and investment company in 1998, according to The McMillan Family Trust, a charity that helps children from underprivileged backgrounds. Read more from Sky News:Five boys arrested on suspicion of attempted murderPolice investigate Tommy Robinson video after assault claims A police statement on Tuesday added: \"The incident took place in a business premises and a crime scene is in place at a nearby hotel where the arrested man went into. \"We are aware of speculation the man was staying at the hotel, this is not the case.\""
    },
    {
        "title": "Revealed: The scale of cheap Chinese imports flown into UK without paying any tariffs",
        "description": "The scale of cheap Chinese e-commerce imports flown into Britain without paying any tariffs has become clearer following a Sky News investigation into this new multi-billion pound phenomenon.",
        "url": "https://news.sky.com/story/revealed-the-scale-of-cheap-chinese-imports-flown-into-uk-without-paying-any-tariffs-13403101",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-china-trade_6976203.jpg?20250728160022",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-07-29 03:00:00",
        "Headline": "Sky News uncovers the first official estimate of the value of so-called \"de minimis\" imports into Britain ahead of an official inquiry into whether this legal clause should be allowed to continue.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The scale of cheap Chinese e-commerce imports flown into Britain without paying any tariffs has become clearer following a Sky News investigation into this new multi-billion pound phenomenon. We have uncovered the first official estimate of the value of so-called \"de minimis\" imports into Britain, ahead of an official inquiry into whether this legal clause - which excludes packages worth less than £135 from paying customs duties - should be allowed to continue. Companies like Shein and Temu have become big players in British retail, not to mention elsewhere around the world, by manufacturing cheap products in China and then posting them directly to consumers, benefiting from the de minimis rules. Clothing manufacturers in the UK claim that de minimis makes it nearly impossible to compete with these Chinese competitors, raising questions about the viability of domestic textile and apparel production. However, economists argue that the main beneficiaries of the policy to exclude cheap imports from customs are lower-income households, since it allows them to spend less on their shopping. Removing it, they say, would disproportionately affect poorer families. The government has committed to an inquiry into the rules, which are also being changed in the EU and the US, but up until now there has been no official estimate of its scale. According to HM Revenue and Customs data released to Sky News following a Freedom of Information request, the total declared trade value of de minimis imports into the UK in the last fiscal year (2024-25) was £5.9bn. That was a 53% increase on the previous year (£3.9bn), underlining the scale of growth of e-commerce imports into the UK. While it is hard to gauge how much revenue this means the Treasury has forgone, an illustrative 20% tariff on flows of that order could raise more than £1bn. While that sum alone would not fill the fiscal black hole faced by Chancellor Rachel Reeves in the coming budget, it would nonetheless be nearly enough to pay for the government's recent U-turn on winter fuel allowances. Sky has also obtained the first television access deep into the supply chain, helping bring those goods into the UK, as it boarded a flight that had just travelled from Chongqing to Bournemouth Airport. We filmed inside the belly of a plane belonging to European Cargo, one of a number of air cargo firms booming as a result of these trade flows. Read more:The rarely examined trade clause about to become a very big dealUK city's clothing industry in crisis The untold story about de minimis is that it hasn't just had an impact on shopping habits in the UK, or for that matter, the textiles manufacturing sector - it has also changed patterns of distribution. Struggling regional airports that never saw their passenger numbers recover after the pandemic are now re-establishing themselves as hubs for cargo. European Cargo is now the single biggest airline at Bournemouth Airport, despite not carrying a single passenger. Other regional airports like East Midlands Airport and Prestwick in Scotland are seeing rapid growth in flows of trade. All of which raises the stakes for the government's inquiry into the de minimis system. At present, there is no timeline for its decision, but removing the clause would have far-reaching effects across the economy."
    },
    {
        "title": "Ozzy Osbourne cortege to travel through Birmingham",
        "description": "Ozzy Osbourne fans will be able to say goodbye to the heavy metal pioneer at a procession for his cortege through his home city of Birmingham tomorrow.",
        "url": "https://news.sky.com/story/ozzy-osbourne-cortege-to-travel-through-birmingham-13403338",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne-black-sabbath_6976617.jpg?20250729094452",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-29 08:19:00",
        "Headline": "Large crowds are expected to gather in Birmingham tomorrow as fans pay their respects to Ozzy Osbourne.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Ozzy Osbourne fans will be able to say goodbye to the heavy metal pioneer at a procession for his cortege through his home city of Birmingham tomorrow. The star's hearse will make its way down Broad Street towards the Black Sabbath bridge and bench - where thousands of fans have left flowers, messages and other tributes since his death. Osbourne, 76, died less than three weeks after performing his \"final bow\" in the city - the Back The Beginning reunion with his Sabbath bandmates at Villa Park, which raised about £140m for charity. Large crowds are expected to gather tomorrow as fans pay their respects to the performer who shaped heavy metal music and \"proudly carried the spirit of Birmingham throughout his career\", the city council said. Members of Osbourne's family will also be in attendance and have funded the event, the council added. \"Ozzy was more than a music legend - he was a son of Birmingham,\" said the city's lord mayor, Councillor Zafar Iqbal. \"We know how much this moment will mean to his fans. We're proud to host it here with his loving family in the place where it all began.\"  Mr Iqbal said it was important to the city to give the star \"a fitting, dignified tribute ahead of a private family funeral\". Osbourne and his Black Sabbath bandmates Terence \"Geezer\" Butler, Tony Iommi and Bill Ward were awarded the Freedom of the City in June, before the Back To The Beginning show, honouring their \"significance to the cultural and musical identity of Birmingham\". The star's cortege will travel down Broad Street from about 1pm tomorrow, accompanied by a live brass band, Bostin' Brass. For those not able to make it, a live stream of the Black Sabbath bench, which has been running since Osbourne's death, will continue. There is also a book of condolence for public messages at Birmingham Museum and Art Gallery, alongside the Ozzy Osbourne Working Class Hero exhibition, highlighting his solo career achievements. Metal, bats, and reality TV: The wild life of Ozzy Osbourne Osbourne, the self-styled Prince of Darkness, pioneered heavy metal with Black Sabbath before going on to have huge success in his own right. He was famous for hits including Iron Man, Paranoid, War Pigs, Crazy Train and Changes, both with the band and as a solo star. The singer also found a different kind of fame thanks to noughties MTV reality show The Osbournes, which followed his somewhat chaotic life with wife Sharon and two of their children, Kelly and Jack. Following his death, his family released a statement saying he died alongside them, \"surrounded by love\"."
    },
    {
        "title": "Southport stabbing victim reveals how she survived attack - and fears 'it could happen again'",
        "description": "A girl who was stabbed in the Southport attack has told Sky News how she thought she was going to die that day.",
        "url": "https://news.sky.com/story/southport-stabbing-victim-reveals-how-she-survived-attack-and-fears-it-could-happen-again-13403004",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southport-attack-southport-stabbings_6976493.jpg?20250729034220",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-07-29 02:40:00",
        "Headline": "One year since Axel Rudakubana's deadly knife attack, a girl who survived being stabbed tells Sky News she feels \"anger and sadness\".",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  A girl who was stabbed in the Southport attack has told Sky News how she thought she was going to die that day. Warning: Some readers may find this content distressing It is exactly a year since Axel Rudakubana killed three girls and attempted to murder eight others at a summer holiday Taylor Swift-themed dance event in the seaside town. The girl, who cannot be named for legal reasons, was stabbed in the back and the arm after going to the class with her younger sister. She is now campaigning for children to have mandatory first aid training at school in response to the growth of knife crime. She said she clearly remembers what happened that day. \"Some of the girls were sat down in a circle making bracelets with the teachers, and a couple of them were getting up to get beads. I was standing between two tables and he came through the doors. \"He stabbed a little girl in front of me and then came for me and stabbed my arm. I turned and then he stabbed my back, even though I didn't feel it at the time. \"There was a bunch of girls huddled around so I just started pushing them down the stairs, telling them to get out and run. \"I was thinking 'Where's my sister?' and 'We need to get out'.\" She and many of the other victims ran to the house of a neighbour for shelter. \"I just thought that I was going to die,\" she said. Killer 'looked possessed' The girl said she can clearly picture Rudakubana that day. \"What I remember most about him is his eyes. They just didn't look human, they looked possessed. It was kind of like a dream and you're on a movie set and watching yourself go through it and make these decisions. \"It's just kind of like adrenaline. People like to think they know what they'd do in that situation but, in reality, you don't until you're in it.\" Six-year-old Bebe King, Elsie Dot Stancombe, who was seven, and nine-year-old Alice da Silva Aguiar died in the attack. It is something she finds difficult to talk about. \"I don't think I can express how I feel about it,\" the girl said. \"A lot of anger and sadness.\" In January, Rudakubana was jailed for life and must serve a minimum of 52 years before he can be considered for release. The chairman of the public inquiry into the atrocity called the attack \"one of the most egregious crimes in our country's history\". Carrying knives 'disgusting' The girl who survived has now launched a campaign, supported by a clothing range called \"Go Anywhere, Be Anything\" to raise funds, to improve the ability of schoolchildren to help in the event of knife attacks. \"Everyone that's going out and carrying knives is getting younger and younger,\" she said. \"And to think that it's people my age is like disgusting. \"I just want to try and do the best I can to let people know that it's not okay to do that and that they need to think about what they're doing and the risks and how they're harming themselves and other people.\" Her sister, who was also there that day, helped design \"Go Anywhere, Be Anything\". Read more:Missed chances to stop Rudakubana'Terrorism has changed', says PM A three-minute silence will be held in Southport at 3pm to mark one year on from the attack. In an open letter to the community, Sefton Council wrote: \"This period is incredibly hard for the families of Alice, Bebe and Elsie and all of those children and adults injured or who suffered lifelong psychological impact of witnessing the attack, and we acknowledge the huge impact on their lives, too. \"We must not forget the local people who rushed to support and to our emergency responders. They all remain always in our thoughts.\" It is a sentiment shared by the survivor. \"You live in fear every day that it could happen again,\" she said. \"Physically I'm getting better every day and healing. Obviously, my scars stay as a reminder but everyone from that day is going to have mental scars forever.\""
    },
    {
        "title": "Police investigate assault as video appears to show Tommy Robinson at station",
        "description": "Police investigating an alleged assault at St Pancras station in London are looking to bring a 42-year-old man into custody.",
        "url": "https://news.sky.com/story/police-investigate-assault-as-video-appears-to-show-tommy-robinson-at-station-13403457",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tommy-robinson-court_6956041.jpg?20250703103257",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-29 13:46:00",
        "Headline": "It comes after footage emerged purporting to show right-wing activist Tommy Robinson walking back and forth next to a man lying motionless at St Pancras.",
        "Content": "Police investigating an alleged assault at St Pancras station in London are looking to bring a 42-year-old man into custody. British Transport Police said the suspect, from Bedfordshire, boarded a flight out of the country in the early hours of Tuesday morning. Officers were called to the scene just after 8.40pm on Monday following reports of an assault. A man was taken to hospital with serious injuries which are not thought to be life-threatening. \"Detectives are continuing to work closely to progress the investigation and bring the man into custody for questioning,\" a statement reads. It comes after footage emerged purporting to show right-wing activist Tommy Robinson walking back and forth next to a man lying motionless at St Pancras. A concerned onlooker calls for help before Robinson shouts: \"You saw him. He came at me bruv, you saw that, he came at me\". \n                  Tommy Robinson due to be released from prison in days after sentence reduced\n                 \n                  Tommy Robinson loses Court of Appeal challenge against prison sentence\n                 \n                  Tommy Robinson loses bid to challenge prison segregation in High Court\n                 The video does not show the moment the man was allegedly attacked. Read more from Sky News: Ozzy Osbourne cortege to travel through BirminghamTeenage girl dies after being pulled from the sea Robinson, whose real name is Stephen Yaxley-Lennon, has since reposted a tweet which claimed he acted in self-defence. A London Ambulance Service spokesperson said: \"We were called at 8.40pm on Monday July 28 to reports of an assault at St Pancras International Rail Station, NW1. \"We sent an ambulance crew to the scene and treated a man before taking him to a major trauma centre.\" Sky News has approached Robinson for comment."
    },
    {
        "title": "Five boys arrested on suspicion of attempted murder after 14-year-old stabbed in Newham",
        "description": "Five boys have been arrested on suspicion of attempted murder after a teenager was stabbed in east London. ",
        "url": "https://news.sky.com/story/five-boys-arrested-on-suspicion-of-attempted-murder-after-stabbing-of-teenager-in-newham-13403581",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-newham-stabbing-charlemont-road_6977294.jpg?20250729202535",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-29 15:02:00",
        "Headline": "Anyone with dashcam or mobile phone footage that may be helpful is asked to contact Metropolitan Police.",
        "Content": "Five boys have been arrested on suspicion of attempted murder after a teenager was stabbed in east London.  Police were called at 4pm on Saturday to reports of a stabbing in Charlemont Road, Newham. A 14-year-old boy was taken to hospital with serious injuries and remains in a life-threatening condition. Four of the boys - who are aged 14-17 - remain in custody and one has been released on bail. Detective Inspector Joshua Palmer, from Metropolitan Police, said: \"This was a horrific attack on a teenager, witnessed by numerous members of the public. \"At this very early stage of the investigation, there doesn't appear to be an obvious motive for the attack. \"We are urgently trying to gather as much information as possible. \n                  Father and son named as victims in central London stabbing\n                 \n                  Man arrested on suspicion of murder after stabbing at London business\n                 \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \"If you were near Charlemont Road on the day of the incident, please check your phone for any footage you may have. \"I would urge anyone with dashcam or mobile phone footage from the area to contact the police. It may be crucial in our investigation.\" Read more from Sky News:Police investigate Tommy Robinson video over assault claimsHundreds of thousands protest against internet safety rules Anyone with information is asked to call 101 - or to remain anonymous contact Crimestoppers on 0800 555 111."
    },
    {
        "title": "Powerful 8.8-magnitude earthquake causes tsunami in Russia's Far East - with warnings issued for Japan, Hawaii and Alaska",
        "description": "A powerful 8.8-magnitude earthquake has struck off Russia's far eastern Kamchatka Peninsula, causing a tsunami.",
        "url": "https://news.sky.com/story/powerful-87-magnitude-earthquake-causes-tsunami-in-russias-far-east-with-warnings-issued-for-japan-hawaii-and-alaska-13403770",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-japan-tsunami_6977425.png?20250730030455",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-29 21:07:00",
        "Headline": "No subtitle found",
        "Content": "A powerful 8.8-magnitude earthquake has struck off Russia's far eastern Kamchatka Peninsula, causing a tsunami. A tsunami of up to four metres (13 feet) was recorded in Kamchatka Peninsula, leading to evacuations and damaging buildings, officials said. Tsunami warnings have been issued for Japan, the Philippines, Hawaii and parts of Alaska in the US. The Honolulu Department of Emergency Management in Hawaii has called for the evacuation of some coastal areas, writing on X: \"Take Action! Destructive tsunami waves expected.\" Kamchatka Governor Vladimir Solodov had earlier said: \"Today's earthquake was serious and the strongest in decades of tremors.\" Several people in the region sought medical assistance following the quake, Oleg Melnikov, regional health minister told Russia's Tass state news agency. \"Unfortunately, there are some people injured during the seismic event. Some were hurt while running outside, and one patient jumped out of a window. A woman was also injured inside the new airport terminal,\" Mr Melnikov said. Russia's Tass news agency reported from the biggest city nearby, Petropavlovsk-Kamchatsky, that many people ran out into the street, while cabinets toppled inside homes, mirrors were broken, cars swayed on roads and balconies on buildings shook noticeably. Power outages and mobile phone service failures were also reported in the capital of the Kamchatka region. A regional branch of Russia's geophysical service has said that \"significant, noticeable\" aftershocks with magnitudes of up to 7.5 after expected to continue for at least another month. Japan issued a tsunami warning, saying it expects waves as high as three metres to arrive along large coastal areas along the Pacific Ocean. It has ordered the evacuation of some areas. The National Tsunami Warning Center, based in Alaska, issued a tsunami warning for parts of the Alaska Aleutian Islands. A tsunami warning also was extended to the US state of Hawaii, with the National Weather Service's Pacific Tsunami Warning Center saying a tsunami from the quake had been generated that could cause damage along the coastlines of all the Hawaiian islands. A tsunami \"watch\" was issued for portions of the West Coast, including California, Oregon, and Washington. The US Geological Survey said the earthquake was shallow at a depth of 19.3 km (12 miles), and was centred about 125 km (80 miles) east-southeast of Petropavlovsk-Kamchatsky, a city of 165,000 along the coast of Avacha Bay. It revised the magnitude up twice from 8.0 and 8.7 to 8.8 earlier. Meanwhile, New Zealand's disaster management agency has warned that the country's coastal areas could expect \"strong and unusual currents and unpredictable surges at the shore\". In a national advisory alert, Civil Defence New Zealand said there was no immediate need to evacuate but said citizens should stay away from beaches and shore areas. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Starmer's plan to recognise Palestinian state labelled 'appeasement towards jihadist terrorists' by Netanyahu",
        "description": "Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu.",
        "url": "https://news.sky.com/story/starmers-plan-to-recognise-palestinian-state-labelled-appeasement-towards-jihadist-terrorists-by-netanyahu-13403756",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-food-aid_6976538.jpg?20250729081053",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-29 20:37:00",
        "Headline": "The prime minister's plan was welcomed by some, while he was accused by others of pandering to his MPs and France.",
        "Content": " Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu. The prime minister said the UK will recognise a Palestinian state by September unless Israel takes \"substantive steps\" to end the situation in Gaza, Israel agrees to a ceasefire, commits to a long-term sustainable peace, allows the UN to restart aid supplies and does not annexe the West Bank. About 250 MPs from all parties - half of them Labour - had signed a letter last week calling for Sir Keir to immediately recognise a Palestinian state. Politics latest: PM's Palestine plan labelled 'absurd' Sir Keir said that by giving Israel a deadline of 9 September UN meeting, he hoped this would play a part \"in changing the conditions on the ground, and making sure aid gets into making sure that there is hope of a two-state solution for the future\". But Mr Netanyahu condemned the plan, saying Sir Keir \"rewards Hamas's monstrous terrorism and punishes its victims\". \"A jihadist state on Israel's border today will threaten Britain tomorrow,\" he wrote on X. \n                  What does recognising a Palestinian state mean?\n                 \n                  Sir Keir Starmer's significant breakthrough on Gaza won't please everyone\n                 \n                  UK to recognise Palestine as a state in September - unless Israel meets conditions\n                 \"Appeasement towards jihadist terrorists always fails. It will fail you too. It will not happen.\" The Israelis also accused Sir Keir of pandering to his MPs and France, after Emmanuel Macron committed to recognising a Palestinian state last week, and harming efforts to release Israeli hostages. Lib Dems and Greens: 'Bargaining chip' Sir Keir also faced accusations of using Palestinian state recognition as a \"bargaining chip\" by both the Lib Dems and the Green Party. Lib Dem leader Sir Ed Davey said a Palestinian state should have been recognised \"months ago\" and \"far greater action\" is needed to stop the humanitarian disaster in Gaza. Green Party foreign affairs spokesperson Ellie Chowns, who wants immediate state recognition, said it was a \"cynical political gesture\". Humza Yousaf, Scotland's former SNP first minister, who revealed a family member was killed in Gaza days ago, told Sky News statehood \"shouldn't be dependent\" upon the conditions Sir Keir has set for Israel, but is the \"inalienable right\" of the Palestinian people. The British Palestinian Committee, representing Palestinian interests in the UK, described conditions as \"absurd and performative\". UK Jewish groups seek clarity The Board of Deputies of British Jews, the UK's largest Jewish organisation, said it was \"seeking urgent clarification\" that the UK will not recognise Palestine as a state if Israeli hostages remain in Hamas captivity, or if Hamas keeps rejecting a ceasefire deal. The Labour Friends of Israel group said it has \"shared goals\" with the government but state recognition \"will be a merely symbolic act unless the UK uses its influence to establish the principles of a meaningful pathway to a Palestinian state\". Read more: What does recognising a Palestinian state mean?Children 'eating out of piles of garbage' as time runs out for Gaza Sarah Champion, Labour MP and chair of the international development committee, who started the MP letter calling for state recognition, said she was \"delighted and relieved\". However, she added: \"I'm troubled our recognition appears conditional on Israel's actions.\" When Foreign Secretary David Lammy announced the plan at a UN meeting, he received applause. Not many other Labour MPs commented. Tories accuse Starmer of appeasing MPs Conservative leader Kemi Badenoch accused Sir Keir of being more focused on a \"political problem for the Labour Party\" than other issues facing the UK. \"Recognising a Palestinian state won't bring the hostages home, won't end the war and won't get aid into Gaza,\" she posted on X. \"This is political posturing at its very worst.\" Tory shadow foreign secretary Priti Patel said the announcement was \"to appease his backbenchers\" as \"he knows that promises to recognise Palestine will not secure lasting peace\". Trump did not discuss statehood with Starmer Donald Trump said he and Sir Keir \"never did discuss\" the PM's plan to recognise a Palestinian state during their meetings in Scotland the day before.  However, Tammy Bruce, spokeswoman for the US state department, said Sir Keir's plan is a \"slap in the face for the victims of October 7\", which \"rewards Hamas\", the Telegraph reported."
    },
    {
        "title": "'It's a disaster from heaven': Residents dismayed and powerless after Beijing struck by devastating night of rain",
        "description": "Residents of Miyun District stood dismayed and powerless along streets reshaped by a devastating night of rain.&#160;",
        "url": "https://news.sky.com/story/its-a-disaster-from-heaven-residents-dismayed-and-powerless-after-beijing-struck-by-devastating-night-of-rain-13403487",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-floods-miyun-district_6977080.jpg?20250729155757",
        "type": "World",
        "Author": "Harry Stevens, Asia producer, in Miyun District, Beijing",
        "Date Published": "2025-07-29 16:20:00",
        "Headline": "A year's worth of rain fell in less than a week in Beijing, forcing the relocation of more than 80,000 people, damaging roads and cutting off power and communications in more than 130 villages.",
        "Content": "By Harry Stevens, Asia producer, in Miyun District, Beijing    Residents of Miyun District stood dismayed and powerless along streets reshaped by a devastating night of rain.  This northeastern suburb of Beijing, China's sprawling capital, suffered at least 28 deaths. Its streets and small hamlets bear the marks of being ripped through by a torrent of water. One residential area we visit is still submerged. Some people wade into what is left of their homes, emerging with muddied suitcases carrying any possessions they can salvage. Others, like Mrs Feng, are unable to reach their buildings and can only speculate about what they might find when the water subsides. \"It's a disaster from heaven,\" she says, \"it can't be helped, it just happened.\" \n                  Revealed: The scale of cheap Chinese imports flown into UK without paying any tariffs\n                 \n                  China's Shaolin Temple's 'CEO monk' under criminal investigation\n                 \n                  Seventeen investigated after nearly 250 children poisoned by lead in their food\n                 She tells us one of the stories beginning to circulate about the desperate events that took place just hours before, saying one man \"died holding his wife\". \"His wife was already dead, but the water kept coming into the house. For about an hour, he held a beam of the house with one hand, holding his wife with another. \"He couldn't hold on anymore, he let his hand go for one second and he was washed away.\" As we talk, bulldozers strategically dump sand along the road to manage the flow of the water, and a huge winch-truck begins moving one of the many smashed cars littering the street. Around the corner, equipped only with a small bucket to bail water out from his yard, Mr Dong describes a terrifying night. \"My two cars floated away,\" he said, \"I put two thick trees by the gate but they floated away. \"If me and my wife didn't climb up to the roof, it would be over for us. The water was as high as my neck.\" He looks forlorn and exhausted as he shows us through the wreckage of his home. The floor is now entirely thick mud, while appliances and furniture lie tangled and broken in the middle of rooms. As we had driven into Miyun from central Beijing, we saw multiple sections of the riverbank that had been breached. Read more from Sky News:Celebrity monk under criminal investigationPakistan 'honour killing' video sparks national outrageEU leaders resigned to US trade deal terms In one small, inaccessible valley, only the tops of buildings - and what appeared to be the rear end of a lorry - were visible above the water. It was fortunate that rain, forecast to fall right through Tuesday, appeared not to come. Instead, the baking sun of the Beijing summer returned, while rescue operations continued and the community prepared for the even bigger task of rebuilding."
    },
    {
        "title": "Russian strike on Ukrainian prison kills 17 people and injures more than 80",
        "description": "A Russian airstrike on a prison in southeastern Ukraine has killed at least 17 people and wounded more than 80 others.",
        "url": "https://news.sky.com/story/russian-strike-on-ukrainian-prison-kills-17-people-and-injures-more-than-80-13403320",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ukraine-prison-russia_6976563.jpg?20250729085008",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-29 07:25:00",
        "Headline": "The prison dining hall was destroyed and administrative buildings damaged but no prisoners escaped, Ukrainian authorities say.",
        "Content": "A Russian airstrike on a prison in southeastern Ukraine has killed at least 17 people and wounded more than 80 others. Four guided aerial bombs hit the Bilenkivska Correctional Colony in the country's 's Zaporizhzhia region, according to the State Criminal Executive Service of Ukraine. At least 42 inmates were taken to hospital with serious injuries and another 40 people, including one staff member with a \"facial fracture\", were also hurt. The prison dining hall was destroyed and administrative buildings damaged but the fence was unaffected and there were no prisoner escapes, authorities said. Ukrainian officials condemned the airstrike, with a statement saying: \"This incident is yet another confirmation of the gross violation of international humanitarian law by the armed forces of the Russian Federation. \"Bombardment of civilian infrastructure, in particular penitentiary institutions, is considered a war crime.\" Russian authorities have not commented. Read moreFive dead in aerial bombardmentsDemonstrations in Ukraine over controversial bill In a separate attack in the Dnipro city of Kamianske, two people died and five were injured in a strike on a medical facility. One of the injured was a pregnant woman, who regional chief Serhii Lysak said was in a serious condition. Another hit on the Velykomykhailivska district killed a 75-year-old woman and 68-year-old man, he added. The attacks were conducted using two Iskander-M ballistic missiles, 37 Shahed-style drones, and a decoy unmanned aerial vehicle, according to Ukraine's air force. Thirty-two of the drones were intercepted by Ukrainian air defences, it added. Trump gives Putin war ultimatum The attacks follow US President Donald Trump setting a new deadline for Russia to make progress towards ending the war. Speaking on his trip to Scotland on Monday, Mr Trump said Vladimir Putin has between 10 and 12 days, which is shorter than the 50-day deadline he set two weeks ago. In response, Kremlin officials warned Mr Trump about \"playing the ultimatum game with Russia\". \"Each new ultimatum is a threat and a step towards war. Not between Russia and Ukraine, but with his own country,\" Dmitry Medvedev, head of Russia's security council, posted on X on Monday. Ukrainian President Volodymyr Zelenskyy said 22 people had died since the new Trump \"ultimatum\". \"As of now, it is known that in just one past day - when everyone once again felt a sense of hope that the killing mightstop - the Russian army killed 22 people in Ukraine,\" he wrote on X. \"These were conscious, deliberate strikes - not accidental,\" he added on Telegram."
    },
    {
        "title": "Israeli settler accused of killing contributor to Oscar-winning West Bank film 'released on house arrest'",
        "description": "A Palestinian community leader has been killed by a sanctioned settler in a West Bank area which was documented in the Oscar-winning film No Other Land, according to the movie's directors.",
        "url": "https://news.sky.com/story/palestinian-community-leader-killed-in-west-bank-area-documented-in-oscar-winning-film-no-other-land-13403287",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-hathaleen-west-bank_6976517.jpg?20250729072547",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-29 05:26:00",
        "Headline": "The local leader, Awdah Hathaleen, was killed in front of a community centre in the Israel-occupied West Bank on Monday evening, film co-director Basel Adra, who was also Mr Hathaleen's friend, said.",
        "Content": " A Palestinian community leader has been killed by a sanctioned settler in a West Bank area which was documented in the Oscar-winning film No Other Land, according to the movie's directors. The local leader, Awdah Hathaleen, was killed in front of a community centre in the Israel-occupied West Bank on Monday evening, film co-director Basel Adra, who was also Mr Hathaleen's friend, said. Adra said on social media that Mr Hathaleen was \"slaughtered\" as he was shot in the chest. The suspect in the killing has been identified as Yinon Levi, an Israeli settler who was sanctioned by the UK and EU last year. Local media reports that he was released under house arrest on Tuesday. Israel's military said an armed Israeli civilian opened fire at a group of Palestinians after they threw rocks. Israeli military and police responded to the incident. A video of the incident obtained by The Associated Press shows a settler shooting into a crowd of people. \n                  Starmer's plan to recognise Palestinian state labelled 'appeasement towards jihadist terrorists' by Netanyahu\n                 \n                  What does recognising a Palestinian state mean?\n                 \n                  Sir Keir Starmer's significant breakthrough on Gaza won't please everyone\n                 No Other Land, which won the Oscar this year for best documentary, follows Masafer Yatta residents as they struggle to stop Israel's army from demolishing their villages. The film's Israeli co-director, Yuval Abraham, described Mr Hathaleen in an Instagram post as \"a remarkable activist who helped us film No Other Land in Masafer Yatta\". Read more: Why are airdrops on Gaza so dangerous?Bob Geldof accuses Israeli authorities of 'lying' about starvation in Gaza No Other Land has two Palestinian co-directors, Hamdan Ballal and Adra, both Masafar Yatta residents, and two Israeli directors, Abraham and Rachel Szor. In March, Ballal was detained by the Israeli military in the occupied West Bank after being beaten up, according to activists.  Hundreds of Palestinians have been killed in the West Bank in Israeli military operations during the Gaza war, and there has also been a rise in settler attacks on Palestinians. There has also been a surge in Palestinian attacks on Israelis."
    },
    {
        "title": "China floods: At least 30 killed in Beijing and 80,000 evacuated",
        "description": "At least 30 people have been killed and tens of thousands evacuated due to heavy rain and flooding in and around Beijing.",
        "url": "https://news.sky.com/story/china-floods-at-least-30-killed-in-beijing-and-80000-evacuated-13403270",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-china-beijing_6976498.jpg?20250729071346",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-29 02:05:00",
        "Headline": "A further four people have reportedly been killed in a landslide in a rural part of Luanping county in Beijing's neighbouring Hebei province.",
        "Content": " At least 30 people have been killed and tens of thousands evacuated due to heavy rain and flooding in and around Beijing. Heavy rains intensified around the Chinese capital and surrounding areas on Monday, with the city experiencing rainfall of up to 54cm (21 inches) during a period of \"continuous extreme rain\", China's official Xinhua news agency said. A statement from the Beijing city government said 28 people had died in Miyun district and two had been killed in Yanqing district as of midnight on Monday. Both areas are mountainous outlying parts of Beijing, far from the city centre. More than 80,000 people have been relocated in the Chinese capital, including around 17,000 in Miyun, the city government's statement said. It comes as reports on Monday said four people had been killed in a landslide in a rural part of Luanping county in Beijing's neighbouring Hebei province. Eight others were missing. A resident told the state-backed Beijing News that communications were down and he couldn't reach his relatives. Meanwhile, Chinese President Xi Jinping ordered \"all-out\" search and rescue efforts late on Monday to minimise casualties. The recent floods have resulted in \"significant casualties and property losses\" in Beijing and the provinces of Hebei, Jilin and Shandong, he said, according to Xinhua. Beijing authorities launched a top-level emergency response at 8pm local time (1pm UK time) on Monday, ordering people to stay inside, closing schools, suspending construction work and stopping outdoor tourism and other activities until the response is lifted. Further heavy rainfall forecast More heavy rain is expected in Beijing on Tuesday, with rainfall of up to 30cm (12 inches) forecast for some areas. The storms in the region have already knocked out power in more than 130 villages in the Beijing area, destroyed communication lines and damaged more than 30 sections of road. More than 16cm (6 inches) of rain had fallen on average by Tuesday, with two towns in Miyun recording 54cm (21 inches) of rainfall, the city's government said. Flooding has washed away cars and downed power poles in Miyun - as authorities there released water from a reservoir that was at its highest level since it was built in 1959. Read more world news:The view from a plane dropping aid to GazaIsraeli human rights organisations accuse country of genocide 'The flood came rushing in' Uprooted trees lay in piles with their bare roots exposed in the town of Taishitun in Miyun, about 100km (60 miles) northeast of central Beijing. Streets were covered with water, with mud left higher up on the walls of buildings. \"The flood came rushing in, just like that, so fast and suddenly. In no time at all, the place was filling up,\" said Zhuang Zhelin, as he cleared mud with his family from their building materials shop. Next door, his neighbour Wei Zhengming, a traditional Chinese medicine practitioner, shovelled mud in his clinic. \"It was all water, front and back. I didn't want to do anything. I just ran upstairs and waited for rescue. I remember thinking, if no one came to get us, we'd be in real trouble,\" he said. Meanwhile, China's central government said it had sent 50 million yuan (about £5.2m) to Hebei and has dispatched a high-level team of emergency responders to help affected cities, which include Chengde, Baoding and Zhangjiakou."
    },
    {
        "title": "Powerful 8.8-magnitude earthquake causes tsunami in Russia's Far East - with warnings issued for Japan, Hawaii and Alaska",
        "description": "A powerful 8.8-magnitude earthquake has struck off Russia's far eastern Kamchatka Peninsula, causing a tsunami.",
        "url": "https://news.sky.com/story/powerful-87-magnitude-earthquake-causes-tsunami-in-russias-far-east-with-warnings-issued-for-japan-hawaii-and-alaska-13403770",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-japan-tsunami_6977425.png?20250730030455",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-29 21:07:00",
        "Headline": "No subtitle found",
        "Content": "A powerful 8.8-magnitude earthquake has struck off Russia's far eastern Kamchatka Peninsula, causing a tsunami. A tsunami of up to four metres (13 feet) was recorded in Kamchatka Peninsula, leading to evacuations and damaging buildings, officials said. Tsunami warnings have been issued for Japan, the Philippines, Hawaii and parts of Alaska in the US. The Honolulu Department of Emergency Management in Hawaii has called for the evacuation of some coastal areas, writing on X: \"Take Action! Destructive tsunami waves expected.\" Kamchatka Governor Vladimir Solodov had earlier said: \"Today's earthquake was serious and the strongest in decades of tremors.\" Several people in the region sought medical assistance following the quake, Oleg Melnikov, regional health minister told Russia's Tass state news agency. \"Unfortunately, there are some people injured during the seismic event. Some were hurt while running outside, and one patient jumped out of a window. A woman was also injured inside the new airport terminal,\" Mr Melnikov said. Russia's Tass news agency reported from the biggest city nearby, Petropavlovsk-Kamchatsky, that many people ran out into the street, while cabinets toppled inside homes, mirrors were broken, cars swayed on roads and balconies on buildings shook noticeably. Power outages and mobile phone service failures were also reported in the capital of the Kamchatka region. A regional branch of Russia's geophysical service has said that \"significant, noticeable\" aftershocks with magnitudes of up to 7.5 after expected to continue for at least another month. Japan issued a tsunami warning, saying it expects waves as high as three metres to arrive along large coastal areas along the Pacific Ocean. It has ordered the evacuation of some areas. The National Tsunami Warning Center, based in Alaska, issued a tsunami warning for parts of the Alaska Aleutian Islands. A tsunami warning also was extended to the US state of Hawaii, with the National Weather Service's Pacific Tsunami Warning Center saying a tsunami from the quake had been generated that could cause damage along the coastlines of all the Hawaiian islands. A tsunami \"watch\" was issued for portions of the West Coast, including California, Oregon, and Washington. The US Geological Survey said the earthquake was shallow at a depth of 19.3 km (12 miles), and was centred about 125 km (80 miles) east-southeast of Petropavlovsk-Kamchatsky, a city of 165,000 along the coast of Avacha Bay. It revised the magnitude up twice from 8.0 and 8.7 to 8.8 earlier. Meanwhile, New Zealand's disaster management agency has warned that the country's coastal areas could expect \"strong and unusual currents and unpredictable surges at the shore\". In a national advisory alert, Civil Defence New Zealand said there was no immediate need to evacuate but said citizens should stay away from beaches and shore areas. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Trump claims Epstein 'stole' Prince Andrew accuser Virginia Giuffre from his Mar-a-Lago resort",
        "description": "Donald Trump has claimed billionaire paedophile Jeffrey Epstein \"stole\" prominent accuser Virginia Giuffre and other young women from his Mar-a-Lago resort in Florida.",
        "url": "https://news.sky.com/story/trump-claims-epstein-stole-prince-andrew-accuser-virginia-giuffre-from-his-mar-a-lago-resort-13403791",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/37bea1abcc33a8e39ce42e8d0bc25548c490d7a08c49bd761eb8b6c1b3b25461_6972827.jpg?20250730030740",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-29 22:08:00",
        "Headline": "The US president has made the remarks after facing growing pressure in recent weeks to release files related to the Epstein case.",
        "Content": "Donald Trump has claimed billionaire paedophile Jeffrey Epstein \"stole\" prominent accuser Virginia Giuffre and other young women from his Mar-a-Lago resort in Florida. Ms Giuffre became a household name after she sued Prince Andrew for sexual abuse in August 2021 - saying he had sex with her when she was 17 and had been trafficked by his friend Epstein. Prince Andrew reached an out-of-court settlement with Ms Giuffre but has repeatedly denied the claims and has not been charged with any criminal offences. Mr Trump made his remarks about Ms Giuffre as his administration has faced growing pressure in recent weeks, including from within his \"MAGA\" base, to release files related to Epstein after he promised to do so during his 2024 presidential campaign. The US president was speaking to reporters on Tuesday when he was asked about comments he made over the weekend about a falling-out with Epstein over employees taken from his business. \"He took people that worked for me. And I told him, 'Don't do it anymore.' And he did it,\" Mr Trump told reporters while on board Air Force One as he returned to the US from Scotland. \"I said, 'Stay the hell out of here',\" the US president added. Pressed about whether any of the employees he referred to were young women, Mr Trump said many of them worked in the spa at Mar-a-Lago. \"The answer is yes, they were in the spa,\" he said. \"I told him, I said, 'Listen, we don't want you taking our people, whether it was spa or not spa.' ... And he was fine. And then not too long after that, he did it again.\" Asked if Ms Giuffre was one of the employees poached by Epstein, the US president replied: \"I think she worked at the spa... I think so. I think that was one of the people. He stole her, and by the way, she had no complaints about us, as you know, none whatsoever.\"  The White House said in a statement last week that Mr Trump banned Epstein from Mar-a-Lago because he was acting like a \"creep\". Epstein took his own life in a Manhattan prison cell in August 2019 as he awaited trial on sex trafficking charges. On Tuesday, lawyer's for his former girlfriend Ghislaine Maxwell, who is serving 20 years in prison for recruiting young girls for the financier, said that they are open to her answering more questions from US Congress if she is granted immunity from future prosecution. However a spokeswoman for the House Oversight Committee, which requested the interview with Maxwell, said the panel would not consider granting the immunity she requested. The former British socialite was interviewed inside a Florida courthouse by US Deputy Attorney General Todd Blanche last week. Officials have not publicly disclosed what she said. Mr Blanche had earlier said that Maxwell would be interviewed because of Mr Trump's directive to gather and release any credible evidence about others who may have committed crimes in relation to the Epstein case. Separately, Maxwell's lawyers have urged the Supreme Court to review her conviction, saying she did not receive a fair trial. They also say that one way she would testify \"openly and honestly, in public\", is in the event of a pardon by Mr Trump, who has told reporters that such a move is within his rights but that he has not been not asked to make it. What had Ms Giuffre said about Mar-a-Lago? Ms Giuffre, who took her own life in April, claimed Maxwell spotted her while she was working as a spa attendant at Mar-a-Lago when she was a teenager in 2000. She added that Maxwell hired her as Epstein's masseuse, which led to sexual abuse. She accused Epstein of pressuring her into having sex with powerful men. Why is the Epstein case such a problem for Trump? Rumours have circulated since Epstein's death about who he may have supplied underage girls to and who visited his private island. Some of those rumours quickly spiralled into conspiracy theories, which Mr Trump fanned the flames of during his campaign for a second term. Mr Trump promised to release more Epstein files to the public if he was elected president for a second time - but is now facing a backlash from his voter base after carrying out a complete U-turn on the move."
    },
    {
        "title": "Manhattan gunman was trying to target NFL but took wrong lift, says New York mayor",
        "description": "A gunman who killed four people in a New York office block was trying to target the NFL headquarters but took the wrong lift, the city's mayor has said.",
        "url": "https://news.sky.com/story/manhattan-gunman-was-trying-to-target-nfl-but-took-wrong-lift-says-mayor-13403522",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-new-york-shooting-manhattan_6976519.jpg?20250729073422",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-29 13:15:00",
        "Headline": "Investment firm Blackstone has confirmed one of its senior managing directors was among those murdered in the attack.",
        "Content": "A gunman who killed four people in a New York office block was trying to target the NFL headquarters but took the wrong lift, the city's mayor has said. Eric Adams said it's believed he was trying to get to the NFL (National Football League) offices after shooting several people in the lobby. Shane Tamura, from Las Vegas, accidentally entered the wrong set of lifts, the mayor said. \"We have reason to believe that he was focused on the NFL agency that was located in the building,\" Mr Adams told MSNBC. A police officer, Didarul Islam, was among those killed on Monday. The 36-year-old was married with two children, and his wife was pregnant. Sky's partner network, NBC News, said a note was found in which the suspect expressed anger at his mental illness potentially being linked to him having played American football. Tamura played high school football but was never in the NFL. \n                  Gunman kills four including police officer at New York skyscraper - as suspect named\n                 \n                  New York City mayoral hopeful Brad Lander arrested by ICE agents\n                 \n                  Cryptocurrency investors charged over alleged New York City kidnap plot\n                 New York's police commissioner said on Monday that the gunman had a \"documented mental health history\". The shooting happened at 345 Park Avenue - a skyscraper in Manhattan that also houses firms, including investment company Blackstone and KPMG. Blackstone said on Tuesday, \"words cannot express the devastation we feel\", as it confirmed a senior managing director, Wesley LePatner, had died in the shooting. \"She was brilliant, passionate, warm, generous, and deeply respected within our firm and beyond. She embodied the best of Blackstone,\" said a statement. The firm said she was married with children. NFL commissioner Roger Goodell told staff that one of its employees was stable in hospital after being seriously injured in the attack.  CCTV captured Tamura, 27, walking towards the building carrying a rifle after getting out of a black BMW just before 6.30pm. New York police commissioner Jessica Tisch said he entered the lobby and immediately shot the police officer. \"He then shoots a woman who took cover behind a pillar and proceeds through the lobby, spraying it with gunfire,\" she told reporters on Monday. \"He makes his way to the elevator bank where he shoots a security guard who was taking cover behind a security desk.\" Read more from Sky News:Brain disease 'could have contributed' to mass shooting Ms Tisch said Tamura then called for a lift, which opened in the lobby. \"A female exits that elevator and he allows her to walk past him unharmed,\" she said. \"He goes up to the 33rd floor... and begins to walk the floor firing rounds as he travelled. One person was struck and killed on that floor,\" she continued. The gunman then fatally shot himself in the chest. Sources close to the investigation said the note found with Tamura claimed he had been suffering with CTE, a degenerative brain disease linked to concussion and repeated head impacts common in sports such as American football."
    },
    {
        "title": "CTE: Brain disease linked to head impacts in sport 'could have contributed' to Manhattan mass shooting",
        "description": "The man who shot dead four people inside a New York City skyscraper had left a note claiming he had CTE, a brain disease that has been linked to American football.",
        "url": "https://news.sky.com/story/cte-brain-disease-linked-to-head-impacts-in-sport-could-have-contributed-to-manhattan-mass-shooting-13403633",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-cte-nfl-martha-kelner_6460529.jpg?20240218181610",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-07-29 16:43:00",
        "Headline": "An expert tells Sky News a link between CTE and violent crime can't be ruled out after a man who shot dead four people left a note saying he wanted his brain studied for the condition.",
        "Content": "\n          US correspondent\n              @marthakelner\n  The man who shot dead four people inside a New York City skyscraper had left a note claiming he had CTE, a brain disease that has been linked to American football. It's believed the gunman, 27-year-old Shane Tamura, was targeting the headquarters of the NFL but took the wrong lift. The NFL occupies floors five to eight in the skyscraper - but Tamura ended up on floor 33. He had driven from Las Vegas, almost the breadth of the country, to reach 345 Park Avenue, in the heart of midtown Manhattan. CTE can only be diagnosed by studying the brain after death, but in a three-page note discovered by police, Tamura made repeated references to the condition. In his note, which was written on notepad paper and using a variety of ink, he writes: \"CTE study my brain please. I'm sorry.\" And again: \"Please study brain for CTE. I'm sorry.\" \n                  Powerful 8.8-magnitude earthquake causes tsunami in Russia's Far East - with warnings issued for Japan, Hawaii and Alaska\n                 \n                  Trump claims Epstein 'stole' Prince Andrew accuser Virginia Giuffre from his Mar-a-Lago resort\n                 \n                  Sean 'Diddy' Combs asks judge to release him on $50m bond as he awaits sentencing\n                 He also refers to Terry Long, a former NFL player who starred for the Pittsburgh Steelers. He was diagnosed with CTE after drinking anti-freeze to take his own life 20 years ago. Of course, there can be no conceivable justification to commit such a horrific act. But the attacker's note will bolster calls for more investigation into a possible link between head injuries on the football field and violent crime. Tamura never played for the NFL but had a very successful high school career in Southern California and was well liked by his coaches and teammates.  It's not known what he did after high school, however he seemed to harbour animosity towards the NFL. \"The league knowingly concealed the dangers to our brains to maximize profits,\" he writes in his note. \"They failed us.\" A Sky News investigation last year explored the link between CTE and violent attacks, including mass murder. We looked at the case of Noah Green, who was 25 when he crashed into a security cordon protecting the Capitol Building in Washington DC and stabbed police officer William Evans, killing him, before he was shot dead. It was a murder which seemed to have little to do with American football.  But Green's mother, Mazie, told me she believes his crime was caused by brain injuries sustained on the American football field. He had been a star player in high school but she said his personality changed after repeated concussions. \"He started these bad headaches. Real bad headaches,\" she said \"He's like, 'I've got to get out of the country. They're going to kill me'.\" Mazie believes Noah was suffering paranoia. After his death, the FBI recommended that his brain be examined. The diagnosis came back as stage 1 Chronic Traumatic Encephalopathy, or CTE. It is a disease caused by repetitive head trauma. Symptoms include paranoia, aggression and impulse control problems. The theory of a link between CTE and violent crime is increasingly cited in court. Kellen Winslow, a former NFL player, argued for his sentence for multiple rapes to be reduced because of head trauma on the football field. Former San Francisco 49ers star Phillip Adams shocked the country when he shot dead six people, including grandparents and their two grandchildren, then himself, in 2021. He had severe CTE. Read more from Sky News:Manhunt after couple hiking with kids killed in ArkansasOzzy Osbourne cortege to travel through Birmingham Brain banks, including the National Sports Brain Bank in Pittsburgh, ask former footballers to donate their brains for study after death. Dr Julia Kofler told me she can't rule out a link between CTE and violent crime. \"It's really difficult to draw any conclusions about what motivates someone to commit a crime based just on their pathology,\" she said. \"We certainly know that neurodegenerative diseases can cause all sorts of different, behavioural changes and changes in executive function and judgment. So it certainly could have contributed.\" The horrific mass murder committed by Shane Tamura, coupled with ramblings about CTE in the note he left behind, will intensify calls for further scrutiny of safety precautions that might be taken in contact sports."
    },
    {
        "title": "Manhunt after couple hiking with their children killed in Arkansas park",
        "description": "A manhunt is under way after a married couple were killed while hiking with their children in an Arkansas state park.",
        "url": "https://news.sky.com/story/manhunt-after-couple-hiking-with-their-children-killed-in-arkansas-park-13403296",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-clinton-brink-cristen-brink_6976605.jpg?20250729103134",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-29 06:21:00",
        "Headline": "Clinton Brink, 43, and Cristen Brink, 41, were walking with their daughters, who are aged seven and nine, when they were attacked on Saturday afternoon.",
        "Content": "A manhunt is under way after a married couple were killed while hiking with their children in an Arkansas state park. Clinton Brink, 43, and Cristen Brink, 41, were walking with their daughters, who are aged seven and nine, when they were attacked in Devil's Den State Park on Saturday afternoon, according to Arkansas State Police. Officers were called to reports of two people dead in the park at around 2.40pm, before their bodies were found on a walking trail. Arkansas's state lab are working to determine their cause of death, officials said. Their children were not injured and are safe with relatives, authorities added. A statement from the Brink family said the couple \"died heroes, protecting their little girls\". \"They deserve justice. They will forever live in all our hearts,\" the family added, asking for privacy as they \"grieve and learn to navigate this new reality\". The couple had only moved to Arkansas three weeks ago, having previously lived in California and eastern Montana, Mr Brink's sister Karina Hutchins said. Officials have not said how the couple were killed and have not provided a possible motive for the attack. The suspect has been described as white, of medium build, and was wearing a long-sleeved shirt, a dark baseball cap, and sunglasses. He was also carrying a black backpack and wearing fingerless gloves. Police said he could have sustained injuries during the attack and exited the park in a black, four-door car, possibly a Mazda, with the number plate covered with duct tape. He is then believed to have travelled on State Highway 170 or State Highway 220 to escape. Read more from Sky NewsGunman kills four in New YorkTrump reignites row with Sadiq KhanEleven stabbed in US supermarket Police have urged anyone who was in or near the park that day with smartphone or GoPro footage to come forward. The park has been closed until further notice."
    },
    {
        "title": "Has Trump broken from Netanyahu over Gaza?",
        "description": null,
        "url": "https://news.sky.com/story/has-trump-broken-from-netanyahu-over-gaza-13403268",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-29 01:32:00",
        "Headline": "No subtitle found",
        "Content": "Sir Keir Starmer travelled to Scotland for talks with Donald Trump, with the US president publicly distancing himself from Israeli Prime Minister Benjamin Netanyahu who has said there is no starvation in Gaza. How significant is this moment, as renewed UK-US aid efforts to the Strip are announced? Plus, Trump cuts down Putin's deadline to stop Russia's war in Ukraine. And Martha speaks to one of the 252 Venezuelans deported by Trump to a maximum-security prison in El Salvador. He describes brutal torture and dehumanisation - this despite not ever having committed a crime. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. You can also watch all episodes on our YouTube channel."
    },
    {
        "title": "English cricket goes into bat with bulk of £520m Hundred windfall",
        "description": "English cricket's governing body will on Wednesday hail a landmark moment for the sport when it announces that three-quarters of the deals to bring in new investors to The Hundred have been completed.",
        "url": "https://news.sky.com/story/english-cricket-goes-into-bat-with-bulk-of-163520m-hundred-windfall-13403654",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-the-hundred-cricket_6828032.jpg?20250729193438",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-29 17:35:00",
        "Headline": "The ECB will announce on Wednesday that six of the eight Hundred franchise stake sales have been completed days before the 2025 tournament gets under way, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n English cricket's governing body will on Wednesday hail a landmark moment for the sport when it announces that three-quarters of the deals to bring in new investors to The Hundred have been completed. Sky News understands that the England and Wales Cricket Board (ECB) plans to issue a statement confirming that it has received proceeds from the sale of stakes in Birmingham Phoenix, London Spirit, Manchester Originals, Northern Superchargers, Southern Brave and Welsh Fire. The two other franchise deals - involving the Oval Invincibles and Nottinghamshire's Trent Rockets - will be completed on October 1, the ECB is expected to say. One insider said a statement was likely to be issued on Wednesday, although they cautioned that the timing could slip. When all eight deals are concluded, they will generate a collective windfall of £520m for the sport's strained coffers. Last week, Sky News revealed that unresolved talks between India's richest family and Surrey County Cricket Club - which hosts the Oval Invincibles Hundred team - were threatening to delay the delivery of a vast windfall for the sport. One of the outstanding issues relates to the name under which the Oval Invincibles will play in future years, with the Ambani family keen to use a derivative of the Mumbai Indians brand that it also owns. \n                  The Hundred: Steve Smith to play in 2025 but Ben Stokes opts out; Meg Lanning and Rashid Khan will also play\n                 \n                  Microsoft and Google chiefs in £295m deal for London Spirit Hundred\n                 \n                  Cricket chiefs stage live 'super-over' shootout for Hundred stakes\n                 This week's announcement will come after months of talks after the ECB and the eight Hundred-playing counties agreed exclusivity periods with their preferred investors. The backers include some of the world's most prominent financiers, billionaires and technology executives. Following protracted talks, the ECB has agreed to revised terms with the investors, with host venues now retaining control of their teams' intellectual property rights. The investors will also hold an effective veto over future expansion of the Hundred, while the ECB will be barred from launching any other short-form professional version of the sport while the Hundred remains operational. Meanwhile, the governing body will retain full ownership of the competition itself as well as controlling the regulation of it and the window within which it can be played each year. The ECB has been waiting for investors in the eight franchises to sign participation agreements since an auction in February, which valued the participating teams at just over £975m. Some of the deals involve the investors owning 49% of their respective franchise, while India's Sun TV Network has taken full ownership of Yorkshire's Northern Superchargers. The proceeds of its stake sales will be distributed to all of English cricket's professional counties as well as £50m being delivered to the grassroots game. The windfalls are being seen as a lifeline for many cash-strapped counties which have been struggling under significant debt piles for many years. The most valuable Hundred sale saw a group of technology tycoons, including executives from Google and Microsoft, paying about £145m for a 49% stake in Lord's-based London Spirit. This year's tournament kicks off next week with fixtures including a clash between the two London-based franchises. The ECB declined to comment."
    },
    {
        "title": "Revealed: The scale of cheap Chinese imports flown into UK without paying any tariffs",
        "description": "The scale of cheap Chinese e-commerce imports flown into Britain without paying any tariffs has become clearer following a Sky News investigation into this new multi-billion pound phenomenon.",
        "url": "https://news.sky.com/story/revealed-the-scale-of-cheap-chinese-imports-flown-into-uk-without-paying-any-tariffs-13403101",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-china-trade_6976203.jpg?20250728160022",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-07-29 03:00:00",
        "Headline": "Sky News uncovers the first official estimate of the value of so-called \"de minimis\" imports into Britain ahead of an official inquiry into whether this legal clause should be allowed to continue.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  The scale of cheap Chinese e-commerce imports flown into Britain without paying any tariffs has become clearer following a Sky News investigation into this new multi-billion pound phenomenon. We have uncovered the first official estimate of the value of so-called \"de minimis\" imports into Britain, ahead of an official inquiry into whether this legal clause - which excludes packages worth less than £135 from paying customs duties - should be allowed to continue. Companies like Shein and Temu have become big players in British retail, not to mention elsewhere around the world, by manufacturing cheap products in China and then posting them directly to consumers, benefiting from the de minimis rules. Clothing manufacturers in the UK claim that de minimis makes it nearly impossible to compete with these Chinese competitors, raising questions about the viability of domestic textile and apparel production. However, economists argue that the main beneficiaries of the policy to exclude cheap imports from customs are lower-income households, since it allows them to spend less on their shopping. Removing it, they say, would disproportionately affect poorer families. The government has committed to an inquiry into the rules, which are also being changed in the EU and the US, but up until now there has been no official estimate of its scale. According to HM Revenue and Customs data released to Sky News following a Freedom of Information request, the total declared trade value of de minimis imports into the UK in the last fiscal year (2024-25) was £5.9bn. That was a 53% increase on the previous year (£3.9bn), underlining the scale of growth of e-commerce imports into the UK. While it is hard to gauge how much revenue this means the Treasury has forgone, an illustrative 20% tariff on flows of that order could raise more than £1bn. While that sum alone would not fill the fiscal black hole faced by Chancellor Rachel Reeves in the coming budget, it would nonetheless be nearly enough to pay for the government's recent U-turn on winter fuel allowances. Sky has also obtained the first television access deep into the supply chain, helping bring those goods into the UK, as it boarded a flight that had just travelled from Chongqing to Bournemouth Airport. We filmed inside the belly of a plane belonging to European Cargo, one of a number of air cargo firms booming as a result of these trade flows. Read more:The rarely examined trade clause about to become a very big dealUK city's clothing industry in crisis The untold story about de minimis is that it hasn't just had an impact on shopping habits in the UK, or for that matter, the textiles manufacturing sector - it has also changed patterns of distribution. Struggling regional airports that never saw their passenger numbers recover after the pandemic are now re-establishing themselves as hubs for cargo. European Cargo is now the single biggest airline at Bournemouth Airport, despite not carrying a single passenger. Other regional airports like East Midlands Airport and Prestwick in Scotland are seeing rapid growth in flows of trade. All of which raises the stakes for the government's inquiry into the de minimis system. At present, there is no timeline for its decision, but removing the clause would have far-reaching effects across the economy."
    },
    {
        "title": "Italian restaurant chain Gusto on brink of administration",
        "description": "The intense financial pressure facing Britain&#8217;s casual dining sector will be underlined this week when Gusto, the Italian restaurant chain, falls into administration.",
        "url": "https://news.sky.com/story/italian-restaurant-chain-gusto-on-brink-of-administration-13403309",
        "image_url": "https://e3.365dm.com/18/09/1920x1080/pizza-junk-food-generic_4419346.jpg?20180913105202",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-29 06:47:00",
        "Headline": "The owner of Latin American-themed dining chain Cabana is in talks to buy the majority of Gusto's sites through a pre-pack insolvency, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The intense financial pressure facing Britain’s casual dining sector will be underlined this week when Gusto, the Italian restaurant chain, falls into administration. Sky News has learnt that Interpath Advisory is preparing a pre-pack insolvency of Gusto, which trades from 13 sites. Sources said that a vehicle set up by Cherry Equity Partners, the owner of Latin American restaurant concept Cabana, was the likely buyer. Money latest: Supermarkets report further food price hikes It is expected to take over most of Gusto's sites although some job losses are likely. A deal could be announced in the coming days, according to insiders. The collapse of Gusto, which is backed by private equity investor Palatine, follows a string of increasingly heated warnings from hospitality executives about the impact of tax rises on the sector. \n                  English cricket goes into bat with bulk of £520m Hundred windfall\n                 \n                  Revealed: The scale of cheap Chinese imports flown into UK without paying any tariffs\n                 \n                  Money blog: Greggs shares sink; age group most affected if state pension age changes early \n                 Kate Nicholls, who chairs UK Hospitality, said this month that the industry faced a jobs bloodbath amid growing financial pressure on operators. This week, Sky News reported that the restaurant industry veteran David Page, a former boss of PizzaExpress, was raising £10m to take advantage of cut-price acquisition opportunities in casual dining. Mr Page is planning to become executive chairman of London-listed Tasty, which owns Wildwood and dim t, and rename it Bow Street Group. A placing of shares in the company is likely to be completed this week. Interpath declined to comment on the Gusto process."
    },
    {
        "title": "BlackRock plots sale of pensions specialist Heywood",
        "description": "A private equity fund managed by the world's biggest institutional investor is plotting the sale of a pensions software provider it bought four years ago.",
        "url": "https://news.sky.com/story/blackrock-plots-sale-of-pensions-specialist-heywood-13403330",
        "image_url": "https://e3.365dm.com/21/06/1920x1080/skynews-blackrock-logo_5405827.jpg?20210605102936",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-29 08:08:00",
        "Headline": "The asset management behemoth's Long Term Private Capital vehicle is working with bankers on the sale of the software company it bought in 2021, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A private equity fund managed by the world's biggest institutional investor is plotting the sale of a pensions software provider it bought four years ago. Sky News has learnt that BlackRock's Long Term Private Capital (LTPC) vehicle is working with bankers on the sale of Heywood, for which it paid about £350m in 2021. City sources said that advisers at Evercore had been hired to work on the deal. A formal sale process is expected to get underway in the near future. Money latest: Age group most affected if state pension age raised early Heywood - previously known as Aquila Heywood - was formed from the merger of two companies in 2002, with the Aquila part of the group subsequently being sold to Equiniti, the share registrar provider. The company was one of the first bought by BlackRock's LTPC fund, which has also made investments in Authentic, the brand-owner which has a partnership with Sir David Beckham's consumer goods stable. \n                  English cricket goes into bat with bulk of £520m Hundred windfall\n                 \n                  Revealed: The scale of cheap Chinese imports flown into UK without paying any tariffs\n                 \n                  Money blog: Greggs shares sink; age group most affected if state pension age changes early \n                 BlackRock is the world's largest asset manager by far, with more than $11.5trn in assets under management, having been buoyed by a couple of major recent acquisitions. Based in Altrincham in Cheshire, Heywood counts local government and private sector pension schemes among its clients. The company is run by chief executive Sian Jones. Its valuation in a potential sale was unclear on Tuesday. A BlackRock spokesman declined to comment."
    },
    {
        "title": "Water firm faces £63m penalty over 'excessive' sewage spills",
        "description": "Anglian Water is the latest supplier to face down the prospect of a large bill for failures in its handling of sewage, leading to \"excessive spills\".",
        "url": "https://news.sky.com/story/water-firm-faces-16363m-penalty-over-excessive-sewage-spills-13403294",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sewage-water_6917319.jpg?20250515150237",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-07-29 06:09:00",
        "Headline": "Ofwat, soon to be scrapped under a major shake-up of water industry oversight, says the money will go towards improvements for customers. ",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Anglian Water is the latest supplier to face down the prospect of a large bill for failures in its handling of sewage, leading to \"excessive spills\". The industry regulator Ofwat - soon to be scrapped under a planned shake-up of industry oversight - said it was proposing a £62.8m penalty and remedial action following an investigation. It was recommending the enforcement package after finding that Anglian had breached its legal obligations in operating its wastewater treatment works and network. Money latest: Supermarkets report further food price hikes The investigation found shortcomings in wastewater assets along with the processes and management of them, including at senior management and board level. As part of the package of measures it was proposing, Ofwat said that £5.8m of the penalty would go towards a community fund to support projects focusing on restoring the water environment. The rest of the money would go towards delivering systems, in at least eight catchments, that would enable storm flows to be substantially improved. \n                  English cricket goes into bat with bulk of £520m Hundred windfall\n                 \n                  Revealed: The scale of cheap Chinese imports flown into UK without paying any tariffs\n                 \n                  Money blog: Greggs shares sink; age group most affected if state pension age changes early \n                  Lynn Parker, senior director for enforcement at Ofwat, said: \"Our investigation has found failures in how Anglian Water has operated and maintained its sewage works and networks, which has resulted in excessive spills from storm overflows. This is a serious breach and is unacceptable. \"We understand that the public wants to see transformative change. That is why we are prioritising this sector-wide investigation which is holding wastewater companies to account for identified failures. \"We are pleased Anglian Water has accepted that it got things wrong and is now focusing on putting that right and taking action to come back into compliance. We expect all companies to do the same so that customers can regain confidence in their water company and the critical service they provide.\"  The company had already committed £100m to improve its spills and pollution performance.  Anglian boss Mark Thurston said: \"We understand the need to rebuild trust with customers and that aspects of our performance need to improve to do that. \"Reducing pollutions and spills is our number one operational focus, and we have both the investment and the partners in place to deliver on those promises as part of our £11bn business plan over the next five years. \"In the meantime, we have proposed this redress package, recognising the need to invest in the communities and environments most impacted. \"It will take time and investment to achieve a significant reduction in spills, but we are making good progress.\" Read more:Greater protections coming for water consumers Thames Water hit with record fine The government announced earlier this month that Ofwat would be abolished in favour of a new super regulator after a landmark report on the industry. Sir Jon Cunliffe's review made 88 recommendations, finding that the industry was not working for any stakeholders, including consumers. Users have been left angry over a historic lack of investment by firms, leaving them vulnerable to climate change-linked challenges including both drought and adverse weather alike. Household bills are rising by an average £10 a month this financial year to help fix the shortcomings."
    },
    {
        "title": "Starmer's plan to recognise Palestinian state labelled 'appeasement towards jihadist terrorists' by Netanyahu",
        "description": "Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu.",
        "url": "https://news.sky.com/story/starmers-plan-to-recognise-palestinian-state-labelled-appeasement-towards-jihadist-terrorists-by-netanyahu-13403756",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-food-aid_6976538.jpg?20250729081053",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-29 20:37:00",
        "Headline": "The prime minister's plan was welcomed by some, while he was accused by others of pandering to his MPs and France.",
        "Content": " Sir Keir Starmer's plan to recognise Palestine as a state has been attacked as \"appeasement towards jihadist terrorists\" by Israeli Prime Minister Benjamin Netanyahu. The prime minister said the UK will recognise a Palestinian state by September unless Israel takes \"substantive steps\" to end the situation in Gaza, Israel agrees to a ceasefire, commits to a long-term sustainable peace, allows the UN to restart aid supplies and does not annexe the West Bank. About 250 MPs from all parties - half of them Labour - had signed a letter last week calling for Sir Keir to immediately recognise a Palestinian state. Politics latest: PM's Palestine plan labelled 'absurd' Sir Keir said that by giving Israel a deadline of 9 September UN meeting, he hoped this would play a part \"in changing the conditions on the ground, and making sure aid gets into making sure that there is hope of a two-state solution for the future\". But Mr Netanyahu condemned the plan, saying Sir Keir \"rewards Hamas's monstrous terrorism and punishes its victims\". \"A jihadist state on Israel's border today will threaten Britain tomorrow,\" he wrote on X. \n                  What does recognising a Palestinian state mean?\n                 \n                  Sir Keir Starmer's significant breakthrough on Gaza won't please everyone\n                 \n                  UK to recognise Palestine as a state in September - unless Israel meets conditions\n                 \"Appeasement towards jihadist terrorists always fails. It will fail you too. It will not happen.\" The Israelis also accused Sir Keir of pandering to his MPs and France, after Emmanuel Macron committed to recognising a Palestinian state last week, and harming efforts to release Israeli hostages. Lib Dems and Greens: 'Bargaining chip' Sir Keir also faced accusations of using Palestinian state recognition as a \"bargaining chip\" by both the Lib Dems and the Green Party. Lib Dem leader Sir Ed Davey said a Palestinian state should have been recognised \"months ago\" and \"far greater action\" is needed to stop the humanitarian disaster in Gaza. Green Party foreign affairs spokesperson Ellie Chowns, who wants immediate state recognition, said it was a \"cynical political gesture\". Humza Yousaf, Scotland's former SNP first minister, who revealed a family member was killed in Gaza days ago, told Sky News statehood \"shouldn't be dependent\" upon the conditions Sir Keir has set for Israel, but is the \"inalienable right\" of the Palestinian people. The British Palestinian Committee, representing Palestinian interests in the UK, described conditions as \"absurd and performative\". UK Jewish groups seek clarity The Board of Deputies of British Jews, the UK's largest Jewish organisation, said it was \"seeking urgent clarification\" that the UK will not recognise Palestine as a state if Israeli hostages remain in Hamas captivity, or if Hamas keeps rejecting a ceasefire deal. The Labour Friends of Israel group said it has \"shared goals\" with the government but state recognition \"will be a merely symbolic act unless the UK uses its influence to establish the principles of a meaningful pathway to a Palestinian state\". Read more: What does recognising a Palestinian state mean?Children 'eating out of piles of garbage' as time runs out for Gaza Sarah Champion, Labour MP and chair of the international development committee, who started the MP letter calling for state recognition, said she was \"delighted and relieved\". However, she added: \"I'm troubled our recognition appears conditional on Israel's actions.\" When Foreign Secretary David Lammy announced the plan at a UN meeting, he received applause. Not many other Labour MPs commented. Tories accuse Starmer of appeasing MPs Conservative leader Kemi Badenoch accused Sir Keir of being more focused on a \"political problem for the Labour Party\" than other issues facing the UK. \"Recognising a Palestinian state won't bring the hostages home, won't end the war and won't get aid into Gaza,\" she posted on X. \"This is political posturing at its very worst.\" Tory shadow foreign secretary Priti Patel said the announcement was \"to appease his backbenchers\" as \"he knows that promises to recognise Palestine will not secure lasting peace\". Trump did not discuss statehood with Starmer Donald Trump said he and Sir Keir \"never did discuss\" the PM's plan to recognise a Palestinian state during their meetings in Scotland the day before.  However, Tammy Bruce, spokeswoman for the US state department, said Sir Keir's plan is a \"slap in the face for the victims of October 7\", which \"rewards Hamas\", the Telegraph reported."
    },
    {
        "title": "British Palestinians call UK plan to recognise Palestinian state 'absurd and performative'",
        "description": "British Palestinians have called Sir Keir Starmer's decision to recognise Palestine as a state if Israel does not abide by conditions \"absurd and performative\" - and will not allay concerns about people in Gaza.",
        "url": "https://news.sky.com/story/british-palestinians-call-uk-plan-to-recognise-palestinian-state-absurd-and-performative-13403439",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-aid-palestinian_6975949.jpg?20250728114602",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-07-29 11:11:00",
        "Headline": "A group representing Palestinian interests in the UK says the government needs to take immediate steps to end the hunger crisis in Gaza.",
        "Content": "\n          Political reporter\n              @alixculbertson\n British Palestinians have called Sir Keir Starmer's decision to recognise Palestine as a state if Israel does not abide by conditions \"absurd and performative\" - and will not allay concerns about people in Gaza. After recalling his cabinet ministers from parliamentary recess on Tuesday, the prime minister said the UK will recognise a Palestinian state by September if Israel agrees to end the \"appalling situation in Gaza\". Gaza latest: 'Worse-case scenario of famine' unfolding The British Palestinian Committee (BPC), which represents the experiences of Palestinians in the UK, sent Sir Keir a letter ahead of the meeting urging him to take actions they said could make a real difference to people in Gaza. They had urged him to not recognise Palestine as a state without taking measures to \"end the genocide\" in Gaza, calling it \"symbolic\" and said it \"must not be used to deflect from accountability\". After Sir Keir announced his plan to recognise Palestine, Dr Sarah Husseini, BPC director, told Sky News the plan is \"absurd while Israel continues to exterminate and starve women, men and children\". She added: \"What is needed is urgent accountability for the genocide in Gaza and an end to UK military support to the state committing these crimes. \"This performative announcement does little to allay the concerns of Palestinians in this country. It will not relieve the government of its legal duties, and it will not silence the calls from the British public to end British complicity in the atrocities being livestreamed to their phones.\"  The war has now been going on for 21 months after it was sparked by Hamas militants killing 1,200 Israelis and taking 250 hostages on 7 October 2023. The militant group still holds 50 hostages, of whom only 20 are believed to be alive. Sir Keir had been under pressure from his own MPs and other UK political parties, notably since France last week said it will recognise Palestine as a state, but had resisted - saying recognition needs to be part of a wider peace plan. He has also refused to say whether \"genocide\" is taking place in Gaza - a claim Israel has vehemently denied. Israel paused fighting in three areas for another 10 hours today to help aid distribution, the third day it has done so amid mounting international condemnation of the scenes of hunger unfolding in Gaza. David Mencer, a spokesperson for the Israeli government, said: \"There is no intent, (which is) key for the charge of genocide... it simply doesn't make sense for a country to send in 1.9 million tonnes of aid, most of that being food, if there is an intent of genocide.\" Israel also rejected Sir Keir's plan and accused him of pandering to his MPs and the French. The Israeli foreign ministry said: \"The shift in the British government's position at this time, following the French move and internal political pressures, constitutes a reward for Hamas and harms efforts to achieve a ceasefire in Gaza and a framework for the release of hostages.\" Read more:25% of young children and pregnant women malnourished in GazaThe view from a plane dropping aid into Gaza In the BPC's letter, it had said the government has \"not only a political and moral obligation, but a legal obligation\" to take three steps. They are: • Preventing and punishing Israel's \"genocide\" in Gaza and to end \"all complicity in it\" • Apply \"immediate and comprehensive sanctions on Israel\" • Safeguard the rights to freedom of expression and assembly in the UK More specifically, the group called on Sir Keir to end \"all forms of military collaboration, urgently review all public contracts to ensure they are not aiding unlawful occupation or genocidal acts, and support universal jurisdiction mandates\".  The group said these steps would help towards ending the starvation crisis in Gaza, which it said had been made possible \"due to the impunity granted to\" Israel and \"compounded by the active military, economic and diplomatic support from states such as the UK\". They also accused the UK government of introducing \"draconian legislation to limit the rights\" of British citizens campaigning to end the atrocities \"and British complicity in those atrocities\"."
    },
    {
        "title": "Sir Keir Starmer's significant breakthrough on Gaza won't please everyone",
        "description": "At the weekend, Downing Street said recognition of Palestine was \"a matter of when, not if\".",
        "url": "https://news.sky.com/story/sir-keir-starmers-significant-breakthrough-on-gaza-wont-please-everyone-13403683",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-sir-keir-starmer-starmer_6977350.jpg?20250729215027",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-29 18:38:00",
        "Headline": "Was it pressure from MPs and cabinet ministers that forced the PM to change his position? Almost certainly. ",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  At the weekend, Downing Street said recognition of Palestine was \"a matter of when, not if\". So why now? \"We will recognise the state of Palestine in September before the United Nations General Assembly\", Sir Keir Starmer announced on Tuesday, in what looks like another U-turn. Politics latest: PM's Palestine plan 'absurd' Was it pressure from the more than 250 MPs, most of whom are Labour, who wrote to the prime minister last week calling for recognition? Almost certainly. The PM has a lot of form now for bowing to pressure from Labour MPs poised to rebel against government policy. The demand to the PM in the letter orchestrated by Labour MP Sarah Champion, who chairs the all-party international development select committee, was for the government to recognise Palestine at the United Nations conference on the Middle East currently taking place in New York. \n                  What does recognising a Palestinian state mean?\n                 \n                  UK to recognise Palestine as a state in September - unless Israel meets conditions\n                 \n                  Children 'eating out of piles of garbage' as time runs out for Gaza\n                 Foreign Secretary David Lammy was cheered and applauded when he repeated the pledge made by Sir Keir in a near-empty room in Downing Street to TV cameras and just two journalists. But there are conditions. And the early response from the Israelis was not encouraging.  First, the PM said, \"end the appalling situation in Gaza\", then \"a ceasefire, no annexation in the West Bank and a long-term peace process that delivers a two-state solution\". Good luck, as they say, with that. If the shift in the PM's position wasn't the result of pressure from MPs, was it a potential mutiny inside the cabinet? It followed a lengthy cabinet meeting after ministers were dragged from their sun beds and allowed to dial in remotely rather than turn up at 10 Downing Street in person.  It was reported before the meeting that seven cabinet ministers, including big hitters Mr Lammy and the Deputy Prime Minister Angela Rayner, backed recognising Palestine. So yes, the PM could see that the way cabinet ministers were moving and holding out against recognition was becoming unsustainable. Was it the result of pressure from President Macron. That was certainly a major factor too. After \"le bromance\" during the president's state visit, the two leaders spoke at length at the weekend. Asked what difference recognising Palestine would make in practice, Sir Keir said the aim was that it would help improve conditions on the ground in Gaza. Read more:British Palestinians attack PM's planExplainer: Recognising a Palestinian state?Gaza children 'eating out of piles of garbage' Ahead of his statement, the PM briefed Israel's Prime Minister Benjamin Netanyahu and the King of Jordan, whose country is spearheading the air drops of aid into Gaza. More phone calls with world leaders are planned in the coming hours. Sir Keir wouldn't answer a question about what assurances he'd received from President Trump during their talks in Scotland about using his influence with the Israeli PM to allow aid into Gaza. That is the most urgent priority, as the PM acknowledged. And since President Trump, speaking about the horrible TV pictures from Gaza, memorably said \"you can't fake that\" and \"every ounce of food\" should be allowed in, it seems he did indeed listen to Sir Keir's pleas in Scotland. So even if he has indeed bowed to pressure from MPs and cabinet ministers, Sir Keir has achieved a significant breakthrough in the past 48 hours or so. He won't please everyone, obviously, but no politician ever did in the Middle East."
    },
    {
        "title": "Nigel Farage demands apology over 'disgusting' Jimmy Savile comparison",
        "description": "Nigel Farage has demanded an apology from a cabinet minister who claimed his opposition to online safety laws meant he was \"on the side\" of predators including the late Jimmy Savile.",
        "url": "https://news.sky.com/story/nigel-farage-demands-apology-over-disgusting-jimmy-savile-comparison-13403301",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reform-nigel-farage_6975963.jpg?20250728130942",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-29 06:38:00",
        "Headline": "The Reform UK leader responds after Peter Kyle, the science and technology secretary,  claimed his opposition to online safety laws meant he was \"on the side\" of predators.",
        "Content": " Nigel Farage has demanded an apology from a cabinet minister who claimed his opposition to online safety laws meant he was \"on the side\" of predators including the late Jimmy Savile. The Reform UK leader said the comments by Peter Kyle, the science and technology secretary, were \"disgusting\" and urged him to retract his statement. In a broadcast from Reform UK's London headquarters, Mr Farage played back Peter Kyle's comments, made to Sky News, and said they were \"so below the belt\". Politics latest: PM to hold emergency cabinet meeting on Gaza crisis \"Well this is so absolutely disgusting that it's almost beyond belief,\" he said. \"Just how low can the Labour government sink in its desperation. \"Yes, of course they're in trouble. They're well behind us in the opinion polls. But frankly, to say that I would do anything that would in any way aid and abet people like Jimmy Savile, it's so below the belt.\" He was joined in his condemnation by former Reform chair Zia Yusuf. \n                  Eighty years on from Labour's landslide, the humanitarian crisis in Gaza brings Clement Attlee's failure on Israel and Palestine to mind\n                 \n                  Inside Jeremy Corbyn's new party: Is the Labour left making a comeback?\n                 \n                  'Pure greed': MPs demand Southern Water CEO refuses 'massive payout'\n                 \"It's one of the most outrageous and disgusting things a politician has said in the political arena that I can remember,\" he told Wilfred Frost on Sky News. \"What it also shows is Labour have no idea how the internet actually works, which is why they aren't willing to admit this act, despite its name, is actually going to make children less safe. \"It also shows how deeply unserious they are about child safety. Labelling that allegation, talking about Jimmy Savile in that way, does nothing other than denigrate the victims of Jimmy Savile.\" Mr Kyle claimed to Wilfred Frost on Sky News Breakfast that Mr Farage's opposition to the Online Safety Act, which aims to restrict children's access to harmful content online, meant he was \"on the side\" of \"extreme pornographers\". He accused Mr Farage of wanting to \"turn the clock right back\" after the Reform leader vowed to repeal the act over free speech concerns. \"I see that Nigel Farage is already saying that he's going to overturn these laws,\" he said. \"So you know, we have people out there who are extreme pornographers, peddling hate, peddling violence. Nigel Farage is on their side. \"Make no mistake about it, if people like Jimmy Savile were alive today, he'd be perpetrating his crimes online. And Nigel Farage is saying that he's on their side.\" Asked to clarify his comments, Mr Kyle said: \"Nigel Farage is on the side of turning the clock back to the time when strange adults, strangers can get in touch via messaging apps with children.\" Shortly after Mr Farage's response, Mr Kyle doubled down on his comments, posting on X: \"If you want to overturn the Online Safety Act you are on the side of predators. It is as simple as that.\" The Labour Party also tweeted:\" Nigel Farage wants to scrap vital protections for young people online. Reform offers anger but no answers.\" The Online Safety Act, which was passed in 2023, requires online platforms such as social media sites and search engines to take steps to prevent children accessing harmful content such as pornography or material that encourages suicide. The rules of the act, which came into effect on 25 July, include introducing age verification for websites and ensuring algorithms do not work to harm children by exposing them to such content when they are online. Failure to comply with the new rules could incur fines of up to £18m or 10% of a firm's global turnover, whichever is greater. At a press conference on Monday, Mr Farage and Mr Yusuf vowed to scrap the \"dystopian\" act, arguing it did \"absolutely nothing to protect children\" but worked to \"suppress freedom of speech\" and \"force social media companies to censor anti-government speech\". Describing the legislation as \"the greatest assault on freedom of speech in our lifetimes\", Mr Yusuf vowed to repeal the act \"as one of the first things a Reform government does\". He also argued that children are circumventing age checks on adult websites using VPNs (Virtual Private Networks) to make it appear as if they are located outside the UK. He also said such restrictions would push children to the dark web. \"Sending all of these kids onto VPNs is a far worse situation, and sends them much closer to the dark web, where the real dangers lie,\" he said. Read more:What is the Online Safety Act?Suicide forum first to be investigated by Ofcom under new online safety laws Asked what he would do to protect children online, Mr Farage acknowledged he did not have \"a perfect answer\" but said his party had \"more access to some of the best tech brains, not just in the country but in the world\" and would \"make a much better job of it\". The Online Safety Act was introduced in part to make the internet safer for children following the death of Molly Russell, whose inquest found that she died from \"an act of self-harm while suffering from depression and the negative effects of online content\". Andy Burrows, chief executive of the Molly Rose Foundation, said scrapping the act \"would be a retrograde move that would not only put children at greater risk but is out of step with the mood of the public\". Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Minister 'weaponising' Savile will make Labour MPs queasy - but there's a bigger risk",
        "description": "Sometimes governments blindly idle into political fights and sometimes they go windmilling in with purpose.",
        "url": "https://news.sky.com/story/minister-weaponising-savile-will-make-labour-mps-queasy-but-theres-a-bigger-risk-13403669",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/b01eb9d2fc329cc13875ddcd5c21bb3e89e37630cfdfd540ce9ae0e49231a35d_6976607.jpg?20250729144125",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-07-29 18:13:00",
        "Headline": "The last politician to invoke Jimmy Savile was Boris Johnson when he accused Sir Keir Starmer of failing to investigate him when he headed the CPS. The episode led to the resignation of Mr Johnson's top policy aide.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Sometimes governments blindly idle into political fights and sometimes they go windmilling in with purpose. The extraordinary row picked by Peter Kyle on Sky News on Tuesday is most definitely the latter of these two. The science secretary's reference to Jimmy Savile was no slip of the tongue. Ministers seem to believe Reform UK has made a misjudgement in pledging to scrap internet safety laws, given the massive unease across the country about what children are viewing online. As a result, Kyle is trying to point at their position by stoking a spat with (some would say) inflammatory language that sucks up media attention. It's not exactly a new technique. Think back to 2023 and Labour did something very similar when it ran attack ads accusing Rishi Sunak of not wanting to lock up child abusers - in a bid to draw attention to the criminal justice system. Go even further back, and it's essentially the same strategy employed on the red Brexit bus in 2016 with its pledge to divert money from the EU to the NHS. All heavily disputable claims that are made to start a row and move the spotlight on to a politically convenient topic. But the risk inherent in tactics like this is that it makes some on your own side feel a little icky. The last politician to invoke Jimmy Savile as part of a political attack was Boris Johnson when he accused Sir Keir Starmer of failing to investigate the serial child abuser when he was the country's head prosecutor. That led to the resignation of the then prime minister's top policy aide. Read more from Sky News:Police investigate Tommy Robinson video over assault claimsHow Corbyn's party is preparing to take on Labour There will be plenty in Labour who feel similarly queasy about a cabinet minister weaponising one of the country's most notorious paedophiles to lay into an opposition party. The bigger risk though is whether Peter Kyle will really emerge victorious from this fight. Nigel Farage is going for the Online Safety Act in part because it fits with his party's narrative around mainstream politics trying to silence the concerns of ordinary people. Those disenfranchised sections of society are a key group of voters that Reform are trying to reach. Whether they are outweighed by those put off the party by its recent pronouncements remains to be seen. But for now, this seems to be a fight that Nigel Farage is also keen to have."
    },
    {
        "title": "Hillsborough bereaved hit out at reported appointment of former Sun editor to senior government role ",
        "description": "Families bereaved by the Hillsborough disaster have urged Sir Keir Starmer to reconsider the reported appointment of a former Sun editor to a senior government role. ",
        "url": "https://news.sky.com/story/hillsborough-bereaved-hit-out-at-reported-appointment-of-former-sun-editor-to-senior-government-role-13403575",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tributes-hillsborough_6887105.jpg?20250415100153",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-07-29 14:46:00",
        "Headline": "The Sun remains boycotted on Merseyside to this day after publishing unfounded allegations about fans in the immediate aftermath of the stadium crush, which killed 97 people. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Families bereaved by the Hillsborough disaster have urged Sir Keir Starmer to reconsider the reported appointment of a former Sun editor to a senior government role.  David Dinsmore, who edited the tabloid newspaper from 2013 to 2015 and is now the chief operating officer of its parent company News UK, is expected to become permanent secretary for communications. Politics Live: PM holding emergency cabinet meeting over Gaza In a letter to the prime minister, Hillsborough families have claimed he is \"manifestly unsuitable\" for the role because of his association with The Sun, which is widely reviled on Merseyside because of its reporting of the tragedy. In 1989, four days after the stadium crush, The Sun's front page had the headline 'The Truth' and included unfounded claims that some Liverpool fans had urinated on police officers resuscitating the dying, and that some had stolen from the dead. The reporting led to a city-wide boycott that remains in place to this day. The letter to Sir Keir said: \"After the Hillsborough disaster in the midst of unimaginable suffering among the bereaved and the survivors, the Sun newspaper published vicious lies about the conduct of fans. \"Graphic and false allegations cast the deceased and those who survived as barbaric, feckless and inhumane.\" The signatories, which include survivors and victims of other scandals, called Mr Dinsmore \"manifestly unsuitable for public appointment\". They also highlighted delays to the long-promised Hillsborough Law, adding: \"This appointment gives us less reason to trust the government. \"It risks damaging public confidence in the state among those affected by Hillsborough, everyone connected to Liverpool, and all who feel solidarity with them.\" The Sun apologised for its coverage of Hillsborough in 2012, after an independent panel concluded that no Liverpool fans were responsible in any way for the disaster, and that the main cause was failings by police which were subsequently covered up. In 2016, an inquest jury found the victims were unlawfully killed.  Charlotte Hennessy, who lost her father Jimmy Hennessy in the tragedy when she was six years old, told Sky News the claims in the Sun \"is one of the main reasons why we had to fight for so long\", as she urged the prime minister to \"backtrack on appointing someone so unsuitable for public office as Dinsmore\". The decision has also been criticised by Liverpool's Metro Mayor Steve Rotheram, who called the appointment a \"deeply insensitive choice\". \"The paper Dinsmore once led printed falsehoods that caused unimaginable pain. That shouldn't be brushed off as a footnote in his CV - it should be a red line,\" the former Labour MP said on X. Liverpool MPs Ian Byrne, Paula Barker, and Kim Johnson have also written to the prime minister to express concerns. They said that a key requirement of Hillsborough Law, which Sir Keir has promised to put on the statute books in full, is to ensure that senior government officials and civil servants would be legally compelled to tell the truth following a tragedy at the hands of the state. Their letter said: \"What sort of message do you believe your appointment of Dinsmore into a senior Government role sends to Hillsborough families and survivors, who have lived through so much pain and suffering at the hands of the publication he has previously edited?\". Mr Dinsmore's appointment was first reported by The Telegraph, which described the role as a new position created after the prime minister voiced concerns about government communications late last year. The appointment has not been officially confirmed. Number 10 has declined to comment when contacted by Sky News. A Cabinet Office spokesperson said no appointment had yet been made, so they would not comment on Dinsmore."
    },
    {
        "title": "Trump visit gives Swinney golden opportunity to butter up president on Scotch whisky tariffs exemption",
        "description": "There had been much talk of the possibility of a frosty reception when the US president locked eyes with Scotland's first minister.",
        "url": "https://news.sky.com/story/trump-visit-gives-swinney-golden-opportunity-to-butter-up-president-on-scotch-whisky-tariffs-exemption-13403325",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-whisky-tartan_6976819.jpg?20250729141357",
        "type": "Politics",
        "Author": "Connor Gillies",
        "Date Published": "2025-07-29 07:40:00",
        "Headline": "The US president's private visit to Scotland is coming to an end.  Scotch whisky tariffs will be at the fore of the first minister's agenda.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n There had been much talk of the possibility of a frosty reception when the US president locked eyes with Scotland's first minister. Donald Trump and John Swinney are not natural friends. They couldn't be further apart politically speaking and personality-wise. However, it seems Mr Trump is enjoying his foreign holiday enough for the pair to park their differences and bond over their mutual love for Scotland. As Mr Trump departed the White House, he branded Mr Swinney a \"good man\" before turning up the love suggesting he had heard \"good things\" about the SNP leader. As close to an endorsement as it gets from Mr Trump. The White House extended an invite for a one-to-one meeting between the president and first minister but last night came another opportunity, in the form of a VIP dinner. Sources close to the Aberdeenshire banquet, where seafood was on the menu, described it as a \"productive, interesting\" event. I am told Mr Swinney and Prime Minister Sir Keir Starmer sat on either side of the president in an evening where they talked golf and trade in the company of around 20 others.  POTUS (president of the United States) had earlier said he wanted to see Scotland \"thrive\" and clearly the presence of both Mr Swinney and Mr Starmer created the golden opportunity to butter up the president who is mulling over reducing Scotch whisky tariffs to zero. Sources in the room described the first minister as \"landing some arguments\" before the prime minister departed the event early. Ditching dessert apparently. But the dinner had all the ingredients to be an awkward encounter. The first minister previously called for the upcoming state visit with Mr Trump to be axed in the wake of the Volodymyr Zelenskyy White House shouting match earlier this year. And in true Mr Trump style, just hours before the Aberdeenshire summit the president had been freewheeling live on TV about Scottish independence - Mr Swinney's lifetime goal - saying a second vote on the country's future should be restricted to \"50 or 75 years\". An eye-bulging intervention from the leader of the free world. 👉 Follow Trump100 on your podcast app 👈 The pair met again on Tuesday morning to talk business in a more formal, sober setting on the Aberdeenshire estate. Mr Swinney's team were wanting to talk about the growing humanitarian crisis in Gaza. Read more:Starmer ran the gauntlet with TrumpTrump reignites row with 'nasty' Sadiq Khan Scotland has been at the epicentre of international politics for the past five days where, it seems, Mr Trump has been in listening mode. His new political friends will be hoping they have persuaded him to act harder on the pressing issues in the Middle East."
    },
    {
        "title": "Hundreds of thousands of people backlash against internet safety rules",
        "description": "Hundreds of thousands of people are protesting against the UK's new online safety rules, with accusations of censorship being levelled at the government.",
        "url": "https://news.sky.com/story/hundreds-of-thousands-of-people-backlash-against-internet-safety-rules-13403603",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-yoti-age-checks-ofcom_6970626.png?20250722112326",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-07-29 15:32:00",
        "Headline": "Five days since Ofcom's new internet regulations began being enforced, nearly 400,000 people have signed a petition asking for them to be repealed.",
        "Content": "\n          Science and technology reporter\n       Hundreds of thousands of people are protesting against the UK's new online safety rules, with accusations of censorship being levelled at the government. Five days since Ofcom's new internet regulations began being enforced, nearly 400,000 people have signed a petition asking for them to be repealed. In response to the petition, the government said it had \"no plans to repeal the Online Safety Act\". Read more: New internet rules come into force - here's what will change Reform UK's leader Nigel Farage likened the new rules to \"state suppression of genuine free speech\" and said his party would reverse the regulations. In response, technology secretary Peter Kyle accused Mr Farage of being \"on the side\" of predators like Jimmy Savile, to which Mr Farage demanded an apology, calling Mr Kyle's comments \"absolutely disgusting\".  Others, like adult content creators, have accused the government of censoring social media feeds. \n                  Trump ally Representative Jim Jordan to criticise Online Safety Act in meeting with Technology Secretary Peter Kyle\n                 \n                  Watchdog must fine social media companies that are slow to remove racism after Jess Carter abuse, says culture secretary\n                 \n                  Tyler Webb sentenced to nine years imprisonment after persuading victim to attempt suicide online\n                 Adult content star Jak White told Sky News he believes the way the rules have been enforced amounts to \"censorship [rather] than protecting children\". \"We create [non-explicit] content but the engagement has also dropped down on that, I guess, because of the keywords,\" he said. \"Even emojis are pretty much getting filtered out because of the new Online [Safety] Act.\" \"What it's turned into now is pretty much censorship.\" These new rules are wide-reaching and as they were being implemented, Mr Kyle said they represented important progress. \"For the first time since the creation of the internet, parents and children will notice a difference in their online experience and that is something that we should celebrate,\" he told Sky News last week.  In the days since, there has not seemed to be much celebrating, but many campaigners argue that something had to be done. A quarter of children’s suicides in the UK are linked to content they have seen online, according to one 2019 study that was published in medical journal Psychological Medicine. Read more: Grieving mother is sceptical new internet rules will work When Sky News spoke to teenagers at a Warrington youth club, they were clear that they wanted more protection. Freya, 15, said she thought it was a \"good idea\" to have more restrictions because \"there are some things that are so accessible on social media that really shouldn't be easy to find\". Robyn, 15, said she is often shown violent videos that she does not want to see. \"Getting restrictions on that would be way better because then it would be more, 'Oh yeah, I did not see that, oh my day is way better',\" she said.  In the days since the new rules came into place, there's been a focus on the age verification systems now required for platforms hosting harmful content, but there are other changes too. Social media companies have to alter their algorithms to make sure things like violence, suicide or self-harm material are not shown to young people, and children must be given more control over their accounts, including around blocking and reporting on social media. But some people say these rules are being applied too broadly and mean that even adults are struggling to access legal content. Read more from Sky News:Ozzy Osbourne cortege to travel through BirminghamTeenage girl dies after being pulled from the sea \"The problem is that good intentions don't necessarily make good law,\" said Matthew Feeney, advocacy manager at Big Brother Watch. \"I don't doubt the intentions of those who are supporting this act. \"The fact is that it's unclear that this will actually make children safer because they can just drive themselves to VPNs or to parts of the dark web to access this content anyway. \"In addition, adults are going to find themselves in a position of having to upload biometric data or identification in order to access completely legal speech. \"I think that's a significant cost to incur in a liberal democracy.\" People do appear to be turning to VPNs to bypass the new rules. In the days after age verification came into force, VPNs made up five of the top 10 apps on Apple's App Store and Google searches for the tool rocketed. Read more: Age verification tools on adult websites bypassed in seconds In response to VPNs being used to bypass age verifications, a government spokesperson told Sky News: \"Platforms have a clear responsibility to prevent children from bypassing safety protections. \"This includes blocking content that promotes VPNs or other workarounds specifically aimed at young users. \"Where platforms deliberately target UK children and promote VPN use, they could face enforcement action, including significant financial penalties.\""
    },
    {
        "title": "Ozzy Osbourne cortege to travel through Birmingham",
        "description": "Ozzy Osbourne fans will be able to say goodbye to the heavy metal pioneer at a procession for his cortege through his home city of Birmingham tomorrow.",
        "url": "https://news.sky.com/story/ozzy-osbourne-cortege-to-travel-through-birmingham-13403338",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne-black-sabbath_6976617.jpg?20250729094452",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-29 08:19:00",
        "Headline": "Large crowds are expected to gather in Birmingham tomorrow as fans pay their respects to Ozzy Osbourne.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Ozzy Osbourne fans will be able to say goodbye to the heavy metal pioneer at a procession for his cortege through his home city of Birmingham tomorrow. The star's hearse will make its way down Broad Street towards the Black Sabbath bridge and bench - where thousands of fans have left flowers, messages and other tributes since his death. Osbourne, 76, died less than three weeks after performing his \"final bow\" in the city - the Back The Beginning reunion with his Sabbath bandmates at Villa Park, which raised about £140m for charity. Large crowds are expected to gather tomorrow as fans pay their respects to the performer who shaped heavy metal music and \"proudly carried the spirit of Birmingham throughout his career\", the city council said. Members of Osbourne's family will also be in attendance and have funded the event, the council added. \"Ozzy was more than a music legend - he was a son of Birmingham,\" said the city's lord mayor, Councillor Zafar Iqbal. \"We know how much this moment will mean to his fans. We're proud to host it here with his loving family in the place where it all began.\"  Mr Iqbal said it was important to the city to give the star \"a fitting, dignified tribute ahead of a private family funeral\". Osbourne and his Black Sabbath bandmates Terence \"Geezer\" Butler, Tony Iommi and Bill Ward were awarded the Freedom of the City in June, before the Back To The Beginning show, honouring their \"significance to the cultural and musical identity of Birmingham\". The star's cortege will travel down Broad Street from about 1pm tomorrow, accompanied by a live brass band, Bostin' Brass. For those not able to make it, a live stream of the Black Sabbath bench, which has been running since Osbourne's death, will continue. There is also a book of condolence for public messages at Birmingham Museum and Art Gallery, alongside the Ozzy Osbourne Working Class Hero exhibition, highlighting his solo career achievements. Metal, bats, and reality TV: The wild life of Ozzy Osbourne Osbourne, the self-styled Prince of Darkness, pioneered heavy metal with Black Sabbath before going on to have huge success in his own right. He was famous for hits including Iron Man, Paranoid, War Pigs, Crazy Train and Changes, both with the band and as a solo star. The singer also found a different kind of fame thanks to noughties MTV reality show The Osbournes, which followed his somewhat chaotic life with wife Sharon and two of their children, Kelly and Jack. Following his death, his family released a statement saying he died alongside them, \"surrounded by love\"."
    }
]