[
    {
        "title": "Is chancellor's spending review the start of a 'national renewal' - or too good to be true?",
        "description": "If you sat through the entire spending review speech delivered by Rachel Reeves in the House of Commons, you might have been lulled into a sense that the UK was awash with a wealth of riches as the chancellor sprinkled billions across the land.",
        "url": "https://news.sky.com/story/is-chancellors-spending-review-the-start-of-a-national-renewal-or-too-good-to-be-true-13382354",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935130.jpg?20250605145249",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-11 20:13:00",
        "Headline": "The chancellor deserves credit for the capital investment, which she hopes will unlock jobs and power economic growth. But when something sounds too good to be true, it normally is.",
        "Content": "\n          Political editor\n              @BethRigby\n  If you sat through the entire spending review speech delivered by Rachel Reeves in the House of Commons, you might have been lulled into a sense that the UK was awash with a wealth of riches as the chancellor sprinkled billions across the land. There were billions for social housing, nuclear power stations, rail lines and research and development to power the economy. There was money for schools, the police, the NHS, and defence spending, as the chancellor sketched out her roadmap for Britain for years to come, with an acknowledgement that the government - and particularly this chancellor - had endured a difficult first year. \"We are renewing Britain. But I know that too many people in too many parts of our country are yet to feel it…the purpose of this spending review is to change that,\" she said. Politics Hub: Tap here for the latest news There was £113bn of borrowing to fund capital investment and an extra £190bn over the course of the parliament for public services, fuelled by those contentious tax rises in the budget last autumn. This was a Labour chancellor turning her back on austerity. \"In place of decline, I choose investment. In place of retreat, I choose national renewal,\" she said. The chancellor deserves credit for the capital investment, which she hopes will unlock jobs and power economic growth. But when something sounds too good to be true, it normally is. For me, former shadow chancellor John McDonnell hit the nail on the head on Wednesday night as he remarked rather wryly to me that \"the greater the applause on the day, the greater the disappointment by the weekend\".  Could tax hikes be needed? Because, in talking up the prospect of national renewal, the chancellor glossed over what the \"hard choices\" mean for all of us. There are questions now swirling about where the cuts might fall in day-to-day budgets for those departments which are unprotected, with local government, the Home Office, the Foreign Office, and the Department for Environment all facing real-terms cuts. My colleague Ed Conway, analysing the government figures, found cuts in the schools budget for the last two years of this parliament - the chancellor's top line figure showed an overall rise of 0.6% over the five-year period of this Labour government. There are questions too over whether council tax bills might be increased in order to top up local government and police budgets. Ms Reeves told me in an interview after her speech that they won't, but she has predicated increases in police funding and local government funding coming locally, rather than from central government, so I will be watching how that will play out.  Even with the increase in health spending - the NHS is getting a 3% boost in its annual budget - there are questions from health experts whether it will be enough for the government to hit a routine operations target of treating 92% of patients within 18 weeks. My point is that this might not be - to again quote Mr McDonnell - \"mathematical austerity\", but after over a decade where public dissatisfaction in public services has grown, the squeeze of day-to-day spending could make it hard for the chancellor to persuade working people this is a government delivering the change for them. There is pressure to reverse some of the welfare cuts, and pressure to lift the two-child benefit cap, while the pressure to reverse the winter fuel allowance has already resulted in Reeves this week making a £1.25bn unfunded spending commitment (she will set out how she is paying for it at the next budget).  Will voters feel the 'renewal'? Reeves told me on Wednesday there was no need for tax rises in the autumn because the spending envelope had already been set, and the money now divvied out. It's a very live question as to whether that can hold if the economy weakens. She did not rule out further tax rises when I asked her last week, while Treasury minister Emma Reynolds told my colleague Ali Fortescue on Wednesday night: \"I'm not ruling it in, I'm not ruling it out.\" 👉 Listen to Sky News Daily on your podcast app 👈 The gamble is that, by investing in infrastructure and getting spades in the ground, and tilting limited public money into the NHS, the government can arrive at the next election with enough 'proof points' to persuade voters to stick with them for another five years. On Wednesday, the chancellor laid the foundations she hopes will turn the government's fortunes around. The risk is that voters won't feel the same by the time they are asked to choose."
    },
    {
        "title": "How the assisted dying debate is dividing doctors as politicians prepare to vote on bill",
        "description": "There are few issues more controversial, more divisive.",
        "url": "https://news.sky.com/story/how-the-assisted-dying-debate-is-dividing-doctors-as-politicians-prepare-to-vote-on-bill-13382377",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-davis-jacky-mark-lee_6939710.jpg?20250612000549",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-06-11 22:06:00",
        "Headline": "Dr Mark Lee, a consultant in palliative care, and Dr Jacky Davis, a consultant radiologist, have deeply contrasting views on what would be the biggest social change to British society many of us would see in our lifetime.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n There are few issues more controversial, more divisive. Assisted dying polarises opinion. But it's a difficult conversation that needs to be had because ultimately death affects us all. Even if you are fortunate enough to never be directly impacted by an assisted death you will almost certainly be indirectly affected if the End of Life Bill passes into law. It would be the biggest social change to British society many of us would ever see in our lifetimes. And after patients and their immediate families, it's the country's doctors who will be the most affected by any change in the law. Like society, the medical community is divided on the issue. \n                  Ballymena riots: Families flee 'locals' venting their feelings\n                 \n                  Reeves hands NHS £29bn extra per year and pledges to end asylum hotels\n                 \n                  Is chancellor's spending review the start of a 'national renewal' - or too good to be true?\n                 One senior doctor said: \"It's like Brexit, but worse.\" Another told me: \"Emotions are running high\". These are the milder, reportable comments. There is bitterness and mistrust. The deep-rooted anger leads to each side accusing the other of deliberately spreading misinformation, \"what-iffery\" and \"shenanigans\" in the lead-up to the final vote next week. We asked two senior doctors to share their views on assisted dying with us and each other. Dr Mark Lee is a consultant in palliative care. \"I have worked in this field for 25 years and looked after thousands of patients at the end of their lives. I am against the assisted dying bill because I believe it poses risks to patients, to families, to doctors and to palliative care.\" 'We can get this right' Dr Jacky Davis is a consultant radiologist and a campaigner for assisted dying legislation in this country. One of the arguments put forward by opponents of assisted dying is that Britain ranks highest among countries in its delivery of palliative care. And there is no need for such a radical change in end of life care. It is not an argument Dr Davis accepts. She said: \"The status quo at the moment means a number of people are dying bad deaths every day. 300 million people around the world have access to assisted dying and more legislation is in the pipeline and no place that has taken up a law on assisted dying has ever reversed it. So we can learn from other places, we can get this right, we can offer people a compassionate choice at the end of life.\" Read more:MPs criticise Esther Rantzen's interventionAssisted dying law 'unworkable' and 'naive' Most deaths in palliative care 'peaceful' Dr Lee accepts palliative care has its limitations but this is a result of underfunding. This national conversation, he argues, is an opportunity to address some of those failings and improve end of life care. \"I think the NHS currently is not resourcing the situation enough to be able to provide the patients with the choice that they need to get the care that they needed and that is because they are not getting the choice and because palliative care is patchy. But in my day-to-day work, and I've worked in palliative care for 25 years, normal death is peaceful, comfortable, and does not involve people dying in pain.\" \"I absolutely agree with Mark,\" Dr Davis responded. \"The vast majority of people will die a peaceful death and do not have the need for an assisted death. And I absolutely am with him that palliative care in this country has been treated abysmally. Nobody should have to hold a jumble sale in order to fund a hospice. That's terrible. \"What I didn't hear from Mark is, while the vast majority of people will die a peaceful death and have got nothing to fear facing death, there are people who have diagnoses where they know that they are likely to face a difficult death and will face a difficult death. \"What are you offering to the people who aren't going to die a peaceful death? And what are you offering to people who are so afraid that that's going to happen that they will take their own lives or will go abroad to seek an assisted death?\" Concerns about pressure on NHS One important voice that has been missing from the national assisted dying debate is that of the NHS. Senior leaders will not speak on the issue until the fate of the bill is decided. And its understandable why. It is not clear what role the health service would have if the bill passes.  Dr Lee warned that his NHS colleagues were \"extremely worried\", going further to say assisted dying would \"break the NHS\". He added, that the country's already under-pressure hospice sector would struggle to cope with staff \"walking away from the job if they are forced to be involved in any way\". Dr Davis refuses to accept these warnings, arguing that the challenge to the health service is being overstated. \"I think it's really important to take a step back and say this would be a very small number of deaths. And this is very small in terms of the other things that are coming through big drug discoveries, big new surgeries, all the rest of it this would be very small in terms in terms of money.\" The two doctors did agree on one thing. That every patient is entitled to a pain free and dignified death.  Dr Lee said: \"I look at the whites of the eyes of people every day with that. I stand in that place every day. And that is shameful that anyone in this day and age should die in that position. Jacky and I can agree on that. That is unacceptable. But it still doesn't justify the response that we meet suffering with killing someone, rather than addressing the needs that are in front of us.\" Dr Davis responded by saying: \"You say you've looked in the whites of patients' eyes at the end, and I'd say looking into the whites of patients eyes and listening to what they're asking for when they've been offered everything that you can offer them and they're still saying, 'I've had enough', then we should follow the example of other countries and say, 'we will help you'.\" These are the two very divided opinions of two NHS doctors, but these are the same arguments that will be taking place in hospitals, hospices, offices, factories and living rooms across the country. In about a week's time, it will be down to the politicians to decide."
    },
    {
        "title": "Controversial aid distributer claims Hamas has carried out deadly attack on bus carrying Palestinians",
        "description": "The controversial US and Israeli-backed aid distributor in Gaza has accused Hamas of a deadly attack on a bus carrying Palestinians working with the organisation.",
        "url": "https://news.sky.com/story/controversial-aid-distributer-claims-hamas-has-carried-out-deadly-attack-on-bus-carrying-palestinians-13382379",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-khan-younis_6939717.jpg?20250612015113",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-11 23:39:00",
        "Headline": "The Gaza Humanitarian Foundation (GHF), which is backed by the US and Israel, has said it fears some team members \"may have been taken hostage\".",
        "Content": "The controversial US and Israeli-backed aid distributor in Gaza has accused Hamas of a deadly attack on a bus carrying Palestinians working with the organisation. The Gaza Humanitarian Foundation (GHF) has said at least five aid workers were killed and it fears some team members \"may have been taken hostage\". The aid organisation also said multiple people were injured in the alleged attack. In a statement, the GHF has said the bus was carrying more than two dozen people working with the organisation when it was targeted at 10pm Gaza time (8pm UK time) on Wednesday. The GHF said those in the bus were \"local Palestinians\" working with the organisation to \"deliver critical aid\". \"At the time of the attack, our team was en route to one of our distribution centres in the area west of Khan Younis\", the GHF added. It continued in its statement: \"We are still gathering facts, but what we know is devastating: there are at least five fatalities, multiple injuries, and fear that some of our team members may have been taken hostage. \n                  Palestinians killed by Israeli gunfire at US-backed aid site, officials say\n                 \n                  Dozens more killed near food distribution centre in Gaza, claims Hamas-run health ministry\n                 \n                  Greta and Gaza – what did she achieve?\n                 \"We condemn this heinous and deliberate attack in the strongest possible terms. These were aid workers.\" The GHF also said in its statement that Hamas has in recent days been threatening members of the organisation, including aid workers, and civilians who have been receiving the aid. The organisation said it holds Hamas fully responsible for \"taking the lives of our dedicated workers who have been distributing humanitarian aid to the Palestinian people at the foundation's sites in central and southern Gaza\". \"Tonight, the world must see this for what it is: an attack on humanity. We call on the international community to immediately condemn Hamas for this unprovoked attack and continued threat against our people simply trying to feed the Palestinian people,\" the GHF said. \"We will release additional information once it becomes available. Despite this heinous attack, we will continue our mission to provide critical aid to the people of Gaza.\" Read more:How the Israeli-backed aid plan in Gaza is unravellingTwo Israeli ministers who have been sanctioned by the UK?  The alleged attack came hours after health officials in Gaza said at least 25 Palestinians were killed by Israeli gunfire at a GHF site close to the former settlement of Netzarim, near Gaza City. Medical officials at Shifa and al Quds hospitals say the people were killed as they approached the site. Gaza's health ministry said earlier this week that around 160 people have been killed in shootings near aid sites run by the GHF since they began distributing aid on 26 May. However, the GHF has said there has been no violence in or around the distribution centres themselves.  Why is the aid system controversial? Israel and the US have said the GHF system is aimed at preventing Hamas from siphoning off assistance. Israel has not provided any evidence of systematic diversion, and the UN denies it has occurred. The foundation's distribution of aid has been marred by chaos, and multiple witnesses have said Israeli troops fired on crowds near the delivery sites. UN agencies and major aid groups have refused to work with the new system, saying it violates humanitarian principles because it allows Israel to control who receives aid and forces people to relocate to distribution sites, risking yet more mass displacement in the territory. Jake Wood, a former US marine, resigned as head of the GHF in May before it began distributing aid in Gaza over concerns about is independence. Mr Wood said the foundation cannot adhere to the \"humanitarian principles of humanity, neutrality, impartiality, and independence, which I will not abandon\"."
    },
    {
        "title": "Boos and cheers for Trump as he visits Kennedy Center for Les Mis",
        "description": "Les Miserables, what else.",
        "url": "https://news.sky.com/story/donald-trump-to-visit-kennedy-center-for-les-mis-as-cast-members-plan-to-boycott-13382344",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trump-melania_6939718.jpg?20250612022004",
        "type": "Home",
        "Author": "James Matthews",
        "Date Published": "2025-06-11 19:26:00",
        "Headline": "The president made his first visit to the prestigious arts venue since overhauling its board and attacking \"woke\" bookings.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Les Miserables, what else. The hit musical about anti-government protest is now showing at the Kennedy Center in Washington DC. Donald Trump was in the audience for Wednesday's performance for what amounts to a busman's holiday. The narrative explores issues of social justice, love, and the enduring power of human compassion amidst a backdrop of poverty and revolution. Not everyone shares the president's vision of those themes. Indeed his presence drew what can only be described as mixed reviews from his fellow theatre goers - cheers and boos in equal measure as he waved from the front row of the circle. The script of Les Miserables barely presents a break from the day job - Trump won't be the only one getting a sense of art imitating life, as the real thing plays out on the streets of LA. It is the first show the president has chosen to attend since he made sweeping changes at the iconic venue, prompting an outcry and accusations that he was politicising art and 'MAGAfying' the venerated institution. \n                  Why Trump's military 'birthday' parade is so controversial\n                 \n                  Ex-CIA director John Brennan calls Donald Trump's plan in Ukraine 'naive' and 'unsophisticated'\n                 \n                  Donald Trump responds after Elon Musk admitted 'regrets' over explosive row\n                 According to CNN, a number of Les Miserables cast members had planned to sit out the performance in protest. The Kennedy Center is a prestigious venue that showcases the best of American performance art. More than 2,000 shows per year include the famous honours ceremony, an annual event that celebrates artists who have made a significant contribution to US culture. Honourees through the years have included Joni Mitchell, Aretha Franklin, the Grateful Dead and Francis Ford Coppola. Following his election in November, Trump made himself chairman of the Kennedy Center's board and replaced members with political loyalists. Traditionally, the board has been made up of individuals from across the political spectrum; after his election, Trump got rid of 18 members and replaced them with political soulmates, including his chief of staff Susie Wiles and Fox presenters Laura Ingraham and Maria Bartiromo. Read more:Trump responds to Musk's apologyRiot police enforce LA curfew Donald Trump signalled a change in artistic direction at the Kennedy Center when he wrote on social media of \"Drag shows specifically targeting our youth\", and said of its production schedule: \"We didn't like what they were showing, we're going to make sure it's good and it's not going to be woke.\" His changes prompted a number of acts to cancel shows at the venue in protest. The touring production of Broadway hit Hamilton cancelled dates, as did actor and producer Issa Rae, writer Louise Penny and Pulitzer Prize-winning folk musician Rhiannon Giddens. 👉 Follow Trump100 on your podcast app 👈 Trump's attendance at the Les Mis performance was designed to boost fundraising, with donors paying up to $2m to attend a reception with the president. Ticket sales and subscriptions have, reportedly, slumped since Trump's changes although the centre's management points out its campaign to renew subscriptions has been launched later this year than last. Trump watched the performance of Les Miserables from the presidential box, in the company of his wife, Melania. Vice president JD Vance was also there. When he attended a performance by the National Symphony Orchestra in March with his wife, he was booed by members of the audience."
    },
    {
        "title": "Did ChatGPT get the spending review right? Treasury minister gives his verdict",
        "description": "The chief secretary to the Treasury has called the Sky News-Chat GPT spending review projection \"pretty good\" and scored it 70%.",
        "url": "https://news.sky.com/story/did-chatgpt-get-the-spending-review-right-treasury-minister-gives-his-verdict-13382327",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sam-coates-darren-jones_6939698.png?20250611224905",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-06-11 18:17:00",
        "Headline": "Darren Jones compares the real spending review, delivered by Rachel Reeves on Wednesday, and the Sky News AI (artificial intelligence) projection last week.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The chief secretary to the Treasury has called the Sky News-Chat GPT spending review projection \"pretty good\" and scored it 70%. Darren Jones compared the real spending review, delivered by Rachel Reeves on Wednesday, and the Sky News AI (artificial intelligence) projection last week. Sky News took the Treasury's spring statement, past spending reviews, the 'main estimates' from the Treasury website, and the Institute for Fiscal Studies' projections, and put them into ChatGPT, asking it to calculate the winners and losers in the spending review. Politics Hub: Tap here for live updates This was done 10 days ahead of the review - before several departments had agreed their budgets with the Treasury - on the basis of projections based on those public documents. It also comes amid a big debate kicked off by Sky News about the level of error of AI. The Sky News-AI projection correctly put defence and health as the biggest winners, the Foreign Office as the biggest loser, and identified many departments would lose out in real terms overall. It suggested the education budget would be smaller than it turned out, but correctly highlighted the challenges for departments like the Home Office and environment. \n                  Powerful new supercomputer to be built in Scotland in government U-turn\n                 \n                  Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts\n                 \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 Watch what happened with Sky's AI-generated spending review  Reviewing the exercise, the author of the real spending review told Sky News that this pioneering use of AI was \"pretty, pretty good\". He added: \"I could be out of a job next time in 2027, which to be honest, it's not a bad idea given the process I've just had to go through.\" The Treasury made a number of accounting changes to so-called \"mega projects\" which AI could not have anticipated, and changed some of the numbers.  Asked to give it a score, Mr Jones replied: \"I'm going to give it 70%.\" The spending review includes AI as a tool to save money in various government processes. Asked if 70% accuracy is good enough for government, he replied: \"Well we're not using your AI. We've got our own AI, which is called HMT GPT, and it helps us pull together all the information across government to be able to make better, evidence-informed decisions.\""
    },
    {
        "title": "The Beach Boys co-founder Brian Wilson dies",
        "description": "Brian Wilson - the co-founder of The Beach Boys - has died at the age of 82.",
        "url": "https://news.sky.com/story/beach-boys-co-founder-brian-wilson-dies-13382290",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brian-wilson-glastonbury_6939580.jpg?20250611180431",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-11 16:50:00",
        "Headline": "Brian Wilson was the California band's visionary leader and songwriter, penning hits including Surfin' USA, Good Vibrations and God Only Knows.",
        "Content": " Brian Wilson - the co-founder of The Beach Boys - has died at the age of 82. In a statement, published on his website, his family said: \"We are heartbroken to announce that our beloved father Brian Wilson has passed away. \"We are at a loss for words right now. Please respect our privacy at this time, as our family is grieving. We realise that we are sharing our grief with the world.\" Wilson is believed to have suffered ill health in recent years, with court documents filed in 2024 saying he had \"major neurocognitive disorder (such as dementia)\". He co-founded The Beach Boys in the early 1960s with his brothers, Dennis and Carl, their cousin Mike Love and friend Al Jardine. Wilson - the eldest and last surviving of the three brothers - was their visionary leader and songwriter, penning hits including Surfin' USA, Good Vibrations, and God Only Knows. 'What a legacy he leaves' Famous faces have paid tribute to Wilson, with Rolling Stone's Ronnie Wood saying his \"world is in mourning\" following the deaths of The Beach Boys co-founder and fellow musician Sly Stone. \"So sad,\" he added. \"A complex man but a musical genius and showbusiness icon,\" Piers Morgan wrote. \"What a legacy he leaves.\" Radio 2 DJ Tony Robinson said on the X social media platform: \"So sorry to hear that Brian Wilson of the Beach Boys has passed away. So many hits, and to me it was the sound of summer. RIP Brian and thanks for the music.\" Electronic music duo Disclosure said Wilson was their \"favourite producer and composer of all time\". \"Pushed the boundaries further than anyone had before,\" they wrote in a comment on Instagram. \"Lost for words. We love you, Brian. Rest in peace to the greatest.\" Arts and entertainment editor To say Brian Wilson loomed large in my life would be an understatement. My musician father was a major fan of The Beach Boys, naming one of my brothers after one of them and playing us their tracks so often that I can't separate their back catalogue from nostalgic memories of childhood. When challenged by others for choosing America's Beach Boys over our home-grown The Beatles, Dad would wax lyrical about their harmonies and the creative genius of Wilson. But it wasn't just me who felt the influence of the not-really surfer boys (it was only Brian's brother Dennis who actually surfed, despite the songs about the sea and the photos of them posing with boards).  The album Pet Sounds is widely credited with being one of the most influential records ever, using those famous harmonies and production techniques that were so innovative at the time, which then became widely drawn on, even the norm.  They were one of the first American rock bands to play their own instruments and write their own songs. And it was Brian – not the record execs – who had creative control, paving the way for the musicians who came after him to do the same.  So while I know the impact that Brian Wilson and The Beach Boys had on my life, I also know that because of their influence, the inspiration they were and the legacy they left, that without you even knowing it, they will have impacted your life too. The Beach Boys have inspired acts on both sides of the Atlantic, with the likes of Sir Elton John, Bruce Springsteen, and Carole King lauding their work. Their 1966 album Pet Sounds, penned and produced by Wilson, was voted No.2 in a 2003 Rolling Stone list of the best 500 albums - losing only to The Beatles' Sgt. Pepper's Lonely Hearts Club. Paul McCartney has cited Pet Sounds as a direct inspiration for the Beatles, naming the ballad God Only Knows as one of his favourite songs and saying it often brings him to tears. The band's innocent appeal survived despite the group's increasingly troubled backstory. Brian, suffering from stress and exhaustion, had a breakdown in 1964 and retired from touring, choosing to instead focus on writing and recording, though he later returned to the stage. Dennis, who struggled with substance abuse and alcoholism, drowned in 1983. Carl died of lung cancer in 1998."
    },
    {
        "title": "Why Trump's military 'birthday' parade is so controversial",
        "description": "For the first time in more than 30 years, tanks will roll through the capital of the United States.",
        "url": "https://news.sky.com/story/why-trumps-military-birthday-parade-is-so-controversial-13382096",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-us-gulf-war-celebration_6939179.jpg?20250611120730",
        "type": "Home",
        "Author": "Megan Harwood-Baynes, news reporter",
        "Date Published": "2025-06-11 10:53:00",
        "Headline": "The 250th anniversary of the United States Army could see hundreds of thousands descend on Washington DC to watch tanks roll through the streets for the first time in three decades.",
        "Content": "By Megan Harwood-Baynes, news reporter  For the first time in more than 30 years, tanks will roll through the capital of the United States. The 250th anniversary of the United States Army could see hundreds of thousands descend on Washington DC to watch as 60-ton M1 Abrams battle tanks and Paladin self-propelled howitzers rumble along the streets. But, like almost everything Donald Trump is involved in, it has not come without controversy or criticism. It wasn't originally planned as a birthday celebration - the event had been in the works since before Trump was elected - but earlier this year the President announced his intention add a massive military parade to the event, which would coincide with his own 79th birthday. Speaking earlier this week, Trump said it is going to be a \"big day\", adding: \"We want to show off a little bit.\" Officials have estimated around 200,000 people could turn out, including protesters, plus 6,600 soldiers, 150 vehicles and 50 aircraft. More than 1,500 'No Kings' demonstrations have also been planned across the US, but the group has said it will not be holding events in Washington DC, in part to avoid a direct confrontation. \n                  Boos and cheers for Trump as he visits Kennedy Center for Les Mis\n                 \n                  Ex-CIA director John Brennan calls Donald Trump's plan in Ukraine 'naive' and 'unsophisticated'\n                 \n                  Donald Trump responds after Elon Musk admitted 'regrets' over explosive row\n                 It comes as the president warned that any protesters who rain on his military parade \"will be met with very big force\". Does the US typical hold military parades? Unlike other countries, military parades in the United States are fairly rare, but Trump has made no secret of his desire for one. The last time such a major display took place in the US it was in 1991, when tanks and thousands of troops paraded through Washington to celebrate the ousting of Iraqi president Saddam Hussein's army from Kuwait. During Trump's first administration, he ordered the Pentagon to look into holding a display after a visit to France in 2017. He was seemingly inspired after witnessing the country's Bastille Day parade, and attempted to plan a Veteran's Day parade for 2018. However, this was cancelled due to \"ridiculously high\" cost estimates. Trump ultimately settled for a display of tanks and other armoured vehicles during a fourth of July celebration, named Salute to America, two years later. What is happening on the day? Saturday will start with a wreath-laying ceremony in the morning at Arlington National Cemetery, followed by an army birthday festival on the National Mall in DC. The festival will include equipment displays and military demonstrations. The day will conclude with a military parade throughout the city, overseen by Trump. After the parade, the US Army Golden Knights team will parachute in and present the president with a flag. How much will it cost? All the celebrations will cost the US Army between $25 million (£18.51m) and $45 million (£33.33m), officials told Reuters. These estimates include costs that will be born by the city of Washington, include litter clean up. The event will involve 18 miles of fencing and 175 metal detectors being installed in the capital. The military has also begun taking steps to protect the streets from damage caused by heavy tanks, including laying down metal plates in some areas. The Army said it will pay for any unexpected repairs if needed and has set aside several million dollars in case of damage. Why is it controversial? President Trump's critics have called the parade an authoritarian display of power, that is particularly wasteful as his administration seeks to slash federal spending. The cost of the Army's celebration is several million dollars more than it would have been without a parade, officials said. Among the critics is California Governor Gavin Newsom, who has been trading barbs with Trump since the outbreak of riots in LA. \"And we all know, this Saturday, he's ordering our American heroes - the United States military - forcing them to put on a vulgar display to celebrate his birthday, just as other failed dictators have done in the past,\" he said. \"This is his ego and making everything about 'him',\" Senator Jack Reed, the top democrat on the Senate Armed Services Committee, has also said. But other officials have pointed out plans for the Army's 250th birthday began before Trump won the presidential election, and it is not officially an event to mark his birthday - the dates just happen to be the same. How will it compare to military parades around the world? One of the criticisms of the parade is that it is a show of military might more often seen in authoritarian countries, such as North Korea, Russia, Iran and China. This is because tanks in the streets are symbolically associated with these regimes, where they are designed to inspire nationalism and fear, whilst also promoting obedience - they often take place under the watchful eye of their country's leader. Russia holds its annual Victory Day parade on 9 May to commemorate the country's Soviet victory over Nazi Germany. In recent years, it has been used to protect military strength during the Ukraine war. China holds a National Day parade on 1 October every ten years, or on key anniversaries, to celebrate the founding of the People's Republic in 1949. Read more:Why is the president giving babies $1,000?Elon Musk says he 'regrets' Trump postsRiot police enforce LA curfew In Iran, an Army Day Parade takes place in April, a month after the country's Revolution Day celebrations. North Korea holds parades on key dates like Kim Il-sung's birthday, or the ruling party's foundation day. Taking place in the country's capital of Pyongyang, the display will often feature new weapons, closely watched by leader Kim Jong-un. But not every country that holds a military parade is necessarily authoritarian. The UK holds its annual Trooping of the Colour every summer to celebrate the birthday of the British Monarch."
    },
    {
        "title": "Harvey Weinstein found guilty of criminal sexual act in New York retrial",
        "description": "Disgraced movie mogul Harvey Weinstein has been found guilty of committing a criminal sexual act in a retrial in New York.",
        "url": "https://news.sky.com/story/harvey-weinstein-found-guilty-of-criminal-sexual-act-in-new-york-retrial-13380041",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-harvey-weinstein_6935795.jpg?20250606121403",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-11 18:00:00",
        "Headline": "The case was being retried after an appeals court overturned his 2020 conviction last year.",
        "Content": "Disgraced movie mogul Harvey Weinstein has been found guilty of committing a criminal sexual act in a retrial in New York. The 73-year-old was found not guilty of another count of committing a criminal sexual act relating to a second woman. The jury has so far not recorded a verdict in relation to an allegation of rape against a third woman. Weinstein pleaded not guilty to all three charges and has denied assaulting anyone or having non-consensual sex. The case was being retried after an appeals court overturned his 2020 conviction last year. He was accused of raping aspiring actress Jessica Mann in a New York hotel room in 2013 and forcing oral sex on two other women. Two of the charges were those he faced during the original trial, while the third - one of the charges of forcing oral sex - was added last year. The partial verdict came after an extraordinary day which saw the jury foreperson ask to speak to the judge and Weinstein himself call for the trial to be halted. \"My life is on the line and you know what? It's not fair,\" the former movie mogul said. \"It's time, it's time, it's time, it's time to say this trial is over.\" He spoke before there was a verdict on any of the charges. The foreperson requested to speak to the judge about \"a situation\". The man - who had on Monday complained other jurors were pushing people to change their minds, and talking about information beyond the charges - was questioned in private, at his request. The episode was the latest sign of jurors under strain. On Friday, one asked to be excused because he felt another juror was being treated unfairly - at which point Weinstein lawyers unsuccessfully asked for a mistrial. Nearly eight years ago, a series of sexual misconduct allegations against the Oscar-winning movie producer propelled the #MeToo movement. Read more:What has happened to the #MeToo movement? Some of those accusations later generated criminal charges and convictions in New York and California. Before the retrial, Weinstein was also serving a 16-year prison sentence after being found guilty of rape in California in December 2022. He had also denied this charge."
    },
    {
        "title": "French police forced to watch on as migrants in Dunkirk attempt perilous Channel crossing",
        "description": "As the first light breaks across a quiet beach near Dunkirk, a human tide begins to move.",
        "url": "https://news.sky.com/story/french-police-forced-to-watch-on-as-migrants-attempt-perilous-channel-crossing-13382079",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-alex-rossi-channel-crossing_6939130.jpg?20250611112609",
        "type": "Home",
        "Author": "Alex Rossi",
        "Date Published": "2025-06-11 10:19:00",
        "Headline": "Despite millions spent by the UK government to curb migrant crossings, the numbers continue to rise. Sky's Alex Rossi watched as migrants, many with children, attempted the potentially deadly crossing.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  As the first light breaks across a quiet beach near Dunkirk, a human tide begins to move. Dozens of migrants, many with children, rush across the sand toward the water's edge. French police are present, but they do not intervene. For many of these men, women, and children, this moment marks the final chapter of a journey that began months ago, fleeing war, persecution, and economic collapse in countries as far afield as Iran, Eritrea, and Sudan. Now, they face the potentially deadly crossing to the UK in a flimsy inflatable boat. We watched as one vessel emerged from an inland waterway already crowded with people. The vessel is soon dangerously overloaded. Floating haphazardly, a baby is yanked onto the boat, as they yell out for more people to climb aboard. Despite the dinghy taking on water - scooped out with a shoe - the crossing continues. On the shore, police officers stood by, watching. When I asked why no attempt was made to intervene, one officer said: \"It's for their safety. \"There are children there. We're not going to throw grenades at them. It's inhumane. But it's sad.\" French police protocol, along with international law, makes such interventions legally and morally complex once boats are afloat - especially when families are involved. Despite millions spent by the UK government to curb these crossings, the numbers continue to rise. As of the latest count, almost 15,000 people have already made the perilous journey across the Channel this year. Many more are expected this summer as the weather window widens. In the makeshift camps near Dunkirk, migrants wait their turn for the smugglers to signal that conditions are right. Ali Reza told us he fled Iran after converting to Christianity. He dreams of reaching Britain, where he hopes to claim asylum. He said: \"Britain is good and accepts refugees. It has good behaviour for refugees. \"I think I'll get a good welcome. Many Iranian people go to Britain. There's good behaviour.\" Read more from Sky News:Spending review: The key announcementsThree-day thunderstorm warning issued for parts of the UK Back on the beach, not everyone manages to get aboard. The boat taxi service is in high demand. Among the group, a woman from Eritrea spoke with me briefly. Although she missed today's crossing, she vowed to try again later in the week."
    },
    {
        "title": "How the assisted dying debate is dividing doctors as politicians prepare to vote on bill",
        "description": "There are few issues more controversial, more divisive.",
        "url": "https://news.sky.com/story/how-the-assisted-dying-debate-is-dividing-doctors-as-politicians-prepare-to-vote-on-bill-13382377",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-davis-jacky-mark-lee_6939710.jpg?20250612000549",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-06-11 22:06:00",
        "Headline": "Dr Mark Lee, a consultant in palliative care, and Dr Jacky Davis, a consultant radiologist, have deeply contrasting views on what would be the biggest social change to British society many of us would see in our lifetime.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n There are few issues more controversial, more divisive. Assisted dying polarises opinion. But it's a difficult conversation that needs to be had because ultimately death affects us all. Even if you are fortunate enough to never be directly impacted by an assisted death you will almost certainly be indirectly affected if the End of Life Bill passes into law. It would be the biggest social change to British society many of us would ever see in our lifetimes. And after patients and their immediate families, it's the country's doctors who will be the most affected by any change in the law. Like society, the medical community is divided on the issue. \n                  Ballymena riots: Families flee 'locals' venting their feelings\n                 \n                  Reeves hands NHS £29bn extra per year and pledges to end asylum hotels\n                 \n                  Is chancellor's spending review the start of a 'national renewal' - or too good to be true?\n                 One senior doctor said: \"It's like Brexit, but worse.\" Another told me: \"Emotions are running high\". These are the milder, reportable comments. There is bitterness and mistrust. The deep-rooted anger leads to each side accusing the other of deliberately spreading misinformation, \"what-iffery\" and \"shenanigans\" in the lead-up to the final vote next week. We asked two senior doctors to share their views on assisted dying with us and each other. Dr Mark Lee is a consultant in palliative care. \"I have worked in this field for 25 years and looked after thousands of patients at the end of their lives. I am against the assisted dying bill because I believe it poses risks to patients, to families, to doctors and to palliative care.\" 'We can get this right' Dr Jacky Davis is a consultant radiologist and a campaigner for assisted dying legislation in this country. One of the arguments put forward by opponents of assisted dying is that Britain ranks highest among countries in its delivery of palliative care. And there is no need for such a radical change in end of life care. It is not an argument Dr Davis accepts. She said: \"The status quo at the moment means a number of people are dying bad deaths every day. 300 million people around the world have access to assisted dying and more legislation is in the pipeline and no place that has taken up a law on assisted dying has ever reversed it. So we can learn from other places, we can get this right, we can offer people a compassionate choice at the end of life.\" Read more:MPs criticise Esther Rantzen's interventionAssisted dying law 'unworkable' and 'naive' Most deaths in palliative care 'peaceful' Dr Lee accepts palliative care has its limitations but this is a result of underfunding. This national conversation, he argues, is an opportunity to address some of those failings and improve end of life care. \"I think the NHS currently is not resourcing the situation enough to be able to provide the patients with the choice that they need to get the care that they needed and that is because they are not getting the choice and because palliative care is patchy. But in my day-to-day work, and I've worked in palliative care for 25 years, normal death is peaceful, comfortable, and does not involve people dying in pain.\" \"I absolutely agree with Mark,\" Dr Davis responded. \"The vast majority of people will die a peaceful death and do not have the need for an assisted death. And I absolutely am with him that palliative care in this country has been treated abysmally. Nobody should have to hold a jumble sale in order to fund a hospice. That's terrible. \"What I didn't hear from Mark is, while the vast majority of people will die a peaceful death and have got nothing to fear facing death, there are people who have diagnoses where they know that they are likely to face a difficult death and will face a difficult death. \"What are you offering to the people who aren't going to die a peaceful death? And what are you offering to people who are so afraid that that's going to happen that they will take their own lives or will go abroad to seek an assisted death?\" Concerns about pressure on NHS One important voice that has been missing from the national assisted dying debate is that of the NHS. Senior leaders will not speak on the issue until the fate of the bill is decided. And its understandable why. It is not clear what role the health service would have if the bill passes.  Dr Lee warned that his NHS colleagues were \"extremely worried\", going further to say assisted dying would \"break the NHS\". He added, that the country's already under-pressure hospice sector would struggle to cope with staff \"walking away from the job if they are forced to be involved in any way\". Dr Davis refuses to accept these warnings, arguing that the challenge to the health service is being overstated. \"I think it's really important to take a step back and say this would be a very small number of deaths. And this is very small in terms of the other things that are coming through big drug discoveries, big new surgeries, all the rest of it this would be very small in terms in terms of money.\" The two doctors did agree on one thing. That every patient is entitled to a pain free and dignified death.  Dr Lee said: \"I look at the whites of the eyes of people every day with that. I stand in that place every day. And that is shameful that anyone in this day and age should die in that position. Jacky and I can agree on that. That is unacceptable. But it still doesn't justify the response that we meet suffering with killing someone, rather than addressing the needs that are in front of us.\" Dr Davis responded by saying: \"You say you've looked in the whites of patients' eyes at the end, and I'd say looking into the whites of patients eyes and listening to what they're asking for when they've been offered everything that you can offer them and they're still saying, 'I've had enough', then we should follow the example of other countries and say, 'we will help you'.\" These are the two very divided opinions of two NHS doctors, but these are the same arguments that will be taking place in hospitals, hospices, offices, factories and living rooms across the country. In about a week's time, it will be down to the politicians to decide."
    },
    {
        "title": "Reeves hands NHS £29bn extra per year and pledges to end asylum hotels",
        "description": "Day-to-day spending on the NHS will increase by &#163;29bn a year, Rachel Reeves has announced, as she accepted that voters are yet to feel an improvement under Labour.",
        "url": "https://news.sky.com/story/reeves-hands-nhs-16329bn-extra-per-year-and-pledges-to-end-asylum-hotels-13382142",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-downing-street_6939143.jpg?20250611113321",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-06-11 12:18:00",
        "Headline": "The chancellor acknowledges that almost a year on from Labour's landslide election victory, \"too many people\" are yet to feel their promise of national renewal.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Day-to-day spending on the NHS will increase by £29bn a year, Rachel Reeves has announced, as she accepted that voters are yet to feel an improvement under Labour. Delivering her spending review, the chancellor also declared an end to the use of asylum hotels this parliament by investing in cutting the backlog and returning more people with no right to be in the UK - which she said would save taxpayers £1bn a year. Politics live: Reaction to spending review   Ms Reeves acknowledged that almost 12 months on from Labour's landslide election victory, \"too many people\" are yet to feel their promise of national renewal. She said the purpose of her spending review is \"to change that\", with departmental budgets to grow by an average of 2.3% a year in real terms until 2028-29. Key settlements include: • NHS: The health service gets £29bn for day-to-day spending - a 3% rise for each year until the next general election;• Housing: £39bn over the next 10 years to build affordable and social housing;• Defence: Spending will rise from 2.3% of GDP to 2.6% by 2027, made up of an £11bn uplift on defence and £600m for security and intelligence agencies;• Science and tech: Research and development funding will hit £22bn, with AI plans getting £2bn;• Transport: £15bn for new rail, tram, and bus networks in the North and the West Midlands, a new rail line between Liverpool and Manchester, and a four-year settlement for TfL, plus the £3 bus fare cap extended to 2027;• Nations: Scotland gets £52bn, Northern Ireland £20bn, and Wales £23bn, including for coal tips;• Education: Free school meals extended to 500,000 children, while the extra £4.5bn per year will also go on fixing classrooms and rebuilding schools;• Nuclear: A £30bn commitment to nuclear power, including £14.2bn to build Sizewell C plant in Suffolk and £2.5bn in small modular reactors;• Prisons: 14,000 new prison places will be funded with a £7bn injection;• Police: 13,000 more police officers will be paid for with £2bn.  Read more: The key announcements Many of Wednesday's announcements have been front-loaded by cash injections made since Labour took office, meaning that from 2025-26 the increase is a more modest 1.5% on average. Over the course of the whole parliament, it equates to spending £190bn more on the day-to-day running of public services and £113bn more on capital investments than under the previous government's spending plans, the chancellor said. Ms Reeves drew a distinction between her review and the Tories' austerity agenda in 2010, saying they cut spending by 2.9%. She said austerity was a \"destructive choice for the fabric of our society\" and \"different choices\" would be made under Labour. However, while overall departmental spending will increase day to day, some departments face a squeeze. Home Office budget squeezed This includes the Home Office, whose spend will reduce by 1.4% over the next three years, including daily spend and capital investments. Daily spend covers the daily running costs of public services, while capital investment is spending by the state on the creation of fixed, long-term assets, such as roads and railways. Combined, the Foreign Office and Department for Environment, Food and Rural Affairs (DEFRA) also face reductions, as does the Department for Digital, Culture, Media and Sport, and the Cabinet Office. Paul Johnson, the director of the Institute for Fiscal Studies, said 3% a year increases in NHS spending \"does mean virtually nothing on average for current spending elsewhere\".  Ms Reeves said the cash boost for the NHS would fund more appointments, more doctors and more scanners. She used this to draw dividing lines with Reform UK, saying they have called for an '\"insurance-based system\" whereas Labour created the NHS, protected the NHS and under this government would \"renew the NHS\". Read more:The spending review: Five things you need to know Speculation of tax rises Ms Reeves said she was able to raise the money through decisions made in her autumn budget and spring statement, which saw taxes raised by £40bn and cuts made to the welfare budget. However, the Tories said the review \"isn't worth the paper it's written on\" and further tax hikes will be needed. Shadow chancellor Sir Mel Stride said that \"this is the spend-now, tax-later review\", adding Ms Reeves \"knows she will need to come back here in the autumn with yet more taxes and a cruel summer of speculation awaits\". The Liberal Democrats said the \"smoke and mirrors\" spending review would leave a black hole in social care as local government budgets remain at breaking point. \"Putting more money into the NHS without fixing social care is like pouring water into a leaky bucket,\" said the party's Treasury spokesperson Daisy Cooper."
    },
    {
        "title": "Is chancellor's spending review the start of a 'national renewal' - or too good to be true?",
        "description": "If you sat through the entire spending review speech delivered by Rachel Reeves in the House of Commons, you might have been lulled into a sense that the UK was awash with a wealth of riches as the chancellor sprinkled billions across the land.",
        "url": "https://news.sky.com/story/is-chancellors-spending-review-the-start-of-a-national-renewal-or-too-good-to-be-true-13382354",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935130.jpg?20250605145249",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-11 20:13:00",
        "Headline": "The chancellor deserves credit for the capital investment, which she hopes will unlock jobs and power economic growth. But when something sounds too good to be true, it normally is.",
        "Content": "\n          Political editor\n              @BethRigby\n  If you sat through the entire spending review speech delivered by Rachel Reeves in the House of Commons, you might have been lulled into a sense that the UK was awash with a wealth of riches as the chancellor sprinkled billions across the land. There were billions for social housing, nuclear power stations, rail lines and research and development to power the economy. There was money for schools, the police, the NHS, and defence spending, as the chancellor sketched out her roadmap for Britain for years to come, with an acknowledgement that the government - and particularly this chancellor - had endured a difficult first year. \"We are renewing Britain. But I know that too many people in too many parts of our country are yet to feel it…the purpose of this spending review is to change that,\" she said. Politics Hub: Tap here for the latest news There was £113bn of borrowing to fund capital investment and an extra £190bn over the course of the parliament for public services, fuelled by those contentious tax rises in the budget last autumn. This was a Labour chancellor turning her back on austerity. \"In place of decline, I choose investment. In place of retreat, I choose national renewal,\" she said. The chancellor deserves credit for the capital investment, which she hopes will unlock jobs and power economic growth. But when something sounds too good to be true, it normally is. For me, former shadow chancellor John McDonnell hit the nail on the head on Wednesday night as he remarked rather wryly to me that \"the greater the applause on the day, the greater the disappointment by the weekend\".  Could tax hikes be needed? Because, in talking up the prospect of national renewal, the chancellor glossed over what the \"hard choices\" mean for all of us. There are questions now swirling about where the cuts might fall in day-to-day budgets for those departments which are unprotected, with local government, the Home Office, the Foreign Office, and the Department for Environment all facing real-terms cuts. My colleague Ed Conway, analysing the government figures, found cuts in the schools budget for the last two years of this parliament - the chancellor's top line figure showed an overall rise of 0.6% over the five-year period of this Labour government. There are questions too over whether council tax bills might be increased in order to top up local government and police budgets. Ms Reeves told me in an interview after her speech that they won't, but she has predicated increases in police funding and local government funding coming locally, rather than from central government, so I will be watching how that will play out.  Even with the increase in health spending - the NHS is getting a 3% boost in its annual budget - there are questions from health experts whether it will be enough for the government to hit a routine operations target of treating 92% of patients within 18 weeks. My point is that this might not be - to again quote Mr McDonnell - \"mathematical austerity\", but after over a decade where public dissatisfaction in public services has grown, the squeeze of day-to-day spending could make it hard for the chancellor to persuade working people this is a government delivering the change for them. There is pressure to reverse some of the welfare cuts, and pressure to lift the two-child benefit cap, while the pressure to reverse the winter fuel allowance has already resulted in Reeves this week making a £1.25bn unfunded spending commitment (she will set out how she is paying for it at the next budget).  Will voters feel the 'renewal'? Reeves told me on Wednesday there was no need for tax rises in the autumn because the spending envelope had already been set, and the money now divvied out. It's a very live question as to whether that can hold if the economy weakens. She did not rule out further tax rises when I asked her last week, while Treasury minister Emma Reynolds told my colleague Ali Fortescue on Wednesday night: \"I'm not ruling it in, I'm not ruling it out.\" 👉 Listen to Sky News Daily on your podcast app 👈 The gamble is that, by investing in infrastructure and getting spades in the ground, and tilting limited public money into the NHS, the government can arrive at the next election with enough 'proof points' to persuade voters to stick with them for another five years. On Wednesday, the chancellor laid the foundations she hopes will turn the government's fortunes around. The risk is that voters won't feel the same by the time they are asked to choose."
    },
    {
        "title": "Small boats intercepted for first time this month - as '15,000 migrants' cross Channel so far in 2025",
        "description": "\"Multiple\" small boats have been intercepted in the English Channel by the Border Force for the first time this month.",
        "url": "https://news.sky.com/story/small-boats-intercepted-for-first-time-this-month-as-15000-migrants-cross-channel-so-far-in-2025-13382059",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-kent_6939079.jpg?20250611104448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-11 09:42:00",
        "Headline": "Migrants wearing life jackets were seen being brought ashore from a Border Force vessel in Dover, Kent, on Wednesday morning.",
        "Content": " \"Multiple\" small boats have been intercepted in the English Channel by the Border Force for the first time this month. It comes as the Conservatives said 15,000 migrants have now made the crossing so far in 2025, in the \"worst year ever for small boat crossings so far\". A record 14,812 people arrived in the first five months of the year, according to UK government figures. This has also surpassed the highest total recorded for the first six months of a year, which was previously 13,489 on 30 June last year. In 2024, the number of arrivals did not reach over 14,000 until 9 July (14,058). Migrants wearing life jackets were seen being brought ashore from a Border Force vessel in Dover, Kent, on Wednesday morning. A Maritime and Coastguard Agency spokesperson said the coastguard \"coordinated multiple incidents involving small boats in the channel overnight\" from Tuesday into Wednesday. \"HM Coastguard continues to monitor ongoing reports,\" its statement added. Read more from Sky News:Curfew in LA amid migrant protestsTikTok star leaves US over immigration probe On Saturday 31 May, some 1,194 migrants arrived in the UK on 18 small boats, government figures revealed. It was the highest number of arrivals in a single day - far surpassing the previous record of 825 set earlier in May. Following the record number of arrivals on that Saturday, Defence Secretary John Healey told Sky News Britain has \"lost control of its borders\" over the past five years. He told Sunday Morning With Trevor Phillips the previous Conservative government left the UK asylum system in \"chaos\". Recent Sky News analysis has shown that migrants are still arriving in considerable numbers on poor weather days - challenging the view that crossings only increase with an improvement in weather. The data analysis revealed that more people are still making the journey on bad weather days than they were previously, with a rise of 30% compared to last year, and more than double compared to the year before. After vowing to crackdown on illegal immigration, the government is funding elite officers to increase patrols along the northern French coastline and launching a specialist intelligence unit in Dunkirk to track down people smugglers. It has also established a Border Security Command to lead strategy, and its Border Security, Asylum and Immigration Bill, currently going through parliament, would introduce new criminal offences and hand counter-terror-style powers to law enforcement agencies to target smuggling gangs. On Wednesday, Rachel Reeves promised funding of up to £280m more per year by the end of the spending review period in 2028-29 for the Border Security Command. The chancellor also committed to end spending on hotels for asylum seekers by the next general election - which would be in 2029 at the latest, in a plan she said would save taxpayers £1bn a year. In an attack on the Conservative legacy, she said: \"The party opposite left behind a broken system: billions of pounds of taxpayers' money spent on housing asylum seekers in hotels, leaving people in limbo and shunting the cost of failure onto local communities. \"We won't let that stand.\" Following Wednesday's arrivals, shadow home secretary Chris Philp said 15,000 migrants have now crossed the Channel in the \"worst year ever for small boat crossings so far\", adding \"this is a total collapse of border control\"."
    },
    {
        "title": "UK agrees post-Brexit deal on Gibraltar in boost to reset talks with EU",
        "description": "The UK government has agreed a post-Brexit deal with the EU on Gibraltar, unpicking another issue in its negotiations with Brussels.",
        "url": "https://news.sky.com/story/uk-agrees-post-brexit-deal-on-gibraltar-13382213",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gibraltar-spain-eu_6939467.jpg?20250611160728",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-06-11 14:44:00",
        "Headline": "Checks like those at St Pancras for the Eurostar will take place at Gibraltar Airport, carried out by Spanish and Gibraltarian officials.",
        "Content": "\n          Political reporter\n              @TimJ_B\n The UK government has agreed a post-Brexit deal with the EU on Gibraltar, unpicking another issue in its negotiations with Brussels. Foreign Secretary David Lammy flew to the British overseas territory late last night for talks with ministers there, before heading on to Brussels for finalising talks with the EU and Spain. The government says the new agreement resolves the \"last major unresolved issue from Brexit\", and \"avoids the need\" for checks on people and goods crossing the Gibraltar-Spain border, to support \"prosperity in the region\". Politics latest: Chancellor sets out spending Around 15,000 people - more than half of Gibraltar's workforce - cross the border daily. The UK is hoping it will help speed up other post-Brexit discussions as it looks to reset its relationship with the EU. As part of the deal, the government says there will be dual border control checks for arrivals by air at Gibraltar airport, carried out by Gibraltar and Spanish officials, as well as arrivals by sea at the port. Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model the government says is similar to French police operating in London's St Pancras station.   A bespoke agreement was needed for the territory, as Spain claims Gibraltar belongs to them after the UK took control of the territory in the early 18th century. Both Tory and Labour governments have been firm in their stance that they will not give up sovereignty of the territory to Spain. The deal explicitly states the treaty will not impact sovereignty, and also ensures the UK has full operational autonomy for the military facilities there. St Pancras style checks The government said: \"Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. \"Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model similar to French police operating in London's St Pancras station.\" As Sky News deputy political editor Sam Coates points out, some Eurosceptics will be unhappy with the presence of European border guards in British territory. Read more:EU wants to limit UK access to arms fundTop Tory admits Brexit drawback Foreign Secretary David Lammy said: \"This government inherited a situation from the last government which put Gibraltar's economy and way of life under threat. Today's breakthrough delivers a practical solution after years of uncertainty. \"Alongside the government of Gibraltar, we have a reached an agreement which protects British sovereignty, supports Gibraltar's economy and allows businesses to plan for the long-term once again. \"I thank the chief minister and his government for their tireless dedication throughout the negotiations. The UK's commitment to Gibraltar remains as solid as the Rock itself.\" Fabian Picardo, Gibraltar's chief minister, said he was \"delighted\" with the deal, and he was looking \"towards a time of renewed cooperation and understanding\". A statement from the EU side said: \"The parties are confident that this Agreement will support prosperity and bring confidence, legal certainty, and stability to the lives and well-being of the people of the whole region.\""
    },
    {
        "title": "Spending review: Treasury minister Emma Reynolds tells Sky News she is 'not ruling out' tax rises in the autumn",
        "description": "A Treasury minister has refused to rule out tax rises at the budget in the autumn, amid concerns that any global economic instability could mean the government will not have enough money to fund its spending plans.",
        "url": "https://news.sky.com/story/spending-review-treasury-minister-emma-reynolds-tells-sky-news-she-is-not-ruling-out-tax-rises-in-the-autumn-13382351",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-emma-reynolds-treasury-minister_6939648.jpg?20250611201147",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-11 19:51:00",
        "Headline": "The Tory shadow chancellor said \"the mask has slipped\" after Emma Reynolds declined to rule out tax hikes in future.",
        "Content": " A Treasury minister has refused to rule out tax rises at the budget in the autumn, amid concerns that any global economic instability could mean the government will not have enough money to fund its spending plans. Speaking to Sky's Politics Hub With Ali Fortescue, Emma Reynolds defended how the economy was being handled, but would not say if more revenue might be needed from taxation. Asked repeatedly if she was ruling out tax rises, the minister said: \"I'm not ruling it in and I'm not ruling it out. \"We have got £9bn of fiscal headroom [money left in the budget], which is significantly more than the Tories had when they were in power, at the end of their time in power. \"We've got a growing economy, and we, as the chancellor did say in the [Commons] chamber, the budget in the autumn last year was a once-in-a-generation budget where we had to do some very tough things, and we're not going to have another budget like that in the future.\" Politics Hub: Latest updates Responding directly to the minister's interview, shadow chancellor Sir Mel Stride told Sky News: \"The mask has slipped. Today's spending review was nothing more than an obfuscation. \n                  Reeves hands NHS £29bn extra per year and pledges to end asylum hotels\n                 \n                  Spending review's key points at a glance\n                 \n                  Who will win and lose in the spending review\n                 \"Now we know - tax rises are coming.\"  Speaking to Sky's political editor Beth Rigby, the chancellor Rachel Reeves avoided the direct question about potential tax rises, saying: \"Before any money goes out the door, we will have a budget in the autumn, and we will show in the round, when the Office for Budget Responsibility update their forecast, how everything is consistent with the fiscal rules that I set out as chancellor last autumn.\" She added that they \"made the tax changes that were necessary last year to fund the spending that I've set out today\".  Read more:Spending review's key points at a glanceUK agrees post-Brexit deal on GibraltarAre tax rises inevitable after spending review? Ms Reeves has imposed a set of \"iron-clad\" fiscal rules, which restrict government borrowing in order to ensure economic stability and reduce the UK's national debt, Labour says. These rules mean the amount of money she has available to spend on the day-to-day running of public services is limited to only what the government takes in tax revenue. 'A miniscule margin' But as Paul Johnson from the non-partisan Institute for Fiscal Studies told Sky presenter Jayne Secker, the chancellor has left herself very little room for manoeuvre. He said: \"She set the fiscal rules and she's also meeting them by the most miniscule margin imaginable. \"What does that mean? That means if there's any negative news on the economic forecasts and the other forecasts, then she will have to raise taxes in order to meet those rules. And, of course, we have had some negative news over the last few months.\""
    },
    {
        "title": "Powerful new supercomputer to be built in Scotland in government U-turn",
        "description": "A powerful new supercomputer will be built in Edinburgh after all, the chancellor has announced.&#160;",
        "url": "https://news.sky.com/story/powerful-new-supercomputer-to-be-built-in-scotland-in-government-u-turn-13382120",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jupiter-ai-supercomputer_6939265.jpg?20250611124207",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-11 11:33:00",
        "Headline": "The new supercomputer represents a \"pivotal step forward\" for the UK tech industry, according to the chief executive of Founders Forum Group.",
        "Content": "\n          Science and Technology reporter\n       A powerful new supercomputer will be built in Edinburgh after all, the chancellor has announced.  Up to £750m has been put aside for the project, Rachel Reeves revealed as part of her spending review. The Conservatives, when in government, had previously pledged £800m for the project but in August, Labour scrapped the plans, claiming it was part of \"unfunded commitments\". \"We are investing in Scotland's renewal, so working people are better off,\" said Ms Reeves on Wednesday.  On Monday, one of the leading figures in AI, the chief executive of NVIDIA, told the prime minister the UK had all the ingredients to be a leader in AI except for the infrastructure. \"You can't do machine learning without a machine. The ability to build AI supercomputers here in the UK will naturally attract more AI startups\" and create a better ecosystem, said Jensen Huang at London Tech Week. The UK is the third-largest AI market in the world and if the technology is \"fully embraced\", it could bring £47bn to the economy every year, according to the government. \n                  Did ChatGPT get the spending review right? Treasury minister gives his verdict\n                 \n                  Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts\n                 \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 This new computer, built at the University of Edinburgh, will \"give scientists from across the UK the compute power they need,\" according to the Department for Science, Innovation and Technology. It will be the most powerful in the UK and work alongside the AI research resource, which is a developing network of the UK's most powerful supercomputers.  This \"marks a pivotal step forward for the tech sector,\" Carolyn Dawson, the chief executive of Founders Forum Group and Tech Nation, told Sky News. \"The UK's AI ecosystem is brimming with talent and ambition, but to truly compete on the world stage, we need robust, future-ready infrastructure,\" she said. \"This investment in compute power is exactly what's required to accelerate innovation and secure a leading role for Britain in the global AI race.\" The resource has already been used to test millions of potential drugs virtually and speed up research into Alzheimer's vaccines and cancer treatments. \"If all the forecasts are right, the demand for compute is going to grow exponentially over the next few years,\" Laura Citron, who leads London & Partners and works on bringing international companies to the capital, told Sky News before the announcement. \"That's why it's so important that the government is investing very significantly in AI infrastructure, as well as really freeing up the planning regulations so we can get data centres built at speed.\" Read more from Sky News:'Trump's anti-migrant rhetoric boosting UK's tech industry'Musk says he 'regrets' some of his posts about TrumpNumber of Nintendo Switch 2s sold in four days revealed AI demands increasingly huge amounts of computational power because the models process vast amounts of data through billions of mathematical calculations. In order to complete those calculations quickly and accurately, powerful hardware is required, like this new supercomputer. On top of Wednesday's £750m pledge, the prime minister also announced £1bn funding on Monday to scale up the country's AI compute power by 20 times."
    },
    {
        "title": "Heat-health alert and three-day thunderstorm warning issued for parts of the UK",
        "description": "A heat-health alert and yellow weather warning for thunderstorms has been issued for different parts of the UK.",
        "url": "https://news.sky.com/story/three-day-thunderstorm-warning-issued-for-parts-of-the-uk-13382083",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-uk-thunderstorm-weather_6939176.jpg?20250611120422",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-11 10:24:00",
        "Headline": "Temperatures could soar to above 30C and bring the UK's warmest day of the year so far - but forecasters said thunderstorms and heavy rain might lead to disruption in some areas.",
        "Content": "A heat-health alert and yellow weather warning for thunderstorms has been issued for different parts of the UK. The first yellow heat-health alert for 2025 was issued by the UK Health Security Agency (UKHSA) - with upcoming temperatures expected to exceed 30C (86F). The alert comes into force from 9pm on Thursday and runs until 8am on Sunday, covering the East of England, East Midlands, London and South East regions. The notification highlights the risk of increased pressure on healthcare services as a result of the forecast. It also means there is a higher risk to the health of individuals with pre-existing health conditions and for those aged over 65. The UKHSA said people should check on friends, family or neighbours who are \"more vulnerable\" and \"ensure they are aware\" of the forecasts and advice. In addition, the Met Office has warned on Thursday, running from midnight until 1pm, an area stretching from Plymouth into Wales could see disruption due to heavy rain and thunderstorms. It said 40mm of rain could fall in less than three hours in these areas. Check the weather in your area There is also a thunderstorm warning for Northern Ireland, running from 6am until 9pm on Thursday. Then a new warning comes into force at 3pm on Friday for an area stretching from East Anglia into London and across parts of the South East. It runs until 6am on Saturday and warns of disruption from thunderstorms. The conditions could bring flooding to roads and properties, disruption to travel networks, and cause power cuts, the Met Office said. Forecasters also warned of \"frequent\" lightning, hail and \"gusty\" winds. Read more from Sky News:Call for 'No Ball Games' signs to be scrappedTwix advert banned after five complaints Sky News weather producer Christopher England said temperatures could soar above 30C and bring the UK's highest temperature of the year so far. \"It'll be turning warmer over the next few days, with Friday looking to bring the highest temperature, before somewhat cooler conditions return for the weekend - 30 to 31C (87.8F) is just about possible given abundant sunshine,\" he said. \"But 27-29C (80.6-84.2F) looks much more likely, with the hottest places likely to be somewhere from the East Midlands through to southeast Yorkshire and down to southeast England. \"It's just possible we may see the highest temperature of the year so far, beating the 29.3C (84.7F) recorded at Kew on 1 May, but the odds are against it.\""
    },
    {
        "title": "Work and pensions secretary tells MPs controversial disability benefit reforms will go ahead next year",
        "description": "The government has told MPs it will not back down from its controversial reforms to disability benefits, which are set to be introduced to parliament later this month.",
        "url": "https://news.sky.com/story/work-and-pensions-secretary-tells-mps-controversial-disability-benefit-reforms-will-go-ahead-next-year-13382300",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-work-and-pensions-liz-kendall_6808860.jpg?20250123234416",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-11 16:59:00",
        "Headline": "Liz Kendall rejects calls to delay the changes until a full assessment is carried out of the impact on employment, poverty and health.",
        "Content": "\n          Political correspondent\n              @tamcohen\n The government has told MPs it will not back down from its controversial reforms to disability benefits, which are set to be introduced to parliament later this month. More than 100 Labour MPs are thought to have concerns about the plans to cut nearly £5bn from the welfare bill by restricting personal independence payments (PIP) and the health top-up to Universal Credit. Charities say the changes will have a \"catastrophic\" effect on vulnerable people. Politics Hub: Follow the latest updates  The chair of the Commons' Work and Pensions Committee wrote to the secretary of state, Liz Kendall, last month, calling on the government to delay the changes until a full assessment is carried out of the impact on employment, poverty and health. Labour MP Debbie Abrahams wrote that while there was a case for reform to disability benefits, \"the evidence indicated [these changes] might not improve outcomes for most claimants, but instead push many into poverty and further away from the labour market\". 'Reforms are needed now' \n                  How risky is Rachel Reeves's winter fuel U-turn?\n                 \n                  Disabled woman took her own life after benefits wrongly stopped, coroner finds\n                 \n                  Starmer says government 'will look at' scrapping two-child benefits limit\n                 But Ms Kendall has written back, in a letter made public on Wednesday, to reject the idea because the bill needs final approval from parliament in November in order for the changes to take effect in 2026. She wrote: \"We need urgent action to help people who can work, into work. With one in eight young people now not in education, employment or training and nearly 2.8 million people out of work due to long-term sickness, and spending on health and disability benefits set to rise by an additional £18bn, we must change course. \"We have consistently been clear that we are not consulting on every proposal. \"Instead, parliament will have the opportunity to fully debate, propose amendments to, and vote on areas where we have announced urgent reforms that are not subject to consultation. \"With PIP caseload and costs forecast to continue rising, reforms are needed now to make the system sustainable, while supporting those people with the greatest needs.\"  What is the government's plan? The government says the PIP caseload has more than doubled from 15,000 new claims per month in 2019 to 34,000. PIP is a benefit to help disabled people with the increased costs of day-to-day living. It is proposed that claimants will need to achieve four points out of eight in their assessment to qualify for the benefit, and the government says some 370,000 existing claimants will lose out when reassessed. Ms Kendall says the growth in claims means the PIP caseload will still increase by the end of the parliament. The government will also tackle what Ms Kendall called the \"perverse incentive\" to claim the health top-up for Universal Credit by freezing it at £97 a week for existing claimants, and slashing the rate to £50 a week for new claimants. The average loss of benefits will be £1,700 a year for some three million people. Claimants with the most serious conditions, who have been assessed as never able to work, will not be subject to reassessment, ministers say, allowing them to have peace of mind. The government will provide £1bn for targeted support schemes to help disabled people into work. But it's estimated these will help only some 70,000 people find employment.  Ms Kendall said a minister in her department is engaging with disabled people and organisations about the PIP assessment process, but said: \"The PIP assessment review will rightly take time and require extensive engagement, and we cannot wait for its conclusion to make the urgently needed changes to the PIP eligibility criteria.\" 'Deeply disappointing news' The first minister of Wales, Eluned Morgan, who is gearing up for elections next year, told Sky News she had spoken to Ms Kendall about her concerns last week. She said: \"This is going to be really challenging for a lot of people in Wales. We know more people in Wales will be affected by PIP than in any other part of the country. \"We do think there needs to be reform of welfare because we believe people can work should work, but in Wales we have examples of where we hold people's hands, stand by them, we help them into work, and we think that's more of a productive approach.\" Read more:Spending review's key points at a glanceUK agrees post-Brexit deal on GibraltarAre tax rises inevitable after the spending review? Labour MP Richard Burgon, who has vowed to vote against the reforms, said: \"This will be deeply disappointing news for all the MPs who've been urging the government to delay this decision. Instead of allowing time for proper scrutiny and meaningful dialogue with disabled people, the government has brushed aside MPs' genuine concerns. \"These planned disability cuts should be scrapped - not rushed through without proper scrutiny.\""
    },
    {
        "title": "Controversial aid distributer claims Hamas has carried out deadly attack on bus carrying Palestinians",
        "description": "The controversial US and Israeli-backed aid distributor in Gaza has accused Hamas of a deadly attack on a bus carrying Palestinians working with the organisation.",
        "url": "https://news.sky.com/story/controversial-aid-distributer-claims-hamas-has-carried-out-deadly-attack-on-bus-carrying-palestinians-13382379",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-khan-younis_6939717.jpg?20250612015113",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-11 23:39:00",
        "Headline": "The Gaza Humanitarian Foundation (GHF), which is backed by the US and Israel, has said it fears some team members \"may have been taken hostage\".",
        "Content": "The controversial US and Israeli-backed aid distributor in Gaza has accused Hamas of a deadly attack on a bus carrying Palestinians working with the organisation. The Gaza Humanitarian Foundation (GHF) has said at least five aid workers were killed and it fears some team members \"may have been taken hostage\". The aid organisation also said multiple people were injured in the alleged attack. In a statement, the GHF has said the bus was carrying more than two dozen people working with the organisation when it was targeted at 10pm Gaza time (8pm UK time) on Wednesday. The GHF said those in the bus were \"local Palestinians\" working with the organisation to \"deliver critical aid\". \"At the time of the attack, our team was en route to one of our distribution centres in the area west of Khan Younis\", the GHF added. It continued in its statement: \"We are still gathering facts, but what we know is devastating: there are at least five fatalities, multiple injuries, and fear that some of our team members may have been taken hostage. \n                  Palestinians killed by Israeli gunfire at US-backed aid site, officials say\n                 \n                  Dozens more killed near food distribution centre in Gaza, claims Hamas-run health ministry\n                 \n                  Greta and Gaza – what did she achieve?\n                 \"We condemn this heinous and deliberate attack in the strongest possible terms. These were aid workers.\" The GHF also said in its statement that Hamas has in recent days been threatening members of the organisation, including aid workers, and civilians who have been receiving the aid. The organisation said it holds Hamas fully responsible for \"taking the lives of our dedicated workers who have been distributing humanitarian aid to the Palestinian people at the foundation's sites in central and southern Gaza\". \"Tonight, the world must see this for what it is: an attack on humanity. We call on the international community to immediately condemn Hamas for this unprovoked attack and continued threat against our people simply trying to feed the Palestinian people,\" the GHF said. \"We will release additional information once it becomes available. Despite this heinous attack, we will continue our mission to provide critical aid to the people of Gaza.\" Read more:How the Israeli-backed aid plan in Gaza is unravellingTwo Israeli ministers who have been sanctioned by the UK?  The alleged attack came hours after health officials in Gaza said at least 25 Palestinians were killed by Israeli gunfire at a GHF site close to the former settlement of Netzarim, near Gaza City. Medical officials at Shifa and al Quds hospitals say the people were killed as they approached the site. Gaza's health ministry said earlier this week that around 160 people have been killed in shootings near aid sites run by the GHF since they began distributing aid on 26 May. However, the GHF has said there has been no violence in or around the distribution centres themselves.  Why is the aid system controversial? Israel and the US have said the GHF system is aimed at preventing Hamas from siphoning off assistance. Israel has not provided any evidence of systematic diversion, and the UN denies it has occurred. The foundation's distribution of aid has been marred by chaos, and multiple witnesses have said Israeli troops fired on crowds near the delivery sites. UN agencies and major aid groups have refused to work with the new system, saying it violates humanitarian principles because it allows Israel to control who receives aid and forces people to relocate to distribution sites, risking yet more mass displacement in the territory. Jake Wood, a former US marine, resigned as head of the GHF in May before it began distributing aid in Gaza over concerns about is independence. Mr Wood said the foundation cannot adhere to the \"humanitarian principles of humanity, neutrality, impartiality, and independence, which I will not abandon\"."
    },
    {
        "title": "French police forced to watch on as migrants in Dunkirk attempt perilous Channel crossing",
        "description": "As the first light breaks across a quiet beach near Dunkirk, a human tide begins to move.",
        "url": "https://news.sky.com/story/french-police-forced-to-watch-on-as-migrants-attempt-perilous-channel-crossing-13382079",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-alex-rossi-channel-crossing_6939130.jpg?20250611112609",
        "type": "World",
        "Author": "Alex Rossi",
        "Date Published": "2025-06-11 10:19:00",
        "Headline": "Despite millions spent by the UK government to curb migrant crossings, the numbers continue to rise. Sky's Alex Rossi watched as migrants, many with children, attempted the potentially deadly crossing.",
        "Content": "\n          International correspondent\n              @alexrossiSKY\n  As the first light breaks across a quiet beach near Dunkirk, a human tide begins to move. Dozens of migrants, many with children, rush across the sand toward the water's edge. French police are present, but they do not intervene. For many of these men, women, and children, this moment marks the final chapter of a journey that began months ago, fleeing war, persecution, and economic collapse in countries as far afield as Iran, Eritrea, and Sudan. Now, they face the potentially deadly crossing to the UK in a flimsy inflatable boat. We watched as one vessel emerged from an inland waterway already crowded with people. The vessel is soon dangerously overloaded. Floating haphazardly, a baby is yanked onto the boat, as they yell out for more people to climb aboard. Despite the dinghy taking on water - scooped out with a shoe - the crossing continues. On the shore, police officers stood by, watching. When I asked why no attempt was made to intervene, one officer said: \"It's for their safety. \"There are children there. We're not going to throw grenades at them. It's inhumane. But it's sad.\" French police protocol, along with international law, makes such interventions legally and morally complex once boats are afloat - especially when families are involved. Despite millions spent by the UK government to curb these crossings, the numbers continue to rise. As of the latest count, almost 15,000 people have already made the perilous journey across the Channel this year. Many more are expected this summer as the weather window widens. In the makeshift camps near Dunkirk, migrants wait their turn for the smugglers to signal that conditions are right. Ali Reza told us he fled Iran after converting to Christianity. He dreams of reaching Britain, where he hopes to claim asylum. He said: \"Britain is good and accepts refugees. It has good behaviour for refugees. \"I think I'll get a good welcome. Many Iranian people go to Britain. There's good behaviour.\" Read more from Sky News:Spending review: The key announcementsThree-day thunderstorm warning issued for parts of the UK Back on the beach, not everyone manages to get aboard. The boat taxi service is in high demand. Among the group, a woman from Eritrea spoke with me briefly. Although she missed today's crossing, she vowed to try again later in the week."
    },
    {
        "title": "Palestinians killed by Israeli gunfire at US-backed aid site, officials say",
        "description": "At least 25 Palestinians have been killed by Israeli gunfire at a US-backed humanitarian aid site in Gaza, according to health officials.",
        "url": "https://news.sky.com/story/palestinians-killed-by-israeli-gunfire-at-us-backed-aid-site-officials-say-13382041",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-palestinians-gaza-humanitarian_6939053.jpg?20250611095831",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-11 08:50:00",
        "Headline": "The fatalities are the latest near an aid distribution centre and came hours after another strike killed 17 people at a similar site in Rafah.",
        "Content": "At least 25 Palestinians have been killed by Israeli gunfire at a US-backed humanitarian aid site in Gaza, according to health officials. Medical officials at Shifa and al Quds hospitals say the people were killed as they approached the site - operated by the Gaza Humanitarian Foundation (GHF). Dozens more were injured at the scene close to the former settlement of Netzarim, near Gaza City, medical officials from the Hamas-run territory added. It comes just a day after Gaza health officials said 17 people were killed close to another GHF site in Rafah, southern Gaza. Health officials said at least another six people were killed by Israeli gunfire as they approached a GHF site in Rafah on Wednesday. Ten other people were also killed on Wednesday by Israeli strikes in Khan Younis, in southern Gaza, according to officials. The Israeli military said its forces fired warning shots towards suspects who were advancing and which it claimed posed a threat to the troops in the area of Netzarim. \"This is despite warnings that the area is an active combat zone. The IDF is aware of reports regarding individuals injured. The details are under review,\" it added. A total of 163 people have been killed and more than 1,000 wounded trying to reach the handful of aid sites operated by the GHF since it began work two weeks ago after a three-month blockade, according to the Hamas-run Gaza health ministry. It comes as the US ambassador to Israel said he does not think an independent Palestinian state remains a foreign policy for the Trump administration. Mike Huckabee's comments to Bloomberg News prompted the White House to say he spoke for himself. When asked if a Palestinian state remains a US goal, Mr Huckabee said: \"I don't think so.\"  Read more:'Dozens killed' near food distribution centre in GazaUK government sanctions Israeli ministers for 'inciting violence'  Asked about Mr Huckabee's comments, the White House referred to remarks earlier this year by Donald Trump when he pledged an American takeover of Gaza - a proposal which was condemned globally. Rights groups, Arab states, Palestinians and the UN said such a move amounted to \"ethnic cleansing\"."
    },
    {
        "title": "Farewell letter from gunman discovered as Austria mourns school shooting victims",
        "description": "A farewell letter and video have been discovered at the home of a 21-year-old gunman who killed 10 people in a school shooting in Austria, as the nation observed a minute's silence on Wednesday.",
        "url": "https://news.sky.com/story/farewell-letter-from-gunman-discovered-as-austria-mourns-school-shooting-victims-13382136",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-minutes-silence-austria_6939523.jpg?20250611172028",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-11 11:59:00",
        "Headline": "Officials in Graz say that the youngest victim among the 10 people killed in Tuesday's attack was aged 14, while 11 other people remain in hospital. But questions remain about the gunman's motive.",
        "Content": "A farewell letter and video have been discovered at the home of a 21-year-old gunman who killed 10 people in a school shooting in Austria, as the nation observed a minute's silence on Wednesday. The country paused at 10am local time (9am UK time), marking the moment of the attack a day earlier at the BORG Dreierschützengasse high school in the southeastern city of Graz. A teacher and nine students were killed - six girls and three boys aged between 14 and 17. Another 11 people were wounded. Hundreds of people gathered for the silence in the central square of Austria's second-biggest city, some also lighting candles in memory of those killed, others hugged each other, as they tried to come to terms with the tragedy. In the capital Vienna, trams, subway trains and buses also stopped for a minute. Hundreds of people joined Austrian officials at a service on Tuesday evening in Graz cathedral. Police said the gunman, who took his own life, was a former student at the school who had not completed his studies. \n                  What we know so far about school shooting in Austria\n                 \n                  Graz: At least 10 dead - including suspected lone gunman - in Austrian school shooting, police say\n                 \n                  Johann Strauss' The Blue Danube to be broadcast into deep space\n                 But they added they do not yet know what his motive was.  The unnamed man used two weapons in the attack, a shotgun and a pistol, which he owned legally. On Wednesday, officers searched the home where he lived with his mother near Graz and found a pipe bomb, which was not operational, along with abandoned plans for a bombing. Franz Ruf, public security director at Austria's interior ministry, told TV network ORF about the messages which officers discovered. \"A farewell letter in analog and digital form was found. He says goodbye to his parents. But no motive can be inferred from the farewell letter, and that is a matter for further investigations,\" Mr Ruf said. He added that the wounded people were found on various levels of the school and in the front of the building, but would not speculate on whether they were specifically targeted by the gunman. Read more from Sky News:Trump's plan in Ukraine 'naive'Musk 'regrets' some Trump postsAnalysis: US-China trade talks Among those in the square on Wednesday was Chiara Komlenic, 28, who said she always felt safe when she attended the school. \"I made lifelong friendships there. It just hurts to see that young girls and boys will never come back, that they experienced the worst day of their lives where I had the best time of my life... it just hurts a lot,\" she said. On Wednesday morning, local health officials said that those injured were aged between 15 and 26 and were in a stable condition. Nine were still in intensive care units, two of whom needed further operations. Another two had been moved to regular wards. Austria has declared three days of national mourning following what appears to be the deadliest attack in its post-Second World War history."
    },
    {
        "title": "Los Angeles protests: Riot police enforce curfew as demonstrations spread across US",
        "description": "A curfew has been enforced in Los Angeles as demonstrations against Donald Trump's immigration crackdown spread to other cities across America.",
        "url": "https://news.sky.com/story/los-angeles-protests-mayor-imposes-curfew-to-stop-the-looting-as-police-make-197-arrests-13381947",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-manhattan-protest_6939112.jpg?20250611111526",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-11 00:53:00",
        "Headline": "The protests, in response to immigration enforcement raids, have now taken place in several cities beyond LA, including New York, Chicago, Philadelphia, Atlanta, Washington, Seattle and Las Vegas.",
        "Content": " A curfew has been enforced in Los Angeles as demonstrations against Donald Trump's immigration crackdown spread to other cities across America. Mayor Karen Bass said restrictions were in force in downtown areas of LA from 8pm to 6am local time (4am to 2pm UK time) until further notice as officials attempt to \"stop the vandalism and stop the looting\". She confirmed that a local emergency had been declared as \"we reached a tipping point\", with 23 businesses looted on Monday night. The protests are in response to raids carried out by the US Immigration and Customs Enforcement agency (ICE) and demonstrations have spread to several cities, including New York, Chicago, Philadelphia, Atlanta, Oregon, Seattle and Las Vegas. Police in Los Angeles swiftly enforced a downtown curfew on Tuesday night, deploying officers on horseback and arresting 197 people. Jim McDonnell, the chief of the LA Police Department, described the curfew as a \"necessary measure to protect lives\" as \"unlawful and dangerous behaviour\" had been escalating in the last few days. Residents, people who are homeless, those travelling to and from work, credited media as well as public safety and emergency personnel, were exempted from the curfew. \n                  Is Trump ready to wage war at home?\n                 \n                  Is Ukraine winning the spy war? In conversation with ex-CIA chief\n                 \n                  'This is our city': Furious immigrants vow to 'defend' LA against Trump crackdown\n                 The curfew covered a one-square mile section of downtown LA that included the area where protests have happened since Friday. The city of Los Angeles encompasses about 500 square miles. US President Donald Trump has activated 4,000 National Guard troops - the federal reserve force - to protect ICE officers carrying out raids as well as federal buildings in LA, despite objections by California Governor Gavin Newsom, who called the deployments unnecessary, illegal and politically motivated. Mr Trump also sent 700 marines, who were expected to start operating in the LA area on Wednesday, according to the US Northern Command. Read more from Sky News:Eyewitness: Furious immigrants vow to 'defend' LAWhat we know about the LA immigration raids and protestsExplainer: Who is Gavin Newsom? State officials said Mr Trump's response was an extreme overreaction to mostly peaceful demonstrations, with California senators Adam Schiff and Alex Padilla saying the domestic mobilisation of active-duty military personnel should only happen \"during the most extreme circumstances, and these are not them\". Mr Trump defended his decision in a speech to soldiers at the army base in Fort Bragg, North Carolina, saying his administration would \"liberate Los Angeles\". \"Generations of army heroes did not shed their blood on distant shores only to watch our country be destroyed by invasion and third-world lawlessness,\" Mr Trump said. \"What you're witnessing in California is a full-blown assault on peace, on public order and on national sovereignty, carried out by rioters bearing foreign flags.\" 👉 Follow Trump100 on your podcast app 👈 Gavin Newsom launched a blistering response in an address on Tuesday evening, saying the deployment of the National Guard without consulting Californian officials was a \"brazen abuse of power by a sitting president\". He said it \"enflamed a combustible situation, putting our people, our officers and even our National Guard at risk\". \"That's when the downward spiral began. He doubled down on his dangerous National Guard deployment by fanning the flames even harder - and the president, he did it on purpose,\" Mr Newsom said. US correspondent California Governor Gavin Newsom's televised address to the nation felt presidential as he took the fight to the man in the Oval Office, with a series of scorching putdowns. He made a compelling case that Donald Trump's extraordinary decision to send troops to LA against his wishes had put the country on the brink of authoritarianism. He spoke the day after the Pentagon announced 700 marines were being deployed to join 4,000 National Guard troops ordered to the streets of LA by Trump.  But there has been no evidence so far that local law enforcement is being overwhelmed by the size or might of this resistance movement. The head-to-head between Trump and Newsom is a compelling one. The governor is known to harbour presidential ambitions for 2028 and is something of a MAGA bogeyman.  Newsom presides over a blue state, the biggest in the country, and is growing his brand with a podcast and - now - Trump has effectively put him in the national spotlight by bringing this political battle to his door. The governor accused Mr Trump of choosing escalation and \"theatrics over public safety\", as the situation was \"winding down\" before the president deployed the troops. Mr Newsom added: \"When Donald Trump sought blanket authority to commandeer the National Guard, he made that order apply to every state in this nation. \"This is about all of us, this is about you. California may be first, but it clearly won't end here; other states are next. Democracy is next. Democracy is under assault before our eyes.\" Homeland Security said on Monday that ICE had arrested 2,000 immigration offenders per day recently, which significantly exceeds the 311 daily average in the fiscal year 2024 under former president Joe Biden."
    },
    {
        "title": "Ex-CIA director John Brennan calls Donald Trump's plan in Ukraine 'naive' and 'unsophisticated'",
        "description": "It is nearly 150 days since Donald Trump took office for the second time, promising peace in the Middle East and Ukraine.",
        "url": "https://news.sky.com/story/ex-cia-director-john-brennan-calls-donald-trumps-plan-in-ukraine-naive-and-unsophisticated-13382026",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-vladimir-putin-donald-trump_6856280.jpg?20250314144324",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-06-11 08:15:00",
        "Headline": "On this week's The World podcast, ex-CIA director John Brennan tells Yalda Hakim and co-host Richard Engel about his assessment of the US president's strategy in Ukraine and Kyiv's devastating drone attack on Russia.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n It is nearly 150 days since Donald Trump took office for the second time, promising peace in the Middle East and Ukraine. For the latter, the war grinds on, with reports last week that Russia passed the grim milestone of one million deaths. Ukraine continues to be bombarded, with Russia launching its biggest drone attack against the country since the start of the war. Most likely in retaliation for Ukraine's audacious Operation 'Spider's Web' at the beginning of the month, which saw remote-controlled drones launched deep into Russia, blowing up billions of dollars' worth of military equipment. Russia saw this as a significant escalation, as Moscow's ambassador to the UK told me in a sit-down interview last week. Ukraine war latest: Moscow launches deadly strikes Peace feels a long way off right now. But does President Trump have a plan? Ex-CIA director John Brennan does not think so. On this week's The World podcast, he called Trump's understanding of both Ukraine and Vladimir Putin \"naive\" and \"unsophisticated\". I asked him what he thinks the president may do and, in no uncertain terms, he told me: \"I think that Donald Trump doesn't know what he will do.\" It is no secret that the former director holds a low estimation of the president. For what it's worth, the feeling is mutual. In January, Trump revoked the director's security clearance, and during his first term called him the \"worst\" CIA chief in history. But, Brennan knows Ukraine. Some reports say that it was during his time as director that the CIA began training Ukrainian spies.  When he first visited the country in 2014, he recounts how the forces \"were still riddled with a lot of the Russian services\", but a decade later, what is his assessment of the country's military? \"Pound for pound, [it] punches above the weight of virtually every other military on the globe, I would say including the United States, given the tremendous experience that they've gained on the battlefield\". So, does the director really believe Ukraine's allies had no prior warning of Ukraine's drone attack? A career spook, he trod carefully around the questions, but admitted: \"I don't doubt for a moment that they were given some additional assistance from Western intelligence and military authorities and capabilities. \"The Ukrainians have done a lot on their own, but I think a lot of this is initially enabled by some ideas that come from their Western allies.\" Read more from Sky News:Musk 'went too far' over Trump postsWorld's biggest TikTok star leaves USTen killed in Austria school shooting As the battlefields of Ukraine dry out to face another summer of war, this conflict continues to prove it is the \"laboratory of the future\", as my co-host Richard Engel described it. The drone war intensifies, as does the battle of words between the two countries. As a war of attrition continues in Ukraine, will Donald Trump, now preoccupied with protests in Los Angeles and unleashing thousands more troops on demonstrators, walk away from Ukraine and abandon it?"
    },
    {
        "title": "US-China trade talks: The fact neither side is saying much on the outcome says a lot",
        "description": "In the absence of detail, all we can do is read between the lines of what may or may not have been agreed in the London talks between the US and China.",
        "url": "https://news.sky.com/story/us-china-trade-talks-the-fact-neither-side-is-saying-much-on-the-outcome-says-a-lot-13382040",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-he-lifeng-scott-bessent_6939202.jpg?20250611121759",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-06-11 08:49:00",
        "Headline": "By most assessments, China has the upper hand in a dangerous supply chain war with the potential to wreak deep economic harm.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n In the absence of detail, all we can do is read between the lines of what may or may not have been agreed in the London talks between the US and China. And a degree of scepticism feels appropriate. The fact neither side is saying much says a lot in itself. A major new breakthrough seems unlikely. You only need to compare it to the conduct of the delegations following the first round of talks in Geneva to feel the difference in tone. Those talks did indeed yield significant breakthroughs including temporary reductions to most of the tariffs and an agreement to keep talking. There, the Americans in particular were quick to get in front of the cameras to describe the \"substantial progress\" with Trump himself extolling \"a total reset\" in the relationship. Not so this time. Instead we have relatively dry statements from both sides about a \"framework to implement the consensus\" reached at both Geneva and during a phone call between Trump and Xi last week. Any further description was tepid at best, with China's official news agency describing the discussions as \"candid\" a word often used when there has been substantial disagreement. Read more: Why Trump blinked in US-China trade war  High stakes It's hard to overstate how high the stakes have become. What started as a trade war has morphed into a dangerous supply chain war with the potential to wreak deep economic harm. And by most assessments, it is China that has the upper hand. Indeed, while the US has introduced a spate of new measures designed to block China's access to high-tech chips, China has moved to slow and complicate the exports of crucial rare earth minerals to the US. These metals are absolutely vital in the manufacture of everything from cars to weaponry, and China has the vast majority of the world's supply. The new controls have brought some production lines to the brink of standstill, and the West is alarmed. On the ground here in China you get a sense that while this standoff will cause pain, there is confidence too, particularly in its ability to home grow the type of technology the US is attempting to block. Indeed, as these talks were ongoing, a branch of the Chinese government was showing foreign journalists around usually hard-to-access high-tech businesses.  A confident China A controlled and choreographed affair, yes, but an insight too into where government attention and priorities lie and where they are feeling confident. \"We've caught up with America in terms of technology and quality,\" said Zhou Zhiliang, CEO of GeneMind, a high-tech DNA sequencing and diagnostics company. \"We just need to catch up in terms of the market, building trust in Chinese products and the scale of utilisation.\" Others, when we asked about restrictions imposed by the US, seemed relatively unfazed. \"The trade friction between China and US will have an impact on many industries,\" said Zhang Jinhua, founder of IASO Biotechnology, a company specialising in high-tech cell therapies. \"But this is what running a business is like, you always have to face challenges and situations you never expected before, you have to face them.\" And while some moments of candour reveal the frustrations faced by Chinese businesses, the attitude seems to be that none are insurmountable. \"We were selling our products via Amazon, although we now face some problems,\" said Yu Kai, co-founder of conversational AI product AISpeech. \"But I believe it can be solved. The current technology dispute doesn't affect us very much, because we rely on ourselves.\" Indeed, that is the key problem for the US. China can increasingly rely on itself and is making rapid progress in the development of its own chips and AI technology. Read more:Why Trump blinked in US-China trade warDiplomatic win for UK hosting US-China trade talks In contrast, the US is totally beholden to China on rare earths; the development of its own supply would be lengthy and extortionately expensive. With this upper hand, China will have been driving an exceedingly hard bargain in London. In an atmosphere of extreme distrust, where neither side will want to be seen to concede, reaching a sustainable truce will be very hard indeed."
    },
    {
        "title": "UK backs UN treaty to stop oceans becoming the 'wild west'",
        "description": "A new treaty to govern international waters  is \"tantalisingly close\" after countries - including Britain - promised to sign it into law.",
        "url": "https://news.sky.com/story/uk-backs-un-treaty-to-stop-oceans-becoming-the-wild-west-13382017",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-high-seas-treaty-un-ocean-conference_6939074.jpg?20250611103205",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-11 08:03:00",
        "Headline": "The treaty seeks to protect large parts of the world's oceans, which remain ungoverned and vulnerable to over-fishing, climate change and deep-sea mining",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A new treaty to govern international waters  is \"tantalisingly close\" after countries - including Britain - promised to sign it into law. The British government said this week that it will introduce legislation by the end of the year to ratify the UN High Seas Treaty, following a recent surge in support from other countries to do the same. At present, remote waters, which make up nearly two-thirds of the world's oceans, are largely lawless and are vulnerable to over-fishing, climate change, the threat of deep-sea mining and geo-engineering. Prince William on Sunday said protecting the planet's oceans was a challenge \"like none we have faced before\" after teaming up with Sir David Attenborough to discuss the plight of the vital resource. The High Seas Treaty was agreed by 193 countries two years ago, but cannot come into force unless 60 countries ratify it. This week at the UN Ocean Conference in Nice, France, countries ratifying it passed 50, bringing what could be the first legally binding agreement on protecting international waters a step closer.  \"The entry into force is within our sight,\" UN secretary general Antonio Guterres told reporters on Tuesday. \"We do not have a moment to lose.\" He called the ocean the \"lifeblood of our planet\", which \"feeds the soul\". \"It produces half of the oxygen we breathe, nourishes billions of people, supports hundreds of millions of jobs, and underpins global trade.\" Campaigners have called the high seas the \"wild west\" of the ocean as they are mostly ungoverned, and said a treaty could deliver protection at sea \"on a scale we've never seen before\". Chris Thorne, Greenpeace UK oceans campaigner, said: \"We're tantalisingly close to a huge moment for the planet.\" Governments that ratify the treaty could be held accountable under their own jurisdictions and at an oceans tribunal, but it would be difficult to force other countries to follow the rules, even if they agreed to the treaty. The drive comes as President Donald Trump pulls the United States and its money out of environmental projects, and as some European governments weaken green policy and overseas aid commitments. The treaty also sets out how countries would share technology, newly discovered resources and funding. It would mean decisions would have to be made collectively through negotiations, rather than by individual countries going it alone. The UK government has previously been criticised by environmentalists for dragging its heels on ratification. The Department for Environment Food and Rural Affairs (Defra) said the treaty would help conserve \"rare, valuable and important marine life of the high seas\", safeguarding them against unsustainable fishing and industrial activities.Marine minister Emma Hardy said: \"Without urgent action, [our oceans] will be irreversibly destroyed.\" During the conference, which finishes on Friday, the UK government also proposed to extend a ban on bottom trawling to more marine protected areas in English waters."
    },
    {
        "title": "Khaby Lame: World's biggest TikTok star leaves US after being detained by ICE",
        "description": "Khaby Lame, the world's most popular TikTok personality, has left the US after being detained by federal agents.",
        "url": "https://news.sky.com/story/khaby-lame-worlds-biggest-tiktok-star-leaves-us-after-being-detained-by-ice-13381989",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-khaby-lame-tiktok-star_6938985.jpg?20250611090924",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-11 06:27:00",
        "Headline": "An ICE spokesperson said Khaby Lame was detained at Harry Reid International Airport in Las Vegas after he \"overstayed the terms of his visa\".",
        "Content": "Khaby Lame, the world's most popular TikTok personality, has left the US after being detained by federal agents. An Immigration and Customs Enforcement (ICE) spokesperson said the Senegalese-Italian influencer - who has 162.2m followers on TikTok - was detained on Friday at Harry Reid International Airport in Las Vegas after he \"overstayed the terms of his visa\". The 25-year-old had arrived in the US on 30 April, the ICE spokesperson added, and was allowed to leave the country without a deportation order by a voluntary departure. Those with a deportation order on their records can be prevented from being allowed back into the US for up to a decade. While in the US, Lame - whose legal name is Seringe Khabane Lame - attended the Met Gala and the Metropolitan Museum of Art's Costume Institute benefit gala in New York City. He became famous online during the COVID-19 pandemic, where he would react to complicated life hack videos without saying a word. With millions of followers, he signed a multi-year partnership with designer brand Hugo Boss in 2022, and was appointed as a UNICEF goodwill ambassador in January this year. Read more:Twix advert banned for encouraging dangerous drivingWhat we know about the LA immigration raids and protests He has not publicly commented on his detention, and has continued posting on TikTok since. Sky News has approached his representatives for comment."
    },
    {
        "title": "Harvey Weinstein found guilty of criminal sexual act in New York retrial",
        "description": "Disgraced movie mogul Harvey Weinstein has been found guilty of committing a criminal sexual act in a retrial in New York.",
        "url": "https://news.sky.com/story/harvey-weinstein-found-guilty-of-criminal-sexual-act-in-new-york-retrial-13380041",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-harvey-weinstein_6935795.jpg?20250606121403",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-11 18:00:00",
        "Headline": "The case was being retried after an appeals court overturned his 2020 conviction last year.",
        "Content": "Disgraced movie mogul Harvey Weinstein has been found guilty of committing a criminal sexual act in a retrial in New York. The 73-year-old was found not guilty of another count of committing a criminal sexual act relating to a second woman. The jury has so far not recorded a verdict in relation to an allegation of rape against a third woman. Weinstein pleaded not guilty to all three charges and has denied assaulting anyone or having non-consensual sex. The case was being retried after an appeals court overturned his 2020 conviction last year. He was accused of raping aspiring actress Jessica Mann in a New York hotel room in 2013 and forcing oral sex on two other women. Two of the charges were those he faced during the original trial, while the third - one of the charges of forcing oral sex - was added last year. The partial verdict came after an extraordinary day which saw the jury foreperson ask to speak to the judge and Weinstein himself call for the trial to be halted. \"My life is on the line and you know what? It's not fair,\" the former movie mogul said. \"It's time, it's time, it's time, it's time to say this trial is over.\" He spoke before there was a verdict on any of the charges. The foreperson requested to speak to the judge about \"a situation\". The man - who had on Monday complained other jurors were pushing people to change their minds, and talking about information beyond the charges - was questioned in private, at his request. The episode was the latest sign of jurors under strain. On Friday, one asked to be excused because he felt another juror was being treated unfairly - at which point Weinstein lawyers unsuccessfully asked for a mistrial. Nearly eight years ago, a series of sexual misconduct allegations against the Oscar-winning movie producer propelled the #MeToo movement. Read more:What has happened to the #MeToo movement? Some of those accusations later generated criminal charges and convictions in New York and California. Before the retrial, Weinstein was also serving a 16-year prison sentence after being found guilty of rape in California in December 2022. He had also denied this charge."
    },
    {
        "title": "Why Trump's military 'birthday' parade is so controversial",
        "description": "For the first time in more than 30 years, tanks will roll through the capital of the United States.",
        "url": "https://news.sky.com/story/why-trumps-military-birthday-parade-is-so-controversial-13382096",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-us-gulf-war-celebration_6939179.jpg?20250611120730",
        "type": "US",
        "Author": "Megan Harwood-Baynes, news reporter",
        "Date Published": "2025-06-11 10:53:00",
        "Headline": "The 250th anniversary of the United States Army could see hundreds of thousands descend on Washington DC to watch tanks roll through the streets for the first time in three decades.",
        "Content": "By Megan Harwood-Baynes, news reporter  For the first time in more than 30 years, tanks will roll through the capital of the United States. The 250th anniversary of the United States Army could see hundreds of thousands descend on Washington DC to watch as 60-ton M1 Abrams battle tanks and Paladin self-propelled howitzers rumble along the streets. But, like almost everything Donald Trump is involved in, it has not come without controversy or criticism. It wasn't originally planned as a birthday celebration - the event had been in the works since before Trump was elected - but earlier this year the President announced his intention add a massive military parade to the event, which would coincide with his own 79th birthday. Speaking earlier this week, Trump said it is going to be a \"big day\", adding: \"We want to show off a little bit.\" Officials have estimated around 200,000 people could turn out, including protesters, plus 6,600 soldiers, 150 vehicles and 50 aircraft. More than 1,500 'No Kings' demonstrations have also been planned across the US, but the group has said it will not be holding events in Washington DC, in part to avoid a direct confrontation. \n                  Boos and cheers for Trump as he visits Kennedy Center for Les Mis\n                 \n                  Ex-CIA director John Brennan calls Donald Trump's plan in Ukraine 'naive' and 'unsophisticated'\n                 \n                  Donald Trump responds after Elon Musk admitted 'regrets' over explosive row\n                 It comes as the president warned that any protesters who rain on his military parade \"will be met with very big force\". Does the US typical hold military parades? Unlike other countries, military parades in the United States are fairly rare, but Trump has made no secret of his desire for one. The last time such a major display took place in the US it was in 1991, when tanks and thousands of troops paraded through Washington to celebrate the ousting of Iraqi president Saddam Hussein's army from Kuwait. During Trump's first administration, he ordered the Pentagon to look into holding a display after a visit to France in 2017. He was seemingly inspired after witnessing the country's Bastille Day parade, and attempted to plan a Veteran's Day parade for 2018. However, this was cancelled due to \"ridiculously high\" cost estimates. Trump ultimately settled for a display of tanks and other armoured vehicles during a fourth of July celebration, named Salute to America, two years later. What is happening on the day? Saturday will start with a wreath-laying ceremony in the morning at Arlington National Cemetery, followed by an army birthday festival on the National Mall in DC. The festival will include equipment displays and military demonstrations. The day will conclude with a military parade throughout the city, overseen by Trump. After the parade, the US Army Golden Knights team will parachute in and present the president with a flag. How much will it cost? All the celebrations will cost the US Army between $25 million (£18.51m) and $45 million (£33.33m), officials told Reuters. These estimates include costs that will be born by the city of Washington, include litter clean up. The event will involve 18 miles of fencing and 175 metal detectors being installed in the capital. The military has also begun taking steps to protect the streets from damage caused by heavy tanks, including laying down metal plates in some areas. The Army said it will pay for any unexpected repairs if needed and has set aside several million dollars in case of damage. Why is it controversial? President Trump's critics have called the parade an authoritarian display of power, that is particularly wasteful as his administration seeks to slash federal spending. The cost of the Army's celebration is several million dollars more than it would have been without a parade, officials said. Among the critics is California Governor Gavin Newsom, who has been trading barbs with Trump since the outbreak of riots in LA. \"And we all know, this Saturday, he's ordering our American heroes - the United States military - forcing them to put on a vulgar display to celebrate his birthday, just as other failed dictators have done in the past,\" he said. \"This is his ego and making everything about 'him',\" Senator Jack Reed, the top democrat on the Senate Armed Services Committee, has also said. But other officials have pointed out plans for the Army's 250th birthday began before Trump won the presidential election, and it is not officially an event to mark his birthday - the dates just happen to be the same. How will it compare to military parades around the world? One of the criticisms of the parade is that it is a show of military might more often seen in authoritarian countries, such as North Korea, Russia, Iran and China. This is because tanks in the streets are symbolically associated with these regimes, where they are designed to inspire nationalism and fear, whilst also promoting obedience - they often take place under the watchful eye of their country's leader. Russia holds its annual Victory Day parade on 9 May to commemorate the country's Soviet victory over Nazi Germany. In recent years, it has been used to protect military strength during the Ukraine war. China holds a National Day parade on 1 October every ten years, or on key anniversaries, to celebrate the founding of the People's Republic in 1949. Read more:Why is the president giving babies $1,000?Elon Musk says he 'regrets' Trump postsRiot police enforce LA curfew In Iran, an Army Day Parade takes place in April, a month after the country's Revolution Day celebrations. North Korea holds parades on key dates like Kim Il-sung's birthday, or the ruling party's foundation day. Taking place in the country's capital of Pyongyang, the display will often feature new weapons, closely watched by leader Kim Jong-un. But not every country that holds a military parade is necessarily authoritarian. The UK holds its annual Trooping of the Colour every summer to celebrate the birthday of the British Monarch."
    },
    {
        "title": "Donald Trump responds after Elon Musk admitted 'regrets' over explosive row",
        "description": "Donald Trump has responded after Elon Musk said some of his recent social media posts about the US president \"went too far\". ",
        "url": "https://news.sky.com/story/donald-trump-responds-after-elon-musk-admitted-regrets-over-explosive-row-13382005",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-musk-trump_6935643.jpg?20250611101342",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-11 07:14:00",
        "Headline": "Mr Musk posted a series of tweets on X last week in a fiery exchange between the pair, including accusing the president of appearing in files relating to Jeffrey Epstein.",
        "Content": "Donald Trump has responded after Elon Musk said some of his recent social media posts about the US president \"went too far\".  The Tesla and SpaceX boss shared a series of posts on his X social media platform last week, including one which described Mr Trump's sweeping tax and spending bill as a \"disgusting abomination\". He also claimed, in a since-deleted post, that the president appeared in files relating to the disgraced paedophile financier Jeffrey Epstein. Posting on X this morning, Mr Musk said: \"I regret some of my posts about President @realDonaldTrump last week. They went too far.\" In response, the president is quoted as telling the New York Post: \"I thought it was very nice that he did that.\" The publication said it spoke to Mr Trump in a brief phone conversation.  The White House dismissed Mr Musk's Epstein claims at the time, with press secretary Karoline Leavitt saying: \"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill [a Republican tax and spending bill] because it does not include the policies he wanted. \"The president is focused on passing this historic piece of legislation and making our country great again.\" Mr Musk did not specify which posts he regretted.  In another post last Thursday, Mr Musk attacked Mr Trump's tariffs, saying they \"will cause a recession in the second half of this year\". In response, Mr Trump, in an interview with ABC News, said Mr Musk had \"lost his mind\". He also threatened to cancel government contracts with the businessman's companies and said he had asked the billionaire to leave the White House.  But yesterday, Mr Musk's father Errol Musk told Sky News' Moscow correspondent Ivor Bennett: \"It's like any argument. Everybody at some point says I'll never make up, but then they do later.\" He said the argument likely happened because of \"emotions welling out of hand\".  \"They've had five months of intense day and night, hardly any sleep, and anybody who went through that would know your nerves are pretty much shredded after that time.\" He also said his son had texted him to say: \"Don't worry, we're sorting it out.\" The spat hit Tesla shares, which closed down 14.3% last Thursday, losing about $150bn (£111bn) in value. They've since regained much of their value compared to the beginning of the month."
    },
    {
        "title": "Los Angeles protests: Riot police enforce curfew as demonstrations spread across US",
        "description": "A curfew has been enforced in Los Angeles as demonstrations against Donald Trump's immigration crackdown spread to other cities across America.",
        "url": "https://news.sky.com/story/los-angeles-protests-mayor-imposes-curfew-to-stop-the-looting-as-police-make-197-arrests-13381947",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-manhattan-protest_6939112.jpg?20250611111526",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-11 00:53:00",
        "Headline": "The protests, in response to immigration enforcement raids, have now taken place in several cities beyond LA, including New York, Chicago, Philadelphia, Atlanta, Washington, Seattle and Las Vegas.",
        "Content": " A curfew has been enforced in Los Angeles as demonstrations against Donald Trump's immigration crackdown spread to other cities across America. Mayor Karen Bass said restrictions were in force in downtown areas of LA from 8pm to 6am local time (4am to 2pm UK time) until further notice as officials attempt to \"stop the vandalism and stop the looting\". She confirmed that a local emergency had been declared as \"we reached a tipping point\", with 23 businesses looted on Monday night. The protests are in response to raids carried out by the US Immigration and Customs Enforcement agency (ICE) and demonstrations have spread to several cities, including New York, Chicago, Philadelphia, Atlanta, Oregon, Seattle and Las Vegas. Police in Los Angeles swiftly enforced a downtown curfew on Tuesday night, deploying officers on horseback and arresting 197 people. Jim McDonnell, the chief of the LA Police Department, described the curfew as a \"necessary measure to protect lives\" as \"unlawful and dangerous behaviour\" had been escalating in the last few days. Residents, people who are homeless, those travelling to and from work, credited media as well as public safety and emergency personnel, were exempted from the curfew. \n                  Is Trump ready to wage war at home?\n                 \n                  Is Ukraine winning the spy war? In conversation with ex-CIA chief\n                 \n                  'This is our city': Furious immigrants vow to 'defend' LA against Trump crackdown\n                 The curfew covered a one-square mile section of downtown LA that included the area where protests have happened since Friday. The city of Los Angeles encompasses about 500 square miles. US President Donald Trump has activated 4,000 National Guard troops - the federal reserve force - to protect ICE officers carrying out raids as well as federal buildings in LA, despite objections by California Governor Gavin Newsom, who called the deployments unnecessary, illegal and politically motivated. Mr Trump also sent 700 marines, who were expected to start operating in the LA area on Wednesday, according to the US Northern Command. Read more from Sky News:Eyewitness: Furious immigrants vow to 'defend' LAWhat we know about the LA immigration raids and protestsExplainer: Who is Gavin Newsom? State officials said Mr Trump's response was an extreme overreaction to mostly peaceful demonstrations, with California senators Adam Schiff and Alex Padilla saying the domestic mobilisation of active-duty military personnel should only happen \"during the most extreme circumstances, and these are not them\". Mr Trump defended his decision in a speech to soldiers at the army base in Fort Bragg, North Carolina, saying his administration would \"liberate Los Angeles\". \"Generations of army heroes did not shed their blood on distant shores only to watch our country be destroyed by invasion and third-world lawlessness,\" Mr Trump said. \"What you're witnessing in California is a full-blown assault on peace, on public order and on national sovereignty, carried out by rioters bearing foreign flags.\" 👉 Follow Trump100 on your podcast app 👈 Gavin Newsom launched a blistering response in an address on Tuesday evening, saying the deployment of the National Guard without consulting Californian officials was a \"brazen abuse of power by a sitting president\". He said it \"enflamed a combustible situation, putting our people, our officers and even our National Guard at risk\". \"That's when the downward spiral began. He doubled down on his dangerous National Guard deployment by fanning the flames even harder - and the president, he did it on purpose,\" Mr Newsom said. US correspondent California Governor Gavin Newsom's televised address to the nation felt presidential as he took the fight to the man in the Oval Office, with a series of scorching putdowns. He made a compelling case that Donald Trump's extraordinary decision to send troops to LA against his wishes had put the country on the brink of authoritarianism. He spoke the day after the Pentagon announced 700 marines were being deployed to join 4,000 National Guard troops ordered to the streets of LA by Trump.  But there has been no evidence so far that local law enforcement is being overwhelmed by the size or might of this resistance movement. The head-to-head between Trump and Newsom is a compelling one. The governor is known to harbour presidential ambitions for 2028 and is something of a MAGA bogeyman.  Newsom presides over a blue state, the biggest in the country, and is growing his brand with a podcast and - now - Trump has effectively put him in the national spotlight by bringing this political battle to his door. The governor accused Mr Trump of choosing escalation and \"theatrics over public safety\", as the situation was \"winding down\" before the president deployed the troops. Mr Newsom added: \"When Donald Trump sought blanket authority to commandeer the National Guard, he made that order apply to every state in this nation. \"This is about all of us, this is about you. California may be first, but it clearly won't end here; other states are next. Democracy is next. Democracy is under assault before our eyes.\" Homeland Security said on Monday that ICE had arrested 2,000 immigration offenders per day recently, which significantly exceeds the 311 daily average in the fiscal year 2024 under former president Joe Biden."
    },
    {
        "title": "The Beach Boys co-founder Brian Wilson dies",
        "description": "Brian Wilson - the co-founder of The Beach Boys - has died at the age of 82.",
        "url": "https://news.sky.com/story/beach-boys-co-founder-brian-wilson-dies-13382290",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brian-wilson-glastonbury_6939580.jpg?20250611180431",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-11 16:50:00",
        "Headline": "Brian Wilson was the California band's visionary leader and songwriter, penning hits including Surfin' USA, Good Vibrations and God Only Knows.",
        "Content": " Brian Wilson - the co-founder of The Beach Boys - has died at the age of 82. In a statement, published on his website, his family said: \"We are heartbroken to announce that our beloved father Brian Wilson has passed away. \"We are at a loss for words right now. Please respect our privacy at this time, as our family is grieving. We realise that we are sharing our grief with the world.\" Wilson is believed to have suffered ill health in recent years, with court documents filed in 2024 saying he had \"major neurocognitive disorder (such as dementia)\". He co-founded The Beach Boys in the early 1960s with his brothers, Dennis and Carl, their cousin Mike Love and friend Al Jardine. Wilson - the eldest and last surviving of the three brothers - was their visionary leader and songwriter, penning hits including Surfin' USA, Good Vibrations, and God Only Knows. 'What a legacy he leaves' Famous faces have paid tribute to Wilson, with Rolling Stone's Ronnie Wood saying his \"world is in mourning\" following the deaths of The Beach Boys co-founder and fellow musician Sly Stone. \"So sad,\" he added. \"A complex man but a musical genius and showbusiness icon,\" Piers Morgan wrote. \"What a legacy he leaves.\" Radio 2 DJ Tony Robinson said on the X social media platform: \"So sorry to hear that Brian Wilson of the Beach Boys has passed away. So many hits, and to me it was the sound of summer. RIP Brian and thanks for the music.\" Electronic music duo Disclosure said Wilson was their \"favourite producer and composer of all time\". \"Pushed the boundaries further than anyone had before,\" they wrote in a comment on Instagram. \"Lost for words. We love you, Brian. Rest in peace to the greatest.\" Arts and entertainment editor To say Brian Wilson loomed large in my life would be an understatement. My musician father was a major fan of The Beach Boys, naming one of my brothers after one of them and playing us their tracks so often that I can't separate their back catalogue from nostalgic memories of childhood. When challenged by others for choosing America's Beach Boys over our home-grown The Beatles, Dad would wax lyrical about their harmonies and the creative genius of Wilson. But it wasn't just me who felt the influence of the not-really surfer boys (it was only Brian's brother Dennis who actually surfed, despite the songs about the sea and the photos of them posing with boards).  The album Pet Sounds is widely credited with being one of the most influential records ever, using those famous harmonies and production techniques that were so innovative at the time, which then became widely drawn on, even the norm.  They were one of the first American rock bands to play their own instruments and write their own songs. And it was Brian – not the record execs – who had creative control, paving the way for the musicians who came after him to do the same.  So while I know the impact that Brian Wilson and The Beach Boys had on my life, I also know that because of their influence, the inspiration they were and the legacy they left, that without you even knowing it, they will have impacted your life too. The Beach Boys have inspired acts on both sides of the Atlantic, with the likes of Sir Elton John, Bruce Springsteen, and Carole King lauding their work. Their 1966 album Pet Sounds, penned and produced by Wilson, was voted No.2 in a 2003 Rolling Stone list of the best 500 albums - losing only to The Beatles' Sgt. Pepper's Lonely Hearts Club. Paul McCartney has cited Pet Sounds as a direct inspiration for the Beatles, naming the ballad God Only Knows as one of his favourite songs and saying it often brings him to tears. The band's innocent appeal survived despite the group's increasingly troubled backstory. Brian, suffering from stress and exhaustion, had a breakdown in 1964 and retired from touring, choosing to instead focus on writing and recording, though he later returned to the stage. Dennis, who struggled with substance abuse and alcoholism, drowned in 1983. Carl died of lung cancer in 1998."
    },
    {
        "title": "Boos and cheers for Trump as he visits Kennedy Center for Les Mis",
        "description": "Les Miserables, what else.",
        "url": "https://news.sky.com/story/donald-trump-to-visit-kennedy-center-for-les-mis-as-cast-members-plan-to-boycott-13382344",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trump-melania_6939718.jpg?20250612022004",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-06-11 19:26:00",
        "Headline": "The president made his first visit to the prestigious arts venue since overhauling its board and attacking \"woke\" bookings.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Les Miserables, what else. The hit musical about anti-government protest is now showing at the Kennedy Center in Washington DC. Donald Trump was in the audience for Wednesday's performance for what amounts to a busman's holiday. The narrative explores issues of social justice, love, and the enduring power of human compassion amidst a backdrop of poverty and revolution. Not everyone shares the president's vision of those themes. Indeed his presence drew what can only be described as mixed reviews from his fellow theatre goers - cheers and boos in equal measure as he waved from the front row of the circle. The script of Les Miserables barely presents a break from the day job - Trump won't be the only one getting a sense of art imitating life, as the real thing plays out on the streets of LA. It is the first show the president has chosen to attend since he made sweeping changes at the iconic venue, prompting an outcry and accusations that he was politicising art and 'MAGAfying' the venerated institution. \n                  Why Trump's military 'birthday' parade is so controversial\n                 \n                  Ex-CIA director John Brennan calls Donald Trump's plan in Ukraine 'naive' and 'unsophisticated'\n                 \n                  Donald Trump responds after Elon Musk admitted 'regrets' over explosive row\n                 According to CNN, a number of Les Miserables cast members had planned to sit out the performance in protest. The Kennedy Center is a prestigious venue that showcases the best of American performance art. More than 2,000 shows per year include the famous honours ceremony, an annual event that celebrates artists who have made a significant contribution to US culture. Honourees through the years have included Joni Mitchell, Aretha Franklin, the Grateful Dead and Francis Ford Coppola. Following his election in November, Trump made himself chairman of the Kennedy Center's board and replaced members with political loyalists. Traditionally, the board has been made up of individuals from across the political spectrum; after his election, Trump got rid of 18 members and replaced them with political soulmates, including his chief of staff Susie Wiles and Fox presenters Laura Ingraham and Maria Bartiromo. Read more:Trump responds to Musk's apologyRiot police enforce LA curfew Donald Trump signalled a change in artistic direction at the Kennedy Center when he wrote on social media of \"Drag shows specifically targeting our youth\", and said of its production schedule: \"We didn't like what they were showing, we're going to make sure it's good and it's not going to be woke.\" His changes prompted a number of acts to cancel shows at the venue in protest. The touring production of Broadway hit Hamilton cancelled dates, as did actor and producer Issa Rae, writer Louise Penny and Pulitzer Prize-winning folk musician Rhiannon Giddens. 👉 Follow Trump100 on your podcast app 👈 Trump's attendance at the Les Mis performance was designed to boost fundraising, with donors paying up to $2m to attend a reception with the president. Ticket sales and subscriptions have, reportedly, slumped since Trump's changes although the centre's management points out its campaign to renew subscriptions has been launched later this year than last. Trump watched the performance of Les Miserables from the presidential box, in the company of his wife, Melania. Vice president JD Vance was also there. When he attended a performance by the National Symphony Orchestra in March with his wife, he was booed by members of the audience."
    },
    {
        "title": "US-China trade talks: The fact neither side is saying much on the outcome says a lot",
        "description": "In the absence of detail, all we can do is read between the lines of what may or may not have been agreed in the London talks between the US and China.",
        "url": "https://news.sky.com/story/us-china-trade-talks-the-fact-neither-side-is-saying-much-on-the-outcome-says-a-lot-13382040",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-he-lifeng-scott-bessent_6939202.jpg?20250611121759",
        "type": "US",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-06-11 08:49:00",
        "Headline": "By most assessments, China has the upper hand in a dangerous supply chain war with the potential to wreak deep economic harm.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n In the absence of detail, all we can do is read between the lines of what may or may not have been agreed in the London talks between the US and China. And a degree of scepticism feels appropriate. The fact neither side is saying much says a lot in itself. A major new breakthrough seems unlikely. You only need to compare it to the conduct of the delegations following the first round of talks in Geneva to feel the difference in tone. Those talks did indeed yield significant breakthroughs including temporary reductions to most of the tariffs and an agreement to keep talking. There, the Americans in particular were quick to get in front of the cameras to describe the \"substantial progress\" with Trump himself extolling \"a total reset\" in the relationship. Not so this time. Instead we have relatively dry statements from both sides about a \"framework to implement the consensus\" reached at both Geneva and during a phone call between Trump and Xi last week. Any further description was tepid at best, with China's official news agency describing the discussions as \"candid\" a word often used when there has been substantial disagreement. Read more: Why Trump blinked in US-China trade war  High stakes It's hard to overstate how high the stakes have become. What started as a trade war has morphed into a dangerous supply chain war with the potential to wreak deep economic harm. And by most assessments, it is China that has the upper hand. Indeed, while the US has introduced a spate of new measures designed to block China's access to high-tech chips, China has moved to slow and complicate the exports of crucial rare earth minerals to the US. These metals are absolutely vital in the manufacture of everything from cars to weaponry, and China has the vast majority of the world's supply. The new controls have brought some production lines to the brink of standstill, and the West is alarmed. On the ground here in China you get a sense that while this standoff will cause pain, there is confidence too, particularly in its ability to home grow the type of technology the US is attempting to block. Indeed, as these talks were ongoing, a branch of the Chinese government was showing foreign journalists around usually hard-to-access high-tech businesses.  A confident China A controlled and choreographed affair, yes, but an insight too into where government attention and priorities lie and where they are feeling confident. \"We've caught up with America in terms of technology and quality,\" said Zhou Zhiliang, CEO of GeneMind, a high-tech DNA sequencing and diagnostics company. \"We just need to catch up in terms of the market, building trust in Chinese products and the scale of utilisation.\" Others, when we asked about restrictions imposed by the US, seemed relatively unfazed. \"The trade friction between China and US will have an impact on many industries,\" said Zhang Jinhua, founder of IASO Biotechnology, a company specialising in high-tech cell therapies. \"But this is what running a business is like, you always have to face challenges and situations you never expected before, you have to face them.\" And while some moments of candour reveal the frustrations faced by Chinese businesses, the attitude seems to be that none are insurmountable. \"We were selling our products via Amazon, although we now face some problems,\" said Yu Kai, co-founder of conversational AI product AISpeech. \"But I believe it can be solved. The current technology dispute doesn't affect us very much, because we rely on ourselves.\" Indeed, that is the key problem for the US. China can increasingly rely on itself and is making rapid progress in the development of its own chips and AI technology. Read more:Why Trump blinked in US-China trade warDiplomatic win for UK hosting US-China trade talks In contrast, the US is totally beholden to China on rare earths; the development of its own supply would be lengthy and extortionately expensive. With this upper hand, China will have been driving an exceedingly hard bargain in London. In an atmosphere of extreme distrust, where neither side will want to be seen to concede, reaching a sustainable truce will be very hard indeed."
    },
    {
        "title": "Khaby Lame: World's biggest TikTok star leaves US after being detained by ICE",
        "description": "Khaby Lame, the world's most popular TikTok personality, has left the US after being detained by federal agents.",
        "url": "https://news.sky.com/story/khaby-lame-worlds-biggest-tiktok-star-leaves-us-after-being-detained-by-ice-13381989",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-khaby-lame-tiktok-star_6938985.jpg?20250611090924",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-11 06:27:00",
        "Headline": "An ICE spokesperson said Khaby Lame was detained at Harry Reid International Airport in Las Vegas after he \"overstayed the terms of his visa\".",
        "Content": "Khaby Lame, the world's most popular TikTok personality, has left the US after being detained by federal agents. An Immigration and Customs Enforcement (ICE) spokesperson said the Senegalese-Italian influencer - who has 162.2m followers on TikTok - was detained on Friday at Harry Reid International Airport in Las Vegas after he \"overstayed the terms of his visa\". The 25-year-old had arrived in the US on 30 April, the ICE spokesperson added, and was allowed to leave the country without a deportation order by a voluntary departure. Those with a deportation order on their records can be prevented from being allowed back into the US for up to a decade. While in the US, Lame - whose legal name is Seringe Khabane Lame - attended the Met Gala and the Metropolitan Museum of Art's Costume Institute benefit gala in New York City. He became famous online during the COVID-19 pandemic, where he would react to complicated life hack videos without saying a word. With millions of followers, he signed a multi-year partnership with designer brand Hugo Boss in 2022, and was appointed as a UNICEF goodwill ambassador in January this year. Read more:Twix advert banned for encouraging dangerous drivingWhat we know about the LA immigration raids and protests He has not publicly commented on his detention, and has continued posting on TikTok since. Sky News has approached his representatives for comment."
    },
    {
        "title": "Spending review's key points at a glance",
        "description": "Rachel Reeves has set out her spending review in the House of Commons.&#160;&#160;",
        "url": "https://news.sky.com/story/spending-review-2025-the-key-announcements-13382050",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-key-points_6935116.jpg?20250605144707",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter",
        "Date Published": "2025-06-11 11:30:00",
        "Headline": "From the Ministry of Defence, the Department for Transport and the Home Office, here are the main announcements from Chancellor Rachel Reeves.",
        "Content": "By Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter   Rachel Reeves has set out her spending review in the House of Commons.   It outlines how much day-to-day funding government departments will get over the next three years, until 2029, which is used on things like wages. It also covers a department's investment (also known as capital) budget over the next four years, until the end of 2030. This money is used to pay for things like new infrastructure projects. Politics latest: Follow live updates and reaction The last spending review was held during the COVID-19 pandemic, and before that, in 2015. Here's what's been announced: Sky News has crunched the numbers to see which government departments have benefited after the spending review, and which have seemingly lost out.  The chart below sets out which departments are getting the biggest increase in their day-to-day budgets. The second chart maps the biggest increases in capital spending. A major recipient of funds is the Ministry of Defence. Defence spending will rise from 2.3% of gross domestic product (GDP) to 2.6% by 2027. This equates to an £11bn uplift and a £600m uplift for security and intelligence agencies. Within that there'll be £4.5bn of investment in munitions made across the country and more than £6bn to upgrade to nuclear submarine production. The department is one of the biggest winners of the spending review. In total, an extra 3.8% will be spent from this year to the end of 2029, when the spending period ends. Much of that increase will be capital spending - a rise of 7.3%, whereas day-to-day spending will only go up 0.7% in the same period. Ms Reeves said it was because of cuts to foreign aid that such defence rises are possible. The Foreign, Commonwealth and Development Office was among the biggest losers, with spending set to fall 8.3% in total over the next three years. Its capital spending will drop 6.8%, with day-to-day spending down 6.9%. The chancellor announced an extra £29bn a year will be spent on the NHS, an annual rise of 3% on current levels. She says she is increasing the NHS technology budget by almost 50%, and £10bn to bring the \"analogue health system into the digital age\". The department in control of the NHS, the Department of Health and Social Care, is also a \"real big winner\", Sky News' data and economics editor Ed Conway says. Day-to-day spending will rise 2.8%, while there will be no increase in capital expenditure. The chancellor says border security funding will increase, with up to £280m more per year by the end of the spending review for the new Border Security Command. She said the Home Secretary Yvette Cooper will end hotels being used to house asylum seekers by 2029. The chancellor says funding she has announced today, including from the transformation fund, will also cut the asylum backlog, see more appeal cases heard and \"return people who have no right to be here\". This will save the taxpayer £1bn a year, she claimed. As a result of these savings, the Home Office will have 1.4% less to spend by 2029, compared to this year. Broken down on a day-to-day basis, it's a 1.7% drop but a 0.7% rise in capital expenses. The chancellor confirmed that free school meals will be extended to over half a million more children and said that the policy will lift 100,000 children out of poverty.  Nearly £2.3bn a year will go to fix crumbling classrooms. A further £2.4bn will be spent on rebuilding 500 schools. Another record investment amount was announced by Ms Reeves for training and upskilling - £1.2bn a year by the end of the spending review will go to support more than a million young people into training and apprenticeships. School-based nurseries have been given £370m. The core schools budget is rising by £3.5bn a year. Government funding of social and affordable housing has been allocated £39bn, over the next 10 years - which Ms Reeves called the \"biggest cash injection into social housing in 50 years\". She says she is providing an additional £10bn for financial investments, to be delivered through Homes England, to help unlock hundreds of thousands more homes. A commitment to nuclear power was reiterated, with £30bn allocated. Of this, £14.2bn is being poured into the Sizewell C nuclear power station - which was announced earlier this week - on the Suffolk coastline. Another £2.5bn will be invested in a new small modular reactor programme. The chancellor says she wants the country's high-tech industries in Britain to continue to lead the world in the years to come. Research and development funding will go to a record high of £22bn a year by the end of the spending period. The chancellor has backed \"home-grown AI\" with a £2bn investment. She says the technology has the potential to \"solve diverse and daunting challenges\" and create \"good jobs\". The chancellor announced £15bn for new rail, tram and bus networks across the West Midlands and the North. She's also given the green light to a new rail line between Liverpool and Manchester. She says investments in buses, train stations, metro lines and transit will be made in places including Rochdale, Merseyside, Birmingham and West Yorkshire. In London, Ms Reeves says there will be a \"four-year settlement\" for the Transport for London and a \"fourfold increase\" in local transport grants by the end of this parliament. As expected, the £3 bus cap has been extended to March 2027. It had been £2 up to the end of 2024. To fund 14,000 new prison places, £7bn will be invested, with £700m a year going to reform the probation system. In order to reach the goal of 13,000 more police officers in England and Wales, £2bn will be allocated. On the nations of the UK, the chancellor announced: • Scotland has been allocated £52bn• Northern Ireland has been allocated £20bn• Wales has been allocated £23bn."
    },
    {
        "title": "Spending review: Rachel Reeves is running out of levers to pull if something goes wrong",
        "description": "It was billed as a massive moment in British economic policymaking - a juncture where the Labour government would turn its economic philosophy into a fiscal reality, running its finger down every line of public spending and overhauling the machinery of government for years to come.",
        "url": "https://news.sky.com/story/spending-review-reeves-is-running-out-of-levers-to-pull-if-something-goes-wrong-13382313",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-downing-street_6939665.jpg?20250611205004",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-06-11 17:27:00",
        "Headline": "Sky's Ed Conway says the chancellor's wiggle room going into the spending review was already so small that the autumn budget could yet force her to make tougher decisions.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  It was billed as a massive moment in British economic policymaking - a juncture where the Labour government would turn its economic philosophy into a fiscal reality, running its finger down every line of public spending and overhauling the machinery of government for years to come. So, did the spending review live up to its hype? The answer, of course, is no. But then again, if you're expecting dramatic changes and seismic shifts from spending reviews, you should probably go and lie down in a dark room for a period. After all, the big picture for this review has been set in stone for some time. We've known for months about the scale of overall government spending in the coming years (in short: slight increases in day-to-day spending; bigger increases in investment). Money latest: Will taxes have to rise in autumn budget? The only remaining question was how that money was going to be apportioned. And the answer to that question threw up few surprises. As was the case in every previous review in recent memory, the biggest winner was health, which continued to grow - not just in absolute terms but also as a share of public spending. The big winner when it came to the investment spending doled out by the chancellor Rachel Reeves was, as expected, defence - primarily to fund that 2.5% (or thereabouts) of gross domestic product (GDP) pledge made by the prime minister earlier this year. There was more money for transport, although questions remain over whether more money will be needed for HS2 when it comes back for an accounting \"reset\" (translation: this is going to cost loads more than we told you) next year. But in short: no enormous surprises. Then again, this was never going to be one of those spending reviews that dramatically changed the nature of the state, like the ones carried out by Gordon Brown as chancellor at the turn of the millennium. Those Brownite reviews tended to increase day-to-day spending by around 5% a year. This one only increased day-to-day spending by less than 2%. Read more:Key spending review announcementsYour spending review questions answered But that tells you a lot about the constraints under which the chancellor is working. In short, today, the national debt is considerably larger than in 2000. So too is the tax burden. So are debt interest costs, not to mention the health costs of an ageing population. Set that all alongside the chancellor's fiscal rules (which commit her not to borrow too much more, save for investment) and you see the problem. She doesn't have much room left to spend. A sudden deterioration in the economy (due to, say, a trade war) and all of a sudden, she's missing her rules. Which is why this spending review does nothing to answer the question that continues to hang over her: will she have to raise taxes again to make her sums add up? Indeed, now that she's committed herself to spending certain amounts in the coming years, she's running out of levers to pull if something goes wrong."
    },
    {
        "title": "US-China trade talks: The fact neither side is saying much on the outcome says a lot",
        "description": "In the absence of detail, all we can do is read between the lines of what may or may not have been agreed in the London talks between the US and China.",
        "url": "https://news.sky.com/story/us-china-trade-talks-the-fact-neither-side-is-saying-much-on-the-outcome-says-a-lot-13382040",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-he-lifeng-scott-bessent_6939202.jpg?20250611121759",
        "type": "Business",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-06-11 08:49:00",
        "Headline": "By most assessments, China has the upper hand in a dangerous supply chain war with the potential to wreak deep economic harm.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n In the absence of detail, all we can do is read between the lines of what may or may not have been agreed in the London talks between the US and China. And a degree of scepticism feels appropriate. The fact neither side is saying much says a lot in itself. A major new breakthrough seems unlikely. You only need to compare it to the conduct of the delegations following the first round of talks in Geneva to feel the difference in tone. Those talks did indeed yield significant breakthroughs including temporary reductions to most of the tariffs and an agreement to keep talking. There, the Americans in particular were quick to get in front of the cameras to describe the \"substantial progress\" with Trump himself extolling \"a total reset\" in the relationship. Not so this time. Instead we have relatively dry statements from both sides about a \"framework to implement the consensus\" reached at both Geneva and during a phone call between Trump and Xi last week. Any further description was tepid at best, with China's official news agency describing the discussions as \"candid\" a word often used when there has been substantial disagreement. Read more: Why Trump blinked in US-China trade war  High stakes It's hard to overstate how high the stakes have become. What started as a trade war has morphed into a dangerous supply chain war with the potential to wreak deep economic harm. And by most assessments, it is China that has the upper hand. Indeed, while the US has introduced a spate of new measures designed to block China's access to high-tech chips, China has moved to slow and complicate the exports of crucial rare earth minerals to the US. These metals are absolutely vital in the manufacture of everything from cars to weaponry, and China has the vast majority of the world's supply. The new controls have brought some production lines to the brink of standstill, and the West is alarmed. On the ground here in China you get a sense that while this standoff will cause pain, there is confidence too, particularly in its ability to home grow the type of technology the US is attempting to block. Indeed, as these talks were ongoing, a branch of the Chinese government was showing foreign journalists around usually hard-to-access high-tech businesses.  A confident China A controlled and choreographed affair, yes, but an insight too into where government attention and priorities lie and where they are feeling confident. \"We've caught up with America in terms of technology and quality,\" said Zhou Zhiliang, CEO of GeneMind, a high-tech DNA sequencing and diagnostics company. \"We just need to catch up in terms of the market, building trust in Chinese products and the scale of utilisation.\" Others, when we asked about restrictions imposed by the US, seemed relatively unfazed. \"The trade friction between China and US will have an impact on many industries,\" said Zhang Jinhua, founder of IASO Biotechnology, a company specialising in high-tech cell therapies. \"But this is what running a business is like, you always have to face challenges and situations you never expected before, you have to face them.\" And while some moments of candour reveal the frustrations faced by Chinese businesses, the attitude seems to be that none are insurmountable. \"We were selling our products via Amazon, although we now face some problems,\" said Yu Kai, co-founder of conversational AI product AISpeech. \"But I believe it can be solved. The current technology dispute doesn't affect us very much, because we rely on ourselves.\" Indeed, that is the key problem for the US. China can increasingly rely on itself and is making rapid progress in the development of its own chips and AI technology. Read more:Why Trump blinked in US-China trade warDiplomatic win for UK hosting US-China trade talks In contrast, the US is totally beholden to China on rare earths; the development of its own supply would be lengthy and extortionately expensive. With this upper hand, China will have been driving an exceedingly hard bargain in London. In an atmosphere of extreme distrust, where neither side will want to be seen to concede, reaching a sustainable truce will be very hard indeed."
    },
    {
        "title": "Work and pensions secretary tells MPs controversial disability benefit reforms will go ahead next year",
        "description": "The government has told MPs it will not back down from its controversial reforms to disability benefits, which are set to be introduced to parliament later this month.",
        "url": "https://news.sky.com/story/work-and-pensions-secretary-tells-mps-controversial-disability-benefit-reforms-will-go-ahead-next-year-13382300",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-work-and-pensions-liz-kendall_6808860.jpg?20250123234416",
        "type": "Business",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-11 16:59:00",
        "Headline": "Liz Kendall rejects calls to delay the changes until a full assessment is carried out of the impact on employment, poverty and health.",
        "Content": "\n          Political correspondent\n              @tamcohen\n The government has told MPs it will not back down from its controversial reforms to disability benefits, which are set to be introduced to parliament later this month. More than 100 Labour MPs are thought to have concerns about the plans to cut nearly £5bn from the welfare bill by restricting personal independence payments (PIP) and the health top-up to Universal Credit. Charities say the changes will have a \"catastrophic\" effect on vulnerable people. Politics Hub: Follow the latest updates  The chair of the Commons' Work and Pensions Committee wrote to the secretary of state, Liz Kendall, last month, calling on the government to delay the changes until a full assessment is carried out of the impact on employment, poverty and health. Labour MP Debbie Abrahams wrote that while there was a case for reform to disability benefits, \"the evidence indicated [these changes] might not improve outcomes for most claimants, but instead push many into poverty and further away from the labour market\". 'Reforms are needed now' \n                  How risky is Rachel Reeves's winter fuel U-turn?\n                 \n                  Disabled woman took her own life after benefits wrongly stopped, coroner finds\n                 \n                  Starmer says government 'will look at' scrapping two-child benefits limit\n                 But Ms Kendall has written back, in a letter made public on Wednesday, to reject the idea because the bill needs final approval from parliament in November in order for the changes to take effect in 2026. She wrote: \"We need urgent action to help people who can work, into work. With one in eight young people now not in education, employment or training and nearly 2.8 million people out of work due to long-term sickness, and spending on health and disability benefits set to rise by an additional £18bn, we must change course. \"We have consistently been clear that we are not consulting on every proposal. \"Instead, parliament will have the opportunity to fully debate, propose amendments to, and vote on areas where we have announced urgent reforms that are not subject to consultation. \"With PIP caseload and costs forecast to continue rising, reforms are needed now to make the system sustainable, while supporting those people with the greatest needs.\"  What is the government's plan? The government says the PIP caseload has more than doubled from 15,000 new claims per month in 2019 to 34,000. PIP is a benefit to help disabled people with the increased costs of day-to-day living. It is proposed that claimants will need to achieve four points out of eight in their assessment to qualify for the benefit, and the government says some 370,000 existing claimants will lose out when reassessed. Ms Kendall says the growth in claims means the PIP caseload will still increase by the end of the parliament. The government will also tackle what Ms Kendall called the \"perverse incentive\" to claim the health top-up for Universal Credit by freezing it at £97 a week for existing claimants, and slashing the rate to £50 a week for new claimants. The average loss of benefits will be £1,700 a year for some three million people. Claimants with the most serious conditions, who have been assessed as never able to work, will not be subject to reassessment, ministers say, allowing them to have peace of mind. The government will provide £1bn for targeted support schemes to help disabled people into work. But it's estimated these will help only some 70,000 people find employment.  Ms Kendall said a minister in her department is engaging with disabled people and organisations about the PIP assessment process, but said: \"The PIP assessment review will rightly take time and require extensive engagement, and we cannot wait for its conclusion to make the urgently needed changes to the PIP eligibility criteria.\" 'Deeply disappointing news' The first minister of Wales, Eluned Morgan, who is gearing up for elections next year, told Sky News she had spoken to Ms Kendall about her concerns last week. She said: \"This is going to be really challenging for a lot of people in Wales. We know more people in Wales will be affected by PIP than in any other part of the country. \"We do think there needs to be reform of welfare because we believe people can work should work, but in Wales we have examples of where we hold people's hands, stand by them, we help them into work, and we think that's more of a productive approach.\" Read more:Spending review's key points at a glanceUK agrees post-Brexit deal on GibraltarAre tax rises inevitable after the spending review? Labour MP Richard Burgon, who has vowed to vote against the reforms, said: \"This will be deeply disappointing news for all the MPs who've been urging the government to delay this decision. Instead of allowing time for proper scrutiny and meaningful dialogue with disabled people, the government has brushed aside MPs' genuine concerns. \"These planned disability cuts should be scrapped - not rushed through without proper scrutiny.\""
    },
    {
        "title": "UK agrees post-Brexit deal on Gibraltar in boost to reset talks with EU",
        "description": "The UK government has agreed a post-Brexit deal with the EU on Gibraltar, unpicking another issue in its negotiations with Brussels.",
        "url": "https://news.sky.com/story/uk-agrees-post-brexit-deal-on-gibraltar-13382213",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gibraltar-spain-eu_6939467.jpg?20250611160728",
        "type": "Business",
        "Author": "Tim Baker",
        "Date Published": "2025-06-11 14:44:00",
        "Headline": "Checks like those at St Pancras for the Eurostar will take place at Gibraltar Airport, carried out by Spanish and Gibraltarian officials.",
        "Content": "\n          Political reporter\n              @TimJ_B\n The UK government has agreed a post-Brexit deal with the EU on Gibraltar, unpicking another issue in its negotiations with Brussels. Foreign Secretary David Lammy flew to the British overseas territory late last night for talks with ministers there, before heading on to Brussels for finalising talks with the EU and Spain. The government says the new agreement resolves the \"last major unresolved issue from Brexit\", and \"avoids the need\" for checks on people and goods crossing the Gibraltar-Spain border, to support \"prosperity in the region\". Politics latest: Chancellor sets out spending Around 15,000 people - more than half of Gibraltar's workforce - cross the border daily. The UK is hoping it will help speed up other post-Brexit discussions as it looks to reset its relationship with the EU. As part of the deal, the government says there will be dual border control checks for arrivals by air at Gibraltar airport, carried out by Gibraltar and Spanish officials, as well as arrivals by sea at the port. Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model the government says is similar to French police operating in London's St Pancras station.   A bespoke agreement was needed for the territory, as Spain claims Gibraltar belongs to them after the UK took control of the territory in the early 18th century. Both Tory and Labour governments have been firm in their stance that they will not give up sovereignty of the territory to Spain. The deal explicitly states the treaty will not impact sovereignty, and also ensures the UK has full operational autonomy for the military facilities there. St Pancras style checks The government said: \"Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. \"Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model similar to French police operating in London's St Pancras station.\" As Sky News deputy political editor Sam Coates points out, some Eurosceptics will be unhappy with the presence of European border guards in British territory. Read more:EU wants to limit UK access to arms fundTop Tory admits Brexit drawback Foreign Secretary David Lammy said: \"This government inherited a situation from the last government which put Gibraltar's economy and way of life under threat. Today's breakthrough delivers a practical solution after years of uncertainty. \"Alongside the government of Gibraltar, we have a reached an agreement which protects British sovereignty, supports Gibraltar's economy and allows businesses to plan for the long-term once again. \"I thank the chief minister and his government for their tireless dedication throughout the negotiations. The UK's commitment to Gibraltar remains as solid as the Rock itself.\" Fabian Picardo, Gibraltar's chief minister, said he was \"delighted\" with the deal, and he was looking \"towards a time of renewed cooperation and understanding\". A statement from the EU side said: \"The parties are confident that this Agreement will support prosperity and bring confidence, legal certainty, and stability to the lives and well-being of the people of the whole region.\""
    },
    {
        "title": "Pod Point fails to spark as EDF seals cut-price takeover",
        "description": "Pod Point's three-and-a-half year journey as a public company will near an ignominious end on Thursday when it recommends a cut-price takeover by EDF, the French state-backed utility.",
        "url": "https://news.sky.com/story/pod-point-fails-to-spark-as-edf-seals-cut-price-takeover-13382131",
        "image_url": "https://e3.365dm.com/21/10/1920x1080/skynews-pod-point-electric_5536734.jpg?20211006085941",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-11 11:50:00",
        "Headline": "A leading investor in Pod Point tells Sky News that a decision to recommend a bid from France's EDF at a fraction of its £350m IPO valuation is \"inevitable but disappointing\".",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Pod Point's three-and-a-half year journey as a public company will near an ignominious end on Thursday when it recommends a cut-price takeover by EDF, the French state-backed utility. Sky News has learnt that Pod Point - which now trades just as Pod - is expected to issue a statement saying that its board has fallen in behind the 6.5p-a-share offer from EDF, which will value the company at only about £10m. The recommendation will end a calamitous run for Pod Point's stock, which has suffered amid shifts in electric vehicle take-up. Money latest: Will taxes need to rise in autumn budget? It operates thousands of EV charging points across the country, including many located in Tesco store car parks. The company floated its shares at 225p in November 2021, valuing it at about £350m, meaning that investors who have remained on its share register since then are nursing huge losses. Erik Fairbairn, Pod Point's founder and then-chief executive, invested millions of pounds of his own money in its initial public offering. One leading Pod Point investor called the decision to recommend the offer \"inevitable but disappointing\" given that EDF already owns a 53% stake in the business. EDF acquired a majority stake in Pod Point in 2020, through a joint venture with Legal & General Capital. Politics live: Spending review announcements and reaction L&G's asset management arm, along with other major City institutions such as Schroders, remain significant shareholders in the company. A Pod Point Group Holdings spokesman declined to comment on Wednesday evening."
    },
    {
        "title": "Reynolds discusses British Steel row with Chinese counterpart",
        "description": "Jonathan Reynolds, the business secretary, has discussed the government's move to seize control of British Steel with his Chinese counterpart for the first time.",
        "url": "https://news.sky.com/story/reynolds-discusses-british-steel-row-with-chinese-counterpart-13382119",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6886246.jpg?20250415182824",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-11 11:29:00",
        "Headline": "The fate of the Scunthorpe-based steelmaker, which was taken into government control in April, has been raised during talks between British and Chinese ministers, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Jonathan Reynolds, the business secretary, has discussed the government's move to seize control of British Steel with his Chinese counterpart for the first time. Sky News understands that the fate of the Scunthorpe-based steelmaker was raised during talks this week between Mr Reynolds and Wang Wentai, China's commerce minister, on Monday. A subsequent post on social media by Mr Reynolds confirming the meeting said the pair \"discussed deeper UK-China cooperation - especially in services, investment and WTO reform - and building on January's successful Economic and Financial Dialogue to drive mutual growth\". Money latest: Are premium bonds worth it? The business secretary did not refer to British Steel in the post, although officials confirmed that the company was raised briefly during their meeting. It came days after Sky News revealed that British Steel's Chinese owner had hired the leading City law firm Linklaters to explore the recovery of hundreds of millions of pounds it invested in the Scunthorpe-based company before the government seized control of its operations in April. Linklaters advised Jingye Group on its purchase of British Steel in 2021. \n                  Has Trump betrayed Starmer steel deal?\n                 \n                  British Steel to end consultation on up to 2,700 redundancies after government intervention\n                 \n                  Was Reynolds nobbled by Number 10 over China?\n                 British Steel's balance sheet bears debts worth close to £1bn, most of which is said to be owed to Jingye in the form of inter-company loans. The government and Jingye had been at loggerheads for weeks over the future of the Scunthorpe plant's blast furnaces. Since Mr Reynolds, the business secretary, moved to commandeer control of the UK's second-biggest steel producer, the government has sourced additional supplies of raw materials to ensure the furnaces' continued operations. Jingye had been preparing to close them - with the loss of thousands of jobs - after seeking £1bn in state aid to facilitate the site's transition to greener steelmaking. Politics latest: Spending review announcements and reaction Mr Reynolds has indicated that Jingye's shares in British Steel - which has not yet been formally nationalised - are worthless, and that the government does not intend to offer to pay to acquire them. A spokesman for the Department for Business and Trade said: \"We are working closely with Jingye and a range of third parties on options for the future, and we will continue work on determining the best long-term sustainable future for the site.\""
    },
    {
        "title": "Donald Trump responds after Elon Musk admitted 'regrets' over explosive row",
        "description": "Donald Trump has responded after Elon Musk said some of his recent social media posts about the US president \"went too far\". ",
        "url": "https://news.sky.com/story/donald-trump-responds-after-elon-musk-admitted-regrets-over-explosive-row-13382005",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-musk-trump_6935643.jpg?20250611101342",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-11 07:14:00",
        "Headline": "Mr Musk posted a series of tweets on X last week in a fiery exchange between the pair, including accusing the president of appearing in files relating to Jeffrey Epstein.",
        "Content": "Donald Trump has responded after Elon Musk said some of his recent social media posts about the US president \"went too far\".  The Tesla and SpaceX boss shared a series of posts on his X social media platform last week, including one which described Mr Trump's sweeping tax and spending bill as a \"disgusting abomination\". He also claimed, in a since-deleted post, that the president appeared in files relating to the disgraced paedophile financier Jeffrey Epstein. Posting on X this morning, Mr Musk said: \"I regret some of my posts about President @realDonaldTrump last week. They went too far.\" In response, the president is quoted as telling the New York Post: \"I thought it was very nice that he did that.\" The publication said it spoke to Mr Trump in a brief phone conversation.  The White House dismissed Mr Musk's Epstein claims at the time, with press secretary Karoline Leavitt saying: \"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill [a Republican tax and spending bill] because it does not include the policies he wanted. \"The president is focused on passing this historic piece of legislation and making our country great again.\" Mr Musk did not specify which posts he regretted.  In another post last Thursday, Mr Musk attacked Mr Trump's tariffs, saying they \"will cause a recession in the second half of this year\". In response, Mr Trump, in an interview with ABC News, said Mr Musk had \"lost his mind\". He also threatened to cancel government contracts with the businessman's companies and said he had asked the billionaire to leave the White House.  But yesterday, Mr Musk's father Errol Musk told Sky News' Moscow correspondent Ivor Bennett: \"It's like any argument. Everybody at some point says I'll never make up, but then they do later.\" He said the argument likely happened because of \"emotions welling out of hand\".  \"They've had five months of intense day and night, hardly any sleep, and anybody who went through that would know your nerves are pretty much shredded after that time.\" He also said his son had texted him to say: \"Don't worry, we're sorting it out.\" The spat hit Tesla shares, which closed down 14.3% last Thursday, losing about $150bn (£111bn) in value. They've since regained much of their value compared to the beginning of the month."
    },
    {
        "title": "Spending review: Treasury minister Emma Reynolds tells Sky News she is 'not ruling out' tax rises in the autumn",
        "description": "A Treasury minister has refused to rule out tax rises at the budget in the autumn, amid concerns that any global economic instability could mean the government will not have enough money to fund its spending plans.",
        "url": "https://news.sky.com/story/spending-review-treasury-minister-emma-reynolds-tells-sky-news-she-is-not-ruling-out-tax-rises-in-the-autumn-13382351",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-emma-reynolds-treasury-minister_6939648.jpg?20250611201147",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-11 19:51:00",
        "Headline": "The Tory shadow chancellor said \"the mask has slipped\" after Emma Reynolds declined to rule out tax hikes in future.",
        "Content": " A Treasury minister has refused to rule out tax rises at the budget in the autumn, amid concerns that any global economic instability could mean the government will not have enough money to fund its spending plans. Speaking to Sky's Politics Hub With Ali Fortescue, Emma Reynolds defended how the economy was being handled, but would not say if more revenue might be needed from taxation. Asked repeatedly if she was ruling out tax rises, the minister said: \"I'm not ruling it in and I'm not ruling it out. \"We have got £9bn of fiscal headroom [money left in the budget], which is significantly more than the Tories had when they were in power, at the end of their time in power. \"We've got a growing economy, and we, as the chancellor did say in the [Commons] chamber, the budget in the autumn last year was a once-in-a-generation budget where we had to do some very tough things, and we're not going to have another budget like that in the future.\" Politics Hub: Latest updates Responding directly to the minister's interview, shadow chancellor Sir Mel Stride told Sky News: \"The mask has slipped. Today's spending review was nothing more than an obfuscation. \n                  Reeves hands NHS £29bn extra per year and pledges to end asylum hotels\n                 \n                  Spending review's key points at a glance\n                 \n                  Who will win and lose in the spending review\n                 \"Now we know - tax rises are coming.\"  Speaking to Sky's political editor Beth Rigby, the chancellor Rachel Reeves avoided the direct question about potential tax rises, saying: \"Before any money goes out the door, we will have a budget in the autumn, and we will show in the round, when the Office for Budget Responsibility update their forecast, how everything is consistent with the fiscal rules that I set out as chancellor last autumn.\" She added that they \"made the tax changes that were necessary last year to fund the spending that I've set out today\".  Read more:Spending review's key points at a glanceUK agrees post-Brexit deal on GibraltarAre tax rises inevitable after spending review? Ms Reeves has imposed a set of \"iron-clad\" fiscal rules, which restrict government borrowing in order to ensure economic stability and reduce the UK's national debt, Labour says. These rules mean the amount of money she has available to spend on the day-to-day running of public services is limited to only what the government takes in tax revenue. 'A miniscule margin' But as Paul Johnson from the non-partisan Institute for Fiscal Studies told Sky presenter Jayne Secker, the chancellor has left herself very little room for manoeuvre. He said: \"She set the fiscal rules and she's also meeting them by the most miniscule margin imaginable. \"What does that mean? That means if there's any negative news on the economic forecasts and the other forecasts, then she will have to raise taxes in order to meet those rules. And, of course, we have had some negative news over the last few months.\""
    },
    {
        "title": "European League of Football touches down with $10m-plus funding boost",
        "description": "The new owner of Leyton Orient Football Club is among the new investors ploughing millions of pounds into a European strand of American football in a deal to be announced as soon as this week.",
        "url": "https://news.sky.com/story/european-league-of-football-touches-down-with-10m-plus-funding-boost-13382187",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-european-league-football_6939433.jpg?20250611150655",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-11 13:45:00",
        "Headline": "The American football format featuring teams such as Paris Musketeers has secured millions of pounds in funding from backers including David Gandler's Goal Line Sports, Sky News understands. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The new owner of Leyton Orient Football Club is among the new investors ploughing millions of pounds into a European strand of American football in a deal to be announced as soon as this week. Sky News has learnt that Goal Line Sports - which is controlled by David Gandler, who recently bought League One Leyton Orient - is one of three strategic investors backing the expansion of the European League of Football (ELF). The other new investors are 885 Capital, whose sports portfolio includes the new Baller League, and Oakvale Ventures, the investment arm of sports advisory group Oakvale. Money latest: Are premium bonds worth it? Sources said the new round of funding was worth more than $10m, with reports suggesting that Mr Gandler plans to acquire a new ELF franchise in London. ELF, which is now in its fifth season, consists of 16 teams, including the Madrid Bravos, Paris Musketeers, and Frankfurt Galaxy. Media rights to the tournament have been sold in North America, South America, Africa, and Europe, with 101 games being broadcast each season. This year's Championship-deciding contest will take place on September 7 at Stuttgart's MHP Arena. The new investors are understood to have been drawn to ELF by the opportunity to access a European market comprising 500m people, with interest in American football said to be growing. Politics latest: Spending review announcements and reaction Total attendances last year hit more than 470,000. The ELF did not respond to several requests for comment."
    },
    {
        "title": "Reeves hands NHS £29bn extra per year and pledges to end asylum hotels",
        "description": "Day-to-day spending on the NHS will increase by &#163;29bn a year, Rachel Reeves has announced, as she accepted that voters are yet to feel an improvement under Labour.",
        "url": "https://news.sky.com/story/reeves-hands-nhs-16329bn-extra-per-year-and-pledges-to-end-asylum-hotels-13382142",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-downing-street_6939143.jpg?20250611113321",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-11 12:18:00",
        "Headline": "The chancellor acknowledges that almost a year on from Labour's landslide election victory, \"too many people\" are yet to feel their promise of national renewal.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Day-to-day spending on the NHS will increase by £29bn a year, Rachel Reeves has announced, as she accepted that voters are yet to feel an improvement under Labour. Delivering her spending review, the chancellor also declared an end to the use of asylum hotels this parliament by investing in cutting the backlog and returning more people with no right to be in the UK - which she said would save taxpayers £1bn a year. Politics live: Reaction to spending review   Ms Reeves acknowledged that almost 12 months on from Labour's landslide election victory, \"too many people\" are yet to feel their promise of national renewal. She said the purpose of her spending review is \"to change that\", with departmental budgets to grow by an average of 2.3% a year in real terms until 2028-29. Key settlements include: • NHS: The health service gets £29bn for day-to-day spending - a 3% rise for each year until the next general election;• Housing: £39bn over the next 10 years to build affordable and social housing;• Defence: Spending will rise from 2.3% of GDP to 2.6% by 2027, made up of an £11bn uplift on defence and £600m for security and intelligence agencies;• Science and tech: Research and development funding will hit £22bn, with AI plans getting £2bn;• Transport: £15bn for new rail, tram, and bus networks in the North and the West Midlands, a new rail line between Liverpool and Manchester, and a four-year settlement for TfL, plus the £3 bus fare cap extended to 2027;• Nations: Scotland gets £52bn, Northern Ireland £20bn, and Wales £23bn, including for coal tips;• Education: Free school meals extended to 500,000 children, while the extra £4.5bn per year will also go on fixing classrooms and rebuilding schools;• Nuclear: A £30bn commitment to nuclear power, including £14.2bn to build Sizewell C plant in Suffolk and £2.5bn in small modular reactors;• Prisons: 14,000 new prison places will be funded with a £7bn injection;• Police: 13,000 more police officers will be paid for with £2bn.  Read more: The key announcements Many of Wednesday's announcements have been front-loaded by cash injections made since Labour took office, meaning that from 2025-26 the increase is a more modest 1.5% on average. Over the course of the whole parliament, it equates to spending £190bn more on the day-to-day running of public services and £113bn more on capital investments than under the previous government's spending plans, the chancellor said. Ms Reeves drew a distinction between her review and the Tories' austerity agenda in 2010, saying they cut spending by 2.9%. She said austerity was a \"destructive choice for the fabric of our society\" and \"different choices\" would be made under Labour. However, while overall departmental spending will increase day to day, some departments face a squeeze. Home Office budget squeezed This includes the Home Office, whose spend will reduce by 1.4% over the next three years, including daily spend and capital investments. Daily spend covers the daily running costs of public services, while capital investment is spending by the state on the creation of fixed, long-term assets, such as roads and railways. Combined, the Foreign Office and Department for Environment, Food and Rural Affairs (DEFRA) also face reductions, as does the Department for Digital, Culture, Media and Sport, and the Cabinet Office. Paul Johnson, the director of the Institute for Fiscal Studies, said 3% a year increases in NHS spending \"does mean virtually nothing on average for current spending elsewhere\".  Ms Reeves said the cash boost for the NHS would fund more appointments, more doctors and more scanners. She used this to draw dividing lines with Reform UK, saying they have called for an '\"insurance-based system\" whereas Labour created the NHS, protected the NHS and under this government would \"renew the NHS\". Read more:The spending review: Five things you need to know Speculation of tax rises Ms Reeves said she was able to raise the money through decisions made in her autumn budget and spring statement, which saw taxes raised by £40bn and cuts made to the welfare budget. However, the Tories said the review \"isn't worth the paper it's written on\" and further tax hikes will be needed. Shadow chancellor Sir Mel Stride said that \"this is the spend-now, tax-later review\", adding Ms Reeves \"knows she will need to come back here in the autumn with yet more taxes and a cruel summer of speculation awaits\". The Liberal Democrats said the \"smoke and mirrors\" spending review would leave a black hole in social care as local government budgets remain at breaking point. \"Putting more money into the NHS without fixing social care is like pouring water into a leaky bucket,\" said the party's Treasury spokesperson Daisy Cooper."
    },
    {
        "title": "Is chancellor's spending review the start of a 'national renewal' - or too good to be true?",
        "description": "If you sat through the entire spending review speech delivered by Rachel Reeves in the House of Commons, you might have been lulled into a sense that the UK was awash with a wealth of riches as the chancellor sprinkled billions across the land.",
        "url": "https://news.sky.com/story/is-chancellors-spending-review-the-start-of-a-national-renewal-or-too-good-to-be-true-13382354",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935130.jpg?20250605145249",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-11 20:13:00",
        "Headline": "The chancellor deserves credit for the capital investment, which she hopes will unlock jobs and power economic growth. But when something sounds too good to be true, it normally is.",
        "Content": "\n          Political editor\n              @BethRigby\n  If you sat through the entire spending review speech delivered by Rachel Reeves in the House of Commons, you might have been lulled into a sense that the UK was awash with a wealth of riches as the chancellor sprinkled billions across the land. There were billions for social housing, nuclear power stations, rail lines and research and development to power the economy. There was money for schools, the police, the NHS, and defence spending, as the chancellor sketched out her roadmap for Britain for years to come, with an acknowledgement that the government - and particularly this chancellor - had endured a difficult first year. \"We are renewing Britain. But I know that too many people in too many parts of our country are yet to feel it…the purpose of this spending review is to change that,\" she said. Politics Hub: Tap here for the latest news There was £113bn of borrowing to fund capital investment and an extra £190bn over the course of the parliament for public services, fuelled by those contentious tax rises in the budget last autumn. This was a Labour chancellor turning her back on austerity. \"In place of decline, I choose investment. In place of retreat, I choose national renewal,\" she said. The chancellor deserves credit for the capital investment, which she hopes will unlock jobs and power economic growth. But when something sounds too good to be true, it normally is. For me, former shadow chancellor John McDonnell hit the nail on the head on Wednesday night as he remarked rather wryly to me that \"the greater the applause on the day, the greater the disappointment by the weekend\".  Could tax hikes be needed? Because, in talking up the prospect of national renewal, the chancellor glossed over what the \"hard choices\" mean for all of us. There are questions now swirling about where the cuts might fall in day-to-day budgets for those departments which are unprotected, with local government, the Home Office, the Foreign Office, and the Department for Environment all facing real-terms cuts. My colleague Ed Conway, analysing the government figures, found cuts in the schools budget for the last two years of this parliament - the chancellor's top line figure showed an overall rise of 0.6% over the five-year period of this Labour government. There are questions too over whether council tax bills might be increased in order to top up local government and police budgets. Ms Reeves told me in an interview after her speech that they won't, but she has predicated increases in police funding and local government funding coming locally, rather than from central government, so I will be watching how that will play out.  Even with the increase in health spending - the NHS is getting a 3% boost in its annual budget - there are questions from health experts whether it will be enough for the government to hit a routine operations target of treating 92% of patients within 18 weeks. My point is that this might not be - to again quote Mr McDonnell - \"mathematical austerity\", but after over a decade where public dissatisfaction in public services has grown, the squeeze of day-to-day spending could make it hard for the chancellor to persuade working people this is a government delivering the change for them. There is pressure to reverse some of the welfare cuts, and pressure to lift the two-child benefit cap, while the pressure to reverse the winter fuel allowance has already resulted in Reeves this week making a £1.25bn unfunded spending commitment (she will set out how she is paying for it at the next budget).  Will voters feel the 'renewal'? Reeves told me on Wednesday there was no need for tax rises in the autumn because the spending envelope had already been set, and the money now divvied out. It's a very live question as to whether that can hold if the economy weakens. She did not rule out further tax rises when I asked her last week, while Treasury minister Emma Reynolds told my colleague Ali Fortescue on Wednesday night: \"I'm not ruling it in, I'm not ruling it out.\" 👉 Listen to Sky News Daily on your podcast app 👈 The gamble is that, by investing in infrastructure and getting spades in the ground, and tilting limited public money into the NHS, the government can arrive at the next election with enough 'proof points' to persuade voters to stick with them for another five years. On Wednesday, the chancellor laid the foundations she hopes will turn the government's fortunes around. The risk is that voters won't feel the same by the time they are asked to choose."
    },
    {
        "title": "Spending review's key points at a glance",
        "description": "Rachel Reeves has set out her spending review in the House of Commons.&#160;&#160;",
        "url": "https://news.sky.com/story/spending-review-2025-the-key-announcements-13382050",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-key-points_6935116.jpg?20250605144707",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter",
        "Date Published": "2025-06-11 11:30:00",
        "Headline": "From the Ministry of Defence, the Department for Transport and the Home Office, here are the main announcements from Chancellor Rachel Reeves.",
        "Content": "By Sarah Taaffe-Maguire, business and economics reporter and Lauren Russell, news reporter   Rachel Reeves has set out her spending review in the House of Commons.   It outlines how much day-to-day funding government departments will get over the next three years, until 2029, which is used on things like wages. It also covers a department's investment (also known as capital) budget over the next four years, until the end of 2030. This money is used to pay for things like new infrastructure projects. Politics latest: Follow live updates and reaction The last spending review was held during the COVID-19 pandemic, and before that, in 2015. Here's what's been announced: Sky News has crunched the numbers to see which government departments have benefited after the spending review, and which have seemingly lost out.  The chart below sets out which departments are getting the biggest increase in their day-to-day budgets. The second chart maps the biggest increases in capital spending. A major recipient of funds is the Ministry of Defence. Defence spending will rise from 2.3% of gross domestic product (GDP) to 2.6% by 2027. This equates to an £11bn uplift and a £600m uplift for security and intelligence agencies. Within that there'll be £4.5bn of investment in munitions made across the country and more than £6bn to upgrade to nuclear submarine production. The department is one of the biggest winners of the spending review. In total, an extra 3.8% will be spent from this year to the end of 2029, when the spending period ends. Much of that increase will be capital spending - a rise of 7.3%, whereas day-to-day spending will only go up 0.7% in the same period. Ms Reeves said it was because of cuts to foreign aid that such defence rises are possible. The Foreign, Commonwealth and Development Office was among the biggest losers, with spending set to fall 8.3% in total over the next three years. Its capital spending will drop 6.8%, with day-to-day spending down 6.9%. The chancellor announced an extra £29bn a year will be spent on the NHS, an annual rise of 3% on current levels. She says she is increasing the NHS technology budget by almost 50%, and £10bn to bring the \"analogue health system into the digital age\". The department in control of the NHS, the Department of Health and Social Care, is also a \"real big winner\", Sky News' data and economics editor Ed Conway says. Day-to-day spending will rise 2.8%, while there will be no increase in capital expenditure. The chancellor says border security funding will increase, with up to £280m more per year by the end of the spending review for the new Border Security Command. She said the Home Secretary Yvette Cooper will end hotels being used to house asylum seekers by 2029. The chancellor says funding she has announced today, including from the transformation fund, will also cut the asylum backlog, see more appeal cases heard and \"return people who have no right to be here\". This will save the taxpayer £1bn a year, she claimed. As a result of these savings, the Home Office will have 1.4% less to spend by 2029, compared to this year. Broken down on a day-to-day basis, it's a 1.7% drop but a 0.7% rise in capital expenses. The chancellor confirmed that free school meals will be extended to over half a million more children and said that the policy will lift 100,000 children out of poverty.  Nearly £2.3bn a year will go to fix crumbling classrooms. A further £2.4bn will be spent on rebuilding 500 schools. Another record investment amount was announced by Ms Reeves for training and upskilling - £1.2bn a year by the end of the spending review will go to support more than a million young people into training and apprenticeships. School-based nurseries have been given £370m. The core schools budget is rising by £3.5bn a year. Government funding of social and affordable housing has been allocated £39bn, over the next 10 years - which Ms Reeves called the \"biggest cash injection into social housing in 50 years\". She says she is providing an additional £10bn for financial investments, to be delivered through Homes England, to help unlock hundreds of thousands more homes. A commitment to nuclear power was reiterated, with £30bn allocated. Of this, £14.2bn is being poured into the Sizewell C nuclear power station - which was announced earlier this week - on the Suffolk coastline. Another £2.5bn will be invested in a new small modular reactor programme. The chancellor says she wants the country's high-tech industries in Britain to continue to lead the world in the years to come. Research and development funding will go to a record high of £22bn a year by the end of the spending period. The chancellor has backed \"home-grown AI\" with a £2bn investment. She says the technology has the potential to \"solve diverse and daunting challenges\" and create \"good jobs\". The chancellor announced £15bn for new rail, tram and bus networks across the West Midlands and the North. She's also given the green light to a new rail line between Liverpool and Manchester. She says investments in buses, train stations, metro lines and transit will be made in places including Rochdale, Merseyside, Birmingham and West Yorkshire. In London, Ms Reeves says there will be a \"four-year settlement\" for the Transport for London and a \"fourfold increase\" in local transport grants by the end of this parliament. As expected, the £3 bus cap has been extended to March 2027. It had been £2 up to the end of 2024. To fund 14,000 new prison places, £7bn will be invested, with £700m a year going to reform the probation system. In order to reach the goal of 13,000 more police officers in England and Wales, £2bn will be allocated. On the nations of the UK, the chancellor announced: • Scotland has been allocated £52bn• Northern Ireland has been allocated £20bn• Wales has been allocated £23bn."
    },
    {
        "title": "Spending review: Rachel Reeves is running out of levers to pull if something goes wrong",
        "description": "It was billed as a massive moment in British economic policymaking - a juncture where the Labour government would turn its economic philosophy into a fiscal reality, running its finger down every line of public spending and overhauling the machinery of government for years to come.",
        "url": "https://news.sky.com/story/spending-review-reeves-is-running-out-of-levers-to-pull-if-something-goes-wrong-13382313",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-downing-street_6939665.jpg?20250611205004",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-06-11 17:27:00",
        "Headline": "Sky's Ed Conway says the chancellor's wiggle room going into the spending review was already so small that the autumn budget could yet force her to make tougher decisions.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  It was billed as a massive moment in British economic policymaking - a juncture where the Labour government would turn its economic philosophy into a fiscal reality, running its finger down every line of public spending and overhauling the machinery of government for years to come. So, did the spending review live up to its hype? The answer, of course, is no. But then again, if you're expecting dramatic changes and seismic shifts from spending reviews, you should probably go and lie down in a dark room for a period. After all, the big picture for this review has been set in stone for some time. We've known for months about the scale of overall government spending in the coming years (in short: slight increases in day-to-day spending; bigger increases in investment). Money latest: Will taxes have to rise in autumn budget? The only remaining question was how that money was going to be apportioned. And the answer to that question threw up few surprises. As was the case in every previous review in recent memory, the biggest winner was health, which continued to grow - not just in absolute terms but also as a share of public spending. The big winner when it came to the investment spending doled out by the chancellor Rachel Reeves was, as expected, defence - primarily to fund that 2.5% (or thereabouts) of gross domestic product (GDP) pledge made by the prime minister earlier this year. There was more money for transport, although questions remain over whether more money will be needed for HS2 when it comes back for an accounting \"reset\" (translation: this is going to cost loads more than we told you) next year. But in short: no enormous surprises. Then again, this was never going to be one of those spending reviews that dramatically changed the nature of the state, like the ones carried out by Gordon Brown as chancellor at the turn of the millennium. Those Brownite reviews tended to increase day-to-day spending by around 5% a year. This one only increased day-to-day spending by less than 2%. Read more:Key spending review announcementsYour spending review questions answered But that tells you a lot about the constraints under which the chancellor is working. In short, today, the national debt is considerably larger than in 2000. So too is the tax burden. So are debt interest costs, not to mention the health costs of an ageing population. Set that all alongside the chancellor's fiscal rules (which commit her not to borrow too much more, save for investment) and you see the problem. She doesn't have much room left to spend. A sudden deterioration in the economy (due to, say, a trade war) and all of a sudden, she's missing her rules. Which is why this spending review does nothing to answer the question that continues to hang over her: will she have to raise taxes again to make her sums add up? Indeed, now that she's committed herself to spending certain amounts in the coming years, she's running out of levers to pull if something goes wrong."
    },
    {
        "title": "Spending review: Treasury minister Emma Reynolds tells Sky News she is 'not ruling out' tax rises in the autumn",
        "description": "A Treasury minister has refused to rule out tax rises at the budget in the autumn, amid concerns that any global economic instability could mean the government will not have enough money to fund its spending plans.",
        "url": "https://news.sky.com/story/spending-review-treasury-minister-emma-reynolds-tells-sky-news-she-is-not-ruling-out-tax-rises-in-the-autumn-13382351",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-emma-reynolds-treasury-minister_6939648.jpg?20250611201147",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-11 19:51:00",
        "Headline": "The Tory shadow chancellor said \"the mask has slipped\" after Emma Reynolds declined to rule out tax hikes in future.",
        "Content": " A Treasury minister has refused to rule out tax rises at the budget in the autumn, amid concerns that any global economic instability could mean the government will not have enough money to fund its spending plans. Speaking to Sky's Politics Hub With Ali Fortescue, Emma Reynolds defended how the economy was being handled, but would not say if more revenue might be needed from taxation. Asked repeatedly if she was ruling out tax rises, the minister said: \"I'm not ruling it in and I'm not ruling it out. \"We have got £9bn of fiscal headroom [money left in the budget], which is significantly more than the Tories had when they were in power, at the end of their time in power. \"We've got a growing economy, and we, as the chancellor did say in the [Commons] chamber, the budget in the autumn last year was a once-in-a-generation budget where we had to do some very tough things, and we're not going to have another budget like that in the future.\" Politics Hub: Latest updates Responding directly to the minister's interview, shadow chancellor Sir Mel Stride told Sky News: \"The mask has slipped. Today's spending review was nothing more than an obfuscation. \n                  Reeves hands NHS £29bn extra per year and pledges to end asylum hotels\n                 \n                  Spending review's key points at a glance\n                 \n                  Who will win and lose in the spending review\n                 \"Now we know - tax rises are coming.\"  Speaking to Sky's political editor Beth Rigby, the chancellor Rachel Reeves avoided the direct question about potential tax rises, saying: \"Before any money goes out the door, we will have a budget in the autumn, and we will show in the round, when the Office for Budget Responsibility update their forecast, how everything is consistent with the fiscal rules that I set out as chancellor last autumn.\" She added that they \"made the tax changes that were necessary last year to fund the spending that I've set out today\".  Read more:Spending review's key points at a glanceUK agrees post-Brexit deal on GibraltarAre tax rises inevitable after spending review? Ms Reeves has imposed a set of \"iron-clad\" fiscal rules, which restrict government borrowing in order to ensure economic stability and reduce the UK's national debt, Labour says. These rules mean the amount of money she has available to spend on the day-to-day running of public services is limited to only what the government takes in tax revenue. 'A miniscule margin' But as Paul Johnson from the non-partisan Institute for Fiscal Studies told Sky presenter Jayne Secker, the chancellor has left herself very little room for manoeuvre. He said: \"She set the fiscal rules and she's also meeting them by the most miniscule margin imaginable. \"What does that mean? That means if there's any negative news on the economic forecasts and the other forecasts, then she will have to raise taxes in order to meet those rules. And, of course, we have had some negative news over the last few months.\""
    },
    {
        "title": "Did ChatGPT get the spending review right? Treasury minister gives his verdict",
        "description": "The chief secretary to the Treasury has called the Sky News-Chat GPT spending review projection \"pretty good\" and scored it 70%.",
        "url": "https://news.sky.com/story/did-chatgpt-get-the-spending-review-right-treasury-minister-gives-his-verdict-13382327",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sam-coates-darren-jones_6939698.png?20250611224905",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-06-11 18:17:00",
        "Headline": "Darren Jones compares the real spending review, delivered by Rachel Reeves on Wednesday, and the Sky News AI (artificial intelligence) projection last week.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  The chief secretary to the Treasury has called the Sky News-Chat GPT spending review projection \"pretty good\" and scored it 70%. Darren Jones compared the real spending review, delivered by Rachel Reeves on Wednesday, and the Sky News AI (artificial intelligence) projection last week. Sky News took the Treasury's spring statement, past spending reviews, the 'main estimates' from the Treasury website, and the Institute for Fiscal Studies' projections, and put them into ChatGPT, asking it to calculate the winners and losers in the spending review. Politics Hub: Tap here for live updates This was done 10 days ahead of the review - before several departments had agreed their budgets with the Treasury - on the basis of projections based on those public documents. It also comes amid a big debate kicked off by Sky News about the level of error of AI. The Sky News-AI projection correctly put defence and health as the biggest winners, the Foreign Office as the biggest loser, and identified many departments would lose out in real terms overall. It suggested the education budget would be smaller than it turned out, but correctly highlighted the challenges for departments like the Home Office and environment. \n                  Powerful new supercomputer to be built in Scotland in government U-turn\n                 \n                  Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts\n                 \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 Watch what happened with Sky's AI-generated spending review  Reviewing the exercise, the author of the real spending review told Sky News that this pioneering use of AI was \"pretty, pretty good\". He added: \"I could be out of a job next time in 2027, which to be honest, it's not a bad idea given the process I've just had to go through.\" The Treasury made a number of accounting changes to so-called \"mega projects\" which AI could not have anticipated, and changed some of the numbers.  Asked to give it a score, Mr Jones replied: \"I'm going to give it 70%.\" The spending review includes AI as a tool to save money in various government processes. Asked if 70% accuracy is good enough for government, he replied: \"Well we're not using your AI. We've got our own AI, which is called HMT GPT, and it helps us pull together all the information across government to be able to make better, evidence-informed decisions.\""
    },
    {
        "title": "Spending review: What does it mean for me?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>       ",
        "url": "https://news.sky.com/story/spending-review-what-does-it-mean-for-me-13382322",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-daily-podcast-spending-review_6939267.png?20250611124535",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-11 18:04:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  The chancellor has unveiled her long-awaited spending review, which sets out detailed plans for how individual government departments are funded over the next three years.  Rachel Reeves says departmental budgets will grow by an average of 2.3% a year, prioritising health, defence and infrastructure projects - but how will this be paid for? And will the plans help working people as promised by her government? In today's episode, political correspondent Tamara Cohen speaks to economics and data editor Ed Conway about the ambitious figures. Producer: Emily HulmeEditor: Philly Beaumont"
    },
    {
        "title": "UK agrees post-Brexit deal on Gibraltar in boost to reset talks with EU",
        "description": "The UK government has agreed a post-Brexit deal with the EU on Gibraltar, unpicking another issue in its negotiations with Brussels.",
        "url": "https://news.sky.com/story/uk-agrees-post-brexit-deal-on-gibraltar-13382213",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gibraltar-spain-eu_6939467.jpg?20250611160728",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-06-11 14:44:00",
        "Headline": "Checks like those at St Pancras for the Eurostar will take place at Gibraltar Airport, carried out by Spanish and Gibraltarian officials.",
        "Content": "\n          Political reporter\n              @TimJ_B\n The UK government has agreed a post-Brexit deal with the EU on Gibraltar, unpicking another issue in its negotiations with Brussels. Foreign Secretary David Lammy flew to the British overseas territory late last night for talks with ministers there, before heading on to Brussels for finalising talks with the EU and Spain. The government says the new agreement resolves the \"last major unresolved issue from Brexit\", and \"avoids the need\" for checks on people and goods crossing the Gibraltar-Spain border, to support \"prosperity in the region\". Politics latest: Chancellor sets out spending Around 15,000 people - more than half of Gibraltar's workforce - cross the border daily. The UK is hoping it will help speed up other post-Brexit discussions as it looks to reset its relationship with the EU. As part of the deal, the government says there will be dual border control checks for arrivals by air at Gibraltar airport, carried out by Gibraltar and Spanish officials, as well as arrivals by sea at the port. Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model the government says is similar to French police operating in London's St Pancras station.   A bespoke agreement was needed for the territory, as Spain claims Gibraltar belongs to them after the UK took control of the territory in the early 18th century. Both Tory and Labour governments have been firm in their stance that they will not give up sovereignty of the territory to Spain. The deal explicitly states the treaty will not impact sovereignty, and also ensures the UK has full operational autonomy for the military facilities there. St Pancras style checks The government said: \"Immigration and law and order in Gibraltar will remain the exclusive responsibility of Gibraltar's authorities. \"Spanish officials will be responsible for ensuring the integrity of the Schengen Area, in a model similar to French police operating in London's St Pancras station.\" As Sky News deputy political editor Sam Coates points out, some Eurosceptics will be unhappy with the presence of European border guards in British territory. Read more:EU wants to limit UK access to arms fundTop Tory admits Brexit drawback Foreign Secretary David Lammy said: \"This government inherited a situation from the last government which put Gibraltar's economy and way of life under threat. Today's breakthrough delivers a practical solution after years of uncertainty. \"Alongside the government of Gibraltar, we have a reached an agreement which protects British sovereignty, supports Gibraltar's economy and allows businesses to plan for the long-term once again. \"I thank the chief minister and his government for their tireless dedication throughout the negotiations. The UK's commitment to Gibraltar remains as solid as the Rock itself.\" Fabian Picardo, Gibraltar's chief minister, said he was \"delighted\" with the deal, and he was looking \"towards a time of renewed cooperation and understanding\". A statement from the EU side said: \"The parties are confident that this Agreement will support prosperity and bring confidence, legal certainty, and stability to the lives and well-being of the people of the whole region.\""
    },
    {
        "title": "Work and pensions secretary tells MPs controversial disability benefit reforms will go ahead next year",
        "description": "The government has told MPs it will not back down from its controversial reforms to disability benefits, which are set to be introduced to parliament later this month.",
        "url": "https://news.sky.com/story/work-and-pensions-secretary-tells-mps-controversial-disability-benefit-reforms-will-go-ahead-next-year-13382300",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-work-and-pensions-liz-kendall_6808860.jpg?20250123234416",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-11 16:59:00",
        "Headline": "Liz Kendall rejects calls to delay the changes until a full assessment is carried out of the impact on employment, poverty and health.",
        "Content": "\n          Political correspondent\n              @tamcohen\n The government has told MPs it will not back down from its controversial reforms to disability benefits, which are set to be introduced to parliament later this month. More than 100 Labour MPs are thought to have concerns about the plans to cut nearly £5bn from the welfare bill by restricting personal independence payments (PIP) and the health top-up to Universal Credit. Charities say the changes will have a \"catastrophic\" effect on vulnerable people. Politics Hub: Follow the latest updates  The chair of the Commons' Work and Pensions Committee wrote to the secretary of state, Liz Kendall, last month, calling on the government to delay the changes until a full assessment is carried out of the impact on employment, poverty and health. Labour MP Debbie Abrahams wrote that while there was a case for reform to disability benefits, \"the evidence indicated [these changes] might not improve outcomes for most claimants, but instead push many into poverty and further away from the labour market\". 'Reforms are needed now' \n                  How risky is Rachel Reeves's winter fuel U-turn?\n                 \n                  Disabled woman took her own life after benefits wrongly stopped, coroner finds\n                 \n                  Starmer says government 'will look at' scrapping two-child benefits limit\n                 But Ms Kendall has written back, in a letter made public on Wednesday, to reject the idea because the bill needs final approval from parliament in November in order for the changes to take effect in 2026. She wrote: \"We need urgent action to help people who can work, into work. With one in eight young people now not in education, employment or training and nearly 2.8 million people out of work due to long-term sickness, and spending on health and disability benefits set to rise by an additional £18bn, we must change course. \"We have consistently been clear that we are not consulting on every proposal. \"Instead, parliament will have the opportunity to fully debate, propose amendments to, and vote on areas where we have announced urgent reforms that are not subject to consultation. \"With PIP caseload and costs forecast to continue rising, reforms are needed now to make the system sustainable, while supporting those people with the greatest needs.\"  What is the government's plan? The government says the PIP caseload has more than doubled from 15,000 new claims per month in 2019 to 34,000. PIP is a benefit to help disabled people with the increased costs of day-to-day living. It is proposed that claimants will need to achieve four points out of eight in their assessment to qualify for the benefit, and the government says some 370,000 existing claimants will lose out when reassessed. Ms Kendall says the growth in claims means the PIP caseload will still increase by the end of the parliament. The government will also tackle what Ms Kendall called the \"perverse incentive\" to claim the health top-up for Universal Credit by freezing it at £97 a week for existing claimants, and slashing the rate to £50 a week for new claimants. The average loss of benefits will be £1,700 a year for some three million people. Claimants with the most serious conditions, who have been assessed as never able to work, will not be subject to reassessment, ministers say, allowing them to have peace of mind. The government will provide £1bn for targeted support schemes to help disabled people into work. But it's estimated these will help only some 70,000 people find employment.  Ms Kendall said a minister in her department is engaging with disabled people and organisations about the PIP assessment process, but said: \"The PIP assessment review will rightly take time and require extensive engagement, and we cannot wait for its conclusion to make the urgently needed changes to the PIP eligibility criteria.\" 'Deeply disappointing news' The first minister of Wales, Eluned Morgan, who is gearing up for elections next year, told Sky News she had spoken to Ms Kendall about her concerns last week. She said: \"This is going to be really challenging for a lot of people in Wales. We know more people in Wales will be affected by PIP than in any other part of the country. \"We do think there needs to be reform of welfare because we believe people can work should work, but in Wales we have examples of where we hold people's hands, stand by them, we help them into work, and we think that's more of a productive approach.\" Read more:Spending review's key points at a glanceUK agrees post-Brexit deal on GibraltarAre tax rises inevitable after the spending review? Labour MP Richard Burgon, who has vowed to vote against the reforms, said: \"This will be deeply disappointing news for all the MPs who've been urging the government to delay this decision. Instead of allowing time for proper scrutiny and meaningful dialogue with disabled people, the government has brushed aside MPs' genuine concerns. \"These planned disability cuts should be scrapped - not rushed through without proper scrutiny.\""
    },
    {
        "title": "World-first views of the Sun's poles released - but scientists say best is yet to come",
        "description": "The sun's south pole has been seen for the first time from outside the ecliptic plane in unprecedented images sent back to Earth by a solar orbiter.",
        "url": "https://news.sky.com/story/world-first-views-of-the-suns-poles-released-but-scientists-say-best-is-yet-to-come-13382278",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sun-south-pole-solar-orbiter_6939556.jpg?20250611174814",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-11 16:42:00",
        "Headline": "The Solar Orbiter spacecraft travelled 15 degrees below the sun's solar equator to take the images in mid-March - with the European Space Agency (ESA) and NASA revealing them to the world on Wednesday.",
        "Content": "The sun's south pole has been seen for the first time from outside the ecliptic plane in unprecedented images sent back to Earth by a solar orbiter. The Solar Orbiter spacecraft travelled 15 degrees below the sun's solar equator to take the images in mid-March - with the European Space Agency (ESA) and NASA revealing them to the world on Wednesday. It is only the second craft to have passed over the sun's poles - with the ESA and NASA's 1990-2009 Ulysses craft lacking the capacity to take any photos. Read moreCould Britain face a winter ice age?Will there be a hosepipe ban in the UK? \"Today we reveal humankind's first-ever views of the sun's pole,\" ESA's director of science, Professor Carole Mundell, said. Describing it as a \"new era of solar science\", she added: \"The sun is our nearest star, giver of life and potential disruptor of modern space and ground power systems, so it is imperative that we understand how it works and learn to predict its behaviour.\" 'Best is yet to come' According to the ESA, previous images of the sun have been taken from around its equator. This is because Earth, the other planets, and all other operational spacecraft orbit the Sun within a flat disc around the Sun called the ecliptic plane. However, by tilting its orbit out of this plane, Solar Orbiter has revealed the star from a whole new angle - and because the spacecraft is set to tilt even further \"the best views are yet to come\". The Solar Orbiter took off from Florida in 2020. Unlike Earth, which has fixed north and south poles, the sun's equivalents flip on an 11-year cycle. This is because its equator spins faster than its poles - every 26 days compared to every 33 days - meaning it does not rotate as a solid object, instead becoming so unstable it eventually flips. The sun is currently at what is referred to as \"solar maximum\", when the star is building up to the polar flip. During this period, its spots and solar flares are most active. In five or six years, the sun will reach its \"solar minimum\", when its magnetic activity is at its lowest. The images from Solar Orbiter's recent journey reveal a fragmented mosaic of north and south polarity at the sun's base. The spacecraft will continue its orbit around the sun until Christmas Eve 2026. Its next flight will see it fly past Venus in 2029."
    },
    {
        "title": "Powerful new supercomputer to be built in Scotland in government U-turn",
        "description": "A powerful new supercomputer will be built in Edinburgh after all, the chancellor has announced.&#160;",
        "url": "https://news.sky.com/story/powerful-new-supercomputer-to-be-built-in-scotland-in-government-u-turn-13382120",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jupiter-ai-supercomputer_6939265.jpg?20250611124207",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-11 11:33:00",
        "Headline": "The new supercomputer represents a \"pivotal step forward\" for the UK tech industry, according to the chief executive of Founders Forum Group.",
        "Content": "\n          Science and Technology reporter\n       A powerful new supercomputer will be built in Edinburgh after all, the chancellor has announced.  Up to £750m has been put aside for the project, Rachel Reeves revealed as part of her spending review. The Conservatives, when in government, had previously pledged £800m for the project but in August, Labour scrapped the plans, claiming it was part of \"unfunded commitments\". \"We are investing in Scotland's renewal, so working people are better off,\" said Ms Reeves on Wednesday.  On Monday, one of the leading figures in AI, the chief executive of NVIDIA, told the prime minister the UK had all the ingredients to be a leader in AI except for the infrastructure. \"You can't do machine learning without a machine. The ability to build AI supercomputers here in the UK will naturally attract more AI startups\" and create a better ecosystem, said Jensen Huang at London Tech Week. The UK is the third-largest AI market in the world and if the technology is \"fully embraced\", it could bring £47bn to the economy every year, according to the government. \n                  Did ChatGPT get the spending review right? Treasury minister gives his verdict\n                 \n                  Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts\n                 \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 This new computer, built at the University of Edinburgh, will \"give scientists from across the UK the compute power they need,\" according to the Department for Science, Innovation and Technology. It will be the most powerful in the UK and work alongside the AI research resource, which is a developing network of the UK's most powerful supercomputers.  This \"marks a pivotal step forward for the tech sector,\" Carolyn Dawson, the chief executive of Founders Forum Group and Tech Nation, told Sky News. \"The UK's AI ecosystem is brimming with talent and ambition, but to truly compete on the world stage, we need robust, future-ready infrastructure,\" she said. \"This investment in compute power is exactly what's required to accelerate innovation and secure a leading role for Britain in the global AI race.\" The resource has already been used to test millions of potential drugs virtually and speed up research into Alzheimer's vaccines and cancer treatments. \"If all the forecasts are right, the demand for compute is going to grow exponentially over the next few years,\" Laura Citron, who leads London & Partners and works on bringing international companies to the capital, told Sky News before the announcement. \"That's why it's so important that the government is investing very significantly in AI infrastructure, as well as really freeing up the planning regulations so we can get data centres built at speed.\" Read more from Sky News:'Trump's anti-migrant rhetoric boosting UK's tech industry'Musk says he 'regrets' some of his posts about TrumpNumber of Nintendo Switch 2s sold in four days revealed AI demands increasingly huge amounts of computational power because the models process vast amounts of data through billions of mathematical calculations. In order to complete those calculations quickly and accurately, powerful hardware is required, like this new supercomputer. On top of Wednesday's £750m pledge, the prime minister also announced £1bn funding on Monday to scale up the country's AI compute power by 20 times."
    },
    {
        "title": "Could Britain face a winter ice age? How temperatures could one day plummet due to climate change",
        "description": "There is a poorly understood but plausible chance winter temperatures could one day plummet in the UK even as global temperatures soar.",
        "url": "https://news.sky.com/story/could-britain-face-a-winter-ice-age-how-temperatures-could-one-day-plummet-due-to-climate-change-13382063",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-satellite-image-britain_6939322.jpg?20250611133120",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-11 09:49:00",
        "Headline": "A small but growing stash of science warns a crucial ocean current that warms Europe could one day collapse, bringing winter lows of -19C to London and Cardiff and almost -30C to Edinburgh.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n There is a poorly understood but plausible chance winter temperatures could one day plummet in the UK even as global temperatures soar. An emerging body of research has spotted the risk that climate change could weaken or even collapse a major ocean current that brings heat northwards from the Atlantic into Europe. In the absence of that warm front, Britain would be plunged into a new ice age in winter, battling frozen runways, roads, forests and farmland. Arctic sea ice would blanket much of Scotland and most of the North Sea down to East Anglia by late winter. Temperatures in London would reach lows of -19C, a staggering 16C colder than lows in the 1800s, before humans began warming the climate. That's according to a new study published today that has modelled what a collapse of the so-called \"AMOC\" (Atlantic Meridional Overturning Circulation), combined with 2C of global warming, would mean for Europe. All scientists know at this stage, more or less, is that the AMOC is less stable than previously thought. \n                  UK backs UN treaty to stop oceans becoming the 'wild west'\n                 \n                  Prince William warns world's oceans are 'diminishing before our eyes' in call for urgent action\n                 \n                  Essex set to be the home of Europe's largest low-carbon horticulture site\n                 They don't know how likely a collapse is, how quickly it could unfold, and what the precise impacts would be. What they do know, is that if it happens, it would be \"quite devastating,\" said lead author Rene van Westen, from Utrecht University in the Netherlands. \"The AMOC is currently regulating the global climate. And if this shuts down, you will get substantial and drastic climate shifts... on a planetary scale.\" It raises difficult and terrifying questions about what kind of climate we should be trying to adapt to. What is the AMOC? Snaking its way around the world, the so-called AMOC plays a crucial role in regulating both the European and global climate by circulating heat via the oceans like a conveyor belt. But as the climate warms, it dumps more freshwater in the ocean via rainfall and melting ice. This freshwater could slow down the conveyor belt to a point where the system shuts down completely. Arctic sea ice would creep much further southwards in winter, coating parts of Scandinavia and the Netherlands as well as Britain. What would an AMOC collapse do to Europe? Today's study modelled what it would mean for Europe if the world warmed by around 2C, and the AMOC collapsed. Edinburgh would in some years see cold extremes of nearly -30°C - almost 23°C colder than in the pre-industrial climate. Once a decade, there would be frost for almost half the days in a year. In Cardiff, temperatures would reach -19.6C. Meanwhile, sea levels in Europe would rise by 50cm, and rain would fall by 20%. \"The extreme winters would be like living in an ice age,\" said Professor Tim Lenton, an Exeter University scientist who also researches AMOC. But bizarrely, summer temperatures would not be affected by the AMOC weakening, resulting in cold-hot extremes more common in continental weather systems. That's because the sea ice would still melt in summer, and the effect of the 2C of warming would kick in. \"In extreme years, it would be like coming out of the freezer into a frying pan of summer heatwaves,\" added Prof Lenton. \"It is hard to over-stress how different a climate this is. Adapting to it would be a monumental challenge.\" When could this happen? The impacts suggested in this study - published in peer-reviewed journal Geophysical Research Letters - are extreme and there remains a long list of questions. Scientists don't expect the AMOC to fizzle out this century. And if the world warmed by more like 4C, the warming effect would override the cooling effect of any AMOC collapse. But Prof Richard Allan from Reading University said it is still \"important to test the ground for these unlikely but high impact possibilities, in the same way that we insure our homes against improbable calamity\". Although scientists are undecided on whether the AMOC will die out, what they do agree on is that the complexity and weirdness of the climate system is why we should mess with it as little as possible. Prof Allen added: \"Even the mere possibility of this dire storyline unfolding over coming centuries underscores the need to forensically monitor what is happening in our oceans, and to continue building momentum across all sectors of society to cut greenhouse gas emissions which are driving our climate into dangerous, uncharted territory.\""
    },
    {
        "title": "UK backs UN treaty to stop oceans becoming the 'wild west'",
        "description": "A new treaty to govern international waters  is \"tantalisingly close\" after countries - including Britain - promised to sign it into law.",
        "url": "https://news.sky.com/story/uk-backs-un-treaty-to-stop-oceans-becoming-the-wild-west-13382017",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-high-seas-treaty-un-ocean-conference_6939074.jpg?20250611103205",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-11 08:03:00",
        "Headline": "The treaty seeks to protect large parts of the world's oceans, which remain ungoverned and vulnerable to over-fishing, climate change and deep-sea mining",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A new treaty to govern international waters  is \"tantalisingly close\" after countries - including Britain - promised to sign it into law. The British government said this week that it will introduce legislation by the end of the year to ratify the UN High Seas Treaty, following a recent surge in support from other countries to do the same. At present, remote waters, which make up nearly two-thirds of the world's oceans, are largely lawless and are vulnerable to over-fishing, climate change, the threat of deep-sea mining and geo-engineering. Prince William on Sunday said protecting the planet's oceans was a challenge \"like none we have faced before\" after teaming up with Sir David Attenborough to discuss the plight of the vital resource. The High Seas Treaty was agreed by 193 countries two years ago, but cannot come into force unless 60 countries ratify it. This week at the UN Ocean Conference in Nice, France, countries ratifying it passed 50, bringing what could be the first legally binding agreement on protecting international waters a step closer.  \"The entry into force is within our sight,\" UN secretary general Antonio Guterres told reporters on Tuesday. \"We do not have a moment to lose.\" He called the ocean the \"lifeblood of our planet\", which \"feeds the soul\". \"It produces half of the oxygen we breathe, nourishes billions of people, supports hundreds of millions of jobs, and underpins global trade.\" Campaigners have called the high seas the \"wild west\" of the ocean as they are mostly ungoverned, and said a treaty could deliver protection at sea \"on a scale we've never seen before\". Chris Thorne, Greenpeace UK oceans campaigner, said: \"We're tantalisingly close to a huge moment for the planet.\" Governments that ratify the treaty could be held accountable under their own jurisdictions and at an oceans tribunal, but it would be difficult to force other countries to follow the rules, even if they agreed to the treaty. The drive comes as President Donald Trump pulls the United States and its money out of environmental projects, and as some European governments weaken green policy and overseas aid commitments. The treaty also sets out how countries would share technology, newly discovered resources and funding. It would mean decisions would have to be made collectively through negotiations, rather than by individual countries going it alone. The UK government has previously been criticised by environmentalists for dragging its heels on ratification. The Department for Environment Food and Rural Affairs (Defra) said the treaty would help conserve \"rare, valuable and important marine life of the high seas\", safeguarding them against unsustainable fishing and industrial activities.Marine minister Emma Hardy said: \"Without urgent action, [our oceans] will be irreversibly destroyed.\" During the conference, which finishes on Friday, the UK government also proposed to extend a ban on bottom trawling to more marine protected areas in English waters."
    },
    {
        "title": "4Chan being investigated by UK officials under new online safety rules",
        "description": "4Chan, an online forum notorious for its extreme content, is being investigated by UK officials over its failure to comply with new internet safety rules.&#160;",
        "url": "https://news.sky.com/story/4chan-investigated-by-uk-officials-under-new-online-safety-rules-13382069",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-4chan-app_6887973.jpg?20250611191825",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-11 09:55:00",
        "Headline": "A porn site and seven file sharing websites are also being investigated by the UK's communications regulator Ofcom.",
        "Content": "\n          Science and Technology reporter\n       4Chan, an online forum notorious for its extreme content, is being investigated by UK officials over its failure to comply with new internet safety rules.  Ofcom, the UK's communications regulator, said it had received complaints about potential illegal content on 4Chan, as it announced nine new investigations into sites that may have broken new rules. A porn site and seven file sharing websites are also being investigated. Under the new Online Safety Act, porn sites must develop strict age verification processes for users. Websites where people can see content shared by others, like 4Chan or social media, need to assess the risk of UK users encountering illegal content on their platforms. Read more: What is the Online Safety Bill? 4Chan has not submitted any such assessment, according to the regulator.  The seven file-sharing services have also been reported for the possible sharing of child sexual abuse material. Ofcom is also investigating whether porn site First Time Videos appropriately vets the age of its users. By July, sites hosting age-restricted content must have a \"robust\" age verification process in place. Read more from Sky News:Children 'blackmailed into stripping for strangers'More children than ever are not in schoolParents 'excusing poor behaviour' The rules have faced criticism from campaigners in the past for not going far enough.  Mariano Janin, whose teenage daughter Mia killed herself after being bullied online, told Sky News in April that the new rules are \"too small, too little, too slow\". In Australia, officials have taken dramatic action to try and deal with online harms for young people, and from December, under-16s will be banned from social media. In April, 4Chan suffered a major cyber attack that was described to Sky News as a \"digital turf war\" between criminals. Although the website is back online, some elements have been disabled."
    },
    {
        "title": "Nintendo reveals how many Switch 2 consoles were sold in the first four days - as stock remains low on UK shelves ",
        "description": "Nintendo has revealed how many Switch 2 consoles have been sold in the first four days since launch.",
        "url": "https://news.sky.com/story/nintendo-reveals-how-many-switch-2-consoles-were-sold-in-the-first-four-days-as-stock-remains-low-on-uk-shelves-13381956",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nintendo-switch2_6938860.jpg?20250611044457",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-11 03:14:00",
        "Headline": "Units of the Switch 2 are hard to find in the UK, with most retailers selling out within minutes of going live.",
        "Content": "Nintendo has revealed how many Switch 2 consoles have been sold in the first four days since launch. More than 3.5 million devices have flown off the shelves worldwide since 5 June - making it the most successful debut in the company's history. The Switch 2 features a larger, more responsive screen than its predecessor and new magnetic controllers, with more powerful processing and graphics performance. The new system has a GameChat feature, which enables players to voice or video chat as well as share their game screen with friends online while playing a game. Many bundles of the Switch 2 also come with the long-awaited Mario Kart World game. But they remain hard to find in the UK, with most retailers selling out within minutes of going live. Stock Informer, a website that lists availability across retailers, shows that the Switch 2 is sold out across most high street brands, with restocks expected to happen later this week. \n                  Grand Theft Auto VI release delayed\n                 \n                  BAFTA Games Awards: Full list of winners\n                 \n                  BAFTA Games Awards: Astro Bot tops leaderboard - with psychological horror close behind\n                 While some consoles appear to be available on online marketplaces such as eBay, gaming fans have been warned to be aware of scams. Read more from Sky News:Women warned about dangers of using period tracker appsCan we trust ChatGPT despite it 'hallucinating' answers? People are urged to check profiles for negative feedback and selling history, as well as whether the online marketplace offers buyer protection. Nintendo has also warned customers not to fall for phishing emails after scammers took advantage of millions of fans entering the Nintendo Japan lottery for a chance to buy a Switch 2 by sending out emails asking for personal data."
    },
    {
        "title": "Donald Trump responds after Elon Musk admitted 'regrets' over explosive row",
        "description": "Donald Trump has responded after Elon Musk said some of his recent social media posts about the US president \"went too far\". ",
        "url": "https://news.sky.com/story/donald-trump-responds-after-elon-musk-admitted-regrets-over-explosive-row-13382005",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-musk-trump_6935643.jpg?20250611101342",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-11 07:14:00",
        "Headline": "Mr Musk posted a series of tweets on X last week in a fiery exchange between the pair, including accusing the president of appearing in files relating to Jeffrey Epstein.",
        "Content": "Donald Trump has responded after Elon Musk said some of his recent social media posts about the US president \"went too far\".  The Tesla and SpaceX boss shared a series of posts on his X social media platform last week, including one which described Mr Trump's sweeping tax and spending bill as a \"disgusting abomination\". He also claimed, in a since-deleted post, that the president appeared in files relating to the disgraced paedophile financier Jeffrey Epstein. Posting on X this morning, Mr Musk said: \"I regret some of my posts about President @realDonaldTrump last week. They went too far.\" In response, the president is quoted as telling the New York Post: \"I thought it was very nice that he did that.\" The publication said it spoke to Mr Trump in a brief phone conversation.  The White House dismissed Mr Musk's Epstein claims at the time, with press secretary Karoline Leavitt saying: \"This is an unfortunate episode from Elon, who is unhappy with the One Big Beautiful Bill [a Republican tax and spending bill] because it does not include the policies he wanted. \"The president is focused on passing this historic piece of legislation and making our country great again.\" Mr Musk did not specify which posts he regretted.  In another post last Thursday, Mr Musk attacked Mr Trump's tariffs, saying they \"will cause a recession in the second half of this year\". In response, Mr Trump, in an interview with ABC News, said Mr Musk had \"lost his mind\". He also threatened to cancel government contracts with the businessman's companies and said he had asked the billionaire to leave the White House.  But yesterday, Mr Musk's father Errol Musk told Sky News' Moscow correspondent Ivor Bennett: \"It's like any argument. Everybody at some point says I'll never make up, but then they do later.\" He said the argument likely happened because of \"emotions welling out of hand\".  \"They've had five months of intense day and night, hardly any sleep, and anybody who went through that would know your nerves are pretty much shredded after that time.\" He also said his son had texted him to say: \"Don't worry, we're sorting it out.\" The spat hit Tesla shares, which closed down 14.3% last Thursday, losing about $150bn (£111bn) in value. They've since regained much of their value compared to the beginning of the month."
    },
    {
        "title": "Harvey Weinstein found guilty of criminal sexual act in New York retrial",
        "description": "Disgraced movie mogul Harvey Weinstein has been found guilty of committing a criminal sexual act in a retrial in New York.",
        "url": "https://news.sky.com/story/harvey-weinstein-found-guilty-of-criminal-sexual-act-in-new-york-retrial-13380041",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-harvey-weinstein_6935795.jpg?20250606121403",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-11 18:00:00",
        "Headline": "The case was being retried after an appeals court overturned his 2020 conviction last year.",
        "Content": "Disgraced movie mogul Harvey Weinstein has been found guilty of committing a criminal sexual act in a retrial in New York. The 73-year-old was found not guilty of another count of committing a criminal sexual act relating to a second woman. The jury has so far not recorded a verdict in relation to an allegation of rape against a third woman. Weinstein pleaded not guilty to all three charges and has denied assaulting anyone or having non-consensual sex. The case was being retried after an appeals court overturned his 2020 conviction last year. He was accused of raping aspiring actress Jessica Mann in a New York hotel room in 2013 and forcing oral sex on two other women. Two of the charges were those he faced during the original trial, while the third - one of the charges of forcing oral sex - was added last year. The partial verdict came after an extraordinary day which saw the jury foreperson ask to speak to the judge and Weinstein himself call for the trial to be halted. \"My life is on the line and you know what? It's not fair,\" the former movie mogul said. \"It's time, it's time, it's time, it's time to say this trial is over.\" He spoke before there was a verdict on any of the charges. The foreperson requested to speak to the judge about \"a situation\". The man - who had on Monday complained other jurors were pushing people to change their minds, and talking about information beyond the charges - was questioned in private, at his request. The episode was the latest sign of jurors under strain. On Friday, one asked to be excused because he felt another juror was being treated unfairly - at which point Weinstein lawyers unsuccessfully asked for a mistrial. Nearly eight years ago, a series of sexual misconduct allegations against the Oscar-winning movie producer propelled the #MeToo movement. Read more:What has happened to the #MeToo movement? Some of those accusations later generated criminal charges and convictions in New York and California. Before the retrial, Weinstein was also serving a 16-year prison sentence after being found guilty of rape in California in December 2022. He had also denied this charge."
    },
    {
        "title": "The Beach Boys co-founder Brian Wilson dies",
        "description": "Brian Wilson - the co-founder of The Beach Boys - has died at the age of 82.",
        "url": "https://news.sky.com/story/beach-boys-co-founder-brian-wilson-dies-13382290",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brian-wilson-glastonbury_6939580.jpg?20250611180431",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-11 16:50:00",
        "Headline": "Brian Wilson was the California band's visionary leader and songwriter, penning hits including Surfin' USA, Good Vibrations and God Only Knows.",
        "Content": " Brian Wilson - the co-founder of The Beach Boys - has died at the age of 82. In a statement, published on his website, his family said: \"We are heartbroken to announce that our beloved father Brian Wilson has passed away. \"We are at a loss for words right now. Please respect our privacy at this time, as our family is grieving. We realise that we are sharing our grief with the world.\" Wilson is believed to have suffered ill health in recent years, with court documents filed in 2024 saying he had \"major neurocognitive disorder (such as dementia)\". He co-founded The Beach Boys in the early 1960s with his brothers, Dennis and Carl, their cousin Mike Love and friend Al Jardine. Wilson - the eldest and last surviving of the three brothers - was their visionary leader and songwriter, penning hits including Surfin' USA, Good Vibrations, and God Only Knows. 'What a legacy he leaves' Famous faces have paid tribute to Wilson, with Rolling Stone's Ronnie Wood saying his \"world is in mourning\" following the deaths of The Beach Boys co-founder and fellow musician Sly Stone. \"So sad,\" he added. \"A complex man but a musical genius and showbusiness icon,\" Piers Morgan wrote. \"What a legacy he leaves.\" Radio 2 DJ Tony Robinson said on the X social media platform: \"So sorry to hear that Brian Wilson of the Beach Boys has passed away. So many hits, and to me it was the sound of summer. RIP Brian and thanks for the music.\" Electronic music duo Disclosure said Wilson was their \"favourite producer and composer of all time\". \"Pushed the boundaries further than anyone had before,\" they wrote in a comment on Instagram. \"Lost for words. We love you, Brian. Rest in peace to the greatest.\" Arts and entertainment editor To say Brian Wilson loomed large in my life would be an understatement. My musician father was a major fan of The Beach Boys, naming one of my brothers after one of them and playing us their tracks so often that I can't separate their back catalogue from nostalgic memories of childhood. When challenged by others for choosing America's Beach Boys over our home-grown The Beatles, Dad would wax lyrical about their harmonies and the creative genius of Wilson. But it wasn't just me who felt the influence of the not-really surfer boys (it was only Brian's brother Dennis who actually surfed, despite the songs about the sea and the photos of them posing with boards).  The album Pet Sounds is widely credited with being one of the most influential records ever, using those famous harmonies and production techniques that were so innovative at the time, which then became widely drawn on, even the norm.  They were one of the first American rock bands to play their own instruments and write their own songs. And it was Brian – not the record execs – who had creative control, paving the way for the musicians who came after him to do the same.  So while I know the impact that Brian Wilson and The Beach Boys had on my life, I also know that because of their influence, the inspiration they were and the legacy they left, that without you even knowing it, they will have impacted your life too. The Beach Boys have inspired acts on both sides of the Atlantic, with the likes of Sir Elton John, Bruce Springsteen, and Carole King lauding their work. Their 1966 album Pet Sounds, penned and produced by Wilson, was voted No.2 in a 2003 Rolling Stone list of the best 500 albums - losing only to The Beatles' Sgt. Pepper's Lonely Hearts Club. Paul McCartney has cited Pet Sounds as a direct inspiration for the Beatles, naming the ballad God Only Knows as one of his favourite songs and saying it often brings him to tears. The band's innocent appeal survived despite the group's increasingly troubled backstory. Brian, suffering from stress and exhaustion, had a breakdown in 1964 and retired from touring, choosing to instead focus on writing and recording, though he later returned to the stage. Dennis, who struggled with substance abuse and alcoholism, drowned in 1983. Carl died of lung cancer in 1998."
    }
]