[
    {
        "title": "Putin not listed in Russian delegation for talks with Ukraine in Turkey - and Trump also not attending",
        "description": "Vladimir Putin has not been listed in a Russian delegation expected to head to Turkey for ceasefire talks on Thursday with Ukraine.",
        "url": "https://news.sky.com/story/putin-not-listed-in-russian-delegation-for-talks-in-turkey-with-ukraine-13367816",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vladimir-putin-russia_6916646.jpg?20250514215246",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-14 20:35:00",
        "Headline": "President Trump had said he was \"thinking\" of going to Turkey if Vladimir Putin would be there.",
        "Content": "Vladimir Putin has not been listed in a Russian delegation expected to head to Turkey for ceasefire talks on Thursday with Ukraine. The Russian president signed an order on Wednesday detailing who would be in the group to Istanbul, including presidential aide Vladimir Medinsky, deputy foreign minister Galuzin Mikhail Yuryevich, and deputy minister of defence Alexander Fomin. On Sunday, Mr Putin had proposed direct negotiations with Ukraine over the war, to be held on Thursday \"without any preconditions\", and Ukraine's President Volodymyr Zelenskyy had called on the Russian president to meet him in Istanbul. Donald Trump will not go to Turkey to join the Russia-Ukraine talks either, a US official confirmed after Mr Putin announced the Russian delegation. The US president had said he was \"thinking\" of going to Turkey if Mr Putin would be there. Instead, his senior envoys Steve Witkoff and Keith Kellogg will travel to Istanbul, according to three sources familiar with the plans. Mr Zelenskyy was on his way to the Turkish capital of Ankara on Wednesday night, a senior Ukrainian official told Reuters. The Ukrainian president had said he would attend the talks in Istanbul, but only if Mr Putin also attended. \"I am waiting to see who will arrive from Russia and then I will determine what steps Ukraine should take. The signals in the media so far are unconvincing,\" he said in his nightly video address earlier. He said Mr Putin \"continues to strike Ukraine\", adding: \"In fact, it is now more obvious to the entire world than at any other point during the full-scale war... that the only obstacle to establishing peace is the lack of a clear will from Russia to do so.\" Read more: Here's what happened at the last summit Moscow correspondent Vladimir Medinsky, Mikhail Galuzin, Igor Kostyukov, Alexander Fomin - if those names don’t mean anything to you, that is very much the point. This is not Vladimir Putin's top team. It is not his veteran foreign minister Sergei Lavrov or negotiating heavyweight Yuri Ushakov. Instead, this is a much more junior contingent, which will make up Russia's delegation at the talks with Ukraine in Istanbul on Thursday. It is an attempt, I think, to humiliate Volodymyr Zelenskyy, who's been saying all week that he will be waiting for Mr Putin in Turkey. But the Kremlin leader isn't someone who takes kindly to ultimatums or the demands of others. He likes to be the one in charge, and publishing a list like this, at the 11th hour, is an expression of power. He won't be pushed around. Although Mr Putin's name is not on the list, it doesn't necessarily mean he's not going. The chatter on Telegram late on Wednesday was that the talks might be extended into a second day and the Russian president may show on Friday. We simply don't know at this stage. But what we do know is Mr Putin likes to be unpredictable. He likes to own the agenda. Keeping everyone guessing is a way of doing just that. The proposed meeting came after the \"coalition of the willing\" countries, including Britain, threatened Russia with fresh sanctions if it failed to take part in a 30-day ceasefire beginning on Monday. Russia effectively rejected the proposal by instead calling for direct negotiations in Istanbul with Ukraine. On Tuesday, the Institute for the Study of War said Russia is \"attempting to prolong negotiations to extract additional concessions from the United States and while making additional battlefield advances\"."
    },
    {
        "title": "Assisted dying law 'unworkable, unaffordable and naive' says partnership of UK's leading social care groups",
        "description": "A partnership of the country's leading social care and end of life organisations has told Sky News of their deep frustration at being excluded from important discussions around the assisted dying debate - describing the proposed change to the law as \"unworkable, unaffordable and naive\".",
        "url": "https://news.sky.com/story/assisted-dying-law-unworkable-unaffordable-and-naive-says-partnership-of-uks-leading-social-care-groups-13367847",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-end-of-life-assisted-dying_6916496.jpg?20250514184252",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-05-14 16:18:00",
        "Headline": "The Terminally Ill Adults (End of Life) Bill returns to the House of Commons on Friday. But a group of leading social care organisations has raised concerns over the proposed change to the law, flagging worries about coercion.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  A partnership of the country's leading social care and end of life organisations has told Sky News of their deep frustration at being excluded from important discussions around the assisted dying debate - describing the proposed change to the law as \"unworkable, unaffordable and naive\". The Coalition of Frontline Care for People Nearing the End of Life is worried about the impact of introducing assisted dying will have on their three million-strong workforce, which they say is on the frontline for delivering care to terminally ill adults. The partnership includes The Gold Standards Framework Charity (GSF), National Care Forum (NCF), British Geriatric Society (BGS), Care England (CE) and the Community Hospital Association. It submitted evidence at the committee stage of the Terminally Ill Adults (End of Life) Bill, but was not called to give evidence Professor Martin Vernon, consultant geriatrician and spokesperson for ethics and law at the British Geriatric Society, told Sky News: \"This is a huge problem for us. \"The majority of people this law will impact on are going to be older people with complex needs, and there has been virtually no engagement in the consultation process around this proposed legislation.\" Professor Vernon and his coalition colleagues are especially concerned about sick and vulnerable adults being pressured into making choices. \n                  Royal College of Psychiatrists pulls support for assisted dying bill\n                 \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 \n                  Two terminally ill adults on opposing sides of the assisted dying debate meet to share their views\n                 \"We then may see, increasingly, older people with life-limiting diagnoses like dementia, like frailty, feeling the need to opt for assisted dying or indeed feeling coerced either by their circumstances or societally,\" he added. \"This may place a heavy burden on some individuals to choose assisted dying when, actually, the creation of better alternatives - supportive care, and palliative care to enable them to have a dignified and comfortable last few years of life should be the way to go.\" Caroline Southgate, founder and managing director of home care company Doris Jones, told Sky News there was simply not enough information about the impact assisted dying would have on her staff. \"I think we are concerned that we don't have enough clarity about how we would train staff, how we support people if they make that decision,\" she said. \"At the moment, the way that the bill is presented doesn't give us enough information to know how we would deal with those issues. \"If someone chooses this route, all I need to know is what's my role, where are my boundaries?\" Mrs Southgate is also worried about her staff being accused of coercion. Because of the nature of their work, home carers build up a strong bond with the people they tend to, often seeing them multiple times a day. And sometimes, they might be the only contact their service users have. Read more:Assisted dying debate delayed after controversy over amendmentsTwo terminally ill adults meet to debate assisted dyingPlans to legalise assisted dying in Scotland pass first stage \"I think we've got lots and lots of experience of being in homes with people, dealing with families, who trust us to look after the person who needs care and support at home,\" she added. \"I need to know that we would be insured and protected should a family decide that one of our staff was accused of coercing someone, or the other way around, talking someone out of a situation. \"We really need a lot more information to make that safe for us and to make sure that our staff are really well supported.\" Katy Betz works for Mrs Southgate. She is a trained nurse originally from Germany but has lived and worked as a carer in England for over twenty years. Kate loves what she does, but echoes the same concerns expressed by her employer: Assisted dying could change the relationship she has with her service users. Driving along Southend's seafront, she explains there is little else she and her care colleagues talk about these days. \"It is important\", she says. \"Even within my friendship group, everyone has got a different opinion, a strong opinion actually. Katy says she needs more detail: \"More training, safeguarding - what do we do? Where do we go? Who needs to be informed about the client's decision? \"You are there to make their life, and their end of life, bearable and as good as possible. I can't explain how I deal with it, but I think you just have to be born to deal with it.\" Katy is on her way to see John and Brenda Barber for one of their daily visits. Brenda is 85 and John is 90. John took Brenda on their date to a jive dance in Southend. He was twenty years old and had just returned from army service in Gibraltar. Brenda was just sixteen. They have been inseparable ever since. John's arthritis makes every day tasks almost impossible, and he says if he did not have a carer like Katy, his life would be intolerable. He says: \"It's becoming increasingly difficult with different parts of my body. My wife and I are together and that's what we want. We would never want to be separated.\" There's a pause while he reflects on that thought. \"That's despite the bickering,\" he says before breaking into a mischievous laugh. The bond that is shared between Katy, John and Brenda is clear to see. They are worried that this might change irreversibly if the assisted dying law is passed. The Terminally Ill Adults (End of Life) Bill returns to the House of Commons on Friday, where it will face greater scrutiny. Earlier this week, two Royal Colleges, Physicians and Psychiatrists, withdrew support for the bill, saying it was \"not fit for purpose\". But campaigners in favour of assisted dying have told Sky News the bill includes more protections and safeguards for all dying people than any other jurisdiction where the choice is legal. Sarah Wootton, chief executive for Dignity in Dying, said: \"MPs voted by a clear majority to progress Kim Leadbeater's Bill in November because they recognised that the blanket ban on assisted dying is failing dying people and their families. \"Every year, dying people are forced to endure unbearable pain, despite good care, travel overseas to die alone, or take matters into their own hands, often dying violent and lonely deaths without support. \"This Bill - already hailed as the strongest in the world - has been strengthened even further during committee stage, with amendments accepted to involve a range of skilled professionals in every application, specific training requirements around coercion, and that assisted dying can only be discussed within the context of all end of life options.\""
    },
    {
        "title": "'Our school is destroyed': At the scene of the Kashmir mosque hit by an Indian missile strike",
        "description": "Through long, winding roads, we weave through a wonderland. A place of intense beauty, with wide valleys, rushing rivers and terraced hills. The roads are brimming with hand-painted trucks, slowed only by the occasional herd of goats stopping traffic.",
        "url": "https://news.sky.com/story/our-school-is-destroyed-at-the-scene-of-the-kashmir-mosque-hit-by-an-indian-missile-strike-13367925",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kashmir-muzaffarabad_6916679.jpg?20250514223055",
        "type": "Home",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-05-14 19:31:00",
        "Headline": "Missiles destroyed Bilal Mosque - the roof's been ripped off, there's a vast crater in the floor and a huge hole in the ceiling of the prayer room. The Indian government insist this was a terror site, but the imam of the mosque flatly denies that accusation.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  Through long, winding roads, we weave through a wonderland. A place of intense beauty, with wide valleys, rushing rivers and terraced hills. The roads are brimming with hand-painted trucks, slowed only by the occasional herd of goats stopping traffic. We're entering Pakistan-administered Kashmir, a disputed borderland at the centre of decades of conflict and at the heart of recent escalating tensions with India. We're with the Pakistan army on our way to Muzaffarabad, the provincial capital. Few thought this city would be hit in the recent round of strikes, but it was. Missiles destroyed Bilal Mosque, the roof's been ripped off, there's a vast crater in the floor and a huge hole in the ceiling of the prayer room. Jameel Akhtar is staring into the distance. His 82-year-old father Muhammad was killed in the strike. But he is able to find comfort amid the rubble. He says: \"We are Muslim. My father was martyred in this attack. That's honour for us. Revenge against India, that is the duty of our armed forces and government and we have full faith in them.\" The Indian government insist this was a terror site with links to Lashkar-e-Taiba, an Islamist group designated as a \"terrorist\" organisation by the UN Security Council. But the imam of the mosque, Khursheed Ul Hasan, flatly denies that accusation. \"This is an allegation from their side,\" he says. \"I've been here for 17 years and everybody knows me. I am the leader of this mosque. You can see I'm a normal person. I'm not a terrorist.\" What is striking is how close this mosque is to homes and schools. Across a narrow path, I meet Nimra Safeer who was sleeping next to the mosque when the strike came. She was hit in the chest with shrapnel and says she now can't sleep. She is desperate to see her government and New Delhi sit down to talk about the enduring issue that plagues this region. \"Children like me who were attacked, our education system was disturbed,\" she tells me. \"I want to say to India, whatever your issues, we need to sit down and resolve it. Pakistan wants peace and I want Pakistan to talk on the Kashmir issue.\" Read more:Fragile truce between Pakistan and India could easily unravelTrump faces criticism over Kashmir post Strongmen, religious nationalism and modern warfare in the mix But she may be waiting a long time. Islamabad sounds emboldened and hopeful after the recent clashes. But India's leader Narendra Modi is conceding nothing. He's made clear he doesn't want a third party like America trying to mediate and he's made no commitment to formal talks with Pakistan either. While the world waits to see what the diplomatic shakedown of this moment is, ordinary people on both sides fear their safety net has slipped, the threat a little deeper, a little closer, a little more dangerous now. There's strongmen, religious nationalism and modern warfare in the mix and a fragile truce. School also damaged in strike In Muzaffarabad, right opposite the mosque, is a school that was also damaged. Thankfully, the children were at home sleeping. But in the cold light of day, you can see their unease and upset. \"Our school is destroyed,\" Fatima tells me, her eyes narrowing as she speaks. \"I have so much anger. Because we study here. Our principal built this school. They built it for us. But India destroyed it.\" The recent skirmishes may have abated for now. But with them has come more animosity calcifying in these beautiful mountain ranges. India has made clear its muscular response is part of a \"new normal\" when responding to terror. Pakistan sounds like it feels it's scored a win against the odds. That's a defiant dynamic that could easily unravel. Could pressure from a third party like America signal a sudden shift in this enduring conflict? Right now, that seems unlikely. But this week has been full of surprises."
    },
    {
        "title": "Sir Keir Starmer in Albania to tackle 'revolving door' of migration",
        "description": "Sir Keir Starmer is in Albania to announce an expanded crackdown on migrant smuggling gangs in the Balkans - a key staging post on the route to Britain.",
        "url": "https://news.sky.com/story/sir-keir-starmer-in-albania-to-tackle-revolving-door-of-migration-13367900",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-prime-minister_6913971.jpg?20250512111450",
        "type": "Home",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-14 18:35:00",
        "Headline": "Working with officials in Albania is seen as a success story in stopping migration at source, partly due to the actions of the previous Conservative government which Sir Keir will build on.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Sir Keir Starmer is in Albania to announce an expanded crackdown on migrant smuggling gangs in the Balkans - a key staging post on the route to Britain. In the first official visit to the country by a UK prime minister, he hopes to reinforce this week's tough message about slashing levels of both legal and illegal migration. Sir Keir is relying on \"smashing the gangs\" as the government's policy to tackle small boat crossings, which remain at a record high this year; passing the 10,000 mark last month. Politics latest: New measures unveiled to stop prisons from running out of space But working with officials in Albania is seen as a success story in stopping migration at source, partly due to the actions of the previous Conservative government which Sir Keir will build on. In 2022, arrivals from Albania accounted for around a third of all small boat arrivals - a higher number than from any other country. Over the past three years, those numbers have been cut by 95%. The number of Albanians returned to their home country has also more than doubled to 5,294 last year, from just over 2,000 two years' earlier. \n                  Migration must be 'properly controlled' says home secretary - as sweeping reforms unveiled\n                 \n                  Day 100: Does Trump really 'run the country and the world'?\n                 \n                  Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands\n                 The prime minister will join Edi Rama, prime minister of Albania since 2013, at the Port of Durres on Thursday to see UK-backed efforts to tackle smuggling gangs and the criminal activities that fund them. A programme to detect migrants attempting to travel using fake or stolen documents will be expanded, with the UK donating new anti- forgery machines. The government will also invest a further £1m in DNA technology to detect serious criminals on the streets of the UK. Sir Keir is also expected to express concerns about a \"revolving door effect\" in which a migrant is returned home, only to evade law enforcement and leave the country again. He will support programmes in northern Albania - where migrants come from - to reintegrate young people and provide them with employment opportunities, the government said. The prime minister will announce that the joint migration taskforce, with Albania and Kosovo, signed at the end of 2022, will be expanded to include North Macedonia and Montenegro. The National Crime Agency will share intelligence with law enforcement agencies in these countries and deploy UK funded drones to detect gangsters funnelling migrants through the Western Balkans corridor and on to the UK. The countries of the Western Balkans - including Serbia, whose government signed an agreement with Sir Keir last year - have for around five years been the key corridor to Europe for migrants from the Middle East, Asia and Africa. Read more:Leaked recording reveals top Tory knew of flaws in post-Brexit planPlans to spend millions on 'forgotten neighbourhoods' Sir Keir will say: \"Global challenges need shared solutions, and the work the UK and Albania are doing together is delivering security for working people in both countries. \"Our joint work to deter, detect and return illegal migrants is further proof that intervening upstream to protect British shores and secure our borders is the right approach. \"Every step we take to tackle illegal migration overseas, cripple the criminal networks that facilitate it and stem the finance streams that fund it is delivering safer streets in the UK, and reducing the strain on taxpayer funded services.\" On Friday the prime minister will attend the European Political Community summit in the capital Tirana, a forum for European leaders to discuss security challenges in the wake of the war in Ukraine. It's expected to be a chance for the UK to discuss key points of a forthcoming defence pact with the EU and the terms of a \"reset\" of relations ahead of a summit in London next Monday."
    },
    {
        "title": "Top Tory caught admitting Brexit drawback in leaked clip",
        "description": "One of Kemi Badenoch's top team has admitted there were flaws in the plan to return illegal migrants after Brexit, Sky News can reveal.",
        "url": "https://news.sky.com/story/leaked-recording-reveals-top-tory-knew-of-flaws-in-post-brexit-plan-to-return-illegal-migrants-13367821",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chris-philp-tory-mp_6815358.jpg?20250131111755",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-05-14 15:40:00",
        "Headline": "In response tonight, the Tories insisted that Chris Philp was not saying the Tories did not have a plan for how to handle asylum seekers post Brexit.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  One of Kemi Badenoch's top team has admitted there were flaws in the plan to return illegal migrants after Brexit, Sky News can reveal. Boris Johnson repeatedly told the public that Brexit would mean taking back control of Britain's borders and migration system. Plans unveiled to ease prisons crisis - politics latest But in a leaked recording obtained by Sky News, Chris Philp, now shadow home secretary, said Britain's exit from the EU - and end of UK participation in the Dublin agreement which governs EU-wide asylum claims - meant they realised they \"can't any longer rely on sending people back to the place where they first claimed asylum\". Mr Philp appeared to suggest the scale of the problem surprised those in the Johnson government. \"When we did check it out… (we) found that about half the people crossing the Channel had claimed asylum previously elsewhere in Europe.\" In response tonight, the Tories insisted that Mr Philp was not saying the Tories did not have a plan for how to handle asylum seekers post Brexit. Mr Philp's comments from last month are a very different tone to 2020 when as immigration minister he seemed to be suggesting EU membership and the Dublin rules hampered asylum removals. In August that year, he said: \"The Dublin regulations do have a number of constraints in them, which makes returning people who should be returned a little bit harder than we would like. Of course, come the 1st of January, we'll be outside of those Dublin regulations and the United Kingdom can take a fresh approach.\" Mr Philp was also immigration minister in Mr Johnson's government so would have been following the debate closely. In public, members of the Johnson administration were claiming this would not be an issue since asylum claims would be \"inadmissible\", but gave no details on how they would actually deal with people physically arriving in the country. A Home Office source told journalists once the UK is \"no longer bound by Dublin after the transition\", then \"we will be able to negotiate our own bilateral returns agreement from the end of this year\". This did not happen immediately. In the summer of 2020, Mr Johnson's spokesman criticised the \"inflexible and rigid\" Dublin regulations, suggesting the exit from this agreement would be a welcome post-Brexit freedom. Mr Philp's comments suggest a different view in private. The remarks were made in a Zoom call, part of a regular series with all the shadow cabinet on 28 April, just before the local election. Mr Philp was asked by a member why countries like France continued to allow migrants to come to the UK. He replied: \"The migrants should claim asylum in the first safe place and that under European Union regulations, which is called the Dublin 3 regulation, the first country where they are playing asylum is the one that should process their application. \"Now, because we're out of the European Union now, we are out of the Dublin 3 regulations, and so we can't any longer rely on sending people back to the place where they first claimed asylum. When we did check it out, just before we exited the EU transitional arrangements on December the 31st, 2020, we did run some checks and found that about half the people crossing the channel had claimed asylum previously elsewhere in Europe. \"In Germany, France, Italy, Spain, somewhere like that, and therefore could have been returned. But now we're out of Dublin, we can't do that, and that's why we need to have somewhere like Rwanda that we can send these people to as a deterrent.\"  Mr Johnson announced the Rwanda plan in April 2022 - which Mr Philp casts as the successor plan - 16 months after Britain left the legal and regulatory regime of the EU, but the plan was blocked by the European Court of Human Rights. Successive Tory prime ministers failed to get any mandatory removals to Rwanda, and Sir Keir Starmer cancelled the programme on entering Downing Street last year, leaving the issue of asylum seekers from France unresolved. Speaking on Sky News last weekend, Home Secretary Yvette Cooper said there has been a 20% increase in migrant returns since Labour came to power, along with a 40% increase in illegal working raids and a 40% increase in arrests for illegal working. Read More:Jenrick's leaked plan for Tory-Reform pact2020: Johnson promises change in migrant law Britain's membership of the EU did not stop all asylum arrivals. Under the EU's Dublin regulation, under which people should be processed for asylum in the country at which they first entered the bloc. However, many EU countries where people first arrive, such as Italy, do not apply the Dublin rules. The UK is not going to be able to participate again in the Dublin agreement since that is only open to full members of the EU. Ministers have confirmed the Labour government is discussing a returns agreement with the French that would involve both countries exchanging people seeking asylum. Asked on Sky News about how returns might work in future, the transport minister Lilian Greenwood said on Wednesday there were \"discussions ongoing with the French government\", but did not say what a future deal could look like. She told Sky News: \"It's not a short-term issue. This is going to take really hard work to tackle those organised gangs that are preying on people, putting their lives in danger as they try to cross the Channel to the UK. \"Of course, that's going to involve conversations with our counterparts on the European continent.\" Pressed on the returns agreement, Ms Greenwood said: \"I can confirm that there are discussions ongoing with the French government about how we stop this appalling and dangerous trade in people that's happening across the English Channel.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 A Conservative Party spokesman said: \"The Conservative Party delivered on the democratic will of this country, and left the European Union. \"The last government did have a plan and no one - including Chris - has ever suggested otherwise. \"We created new deals with France to intercept migrants, signed returns agreements with many countries across Europe, including a landmark agreement with Albania that led to small boat crossings falling by a third in 2023, and developed the Rwanda deterrent - a deterrent that Labour scrapped, leading to 2025 so far being the worst year ever for illegal channel crossings. \"However, Kemi Badenoch and Chris Philp have been clear that the Conservatives must do a lot more to tackle illegal migration. \"It is why, under new leadership, we are developing g new policies that will put an end to this problem - including disapplying the Human Rights Act from immigration matters, establishing a removals deterrent and deporting all foreign criminals.\""
    },
    {
        "title": "Body found in search for missing 16-year-old boy in North Wales",
        "description": "A body has been found in the search for a 16-year-old boy missing in North Wales.",
        "url": "https://news.sky.com/story/body-found-in-search-for-missing-16-year-old-boy-in-north-wales-13367598",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wales-llandudno_6913888.jpg?20250512093642",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-14 09:41:00",
        "Headline": "The teenager, named only as Athrun, was on holiday from South Gloucestershire and was last seen on a beach in Llandudno on Saturday afternoon.",
        "Content": "A body has been found in the search for a 16-year-old boy missing in North Wales. The teenager, named only as Athrun, was on holiday from South Gloucestershire and was last seen on West Shore Beach in Llandudno, Conwy, at around 2pm on Saturday wearing a pair of swimming shorts. Police said a body was \"potentially\" spotted in the sea off Llandudno during air searches on Tuesday evening, prompting searches of the water by the coastguard and other teams on Tuesday night and early Wednesday morning. \"Multi-agency\" searches, including by the National Police Air Service (NPAS), resumed on Wednesday evening in the West Shore area. North Wales Police said a body was recovered at 6.20pm. Formal identification is yet to take place, but Athrun's family have been informed and are being supported by officers. The death is not being treated as suspicious, and the coroner has been informed. \n                  Assisted dying law 'unworkable, unaffordable and naive' says partnership of UK's leading social care groups\n                 \n                  Sir Keir Starmer in Albania to tackle 'revolving door' of migration\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 Chief Inspector Trystan Bevan said: \"My deepest condolences remain with Athrun's family, and I would ask for their privacy to be respected at this incredibly sad and difficult time. \"This is not the outcome anyone hoped for, and I would once again like to thank partner agencies and members of the public for their overwhelming support and tireless assistance with the searches over the last five days.\""
    },
    {
        "title": "British teenager arrested on drug trafficking charges in Georgia after going missing in Thailand",
        "description": "A British teenager has been arrested in Georgia on suspicion of drug trafficking after she went missing in Thailand.",
        "url": "https://news.sky.com/story/british-teenager-arrested-on-drug-trafficking-charges-in-georgia-after-going-missing-in-thailand-13367865",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-georgia-drugs-arrest_6916505.jpg?20250514185947",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-14 17:04:00",
        "Headline": "Georgia's interior ministry says an 18-year-old British citizen was arrested at Tbilisi international airport while attempting to smuggle 12kg of cannabis and 2kg of hashish, a cannabis concentrate.",
        "Content": "A British teenager has been arrested in Georgia on suspicion of drug trafficking after she went missing in Thailand. Georgia's interior ministry said an 18-year-old British citizen was arrested at Tbilisi international airport while attempting to smuggle 12kg of cannabis and 2kg of hashish, a cannabis concentrate, into the country. She could face up to 20 years or life in prison if she is convicted. Police footage showed sealed packages the teenager was allegedly attempting to smuggle into Georgia. It also showed her handcuffed as she was brought to a police station in Tbilisi. Police said she had been charged with the illegal possession of drugs, as well as smuggling them into the country. The 18-year-old appeared at a court in the capital city Tbilisi for a hearing on pre-trial detention on Tuesday. \n                  Former Manchester City footballer sworn in as Georgia's president\n                 \n                  Twelve people die from 'carbon monoxide poisoning' at ski resort\n                 \n                  Imedi TV: Popular Georgian television channel owned by UK firm is 'Russian propaganda arm', MP claims\n                 Georgian media said the suspect told the court she was pregnant but did not answer the judge's questions about the drug allegations. The prosecutor's office has said an investigation is under way to identify any possible accomplices. Cleveland Police in the UK said it had confirmation an 18-year-old woman from Billingham had been arrested in Georgia on suspicion of drugs offences and she remains in custody. The force had previously said she had gone missing and was believed to be in Thailand. A spokesperson for the Foreign Office said: \"We are supporting the family of a British woman who is detained in Georgia and are in contact with the local authorities.\""
    },
    {
        "title": "Cassie breaks down in tears during Sean 'Diddy' Combs trial as she tells of 'personal shame' and alleged rape",
        "description": "Cassie Ventura broke down in tears in court as she described her \"personal shame\" at taking part in \"freak off\" sex sessions for Sean Combs - and also accused him of raping her as their relationship came to an end.",
        "url": "https://news.sky.com/story/cassie-breaks-down-in-tears-during-sean-diddy-combs-trial-as-she-tells-of-personal-shame-and-alleged-rape-13368007",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-casandra-ventura_6916755.jpg?20250514231511",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-14 21:49:00",
        "Headline": "At one point, the courtroom hearing Sean Combs's trial in Manhattan, New York, fell silent as sexually explicit images from \"freak offs\" were shown to jurors, but kept private from the public gallery. These included images of Cassie Ventura and escorts.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Cassie Ventura broke down in tears in court as she described her \"personal shame\" at taking part in \"freak off\" sex sessions for Sean Combs - and also accused him of raping her as their relationship came to an end. During her second day of testimony, the singer and model told jurors of several alleged violent incidents and said the hip-hop mogul, who was known as Puff Daddy and Diddy throughout his career, blackmailed her with compromising videos. At one point, the courtroom in Manhattan, New York, fell silent as sexually explicit images from \"freak offs\" were shown to jurors, but kept private from the public gallery. These included images of Ms Ventura and escorts. Combs asked his lawyer Marc Agnifilo to see a binder of the images, and thumbed through it for a few moments before handing it back. Sean 'Diddy' Combs trial: Day 3 - As it happened The 55-year-old, once one of the most powerful men in the music industry, has pleaded not guilty to charges of sex-trafficking, racketeering conspiracy, and transportation to engage in prostitution. Prosecutors allege he used his fame and fortune to coerce Ms Ventura and other women into abusive sex sessions with escorts. His lawyers have conceded he could be violent, but argue that all sexual encounters were consensual and he never veered into sex trafficking and racketeering. Ms Ventura, who is heavily pregnant with her third child, kept calm and composed for most of her evidence on Wednesday, but broke down at the end of the day when asked why she had chosen to testify. \"I can't carry this anymore,\" she told the court. \"I can't carry the shame, the guilt, the way he treated people like they were disposable. What's right is right, what's wrong is wrong. I came here to do the right thing.\" Early in 2023, she said she started suffering from \"flashbacks\" and had suicidal thoughts, so went to rehab and trauma therapy. It is \"impossible to know\" how many \"freak offs\" she participated in, but it was in the hundreds, she told the court. Asked if she has been involved in any since ending the relationship in 2018, she replied: \"No.\" Ms Ventura, 38, alleged that Combs raped her at her home in Los Angeles, after she told him she was ending things. \"I just remember crying and saying no, but it was very fast,\" she said, her voice trailing off. She told jurors she did have consensual sex with the rapper on a subsequent occasion. \"We'd been together for over 10 years. You just don't turn feelings off,\" she said. Ms Ventura sued Combs in November 2023, and settled within 24 hours. She received £20m, the trial was told. Combs 'threatened Cassie and Kid Cudi' Ms Ventura's second day of testimony also included details of how she briefly dated Scott Mescudi, better known as singer and rapper Kid Cudi, during a low point in her relationship with Combs in 2011. Combs lunged at her with a corkscrew and kicked her in the back when he found out, jurors heard, and threatened to blow up Mescudi's car. These allegations were also detailed in her lawsuit, which alleged his car did \"explode in his driveway\" around this time. During several hours on the stand, Ms Ventura told how she hid the extent of Comb's alleged violence from loved ones, and described one incident when she allegedly suffered a \"pretty significant gash\" above her left eye after he threw her into a bed frame. Rather than go to hospital, his security staff took her to a plastic surgeon in Beverly Hills, she said. The hotel CCTV 'attack'  An incident at a hotel in Los Angeles in March 2016, which has come up several times during the trial already, was also discussed again. CCTV from the hotel, which was first released by CNN in May 2024, showed Combs allegedly beating Ms Ventura in a hallway. Jurors were shown photos of her with a swollen lip following the incident as she testified. She said a friend of hers saw her injuries and was \"super upset\" because she'd \"seen me with black eyes and busted lips before\". She also spoke about a trip to Cannes in 2013, after which she said the rapper began playing a recording of a \"freak off\" on his laptop on a commercial flight to New York, with other people around them - telling her he was \"going to embarrass me and release them\". Read more:The rise and fall of DiddyDiddy - a timeline of allegationsEverything you need to know about the trial Asked if the freak offs impacted her health, Ms Ventura said she had stomach problems and frequently developed urinary tract infections. She was also affected mentally, she told the court, saying they made her feel \"really empty\" and \"gross\". Throughout her testimony, Ms Ventura has maintained she never wanted to have sexual experiences with other people but did it at first to please the man she loved, and later out of fear. She was 22 and inexperienced when she started dating Combs, who was 17 years older, she said. The trial continues with cross-examination of Ms Ventura from the defence tomorrow."
    },
    {
        "title": "Man suspected of Huyton double stabbing shot by police",
        "description": "A man suspected of stabbing two people in Merseyside has been shot by armed police.",
        "url": "https://news.sky.com/story/man-suspected-of-huyton-double-stabbing-shot-by-police-13367984",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-car-police-tape_6916669.jpg?20250514222100",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-14 21:00:00",
        "Headline": "Armed officers responded to reports that a man and a woman had been stabbed in Huyton late on Wednesday afternoon.",
        "Content": "A man suspected of stabbing two people in Merseyside has been shot by armed police. Officers were called to a report that a man and woman had been stabbed in the Tobruk Road area of Huyton, near Liverpool at 4.25pm on Wednesday. Armed response officers arrived soon after and the suspect was shot by officers, Merseyside Police said. The suspect was taken to hospital for treatment, along with the two people who were hurt. They are in a serious but stable condition, the force said.  An investigation, including house-to-house and CCTV inquiries, is under way. Officers remained at the scene and the road was cordoned off. The Independent Office for Police Conduct (IOPC) has been informed, as is standard procedure in these circumstances, Merseyside Police said, and the watchdog has opened an independent investigation. Detective Superintendent Paul Speight said local people will be shocked by what he called \"an isolated incident\". Officers are not looking for anyone else, he said, adding all people involved \"have been taken to hospital to be assessed for their various injuries\". The force will fully co-operate with the IOPC, he added. Read more:Top Tory knew of flaws in post-Brexit planMen's prisons could run out of space 'in months' An IOPC spokesperson said it had begun gathering evidence after opening enquiries shortly before 7pm. \"We have sent investigators to attend the police post incident procedures,\" they said. \"Our investigation is in its initial stages and no further information is available at this time.\""
    },
    {
        "title": "Canadians 'not impressed' by UK's invitation to Trump, Mark Carney tells Sky News",
        "description": "Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News.",
        "url": "https://news.sky.com/story/canadians-werent-impressed-by-second-uk-state-visit-for-trump-mark-carney-says-13367469",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mark-carney-canada_6915777.jpg?20250514074709",
        "type": "Home",
        "Author": "Samantha Washington",
        "Date Published": "2025-05-14 04:14:00",
        "Headline": "Canada's newly elected prime minister sat down with Sky News' Sam Washington to discuss dealing with a noisy neighbour in Donald Trump and Canada's relationship to the UK.",
        "Content": "\n          Presenter\n        Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News. Sir Keir Starmer handed the invitation to the US president during a visit to the Oval Office. The newly elected Liberal leader Mark Carney said that the invitation \"cut across clear messages\" that the Canadian government was trying to send to the White House in response to their threats against Canada's sovereignty. \"I think, to be frank, they [Canadians] weren't impressed by that gesture... given the circumstance. It was at a time when we were being quite clear about the issues around sovereignty.\" Explained: Who is Mark Carney? It comes as the Canadian prime minister has invited the King, who is Canada's head of state, to open its parliament later this month in a \"clear message of sovereignty\". It is the first time the sovereign has carried out this function in nearly 50 years and Mr Carney says it's \"not coincidental\". \n                  King left as 'piggy in the middle' over Canada-US stand-off\n                 \n                  Mark Carney's body language during his Trump meeting spoke volumes\n                 \n                  Did Trump just win the election for Canada's Mark Carney?\n                 \"All issues around Canada's sovereignty have been accentuated by the president. So no, it's not coincidental, but it is also a reaffirming moment for Canadians.\" The former Bank of England governor was re-elected after a campaign fought on the promise of standing up to American threats to Canadian statehood. He had refused to speak to Mr Trump until Canadian sovereignty was respected.  It followed Mr Trump threatening to make Canada the 51st state of the US. Mr Carney justified making his first foreign trip as prime minister to the White House by stating Mr Trump had changed his intentions to annex Canada from an \"expectation to a desire\". \"He was expressing a desire. He'd shifted from the expectation to a desire. He was also coming from a place where he recognised that that wasn't going to happen. \"Does he still muse about it? Perhaps. Is it ever going to happen? No. Never.\" The high-stakes meeting in the Oval Office was not confrontational, with Mr Carney praising the president's approach as \"very on top of the essence of a wide range of issues\" and \"able to identify the points of maximum leverage, both in a specific situation but also in a geopolitical situation\". Presenter Fractured geopolitical relations have produced an interesting phenomenon: two Commonwealth nations both deploying their head of state, King Charles, to manage the vagaries of Donald Trump. For Canada, and its new prime minister, Mark Carney, the King is being unveiled at the opening of Parliament in Ottawa later this month as an unequivocal spectacle and symbol of sovereignty. For the UK, Sir Keir Starmer is positioning the monarch as a bridge and has proffered a personal invitation from King Charles to the president for an unprecedented second state visit in order to facilitate negotiations over trade and tariffs. This instrumentalisation of the crown, which ordinarily transcends politics, has created tension between the historically close allies. Canadians view the UK's red carpet treatment of a leader who is openly threatening their sovereignty as a violation of Commonwealth solidarity, while the British seem to have no compunction in engaging in high-level realpolitik. The episode is emblematic of how pervasive disruptive American influence is and how extreme measures taken to combat it can aggravate even the most enduring alliances. Since the meeting, tensions between the two countries have abated.  Further negotiations on trade and security are expected soon. Given the deep economic integration of the two nations, neither side expects a deal imminently, but both sides concur that constructive talks have led to progress on an agreement. With greater goodwill between the two North American neighbours, Mr Carney also expressed optimism about Mr Trump's efforts to broker peace between Ukraine and Russia. The prime minister confirmed his view that the president was an \"honest broker\" and that his counterpart had been \"helpful\" in bringing momentum to a 30-day ceasefire between the warring nations. Despite a reset in relations between the United States and Canada, Mr Carney remained circumspect. His motto is: \"Always plan for the worst.\" Read more from Sky News:Trump signs deals in Saudi Arabia - with murder long forgottenMenendez brothers' murder sentences reduced And to that end, nothing is being taken for granted: \"We do plan for having no deal, we do plan for trouble in the security relationship. We do plan for the global trading system not being reassembled: that's the way to approach this president.\""
    },
    {
        "title": "Assisted dying law 'unworkable, unaffordable and naive' says partnership of UK's leading social care groups",
        "description": "A partnership of the country's leading social care and end of life organisations has told Sky News of their deep frustration at being excluded from important discussions around the assisted dying debate - describing the proposed change to the law as \"unworkable, unaffordable and naive\".",
        "url": "https://news.sky.com/story/assisted-dying-law-unworkable-unaffordable-and-naive-says-partnership-of-uks-leading-social-care-groups-13367847",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-end-of-life-assisted-dying_6916496.jpg?20250514184252",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-05-14 16:18:00",
        "Headline": "The Terminally Ill Adults (End of Life) Bill returns to the House of Commons on Friday. But a group of leading social care organisations has raised concerns over the proposed change to the law, flagging worries about coercion.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  A partnership of the country's leading social care and end of life organisations has told Sky News of their deep frustration at being excluded from important discussions around the assisted dying debate - describing the proposed change to the law as \"unworkable, unaffordable and naive\". The Coalition of Frontline Care for People Nearing the End of Life is worried about the impact of introducing assisted dying will have on their three million-strong workforce, which they say is on the frontline for delivering care to terminally ill adults. The partnership includes The Gold Standards Framework Charity (GSF), National Care Forum (NCF), British Geriatric Society (BGS), Care England (CE) and the Community Hospital Association. It submitted evidence at the committee stage of the Terminally Ill Adults (End of Life) Bill, but was not called to give evidence Professor Martin Vernon, consultant geriatrician and spokesperson for ethics and law at the British Geriatric Society, told Sky News: \"This is a huge problem for us. \"The majority of people this law will impact on are going to be older people with complex needs, and there has been virtually no engagement in the consultation process around this proposed legislation.\" Professor Vernon and his coalition colleagues are especially concerned about sick and vulnerable adults being pressured into making choices. \n                  Royal College of Psychiatrists pulls support for assisted dying bill\n                 \n                  Plans to legalise assisted dying in Scotland pass first stage\n                 \n                  Two terminally ill adults on opposing sides of the assisted dying debate meet to share their views\n                 \"We then may see, increasingly, older people with life-limiting diagnoses like dementia, like frailty, feeling the need to opt for assisted dying or indeed feeling coerced either by their circumstances or societally,\" he added. \"This may place a heavy burden on some individuals to choose assisted dying when, actually, the creation of better alternatives - supportive care, and palliative care to enable them to have a dignified and comfortable last few years of life should be the way to go.\" Caroline Southgate, founder and managing director of home care company Doris Jones, told Sky News there was simply not enough information about the impact assisted dying would have on her staff. \"I think we are concerned that we don't have enough clarity about how we would train staff, how we support people if they make that decision,\" she said. \"At the moment, the way that the bill is presented doesn't give us enough information to know how we would deal with those issues. \"If someone chooses this route, all I need to know is what's my role, where are my boundaries?\" Mrs Southgate is also worried about her staff being accused of coercion. Because of the nature of their work, home carers build up a strong bond with the people they tend to, often seeing them multiple times a day. And sometimes, they might be the only contact their service users have. Read more:Assisted dying debate delayed after controversy over amendmentsTwo terminally ill adults meet to debate assisted dyingPlans to legalise assisted dying in Scotland pass first stage \"I think we've got lots and lots of experience of being in homes with people, dealing with families, who trust us to look after the person who needs care and support at home,\" she added. \"I need to know that we would be insured and protected should a family decide that one of our staff was accused of coercing someone, or the other way around, talking someone out of a situation. \"We really need a lot more information to make that safe for us and to make sure that our staff are really well supported.\" Katy Betz works for Mrs Southgate. She is a trained nurse originally from Germany but has lived and worked as a carer in England for over twenty years. Kate loves what she does, but echoes the same concerns expressed by her employer: Assisted dying could change the relationship she has with her service users. Driving along Southend's seafront, she explains there is little else she and her care colleagues talk about these days. \"It is important\", she says. \"Even within my friendship group, everyone has got a different opinion, a strong opinion actually. Katy says she needs more detail: \"More training, safeguarding - what do we do? Where do we go? Who needs to be informed about the client's decision? \"You are there to make their life, and their end of life, bearable and as good as possible. I can't explain how I deal with it, but I think you just have to be born to deal with it.\" Katy is on her way to see John and Brenda Barber for one of their daily visits. Brenda is 85 and John is 90. John took Brenda on their date to a jive dance in Southend. He was twenty years old and had just returned from army service in Gibraltar. Brenda was just sixteen. They have been inseparable ever since. John's arthritis makes every day tasks almost impossible, and he says if he did not have a carer like Katy, his life would be intolerable. He says: \"It's becoming increasingly difficult with different parts of my body. My wife and I are together and that's what we want. We would never want to be separated.\" There's a pause while he reflects on that thought. \"That's despite the bickering,\" he says before breaking into a mischievous laugh. The bond that is shared between Katy, John and Brenda is clear to see. They are worried that this might change irreversibly if the assisted dying law is passed. The Terminally Ill Adults (End of Life) Bill returns to the House of Commons on Friday, where it will face greater scrutiny. Earlier this week, two Royal Colleges, Physicians and Psychiatrists, withdrew support for the bill, saying it was \"not fit for purpose\". But campaigners in favour of assisted dying have told Sky News the bill includes more protections and safeguards for all dying people than any other jurisdiction where the choice is legal. Sarah Wootton, chief executive for Dignity in Dying, said: \"MPs voted by a clear majority to progress Kim Leadbeater's Bill in November because they recognised that the blanket ban on assisted dying is failing dying people and their families. \"Every year, dying people are forced to endure unbearable pain, despite good care, travel overseas to die alone, or take matters into their own hands, often dying violent and lonely deaths without support. \"This Bill - already hailed as the strongest in the world - has been strengthened even further during committee stage, with amendments accepted to involve a range of skilled professionals in every application, specific training requirements around coercion, and that assisted dying can only be discussed within the context of all end of life options.\""
    },
    {
        "title": "Sir Keir Starmer in Albania to tackle 'revolving door' of migration",
        "description": "Sir Keir Starmer is in Albania to announce an expanded crackdown on migrant smuggling gangs in the Balkans - a key staging post on the route to Britain.",
        "url": "https://news.sky.com/story/sir-keir-starmer-in-albania-to-tackle-revolving-door-of-migration-13367900",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-prime-minister_6913971.jpg?20250512111450",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-14 18:35:00",
        "Headline": "Working with officials in Albania is seen as a success story in stopping migration at source, partly due to the actions of the previous Conservative government which Sir Keir will build on.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Sir Keir Starmer is in Albania to announce an expanded crackdown on migrant smuggling gangs in the Balkans - a key staging post on the route to Britain. In the first official visit to the country by a UK prime minister, he hopes to reinforce this week's tough message about slashing levels of both legal and illegal migration. Sir Keir is relying on \"smashing the gangs\" as the government's policy to tackle small boat crossings, which remain at a record high this year; passing the 10,000 mark last month. Politics latest: New measures unveiled to stop prisons from running out of space But working with officials in Albania is seen as a success story in stopping migration at source, partly due to the actions of the previous Conservative government which Sir Keir will build on. In 2022, arrivals from Albania accounted for around a third of all small boat arrivals - a higher number than from any other country. Over the past three years, those numbers have been cut by 95%. The number of Albanians returned to their home country has also more than doubled to 5,294 last year, from just over 2,000 two years' earlier. \n                  Migration must be 'properly controlled' says home secretary - as sweeping reforms unveiled\n                 \n                  Day 100: Does Trump really 'run the country and the world'?\n                 \n                  Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands\n                 The prime minister will join Edi Rama, prime minister of Albania since 2013, at the Port of Durres on Thursday to see UK-backed efforts to tackle smuggling gangs and the criminal activities that fund them. A programme to detect migrants attempting to travel using fake or stolen documents will be expanded, with the UK donating new anti- forgery machines. The government will also invest a further £1m in DNA technology to detect serious criminals on the streets of the UK. Sir Keir is also expected to express concerns about a \"revolving door effect\" in which a migrant is returned home, only to evade law enforcement and leave the country again. He will support programmes in northern Albania - where migrants come from - to reintegrate young people and provide them with employment opportunities, the government said. The prime minister will announce that the joint migration taskforce, with Albania and Kosovo, signed at the end of 2022, will be expanded to include North Macedonia and Montenegro. The National Crime Agency will share intelligence with law enforcement agencies in these countries and deploy UK funded drones to detect gangsters funnelling migrants through the Western Balkans corridor and on to the UK. The countries of the Western Balkans - including Serbia, whose government signed an agreement with Sir Keir last year - have for around five years been the key corridor to Europe for migrants from the Middle East, Asia and Africa. Read more:Leaked recording reveals top Tory knew of flaws in post-Brexit planPlans to spend millions on 'forgotten neighbourhoods' Sir Keir will say: \"Global challenges need shared solutions, and the work the UK and Albania are doing together is delivering security for working people in both countries. \"Our joint work to deter, detect and return illegal migrants is further proof that intervening upstream to protect British shores and secure our borders is the right approach. \"Every step we take to tackle illegal migration overseas, cripple the criminal networks that facilitate it and stem the finance streams that fund it is delivering safer streets in the UK, and reducing the strain on taxpayer funded services.\" On Friday the prime minister will attend the European Political Community summit in the capital Tirana, a forum for European leaders to discuss security challenges in the wake of the war in Ukraine. It's expected to be a chance for the UK to discuss key points of a forthcoming defence pact with the EU and the terms of a \"reset\" of relations ahead of a summit in London next Monday."
    },
    {
        "title": "Top Tory caught admitting Brexit drawback in leaked clip",
        "description": "One of Kemi Badenoch's top team has admitted there were flaws in the plan to return illegal migrants after Brexit, Sky News can reveal.",
        "url": "https://news.sky.com/story/leaked-recording-reveals-top-tory-knew-of-flaws-in-post-brexit-plan-to-return-illegal-migrants-13367821",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chris-philp-tory-mp_6815358.jpg?20250131111755",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-05-14 15:40:00",
        "Headline": "In response tonight, the Tories insisted that Chris Philp was not saying the Tories did not have a plan for how to handle asylum seekers post Brexit.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  One of Kemi Badenoch's top team has admitted there were flaws in the plan to return illegal migrants after Brexit, Sky News can reveal. Boris Johnson repeatedly told the public that Brexit would mean taking back control of Britain's borders and migration system. Plans unveiled to ease prisons crisis - politics latest But in a leaked recording obtained by Sky News, Chris Philp, now shadow home secretary, said Britain's exit from the EU - and end of UK participation in the Dublin agreement which governs EU-wide asylum claims - meant they realised they \"can't any longer rely on sending people back to the place where they first claimed asylum\". Mr Philp appeared to suggest the scale of the problem surprised those in the Johnson government. \"When we did check it out… (we) found that about half the people crossing the Channel had claimed asylum previously elsewhere in Europe.\" In response tonight, the Tories insisted that Mr Philp was not saying the Tories did not have a plan for how to handle asylum seekers post Brexit. Mr Philp's comments from last month are a very different tone to 2020 when as immigration minister he seemed to be suggesting EU membership and the Dublin rules hampered asylum removals. In August that year, he said: \"The Dublin regulations do have a number of constraints in them, which makes returning people who should be returned a little bit harder than we would like. Of course, come the 1st of January, we'll be outside of those Dublin regulations and the United Kingdom can take a fresh approach.\" Mr Philp was also immigration minister in Mr Johnson's government so would have been following the debate closely. In public, members of the Johnson administration were claiming this would not be an issue since asylum claims would be \"inadmissible\", but gave no details on how they would actually deal with people physically arriving in the country. A Home Office source told journalists once the UK is \"no longer bound by Dublin after the transition\", then \"we will be able to negotiate our own bilateral returns agreement from the end of this year\". This did not happen immediately. In the summer of 2020, Mr Johnson's spokesman criticised the \"inflexible and rigid\" Dublin regulations, suggesting the exit from this agreement would be a welcome post-Brexit freedom. Mr Philp's comments suggest a different view in private. The remarks were made in a Zoom call, part of a regular series with all the shadow cabinet on 28 April, just before the local election. Mr Philp was asked by a member why countries like France continued to allow migrants to come to the UK. He replied: \"The migrants should claim asylum in the first safe place and that under European Union regulations, which is called the Dublin 3 regulation, the first country where they are playing asylum is the one that should process their application. \"Now, because we're out of the European Union now, we are out of the Dublin 3 regulations, and so we can't any longer rely on sending people back to the place where they first claimed asylum. When we did check it out, just before we exited the EU transitional arrangements on December the 31st, 2020, we did run some checks and found that about half the people crossing the channel had claimed asylum previously elsewhere in Europe. \"In Germany, France, Italy, Spain, somewhere like that, and therefore could have been returned. But now we're out of Dublin, we can't do that, and that's why we need to have somewhere like Rwanda that we can send these people to as a deterrent.\"  Mr Johnson announced the Rwanda plan in April 2022 - which Mr Philp casts as the successor plan - 16 months after Britain left the legal and regulatory regime of the EU, but the plan was blocked by the European Court of Human Rights. Successive Tory prime ministers failed to get any mandatory removals to Rwanda, and Sir Keir Starmer cancelled the programme on entering Downing Street last year, leaving the issue of asylum seekers from France unresolved. Speaking on Sky News last weekend, Home Secretary Yvette Cooper said there has been a 20% increase in migrant returns since Labour came to power, along with a 40% increase in illegal working raids and a 40% increase in arrests for illegal working. Read More:Jenrick's leaked plan for Tory-Reform pact2020: Johnson promises change in migrant law Britain's membership of the EU did not stop all asylum arrivals. Under the EU's Dublin regulation, under which people should be processed for asylum in the country at which they first entered the bloc. However, many EU countries where people first arrive, such as Italy, do not apply the Dublin rules. The UK is not going to be able to participate again in the Dublin agreement since that is only open to full members of the EU. Ministers have confirmed the Labour government is discussing a returns agreement with the French that would involve both countries exchanging people seeking asylum. Asked on Sky News about how returns might work in future, the transport minister Lilian Greenwood said on Wednesday there were \"discussions ongoing with the French government\", but did not say what a future deal could look like. She told Sky News: \"It's not a short-term issue. This is going to take really hard work to tackle those organised gangs that are preying on people, putting their lives in danger as they try to cross the Channel to the UK. \"Of course, that's going to involve conversations with our counterparts on the European continent.\" Pressed on the returns agreement, Ms Greenwood said: \"I can confirm that there are discussions ongoing with the French government about how we stop this appalling and dangerous trade in people that's happening across the English Channel.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 A Conservative Party spokesman said: \"The Conservative Party delivered on the democratic will of this country, and left the European Union. \"The last government did have a plan and no one - including Chris - has ever suggested otherwise. \"We created new deals with France to intercept migrants, signed returns agreements with many countries across Europe, including a landmark agreement with Albania that led to small boat crossings falling by a third in 2023, and developed the Rwanda deterrent - a deterrent that Labour scrapped, leading to 2025 so far being the worst year ever for illegal channel crossings. \"However, Kemi Badenoch and Chris Philp have been clear that the Conservatives must do a lot more to tackle illegal migration. \"It is why, under new leadership, we are developing g new policies that will put an end to this problem - including disapplying the Human Rights Act from immigration matters, establishing a removals deterrent and deporting all foreign criminals.\""
    },
    {
        "title": "Neo-Nazi extremists guilty of planning terror attack on mosque",
        "description": "Three neo-Nazis who stockpiled weapons including a 3D-printed assault rifle are facing \"substantial\" prison sentences after they were found guilty of plotting a terrorist attack on a mosque in Leeds.",
        "url": "https://news.sky.com/story/neo-nazi-extremists-guilty-of-planning-terror-attack-on-mosque-13367777",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-right-wing-terror-attack_6916327.jpg?20250514160251",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-05-14 14:27:00",
        "Headline": "Counter-terrorism police found an arsenal of over 200 weapons that included crossbows, swords, machetes, axes, a baseball bat and numerous hunting knives, following raids on properties in Yorkshire, Derbyshire and Staffordshire.",
        "Content": "By Duncan Gardham, security journalist  Three neo-Nazis who stockpiled weapons including a 3D-printed assault rifle are facing \"substantial\" prison sentences after they were found guilty of plotting a terrorist attack on a mosque in Leeds. Counter-terrorism police found an arsenal of more than 200 weapons that included crossbows, swords, machetes, axes, a baseball bat and numerous hunting knives, following raids on properties in Yorkshire, Derbyshire and Staffordshire. An almost completed FGC-9 Mk II printed assault rifle was found in the loft of one of the suspects. It was missing the barrel and firing pin but the men were sourcing the components to complete the weapon. The three men had a shared interest in bushcraft and YouTube \"prepper\" videos, claiming in court they were preparing for a \"shit hits the fan\" scenario such as a Russian invasion or a zombie apocalypse. However, prosecutors said they were actually preparing for a race war and had used the prepper groups to recruit an inner circle which moved on to neo-Nazi chat groups before setting up their own private group, as they prepared to take action. Detective Chief Superintendent James Dunkerley, head of Counter-Terrorism Policing North East, said the \"self-styled militant online group\" espoused \"vile racist views\" and took \"real world steps to plan and prepare for carrying out an attack on innocent citizens\". Bethan David, head of the Crown Prosecution Service's Counter-Terrorism Division, said that the 3D-printed firearm \"could have been used to devastating consequences\" if it had been completed. \n                  Assisted dying law 'unworkable, unaffordable and naive' says partnership of UK's leading social care groups\n                 \n                  Sir Keir Starmer in Albania to tackle 'revolving door' of migration\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 The group was infiltrated by an undercover officer and on 5 January last year, Brogan Stewart messaged the officer on the encrypted Telegram app, telling him he was disillusioned with other far-right groups that just \"sit around and talk\". \"I want to get my own group together because action speaks louder than words,\" he added. Stewart, 25, from Tingley, Wakefield, appointed Christopher Ringrose, 34, from Cannock, Staffordshire, who had constructed the 3D firearm, and Marco Pitzettu, 25, from Mickleover, Derby, as \"armourers\" for the new group. Stewart convened a group telephone call on 5 February in which he said the plan was to \"cruise around\" looking for \"human targets\" near an Islamic education centre, \"do what whatever we do then back at mine for tea and medals and a debrief.\" Before the \"operation\" went ahead he wanted the members, who had never met in person, to \"hang out, bring ourselves closer together and just cement that brotherhood\" on 18 February, but the event did not go ahead and the group were arrested on 20 February. All three were found unanimously guilty at Sheffield Crown Court of preparing acts of terrorism and possessing information useful for terrorism. Ringrose was found guilty of manufacturing the lower receiver for a 3D firearm. Pitzettu pleaded guilty to possessing a stun gun. The judge, Mrs Justice Cutts, remanded all three in custody ahead of sentencing in July and told them they must expect \"substantial custodial sentences.\""
    },
    {
        "title": "Body found in search for missing 16-year-old boy in North Wales",
        "description": "A body has been found in the search for a 16-year-old boy missing in North Wales.",
        "url": "https://news.sky.com/story/body-found-in-search-for-missing-16-year-old-boy-in-north-wales-13367598",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wales-llandudno_6913888.jpg?20250512093642",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-14 09:41:00",
        "Headline": "The teenager, named only as Athrun, was on holiday from South Gloucestershire and was last seen on a beach in Llandudno on Saturday afternoon.",
        "Content": "A body has been found in the search for a 16-year-old boy missing in North Wales. The teenager, named only as Athrun, was on holiday from South Gloucestershire and was last seen on West Shore Beach in Llandudno, Conwy, at around 2pm on Saturday wearing a pair of swimming shorts. Police said a body was \"potentially\" spotted in the sea off Llandudno during air searches on Tuesday evening, prompting searches of the water by the coastguard and other teams on Tuesday night and early Wednesday morning. \"Multi-agency\" searches, including by the National Police Air Service (NPAS), resumed on Wednesday evening in the West Shore area. North Wales Police said a body was recovered at 6.20pm. Formal identification is yet to take place, but Athrun's family have been informed and are being supported by officers. The death is not being treated as suspicious, and the coroner has been informed. \n                  Assisted dying law 'unworkable, unaffordable and naive' says partnership of UK's leading social care groups\n                 \n                  Sir Keir Starmer in Albania to tackle 'revolving door' of migration\n                 \n                  Top Tory caught admitting Brexit drawback in leaked clip\n                 Chief Inspector Trystan Bevan said: \"My deepest condolences remain with Athrun's family, and I would ask for their privacy to be respected at this incredibly sad and difficult time. \"This is not the outcome anyone hoped for, and I would once again like to thank partner agencies and members of the public for their overwhelming support and tireless assistance with the searches over the last five days.\""
    },
    {
        "title": "British teenager arrested on drug trafficking charges in Georgia after going missing in Thailand",
        "description": "A British teenager has been arrested in Georgia on suspicion of drug trafficking after she went missing in Thailand.",
        "url": "https://news.sky.com/story/british-teenager-arrested-on-drug-trafficking-charges-in-georgia-after-going-missing-in-thailand-13367865",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-georgia-drugs-arrest_6916505.jpg?20250514185947",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-14 17:04:00",
        "Headline": "Georgia's interior ministry says an 18-year-old British citizen was arrested at Tbilisi international airport while attempting to smuggle 12kg of cannabis and 2kg of hashish, a cannabis concentrate.",
        "Content": "A British teenager has been arrested in Georgia on suspicion of drug trafficking after she went missing in Thailand. Georgia's interior ministry said an 18-year-old British citizen was arrested at Tbilisi international airport while attempting to smuggle 12kg of cannabis and 2kg of hashish, a cannabis concentrate, into the country. She could face up to 20 years or life in prison if she is convicted. Police footage showed sealed packages the teenager was allegedly attempting to smuggle into Georgia. It also showed her handcuffed as she was brought to a police station in Tbilisi. Police said she had been charged with the illegal possession of drugs, as well as smuggling them into the country. The 18-year-old appeared at a court in the capital city Tbilisi for a hearing on pre-trial detention on Tuesday. \n                  Former Manchester City footballer sworn in as Georgia's president\n                 \n                  Twelve people die from 'carbon monoxide poisoning' at ski resort\n                 \n                  Imedi TV: Popular Georgian television channel owned by UK firm is 'Russian propaganda arm', MP claims\n                 Georgian media said the suspect told the court she was pregnant but did not answer the judge's questions about the drug allegations. The prosecutor's office has said an investigation is under way to identify any possible accomplices. Cleveland Police in the UK said it had confirmation an 18-year-old woman from Billingham had been arrested in Georgia on suspicion of drugs offences and she remains in custody. The force had previously said she had gone missing and was believed to be in Thailand. A spokesperson for the Foreign Office said: \"We are supporting the family of a British woman who is detained in Georgia and are in contact with the local authorities.\""
    },
    {
        "title": "Gary Lineker apologises for 'Zionism' re-post featuring image of rat",
        "description": "Gary Lineker has \"apologised unreservedly\" for a social media re-post featuring a rat, saying he would \"never knowingly share anything antisemitic\".",
        "url": "https://news.sky.com/story/gary-lineker-apologises-for-zionism-re-post-featuring-image-of-rat-13367820",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-gary-lineker-motd_6705377.jpg?20241003185539",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-14 15:38:00",
        "Headline": "The 64-year-old presenter faced criticism after he shared a post on Instagram from the Palestine Lobby group showing a picture of a rat and titled: \"Zionism explained in two minutes.\"",
        "Content": "Gary Lineker has \"apologised unreservedly\" for a social media re-post featuring a rat, saying he would \"never knowingly share anything antisemitic\". The 64-year-old presenter faced criticism after he shared a post on Instagram from the Palestine Lobby group showing a picture of a rat and titled: \"Zionism explained in two minutes.\" In a statement, he said: \"On Instagram I reposted material which I have since learned contained offensive references. \"I very much regret these references. \"I would never knowingly share anything antisemitic. \"It goes against everything I believe in. \"The post was removed as soon as I became aware of the issue. \n                  New presenters of BBC's Match Of The Day confirmed as Mark Chapman, Kelly Cates and Gabby Logan\n                 \n                  Gary Lineker says 'right time' to leave Match Of The Day as he hints at changes to show's format\n                 \n                  Lineker goes: Does TV still need Match Of The Day?  \n                 \"Whilst I strongly believe in the importance of speaking out on humanitarian issues, including the tragedy unfolding in Gaza, I also know that how we do so matters. \"I take full responsibility for this mistake. \"That image does not reflect my views. \"It was an error on my part for which I apologise unreservedly.\" BBC Director General Tim Davie said on Wednesday morning: \"When it comes to presenters. I just say that the BBC reputation is held by everyone, and when someone makes a mistake, it costs us. \"And I think we absolutely need people to be exemplars of the BBC values and follow our social media policy. Simple as that.\" Rats have historically been used in antisemitic propaganda, including by the Nazis in 1930s Germany. Lineker's agent told the BBC the presenter immediately deleted the post when he learned about the image's symbolism. The presenter was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's new asylum policy. In November, he announced he would be stepping down from presenting Match Of The Day but will still host World Cup and FA Cup coverage."
    },
    {
        "title": "Man suspected of Huyton double stabbing shot by police",
        "description": "A man suspected of stabbing two people in Merseyside has been shot by armed police.",
        "url": "https://news.sky.com/story/man-suspected-of-huyton-double-stabbing-shot-by-police-13367984",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-car-police-tape_6916669.jpg?20250514222100",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-14 21:00:00",
        "Headline": "Armed officers responded to reports that a man and a woman had been stabbed in Huyton late on Wednesday afternoon.",
        "Content": "A man suspected of stabbing two people in Merseyside has been shot by armed police. Officers were called to a report that a man and woman had been stabbed in the Tobruk Road area of Huyton, near Liverpool at 4.25pm on Wednesday. Armed response officers arrived soon after and the suspect was shot by officers, Merseyside Police said. The suspect was taken to hospital for treatment, along with the two people who were hurt. They are in a serious but stable condition, the force said.  An investigation, including house-to-house and CCTV inquiries, is under way. Officers remained at the scene and the road was cordoned off. The Independent Office for Police Conduct (IOPC) has been informed, as is standard procedure in these circumstances, Merseyside Police said, and the watchdog has opened an independent investigation. Detective Superintendent Paul Speight said local people will be shocked by what he called \"an isolated incident\". Officers are not looking for anyone else, he said, adding all people involved \"have been taken to hospital to be assessed for their various injuries\". The force will fully co-operate with the IOPC, he added. Read more:Top Tory knew of flaws in post-Brexit planMen's prisons could run out of space 'in months' An IOPC spokesperson said it had begun gathering evidence after opening enquiries shortly before 7pm. \"We have sent investigators to attend the police post incident procedures,\" they said. \"Our investigation is in its initial stages and no further information is available at this time.\""
    },
    {
        "title": "Prison violence 'out of control' as five prison officers injured at HMP Woodhill and HMP Gartree",
        "description": "Recent escalating prison violence has been described as \"out of control\" by a union boss amid three separate attacks which have left five officers injured.",
        "url": "https://news.sky.com/story/prison-violence-out-of-control-as-multiple-officers-injured-at-hmp-woodhill-and-hmp-gartree-13367716",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hmp-woodhill-prison_6916245.jpg?20250514145241",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-14 14:46:00",
        "Headline": "One officer was slashed with an improvised weapon in one attack, while another officer suffered a broken arm in a separate assault.",
        "Content": "Recent escalating prison violence has been described as \"out of control\" by a union boss amid three separate attacks which have left five officers injured. Steve Gillan, general secretary of the Prison Officers Association (POA), has called for action to protect jail workers \"before there is a fatality\". The POA detailed two separate incidents at Woodhill prison in Milton Keynes. Geoff Willetts, of the POA, said one prison officer was assaulted and injured by an inmate detained under the Counter-Terrorism Act 2008. In another incident at the jail, a prisoner lashed out after being ordered to return to his cell. Mr Willetts said a specialist officer was slashed with an improvised weapon and sustained injuries to the neck and ear. The officer attended hospital, where stitches and surgical glue were applied to their injuries. \n                  Men's prisons could run out of space in months, government warns\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 Thames Valley Police said it was aware of one incident and was investigating the alleged assault of a prison officer on Tuesday. Meanwhile, at Gartree prison in Market Harborough, staff attended a medical emergency where an inmate reportedly faked an epileptic fit. Mr Willetts said a male prison officer was assaulted before having a TV thrown at him, while a female officer suffered a broken arm. A HMPPS (HM Prison and Probation Service) spokesperson confirmed that four HMP Woodhill officers were treated in hospital on Tuesday following two incidents. All were discharged later the same day, the service said in a statement. Protective body armour and tasers are among the options being considered by the Lord Chancellor to help prison staff cope with serious incidents, the statement said.  Alongside these three attacks, Southport triple killer Axel Rudakubana was also recently accused of attacking a prison officer with boiling water at HMP Belmarsh in London. Mr Gillan said: \"Escalating levels of violence are out of control in the prison service in England and Wales. \"It appears that HMPPS have learned nothing. They continue to ignore the calls from our members on the frontline for urgent action to protect prison officers from violence.\" Read more from Sky News:Inside the UK's broken prison systemMinister does not rule out US-style 'supermax' jails for most dangerous offenders Meanwhile, men's prisons in England and Wales could run out of space later this year, the government has warned, as it announced three new jails costing a total of £4.7bn will be built starting this year. Justice Secretary Shabana Mahmood revealed the expansion plans in Downing Street alongside Amy Rees, the outgoing chief executive of His Majesty's Prison and Probation Service (HMPPS). Ms Rees outlined how the male prison population was at 99% capacity and set to run out of room in November. To relieve the pressure on prisons in the interim, the government said it was going to limit recall conditions for some inmates. This includes prisoners serving up to four years only being subject to recall periods of 28 days, although repeat offenders and those at higher risk will not be eligible for the limit. Mr Gillan added: \"It is clear prison regimes must be reviewed as a matter of urgency. We need action to protect prison officers before there is a fatality. \"My thoughts are with the prison officers who have been injured. The POA will offer them our full support.\" Sky News has contacted the Ministry of Justice for comment."
    },
    {
        "title": "Drug dealer jailed after killing two, including seven-year-old boy, in cannabis lab explosion in Newcastle",
        "description": "A drug dealer who admitted to manslaughter after a house explosion, caused by gas canisters used to make cannabis sweets, has been jailed.",
        "url": "https://news.sky.com/story/drug-dealer-jailed-after-killing-two-including-seven-year-old-boy-in-cannabis-lab-explosion-in-newcastle-13367209",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-reece-galbraith_6874892.jpg?20250403124932",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-14 11:10:00",
        "Headline": "Reece Galbraith, 33, admitted manslaughter after two people, including seven-year-old Archie York, died in a house explosion last October.",
        "Content": " A drug dealer who admitted to manslaughter after a house explosion, caused by gas canisters used to make cannabis sweets, has been jailed. Reece Galbraith, 33, admitted to manslaughter over the deaths of Archie York, seven, and Jason \"Jay\" Laws, 35, after the blast in Violet Close in Benwell, Newcastle, on 16 October 2024. The former construction worker, who was also badly injured in the explosion, has been sentenced to 14 years. Six properties divided into two flats each were destroyed in the explosion, which led to a major emergency services response and made families homeless. Archie was asleep when the blast ripped through the home he shared with parents Katherine and Robbie and his baby brother Finley. Police investigating the explosion discovered that the flat operated by Galbraith and Laws was used as a \"drugs lab\" to produce cannabis concentrates, known as \"shatter\" or \"butane honey oil\", in a highly dangerous process. The product was then turned into cannabis edibles, also known as \"gummies\".  'You killed my son' Archie's mother, Katherine Errington, shouted \"you killed my son\" at Galbraith as she read her victim impact statement in court. She sobbed as she told the defendant: \"You brought gas canisters into a building where families lived. You ran a drugs operation under the floor where my children slept. \"You took risks for profit and didn't care who got hurt. You killed my son.\" She added her \"entire world was shattered, literally and irreversibly\" by the events of that day. More than 100 people displaced The court heard it destroyed six out of the 12 flats in the block and was followed by a \"fierce fire\" that caused so much damage the whole block has since been demolished. More than 100 people were displaced to temporary accommodation and 53 of the 80 residents will not be returning, while the financial impact is said to be about £3.7m. Prosecutor David Brooke KC said Laws had been using the flat for months and there was \"little purpose\" for it other than the production of cannabis. The court heard Galbraith was found walking away from the street immediately after the explosion, asking about his friend. He suffered extensive burns and was in hospital for about a month, initially in an induced coma. Mr Brooke said Galbraith had been at the flat since about 6pm the previous evening and his fingerprint was found on one of the butane bottles at the property. A bag containing packages of cannabis sweets was found in Laws' car which had both his and Galbraith's DNA on some of the packets. 'Process is inherently dangerous' Experts found the explosion was caused by the ignition of liquid butane gas, which had been released and built up within the premises as part of the illegal \"shatter\" production. Mr Brooke said more than 100 butane canisters were found in the flat as well as other \"sophisticated and expensive\" equipment. The prosecutor said: \"The process of making shatter is inherently dangerous because butane is highly flammable. \"It is dangerous even to store butane bottles inside let alone use the liquid gas in a process like this. The liquid gas will expand a nominal 230 times as it becomes gas.\" At the time of the explosion, Galbraith was already being investigated for being concerned in the supply of cannabis. Officers later found 250 cannabis sweets, moulds and 300g of a sweet mixture when they searched his house. He was released pending further investigation. Police also found evidence on his phone that he was dealing in cannabis and cannabis sweets with Laws from at least as far back as November 2023. Jailing Galbraith, the judge, Mr Justice Cotter, said: \"Archie York was just a seven-year-old with a wonderful and exciting life ahead of him. \"You bear responsibility for all this loss and destruction.\""
    },
    {
        "title": "Putin not listed in Russian delegation for talks with Ukraine in Turkey - and Trump also not attending",
        "description": "Vladimir Putin has not been listed in a Russian delegation expected to head to Turkey for ceasefire talks on Thursday with Ukraine.",
        "url": "https://news.sky.com/story/putin-not-listed-in-russian-delegation-for-talks-in-turkey-with-ukraine-13367816",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vladimir-putin-russia_6916646.jpg?20250514215246",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-14 20:35:00",
        "Headline": "President Trump had said he was \"thinking\" of going to Turkey if Vladimir Putin would be there.",
        "Content": "Vladimir Putin has not been listed in a Russian delegation expected to head to Turkey for ceasefire talks on Thursday with Ukraine. The Russian president signed an order on Wednesday detailing who would be in the group to Istanbul, including presidential aide Vladimir Medinsky, deputy foreign minister Galuzin Mikhail Yuryevich, and deputy minister of defence Alexander Fomin. On Sunday, Mr Putin had proposed direct negotiations with Ukraine over the war, to be held on Thursday \"without any preconditions\", and Ukraine's President Volodymyr Zelenskyy had called on the Russian president to meet him in Istanbul. Donald Trump will not go to Turkey to join the Russia-Ukraine talks either, a US official confirmed after Mr Putin announced the Russian delegation. The US president had said he was \"thinking\" of going to Turkey if Mr Putin would be there. Instead, his senior envoys Steve Witkoff and Keith Kellogg will travel to Istanbul, according to three sources familiar with the plans. Mr Zelenskyy was on his way to the Turkish capital of Ankara on Wednesday night, a senior Ukrainian official told Reuters. The Ukrainian president had said he would attend the talks in Istanbul, but only if Mr Putin also attended. \"I am waiting to see who will arrive from Russia and then I will determine what steps Ukraine should take. The signals in the media so far are unconvincing,\" he said in his nightly video address earlier. He said Mr Putin \"continues to strike Ukraine\", adding: \"In fact, it is now more obvious to the entire world than at any other point during the full-scale war... that the only obstacle to establishing peace is the lack of a clear will from Russia to do so.\" Read more: Here's what happened at the last summit Moscow correspondent Vladimir Medinsky, Mikhail Galuzin, Igor Kostyukov, Alexander Fomin - if those names don’t mean anything to you, that is very much the point. This is not Vladimir Putin's top team. It is not his veteran foreign minister Sergei Lavrov or negotiating heavyweight Yuri Ushakov. Instead, this is a much more junior contingent, which will make up Russia's delegation at the talks with Ukraine in Istanbul on Thursday. It is an attempt, I think, to humiliate Volodymyr Zelenskyy, who's been saying all week that he will be waiting for Mr Putin in Turkey. But the Kremlin leader isn't someone who takes kindly to ultimatums or the demands of others. He likes to be the one in charge, and publishing a list like this, at the 11th hour, is an expression of power. He won't be pushed around. Although Mr Putin's name is not on the list, it doesn't necessarily mean he's not going. The chatter on Telegram late on Wednesday was that the talks might be extended into a second day and the Russian president may show on Friday. We simply don't know at this stage. But what we do know is Mr Putin likes to be unpredictable. He likes to own the agenda. Keeping everyone guessing is a way of doing just that. The proposed meeting came after the \"coalition of the willing\" countries, including Britain, threatened Russia with fresh sanctions if it failed to take part in a 30-day ceasefire beginning on Monday. Russia effectively rejected the proposal by instead calling for direct negotiations in Istanbul with Ukraine. On Tuesday, the Institute for the Study of War said Russia is \"attempting to prolong negotiations to extract additional concessions from the United States and while making additional battlefield advances\"."
    },
    {
        "title": "'Our school is destroyed': At the scene of the Kashmir mosque hit by an Indian missile strike",
        "description": "Through long, winding roads, we weave through a wonderland. A place of intense beauty, with wide valleys, rushing rivers and terraced hills. The roads are brimming with hand-painted trucks, slowed only by the occasional herd of goats stopping traffic.",
        "url": "https://news.sky.com/story/our-school-is-destroyed-at-the-scene-of-the-kashmir-mosque-hit-by-an-indian-missile-strike-13367925",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kashmir-muzaffarabad_6916679.jpg?20250514223055",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-05-14 19:31:00",
        "Headline": "Missiles destroyed Bilal Mosque - the roof's been ripped off, there's a vast crater in the floor and a huge hole in the ceiling of the prayer room. The Indian government insist this was a terror site, but the imam of the mosque flatly denies that accusation.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  Through long, winding roads, we weave through a wonderland. A place of intense beauty, with wide valleys, rushing rivers and terraced hills. The roads are brimming with hand-painted trucks, slowed only by the occasional herd of goats stopping traffic. We're entering Pakistan-administered Kashmir, a disputed borderland at the centre of decades of conflict and at the heart of recent escalating tensions with India. We're with the Pakistan army on our way to Muzaffarabad, the provincial capital. Few thought this city would be hit in the recent round of strikes, but it was. Missiles destroyed Bilal Mosque, the roof's been ripped off, there's a vast crater in the floor and a huge hole in the ceiling of the prayer room. Jameel Akhtar is staring into the distance. His 82-year-old father Muhammad was killed in the strike. But he is able to find comfort amid the rubble. He says: \"We are Muslim. My father was martyred in this attack. That's honour for us. Revenge against India, that is the duty of our armed forces and government and we have full faith in them.\" The Indian government insist this was a terror site with links to Lashkar-e-Taiba, an Islamist group designated as a \"terrorist\" organisation by the UN Security Council. But the imam of the mosque, Khursheed Ul Hasan, flatly denies that accusation. \"This is an allegation from their side,\" he says. \"I've been here for 17 years and everybody knows me. I am the leader of this mosque. You can see I'm a normal person. I'm not a terrorist.\" What is striking is how close this mosque is to homes and schools. Across a narrow path, I meet Nimra Safeer who was sleeping next to the mosque when the strike came. She was hit in the chest with shrapnel and says she now can't sleep. She is desperate to see her government and New Delhi sit down to talk about the enduring issue that plagues this region. \"Children like me who were attacked, our education system was disturbed,\" she tells me. \"I want to say to India, whatever your issues, we need to sit down and resolve it. Pakistan wants peace and I want Pakistan to talk on the Kashmir issue.\" Read more:Fragile truce between Pakistan and India could easily unravelTrump faces criticism over Kashmir post Strongmen, religious nationalism and modern warfare in the mix But she may be waiting a long time. Islamabad sounds emboldened and hopeful after the recent clashes. But India's leader Narendra Modi is conceding nothing. He's made clear he doesn't want a third party like America trying to mediate and he's made no commitment to formal talks with Pakistan either. While the world waits to see what the diplomatic shakedown of this moment is, ordinary people on both sides fear their safety net has slipped, the threat a little deeper, a little closer, a little more dangerous now. There's strongmen, religious nationalism and modern warfare in the mix and a fragile truce. School also damaged in strike In Muzaffarabad, right opposite the mosque, is a school that was also damaged. Thankfully, the children were at home sleeping. But in the cold light of day, you can see their unease and upset. \"Our school is destroyed,\" Fatima tells me, her eyes narrowing as she speaks. \"I have so much anger. Because we study here. Our principal built this school. They built it for us. But India destroyed it.\" The recent skirmishes may have abated for now. But with them has come more animosity calcifying in these beautiful mountain ranges. India has made clear its muscular response is part of a \"new normal\" when responding to terror. Pakistan sounds like it feels it's scored a win against the odds. That's a defiant dynamic that could easily unravel. Could pressure from a third party like America signal a sudden shift in this enduring conflict? Right now, that seems unlikely. But this week has been full of surprises."
    },
    {
        "title": "Canadians 'not impressed' by UK's invitation to Trump, Mark Carney tells Sky News",
        "description": "Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News.",
        "url": "https://news.sky.com/story/canadians-werent-impressed-by-second-uk-state-visit-for-trump-mark-carney-says-13367469",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mark-carney-canada_6915777.jpg?20250514074709",
        "type": "World",
        "Author": "Samantha Washington",
        "Date Published": "2025-05-14 04:14:00",
        "Headline": "Canada's newly elected prime minister sat down with Sky News' Sam Washington to discuss dealing with a noisy neighbour in Donald Trump and Canada's relationship to the UK.",
        "Content": "\n          Presenter\n        Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News. Sir Keir Starmer handed the invitation to the US president during a visit to the Oval Office. The newly elected Liberal leader Mark Carney said that the invitation \"cut across clear messages\" that the Canadian government was trying to send to the White House in response to their threats against Canada's sovereignty. \"I think, to be frank, they [Canadians] weren't impressed by that gesture... given the circumstance. It was at a time when we were being quite clear about the issues around sovereignty.\" Explained: Who is Mark Carney? It comes as the Canadian prime minister has invited the King, who is Canada's head of state, to open its parliament later this month in a \"clear message of sovereignty\". It is the first time the sovereign has carried out this function in nearly 50 years and Mr Carney says it's \"not coincidental\". \n                  King left as 'piggy in the middle' over Canada-US stand-off\n                 \n                  Mark Carney's body language during his Trump meeting spoke volumes\n                 \n                  Did Trump just win the election for Canada's Mark Carney?\n                 \"All issues around Canada's sovereignty have been accentuated by the president. So no, it's not coincidental, but it is also a reaffirming moment for Canadians.\" The former Bank of England governor was re-elected after a campaign fought on the promise of standing up to American threats to Canadian statehood. He had refused to speak to Mr Trump until Canadian sovereignty was respected.  It followed Mr Trump threatening to make Canada the 51st state of the US. Mr Carney justified making his first foreign trip as prime minister to the White House by stating Mr Trump had changed his intentions to annex Canada from an \"expectation to a desire\". \"He was expressing a desire. He'd shifted from the expectation to a desire. He was also coming from a place where he recognised that that wasn't going to happen. \"Does he still muse about it? Perhaps. Is it ever going to happen? No. Never.\" The high-stakes meeting in the Oval Office was not confrontational, with Mr Carney praising the president's approach as \"very on top of the essence of a wide range of issues\" and \"able to identify the points of maximum leverage, both in a specific situation but also in a geopolitical situation\". Presenter Fractured geopolitical relations have produced an interesting phenomenon: two Commonwealth nations both deploying their head of state, King Charles, to manage the vagaries of Donald Trump. For Canada, and its new prime minister, Mark Carney, the King is being unveiled at the opening of Parliament in Ottawa later this month as an unequivocal spectacle and symbol of sovereignty. For the UK, Sir Keir Starmer is positioning the monarch as a bridge and has proffered a personal invitation from King Charles to the president for an unprecedented second state visit in order to facilitate negotiations over trade and tariffs. This instrumentalisation of the crown, which ordinarily transcends politics, has created tension between the historically close allies. Canadians view the UK's red carpet treatment of a leader who is openly threatening their sovereignty as a violation of Commonwealth solidarity, while the British seem to have no compunction in engaging in high-level realpolitik. The episode is emblematic of how pervasive disruptive American influence is and how extreme measures taken to combat it can aggravate even the most enduring alliances. Since the meeting, tensions between the two countries have abated.  Further negotiations on trade and security are expected soon. Given the deep economic integration of the two nations, neither side expects a deal imminently, but both sides concur that constructive talks have led to progress on an agreement. With greater goodwill between the two North American neighbours, Mr Carney also expressed optimism about Mr Trump's efforts to broker peace between Ukraine and Russia. The prime minister confirmed his view that the president was an \"honest broker\" and that his counterpart had been \"helpful\" in bringing momentum to a 30-day ceasefire between the warring nations. Despite a reset in relations between the United States and Canada, Mr Carney remained circumspect. His motto is: \"Always plan for the worst.\" Read more from Sky News:Trump signs deals in Saudi Arabia - with murder long forgottenMenendez brothers' murder sentences reduced And to that end, nothing is being taken for granted: \"We do plan for having no deal, we do plan for trouble in the security relationship. We do plan for the global trading system not being reassembled: that's the way to approach this president.\""
    },
    {
        "title": "Gaza hospital attack: Analysis contradicts Israel's evidence justifying airstrike",
        "description": "Israel has escalated its attacks in Gaza in the last two days, striking two of the Palestinian territory's largest working hospitals.",
        "url": "https://news.sky.com/story/gaza-hospital-attack-analysis-contradicts-israels-evidence-justifying-airstrike-13367823",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-dandf-hospital_6916406.jpg?20250514170745",
        "type": "World",
        "Author": "Ben van der Merwe, Kaitlin Tosh, Freya Gibson and Sophia Massam, Data &amp; Forensics Unit",
        "Date Published": "2025-05-14 15:45:00",
        "Headline": "Israel says it bombed the European Hospital because it was home to an underground Hamas base, but expert analysis casts doubt on its evidence.",
        "Content": "By Ben van der Merwe, Kaitlin Tosh, Freya Gibson and Sophia Massam, Data & Forensics Unit  Israel has escalated its attacks in Gaza in the last two days, striking two of the Palestinian territory's largest working hospitals. CCTV footage, verified by Sky News, shows the moment of the attack on the European Hospital near Khan Younis on Tuesday 13 May. Another video, taken from outside the grounds of the hospital, shows plumes of smoke rising from the compound. At least 16 people were killed, according to Gaza's health ministry, which is part of the territory's Hamas-led government. What the evidence says about Israel's claims Israel said it was targeting a Hamas \"command and control centre\" buried beneath the hospital, and published a video taken from an aerial surveillance aircraft. In the footage, a building is highlighted and marked as \"European Hospital\". However, Sky News has confirmed that the footage does not in fact show the European Hospital, but the adjacent school, Jenin Secondary School for Boys. In the video, a series of dark shapes are also highlighted and labelled as \"underground terrorist infrastructure site revealed following the strike\". However, there is no obvious damage visible in the video, and an eyewitness told Sky News that there had been no damage to the school's courtyard. An expert told Sky News that the dark shapes appear to be markings caused by water, rather than exposed underground infrastructure such as tunnels. \"That does look quite obviously to be a drainage ditch with dendritic flow patterns of water heading into the ditch,\" said Corey Scher, an expert in the use of satellite imagery to assess military and environmental damage at Oregon State University. \"The same drainage patterns are readily visible in [earlier] imagery. These appear to be ditches draining water.\" A spokesperson for the Israel Defence Forces (IDF) confirmed to Sky News that the footage shows an area outside the hospital grounds. The spokesperson said that the \"underground infrastructure\" continued under the hospital, but did not provide any evidence of this. The spokesperson also did not address the analysis that the video shows markings caused by water, rather than underground infrastructure. The IDF has escalated attacks in recent days The attack on the European Hospital came just hours after Nasser Hospital, in Khan Younis, was hit by an Israeli strike. The video below, taken by Palestinian journalist Alam Sadeq and verified by Sky News, shows the immediate aftermath of the strike. The two top floors on the eastern side of the hospital are on fire, and an Israeli aircraft can be heard in the background. Israel says it was targeting Hamas officials who were using that part of the hospital as a base, but has not provided any evidence to support this. Local media have reported that Israel was targeting Hamas leader Mohammed Sinwar. Since 18 March, when it abandoned a US-brokered ceasefire, Israel has declared 65% of the Gaza Strip to be active combat zones - meaning that Palestinians are required to flee. However, neither hospital attacked on 13 March was in a declared combat zone. British surgeon Tom Potokar, who is working in Gaza, was at the European Hospital when it was struck. He told Sky News Special Correspondent Alex Crawford that the hospital was hit twice more on 14 May, as workers cleared the rubble from the day before. A video taken by Dr Potokar shows smoke billowing out from a bulldozer on the grounds of the hospital. That same morning, Israel also launched a series of attacks on the residential neighbourhood of Jabalia, in the north of the Gaza Strip. At least 53 people were killed, according to Gaza's health ministry, which named 52 of the fatalities. The last two months have been the deadliest period in Gaza since the early weeks of the war, according to Gaza's health ministry, with three in every five fatalities being women, children or elderly people. A two-month long blockade on aid has also compounded Gaza's suffering. Vital resources like food are starting to run out. \"You've got an entire population that is in a crisis mode in terms of food security,\" said Antoine Renard, director for Palestine at the World Food Programme. \"Worse than that, you've got nearly a quarter of the population that is at risk of famine.\"  A UN-backed report this week said that 93% of people are facing high levels of acute food insecurity, described as being in a crisis, emergency or catastrophic situation. And nearly 71,000 children under the age of five are expected to be acutely malnourished over the next 11 months. This is all happening as Israeli officials face pressure to agree to a ceasefire and hostage release deal. Additional reporting by Michelle Inez Simon, digital investigations producer, and Sky's Gaza team. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "British teenager arrested on drug trafficking charges in Georgia after going missing in Thailand",
        "description": "A British teenager has been arrested in Georgia on suspicion of drug trafficking after she went missing in Thailand.",
        "url": "https://news.sky.com/story/british-teenager-arrested-on-drug-trafficking-charges-in-georgia-after-going-missing-in-thailand-13367865",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-georgia-drugs-arrest_6916505.jpg?20250514185947",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-14 17:04:00",
        "Headline": "Georgia's interior ministry says an 18-year-old British citizen was arrested at Tbilisi international airport while attempting to smuggle 12kg of cannabis and 2kg of hashish, a cannabis concentrate.",
        "Content": "A British teenager has been arrested in Georgia on suspicion of drug trafficking after she went missing in Thailand. Georgia's interior ministry said an 18-year-old British citizen was arrested at Tbilisi international airport while attempting to smuggle 12kg of cannabis and 2kg of hashish, a cannabis concentrate, into the country. She could face up to 20 years or life in prison if she is convicted. Police footage showed sealed packages the teenager was allegedly attempting to smuggle into Georgia. It also showed her handcuffed as she was brought to a police station in Tbilisi. Police said she had been charged with the illegal possession of drugs, as well as smuggling them into the country. The 18-year-old appeared at a court in the capital city Tbilisi for a hearing on pre-trial detention on Tuesday. \n                  Former Manchester City footballer sworn in as Georgia's president\n                 \n                  Twelve people die from 'carbon monoxide poisoning' at ski resort\n                 \n                  Imedi TV: Popular Georgian television channel owned by UK firm is 'Russian propaganda arm', MP claims\n                 Georgian media said the suspect told the court she was pregnant but did not answer the judge's questions about the drug allegations. The prosecutor's office has said an investigation is under way to identify any possible accomplices. Cleveland Police in the UK said it had confirmation an 18-year-old woman from Billingham had been arrested in Georgia on suspicion of drugs offences and she remains in custody. The force had previously said she had gone missing and was believed to be in Thailand. A spokesperson for the Foreign Office said: \"We are supporting the family of a British woman who is detained in Georgia and are in contact with the local authorities.\""
    },
    {
        "title": "'China-based' hack targets UK companies in 'critical national security threat', says analyst",
        "description": "A new wave of cyber attacks against British companies is a \"critical national security threat\", an analyst has told Sky News.",
        "url": "https://news.sky.com/story/china-based-hack-targets-uk-companies-in-critical-national-security-threat-says-analyst-13367638",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cybercrime-hacker-hacking_6840137.jpg?20250226113306",
        "type": "World",
        "Author": "Tim Baker",
        "Date Published": "2025-05-14 10:50:00",
        "Headline": "Unlike the recent attacks against M&S, Co-op and Harrods, the latest incident was not ransomware but rather remote code execution.",
        "Content": "\n          Political reporter\n       A new wave of cyber attacks against British companies is a \"critical national security threat\", an analyst has told Sky News. It follows the exposure of a previously unknown vulnerability in software used by hundreds of companies. But unlike the recent attacks against M&S, Co-op and Harrods, the latest incident was not ransomware but rather remote code execution. This is where hackers take control of devices and networks over the internet to run potentially malicious programmes or steal data and information. Politics latest: Reform MP won't face charges The event - revealed by analyst Arda Buyukkaya at cybersecurity firm EclecticIQ - used a previously unknown backdoor in a piece of software called SAP Netweaver, with a patch since released. Cody Barrow is the chief executive of EclecticIQ and previously worked at the Pentagon, the NSA and US Cyber Command. He told Sky News: \"Governments should treat this as a critical national security threat\", adding that it is the kind of scenario that keeps people like him up at night. Mr Barrow said the exploitation of networks is \"extensive and ongoing\", with more than 500 SAP customers affected and more potentially at risk. He urged users to update their software to the latest version. Gas giant Cadent, publishers News UK, Euro Garages (EG) Group, Johnson Matthey and Ardagh Metal have been named as victims, with US and Saudi Arabian entities also targeted. NHS England has posted a warning about the exploit on their website, although it is not clear if they are impacted. The National Cyber Security Centre (NCSC), the UK government's authority on cyber threats and part of GCHQ, are monitoring the situation. An NCSC spokesperson told Sky News: \"We are monitoring for UK impact following reports of a critical vulnerability affecting SAP NetWeaver being actively exploited. \"The NCSC strongly encourages organisations to follow vendor best practice to mitigate the vulnerability and potential malicious activity. \"Vulnerabilities are a common aspect of cyber security, and all organisations must consider how to most effectively manage potential security issues.\" JP Perez-Etchegoyen, the chief technical officer of Onapsis - which specialises in the cybersecurity security of SAP - told Sky News that exploits of the backdoor were first observed at the start of this year, and began to increase in March. Last week, Cabinet minister Pat McFadden warned companies that recent cyber attacks on M&S, Co-op and Harrods should be a \"wake-up call\" for businesses. A spokesperson for Cadent declined to comment on the specific attack, but the company works with the NCSC on cyber security issues. A spokesperson for News UK declined to comment. EG Group, Johnson Matthey and Ardagh Metal have not responded to Sky News requests for comment. Read more from Sky News:China attempting to spy on UK onlineWarning over China-backed botnet attack According to the initial summary of the exploit, analysts linked the attacks to \"Chinese cyber-espionage units\". This was based on a variety of factors, including Chinese-named files identified as part of the hack, and the way the hackers operated. The aim of the Chinese groups is to \"operate strategically to compromise critical infrastructure, exfiltrate sensitive data, and maintain persistent access across high-value networks worldwide\", said the summary. The targets in the UK were said to include critical gas distribution networks, and water and integrated waste management utilities. 👉Listen to Politics at Sam and Anne's on your podcast app👈 A spokesperson for SAP said: \"SAP is aware of and has been addressing vulnerabilities in SAP NETWEAVER Visual Composer. SAP issued a patch on 24 April, 2025. \"A second vulnerability has also been identified and a patch was released on 13 May, 2025. \"We ask all customers using SAP NETWEAVER to install these patches to protect themselves.\" The Chinese embassy in London has been approached for comment."
    },
    {
        "title": "Donald Trump's business deals in Middle East could be template for ending Ukraine conflict",
        "description": "If you want to make the world a better place, just do business and make deals.",
        "url": "https://news.sky.com/story/donald-trumps-business-deals-in-middle-east-could-be-template-for-ending-ukraine-conflict-13367688",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-qatar_6916125.jpg?20250514131013",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-05-14 11:56:00",
        "Headline": "The US president's foreign policy has been laid out unashamedly this week - it has been purely transactional - and in the Middle East it might just pay dividends. But might it work elsewhere, most of all to end Russia's war with Ukraine?",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n If you want to make the world a better place, just do business and make deals. That is the essence of Donald Trump's foreign policy laid out unashamedly this week. And in the Middle East, it might just pay dividends. Can it work elsewhere, most of all to end Russia's war with Ukraine? Or will it make matters worse? For his critics, Trump's Middle East tour has been purely transactional and amoral. No lectures to the autocrats of the region about human rights. No pressure to make them more like America.  But that's the point. That was where previous US presidents went wrong, Trump said. Trump the showman, Trump the deal maker, is back on the world stage. \n                  Key moments that have shaped Trump and Zelenskyy's relationship\n                 \n                  Trump's deal with Syria - what does it mean?\n                 \n                  Donald Trump meets with Syrian president after announcing lifting of sanctions\n                 Own your story, and say you're winning, always. We are used to how Donald Trump operates, as president as he was real estate developer. His Riyadh speech for instance, was littered with half-truths, outright falsehoods and exaggerations. But it also wove a narrative of success, and, pushed hard enough, that can acquire its own momentum. Others want in on it. Ask the Syrians. Ahmed al Sharaa, former Jihadi and one of America's most wanted and now Syrian leader has been actively courting the US president. Reported offers of a Trump Tower in Damascus and a minerals deal like the one with Ukraine appear to have paid off.  Persuaded by both Saudis and Turks, the US president is lifting all US sanctions on Syria. But Trump wants more. He wants Syria to join his biggest diplomatic achievement, the Abraham Accords. They are the normalisation agreements brokered by the Trump administration in its first term between Israel and Gulf nations. That would utterly transform the region. There are obstacles. Israelis will need persuading, to say the least. But if Trump wants it, they may find it hard ultimately to stand in his way. Will the same business-first approach work to bring peace to Ukraine? On the one hand, it seems to have already helped Ukraine. The minerals deal it has signed with President Trump is understood to have made him far more sympathetic to their cause. This reportedly coincides with growing impatience with Vladimir Putin's refusal to agree to a ceasefire. However, in the long term, Russia may offer more attractive prospects for deals with the Trump administration. Putin's officials have reportedly been making much of those prospects. Russia has enormous mineral and hydrocarbon wealth to offer.  👉 Follow Trump100 on your podcast app 👈 President Trump has at times, and utterly unfairly, seemed to resent Ukraine standing in the way of progress towards a lucrative rapprochement with Moscow. The minerals deal may have made him more even-handed. The hope is that will motivate the US to be firmer with both sides and do more to pressure them to end this war."
    },
    {
        "title": "Cassie breaks down in tears during Sean 'Diddy' Combs trial as she tells of 'personal shame' and alleged rape",
        "description": "Cassie Ventura broke down in tears in court as she described her \"personal shame\" at taking part in \"freak off\" sex sessions for Sean Combs - and also accused him of raping her as their relationship came to an end.",
        "url": "https://news.sky.com/story/cassie-breaks-down-in-tears-during-sean-diddy-combs-trial-as-she-tells-of-personal-shame-and-alleged-rape-13368007",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-casandra-ventura_6916755.jpg?20250514231511",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-14 21:49:00",
        "Headline": "At one point, the courtroom hearing Sean Combs's trial in Manhattan, New York, fell silent as sexually explicit images from \"freak offs\" were shown to jurors, but kept private from the public gallery. These included images of Cassie Ventura and escorts.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Cassie Ventura broke down in tears in court as she described her \"personal shame\" at taking part in \"freak off\" sex sessions for Sean Combs - and also accused him of raping her as their relationship came to an end. During her second day of testimony, the singer and model told jurors of several alleged violent incidents and said the hip-hop mogul, who was known as Puff Daddy and Diddy throughout his career, blackmailed her with compromising videos. At one point, the courtroom in Manhattan, New York, fell silent as sexually explicit images from \"freak offs\" were shown to jurors, but kept private from the public gallery. These included images of Ms Ventura and escorts. Combs asked his lawyer Marc Agnifilo to see a binder of the images, and thumbed through it for a few moments before handing it back. Sean 'Diddy' Combs trial: Day 3 - As it happened The 55-year-old, once one of the most powerful men in the music industry, has pleaded not guilty to charges of sex-trafficking, racketeering conspiracy, and transportation to engage in prostitution. Prosecutors allege he used his fame and fortune to coerce Ms Ventura and other women into abusive sex sessions with escorts. His lawyers have conceded he could be violent, but argue that all sexual encounters were consensual and he never veered into sex trafficking and racketeering. Ms Ventura, who is heavily pregnant with her third child, kept calm and composed for most of her evidence on Wednesday, but broke down at the end of the day when asked why she had chosen to testify. \"I can't carry this anymore,\" she told the court. \"I can't carry the shame, the guilt, the way he treated people like they were disposable. What's right is right, what's wrong is wrong. I came here to do the right thing.\" Early in 2023, she said she started suffering from \"flashbacks\" and had suicidal thoughts, so went to rehab and trauma therapy. It is \"impossible to know\" how many \"freak offs\" she participated in, but it was in the hundreds, she told the court. Asked if she has been involved in any since ending the relationship in 2018, she replied: \"No.\" Ms Ventura, 38, alleged that Combs raped her at her home in Los Angeles, after she told him she was ending things. \"I just remember crying and saying no, but it was very fast,\" she said, her voice trailing off. She told jurors she did have consensual sex with the rapper on a subsequent occasion. \"We'd been together for over 10 years. You just don't turn feelings off,\" she said. Ms Ventura sued Combs in November 2023, and settled within 24 hours. She received £20m, the trial was told. Combs 'threatened Cassie and Kid Cudi' Ms Ventura's second day of testimony also included details of how she briefly dated Scott Mescudi, better known as singer and rapper Kid Cudi, during a low point in her relationship with Combs in 2011. Combs lunged at her with a corkscrew and kicked her in the back when he found out, jurors heard, and threatened to blow up Mescudi's car. These allegations were also detailed in her lawsuit, which alleged his car did \"explode in his driveway\" around this time. During several hours on the stand, Ms Ventura told how she hid the extent of Comb's alleged violence from loved ones, and described one incident when she allegedly suffered a \"pretty significant gash\" above her left eye after he threw her into a bed frame. Rather than go to hospital, his security staff took her to a plastic surgeon in Beverly Hills, she said. The hotel CCTV 'attack'  An incident at a hotel in Los Angeles in March 2016, which has come up several times during the trial already, was also discussed again. CCTV from the hotel, which was first released by CNN in May 2024, showed Combs allegedly beating Ms Ventura in a hallway. Jurors were shown photos of her with a swollen lip following the incident as she testified. She said a friend of hers saw her injuries and was \"super upset\" because she'd \"seen me with black eyes and busted lips before\". She also spoke about a trip to Cannes in 2013, after which she said the rapper began playing a recording of a \"freak off\" on his laptop on a commercial flight to New York, with other people around them - telling her he was \"going to embarrass me and release them\". Read more:The rise and fall of DiddyDiddy - a timeline of allegationsEverything you need to know about the trial Asked if the freak offs impacted her health, Ms Ventura said she had stomach problems and frequently developed urinary tract infections. She was also affected mentally, she told the court, saying they made her feel \"really empty\" and \"gross\". Throughout her testimony, Ms Ventura has maintained she never wanted to have sexual experiences with other people but did it at first to please the man she loved, and later out of fear. She was 22 and inexperienced when she started dating Combs, who was 17 years older, she said. The trial continues with cross-examination of Ms Ventura from the defence tomorrow."
    },
    {
        "title": "Menendez brothers' murder sentences reduced - making them eligible for parole",
        "description": "A judge has reduced the Menendez brothers' murder sentences - meaning they are eligible for parole.",
        "url": "https://news.sky.com/story/menendez-brothers-sentence-reduced-paving-way-for-possible-release-13367457",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-erik-menendez-lyle-menendez_6883058.jpg?20250411155722",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-14 00:14:00",
        "Headline": "Lyle and Erik Menendez received life sentences without the possibility of parole after being convicted of murdering their parents, Jose and Kitty Menendez, at their Beverly Hills home in 1989.",
        "Content": "A judge has reduced the Menendez brothers' murder sentences - meaning they are eligible for parole. Lyle, 57, and Erik, 54, received life sentences without the possibility of parole after being convicted of murdering their parents, Jose and Kitty Menendez, at their Beverly Hills home in 1989. Last year, the then Los Angeles district attorney George Gascon asked a judge to change the brothers' sentence from life without the possibility of parole to 50 years to life. On Tuesday, Los Angeles County superior court Judge Michael Jesic did so, paving the way for the brothers' parole and possible release. The ruling capped off a day-long hearing in which several relatives, a retired judge and a former fellow inmate testified in support of efforts to shorten the brothers' sentences. 'I killed my mum and dad' The brothers appeared at the proceedings in Los Angeles County Superior Court via video feed from prison in San Diego. \"I killed my mum and dad. I make no excuses and also no justification,\" Lyle said in a statement to the court. \"The impact of my violent actions on my family... is unfathomable.\" Erik also spoke about taking responsibility for his actions and apologising to his family. He said: \"You did not deserve what I did to you, but you inspire me to do better.\" The brothers did not show any apparent emotion during much of the testimony but chuckled when one of their cousins, Diane Hernandez, told the court that Erik received A+ grades in all of his classes during his most recent semester in college. Anamaria Baralt, another cousin of the brothers, told the court they had repeatedly expressed remorse for their actions. \"We all, on both sides of the family, believe that 35 years is enough. They are universally forgiven by our family,\" she said. 'They have not come clean' Los Angeles County prosecutors argued against the resentencing, saying the brothers have not taken complete responsibility for the crime. The current district attorney Nathan Hochman said he believes the brothers were not ready for resentencing because \"they have not come clean\" about their crimes. His office has also said it does not believe they were sexually abused. \"Our position is not 'no'. It's not 'never'. It's 'not yet',\" Mr Hochman said. \"They have not fully accepted responsibility for all their criminal conduct.\" Path to freedom? \"I'm not saying they should be released, it's not for me to decide,\" Judge Jesic said. \"I do believe they've done enough in the past 35 years, that they should get that chance.\" After the judge's decision, the brothers now have a new path to freedom after decades in prison. They are now eligible for parole under California's youthful offender law because they committed the crime while under the age of 26. The state parole board must still decide whether to release them from prison. While this decision is made, the brothers will remain behind bars. During the original trial, prosecutors accused the brothers of killing their parents for a multimillion-dollar inheritance, although their defence team argued they acted out of self-defence after years of sexual abuse by their father. Read more from Sky News:Man who spent 38 years in jail has conviction quashedTrump to lift sanctions on SyriaTory MP charged with sexual assaults The brothers have maintained since they were first charged with the murders that their parents abused them. A Netflix series and subsequent documentary about the brothers thrust them back into the spotlight last year."
    },
    {
        "title": "King left as 'piggy in the middle' over Canada-US stand-off",
        "description": "It's hard to imagine it, but sometimes the King just has to do as he's told.",
        "url": "https://news.sky.com/story/king-left-as-piggy-in-the-middle-over-canada-us-stand-off-13367745",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mark-carney-king-charles_6859841.jpg?20250317170609",
        "type": "US",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-14 13:18:00",
        "Headline": "Mark Carney told Sky News that Canadians \"weren't impressed\" when the UK offered Donald Trump a second state visit to the UK. It will be worth watching the reaction from Canadians when the King and Queen visit Ottawa later this month.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  It's hard to imagine it, but sometimes the King just has to do as he's told. At least when it comes to the wishes of his governments and prime ministers in his Commonwealth realms, and just sometimes, that puts him in a difficult position. The row between America and Canada is a prime example, the two countries in this stand-off with each other, with the King frankly left as piggy in the middle. And that's because his prime ministers, both Sir Keir Starmer and Mark Carney, know just how priceless royal soft diplomacy can be. It is surprising and striking that Carney has been so blatant when he admits that inviting King Charles to open parliament is a display of sovereignty. It's often left to the optics of the moment to speak for themselves. But at a time when Donald Trump has been making those 51st state comments, Carney has to deploy whatever he can. While probably not surprising, it may be difficult for the monarch and his advisors to hear how badly the offer of a state visit by Starmer to Trump has gone down in Canada. A state visit that Starmer knew was ultimately going to help the UK seal a deal with the US.  But it will make the reaction from Canadians to the King and Queen worth watching when they go to Ottawa in two weeks' time. There is not a lot that the King can do about that, except continue to show his support and affection for Canada. We've certainly seen that in spades in recent months with various meetings with Canadians at Buckingham Palace, many made as public as possible with cameras invited in to capture them. The palace tells us it's not a step change or a deliberate shift of focus, but it has felt more pronounced in the current climate. Read more from Sky News:King reaffirms commitment to CanadaCarney: 'We will never be part of US' We often talked about Queen Elizabeth's quiet influence on the world stage, but you have to remember for 70 years her son Charles was there, watching, learning and very regularly stepping in at the highest level to help achieve the diplomatic aims of the government of the day. He knows what his role is and the \"constitutional guard rails\" that his aides will often refer to, that he must operate within. In fact, as a man who I'm told constantly asks \"what more can I do\", I suspect he is, in some ways, enjoying the role he knows he can and must play in this current turbulence. Talk to anyone in diplomatic circles and they will always tell you we shouldn't underestimate the power of a listening ear or a quiet word over a cup of tea, a speciality in which the royal family excel."
    },
    {
        "title": "Canadians 'not impressed' by UK's invitation to Trump, Mark Carney tells Sky News",
        "description": "Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News.",
        "url": "https://news.sky.com/story/canadians-werent-impressed-by-second-uk-state-visit-for-trump-mark-carney-says-13367469",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-mark-carney-canada_6915777.jpg?20250514074709",
        "type": "US",
        "Author": "Samantha Washington",
        "Date Published": "2025-05-14 04:14:00",
        "Headline": "Canada's newly elected prime minister sat down with Sky News' Sam Washington to discuss dealing with a noisy neighbour in Donald Trump and Canada's relationship to the UK.",
        "Content": "\n          Presenter\n        Canadians \"weren't impressed\" by the decision of the UK government to offer Donald Trump an unprecedented second state visit to the UK, the country's prime minister has told Sky News. Sir Keir Starmer handed the invitation to the US president during a visit to the Oval Office. The newly elected Liberal leader Mark Carney said that the invitation \"cut across clear messages\" that the Canadian government was trying to send to the White House in response to their threats against Canada's sovereignty. \"I think, to be frank, they [Canadians] weren't impressed by that gesture... given the circumstance. It was at a time when we were being quite clear about the issues around sovereignty.\" Explained: Who is Mark Carney? It comes as the Canadian prime minister has invited the King, who is Canada's head of state, to open its parliament later this month in a \"clear message of sovereignty\". It is the first time the sovereign has carried out this function in nearly 50 years and Mr Carney says it's \"not coincidental\". \n                  King left as 'piggy in the middle' over Canada-US stand-off\n                 \n                  Mark Carney's body language during his Trump meeting spoke volumes\n                 \n                  Did Trump just win the election for Canada's Mark Carney?\n                 \"All issues around Canada's sovereignty have been accentuated by the president. So no, it's not coincidental, but it is also a reaffirming moment for Canadians.\" The former Bank of England governor was re-elected after a campaign fought on the promise of standing up to American threats to Canadian statehood. He had refused to speak to Mr Trump until Canadian sovereignty was respected.  It followed Mr Trump threatening to make Canada the 51st state of the US. Mr Carney justified making his first foreign trip as prime minister to the White House by stating Mr Trump had changed his intentions to annex Canada from an \"expectation to a desire\". \"He was expressing a desire. He'd shifted from the expectation to a desire. He was also coming from a place where he recognised that that wasn't going to happen. \"Does he still muse about it? Perhaps. Is it ever going to happen? No. Never.\" The high-stakes meeting in the Oval Office was not confrontational, with Mr Carney praising the president's approach as \"very on top of the essence of a wide range of issues\" and \"able to identify the points of maximum leverage, both in a specific situation but also in a geopolitical situation\". Presenter Fractured geopolitical relations have produced an interesting phenomenon: two Commonwealth nations both deploying their head of state, King Charles, to manage the vagaries of Donald Trump. For Canada, and its new prime minister, Mark Carney, the King is being unveiled at the opening of Parliament in Ottawa later this month as an unequivocal spectacle and symbol of sovereignty. For the UK, Sir Keir Starmer is positioning the monarch as a bridge and has proffered a personal invitation from King Charles to the president for an unprecedented second state visit in order to facilitate negotiations over trade and tariffs. This instrumentalisation of the crown, which ordinarily transcends politics, has created tension between the historically close allies. Canadians view the UK's red carpet treatment of a leader who is openly threatening their sovereignty as a violation of Commonwealth solidarity, while the British seem to have no compunction in engaging in high-level realpolitik. The episode is emblematic of how pervasive disruptive American influence is and how extreme measures taken to combat it can aggravate even the most enduring alliances. Since the meeting, tensions between the two countries have abated.  Further negotiations on trade and security are expected soon. Given the deep economic integration of the two nations, neither side expects a deal imminently, but both sides concur that constructive talks have led to progress on an agreement. With greater goodwill between the two North American neighbours, Mr Carney also expressed optimism about Mr Trump's efforts to broker peace between Ukraine and Russia. The prime minister confirmed his view that the president was an \"honest broker\" and that his counterpart had been \"helpful\" in bringing momentum to a 30-day ceasefire between the warring nations. Despite a reset in relations between the United States and Canada, Mr Carney remained circumspect. His motto is: \"Always plan for the worst.\" Read more from Sky News:Trump signs deals in Saudi Arabia - with murder long forgottenMenendez brothers' murder sentences reduced And to that end, nothing is being taken for granted: \"We do plan for having no deal, we do plan for trouble in the security relationship. We do plan for the global trading system not being reassembled: that's the way to approach this president.\""
    },
    {
        "title": "Foreign states face 15% newspaper ownership limit amid Telegraph row",
        "description": "Foreign state investors would be allowed to hold stakes of up to 15% in British national newspapers, ministers are set to announce amid a two-year battle to resolve an impasse over The Daily Telegraph's ownership.",
        "url": "https://news.sky.com/story/foreign-states-face-15-newspaper-ownership-limit-amid-telegraph-row-13367680",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-daily-telegraph-newspaper_6774322.jpg?20241212171804",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-14 11:52:00",
        "Headline": "Ministers are to impose the new threshold on foreign state ownership amid a two-year row about the future ownership of The Daily Telegraph, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Foreign state investors would be allowed to hold stakes of up to 15% in British national newspapers, ministers are set to announce amid a two-year battle to resolve an impasse over The Daily Telegraph's ownership. Sky News has learnt that the Department for Culture, Media and Sport could announce as soon as Thursday that the new limit is to be imposed following a consultation lasting several months. The decision to set the ownership threshold at 15% follows an intensive lobbying campaign by newspaper industry executives concerned that a permanent outright ban could cut off a vital source of funding to an already-embattled industry. It would mean that RedBird IMI, the Abu Dhabi state-backed fund which owns an option to take full ownership of the Telegraph titles, would be able to play a role in the newspapers' future. Money blog: £30 broadband rule explained RedBird Capital, the US-based fund, has already said it is exploring the possibility of taking full control of the Telegraph, while IMI would have - if the status quo had been maintained - forced to relinquish any involvement in the right-leaning broadsheets. One industry source said they had been told to expect a statement from Lisa Nandy, the culture secretary, or another DCMS minister, this week, with the amendment potentially being made in the form of a statutory instrument. \n                  Efune races to salvage Telegraph deal as exclusivity period ends\n                 \n                  Apollo in talks to finance New York Sun-owner's £550m Telegraph bid\n                 \n                  Zahawi approaches former Tory treasurer Mansour to fund Telegraph bid\n                 Other than RedBird, a number of suitors for the Telegraph have expressed interest but struggled to raise the funding for a deal. The most notable of these has been Dovid Efune, owner of The New York Sun, who has been trying for months to raise the £550m sought by RedBird IMI to recoup its outlay. Another potential offer from Todd Boehly, the Chelsea Football Club co-owner, and media tycoon David Montgomery, has yet to materialise. RedBird IMI paid £600m in 2023 to acquire a call option that was intended to convert into ownership of the Telegraph newspapers and The Spectator magazine. That objective was thwarted by a change in media ownership laws - which banned any form of foreign state ownership - amid an outcry from parliamentarians. The Spectator was then sold last year for £100m to Sir Paul Marshall, the hedge fund billionaire, who has installed Lord Gove, the former cabinet minister, as its editor. The UAE-based IMI, which is controlled by the UAE's deputy prime minister and ultimate owner of Manchester City Football Club, Sheikh Mansour bin Zayed Al Nahyan, extended a further £600m to the Barclays to pay off a loan owed to Lloyds Banking Group, with the balance secured against other family-controlled assets. Other bidders for the Telegraph had included Lord Saatchi, the former advertising mogul, who offered £350m, while Lord Rothermere, the Daily Mail proprietor, pulled out of the bidding last summer amid concerns that he would be blocked on competition grounds. The Telegraph's ownership had been left in limbo by a decision taken by Lloyds Banking Group, the principal lender to the Barclay family, to force some of the newspapers' related corporate entities into a form of insolvency proceedings. The newspaper auction is being run by Raine Group and Robey Warshaw. The DCMS declined to comment."
    },
    {
        "title": "Burberry to cut 1,700 jobs after multi-million pound loss",
        "description": "Burberry, the UK's only global luxury brand, is to cut around 1,700 jobs worldwide over the next two years after reporting a steep financial loss. ",
        "url": "https://news.sky.com/story/burberry-to-cut-1700-jobs-after-multi-million-pound-loss-13367511",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-burberry-trench-coat_6626574.jpg?20240715094828",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-14 07:20:00",
        "Headline": "The British brand has struggled amid a global luxury slowdown and worse-than-expected tariffs, but business in the UK continues to be \"seriously impacted\" by the absence of VAT refunds for overseas visitors, making the UK \"the least competitive destination in Europe for tourist shopping\".",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Burberry, the UK's only global luxury brand, is to cut around 1,700 jobs worldwide over the next two years after reporting a steep financial loss.  The company lost £66m in pre-tax profit in the year ended in March as luxury goods sales fell across the world and the company weathered an \"uncertain\" environment and a \"difficult macroeconomic backdrop\". A year earlier, it recorded £383m in profit. Money blog: £30 broadband rule explained It's suffered in recent years with the share price falling to such an extent the business was removed from the FTSE 100, the index of most valuable companies listed on the London Stock Exchange. Despite the financial performance, the company was upbeat, with chief executive Joshua Schulman saying \"I am more optimistic than ever that Burberry's best days are ahead and that we will deliver sustainable profitable growth over time\". What cuts are being made? \n                  Luxury store Harrods is latest retail victim of cyber attackers\n                 \n                  Hundreds of jobs at risk as The Original Factory Shop launches survival plan\n                 \n                  Hobbycraft to axe stores and jobs in radical restructuring\n                 The retailer did not specify any shop closures - in the past year, it closed 26 and also opened 26 stores - but did highlight shift cuts and consolidations. \"We don't have a store closing programme, per see,\" Mr Schulman told investors The night shift at Burberry's Castleford factory will be cut, it proposed, saying the shift has resulted in overproduction. \"Significant\" investment in the facility will be made, however, as the ambition is to scale up British production \"over time\", Mr Schulman said. Changes to the retail network across the world will be made with shop staff being scheduled around \"peak traffic\". Burberry will be \"realigning\" shop staff, he said, \"so that we can offer the best service\" at the busiest times. There will also be a \"simplification\" of Burberry's regional structure and a \"rebalancing\" of central and regional responsibilities to reduce duplication and \"accelerate decision making\" through the retail network. But the majority of changes will be made to \"office space teams\" around the world, the CEO said. Commercial and creative teams have already been consolidated, Burberry's annual results said. Shares rose by 20% on news of the cost-cutting plan. What's gone wrong? Aside from the global slowdown in luxury goods sales over recession fears, additional headwinds have come in the form of President Trump's tariffs. \"Clearly, the external environment has become more challenging since mid-February\", Mr Schulman told investors.  Tariff risks were higher than first planned, the annual results said. It led the US market to be described by Mr Schulman as \"choppy\" since February when Mr Trump began announcing tariffs on Mexico, Canada and China, as well as on goods such as steel and cars. Sales also fell in the Asia Pacific region by 16%, the results showed. Criticism was levelled at the 2021 British government decision to withdraw VAT refunds for overseas visitors, \"which has made the UK the least competitive destination in Europe for tourist shopping\", the results read. \"Business in our UK home market continues to be seriously impacted\" by the move."
    },
    {
        "title": "Co-op updates on recovery after cyber attack forced empty shelves",
        "description": "The Co-op has said food stocks will start to recover from the weekend as it battles back from a cyber attack that forced it to take key systems offline.",
        "url": "https://news.sky.com/story/co-op-updates-on-recovery-after-cyberattack-forced-empty-shelves-13367653",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-co-op-shop-cyber_6916098.jpg?20250514125720",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-05-14 11:21:00",
        "Headline": "The member-owned group says grocery supplies will not start to improve until the weekend as it begins the \"recovery phase\" of its fightback from last month's hack.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The Co-op has said food stocks will start to recover from the weekend as it battles back from a cyber attack that forced it to take key systems offline. The member-owned group's grocery stores, along with those of regional Co-operatives, Nisa and Costcutter - have been increasingly suffering shortages since the attack on the group was declared on 30 April. Co-op customers found last week that while stores remained open, the number of empty shelves was expanding by the day as the mutual stopped taking many orders and sought to prioritise deliveries to remote, rural shops. Money latest: Are pints really that more expensive in London? Co-op said it had fully restored its stock ordering systems to allow for a resumption of activity within its supply chain, but admitted that it amounted to a \"recovery phase\" as getting back to normal would take time. It is widely believed the group fell victim to the same hackers that targeted Marks & Spencer and Harrods towards the end of April. Both M&S and the Co-op have admitted that personal customer data was snatched but say the thefts were limited to names and contact details, with payment details safe. \n                  'China-based' hack targets UK companies in 'critical national security threat', says analyst\n                 \n                  What should M&S customers do after criminals stole personal data in huge attack?\n                 \n                  M&S says customers' personal data taken by hackers\n                 Each was unable to accept several forms of payment as they grappled to secure their respective IT systems in the immediate aftermath of the attacks, believed to be the work of a group known as Scattered Spider. Read more:Who are the Scattered Spider group?M&S admits personal data taken in cyber attackWhat should M&S customers do after cyber attack? Experts say both are set to face financial hits worth many millions of pounds. Lost sales, the cost of clearing up the attacks and investment in new IT infrastructure to make their systems safer are among the headwinds. M&S has been unable to accept any online business since 25 April. A Co-op spokesperson said: \"Following the malicious third-party cyber attack, we took early and decisive action to restrict access to our systems in order to protect our Co-op. \"We are now in the recovery phase and are taking steps to bring our systems gradually back online in a safe and controlled manner.\""
    },
    {
        "title": "Evri and DHL UK merger to deliver stronger Royal Mail rival",
        "description": "A tie-up between Evri and DHL's UK parcel delivery business has been agreed, potentially creating a larger rival to Royal Mail.",
        "url": "https://news.sky.com/story/evri-and-dhl-uk-merger-planned-to-deliver-royal-mail-rival-13367814",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-evri-delivery-depot_6916353.jpg?20250514161327",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-14 15:12:00",
        "Headline": "The pair say the tie-up, once approved, will lead to greater choice and price competitiveness in the UK market.",
        "Content": "A tie-up between Evri and DHL's UK parcel delivery business has been agreed, potentially creating a larger rival to Royal Mail. The merger, which is subject to scrutiny and approval by the Competition and Markets Authority, will see DHL Group take a \"significant minority stake\" in Evri. The pair will operate in future as Evri Group. The planned combination will bring together more than 30,000 couriers and van drivers, and 12,000 further workers, handling more than one million parcels and one million letters per year at current levels. Money latest: UK pint price map revealed The business will be led by Evri's chief executive Martijn de Lange, the pair said in a statement. The proposed deal, which will see Evri handle letter deliveries for the first time, would lead to greater choice and cost-competitive solutions, they said. Mr de Lange added: \"We are excited that DHL ecommerce UK will merge with Evri to bring together two highly complementary UK businesses, committed to innovation and offering customers and clients the best possible service. \n                  Foreign states face 15% newspaper ownership limit amid Telegraph row\n                 \n                  Money blog: UK pint price map; bad news for NatWest customers; major change at Airbnb\n                 \n                  Burberry to cut 1,700 jobs after multi-million pound loss\n                 \"By combining Evri's scale, innovation and DHL ecommerce's best-in-class premium van network, we are creating the pre-eminent parcel delivery group in the UK.\" Read more from Sky News:Foreign states face 15% newspaper ownership limit Burberry to cut 1,700 jobs in turnaround planCo-op reveals big update on cyberattack recovery The agreement was announced as Royal Mail's parent company comes under the ownership of Czech billionaire Daniel Kretinsky's EP Group, following a protracted £3.6bn takeover. Royal Mail was long a drag on the performance of the IDS group amid a series of bitter union rows with Royal Mail management. The Communication Workers Union later accepted a series of commitments from EP Group to win its approval for the deal."
    },
    {
        "title": "French police investigating series of crypto kidnappings with executives tied up and their fingers cut off",
        "description": "Authorities in France are investigating a series of kidnappings linked to the world of cryptocurrencies.",
        "url": "https://news.sky.com/story/french-police-investigating-series-of-crypto-kidnappings-with-executives-tied-up-and-their-fingers-cut-off-13367737",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-bitcoin-us-regulators_6417798.jpg?20240111003454",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-14 13:10:00",
        "Headline": "On Tuesday, a cryptocurrency platform owner's daughter was reportedly ambushed in a Paris street. On 29 April, a crypto marketing firm owner was attacked in another of the city's streets and discovered two days later with his finger cut off.",
        "Content": "Authorities in France are investigating a series of kidnappings linked to the world of cryptocurrencies. The most recent incident saw a businessman's daughter violently ambushed in the street in Paris. It took place on Rue Pache in the French capital's 11th arrondissement on Tuesday morning. Captured on video and shared widely online, three masked men appear from a parked van and begin wrestling a woman to the ground. After failing to snatch her amid the struggle, they retreat to the van and drive off. According to reports, the target's father is the co-founder of French cryptocurrency exchange platform Paymium. She is believed to be 34 and was with her partner at the time. Prosecutors have not confirmed the victim's identity but have launched an investigation led by the organised crime unit of the Paris police force. Authorities are now looking into whether the recent string of incidents are linked. On Wednesday, French interior minister Bruno Retailleau promised to meet figures from across the crypto sector to make them aware of the current risks and promote measures they can take to protect themselves. Company owner also targeted in Paris Tuesday's incident comes after another on 29 April, which saw a crypto marketing firm owner kidnapped and held to ransom for more than two days before being found with his finger cut off. At around 10.30am on 29 April, the 60-year-old, who co-owned his business in Malta with his son, was kidnapped by four men in ski masks as he walked down a street in Paris's 14th arrondissement. After they forced him into a van, he was eventually discovered two days later during a raid of a property in Essonne, 12 miles south of Paris. Read more from Sky NewsSenators try to ban Trump's 'corrupt' crypto schemes£1.5bn in cryptocurrency stolen in biggest hack everWhat we know about the Bybit heist While he was being held, his attackers demanded a ransom of between £4m and £6m but failed to extort any money, newspaper Le Parisien reported. Five suspects, aged between 20 and 27, were arrested at the scene of the raid, which took place around 9pm. They remain under investigation Essonne's state prosecutor said in a statement: \"The victim appears to be the father of a man who made his fortune in cryptocurrencies, with the crime involving a ransom demand.\" Co-founder and his wife abducted from home On 21 January, David Balland, the co-founder of crypto firm Ledger, and his wife were abducted from their home in Mereau, central France. The attack happened in the early hours of the morning, with suspects separating the couple immediately and taking Balland to a house in the nearby town of Chateauroux, where they also cut one of his fingers off. Police were alerted to the kidnapping by Mr Balland's business partner who had received a video of his severed finger with a demand for a €10m cryptocurrency payment. Detectives traced and freed him, finding his wife tied up in the boot of a vehicle in a car park in Essonne the following day. Nine people were arrested and are still under investigation. Crypto influencer's father kidnapped In December last year, the father of another French cryptocurrency influencer was targeted at his home in eastern France alongside his wife and daughter. Their attackers tied them up and forced the 56-year-old man into a car, driving him away before demanding a ransom from his son, who lives in Dubai. The son contacted police and his mother and sister were quickly freed. His father was found tied up in the boot of a car in Normandy, showing signs of having suffered physical violence and been sprayed with petrol. Other similar incidents have also been reported in Spain and Belgium in recent months."
    },
    {
        "title": "What should M&S customers do after criminals stole personal data in huge attack?",
        "description": "The personal data of M&S customers has been stolen by hackers during a huge cyber attack that may have cost the company millions.&#160;",
        "url": "https://news.sky.com/story/what-should-ms-customers-do-after-criminals-stole-personal-data-in-huge-attack-13367614",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-14 10:08:00",
        "Headline": "Despite M&S reassuring customers they need to take \"no action\" aside from changing their password next time they log in, cybersecurity experts are worried.",
        "Content": "\n          Science and Technology reporter\n       The personal data of M&S customers has been stolen by hackers during a huge cyber attack that may have cost the company millions.  So what should those customers do now? The retail giant admitted on Tuesday that some data had been stolen but reassured customers that no \"usable payment or card details\" were taken. Read more: M&S says customers' personal data taken by hackers Passwords were also not included in the stolen data but there are reports that contact details like names, addresses and phone numbers were taken. There is no evidence the data has been shared, M&S confirmed to Sky News on Wednesday. Despite M&S saying customers \"do not need to take any action\" aside from changing their password next time they log in, cybersecurity experts are worried. \n                  Co-op updates on recovery after cyber attack forced empty shelves\n                 \n                  'China-based' hack targets UK companies in 'critical national security threat', says analyst\n                 \n                  M&S says customers' personal data taken by hackers\n                 Here's what they want you to do if you have an M&S account. Watch out for phishing scams \"We often see a spike in phishing emails, fake delivery texts and scam calls after breaches like this, particularly when order history or usernames are involved,\" said Charlotte Wilson, head of enterprise at cybersecurity firm Check Point. \"This is not about panic, but it is a reminder that cybersecurity is not just about technology,\" she said. These scams can appear more convincing because hackers can include personal details like your name, address or phone number, stolen in attacks like the one on M&S. \"Some criminals may impersonate a well-known organisation and convince victims of their credibility by providing their name, address and date of birth - before using this false credibility to scam the victim out of their money,\" said Sam Kirkman from NetSPI.  In fact, the criminal group reportedly behind the M&S attack is known to use tactics like this to scam people. Rather than using software to hack past company firewalls, Scattered Spider hackers target human vulnerabilities and trick people into giving them access. Read more from Sky News:QR codes linked to online drugsCould UK get US-style 'supermax' jails? \"Remember that we will never contact you and ask you to provide us with personal account information, like usernames, and we will never ask you to give us your password,\" said M&S operations director Jayne Wall in a message to customers. Stop, challenge, protect Mr Kirkman recommends following the \"stop\", \"challenge\" and \"protect\" steps of Take Five, a national campaign aimed at protecting people from cybercrime: Change passwords M&S said no passwords were stolen in the data breach but Clare Loveridge from cybersecurity firm Arctic Wolf still says it is a \"good idea\" to change their passwords across all online accounts. \"Likewise, taking additional steps like activating two-step authentication will also improve protection, if it's not been done already,\" she said. This is because attackers may test reused passwords or login credentials stolen in previous data breaches. \"Stolen personal data can still be used as pieces of a puzzle by fraudsters,\" said Tim Grieveson, from ThingsRecon."
    },
    {
        "title": "Former Greene King chief swoops on former estate with £90m pubs deal",
        "description": "A pub group founded by the ex-boss of Greene King is in advanced talks to buy a swathe of sites from his former employer in a &#163;90m deal.",
        "url": "https://news.sky.com/story/former-greene-king-chief-swoops-on-former-estate-with-16390m-pubs-deal-13367519",
        "image_url": "https://e3.365dm.com/18/11/1920x1080/skynews-rooney-anand-greene_4503584.jpg?20210119142906",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-14 07:55:00",
        "Headline": "Rooney Anand, who chairs RedCat Pub Group, is in advanced talks to buy 39 pubs-with-rooms in a deal that will double the size of its operations, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A pub group founded by the ex-boss of Greene King is in advanced talks to buy a swathe of sites from his former employer in a £90m deal. Sky News has learnt that RedCat Pub Group, which was established by Rooney Anand during the Covid pandemic, is close to finalising the purchase of 39 pub-hotels from Greene King. Sources said a deal could be struck within days. RedCat, which is backed by the US investor Oaktree Capital Management, has had a mixed track record since it was founded in 2021. The company trades from roughly 100 sites, about a third of which operate under a subsidiary called The Coaching Inn Group. The unit has about 1,400 bedrooms, making it the fourth-largest pubs-with-rooms operator in the UK. One source said the deal with Greene King would double the size of that division by number of sites. \n                  Foreign states face 15% newspaper ownership limit amid Telegraph row\n                 \n                  Money blog: UK pint price map; bad news for NatWest customers; major change at Airbnb\n                 \n                  Burberry to cut 1,700 jobs after multi-million pound loss\n                 A small part of RedCat's operations fell into administration last year, since when a refinancing backed by Barclays has given the company significant financial breathing space. Mr Anand stepped down as Greene King's chief executive in 2019. His latest deal comes amid dire warnings from hospitality chiefs about the prospects for the sector, amid swingeing tax hikes and jittery consumer confidence. Greene King declined to comment, while RedCat has been contacted for comment."
    },
    {
        "title": "Private investor snaps up London Sphere site for £40m",
        "description": "The east London site which had been earmarked for a Las Vegas-style Sphere entertainment venue is being sold to a private investment group after the development plans were blocked by Sir Sadiq Khan, the London mayor.",
        "url": "https://news.sky.com/story/private-investor-snaps-up-london-sphere-site-for-16340m-13367520",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-madison-square-garden_6415281.jpg?20240108175100",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-14 08:00:00",
        "Headline": "Hallmark, a private property investment group, is buying the site in Stratford, east London, which was intended to be the location of a Las Vegas-style entertainment venue, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The east London site which had been earmarked for a Las Vegas-style Sphere entertainment venue is being sold to a private investment group after the development plans were blocked by Sir Sadiq Khan, the London mayor. Sky News understands that Hallmark, a family-owned property investor, has agreed to acquire the 4.7-acre site, which has been vacant since being used as a coach park during the 2012 London Olympics. One source said Hallmark was understood to be paying between £30m and £40m for the real estate. The land had been bought by Madison Square Garden Entertainment with the objective of turning it into one of the world's leading live music and leisure destinations. A planning process which took place over several years led to executives at the US-based company confident that the scheme had the backing of the London mayor. In November 2023, however, Sir Sadiq blocked the development of the 300-feet tall, 21,000-capacity venue, citing the impact of light pollution on local communities. Michael Gove, the then housing secretary, called in the decision to reject the planning application several weeks later with a view to it being overturned. \n                  Foreign states face 15% newspaper ownership limit amid Telegraph row\n                 \n                  Money blog: UK pint price map; bad news for NatWest customers; major change at Airbnb\n                 \n                  Burberry to cut 1,700 jobs after multi-million pound loss\n                 Several weeks later, however, Sphere Entertainment Co, a sister company to MSG Entertainment, informed the government that it was abandoning its plans. Las Vegas's technologically advanced version of The Sphere has been the subject of worldwide interest since opening in 2023, featuring musicians including U2 and adorning its exterior surface with images including a giant eyeball and a motor racing helmet. Neither MSG nor Hallmark could be reached for comment on Wednesday."
    },
    {
        "title": "Sir Keir Starmer defends 'tiny tariff' deal and tells Kemi Badenoch: 'Get on the train to Solihull' ",
        "description": "Sir Keir Starmer has told Kemi Badenoch to \"get on the train to Solihull\" and talk to workers at Jaguar Land Rover after she mocked his \"tiny\" US trade deal.&#160;",
        "url": "https://news.sky.com/story/sir-keir-starmer-defends-tiny-tariff-deal-and-tells-kemi-badenoch-get-on-the-train-to-solihull-13367675",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-trump-starmer_6910412.jpg?20250508192103",
        "type": "Business",
        "Author": "Faye Brown",
        "Date Published": "2025-05-14 13:56:00",
        "Headline": "Tory leader Kemi Badenoch mocked the prime minister's deal with the US to reduce Donald Trump's tariffs at a fiery PMQs session. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has told Kemi Badenoch to \"get on the train to Solihull\" and talk to workers at Jaguar Land Rover after she mocked his \"tiny\" US trade deal.  The Conservative leader said that the prime minister should \"not over-egg the pudding\" after Donald Trump agreed to bring down car tariffs from 27.5% to 10%, and scrap 10% tariffs on steel. 'I very much enjoyed your speech,' Farage tells PM Ms Badenoch said the UK is still in a \"worse position\" than before the levies were announced, telling PMQS: \"I'm very happy to welcome these tiny tariffs. \"But the fact is, it has put us in a worse position than we were in March. He should not over-egg the pudding.\" She said that things are \"getting worse\" for businesses, with the ONS estimating there are 100,000 fewer jobs now than a year ago, even before the employer national insurance rise has kicked in. Sir Keir hit back that she should \"get the train to Solihull\" and speak to workers at the JLR factory there and \"tell them she would rip up the deal that protects their jobs\". \"When she's done that, she might travel across to Scunthorpe and tell the steelworkers there that she's going to rip up the deal that saves their jobs. \"And if she's got time, go up to Scotland and talk to the whisky distilleries, tell them I should rip up the deal that's creating 1200 jobs for them, boosting their exports, and then come back here next week and tell us what reaction she got.\" Sir Keir is the first world leader to have secured a trade deal with Mr Trump since he announced the tariffs as part of a package of global measures. For the UK, that included a baseline 10% levy on all goods going into the US, which remains in place. Ministers have indicated that work is ongoing to remove remaining levies, but say what was secured is significant, as it saved thousands of jobs that were imminently at risk. The deal came days after the UK and India struck an \"ambitious\" trade agreement that will slash tariffs on products such as whisky and gin. And as Mr Trump said himself, the Tories spent years trying to strike a deal with Washington but it was only achieved \"under this prime minister\". But while the agreement has given Sir Keir a boost, it comes against a difficult economic backdrop at home. Unemployment row  Official figures on Tuesday showed wage rises are slowing and there are fewer jobs on offer as employers grapple with higher costs.  The Tories have blamed the government's rise in employer national insurance, which they call a \"jobs tax\", on the plight of British businesses, with Ms Badenoch repeatedly using PMQs to attack it. Elsewhere in Wednesday's exchange, she called on Sir Keir to promise that unemployment will be lower by this time next year, claiming it has gone up by 10% since the general election because of Labour's policies. This claim was later disputed by Labour MP Jake Richards in a point of order, who claimed the unemployment statistic was incorrect. Read More:Canadians 'not impressed' by Trump invite to UK, Carney saysUK-US deal 'isn't worth the paper it's written on', says economist  The figure she cited is based on the number of unemployed people but does not take into account population growth, which is more consistent in tracking trends. According to the Office for National Statistics (ONS), the unemployment rate, which measures working age people, is up from 4.3% to 4.5% since July 2024. Sir Keir said Ms Badenoch \"must be the only person left in the country who thinks the economy was booming after the last government\". \"We've created new jobs, record investment, trade deals that they tried, the India deal, I think they tried for eight years and failed. We did that deal. They talked about a US deal. We did that deal. \"A once great political party is sliding into brain-dead oblivion.\""
    },
    {
        "title": "Top Tory caught admitting Brexit drawback in leaked clip",
        "description": "One of Kemi Badenoch's top team has admitted there were flaws in the plan to return illegal migrants after Brexit, Sky News can reveal.",
        "url": "https://news.sky.com/story/leaked-recording-reveals-top-tory-knew-of-flaws-in-post-brexit-plan-to-return-illegal-migrants-13367821",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-chris-philp-tory-mp_6815358.jpg?20250131111755",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-05-14 15:40:00",
        "Headline": "In response tonight, the Tories insisted that Chris Philp was not saying the Tories did not have a plan for how to handle asylum seekers post Brexit.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  One of Kemi Badenoch's top team has admitted there were flaws in the plan to return illegal migrants after Brexit, Sky News can reveal. Boris Johnson repeatedly told the public that Brexit would mean taking back control of Britain's borders and migration system. Plans unveiled to ease prisons crisis - politics latest But in a leaked recording obtained by Sky News, Chris Philp, now shadow home secretary, said Britain's exit from the EU - and end of UK participation in the Dublin agreement which governs EU-wide asylum claims - meant they realised they \"can't any longer rely on sending people back to the place where they first claimed asylum\". Mr Philp appeared to suggest the scale of the problem surprised those in the Johnson government. \"When we did check it out… (we) found that about half the people crossing the Channel had claimed asylum previously elsewhere in Europe.\" In response tonight, the Tories insisted that Mr Philp was not saying the Tories did not have a plan for how to handle asylum seekers post Brexit. Mr Philp's comments from last month are a very different tone to 2020 when as immigration minister he seemed to be suggesting EU membership and the Dublin rules hampered asylum removals. In August that year, he said: \"The Dublin regulations do have a number of constraints in them, which makes returning people who should be returned a little bit harder than we would like. Of course, come the 1st of January, we'll be outside of those Dublin regulations and the United Kingdom can take a fresh approach.\" Mr Philp was also immigration minister in Mr Johnson's government so would have been following the debate closely. In public, members of the Johnson administration were claiming this would not be an issue since asylum claims would be \"inadmissible\", but gave no details on how they would actually deal with people physically arriving in the country. A Home Office source told journalists once the UK is \"no longer bound by Dublin after the transition\", then \"we will be able to negotiate our own bilateral returns agreement from the end of this year\". This did not happen immediately. In the summer of 2020, Mr Johnson's spokesman criticised the \"inflexible and rigid\" Dublin regulations, suggesting the exit from this agreement would be a welcome post-Brexit freedom. Mr Philp's comments suggest a different view in private. The remarks were made in a Zoom call, part of a regular series with all the shadow cabinet on 28 April, just before the local election. Mr Philp was asked by a member why countries like France continued to allow migrants to come to the UK. He replied: \"The migrants should claim asylum in the first safe place and that under European Union regulations, which is called the Dublin 3 regulation, the first country where they are playing asylum is the one that should process their application. \"Now, because we're out of the European Union now, we are out of the Dublin 3 regulations, and so we can't any longer rely on sending people back to the place where they first claimed asylum. When we did check it out, just before we exited the EU transitional arrangements on December the 31st, 2020, we did run some checks and found that about half the people crossing the channel had claimed asylum previously elsewhere in Europe. \"In Germany, France, Italy, Spain, somewhere like that, and therefore could have been returned. But now we're out of Dublin, we can't do that, and that's why we need to have somewhere like Rwanda that we can send these people to as a deterrent.\"  Mr Johnson announced the Rwanda plan in April 2022 - which Mr Philp casts as the successor plan - 16 months after Britain left the legal and regulatory regime of the EU, but the plan was blocked by the European Court of Human Rights. Successive Tory prime ministers failed to get any mandatory removals to Rwanda, and Sir Keir Starmer cancelled the programme on entering Downing Street last year, leaving the issue of asylum seekers from France unresolved. Speaking on Sky News last weekend, Home Secretary Yvette Cooper said there has been a 20% increase in migrant returns since Labour came to power, along with a 40% increase in illegal working raids and a 40% increase in arrests for illegal working. Read More:Jenrick's leaked plan for Tory-Reform pact2020: Johnson promises change in migrant law Britain's membership of the EU did not stop all asylum arrivals. Under the EU's Dublin regulation, under which people should be processed for asylum in the country at which they first entered the bloc. However, many EU countries where people first arrive, such as Italy, do not apply the Dublin rules. The UK is not going to be able to participate again in the Dublin agreement since that is only open to full members of the EU. Ministers have confirmed the Labour government is discussing a returns agreement with the French that would involve both countries exchanging people seeking asylum. Asked on Sky News about how returns might work in future, the transport minister Lilian Greenwood said on Wednesday there were \"discussions ongoing with the French government\", but did not say what a future deal could look like. She told Sky News: \"It's not a short-term issue. This is going to take really hard work to tackle those organised gangs that are preying on people, putting their lives in danger as they try to cross the Channel to the UK. \"Of course, that's going to involve conversations with our counterparts on the European continent.\" Pressed on the returns agreement, Ms Greenwood said: \"I can confirm that there are discussions ongoing with the French government about how we stop this appalling and dangerous trade in people that's happening across the English Channel.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 A Conservative Party spokesman said: \"The Conservative Party delivered on the democratic will of this country, and left the European Union. \"The last government did have a plan and no one - including Chris - has ever suggested otherwise. \"We created new deals with France to intercept migrants, signed returns agreements with many countries across Europe, including a landmark agreement with Albania that led to small boat crossings falling by a third in 2023, and developed the Rwanda deterrent - a deterrent that Labour scrapped, leading to 2025 so far being the worst year ever for illegal channel crossings. \"However, Kemi Badenoch and Chris Philp have been clear that the Conservatives must do a lot more to tackle illegal migration. \"It is why, under new leadership, we are developing g new policies that will put an end to this problem - including disapplying the Human Rights Act from immigration matters, establishing a removals deterrent and deporting all foreign criminals.\""
    },
    {
        "title": "Sir Keir Starmer in Albania to tackle 'revolving door' of migration",
        "description": "Sir Keir Starmer is in Albania to announce an expanded crackdown on migrant smuggling gangs in the Balkans - a key staging post on the route to Britain.",
        "url": "https://news.sky.com/story/sir-keir-starmer-in-albania-to-tackle-revolving-door-of-migration-13367900",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-prime-minister_6913971.jpg?20250512111450",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-14 18:35:00",
        "Headline": "Working with officials in Albania is seen as a success story in stopping migration at source, partly due to the actions of the previous Conservative government which Sir Keir will build on.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Sir Keir Starmer is in Albania to announce an expanded crackdown on migrant smuggling gangs in the Balkans - a key staging post on the route to Britain. In the first official visit to the country by a UK prime minister, he hopes to reinforce this week's tough message about slashing levels of both legal and illegal migration. Sir Keir is relying on \"smashing the gangs\" as the government's policy to tackle small boat crossings, which remain at a record high this year; passing the 10,000 mark last month. Politics latest: New measures unveiled to stop prisons from running out of space But working with officials in Albania is seen as a success story in stopping migration at source, partly due to the actions of the previous Conservative government which Sir Keir will build on. In 2022, arrivals from Albania accounted for around a third of all small boat arrivals - a higher number than from any other country. Over the past three years, those numbers have been cut by 95%. The number of Albanians returned to their home country has also more than doubled to 5,294 last year, from just over 2,000 two years' earlier. \n                  Migration must be 'properly controlled' says home secretary - as sweeping reforms unveiled\n                 \n                  Day 100: Does Trump really 'run the country and the world'?\n                 \n                  Small boat crossings pass 10,000 at earliest point in year since records began, Sky News understands\n                 The prime minister will join Edi Rama, prime minister of Albania since 2013, at the Port of Durres on Thursday to see UK-backed efforts to tackle smuggling gangs and the criminal activities that fund them. A programme to detect migrants attempting to travel using fake or stolen documents will be expanded, with the UK donating new anti- forgery machines. The government will also invest a further £1m in DNA technology to detect serious criminals on the streets of the UK. Sir Keir is also expected to express concerns about a \"revolving door effect\" in which a migrant is returned home, only to evade law enforcement and leave the country again. He will support programmes in northern Albania - where migrants come from - to reintegrate young people and provide them with employment opportunities, the government said. The prime minister will announce that the joint migration taskforce, with Albania and Kosovo, signed at the end of 2022, will be expanded to include North Macedonia and Montenegro. The National Crime Agency will share intelligence with law enforcement agencies in these countries and deploy UK funded drones to detect gangsters funnelling migrants through the Western Balkans corridor and on to the UK. The countries of the Western Balkans - including Serbia, whose government signed an agreement with Sir Keir last year - have for around five years been the key corridor to Europe for migrants from the Middle East, Asia and Africa. Read more:Leaked recording reveals top Tory knew of flaws in post-Brexit planPlans to spend millions on 'forgotten neighbourhoods' Sir Keir will say: \"Global challenges need shared solutions, and the work the UK and Albania are doing together is delivering security for working people in both countries. \"Our joint work to deter, detect and return illegal migrants is further proof that intervening upstream to protect British shores and secure our borders is the right approach. \"Every step we take to tackle illegal migration overseas, cripple the criminal networks that facilitate it and stem the finance streams that fund it is delivering safer streets in the UK, and reducing the strain on taxpayer funded services.\" On Friday the prime minister will attend the European Political Community summit in the capital Tirana, a forum for European leaders to discuss security challenges in the wake of the war in Ukraine. It's expected to be a chance for the UK to discuss key points of a forthcoming defence pact with the EU and the terms of a \"reset\" of relations ahead of a summit in London next Monday."
    },
    {
        "title": "Foreign Office denies David Lammy and wife dodged taxi fare from Italy to France",
        "description": "The Foreign Office has denied reports that David&#160;Lammy&#160;refused to pay a taxi driver who drove him and his wife from Italy to France.",
        "url": "https://news.sky.com/story/foreign-office-denies-david-lammy-and-wife-dodged-taxi-fare-from-italy-to-france-13367869",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lancaster-house-ukraine_6913819.jpg?20250514204648",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-14 17:15:00",
        "Headline": "The government says the foreign secretary and his wife were victims of theft after a French taxi driver allegedly drove off with their luggage.",
        "Content": "The Foreign Office has denied reports that David Lammy refused to pay a taxi driver who drove him and his wife from Italy to France. An anonymous taxi driver told French media the foreign secretary became \"aggressive\" when he was asked to pay 700 euros (£590) of the 1,550 euro bill, with the remainder covered by the booking service. But the government department said Mr Lammy and his spouse were in fact victims in the case and that the driver has been charged with theft after driving off with their luggage. Politics latest: 'I very much enjoyed your speech,' Farage tells PM  The incident happened when Mr Lammy, the Labour MP for Tottenham, joined the King for a state visit to Italy in April and then took a private holiday to the Alps with his wife Nicola Green. The taxi driver took the couple more than 600 kilometres from the town of Forli in Italy to the French ski resort of Flaine. A source said the fee was paid up front to the transfer service but that the driver nevertheless insisted he was owed money and demanded to be paid in cash. Ms Green, who was speaking to the driver while Mr Lammy went into the house, told police in a statement that she felt threatened and that the taxi driver had showed her a knife in his glovebox according to the PA news agency. It is understood that after he left with their luggage, a member of the foreign secretary's office contacted the driver to get it back, and it was deposited at a police station with a \"considerable\" sum of money missing from Ms Green's bag. The anonymous driver told French newspaper La Provence he was \"the victim of assault and violence by members of a British embassy during an international transfer where they refused to pay me\". He said he had decided to leave the passengers at their destination and went to the police, where officers found diplomatic passports and a coded briefcase in the boot of his car. Read more:Leaked recording reveals top Tory knew of flaws in post-Brexit planMen's prisons could run out of space in months, government warns Ms Green does not have a diplomatic passport and Mr Lammy was travelling on his normal passport as it was a private trip. Whitehall sources denied any sensitive material was in the holiday luggage. Prosecutors opened an investigation into a \"commercial dispute\" in Bonneville in Haute-Savoie after the driver filed a complaint, according to French media. A Foreign Office spokesperson said: \"We totally refute these allegations. The fare was paid in full. \"The foreign secretary and his wife are named as victims in this matter and the driver has been charged with theft. \"As there is an ongoing legal process, it would be inappropriate to comment further.\""
    },
    {
        "title": "Plans to spend millions on 'forgotten neighbourhoods' - could yours be one of them?",
        "description": "Proposals have been drawn up to spend millions in deprived neighbourhoods which are most at risk of failing to meet the government's missions, Sky News understands. ",
        "url": "https://news.sky.com/story/plans-to-spend-millions-on-forgotten-neighbourhoods-could-yours-be-one-of-them-13367750",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/85e48d8a7bab99d7b559ac426eec03f35b659b805d9504a4a1cb0bc1b703d517_5921439.jpg?20221005213556",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-14 13:36:00",
        "Headline": "The government is mulling over new neighbourhood regeneration funding, with a final decision to be made in the June spending review, Sky News understands. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Proposals have been drawn up to spend millions in deprived neighbourhoods which are most at risk of failing to meet the government's missions, Sky News understands.  Approving the money will ultimately be a decision for the Treasury in the upcoming spending review, but it has wide support among backbench MPs who have urged the government to do for towns \"what Blair and Brown did for cities\" and regenerate them. Plans unveiled to ease prisons crisis - politics latest Labour MPs told Sky News austerity is the main driver of voters turning to Reform UK and investment is \"absolutely critical\". The plan is based on the findings of the Independent Commission on Neighbourhoods (ICON), which identified 613 \"mission-critical\" areas that most need progress on Sir Keir Starmer's \"five missions\": the economy, crime, the NHS, clean energy and education. The list of neighbourhoods has not been published but are largely concentrated around northern cities such as Manchester, Liverpool, Sunderland and Newcastle, a report said. Some of the most acute need is in coastal towns such as Blackpool, Clacton, and Great Yarmouth, while pockets of high deprivation have been identified in the Midlands and the south. Clacton is the seat of Reform UK leader Nigel Farage, who is hoping to be Sir Keir's main challenger at the next general election following a meteoric rise in the polls.  'Residents deserve better' However, Labour MP for Blackpool South Chris Webb said this wasn't about Reform - but investing in places that have been forgotten. He told Sky News: \"Coastal towns like my hometown of Blackpool have been overlooked by successive governments for too long, and it's time to change that narrative. \"The findings of the ICON report are a wake-up call, highlighting the urgent need for investment in our communities to address the alarming levels of crime, antisocial behaviour, poverty, and the stark disparities in life expectancy.\" He said he'd be lobbying for at least £1m in funding. His residents are \"understandably frustrated and angry\" and \"deserve better\". 'Investment essential to beat Reform' The spending review, which sets all departments' budgets for future years, will happen on 11 June. It will be Rachel Reeves' first as chancellor and the first by a Labour government in over a decade. Southport MP Patrick Hurley told Sky News the last Labour government \"massively invested in our big cities\" after the dereliction of the 1980s, \"but what Blair and Brown did for our cities, it's now on the new government to do for our towns\". He added: \"Investment in our places to restore pride, and improve the look and feel of where people live, is essential.\" Another Labour backbencher in support of the report, Jake Richards, said seats like his Rother Valley constituency had been \"battered by deindustrialisation and austerity\". \"Governments of different colours have not done enough, and now social and economic decay is driving voters to Farage,\" he said. \"We need a major investment programme in deprived neighbourhoods to get tough on the causes of Reform.\" Read more:Starmer defends 'tiny tariff' dealPM rejects Enoch Powell comparison  ICON is chaired by former Labour minister Baroness Armstrong of Hill Top. The report said focusing on neighbourhoods is the most efficient route to mission delivery and is likely to have more support among voters \"than grandiose national visions of transformation\" - pointing to the Tories' \"failed levelling up agenda\". The last major neighbourhood policy initiative was New Labour's \"New Deal for Communities\", which funded the regeneration of 39 of England's poorest areas. Research suggests it narrowed inequalities on its targeted outcomes and had a cost-ratio benefit. It was scrapped by the coalition government. Deputy Prime Minister and Housing Secretary Angela Rayner has already announced £1.5bn \"Plan for Neighbourhoods\" to invest in 75 areas over the next decade, with up to £20m available for each. A government source told Sky News expanding the programme \"would be a decision for the upcoming spending review\"."
    },
    {
        "title": "Ex-Reform MP Rupert Lowe will not be charged over alleged 'verbal threats'",
        "description": "Former Reform MP Rupert Lowe will not be charged after facing allegations of making threats, the Crown Prosecution Service (CPS) has said. ",
        "url": "https://news.sky.com/story/ex-reform-mp-rupert-lowe-will-not-be-charged-over-alleged-verbal-threats-13367615",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-reform-uk_6849317.jpg?20250307185645",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-05-14 10:14:00",
        "Headline": "In a lengthy statement after the CPS's decision, the Great Yarmouth MP called Nigel Farage a \"coward and a viper\" who \"must never be prime minister\". ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Former Reform MP Rupert Lowe will not be charged after facing allegations of making threats, the Crown Prosecution Service (CPS) has said.  Malcolm McHaffie, head of the Crown Prosecution Service's Special Crime Division, said after considering a number of witness statements they have concluded that there is \"insufficient evidence to provide a realistic prospect of conviction\". Politics live: Minister responds to Canadian PM's criticism of Trump state visit offer He added: \"The Crown Prosecution Service's function is not to decide whether a person is guilty of a criminal offence, but to make fair, independent, and objective assessments about whether it is appropriate to present charges for a criminal court to consider. \"Based on the careful consideration of this evidence, we have decided that our legal test for a criminal prosecution has not been met.\" Mr Lowe was suspended by Reform UK and reported to police following allegations that the MP threatened violence towards party chairman Zia Yusuf. He always denied wrongdoing and claimed he was the victim of a witch hunt after speaking out against party leader Nigel Farage in the media. \n                  Nigel Farage rules out standing in Senedd election\n                 \n                  Reform threat presents us with 'fight of our lives', admits top minister\n                 \n                  Reform won't suspend councillor who shared Hitler meme during VE Day commemorations\n                 In a lengthy statement following the CPS's decision, the Great Yarmouth MP said he was referred to the police in \"a sinister attempt to weaponise the criminal justice system against me - putting not just my political future, but my liberty at risk\". He said this was \"all because I dared to raise constructive criticisms of Nigel Farage, stood firm on deporting illegal migrants, and pushed for Reform to be run democratically - not as a vehicle to stroke one man's ego\". Reform responded \"with a brutal smear campaign\", he said, claiming figures in the party briefed journalists he had dementia. Farage 'a coward and a viper' Mr Lowe said: \"I am ashamed to have shared a parliamentary platform with them. Ashamed to have trusted them. Ashamed to have called them friends. Farage is no leader - he is a coward and a viper. I feel deeply embarrassed that I ever thought he was the man to lead. \"It's my view that the police process was weaponised to silence a party colleague who raised reasonable concerns. \"If Farage were ever to control the vast power of the British state, I believe he would not hesitate to do to his adversaries what they have tried to do to me. With real power, I fear he would wield that immense responsibility to crush dissent - as he has done time and again over the years.  \"Smearing my innocent staff in a pathetic attempt to attack me was disgusting, alongside briefings to journalists from senior Reform figures suggesting I had dementia - the lowest, vilest tactics I have seen in my 67 years. They are not fit to lead. They are not fit to be MPs.\" Mr Lowe went onto say that \"for the good of our country, Nigel Farage must never be prime minister\". In a hint at his political future he added: \"When the time soon comes, we will work together to advance a political movement that is credible, professional, decent, democratic and honest. There will, very soon, be an alternative to the rotten leadership of Reform. \"You'll be hearing a lot more from me, very soon.\" Sky News has contacted Reform UK for comment. The row poses danger for a party that has its sights on entering government at the next election after a meteoric rise in the polls. It broke out in March after Mr Lowe gave an interview to the Daily Mail in which he said it was \"too early to know\" if Mr Farage will become prime minister and warned Reform remains a \"protest party led by the Messiah\" under the Clacton MP. Soon after, Reform UK announced it had referred him to police and suspended him, alleging he made \"verbal threats\" against chairman Zia Yousaf. The party also claimed it had received complaints from two female employees about bullying in his constituency offices, which he also denied. Mr Lowe was one of the five Reform MPs elected to parliament in July and now sits as an independent. He was previously the chairman of Southampton Football Club before entering politics. During Mr Farage's online falling out with Elon Musk in January, in which the world's richest man said Reform needed a new leader, Mr Lowe drew praise from Mr Musk."
    },
    {
        "title": "Men's prisons could run out of space in months, government warns",
        "description": "Men's prisons in England and Wales could run out of space later this year, the government has warned, as it announced three new jails costing a total of &#163;4.7bn will be built starting this year.",
        "url": "https://news.sky.com/story/mens-prisons-could-run-out-of-space-in-months-government-warns-13367741",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prison-jail-cell-file_6916492.jpg?20250514183433",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-14 13:16:00",
        "Headline": "Ministers have blamed the lack of cell space on previous Conservative administrations.",
        "Content": " Men's prisons in England and Wales could run out of space later this year, the government has warned, as it announced three new jails costing a total of £4.7bn will be built starting this year. Justice Secretary Shabana Mahmood revealed the expansion plans in Downing Street alongside Amy Rees, the outgoing chief executive of His Majesty's Prison and Probation Service (HMPPS). Ms Rees outlined how the male prison population was at 99% capacity and set to run out of room in November. Politics latest: Recall conditions changed for some prisoners She highlighted issues like longer average sentences and not enough new prison capacity as contributing factors to the crisis. A high number of criminals being recalled to custody was also noted. Repeating previous schemes to release people earlier in their sentences would \"only buy us time\", Ms Rees said. Ms Mahmood went on to criticise the Conservatives, saying the situation the UK found itself in was \"shameful\". \n                  Prison violence 'out of control' as five prison officers injured at HMP Woodhill and HMP Gartree\n                 \n                  Minister does not rule out US-style 'supermax' jails for most dangerous offenders following alleged Rudakubana attack on prison officer\n                 \n                  Inside the UK's broken prison system where tinkering around the edges will no longer work\n                 She claimed Labour added 28,000 places under Sir Tony Blair and Gordon Brown's governments, while the 14 years of Tory-rule after that only saw 500 new places. The justice secretary then confirmed that £4.7bn would be invested to build new prisons. The announcement comes ahead of the spending review and Ms Mahmood says it will allow three penitentiaries to start construction.  Ms Mahmood said last year that £2.3bn would be spent on prisons, meaning a total of £7bn has been announced by the new government. The three new prisons are the same as those announced last year, and alongside HMP Millsike which has already opened. To relieve the pressure on prisons in the interim, the government said it was going to limit recall conditions for some inmates. This includes prisoners serving up to four years only being subject to recall periods of 28 days, although repeat offenders and those at higher risk will not be eligible for the limit. The plans come after the government's controversial early release scheme last year, which saw some inmates freed after serving only 40% of their sentences, rather than the usual 50%. Read more:Minister does not rule out US-style 'supermax' jails Meanwhile, the latest weekly statistics for England and Wales showed the prison population stood at 88,087. The figure is 434 below the last peak in the prison population of 88,521 inmates on 6 September 2024 - just before the early release scheme began."
    },
    {
        "title": "'China-based' hack targets UK companies in 'critical national security threat', says analyst",
        "description": "A new wave of cyber attacks against British companies is a \"critical national security threat\", an analyst has told Sky News.",
        "url": "https://news.sky.com/story/china-based-hack-targets-uk-companies-in-critical-national-security-threat-says-analyst-13367638",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cybercrime-hacker-hacking_6840137.jpg?20250226113306",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-05-14 10:50:00",
        "Headline": "Unlike the recent attacks against M&S, Co-op and Harrods, the latest incident was not ransomware but rather remote code execution.",
        "Content": "\n          Political reporter\n       A new wave of cyber attacks against British companies is a \"critical national security threat\", an analyst has told Sky News. It follows the exposure of a previously unknown vulnerability in software used by hundreds of companies. But unlike the recent attacks against M&S, Co-op and Harrods, the latest incident was not ransomware but rather remote code execution. This is where hackers take control of devices and networks over the internet to run potentially malicious programmes or steal data and information. Politics latest: Reform MP won't face charges The event - revealed by analyst Arda Buyukkaya at cybersecurity firm EclecticIQ - used a previously unknown backdoor in a piece of software called SAP Netweaver, with a patch since released. Cody Barrow is the chief executive of EclecticIQ and previously worked at the Pentagon, the NSA and US Cyber Command. He told Sky News: \"Governments should treat this as a critical national security threat\", adding that it is the kind of scenario that keeps people like him up at night. Mr Barrow said the exploitation of networks is \"extensive and ongoing\", with more than 500 SAP customers affected and more potentially at risk. He urged users to update their software to the latest version. Gas giant Cadent, publishers News UK, Euro Garages (EG) Group, Johnson Matthey and Ardagh Metal have been named as victims, with US and Saudi Arabian entities also targeted. NHS England has posted a warning about the exploit on their website, although it is not clear if they are impacted. The National Cyber Security Centre (NCSC), the UK government's authority on cyber threats and part of GCHQ, are monitoring the situation. An NCSC spokesperson told Sky News: \"We are monitoring for UK impact following reports of a critical vulnerability affecting SAP NetWeaver being actively exploited. \"The NCSC strongly encourages organisations to follow vendor best practice to mitigate the vulnerability and potential malicious activity. \"Vulnerabilities are a common aspect of cyber security, and all organisations must consider how to most effectively manage potential security issues.\" JP Perez-Etchegoyen, the chief technical officer of Onapsis - which specialises in the cybersecurity security of SAP - told Sky News that exploits of the backdoor were first observed at the start of this year, and began to increase in March. Last week, Cabinet minister Pat McFadden warned companies that recent cyber attacks on M&S, Co-op and Harrods should be a \"wake-up call\" for businesses. A spokesperson for Cadent declined to comment on the specific attack, but the company works with the NCSC on cyber security issues. A spokesperson for News UK declined to comment. EG Group, Johnson Matthey and Ardagh Metal have not responded to Sky News requests for comment. Read more from Sky News:China attempting to spy on UK onlineWarning over China-backed botnet attack According to the initial summary of the exploit, analysts linked the attacks to \"Chinese cyber-espionage units\". This was based on a variety of factors, including Chinese-named files identified as part of the hack, and the way the hackers operated. The aim of the Chinese groups is to \"operate strategically to compromise critical infrastructure, exfiltrate sensitive data, and maintain persistent access across high-value networks worldwide\", said the summary. The targets in the UK were said to include critical gas distribution networks, and water and integrated waste management utilities. 👉Listen to Politics at Sam and Anne's on your podcast app👈 A spokesperson for SAP said: \"SAP is aware of and has been addressing vulnerabilities in SAP NETWEAVER Visual Composer. SAP issued a patch on 24 April, 2025. \"A second vulnerability has also been identified and a patch was released on 13 May, 2025. \"We ask all customers using SAP NETWEAVER to install these patches to protect themselves.\" The Chinese embassy in London has been approached for comment."
    },
    {
        "title": "Glasgow Pride bans political parties from taking part amid Supreme Court row",
        "description": "Political parties have been banned from taking part in a Pride event in Scotland following the UK Supreme Court's ruling on the legal definition of a woman.",
        "url": "https://news.sky.com/story/glasgow-pride-bans-political-parties-from-taking-part-amid-supreme-court-row-13367579",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nicola-sturgeon-pride_6915916.jpg?20250514104445",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-05-14 09:26:00",
        "Headline": "Organisers said the decision was made due to \"the lack of action and delay of comment from parties\" following the landmark judgment last month.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Political parties have been banned from taking part in a Pride event in Scotland following the UK Supreme Court's ruling on the legal definition of a woman. Organisers of Glasgow's Pride said the decision was made due to \"the lack of action and delay of comment from parties\" after the landmark judgment last month. Following a long-running legal battle, judges unanimously decided the definition of a \"woman\" and \"sex\" in the Equality Act 2010 refers to \"a biological woman and biological sex\". The ruling has caused concern among the transgender community and their supporters. The fallout includes transgender women being banned from the female toilets at the Scottish parliament and being disallowed from playing in women's competitive football. In a statement shared on social media, Glasgow's Pride said organisers had written to all political parties and related groups to inform them any planned involvement had been \"suspended\". As well as a ban on taking part in the parade and hosting any stalls, there will be no speeches from political parties during the event. Politicians planning on attending are expected to do so as an individual, elected representative of their local community. The statement read: \"Within Glasgow and Scotland the support by politicians for the common good has been immense, however the lack of action and delay of comment from parties following the UK Supreme Court decision, which strongly impacts a vulnerable section of our community, is just not right. \"This has resulted in mass confusion about whether someone can use specific essential services [and] members of our community being blocked from participating in social activities such as football, which has impacted their privacy, dignity, and safety. \"This has even resulted in cis women being challenged for going into a female toilet because they have a short haircut.\" The organising committee was said to be \"deeply disappointed\" in making the decision but has done so to spur \"those with the power to do so to make the required changes\". Glasgow's Pride said it is seeking \"meaningful commitments and plans towards\": • Full and enforceable protections under the Equality Act 2010 for all, extending beyond anti-discrimination measures• Timely and dignified access to gender-affirming NHS healthcare• A reformed, accessible gender recognition process aligned with the Scottish government's doomed Gender Recognition Reform (Scotland) Bill, which was blocked by the UK government. Glasgow's Pride is due to take place on 19 July. MSP Patrick Harvie said he was \"disappointed\" with the decision but accepts why organisers have taken action. The Scottish Greens co-leader, who is bisexual, said: \"I am of course disappointed at this decision, but the betrayal of our human rights by most political parties is the cause of this horrendous situation, and I fully respect the right of Pride organisers to make this decision. \"Greens have stood solid against the current wave of prejudice, and will continue to do so. \"But it is now abundantly clear that the community has lost trust in political parties more broadly, and I urge those in leadership positions across the spectrum, and members of all parties who do support LGBTQ+ people's human rights, to put their house in order. \"Even at the lowest point of the political weaponisation of homophobia in the 80s and 90s, Pride events never felt the need to take this step. \"But even in those worst of times, the government wasn't actually imposing segregation of public spaces as is happening now to trans people. The culture war against us needs to end.\""
    },
    {
        "title": "Sir Keir Starmer says suspected arson attacks on properties linked to him are 'attack on democracy'",
        "description": "Sir Keir Starmer has said suspected arson attacks on a house he owns and another property linked to him are \"an attack on democracy\".",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-arson-on-his-family-home-is-an-attack-on-democracy-13367667",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-starmer-london_6914361.jpg?20250512170027",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-14 11:36:00",
        "Headline": "Counter-terrorism police are investigating three fires, started at two properties and a car linked to the prime minister.",
        "Content": "Sir Keir Starmer has said suspected arson attacks on a house he owns and another property linked to him are \"an attack on democracy\". The prime minister was speaking publicly about the blazes for the first time. A 21-year-old man remains in custody on suspicion of arson with intent to endanger life, following three fires over the past week. Emergency services were called to fires at the doors of two homes in north London within 24 hours of each other. One blaze was around 1.35am on Monday at a house in Kentish Town, while another was at a house converted into flats in nearby Islington the previous day. There was also a third fire where a car connected to the politician was set alight on the same street as the Kentish Town property last Thursday. Nobody was hurt in any of the suspected arson attacks, though the Kentish house's entrance was damaged. Counter-terrorism police are investigating whether the three fires are linked, and say they are all being treated as suspicious. \n                  Police given more time to question suspect over 'arson attacks' on properties linked to Starmer\n                 \n                  Government's immigration crackdown will fuel 'exodus' of nurses, union warns\n                 \n                  Sir Keir Starmer's migration package is significant - but will it be enough?\n                 Speaking at Prime Minister's Questions on Wednesday, Sir Keir said: \"This is an attack on all of us, on democracy, and the values we stand for.\" He was responding to comments made by Conservative leader Kemi Badenoch who said she wanted to express \"how horrified\" she was to hear about the incidents.  Ms Badenoch added: \"It is completely unacceptable, and I think I speak for the whole House when I say that this wasn't just on him, but on all of us, and our democracy.\" Sir Keir said her comments were \"absolutely right\". The prime minister also added that Ms Badenoch \"did actually message me pretty well straight away\" and said he really appreciated her support. Liberal Democrat leader Sir Ed Davey said: \"Can I offer my support to the prime minister and his family after the appalling arson attacks on his home, and can I echo his thanks to our brilliant police and firefighters.\" What do we know about the fires? Neighbours of the Kentish Town home described hearing a loud bang and said police officers were looking for a projectile. It is understood Sir Keir still owns the property, but it is now being rented out after the prime minister and his family moved into 10 Downing Street, following Labour's general election victory last July. On Tuesday, Dominic Murphy, the head of the Metropolitan Police's counter-terrorism command, said the force is \"working at pace and continue[s] to explore various lines of enquiry\". \"The protection of MPs is something we take extremely seriously across the whole of policing.\" Commander Murphy added that any MP who is concerned should get in touch with the force. He also said there will be an increased police presence in the area over the coming days."
    },
    {
        "title": "AIs can make collective decisions and influence each other, says new study",
        "description": "AIs are able to come to group decisions without human intervention and even persuade each other to change their minds, a new study has revealed.",
        "url": "https://news.sky.com/story/ais-can-make-collective-decisions-and-influence-each-other-says-new-study-13367824",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-phone-laptop-stock_6788259.jpg?20241230203442",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-14 15:45:00",
        "Headline": "The study could have worrying implications if artificial intelligence is placed in the wrong hands, according to one expert.",
        "Content": "\n          Science and Technology reporter\n       AIs are able to come to group decisions without human intervention and even persuade each other to change their minds, a new study has revealed. The study, carried out by scientists at City St George's, University of London, was the first of its kind and ran experiments on groups of AI agents. The first experiment asked pairs of AIs to come up with a new name for something, a well-established experiment in human sociology studies. Those AI agents were able to come to a decision without human intervention. \"This tells us that once we put these objects in the wild, they can develop behaviours that we were not expecting or at least we didn't programme,\" said Professor Andrea Baronchelli, professor of complexity science at City St George's and senior author of the study. The pairs were then put in groups and were found to develop biases towards certain names. Some 80% of the time, they would select one name over another by the end, despite having no biases when they were tested individually. \n                  AI tool used to test feelings about Botox will be rolled out by government\n                 \n                  Could AI translate animal sounds into words? Tech experts hope so\n                 \n                  Giles Martin on AI plans: 'It's like saying you can burgle my house unless I ask you not to'\n                 This means the companies developing artificial intelligence need to be even more careful to control the biases their systems create, according to Prof Baronchelli. \"Bias is a main feature or bug of AI systems,\" he said. \"More often than not, it amplifies biases that are in society and that we wouldn't want to be amplified even further [when the AIs start talking].\"  The third stage of the experiment saw the scientists inject a small number of disruptive AIs into the group. They were tasked with changing the group's collective decision - and they were able to do it.  Read more from climate, science and technology:Warning of heat impact on pregnant women and newbornsM&S says customers' personal data taken by hackersConcerns in US as Trump sells jewels of America's AI crown This could have worrying implications if AI is in the wrong hands, according to Harry Farmer, a senior analyst at the Ada Lovelace Institute, which studies artificial intelligence and its implications. AI is already deeply embedded in our lives, from helping us book holidays to advising us at work and beyond, he said. \"These agents might be used to subtly influence our opinions and at the extreme, things like our actual political behaviour; how we vote, whether or not we vote in the first place,\" he said. Those very influential agents become much harder to regulate and control if their behaviour is also being influenced by other AIs, as the study shows, according to Mr Farmer. \"Instead of looking at how to determine the deliberate decisions of programmers and companies, you're also looking at organically emerging patterns of AI agents, which is much more difficult and much more complex,\" he said."
    },
    {
        "title": "'China-based' hack targets UK companies in 'critical national security threat', says analyst",
        "description": "A new wave of cyber attacks against British companies is a \"critical national security threat\", an analyst has told Sky News.",
        "url": "https://news.sky.com/story/china-based-hack-targets-uk-companies-in-critical-national-security-threat-says-analyst-13367638",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cybercrime-hacker-hacking_6840137.jpg?20250226113306",
        "type": "Technology",
        "Author": "Tim Baker",
        "Date Published": "2025-05-14 10:50:00",
        "Headline": "Unlike the recent attacks against M&S, Co-op and Harrods, the latest incident was not ransomware but rather remote code execution.",
        "Content": "\n          Political reporter\n       A new wave of cyber attacks against British companies is a \"critical national security threat\", an analyst has told Sky News. It follows the exposure of a previously unknown vulnerability in software used by hundreds of companies. But unlike the recent attacks against M&S, Co-op and Harrods, the latest incident was not ransomware but rather remote code execution. This is where hackers take control of devices and networks over the internet to run potentially malicious programmes or steal data and information. Politics latest: Reform MP won't face charges The event - revealed by analyst Arda Buyukkaya at cybersecurity firm EclecticIQ - used a previously unknown backdoor in a piece of software called SAP Netweaver, with a patch since released. Cody Barrow is the chief executive of EclecticIQ and previously worked at the Pentagon, the NSA and US Cyber Command. He told Sky News: \"Governments should treat this as a critical national security threat\", adding that it is the kind of scenario that keeps people like him up at night. Mr Barrow said the exploitation of networks is \"extensive and ongoing\", with more than 500 SAP customers affected and more potentially at risk. He urged users to update their software to the latest version. Gas giant Cadent, publishers News UK, Euro Garages (EG) Group, Johnson Matthey and Ardagh Metal have been named as victims, with US and Saudi Arabian entities also targeted. NHS England has posted a warning about the exploit on their website, although it is not clear if they are impacted. The National Cyber Security Centre (NCSC), the UK government's authority on cyber threats and part of GCHQ, are monitoring the situation. An NCSC spokesperson told Sky News: \"We are monitoring for UK impact following reports of a critical vulnerability affecting SAP NetWeaver being actively exploited. \"The NCSC strongly encourages organisations to follow vendor best practice to mitigate the vulnerability and potential malicious activity. \"Vulnerabilities are a common aspect of cyber security, and all organisations must consider how to most effectively manage potential security issues.\" JP Perez-Etchegoyen, the chief technical officer of Onapsis - which specialises in the cybersecurity security of SAP - told Sky News that exploits of the backdoor were first observed at the start of this year, and began to increase in March. Last week, Cabinet minister Pat McFadden warned companies that recent cyber attacks on M&S, Co-op and Harrods should be a \"wake-up call\" for businesses. A spokesperson for Cadent declined to comment on the specific attack, but the company works with the NCSC on cyber security issues. A spokesperson for News UK declined to comment. EG Group, Johnson Matthey and Ardagh Metal have not responded to Sky News requests for comment. Read more from Sky News:China attempting to spy on UK onlineWarning over China-backed botnet attack According to the initial summary of the exploit, analysts linked the attacks to \"Chinese cyber-espionage units\". This was based on a variety of factors, including Chinese-named files identified as part of the hack, and the way the hackers operated. The aim of the Chinese groups is to \"operate strategically to compromise critical infrastructure, exfiltrate sensitive data, and maintain persistent access across high-value networks worldwide\", said the summary. The targets in the UK were said to include critical gas distribution networks, and water and integrated waste management utilities. 👉Listen to Politics at Sam and Anne's on your podcast app👈 A spokesperson for SAP said: \"SAP is aware of and has been addressing vulnerabilities in SAP NETWEAVER Visual Composer. SAP issued a patch on 24 April, 2025. \"A second vulnerability has also been identified and a patch was released on 13 May, 2025. \"We ask all customers using SAP NETWEAVER to install these patches to protect themselves.\" The Chinese embassy in London has been approached for comment."
    },
    {
        "title": "Co-op updates on recovery after cyber attack forced empty shelves",
        "description": "The Co-op has said food stocks will start to recover from the weekend as it battles back from a cyber attack that forced it to take key systems offline.",
        "url": "https://news.sky.com/story/co-op-updates-on-recovery-after-cyberattack-forced-empty-shelves-13367653",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-co-op-shop-cyber_6916098.jpg?20250514125720",
        "type": "Technology",
        "Author": "James Sillars",
        "Date Published": "2025-05-14 11:21:00",
        "Headline": "The member-owned group says grocery supplies will not start to improve until the weekend as it begins the \"recovery phase\" of its fightback from last month's hack.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The Co-op has said food stocks will start to recover from the weekend as it battles back from a cyber attack that forced it to take key systems offline. The member-owned group's grocery stores, along with those of regional Co-operatives, Nisa and Costcutter - have been increasingly suffering shortages since the attack on the group was declared on 30 April. Co-op customers found last week that while stores remained open, the number of empty shelves was expanding by the day as the mutual stopped taking many orders and sought to prioritise deliveries to remote, rural shops. Money latest: Are pints really that more expensive in London? Co-op said it had fully restored its stock ordering systems to allow for a resumption of activity within its supply chain, but admitted that it amounted to a \"recovery phase\" as getting back to normal would take time. It is widely believed the group fell victim to the same hackers that targeted Marks & Spencer and Harrods towards the end of April. Both M&S and the Co-op have admitted that personal customer data was snatched but say the thefts were limited to names and contact details, with payment details safe. \n                  'China-based' hack targets UK companies in 'critical national security threat', says analyst\n                 \n                  What should M&S customers do after criminals stole personal data in huge attack?\n                 \n                  M&S says customers' personal data taken by hackers\n                 Each was unable to accept several forms of payment as they grappled to secure their respective IT systems in the immediate aftermath of the attacks, believed to be the work of a group known as Scattered Spider. Read more:Who are the Scattered Spider group?M&S admits personal data taken in cyber attackWhat should M&S customers do after cyber attack? Experts say both are set to face financial hits worth many millions of pounds. Lost sales, the cost of clearing up the attacks and investment in new IT infrastructure to make their systems safer are among the headwinds. M&S has been unable to accept any online business since 25 April. A Co-op spokesperson said: \"Following the malicious third-party cyber attack, we took early and decisive action to restrict access to our systems in order to protect our Co-op. \"We are now in the recovery phase and are taking steps to bring our systems gradually back online in a safe and controlled manner.\""
    },
    {
        "title": "What should M&S customers do after criminals stole personal data in huge attack?",
        "description": "The personal data of M&S customers has been stolen by hackers during a huge cyber attack that may have cost the company millions.&#160;",
        "url": "https://news.sky.com/story/what-should-ms-customers-do-after-criminals-stole-personal-data-in-huge-attack-13367614",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-14 10:08:00",
        "Headline": "Despite M&S reassuring customers they need to take \"no action\" aside from changing their password next time they log in, cybersecurity experts are worried.",
        "Content": "\n          Science and Technology reporter\n       The personal data of M&S customers has been stolen by hackers during a huge cyber attack that may have cost the company millions.  So what should those customers do now? The retail giant admitted on Tuesday that some data had been stolen but reassured customers that no \"usable payment or card details\" were taken. Read more: M&S says customers' personal data taken by hackers Passwords were also not included in the stolen data but there are reports that contact details like names, addresses and phone numbers were taken. There is no evidence the data has been shared, M&S confirmed to Sky News on Wednesday. Despite M&S saying customers \"do not need to take any action\" aside from changing their password next time they log in, cybersecurity experts are worried. \n                  Co-op updates on recovery after cyber attack forced empty shelves\n                 \n                  'China-based' hack targets UK companies in 'critical national security threat', says analyst\n                 \n                  M&S says customers' personal data taken by hackers\n                 Here's what they want you to do if you have an M&S account. Watch out for phishing scams \"We often see a spike in phishing emails, fake delivery texts and scam calls after breaches like this, particularly when order history or usernames are involved,\" said Charlotte Wilson, head of enterprise at cybersecurity firm Check Point. \"This is not about panic, but it is a reminder that cybersecurity is not just about technology,\" she said. These scams can appear more convincing because hackers can include personal details like your name, address or phone number, stolen in attacks like the one on M&S. \"Some criminals may impersonate a well-known organisation and convince victims of their credibility by providing their name, address and date of birth - before using this false credibility to scam the victim out of their money,\" said Sam Kirkman from NetSPI.  In fact, the criminal group reportedly behind the M&S attack is known to use tactics like this to scam people. Rather than using software to hack past company firewalls, Scattered Spider hackers target human vulnerabilities and trick people into giving them access. Read more from Sky News:QR codes linked to online drugsCould UK get US-style 'supermax' jails? \"Remember that we will never contact you and ask you to provide us with personal account information, like usernames, and we will never ask you to give us your password,\" said M&S operations director Jayne Wall in a message to customers. Stop, challenge, protect Mr Kirkman recommends following the \"stop\", \"challenge\" and \"protect\" steps of Take Five, a national campaign aimed at protecting people from cybercrime: Change passwords M&S said no passwords were stolen in the data breach but Clare Loveridge from cybersecurity firm Arctic Wolf still says it is a \"good idea\" to change their passwords across all online accounts. \"Likewise, taking additional steps like activating two-step authentication will also improve protection, if it's not been done already,\" she said. This is because attackers may test reused passwords or login credentials stolen in previous data breaches. \"Stolen personal data can still be used as pieces of a puzzle by fraudsters,\" said Tim Grieveson, from ThingsRecon."
    },
    {
        "title": "Will there be a hosepipe ban in the UK?",
        "description": "Bosses at the UK's biggest water company have warned of possible usage restrictions this summer after a dry start to the year.",
        "url": "https://news.sky.com/story/will-there-be-a-hosepipe-ban-in-the-uk-13367508",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-hose-pipe-ban_6909035.jpg?20250507131326",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-14 07:18:00",
        "Headline": "Thames Water boss Chris Weston said the company is doing \"all we need to\" to prepare for potential water shortages as low rainfall continues.",
        "Content": "Bosses at the UK's biggest water company have warned of possible usage restrictions this summer after a dry start to the year. Thames Water chief executive Chris Weston said on Tuesday that the company is doing \"all we need to\" to prepare for potential water shortages. He said that while he is confident the company will not run out of water, there is the possibility of curbing customers' water use depending on the weather in the coming weeks. This could mean restrictions on Thames Water's 16 million customers in the southeast of England, an area that is already heavily water-stressed - where the demand for water exceeds the available supply. The warning comes after the Environment Agency warned of a \"medium\" risk of drought in England this summer if there is not sustained rainfall, after the country experienced its driest start to spring in nearly 70 years.  Will this lead to a full hosepipe ban? The Environment Agency says there are no hosepipe bans planned. However, the regulator has urged utilities to take action to cut leaks and help customers save water. When a hosepipe ban - officially called a Temporary Usage Ban - is in place, people are banned from using them for things like watering a garden, filling a paddling pool, or washing a car. Customers are instead encouraged to use a watering can or bucket to do things like water plants. Anyone who breaches the ban without permission from the water company could be fined as much as £1,000. The last hosepipe ban, implemented by South East Water in June 2023, affected people in Kent and Sussex. The country also experienced drought and record heatwaves in 2022 when five water companies imposed a hosepipe ban on a total of 19 million customers to ensure drinking and wastewater services were prioritised. Thames Water's Mr Weston said the company had learned the lessons of 2022, when it was reported that the firm came \"dangerously close\" to running out of water. What has caused potential drought? Sky News weather producer Chris England said drought concerns were caused by the fact it has been \"very warm overall\" - something he put down to \"a meandering jet stream, which can cause either high or low temperatures and rainfall, depending on where the meanders are\". He said that it's \"what is expected from a warming Arctic\". The Met Office said the jet stream has caused a persistent area of high pressure known as a \"blocking high\" that has been hanging over the country since the end of February. Such systems bring descending air, which suppresses cloud formation and prevents rain. Check the latest weather forecast here Scotland, Northern Ireland, and the northwest and northeast of England have all experienced extremely dry periods since January. In Scotland especially, there has been the lowest level of rainfall from 1 January to 11 May since records began back in 1931, according to PA news agency analysis of Met Office average daily rainfall data. So far this spring, 1 March to 11 May, the southeast of England has recorded only 34.9mm of rain, the fourth-lowest total since daily data began in 1931. At the end of April, water levels were at their lowest on record at six Environment Agency monitoring sites across the north of England. The Don at Doncaster in South Yorkshire, the River Swale at Crakehill Topcliffe in North Yorkshire, the South Tyne at Haydon Bridge in Northumberland, the Wharfe at Tadcaster in North Yorkshire, the Wear at Witton Park in Lancashire and the Mersey at Ashton Weir in Greater Manchester, were all at record lows. England's overall reservoir storage stood at 84% last month, lower than at the same time back in 2022. This is important as reservoirs are used during droughts to mitigate water shortages. They are designed to store water during periods of higher rainfall and then release it when supplies are needed. Read more from Sky News:Warning of heat impact on pregnant women and newbornsAI tool to test feelings about Botox will be rolled out by government Easy ways to cut water usage Water UK, the trade association for the water industry, said customers can start to help leave more water in the environment by making small changes at home and in the garden. These changes can include:• Reusing water in paddling pools;• Use a scum ball in a home hot tub or spa to prevent the development of scum lines or foaming;• Using a bucket to wash cars, or only washing the windscreen and mirrors on the vehicle;• Keeping a jug of water in the fridge, so there is no need to run the tap until it turns cold."
    },
    {
        "title": "AI tool used to test feelings about Botox will be rolled out by government",
        "description": "A government AI tool used to test public feeling on different issues is to be rolled out nationwide.&#160;",
        "url": "https://news.sky.com/story/ai-tool-used-to-test-feelings-about-botox-will-be-rolled-out-by-government-13367530",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-botox-injection-file_6854999.jpg?20250313112534",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-05-14 08:17:00",
        "Headline": "'Consult' is part of a set of AI tools called Humphrey, which are named after the senior civil servant in Yes, Minister.",
        "Content": "\n          Science and Technology reporter\n       A government AI tool used to test public feeling on different issues is to be rolled out nationwide.  The tool, called Consult, was first used by the Scottish government to understand public views on the regulation on non-surgical cosmetic procedures like Botox and fillers. It was able to produce results identical to those of human officials, according to the UK government, and will now be used to review responses from other consultations. It is claimed it could help save human workers from 75,000 days of manual analysis each year and around £20m in staffing. \"No one should be wasting time on something AI can do quicker and better, let alone wasting millions of taxpayer pounds on outsourcing such work to contractors,\" Technology Secretary Peter Kyle said. Consult is part of a set of AI tools called Humphrey, which are named after the senior civil servant in Yes, Minister. The government is using them to speed up the work of civil servants and save money. \n                  AIs can make collective decisions and influence each other, says new study\n                 \n                  Could AI translate animal sounds into words? Tech experts hope so\n                 \n                  Giles Martin on AI plans: 'It's like saying you can burgle my house unless I ask you not to'\n                  \"The Scottish government has taken a bold first step,\" said Mr Kyle. \"Very soon, I'll be using Consult, within Humphrey, in my own department and others in Whitehall will be using it too - speeding up our work to deliver the plan for change.\" Read more from climate, science and technology:Warning of heat impact on pregnant women and newbornsM&S says customers' personal data taken by hackersConcerns in US as Trump sells jewels of America's AI crown In January, Prime Minister Sir Keir Starmer announced he wanted \"mainline AI in the veins\" of the UK and unlock a supposed £400bn economic opportunity with the technology. A report by Google in April, titled AI Works, suggested that around half of that figure would come from workers using AI to make themselves more efficient. However, there are significant challenges in embedding AI across workforces, with training, infrastructure and messy data all presenting problems. At the moment, there are vast age and gender differences in how comfortable people are with the technology. Research completed by Public First for Google showed that women over 55 are four times less likely to use AI than men under 35."
    },
    {
        "title": "Cassie breaks down in tears during Sean 'Diddy' Combs trial as she tells of 'personal shame' and alleged rape",
        "description": "Cassie Ventura broke down in tears in court as she described her \"personal shame\" at taking part in \"freak off\" sex sessions for Sean Combs - and also accused him of raping her as their relationship came to an end.",
        "url": "https://news.sky.com/story/cassie-breaks-down-in-tears-during-sean-diddy-combs-trial-as-she-tells-of-personal-shame-and-alleged-rape-13368007",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-cassie-casandra-ventura_6916755.jpg?20250514231511",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-05-14 21:49:00",
        "Headline": "At one point, the courtroom hearing Sean Combs's trial in Manhattan, New York, fell silent as sexually explicit images from \"freak offs\" were shown to jurors, but kept private from the public gallery. These included images of Cassie Ventura and escorts.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Cassie Ventura broke down in tears in court as she described her \"personal shame\" at taking part in \"freak off\" sex sessions for Sean Combs - and also accused him of raping her as their relationship came to an end. During her second day of testimony, the singer and model told jurors of several alleged violent incidents and said the hip-hop mogul, who was known as Puff Daddy and Diddy throughout his career, blackmailed her with compromising videos. At one point, the courtroom in Manhattan, New York, fell silent as sexually explicit images from \"freak offs\" were shown to jurors, but kept private from the public gallery. These included images of Ms Ventura and escorts. Combs asked his lawyer Marc Agnifilo to see a binder of the images, and thumbed through it for a few moments before handing it back. Sean 'Diddy' Combs trial: Day 3 - As it happened The 55-year-old, once one of the most powerful men in the music industry, has pleaded not guilty to charges of sex-trafficking, racketeering conspiracy, and transportation to engage in prostitution. Prosecutors allege he used his fame and fortune to coerce Ms Ventura and other women into abusive sex sessions with escorts. His lawyers have conceded he could be violent, but argue that all sexual encounters were consensual and he never veered into sex trafficking and racketeering. Ms Ventura, who is heavily pregnant with her third child, kept calm and composed for most of her evidence on Wednesday, but broke down at the end of the day when asked why she had chosen to testify. \"I can't carry this anymore,\" she told the court. \"I can't carry the shame, the guilt, the way he treated people like they were disposable. What's right is right, what's wrong is wrong. I came here to do the right thing.\" Early in 2023, she said she started suffering from \"flashbacks\" and had suicidal thoughts, so went to rehab and trauma therapy. It is \"impossible to know\" how many \"freak offs\" she participated in, but it was in the hundreds, she told the court. Asked if she has been involved in any since ending the relationship in 2018, she replied: \"No.\" Ms Ventura, 38, alleged that Combs raped her at her home in Los Angeles, after she told him she was ending things. \"I just remember crying and saying no, but it was very fast,\" she said, her voice trailing off. She told jurors she did have consensual sex with the rapper on a subsequent occasion. \"We'd been together for over 10 years. You just don't turn feelings off,\" she said. Ms Ventura sued Combs in November 2023, and settled within 24 hours. She received £20m, the trial was told. Combs 'threatened Cassie and Kid Cudi' Ms Ventura's second day of testimony also included details of how she briefly dated Scott Mescudi, better known as singer and rapper Kid Cudi, during a low point in her relationship with Combs in 2011. Combs lunged at her with a corkscrew and kicked her in the back when he found out, jurors heard, and threatened to blow up Mescudi's car. These allegations were also detailed in her lawsuit, which alleged his car did \"explode in his driveway\" around this time. During several hours on the stand, Ms Ventura told how she hid the extent of Comb's alleged violence from loved ones, and described one incident when she allegedly suffered a \"pretty significant gash\" above her left eye after he threw her into a bed frame. Rather than go to hospital, his security staff took her to a plastic surgeon in Beverly Hills, she said. The hotel CCTV 'attack'  An incident at a hotel in Los Angeles in March 2016, which has come up several times during the trial already, was also discussed again. CCTV from the hotel, which was first released by CNN in May 2024, showed Combs allegedly beating Ms Ventura in a hallway. Jurors were shown photos of her with a swollen lip following the incident as she testified. She said a friend of hers saw her injuries and was \"super upset\" because she'd \"seen me with black eyes and busted lips before\". She also spoke about a trip to Cannes in 2013, after which she said the rapper began playing a recording of a \"freak off\" on his laptop on a commercial flight to New York, with other people around them - telling her he was \"going to embarrass me and release them\". Read more:The rise and fall of DiddyDiddy - a timeline of allegationsEverything you need to know about the trial Asked if the freak offs impacted her health, Ms Ventura said she had stomach problems and frequently developed urinary tract infections. She was also affected mentally, she told the court, saying they made her feel \"really empty\" and \"gross\". Throughout her testimony, Ms Ventura has maintained she never wanted to have sexual experiences with other people but did it at first to please the man she loved, and later out of fear. She was 22 and inexperienced when she started dating Combs, who was 17 years older, she said. The trial continues with cross-examination of Ms Ventura from the defence tomorrow."
    },
    {
        "title": "Gary Lineker apologises for 'Zionism' re-post featuring image of rat",
        "description": "Gary Lineker has \"apologised unreservedly\" for a social media re-post featuring a rat, saying he would \"never knowingly share anything antisemitic\".",
        "url": "https://news.sky.com/story/gary-lineker-apologises-for-zionism-re-post-featuring-image-of-rat-13367820",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-gary-lineker-motd_6705377.jpg?20241003185539",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-14 15:38:00",
        "Headline": "The 64-year-old presenter faced criticism after he shared a post on Instagram from the Palestine Lobby group showing a picture of a rat and titled: \"Zionism explained in two minutes.\"",
        "Content": "Gary Lineker has \"apologised unreservedly\" for a social media re-post featuring a rat, saying he would \"never knowingly share anything antisemitic\". The 64-year-old presenter faced criticism after he shared a post on Instagram from the Palestine Lobby group showing a picture of a rat and titled: \"Zionism explained in two minutes.\" In a statement, he said: \"On Instagram I reposted material which I have since learned contained offensive references. \"I very much regret these references. \"I would never knowingly share anything antisemitic. \"It goes against everything I believe in. \"The post was removed as soon as I became aware of the issue. \n                  New presenters of BBC's Match Of The Day confirmed as Mark Chapman, Kelly Cates and Gabby Logan\n                 \n                  Gary Lineker says 'right time' to leave Match Of The Day as he hints at changes to show's format\n                 \n                  Lineker goes: Does TV still need Match Of The Day?  \n                 \"Whilst I strongly believe in the importance of speaking out on humanitarian issues, including the tragedy unfolding in Gaza, I also know that how we do so matters. \"I take full responsibility for this mistake. \"That image does not reflect my views. \"It was an error on my part for which I apologise unreservedly.\" BBC Director General Tim Davie said on Wednesday morning: \"When it comes to presenters. I just say that the BBC reputation is held by everyone, and when someone makes a mistake, it costs us. \"And I think we absolutely need people to be exemplars of the BBC values and follow our social media policy. Simple as that.\" Rats have historically been used in antisemitic propaganda, including by the Nazis in 1930s Germany. Lineker's agent told the BBC the presenter immediately deleted the post when he learned about the image's symbolism. The presenter was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's new asylum policy. In November, he announced he would be stepping down from presenting Match Of The Day but will still host World Cup and FA Cup coverage."
    },
    {
        "title": "Flying duck caught on speed camera could be repeat offender",
        "description": "A duck has been caught on a radar image breaking the speed limit in central Switzerland - and it could be a repeat offender.",
        "url": "https://news.sky.com/story/flying-duck-caught-on-speed-camera-could-be-repeat-offender-13367584",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gemeinde-koniz-facebook_6915915.jpg?20250514103658",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-05-14 10:32:00",
        "Headline": "Officers said they came across the speeding duck while assessing images from 13 April.",
        "Content": "A duck has been caught on a radar image breaking the speed limit in central Switzerland - and it could be a repeat offender. Police said the mallard had been clocked in the town of Koniz, near Bern, reaching 52km/h (32mph) in a zone with a limit of 30km/h (18.6mph). Officers said they came across the speeding duck while assessing images from 13 April. An image of a duck caught on the same date reaching the same speed in the same place in 2018 was released by police. Read more from Sky News:Canadians 'weren't impressed' by Trump's UK state visit offerUK near bottom of child happiness and wellbeing league table Officers believe the similar-looking duck could be the same one as last month's culprit. Speed cameras are checked every year and captured images are sealed, according to the authorities. Police considered whether the latest radar image might be a fake, but hoped the public would be able to enjoy the \"curious coincidences\" of the two incidents."
    }
]