[
    {
        "title": "Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says",
        "description": "Donald Trump has said Vladimir Putin \"very stongly\" told him he \"will have to respond\" to Ukraine's drone strikes on Russia's airfields.",
        "url": "https://news.sky.com/story/putin-very-strongly-vowed-revenge-against-ukraine-for-drone-strike-on-airbases-donald-trump-says-13379324",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-trump_6921632.jpg?20250519175843",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-04 21:36:00",
        "Headline": "The US president said that he discussed Ukraine's drone attack, which destroyed more than 40 Russian warplanes, with Vladimir Putin during an hour and 15 minute long phone call.",
        "Content": " Donald Trump has said Vladimir Putin \"very stongly\" told him he \"will have to respond\" to Ukraine's drone strikes on Russia's airfields. More than a hundred Ukrainian drones were deployed inside Russia over the weekend, destroying more than 40 warplanes in an attack Volodymyr Zelenskyy said \"will undoubtedly be in history books\". Posting on Truth Social on Wednesday, the US president said that he discussed the attack with Mr Putin during an hour and 15 minute long phone call. \"It was a good conversation, but not a conversation that will lead to immediate Peace,\" he wrote after their first call since 19 May. \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.\" Read our Q&A: Would Putin go nuclear after Ukraine's daring attacks?  The Russian president's foreign affairs adviser added Mr Trump told Mr Putin that the US did not have advance notice of the operation. \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                 \n                  Russian mercenary group ordered arson attack on London warehouse linked to Ukraine, Old Bailey hears\n                 \n                  Ukrainian drone attack puts Russians and the world on notice\n                 Analysis: Putin is playing the victim to get the US back onside An aide to Mr Putin also told reporters that they vowed to stay in constant contact, with the Russian president telling Mr Trump that recent talks between Russian and Ukrainian officials in Istanbul were useful. The US president added that he and Mr Putin also discussed \"the fact that time is running out on Iran's decision pertaining to nuclear weapons, which must be made quickly,\" before accusing Tehran of \"slow-walking their decision\".  Russia 'giving the finger' - Zelenskyy Later, Mr Zelenskyy, in a social media post, called for more pressure on Russia to end the war, saying: \"Many have spoken with Russia at various levels. \"But none of these talks have brought a reliable peace, or even stopped the war. Unfortunately, Putin feels impunity.\" The Ukrainian leader added that \"with every new strike, with every delay of diplomacy, Russia is giving the finger to the entire world - to all those who still hesitate to increase pressure on it\". 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 It comes after Russia's foreign minister claimed that Mr Zelenskyy refused a proposal for a pause lasting two to three days to pick up the bodies of dead servicemen. Earlier this week, the Ukrainian president said the proposal was not \"a real ceasefire\". He added: \"I think they're idiots because a ceasefire is meant to prevent people from being killed.\""
    },
    {
        "title": "Why Putin is in 'victim mode' over Ukraine's airbase drone attack",
        "description": "It's only been ten days since Donald Trump called Vladimir Putin crazy following a series of Russian attacks on Ukraine.",
        "url": "https://news.sky.com/story/why-putin-is-in-victim-mode-over-ukraines-airbase-drone-attack-13379353",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vladimir-putin-moscow_6932966.jpg?20250602091244",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-04 22:47:00",
        "Headline": "It's unclear if Mr Trump tried to talk the Russian leader out of responding to Ukraine's airbase strike - but it doesn't sound like it. If anything, he appeared to actually announce Russia's retaliation himself.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  It's only been ten days since Donald Trump called Vladimir Putin crazy following a series of Russian attacks on Ukraine. But now the attacks have been flowing in the opposite direction, it feels like the Russian president has seen an opportunity to win back Washington's affections. It involves playing the victim. Ukraine war latest: Putin wants revenge for airbase attacks, says Trump The Kremlin, for example, said the leaders' call was focussed on Ukrainian attacks \"on Russian civilians\".  And before it, Putin accused Ukraine's leadership of being a \"terrorist organisation\", in his first comments since the spate of assaults began. He was referring to Saturday's bombing of a highway bridge in the Bryansk region, which left seven dead and dozens injured after part of a passenger train was crushed. \n                  President Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US\n                 \n                  The big problem facing UK as deadline to finalise US trade deal looms\n                 \n                  German Chancellor Friedrich Merz is meeting Donald Trump for the first time, so will it be another Starmer love-in, or a Zelenskyy-style brush off? \n                 No one has claimed responsibility but Russia blames Ukraine. \"The current Kyiv regime does not need peace at all,\" said President Putin. \"What is there to talk about? How can we negotiate with those who rely on terror?\" It's exactly what Ukraine has been saying about Russia for the last three years, but there was no mention of that. The Kremlin is in full-on victim mode.  The aim, I think, is to turn the tables on Ukraine, cast itself as the injured party and make Donald Trump believe that Russia has a right to respond to the drone attack on its long-range bombers. The tactic may well have worked. \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields,\" Trump wrote on social media after the call. Did he try to talk Putin out of responding? We don't know, but it doesn't sound like it. If anything, Trump actually announced Russia's retaliation himself. Read more:Underwater explosives strike bridge linking Russia to CrimeaRussia mercenary group ordered London attack, court hears And even though Putin discussed the drone attack with Trump, he still hasn't commented on it in public - four days on. Russia wants to be seen as the victim, but it doesn't want to look weak, so an embarrassing episode like that is kept out of the headlines."
    },
    {
        "title": "Weight loss jab warning from health watchdog over unborn babies",
        "description": "Women taking weight loss jabs must use contraception, and wait up to two months after stopping the medication before trying to get pregnant, the government's health agency has warned.",
        "url": "https://news.sky.com/story/weight-loss-jab-warning-from-health-watchdog-over-unborn-babies-13379102",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ozempic-semaglutide_6826492.jpg?20250212124239",
        "type": "Home",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-06-04 13:57:00",
        "Headline": "As women report having 'Ozempic babies', the warning comes because there is not enough safety data to know whether taking the medicine could cause harm to the foetus.",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n Women taking weight loss jabs must use contraception, and wait up to two months after stopping the medication before trying to get pregnant, the government's health agency has warned. The Medicines and Healthcare products Regulatory Agency (MHRA) has issued a warning around the use of GLP-1 medicines, which are used both for weight loss and to treat diabetes. It says the glucagon-like peptide-1 receptor agonists (GLP-1 or GLP-1 RAs) must not be taken during pregnancy, while trying to pregnant or while breastfeeding. Women who are attempting to get pregnant have been warned to stop using the medicine for two months before trying to have a baby. It is because there is not enough safety data to know whether taking the medicine could cause harm to the foetus. The MHRA said it has received 40 reports relating to pregnancy among women taking the jab. Mounjaro has also been found to reduce the effectiveness of oral contraceptives in those who are overweight. This means anyone using the jab should also use condoms, particularly during the first four weeks and after any dose increase. The weight loss jabs have been linked with a \"baby boom\", with women reporting online they have surprise pregnancies, despite using contraception - nicknaming them 'Ozempic babies' or 'Mounjaro babies'. \n                  Kyle Enos: Man who made and sold poisonous diet pills is jailed\n                 \n                  New blood test to 'revolutionise' NHS cancer treatment\n                 \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 MHRA data found 26 pregnancy-related reports for women taking Mounjaro. Women do not have to specify in the report if the pregnancy is unintentional, but one did say as such. There were eight reports relating to people taking Ozempic and Wegovy and a further nine for Victoza or Saxenda, with one woman saying her pregnancy was accidental. Dr Alison Cave, MHRA Chief Safety Officer said the \"skinny jabs\" were medicines, and \"should not be used as aesthetic or cosmetic treatments\" \"They are not a quick fix to lose weight and have not been assessed to be safe when used in this way,\" she said. She urged patients to read in the information leaflet, or have a conversation with a healthcare professional as part of the prescribing process."
    },
    {
        "title": "Paramedic who survived Israeli attack that killed 15 aid workers describes alleged torture in custody",
        "description": "A paramedic who survived an Israeli attack that left 15 aid workers dead in Gaza has given his first account of what happened.",
        "url": "https://news.sky.com/story/paramedic-who-survived-israeli-attack-that-killed-15-aid-workers-describes-alleged-torture-in-custody-13379058",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dandf-teaser-assad_6934438.png?20250604164705",
        "type": "Home",
        "Author": "Ben van der Merwe, digital investigations journalist",
        "Date Published": "2025-06-04 12:23:00",
        "Headline": "Assad al Nsasrah was one of two survivors from the attack in Gaza in March, in which Israeli troops killed 15 aid workers and buried their bodies in a mass grave. Details of his detention have now been brought to light for the first time.",
        "Content": "By Ben van der Merwe, digital investigations journalist  A paramedic who survived an Israeli attack that left 15 aid workers dead in Gaza has given his first account of what happened. Assad al Nsasrah was one of two survivors from the attack on 15 March, when eight paramedics, six firefighters and a UN employee were gunned down by Israeli troops and subsequently buried in a mass grave. The IDF was forced to change its account of the attack several times as new evidence emerged, including details unearthed by Sky News.  Assad remained missing until 13 April, three weeks after the attack, when Israel said he had been detained. He spent a total of 37 days in custody before being released on 29 April. In an interview with the Guardian, Assad's employer, the Palestine Red Crescent Society (PRCS), has now for the first time relayed key elements of the medic's testimony. That includes the allegation that he was tortured in Israeli custody, and that he heard Israeli troops shooting injured medics from close range as they begged for help. \"He was mistreated, he was subjected to physical attack, tied, beaten, also psychological [torture] and starved,\" PRCS spokesperson Nibal Farsakh told the Guardian. ''He was also being isolated for three days and put in a room with very loud music, which the Israelis called the disco room.\" The PRCS spokesperson said Assad \"described it as like something literally making you feel crazy and that the music was loud to the extent that you feel your nose is bleeding, your ears are bleeding\". In response to these allegations, an IDF spokesperson told Sky News that Assad was detained \"based on intelligence indicating involvement in terrorist activity\". The spokesperson declined to elaborate on this alleged intelligence. \"During his detention, he was questioned regarding this matter,\" the spokesperson said. How the attack unfolded On the morning of the attack, Assad had been called out to search for three colleagues who had disappeared while on a rescue mission. He departed shortly before 5am, with fellow paramedic Rifaat Radwan - who recorded their journey. By matching Rifaat's videos and their metadata to satellite imagery, Sky News was able to map out the exact route Assad took. Assad was the first to spot the missing ambulance, in a ditch by the side of the road. \"They're lying there, just lying there,\" Assad said, as he brought the ambulance to a stop. \"Quick! It looks like an accident.\" Seconds after he pulled the handbrake, a volley of shots rang out. The shooting would continue for at least five-and-a-half minutes. \"Mum, forgive me. This is the path I chose, to help people,\" Rifaat says towards the end of the video. He would later be found dead, buried by Israeli troops in a mass grave along with 14 other aid workers and the crushed remains of their vehicles. \"My son was very exhausted from this war,\" Rifaat's mother, Hajjah, later told Sky News. \"This should not have been his reward.\" What happened to Assad? In his newly-revealed testimony, Assad says the shooting continued well after Rifaat's recording ended. Farsakh told the Guardian that Assad took cover behind the ambulance, next to his wounded colleague Mohammed al Heila, who hugged him before dying. After the gunfire subsided, Assad says, he heard soldiers approaching. \"Al Nsasrah said the soldiers came to the scene very close - and then he heard them shooting everyone who was still alive,\" Farsakh told the Guardian. Farsakh previously revealed to Sky News that a PRCS dispatcher was able to successfully call medic Saleh Muammar as late as 5.45am, 37 minutes after the attack began. Muammar was later found dead in the mass grave, alongside his colleagues. Assad's claims are also consistent with details from the Israeli military's own report into the killings, reviewed by Israeli newspaper Haaretz, which found that troops shot some of the aid workers at \"point-blank range\". Farsakh told the Guardian that Assad escaped the soldiers' notice by hiding under al Heila's body, leading them to believe he was dead. When he was eventually spotted, Farsakh says, one of the soldiers pointed a rifle at his head. \"He told the soldiers: 'Don't shoot. I am Israeli,'\" Farsakh said. \"And the soldier got a bit confused. Al Nsasrah's mother was a Palestinian citizen of Israel.\" Assad says he was stripped, blindfolded and placed in a ditch. At 6.55am, Assad managed to discreetly call a PRCS dispatcher. Sky News obtained an exclusive recording of this call, in which soldiers can be heard giving orders to prisoners and discussing the tactical situation. The testimony given by Assad lines up with that provided to Sky News by the only other survivor from that day, paramedic Munther Abed. Munther also says he was stripped, beaten and placed in a ditch. He also says that the soldiers forced him to act as a human shield during the evacuation of Rafah, which was taking place that day. Munther says that Assad was detained alongside him on the day of the attack. \"He was accompanied by an Israeli officer, and was beaten before being placed next to me,\" Munther says. While Munther was released later that day, Assad would be held in detention for a total of 37 days. \"Throughout his detention and questioning in Israel, he was held under a temporary custody order in accordance with the law,\" an IDF spokesperson said. \"At the conclusion of the questioning, and based on the information gathered, it was decided not to issue a permanent detention order, and he was released back to the Gaza Strip in accordance with the law. The IDF operates in accordance with the law.\" The spokesperson declined to say what information led to Assad's release, or why his detention was kept secret for three weeks. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Madeleine McCann search: Abandoned buildings examined as ground radar may be deployed",
        "description": "Day two in the search in Portugal's Algarve region for clues to where Madeleine McCann is - and there are pockets of police activity dotted around the vast scrubland.",
        "url": "https://news.sky.com/story/madeleine-mccann-search-abandoned-buildings-examined-as-ground-radar-may-be-deployed-13379166",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-search-teams-portugal_6934596.jpg?20250604174156",
        "type": "Home",
        "Author": "Dan Whitehead, Sky correspondent, in the Algarve, Portugal",
        "Date Published": "2025-06-04 16:02:00",
        "Headline": "Many people question what could possibly be found here 18 years after the three-year-old British girl went missing from her family's nearby holiday apartment in Praia da Luz.",
        "Content": "By Dan Whitehead, Sky correspondent, in the Algarve, Portugal   Day two in the search in Portugal's Algarve region for clues to where Madeleine McCann is - and there are pockets of police activity dotted around the vast scrubland. From where I'm standing, I can see three searches under way, all in abandoned buildings. To our right, police are using chainsaws to cut down a tree that's grown inside a derelict barn. Latest updates from the search Ahead of us, officers in white hard hats empty rubble from inside another dilapidated building. To the left, a team of three lift stones through the window of an old stone hut. It's thought that ground radar equipment may then be used to scan the floors. As we walk through the brush, the ground is dry and hard.  'Nothing has been found' Digging here is hot, exhausting work - but so far, there is no news. Police are trying to keep the press back - but the area is too large. I ask one officer for an update: \"Nothing has been found,\" he tells me, before heading off to the tents that are the base for the 30 or so German police running this operation. Many people question just what could possibly be found here 18 years after the three-year-old British girl went missing from her family's nearby holiday apartment in Praia da Luz. Professor of Criminology at the University of Porto, Fernando Teixeira, told me that the search will have been meticulously planned. He says: \"They use identification work if any bone fragment appears, and this is done in the laboratory unit.\" He adds: \"In the field, through equipment supported by engineering, it is possible to detect whether there are in fact bone fragments that will have been deposited in the geographic areas.\" What do locals think about the search? Around a mile or so from the search site, we stand outside the Ocean Club Holiday Resort where the McCanns were staying. The feeling towards press in the village is not warm - it took years for the resort to recover, and even now, mention Praia da Luz and you think of Madeleine. Taryn Brown runs a beauty spa just 30 metres from the apartment. She tells me this fresh search has upset locals. She says: \"It keeps dragging down Praia da Luz. All I've ever heard about is how badly everyone was affected. It took a long, long time to recover so this keeps dragging it all up again.\" The McCanns aren't commenting on this latest operation - they, of course, have been here before - and are used to the heartbreak of nothing being found. There are two days left to search this land - to uncover something, somewhere that might just lead to a clue as to where their daughter is."
    },
    {
        "title": "The big problem facing UK as deadline to finalise US trade deal looms",
        "description": "When push comes to shove, the question of whether British industry faces crippling tariffs on exports to the US or enjoys a unique opportunity to grow may come back to three seemingly random words: \"melted and poured\".",
        "url": "https://news.sky.com/story/the-big-problem-facing-uk-as-deadline-to-finalise-us-trade-deal-looms-13379263",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-sir-keir-starmer_6909746.jpg?20250508090259",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-06-04 19:41:00",
        "Headline": "Just when you thought Britain was in the safe zone, it stands on the edge of jeopardy all over again.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  When push comes to shove, the question of whether British industry faces crippling tariffs on exports to the US or enjoys a unique opportunity to grow may come back to three seemingly random words: \"melted and poured\". To see why, let's begin by recapping where we are at present in the soap opera of US trade policy. Donald Trump has just doubled the extra tariffs charged on imports of steel and aluminium into the US from 25% to 50%. In essence, this would turn a painfully high tariff into something closer to an insurmountable economic wall (remember during the Cold War, the Iron Curtain equated to an effective tariff rate of just under 50%). Anyway, the good news for UK steel producers is that they have been spared the 50% rate and will, for the time being, only have to pay the 25% rate. But there is a sting in the tail: that stay of execution will only last until 9 July - on the basis of President Trump's most recent pronouncements.  For anyone following these events from the corner of their eyes, this might all sound a little odd. After all, didn't Sir Keir Starmer announce only a few weeks ago that British steel and aluminium makers would be able to enjoy not 25% but 0% tariffs with America, thanks to his bold new trade agreement with the US? Well, yes. But the prime minister wasn't being entirely clear about what that meant in practice. Because the reality is that every trade agreement works more or less as follows: politicians negotiate a \"heads of terms\" agreement - a vague set of principles and red lines. There then follows a period of horse-trading and negotiation to nail down the actual details and turn it into a black and white piece of law. In this case, when the PM and president made their big announcement 28 days ago, they had only agreed on the \"heads of terms\". The small print was yet to be completed. Right now, we are still in the horse-trading phase. Negotiators from the UK and the US are meeting routinely to try and nail down the small print. And that process is taking longer than many had expected. To see why, it's worth drilling a little bit into the details. The trade deal committed to allowing some cars to pass into the US at a 10% rate and to protecting some pharmaceutical trade, as well as allowing some steel and aluminium into the US at a zero tariff rate. When it comes to cars, there are some nuances about which kind of cars the deal covers. Something similar goes for pharmaceuticals. Things get even knottier when you drill into the detail on steel.  You see, one of the things the White House is nervous about is the prospect that Britain might become a kind of assembly point for steel from other countries around the world - that you could just ship some steel to Britain, get it pressed or rolled or worked over and then sent across to the US with those 0% tariffs. So the US negotiators are insisting that only steel that is \"melted and poured\" in the UK (in other words, smelted in a furnace) is covered by the trade deal. That's fine for some producers but not for others. One of Britain's biggest steel exporters is Tata Steel, which makes a lot of steel that gets turned into tin cans you find on American supermarket shelves (not to mention piping used by the oil trade). Up until recently, that steel was indeed \"melted and poured\" from the blast furnaces at Port Talbot. But Tata shut down those blast furnaces last year, intending to replace them with cleaner electric arc furnaces. And in the intervening period, it's importing raw steel instead from the Netherlands and India and then running it through its mills. Read more:UK city that once 'clothed the world' faces existential threatHow expectation of Trump tariffs boosted UK economy Or consider the situation at British Steel. There in Scunthorpe they are melting and pouring the steel from iron made in their blast furnaces - but now ponder this. While the company has been semi-nationalised by the government, it is still technically a Chinese business, owned by Jingye. In other words, its steel might technically count as benefiting China - which is something the White House is even more sensitive about. 👉 Tap here to follow Politics at Jack and Anne's wherever you get your podcasts 👈 You see how this is all suddenly becoming a bit more complicated than it might at first have looked? This helps to explain why the negotiations are taking longer than expected. But this brings us to the big problem. The White House has indicated that Britain will only be spared that 50% tariff rate provided the trade deal is finalised by 9 July. That gives the negotiators another month and a bit. That might sound like a lot, but now consider that that would be one of the fastest announcement-to-completion rates ever achieved in any trade negotiations in modern history. There's no guarantee Britain will actually get this deal done in time for that deadline - though insiders tell me they think they could be able to finalise it in a piecemeal fashion: the cars one week, steel another, pharmaceuticals another. Either way, the heat is on. Just when you thought Britain was in the safe zone, it stands on the edge of jeopardy all over again."
    },
    {
        "title": "Artwork referencing JK Rowling taken down by National Trust after being 'tampered with'",
        "description": "The National Trust says it has taken down a piece of art featuring JK Rowling's name after it was \"tampered with by a member of the public\".",
        "url": "https://news.sky.com/story/artwork-referencing-jk-rowling-taken-down-after-being-tampered-with-13379252",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jeanhatchet-artwork_6934697.jpg?20250604192512",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-04 19:01:00",
        "Headline": "The Harry Potter author's name was \"stitched over by other participants\". Later, a feminist campaigner said she had \"corrected\" the work by taking off the stitching which was over Rowling's name.",
        "Content": "The National Trust says it has taken down a piece of art featuring JK Rowling's name after it was \"tampered with by a member of the public\". It has urged people \"not to damage or tamper with artworks\" once they are finished and on public display. Between April and November last year, visitors to Derbyshire's Hardwick Hall were invited to nominate a \"contemporary Virtuous Woman\", whose name was then sewn into the fabric, before it was put on public show in February. Until recently, the artwork, A Virtuous Woman, has continued to be on display, featuring the Harry Potter author's name, which was \"stitched over by other participants\" at an unspecified time. Feminist campaigner Jean Hatchet said on X last week that she had \"corrected\" the work by unpicking the stitching which was over Rowling's name. It comes after criticism of Rowling's views on gender issues that have seen her called transphobic by activists, which she has denied. The National Trust said the piece has been \"taken off display… to protect it from further tampering or damage\". \n                  Women's centre founded by Harry Potter author JK Rowling to host conference on internet pornography\n                 \n                  John Lithgow on JK Rowling's trans stance backlash: 'She's handled it fairly gracefully'\n                 \n                  JK Rowling calls for Sir Keir Starmer to apologise after Supreme Court ruling on women\n                 Ms Hatchet has criticised the organisation's move, saying she removed the \"stitching with the correct tool\", took \"great time and care\", and did not damage it. She told Sky News: \"Everyone involved in managing this project behaved in a cowardly fashion after a vindictive individual performed an act of woman-hating. It should have been removed immediately. Because they wouldn't, we did.\" The stitched names of British queens, artist Yoko Ono, ex-prime minister Baroness Margaret Thatcher, climate campaigner Greta Thunberg, and singer Taylor Swift among others appear not to have stitching over them on the recycled textile. The work comes from artist Layla Khoo in association with the University of Leeds and the National Trust. A spokeswoman for the trust said: \"The artwork was open to contributions for eight months and closed in November when the piece was finished and put on public display. \"During the participation phase, JK Rowling's name was stitched on to the piece seven times and in two instances it was stitched over by other participants. \"At the time the artwork was completed and subsequently hung, JK Rowling's name appeared five times without any overstitching. \"We ask people not to damage or tamper with artworks once they are finished and on public display. \"The piece has been taken off display for investigation and to protect it from further tampering or damage. We take all claims and incidents of damage to items in our care seriously and investigate each one.\""
    },
    {
        "title": "Hundreds of thousands in Gaza 'catastrophically food insecure', says aid chief",
        "description": "Humanitarian aid must be allowed into Gaza \"at scale\" by Israel to avoid a \"generation of children that won't have a chance in life,\" the director of the UN's World Food Programme has told Sky News.",
        "url": "https://news.sky.com/story/hundreds-of-thousands-in-gaza-catastrophically-food-insecure-says-aid-chief-13379300",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-aid_6934808.jpg?20250604235727",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-04 20:51:00",
        "Headline": "Cindy McCain, executive director of the UN's World Food Programme, tells Sky News that aid groups need \"urgent\" access to Gaza. ",
        "Content": " Humanitarian aid must be allowed into Gaza \"at scale\" by Israel to avoid a \"generation of children that won't have a chance in life,\" the director of the UN's World Food Programme has told Sky News. In early March - before Israel resumed its military operations in the Gaza Strip - all aid was blocked from entering the region. Despite limited aid now being distributed to Gaza through a US and Israeli-backed organisation, the Hamas-run Gaza Health Ministry said Palestinians were killed by Israeli gunfire near one of the sites. Cindy McCain, executive director of the World Food Programme (WFP), has urged Israel to allow international aid to \"get in and get in at scale\". \"We can't wait for this,\" she told The World with Yalda Hakim. \"We need safe, unfettered, clear access all the way in and we're not getting that right now.\" Ms McCain said people in Gaza were \"starving, they're hungry, they're doing what they can do to feed their families\". She added: \"It's very, very important that people realise that the only way to stave off malnutrition, catastrophic food insecurity and, of course, famine would be by complete and total access for organisations like mine.\" Ms McCain said the WFP team was \"talking every day\" to the Israeli government to try to resume aid deliveries. \"We're not going to give up, we do believe that it's not only necessary but it's urgent that we get in and get in at scale,\" she said. \"We're looking at a generation of children that won't have a chance in life because they haven't had the proper nutrients. \"Right now, we're looking at over 500,000 people within Gaza that are catastrophically food insecure.\" Ms McCain added: \"I try and put myself in their situation: I'm a mother and grandmother, and I cannot imagine having my children ask me for food and me not being able to give it them. \"I don't know what that does to a human spirit but I don't want to see any more of that as a humanitarian aid worker.\" Ms McCain, the widow of the late US presidential candidate John McCain, said she believes in \"principled, humanitarian distribution\" of aid. Asked if she thought Hamas was taking aid, she replied: \"I have not seen anything like that. I have no way of knowing because I've not been there in person.\"  Aid distribution centres in Gaza were closed on Wednesday after Palestinians were reportedly killed by Israeli gunfire near one of its sites. The Gaza Humanitarian Foundation (GHF) - which is endorsed by Israel - said the centres would be shut \"for renovations, organisation, and efficiency improvements\". The Israel Defence Forces (IDF) warned nearby roads would be considered \"combat zones\". It came after 27 Palestinians were killed while waiting for aid to be distributed in the Rafah area of southern Gaza on Tuesday, according to the Hamas-run health ministry. The IDF said it fired \"near a few individual suspects\" who left the designated route, approached its forces and ignored warning shots, about half a kilometre from the aid distribution site of the GHF. It denied shooting at civilians at the aid centre. Read more:How Gaza's aid rollout system collapsed into chaosIsrael 'without doubt' committed Gaza war crimes, says ex-Biden official That incident came two days after reports that 31 people were killed as they walked to a distribution centre run by the GHF in the Rafah area. However the IDF said its forces \"did not fire at civilians while they were near or within the humanitarian aid distribution site and that reports to this effect are false\"."
    },
    {
        "title": "Weight loss jab warning from health watchdog over unborn babies",
        "description": "Women taking weight loss jabs must use contraception, and wait up to two months after stopping the medication before trying to get pregnant, the government's health agency has warned.",
        "url": "https://news.sky.com/story/weight-loss-jab-warning-from-health-watchdog-over-unborn-babies-13379102",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ozempic-semaglutide_6826492.jpg?20250212124239",
        "type": "UK",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-06-04 13:57:00",
        "Headline": "As women report having 'Ozempic babies', the warning comes because there is not enough safety data to know whether taking the medicine could cause harm to the foetus.",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n Women taking weight loss jabs must use contraception, and wait up to two months after stopping the medication before trying to get pregnant, the government's health agency has warned. The Medicines and Healthcare products Regulatory Agency (MHRA) has issued a warning around the use of GLP-1 medicines, which are used both for weight loss and to treat diabetes. It says the glucagon-like peptide-1 receptor agonists (GLP-1 or GLP-1 RAs) must not be taken during pregnancy, while trying to pregnant or while breastfeeding. Women who are attempting to get pregnant have been warned to stop using the medicine for two months before trying to have a baby. It is because there is not enough safety data to know whether taking the medicine could cause harm to the foetus. The MHRA said it has received 40 reports relating to pregnancy among women taking the jab. Mounjaro has also been found to reduce the effectiveness of oral contraceptives in those who are overweight. This means anyone using the jab should also use condoms, particularly during the first four weeks and after any dose increase. The weight loss jabs have been linked with a \"baby boom\", with women reporting online they have surprise pregnancies, despite using contraception - nicknaming them 'Ozempic babies' or 'Mounjaro babies'. \n                  Kyle Enos: Man who made and sold poisonous diet pills is jailed\n                 \n                  New blood test to 'revolutionise' NHS cancer treatment\n                 \n                  Dementia: Sleep problems could 'double risk' of disease in later life\n                 MHRA data found 26 pregnancy-related reports for women taking Mounjaro. Women do not have to specify in the report if the pregnancy is unintentional, but one did say as such. There were eight reports relating to people taking Ozempic and Wegovy and a further nine for Victoza or Saxenda, with one woman saying her pregnancy was accidental. Dr Alison Cave, MHRA Chief Safety Officer said the \"skinny jabs\" were medicines, and \"should not be used as aesthetic or cosmetic treatments\" \"They are not a quick fix to lose weight and have not been assessed to be safe when used in this way,\" she said. She urged patients to read in the information leaflet, or have a conversation with a healthcare professional as part of the prescribing process."
    },
    {
        "title": "New miscarriage of justice watchdog chair calls leadership 'unimpressive'",
        "description": "The watchdog that examines potential miscarriages of justice has \"unimpressive\" leadership and is \"incompetent\", said its new chair as she takes up her role.",
        "url": "https://news.sky.com/story/new-miscarriage-of-justice-watchdog-chair-calls-leadership-unimpressive-13379282",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dam-vera-farrell_6934741.jpg?20250604210443",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-06-04 20:12:00",
        "Headline": "Dame Vera Baird said the organisation does not communicate with applicants, is \"reluctant to challenge the Court of Appeal\" and looks for reasons \"not to refer rather than to refer\".",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n  The watchdog that examines potential miscarriages of justice has \"unimpressive\" leadership and is \"incompetent\", said its new chair as she takes up her role. Dame Vera Baird has been appointed to head up the Criminal Case Review Commission (CCRC), which currently has serial child killer Lucy Letby's appeal in its inbox. The CCRC is an independent public body that reviews possible miscarriages of justice in the criminal courts of England, Wales and Northern Ireland and refers cases to the appeal courts. The commission has had four critical reviews in the last 10 years, which Dame Vera said \"all find the same thing\". Speaking to Sky News after her appointment was announced, she said: \"They don't communicate with applicants, are reluctant to challenge the Court of Appeal, they look for reasons not to refer rather than to refer and are quite often incompetent.\" Dame Vera is now charged with turning things around. She cites the example of Andrew Malkinson who was wrongly convicted of rape and spent 17 years in jail, when for most of that time DNA evidence had emerged that could have cleared his name. He had applied three times to the CCRC but was rejected twice on cost-benefit grounds. It's one of several cases leading to calls for \"root and branch\" reform of the CCRC from the Justice Committee, which said the watchdog \"has shown a remarkable inability to learn from its own mistakes\". An inquiry by Chris Henley KC also found that case workers missed multiple opportunities to help Malkinson. The previous chair, Helen Pitcher, was forced to resign in January and chief executive Karen Kneller told the committee of MPs they needed a strong replacement. Ms Kneller said in April: \"We don't have that figurehead and without that figurehead I think it is difficult for the organisation.\" But that replacement did not think much of her evidence to MPs. \"I didn't find her impressive,\" said Dame Vera, who will be meeting her new colleague next week. \"I was really quite concerned about, first of all, the kind of fairly sketchy way in which she even allowed that they got it wrong in Malkinson, and these assertions that she was sorry that people only judged them by the mistakes, and they all took them very seriously, but actually they were otherwise doing a very good job. \"My fear is that the attitude in the case of Malkinson and others, points to there being an attitude that's not positive, that's not mission-driven, that is not go-getter in other cases. So, are they getting it done properly?\" A month later, a committee of MPs said Ms Kneller's position was no longer tenable. Committee chairman Andy Slaughter said: \"As a result of our concerns regarding the performance of the CCRC and the unpersuasive evidence Karen Kneller provided to the committee, we no longer feel that it is tenable for her to continue as chief executive of the CCRC.\"  Read more from Sky News:Body found in search for missing BritonUkrainian attack puts Russian and world on notice In February, the CCRC received an application from Lucy Letby, the former nurse convicted of murdering seven babies and attempting to murder seven others. It's a high-profile, complex case, arriving at a significant moment of flux. Asked if she thought the CCRC could deal with it, Dame Vera said: \"Remember I'm quite new to it. It will need complexity. It will need a team. It will need the readiness to commission reports, I would guess from what's been said about the lack of scientific value in some of the things that were asserted. \"So it's going to be a very complex task.\" In the Baird Inquiry into Greater Manchester Police last year, Dame Vera strongly criticised the force. She has a reputation for exposing hard truths to institutions, but now she is the institution. She will need to drive the changes."
    },
    {
        "title": "Trump's NATO ambassador says allies must agree to 5% spend on defence and security 'starting now'",
        "description": "The United States says the UK and all other NATO allies must agree to spend at least 5% of national income on defence and security \"starting now\".",
        "url": "https://news.sky.com/story/trumps-nato-ambassador-says-allies-must-agree-to-5-spend-on-defence-and-security-starting-now-13379061",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-matthew-whitaker_6934497.jpg?20250604144505",
        "type": "UK",
        "Author": "Katy Scholes, security and defence producer",
        "Date Published": "2025-06-04 12:17:00",
        "Headline": "The warning comes after Sky News revealed on Tuesday that Sir Keir Starmer would be forced to agree to lift pure defence spending to 3.5% of GDP and spend a further 1.5% on defence-related areas by the 2030s.",
        "Content": "By Katy Scholes, security and defence producer  The United States says the UK and all other NATO allies must agree to spend at least 5% of national income on defence and security \"starting now\". Matthew Whitaker, Donald Trump's ambassador to the NATO alliance, said: \"Let me cut to the core of our message: 5%\" He continued: \"Peace through strength means nothing less, and it demands it equally from all allies. This is not going to be just a pledge. This is going to be a commitment. \"Every ally must commit to investing at least 5% of GDP in defence and security, starting now.\" The warning comes after Sky News revealed on Tuesday that Sir Keir Starmer would be forced to agree to lift pure defence spending to 3.5% of GDP and spend a further 1.5% on defence-related areas by the 2030s as part of a NATO push to rearm and to keep the US on side. Yet as late as Monday, the prime minister was still talking merely about an \"ambition\" to increase investment in the UK's armed forces to 3% from 2.3% by 2034 - even as he launched a major review of defence. The position caused bemusement inside the Ministry of Defence (MoD) where officials believe it is inevitable that the UK position will change. The US ambassador was speaking to journalists ahead of two days of meetings of Defence Ministers at NATO HQ in Brussels, the last before NATO leaders meet at a summit in the Hague later this month. \"The Hague summit will be a moment to lock these commitments in,\" he said. The 5% defence spending commitment is central to US plans for the summit, with European leaders hoping also to secure support for Ukraine and a reinforced posture towards Russia in summit conclusions. Underlining the weight of expectation of the US administration, the ambassador said: \"This is not a suggestion. It's a baseline for deterrence.\" It comes as NATO secretary general Mark Rutte said that alliance nations will find themselves \"in great difficulty\" in the coming years unless they go over the current 2% of GDP spending target.  Speaking to reporters on Wednesday, Mr Rutte said: \"The expectation is that on the European side of NATO and the Canadian side of NATO, if we think that we can keep ourselves safe sticking with the 2%, forget it. \"Yes, the next three to five years, but then we are in great difficulty. And the US rightly expects us to spend much more to defend ourselves with their help, but also to equalise, which is only fair with what the US is spending on defence.\" Mr Rutte, a former Dutch prime minister, is thought to want member states to commit to spending 3.5% on the military, with a further 1.5% on defence-related measures. Read more on Sky News:Mental health 'crisis' in A&EBody found in hunt for missing manReeves' spending plans by AI New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences Defence Secretary John Healey said on Tuesday that the UK already \"makes a huge contribution to NATO\" amid speculation about what the body will call for. The UK's defence review \"has NATO at its heart\", he said, pointing out that Britain was \"the only country with a nuclear deterrent that commits it in full to other NATO nations\"."
    },
    {
        "title": "Body found in search for Briton who went missing during stag do in Portugal",
        "description": "A body has been found in the search for a missing Scottish man who disappeared while on a stag do in Portugal.",
        "url": "https://news.sky.com/story/greg-monks-body-found-in-search-for-missing-scottish-man-in-portugal-13379043",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-greg-monk-portugal_6934102.jpg?20250604124335",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-04 11:40:00",
        "Headline": "Greg Monks, 38, was last seen in Albufeira during the early hours of Wednesday 28 May while enjoying the first night of a five-day stag do.",
        "Content": "A body has been found in the search for a missing Scottish man who disappeared while on a stag do in Portugal. Greg Monks, 38, was last seen in Albufeira during the early hours of Wednesday, 28 May, while enjoying the first night of a five-day stay. A major search was launched for the Cambuslang man, with his parents and girlfriend flying out to Portugal to also provide assistance. His sisters, Jillian and Carlyn, previously spoke to Sky News about the family's devastation at his disappearance. Speaking to The UK Tonight with Sarah-Jane Mee before the police's announcement, they described their brother as a \"big part of our family\". Local police confirmed on Wednesday that a body had been found in the Cerro de Aguia area, where Mr Monks was believed to have been last seen. A statement by Portuguese police said the body was located on a vacant and uneven lot. The force added: \"After the competent judicial inspection has been carried out, the body will be removed to the area's legal medicine office for an autopsy to be performed.\" Read more from Sky News:Man jailed for murdering wife after remains found under stairsTwo men charged with murder after boy, 4, died in crash Mr Monks was earlier described by his sisters as a \"real family man\". After hearing the news, sister Jillian, in a Facebook tribute, wrote that their family is \"absolutely devastated.\" She said: \"Greg was an amazing boy who everyone thought so highly of, was friends with everyone, and always made us laugh! We will miss him every day! \"I just want to thank absolutely everyone for everything they done from sharing their posts to out looking, phoning everywhere to get CCTV. \"If love coulda saved you, you would live forever! Miss you forever brother.\" When Mr Monks's family arrived in Albufeira, police told them they had spotted him twice on CCTV footage walking around the residential area. The area where he was last seen - more than an hour's walk from the Albufeira Strip - had a lot of rough terrain, including rocky outcrops and cliffs. The Foreign, Commonwealth and Development Office (FCDO) said it was supporting Mr Monks's family and was \"in contact with the local authorities\"."
    },
    {
        "title": "The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  ",
        "description": "Next week, the chancellor will unveil the first spending review since 2021. It will set Whitehall budgets for the remainder of this parliament and it will be a big moment for a government struggling to tell a story about what it is trying to achieve to voters. &#160;&#160;",
        "url": "https://news.sky.com/story/the-big-mistake-labour-think-nigel-farage-has-made-and-how-the-chancellor-hopes-to-capitalise-13379207",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beth-rigby-rachel-reeves_6934549.jpg?20250604161725",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-04 17:51:00",
        "Headline": "Beth Rigby looks ahead to the spending review on 11 June, when Rachel Reeves will set out how much money each government department will get.",
        "Content": "\n          Political editor\n              @BethRigby\n Next week, the chancellor will unveil the first spending review since 2021. It will set Whitehall budgets for the remainder of this parliament and it will be a big moment for a government struggling to tell a story about what it is trying to achieve to voters.    Rachel Reeves, flanked by transport workers in a bus depot in Rochdale, knows it. She came to the North West armed with £15bn of funding for trains, trams and buses across the Midlands and the North. Much more will be announced next week when the chancellor sets out her capital spending plans for the remainder of the parliament, having loosened her fiscal rules in the budget for capital investment. More is coming. Next week, the chancellor is expected to announce plans to spend billions more on a new railway line between Manchester and Liverpool, as well as other transport schemes for northern towns and cities. This will be the backbone of the \"Northern Arc\" that Greater Manchester Mayor Andy Burnham has been arguing for as a northern version to the much-vaunted Oxford-Cambridge growth corridor. Labour will pour £113bn into capital investment over the course of this parliament and there is an economic and political imperative for a chancellor to talk up capital spending in rail and roads, houses, power stations. On the economic side, she is in search for growth and hopes investment in infrastructure will create jobs and fire up the economy. On the politics, Labour need to show voters in their red wall seats that it is the Starmer government and not Nigel Farage that will improve the lives of working people. Ms Reeves spent a lot of time in her speech talking about the need to invest right across the country. She is overhauling the Treasury's \"Green Book\" that assesses value for money for public projects to make sure that funding decisions don't just get concentrated in the South East but are weighted to the Midlands and the North.  She also, in reiterating her commitment to her fiscal rule to not borrow to fund day-to-day government spending (the annual budgets for our schools, councils, courts, police, hospitals), sought to draw out the \"choice\" between Labour and Reform, as Labour seeks to capitalise on Mr Farage's decision last week to promise up to £80bn worth of new spending - including scrapping the two-child benefit cap and increasing winter fuel payments - while not explaining exactly how they could be paid for. Expect to hear lots more from Labour in the coming weeks about how Mr Farage is an iteration of Liz Truss, ready to pursue \"fantasy economics\" and trash the economy. Labour are gleeful that Mr Farage has opened up this line of attack and think it was an uncharacteristic political misstep from the Reform leader. Read more:More pensioners to get winter fuel paymentWe asked AI to do Rachel Reeves' job \"Farage was a politician for vibes, now he's turned himself into a politician of policy and he didn't need to do that yet,\" observed one senior Labour figure. But if that is the sell, here is the sting. While the Chancellor has loosened her fiscal rules for capital spending, she is resolute she will not do the same when it comes to day-to-day departmental spending, and next week harsh cuts are on the way for some departments, with Yvette Cooper at the Home Office, Angela Rayner at local government, and Ed Miliband at energy still wrangling over their settlements. Ms Reeves was at pains in Rochdale to talk about the extra £190bn the government has put into day-to-day spending in this parliament in order to see off the charges of austerity as those spending cuts kick in. Her allies point to the £300bn in total Ms Reeves has poured into capital projects and public services over this parliament. \"You just can't say we aren't a tax-and-spend government,\" said one ally. But this isn't just a chancellor fighting Mr Farage, she is also battling with those in her own party, under extreme pressure to loosen her fiscal rules, or tax more, as MPs - and her prime minister - demand she spends more on welfare and on getting the UK warfare-ready. You can see it all playing out. After a local election drubbing, the chancellor U-turned on her seemingly iron-clad decision to take the winter fuel allowance away from all pensioners. Now, I'm hearing that the prime minister is pressing to lift the two-child benefit cap (no matter his chief of staff is opposed to the idea, with the cap popular with voters) and MPs are demanding a reverse to some disability cuts (one government insider said the backbench revolt is real and could even force a defeat despite Sir Keir's whopping 165-strong working majority). Meanwhile, the prime minister is under pressure from US President Donald Trump for NATO to lift defence spending to 3.5% of GDP. Spending demands and rising borrowing costs, there is no wonder that attention is already moving towards possible tax rises in the Autumn budget. Ms Rayner, the deputy prime minister, wrote to the chancellor, arguing for targeted wealth taxes. Andy Burnham, the Greater Manchester mayor, told me this week on Electoral Dysfunction that he wanted more taxes on assets and a revaluation of council tax bands so those with large, valuable homes pay more. \"We have not taxed assets and wealth properly and I'd come up with something that can be controversial but council tax has not been revalued since the early 90s so there are homes in London worth tens of millions of pounds that pay less council tax than many average properties here in Greater Manchester so I would look at reforms in that space,\" Mr Burnham told me this week. \"I would look further at land taxation and land taxation reform. If you put in new infrastructure, what I learned through Crossrail, Elizabeth Line - you lift the values of that land. \"So why don't we capture some of that uplift from that? I personally would go for a land value tax across the country. So there are things that you can do that I think can be seen to be fair, because we haven't taxed those things fairly. \"I've said, and I'll say it again, we've overtaxed people's work and we've undertaxed people's assets and wealth and that balance should be put more right.\" I asked the chancellor on Wednesday if Ms Rayner and Mr Burnham had a point, and would she level with people that taxes might have to go up again as she struggles with spending demands and self-imposed borrowing constraints - she, of course, swerved the question and said the priority for her is to growth the economy. These questions will, I suspect, only get louder and more frequent in the run-up to the budget should borrowing costs continue to go up alongside demands for spending. The chancellor, at least, has a story to tell about rewiring the economy as a means to national renewal. But with the spoils of infrastructure investment perhaps decades off, Ms Reeves will find it hard to frame this spending review as a reboot for working people rather than a kicking for already stretched public services."
    },
    {
        "title": "Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday",
        "description": "The Duchess of Sussex has shared a video of her and Prince Harry dancing before she gave birth to Lilibet - as they celebrate their daughter's fourth birthday.",
        "url": "https://news.sky.com/story/meghan-shares-video-of-her-and-harry-dancing-before-she-gave-birth-to-lilibet-as-they-celebrate-daughters-4th-birthday-13378930",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-meghan-markle-duchess-of-sussex_6934606.png?20250604175447",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-04 07:27:00",
        "Headline": "The Duchess of Sussex is seen twerking in the footage next to a hospital bed as Harry, wearing a hooded top, dances alongside her.",
        "Content": " The Duchess of Sussex has shared a video of her and Prince Harry dancing before she gave birth to Lilibet - as they celebrate their daughter's fourth birthday. Meghan is seen twerking in the footage next to a hospital bed as Harry, wearing a hooded top, dances alongside her. In a post on Instagram, the duchess said the video was recorded four years ago today, adding: \"Both of our children were a week past their due dates… so when spicy food, all that walking, and acupuncture didn't work - there was only one thing left to do!\" The couple are dancing to a song called The Baby Momma Dance. Meghan also shared a series of photos of Lilibet, writing: \"Happy birthday to our beautiful girl! \"Four years ago today, she came into our lives - and each day is brighter and better because of it. Thanks to all of those sending love and celebrating her special day!\" In one photo, Meghan and Lilibet have windswept hair with water behind them. In another, the Duchess holds her daughter - named after the late Queen, whose childhood nickname was Lilibet - as a newborn. Read more:Meghan shares new picture of son Archie on his sixth birthday Last month, Meghan spoke about the challenges of balancing being an entrepreneur and a mother. Alongside Prince Harry, the duchess stepped back from her duties as a senior working royal in 2020 - before starting a new life in the US."
    },
    {
        "title": "Artwork referencing JK Rowling taken down by National Trust after being 'tampered with'",
        "description": "The National Trust says it has taken down a piece of art featuring JK Rowling's name after it was \"tampered with by a member of the public\".",
        "url": "https://news.sky.com/story/artwork-referencing-jk-rowling-taken-down-after-being-tampered-with-13379252",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jeanhatchet-artwork_6934697.jpg?20250604192512",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-04 19:01:00",
        "Headline": "The Harry Potter author's name was \"stitched over by other participants\". Later, a feminist campaigner said she had \"corrected\" the work by taking off the stitching which was over Rowling's name.",
        "Content": "The National Trust says it has taken down a piece of art featuring JK Rowling's name after it was \"tampered with by a member of the public\". It has urged people \"not to damage or tamper with artworks\" once they are finished and on public display. Between April and November last year, visitors to Derbyshire's Hardwick Hall were invited to nominate a \"contemporary Virtuous Woman\", whose name was then sewn into the fabric, before it was put on public show in February. Until recently, the artwork, A Virtuous Woman, has continued to be on display, featuring the Harry Potter author's name, which was \"stitched over by other participants\" at an unspecified time. Feminist campaigner Jean Hatchet said on X last week that she had \"corrected\" the work by unpicking the stitching which was over Rowling's name. It comes after criticism of Rowling's views on gender issues that have seen her called transphobic by activists, which she has denied. The National Trust said the piece has been \"taken off display… to protect it from further tampering or damage\". \n                  Women's centre founded by Harry Potter author JK Rowling to host conference on internet pornography\n                 \n                  John Lithgow on JK Rowling's trans stance backlash: 'She's handled it fairly gracefully'\n                 \n                  JK Rowling calls for Sir Keir Starmer to apologise after Supreme Court ruling on women\n                 Ms Hatchet has criticised the organisation's move, saying she removed the \"stitching with the correct tool\", took \"great time and care\", and did not damage it. She told Sky News: \"Everyone involved in managing this project behaved in a cowardly fashion after a vindictive individual performed an act of woman-hating. It should have been removed immediately. Because they wouldn't, we did.\" The stitched names of British queens, artist Yoko Ono, ex-prime minister Baroness Margaret Thatcher, climate campaigner Greta Thunberg, and singer Taylor Swift among others appear not to have stitching over them on the recycled textile. The work comes from artist Layla Khoo in association with the University of Leeds and the National Trust. A spokeswoman for the trust said: \"The artwork was open to contributions for eight months and closed in November when the piece was finished and put on public display. \"During the participation phase, JK Rowling's name was stitched on to the piece seven times and in two instances it was stitched over by other participants. \"At the time the artwork was completed and subsequently hung, JK Rowling's name appeared five times without any overstitching. \"We ask people not to damage or tamper with artworks once they are finished and on public display. \"The piece has been taken off display for investigation and to protect it from further tampering or damage. We take all claims and incidents of damage to items in our care seriously and investigate each one.\""
    },
    {
        "title": "More pensioners to get winter fuel payments this year - but confusion remains over who will qualify",
        "description": "Rachel Reeves has confirmed more pensioners will be eligible for winter fuel payments this year - but confusion remains over how the threshold could be changed. ",
        "url": "https://news.sky.com/story/more-pensioners-to-get-winter-fuel-payments-this-year-but-confusion-remains-over-who-will-qualify-13379053",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elderly-pensioner-woman_6931053.jpg?20250530104839",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-06-04 12:10:00",
        "Headline": "Sir Keir Starmer avoided questions on how the eligibility will change after announcing a U-turn on the unpopular cuts to the benefit two weeks ago. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Rachel Reeves has confirmed more pensioners will be eligible for winter fuel payments this year - but confusion remains over how the threshold could be changed.  Sir Keir Starmer failed to provide clarity on what the new means-test could be during Wednesday's PMQs, which came moments after the chancellor's surprise announcement at a Q&A in Manchester. Politics Live: Starmer under fire for 'disgraceful' PMQs performance Following a speech about her upcoming spending review, Ms Reeves said details on the government's winter fuel U-turn will be fleshed out \"as soon as we possibly can\". She added: \"People should be in no doubt, the means test will increase and more people will get winter fuel payment this winter.\" However the prime minister was unable to say how many pensioners would have the benefit restored when grilled on the matter by Kemi Badenoch in the House of Commons. The Tory leader claimed the chancellor \"is rushing her plans because she just realised when winter is\". \n                  Politics latest: PM opens up about his late brother - as he hails his 'personal courage'\n                 \n                  The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  \n                 \n                  Rachel Reeves is about to make huge spending decisions - these could be the winners and losers\n                 She asked: \"On behalf of the pensioners who want to know, can the prime minister be clear with us here and now: how many of the 10 million people who lost their winter fuel payments will get it back?\" Sir Keir didn't answer the question, only saying the government will \"look again at the eligibility for winter fuel and of course we'll set out how we pay for it\".  Axing universal winter fuel payments was one of the first things Labour did in government. The payment was aimed at helping pensioners pay for higher fuel bills during the colder months, but now only those in receipt of pension credit or other benefits get it. Means-testing it meant the number of pensioners eligible was slashed from 11.4 million to 1.5 million. Labour said it was necessary because of a £22bn blackhole left behind by the Conservatives, which they claimed was larger than they were expecting when they entered government. The change was expected to save around £1.3bn in 2024/25 and £1.5bn in subsequent years. Read More:Starmer's winter fuel cut U-turn claim 'not credible'Botched partial winter fuel U-turn could have profound consequences for Starmer Ministers now say decisions taken to stabilise the economy mean the eligibility can be extended. However, the U-turn is largely seen as a response to the party's drubbing at the local elections, which Labour MPs blamed on the unpopularity of the policy on the door step.  It wasn't clear until today whether the changes would come into effect before this winter, as the funding is expected to be laid out officially in the autumn statement in November. Pensions minister Torsten Bell today confirmed to the Work and Pensions Committee that there is no prospect of returning to a universal winter fuel payment, saying \"most people agree it's not a good idea to have a system of paying a few hundred pounds to millionaires\". Last month, former Labour prime minister Gordon Brown said governments should be fair to pensioners but one solution could be excluding only those on the top rate of income tax from winter fuel payments.  Universal winter fuel payments were introduced by Mr Brown when he was chancellor in 1997, in the first year of the New Labour government."
    },
    {
        "title": "Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says",
        "description": "Donald Trump has said Vladimir Putin \"very stongly\" told him he \"will have to respond\" to Ukraine's drone strikes on Russia's airfields.",
        "url": "https://news.sky.com/story/putin-very-strongly-vowed-revenge-against-ukraine-for-drone-strike-on-airbases-donald-trump-says-13379324",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-trump_6921632.jpg?20250519175843",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-04 21:36:00",
        "Headline": "The US president said that he discussed Ukraine's drone attack, which destroyed more than 40 Russian warplanes, with Vladimir Putin during an hour and 15 minute long phone call.",
        "Content": " Donald Trump has said Vladimir Putin \"very stongly\" told him he \"will have to respond\" to Ukraine's drone strikes on Russia's airfields. More than a hundred Ukrainian drones were deployed inside Russia over the weekend, destroying more than 40 warplanes in an attack Volodymyr Zelenskyy said \"will undoubtedly be in history books\". Posting on Truth Social on Wednesday, the US president said that he discussed the attack with Mr Putin during an hour and 15 minute long phone call. \"It was a good conversation, but not a conversation that will lead to immediate Peace,\" he wrote after their first call since 19 May. \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.\" Read our Q&A: Would Putin go nuclear after Ukraine's daring attacks?  The Russian president's foreign affairs adviser added Mr Trump told Mr Putin that the US did not have advance notice of the operation. \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                 \n                  Russian mercenary group ordered arson attack on London warehouse linked to Ukraine, Old Bailey hears\n                 \n                  Ukrainian drone attack puts Russians and the world on notice\n                 Analysis: Putin is playing the victim to get the US back onside An aide to Mr Putin also told reporters that they vowed to stay in constant contact, with the Russian president telling Mr Trump that recent talks between Russian and Ukrainian officials in Istanbul were useful. The US president added that he and Mr Putin also discussed \"the fact that time is running out on Iran's decision pertaining to nuclear weapons, which must be made quickly,\" before accusing Tehran of \"slow-walking their decision\".  Russia 'giving the finger' - Zelenskyy Later, Mr Zelenskyy, in a social media post, called for more pressure on Russia to end the war, saying: \"Many have spoken with Russia at various levels. \"But none of these talks have brought a reliable peace, or even stopped the war. Unfortunately, Putin feels impunity.\" The Ukrainian leader added that \"with every new strike, with every delay of diplomacy, Russia is giving the finger to the entire world - to all those who still hesitate to increase pressure on it\". 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 It comes after Russia's foreign minister claimed that Mr Zelenskyy refused a proposal for a pause lasting two to three days to pick up the bodies of dead servicemen. Earlier this week, the Ukrainian president said the proposal was not \"a real ceasefire\". He added: \"I think they're idiots because a ceasefire is meant to prevent people from being killed.\""
    },
    {
        "title": "Why Putin is in 'victim mode' over Ukraine's airbase drone attack",
        "description": "It's only been ten days since Donald Trump called Vladimir Putin crazy following a series of Russian attacks on Ukraine.",
        "url": "https://news.sky.com/story/why-putin-is-in-victim-mode-over-ukraines-airbase-drone-attack-13379353",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vladimir-putin-moscow_6932966.jpg?20250602091244",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-04 22:47:00",
        "Headline": "It's unclear if Mr Trump tried to talk the Russian leader out of responding to Ukraine's airbase strike - but it doesn't sound like it. If anything, he appeared to actually announce Russia's retaliation himself.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  It's only been ten days since Donald Trump called Vladimir Putin crazy following a series of Russian attacks on Ukraine. But now the attacks have been flowing in the opposite direction, it feels like the Russian president has seen an opportunity to win back Washington's affections. It involves playing the victim. Ukraine war latest: Putin wants revenge for airbase attacks, says Trump The Kremlin, for example, said the leaders' call was focussed on Ukrainian attacks \"on Russian civilians\".  And before it, Putin accused Ukraine's leadership of being a \"terrorist organisation\", in his first comments since the spate of assaults began. He was referring to Saturday's bombing of a highway bridge in the Bryansk region, which left seven dead and dozens injured after part of a passenger train was crushed. \n                  President Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US\n                 \n                  The big problem facing UK as deadline to finalise US trade deal looms\n                 \n                  German Chancellor Friedrich Merz is meeting Donald Trump for the first time, so will it be another Starmer love-in, or a Zelenskyy-style brush off? \n                 No one has claimed responsibility but Russia blames Ukraine. \"The current Kyiv regime does not need peace at all,\" said President Putin. \"What is there to talk about? How can we negotiate with those who rely on terror?\" It's exactly what Ukraine has been saying about Russia for the last three years, but there was no mention of that. The Kremlin is in full-on victim mode.  The aim, I think, is to turn the tables on Ukraine, cast itself as the injured party and make Donald Trump believe that Russia has a right to respond to the drone attack on its long-range bombers. The tactic may well have worked. \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields,\" Trump wrote on social media after the call. Did he try to talk Putin out of responding? We don't know, but it doesn't sound like it. If anything, Trump actually announced Russia's retaliation himself. Read more:Underwater explosives strike bridge linking Russia to CrimeaRussia mercenary group ordered London attack, court hears And even though Putin discussed the drone attack with Trump, he still hasn't commented on it in public - four days on. Russia wants to be seen as the victim, but it doesn't want to look weak, so an embarrassing episode like that is kept out of the headlines."
    },
    {
        "title": "Paramedic who survived Israeli attack that killed 15 aid workers describes alleged torture in custody",
        "description": "A paramedic who survived an Israeli attack that left 15 aid workers dead in Gaza has given his first account of what happened.",
        "url": "https://news.sky.com/story/paramedic-who-survived-israeli-attack-that-killed-15-aid-workers-describes-alleged-torture-in-custody-13379058",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dandf-teaser-assad_6934438.png?20250604164705",
        "type": "World",
        "Author": "Ben van der Merwe, digital investigations journalist",
        "Date Published": "2025-06-04 12:23:00",
        "Headline": "Assad al Nsasrah was one of two survivors from the attack in Gaza in March, in which Israeli troops killed 15 aid workers and buried their bodies in a mass grave. Details of his detention have now been brought to light for the first time.",
        "Content": "By Ben van der Merwe, digital investigations journalist  A paramedic who survived an Israeli attack that left 15 aid workers dead in Gaza has given his first account of what happened. Assad al Nsasrah was one of two survivors from the attack on 15 March, when eight paramedics, six firefighters and a UN employee were gunned down by Israeli troops and subsequently buried in a mass grave. The IDF was forced to change its account of the attack several times as new evidence emerged, including details unearthed by Sky News.  Assad remained missing until 13 April, three weeks after the attack, when Israel said he had been detained. He spent a total of 37 days in custody before being released on 29 April. In an interview with the Guardian, Assad's employer, the Palestine Red Crescent Society (PRCS), has now for the first time relayed key elements of the medic's testimony. That includes the allegation that he was tortured in Israeli custody, and that he heard Israeli troops shooting injured medics from close range as they begged for help. \"He was mistreated, he was subjected to physical attack, tied, beaten, also psychological [torture] and starved,\" PRCS spokesperson Nibal Farsakh told the Guardian. ''He was also being isolated for three days and put in a room with very loud music, which the Israelis called the disco room.\" The PRCS spokesperson said Assad \"described it as like something literally making you feel crazy and that the music was loud to the extent that you feel your nose is bleeding, your ears are bleeding\". In response to these allegations, an IDF spokesperson told Sky News that Assad was detained \"based on intelligence indicating involvement in terrorist activity\". The spokesperson declined to elaborate on this alleged intelligence. \"During his detention, he was questioned regarding this matter,\" the spokesperson said. How the attack unfolded On the morning of the attack, Assad had been called out to search for three colleagues who had disappeared while on a rescue mission. He departed shortly before 5am, with fellow paramedic Rifaat Radwan - who recorded their journey. By matching Rifaat's videos and their metadata to satellite imagery, Sky News was able to map out the exact route Assad took. Assad was the first to spot the missing ambulance, in a ditch by the side of the road. \"They're lying there, just lying there,\" Assad said, as he brought the ambulance to a stop. \"Quick! It looks like an accident.\" Seconds after he pulled the handbrake, a volley of shots rang out. The shooting would continue for at least five-and-a-half minutes. \"Mum, forgive me. This is the path I chose, to help people,\" Rifaat says towards the end of the video. He would later be found dead, buried by Israeli troops in a mass grave along with 14 other aid workers and the crushed remains of their vehicles. \"My son was very exhausted from this war,\" Rifaat's mother, Hajjah, later told Sky News. \"This should not have been his reward.\" What happened to Assad? In his newly-revealed testimony, Assad says the shooting continued well after Rifaat's recording ended. Farsakh told the Guardian that Assad took cover behind the ambulance, next to his wounded colleague Mohammed al Heila, who hugged him before dying. After the gunfire subsided, Assad says, he heard soldiers approaching. \"Al Nsasrah said the soldiers came to the scene very close - and then he heard them shooting everyone who was still alive,\" Farsakh told the Guardian. Farsakh previously revealed to Sky News that a PRCS dispatcher was able to successfully call medic Saleh Muammar as late as 5.45am, 37 minutes after the attack began. Muammar was later found dead in the mass grave, alongside his colleagues. Assad's claims are also consistent with details from the Israeli military's own report into the killings, reviewed by Israeli newspaper Haaretz, which found that troops shot some of the aid workers at \"point-blank range\". Farsakh told the Guardian that Assad escaped the soldiers' notice by hiding under al Heila's body, leading them to believe he was dead. When he was eventually spotted, Farsakh says, one of the soldiers pointed a rifle at his head. \"He told the soldiers: 'Don't shoot. I am Israeli,'\" Farsakh said. \"And the soldier got a bit confused. Al Nsasrah's mother was a Palestinian citizen of Israel.\" Assad says he was stripped, blindfolded and placed in a ditch. At 6.55am, Assad managed to discreetly call a PRCS dispatcher. Sky News obtained an exclusive recording of this call, in which soldiers can be heard giving orders to prisoners and discussing the tactical situation. The testimony given by Assad lines up with that provided to Sky News by the only other survivor from that day, paramedic Munther Abed. Munther also says he was stripped, beaten and placed in a ditch. He also says that the soldiers forced him to act as a human shield during the evacuation of Rafah, which was taking place that day. Munther says that Assad was detained alongside him on the day of the attack. \"He was accompanied by an Israeli officer, and was beaten before being placed next to me,\" Munther says. While Munther was released later that day, Assad would be held in detention for a total of 37 days. \"Throughout his detention and questioning in Israel, he was held under a temporary custody order in accordance with the law,\" an IDF spokesperson said. \"At the conclusion of the questioning, and based on the information gathered, it was decided not to issue a permanent detention order, and he was released back to the Gaza Strip in accordance with the law. The IDF operates in accordance with the law.\" The spokesperson declined to say what information led to Assad's release, or why his detention was kept secret for three weeks. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Hundreds of thousands in Gaza 'catastrophically food insecure', says aid chief",
        "description": "Humanitarian aid must be allowed into Gaza \"at scale\" by Israel to avoid a \"generation of children that won't have a chance in life,\" the director of the UN's World Food Programme has told Sky News.",
        "url": "https://news.sky.com/story/hundreds-of-thousands-in-gaza-catastrophically-food-insecure-says-aid-chief-13379300",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-aid_6934808.jpg?20250604235727",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-04 20:51:00",
        "Headline": "Cindy McCain, executive director of the UN's World Food Programme, tells Sky News that aid groups need \"urgent\" access to Gaza. ",
        "Content": " Humanitarian aid must be allowed into Gaza \"at scale\" by Israel to avoid a \"generation of children that won't have a chance in life,\" the director of the UN's World Food Programme has told Sky News. In early March - before Israel resumed its military operations in the Gaza Strip - all aid was blocked from entering the region. Despite limited aid now being distributed to Gaza through a US and Israeli-backed organisation, the Hamas-run Gaza Health Ministry said Palestinians were killed by Israeli gunfire near one of the sites. Cindy McCain, executive director of the World Food Programme (WFP), has urged Israel to allow international aid to \"get in and get in at scale\". \"We can't wait for this,\" she told The World with Yalda Hakim. \"We need safe, unfettered, clear access all the way in and we're not getting that right now.\" Ms McCain said people in Gaza were \"starving, they're hungry, they're doing what they can do to feed their families\". She added: \"It's very, very important that people realise that the only way to stave off malnutrition, catastrophic food insecurity and, of course, famine would be by complete and total access for organisations like mine.\" Ms McCain said the WFP team was \"talking every day\" to the Israeli government to try to resume aid deliveries. \"We're not going to give up, we do believe that it's not only necessary but it's urgent that we get in and get in at scale,\" she said. \"We're looking at a generation of children that won't have a chance in life because they haven't had the proper nutrients. \"Right now, we're looking at over 500,000 people within Gaza that are catastrophically food insecure.\" Ms McCain added: \"I try and put myself in their situation: I'm a mother and grandmother, and I cannot imagine having my children ask me for food and me not being able to give it them. \"I don't know what that does to a human spirit but I don't want to see any more of that as a humanitarian aid worker.\" Ms McCain, the widow of the late US presidential candidate John McCain, said she believes in \"principled, humanitarian distribution\" of aid. Asked if she thought Hamas was taking aid, she replied: \"I have not seen anything like that. I have no way of knowing because I've not been there in person.\"  Aid distribution centres in Gaza were closed on Wednesday after Palestinians were reportedly killed by Israeli gunfire near one of its sites. The Gaza Humanitarian Foundation (GHF) - which is endorsed by Israel - said the centres would be shut \"for renovations, organisation, and efficiency improvements\". The Israel Defence Forces (IDF) warned nearby roads would be considered \"combat zones\". It came after 27 Palestinians were killed while waiting for aid to be distributed in the Rafah area of southern Gaza on Tuesday, according to the Hamas-run health ministry. The IDF said it fired \"near a few individual suspects\" who left the designated route, approached its forces and ignored warning shots, about half a kilometre from the aid distribution site of the GHF. It denied shooting at civilians at the aid centre. Read more:How Gaza's aid rollout system collapsed into chaosIsrael 'without doubt' committed Gaza war crimes, says ex-Biden official That incident came two days after reports that 31 people were killed as they walked to a distribution centre run by the GHF in the Rafah area. However the IDF said its forces \"did not fire at civilians while they were near or within the humanitarian aid distribution site and that reports to this effect are false\"."
    },
    {
        "title": "German Chancellor Friedrich Merz is meeting Donald Trump for the first time, so will it be another Starmer love-in, or a Zelenskyy-style brush off? ",
        "description": "The German chancellor will hold his first face-to-face meeting with President Trump later.",
        "url": "https://news.sky.com/story/german-chancellor-friedrich-merz-is-meeting-donald-trump-for-the-first-time-so-will-it-be-another-starmer-love-in-or-a-zelenskyy-style-brush-off-13379146",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-freidrich-merz_6934614.jpg?20250604181821",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-06-04 15:45:00",
        "Headline": "Ukraine, the Middle East and tariffs will likely be discussed when Friedrich Merz meets the US president later, but which Donald Trump will show up, and whether old wounds will be re-opened are just two of the potential pitfalls facing the German leader in Washington.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n The German chancellor will hold his first face-to-face meeting with President Trump later. On the agenda are discussions around the war in Ukraine, the ongoing conflict in the Middle East and tariffs. It's understood Donald Trump and Friedrich Merz will have a working lunch and early afternoon meeting before potentially holding a news conference. The question is, will Mr Merz emerge smiling like Sir Keir Starmer, or be berated like [Ukrainian President] Volodymyr Zelenskyy? There's no doubt the leader of Europe's largest economy has a lot to discuss with Mr Trump, the head of Germany's most important trading partner. Berlin was trying to recover from two years of recession, only to be hit by the Trump administration's 25% tariffs on vehicles and the new 50% tariff on steel and aluminium. The president's threat of a 50% tariff on all European goods is also still looming for July unless a deal with Brussels is struck. \n                  President Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US\n                 \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                 \n                  The big problem facing UK as deadline to finalise US trade deal looms\n                 In the past, the US leader hasn't minced his words, calling the Germans \"very bad\" as he bemoaned \"the millions of cars they sell to the US\".  While the EU is leading negotiations on tariffs, Mr Merz knows he must be careful not to anger Mr Trump. The president has been clear that he believes Europe has been ripping America off and a misstep could reinforce this view, potentially making it harder to agree a deal. Germany's reliance on the US for defence has also triggered Donald Trump in the past. During his first term, he tweeted that Germany \"owes vast sums of money to NATO and the United States must be paid more for the powerful, and very expensive, defence it provides to Germany\". However, Mr Merz will be hoping to avoid a fight over this after Germany said it would boost defence spending and the chancellor vowed to create the strongest army in Europe. This, plus his efforts to crackdown on illegal migration, may help to counter views that German leadership is weak. While the Germans are focused on a productive meeting, Mr Merz's past criticism of the US could come back to haunt him. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Following a 10-day period of intense criticism of Europe and Ukraine by the Trump administration in February, the chancellor warned that Europe could no longer rely on Washington. Merz mimicked the US president Referring to the president's assertion that European security was no longer America's primary focus - a stunning reversal of decades of US foreign policy - he said it was clear that \"the Americans, at least this part of the Americans, this administration, are largely indifferent to the fate of Europe\". More recently, when asked about his first phone call with Mr Trump, he mimicked the president, highlighting how often he uses the word \"great\". Read more:Trump puts EU trade war on icePutin exploiting Trump era Ahead of Thursday's meeting, a spokesperson for the German government played down concerns of a clash, saying the pair had spoken several times on the phone and that the chancellor was well prepared. It's understood he had a call with the French president in the lead-up. Perhaps Emmanuel Macron was able to offer some advice after he and Mr Trump rekindled their first-term bromance during their White House encounter in February. We have been told the chancellor will also be bringing a gift for the president. King's invitation went down well There's no doubt that when Mr Starmer produced an invitation to the UK from King Charles, it boosted the mood in the Oval Office during his first visit. From the moment the embossed letter was handed over, the atmosphere became more relaxed. The spokesperson wouldn't reveal what Mr Merz is bringing, clearly determined to maintain the suspense. It could potentially be something from Rhineland-Palatinate, the region in southwest Germany's wine country where Donald Trump's paternal grandparents were born. The chancellor knows the area well, having completed his military service there in the 1970s, and has already invited the president to visit his ancestral home.  Germans appear confident Whatever it is, the Germans seem confident the meeting between the two leaders will be a success, underlining the German leader's firm belief in the transatlantic relationship and his experience holding top-level meetings with politicians. In reality, however much he prepares, his team knows he must expect the unexpected. It could be that vice president JD Vance decides to revisit his blistering attack on Europe, which left the audience at the Munich Security Conference speechless, earlier this year. Or, perhaps the Trump administration will lash out again about the far-right Alternative for Germany party being classified as right-wing extremists by Germany's domestic intelligence service; the potential pitfalls are many. What will happen is anyone's guess and the uncertainty ensures this meeting of political heavyweights will be a fascinating watch."
    },
    {
        "title": "At least 11 dead after stampede among Royal Challengers Bengaluru fans celebrating Indian Premier League win",
        "description": "At least 11 people have died after a stampede among cricket fans celebrating the winners of the Indian Premier League.",
        "url": "https://news.sky.com/story/at-least-11-dead-after-stampede-among-royal-challengers-bengaluru-fans-celebrating-indian-premier-league-win-13379073",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ipl-cricket-india-stampede_6934565.jpg?20250604163331",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-06-04 12:49:00",
        "Headline": "Thousands gathered outside the M. Chinnaswamy Stadium in Bengaluru city after the team won their first IPL title on Tuesday.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  At least 11 people have died after a stampede among cricket fans celebrating the winners of the Indian Premier League. Royal Challengers Bengaluru supporters were outside the M. Chinnaswamy Stadium in Bengaluru city, Karnataka state, after the team won their first IPL title on Tuesday. Thousands of people were seen lining the streets as the cricket team arrived in a bus on Wednesday evening, with some seen climbing trees and the stadium wall. As the celebration proceeded, some people outside without passes tried to push through the gates. Police added that there was further trouble between the perimeter and main arena, and images showed people climbing over others. Local TV news channels showed images of police shifting the injured persons and those who fell unconscious to ambulances. A witness also told the Reuters news agency that they saw officers caning crowds at one of the gates. \n                  Cricket bosses ban transgender women from female competitions\n                 \n                  Vaibhav Suryavanshi, 14, makes history as youngest ever player in cricket's Indian Premier League- hits first ball six\n                 \n                  Stokes-backed travel platform Unravel takes off with £5m funding\n                 Karnataka state chief minister Siddaramaiah said that 11 people had died and 47 were injured in the incident. He said: \"At a time of celebration, this unfortunate event should not have happened. \"We are saddened by this. The fans that showed up were beyond our expectations.\" D.K. Shivakumar, the deputy chief minister of Karnataka state, also told reporters that \"the crowd was very uncontrollable\", and added: \"I apologise for the overcrowding.\" The Board of Control for Cricket in India, which organises the IPL, in a statement called the incident \"unfortunate\". \"This is a negative side of popularity,\" BCCI secretary Devajit Saikia said. \"People are crazy for their cricketers.\" He added: \"My deepest condolences to the family of the deceased. I wish early recovery of the injured.\" Read more:Truck driver jailed after wife's remains found under stairsGaza aid centres to be closed for dayMeta found 'covertly tracking' Android users The IPL is the world's most popular T20 cricket tournament. Ahead of the celebrations, the team had given away free passes for the event through its website, while also warning that numbers would be limited. Stampedes are relatively common in India when large crowds gather at a place. In January, at least 30 people were killed as tens of thousands of Hindus rushed to bathe in a sacred river during the Maha Kumbh festival, the world's largest religious gathering."
    },
    {
        "title": "Truck driver Richard Satchwell jailed for murdering wife Tina after her remains were found under stairs",
        "description": "A truck driver found guilty of murdering his wife, whose remains were found under the stairs at their home in Ireland, has been sentenced to life in prison.",
        "url": "https://news.sky.com/story/truck-driver-richard-satchwell-jailed-for-murdering-wife-tina-after-her-remains-were-found-under-stairs-13379020",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-richard-satchwell-2023_6931164.jpg?20250530125238",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-04 10:53:00",
        "Headline": "The skeletal remains of Mrs Satchwell were discovered at her Co Cork property in October 2023, six years after her husband, who is originally from Leicester, reported her missing.",
        "Content": "A truck driver found guilty of murdering his wife, whose remains were found under the stairs at their home in Ireland, has been sentenced to life in prison. Richard Satchwell, originally from Leicester, had denied the murder of Tina Satchwell on a date between 19 March and 20 March 2017. Her skeletal remains were discovered at the Co Cork property in October 2023, six years after her husband reported her missing. During his five-week trial, jurors heard from more than 50 witnesses, including police officers involved in the investigation. Police had discovered Mrs Satchwell's remains buried under the stairs in the living room of their home. Her badly decomposed body was wrapped in a soiled sheet and covered with black plastic. She was wearing pyjamas and a dressing gown, with the belt of the gown wrapped around her. A state pathologist said she could not establish the exact cause of death because of how decomposed the body was. \n                  Weight loss jab warning from health watchdog over unborn babies\n                 \n                  Electric bike, pedestrian and car collision leaves teen dead and another seriously injured\n                 \n                  New miscarriage of justice watchdog chair calls leadership 'unimpressive'\n                 During police interviews, Satchwell, 58, said that on the morning of 20 March 2017 he found his wife standing at the bottom of the stairs with a chisel in her hand, scraping off the plasterboard, and claimed she came at him with the object and he fell back on to the floor. He said Mrs Satchwell tried to stab him multiple times with the chisel and he grabbed her clothing and restrained her by putting the belt of the dressing gown against her neck. Satchwell said that in a very short period of time she went limp and fell into his arms. He said he put her body on the sofa in the living room, before moving her to the chest freezer and then burying her under the stairs. Relatives of Mrs Satchwell wept as the guilty verdict was returned on Friday 30 May. Satchwell did not react as the unanimous verdict was read to the Central Criminal Court in Dublin. Following the sentencing, the family of Mrs Satchwell described her as a kind and gentle woman who loved animals. Tina's cousin, Sarah Howard, said that Mrs Satchwell was murdered \"by someone who claimed to love her\". \"The emotional toll of her loss is something I will carry with me always,\" she said. Her half-sister Lorraine Howard said the way Mrs Satchwell was buried in plastic in her own home \"sends shivers down my spine every time I think about it\". \"I will never be able to forgive Richard Satchwell for what he has done.\" Satchwell's barrister Brendan Grehan SC told the court that Satchwell intends to appeal, and that he \"never intended to kill Tina\". Mr Grehan also said that Satchwell said \"despite anything he said in the trial, Tina was a lovely person\". Read more from Sky News:British man goes missing on stag doTwo men charged with murder after boy dies in crash The court was told the couple married in the UK on Tina's 20th birthday, and later settled in Co Cork, first in Fermoy before moving to Youghal in 2016. The trial heard that on 24 March 2017, Satchwell went to Irish police and claimed his wife had left their Youghal home four days ago because their relationship had deteriorated. Satchwell had also claimed Mrs Satchwell had taken €26,000 euros in cash from savings they kept in the attic, which the court later heard they did not have the capacity to save. He formally reported his wife missing in May 2017 and claimed to investigators that his wife was sometimes violent towards him. In the following years, he made over a dozen media appearances in which he spoke extensively about the morning he claimed Mrs Satchwell left the house and never returned."
    },
    {
        "title": "Ukrainian drone attack puts Russians and the world on notice",
        "description": "On the eve of the peace talks in Istanbul, Ukraine launched an audacious drone attack deep within Russia: Operation Spider's Web.",
        "url": "https://news.sky.com/story/ukrainian-drone-attack-puts-russians-and-the-world-on-notice-13379107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-the-world-podcast-yalda-hakim_6934509.jpg?20250604150628",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-06-04 13:58:00",
        "Headline": "This was not a scene from a Hollywood spy movie, but a glimpse into the future of modern warfare. Once again, the battlefields of Ukraine and the technology used there are changing the face of how wars are fought and potentially won.",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n On the eve of the peace talks in Istanbul, Ukraine launched an audacious drone attack deep within Russia: Operation Spider's Web. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Hundreds of Ukrainian-made drones were smuggled over the border, put into crates, and launched simultaneously to blow up billions of dollars' worth of Russian military equipment. Ukraine penetrated as far into Russia as the North Pole is from London, or Los Angeles from New York. No small feat, and you can bet that the whole world is watching and taking notes from how the Ukrainians are responding to Russian aggression.  This was not a scene from a Hollywood spy movie, but a glimpse into the future of modern warfare. Once again, the battlefields of Ukraine and the technology used there are changing the face of how wars are fought and potentially won. Wars won't be fought just with legacy hardware and 20th-century capabilities, but with swarms of cheap drones alongside. \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                 \n                  Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says\n                 \n                  Russian mercenary group ordered arson attack on London warehouse linked to Ukraine, Old Bailey hears\n                 Both myself and my podcast co-host, NBC's chief foreign correspondent Richard Engel, have spent time on the Ukrainian frontlines and have seen these drones in action. They swarm overhead like 'killer bees', as he described it on this week's episode. It's unnerving and scary. Volodymyr But the way Ukraine used these drones has not been done before by an army, and attacks like these will be making Ukraine's adversaries and allies nervous. As tensions mount in the Indo-Pacific, both Beijing and Washington will be taking notes from President Volodymyr Zelenskyy. Read more:Putin humiliated by 'Russia's Pearl Harbor'Russians react to Ukraine's drone attack  If China launches an attack on Taiwan, which US defence secretary Pete Hegseth warned could be 'imminent', drones will be central to any conflict between the two superpowers. President Donald Trump's announcement of a $175bn 'Golden Dome' American defence system is classic Trump bravado mixed with an insight into the very real anxieties this administration feels with regards to China, for it is a formidable enemy. It is not improbable that Beijing, or its ally in Pyongyang, could carry out a similar attack on US army bases or the mainland, if tensions were to ratchet up. So, the big question now is how will Vladimir Putin respond? A security breach of this size will no doubt invite a huge response. But Ukraine, which has been told by the Trump administration - that it is losing this war, wrap this up and fast - has once again shown it has the willpower to continue to be agile and creative."
    },
    {
        "title": "Lois Boisson: The French wildcard who is now a Grand Slam semi-finalist",
        "description": "Lois Boisson was ranked 361 in the world when she entered the French Open. She is guaranteed to be at least 68 by the end.",
        "url": "https://news.sky.com/story/lois-boisson-the-french-wildcard-who-is-now-a-grand-slam-semi-finalist-13379112",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-french-open-lois-boisson_6934568.jpg?20250604163612",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-04 14:15:00",
        "Headline": "French tennis player Lois Boisson has made her way from wildcard to French Open semi-finalist in her debut Grand Slam tournament. Here is everything you need to know about the star player.",
        "Content": "Lois Boisson was ranked 361 in the world when she entered the French Open. She is guaranteed to be at least 68 by the end. Her remarkable jump up the rankings is due to her performance during the tournament, which has seen her become the first woman to reach the semi-finals at a debut major tournament since 1989. She is also the youngest French semi-finalist at a Grand Slam event since 1999, when Amelie Mauresmo neared the final stage of Wimbledon. It has been no easy feat. Boisson has seen off the likes of third seed Jessica Pegula and, most recently, number six in the world, Mirra Andreeva. The quarter-final match on Wednesday was a tense showdown between Boisson and Russia's Andreeva, with the home crowd throwing their support behind the underdog, chanting \"Lois, Lois\" between points. The French player twice found herself down a break but fought back each time, using heavy spin and deep ground strokes to trouble her opponent, who grew visibly frustrated. Boisson will now face world number two, America's Coco Gauff, for a place in Saturday's final. Before that, here is everything you need to know about the French wildcard. A remarkable rise up the ranks The 22-year-old began her career on the International Tennis Foundation (ITF) circuit in 2019 at the age of 16. By 2024 she had started to rise up the ranks, thanks to three ITF titles at the start of the season. In the same year, she qualified as a wildcard for the French Open, also known as the Roland Garros. She had narrowly missed out on qualifying in her debut in 2021, reaching the second round of qualifying. In 2022 and 2023 she failed in the opening round. 'Deodorant' jibe Before this year's French Open, Boisson had already made headlines, after British tennis player Harriet Dart said she \"smells really bad\". The comments were made during the first round of the clay-court Rouen Open back in April, which Boisson won 6-0, 6-3. Footage of the match showed Dart telling the umpire: \"Can you tell her to wear deodorant? Because she smells really bad.\"  The British number four later apologised to her French opponent, saying on social media she \"truly regretted\" her comments, which were made in the \"heat of the moment\". Boisson quickly hit back with a tongue-in-cheek response, posting a photo on Instagram of her on court - with deodorant superimposed into the shot. \"Dove apparently need a collab,\" she quipped - tagging the brand and throwing in a couple of emojis for good measure. Comeback from injury Boisson was supposed to make her Grand Slam debut in Paris last year, but she tore a knee ligament weeks before the start of the tournament and couldn't compete. She was out of the game for nine months and had to have ACL and meniscus surgery. Her triumphant return to the sport began with her winning the W57 Saint-Gaudens title at the beginning of the season. Read more from Sky News:Millie Bright rules herself out of England Euro squadJessie J diagnosed with early breast cancer Getting through the 'difficult moments' After scoring the winning point to send her through to this year's French Open semi-final, Boisson fell to the floor and covered her face. She later lifted her arms to take in the adoring crowds who had come to cheer her on. In the post-match interview, Boisson said the triumph is \"incredible\". She said: \"No matter what, given what happened last year and all the difficult moments I went through.\""
    },
    {
        "title": "Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says",
        "description": "Donald Trump has said Vladimir Putin \"very stongly\" told him he \"will have to respond\" to Ukraine's drone strikes on Russia's airfields.",
        "url": "https://news.sky.com/story/putin-very-strongly-vowed-revenge-against-ukraine-for-drone-strike-on-airbases-donald-trump-says-13379324",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-putin-trump_6921632.jpg?20250519175843",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-04 21:36:00",
        "Headline": "The US president said that he discussed Ukraine's drone attack, which destroyed more than 40 Russian warplanes, with Vladimir Putin during an hour and 15 minute long phone call.",
        "Content": " Donald Trump has said Vladimir Putin \"very stongly\" told him he \"will have to respond\" to Ukraine's drone strikes on Russia's airfields. More than a hundred Ukrainian drones were deployed inside Russia over the weekend, destroying more than 40 warplanes in an attack Volodymyr Zelenskyy said \"will undoubtedly be in history books\". Posting on Truth Social on Wednesday, the US president said that he discussed the attack with Mr Putin during an hour and 15 minute long phone call. \"It was a good conversation, but not a conversation that will lead to immediate Peace,\" he wrote after their first call since 19 May. \"President Putin did say, and very strongly, that he will have to respond to the recent attack on the airfields.\" Read our Q&A: Would Putin go nuclear after Ukraine's daring attacks?  The Russian president's foreign affairs adviser added Mr Trump told Mr Putin that the US did not have advance notice of the operation. \n                  Why Putin is in 'victim mode' over Ukraine's airbase drone attack\n                 \n                  Russian mercenary group ordered arson attack on London warehouse linked to Ukraine, Old Bailey hears\n                 \n                  Ukrainian drone attack puts Russians and the world on notice\n                 Analysis: Putin is playing the victim to get the US back onside An aide to Mr Putin also told reporters that they vowed to stay in constant contact, with the Russian president telling Mr Trump that recent talks between Russian and Ukrainian officials in Istanbul were useful. The US president added that he and Mr Putin also discussed \"the fact that time is running out on Iran's decision pertaining to nuclear weapons, which must be made quickly,\" before accusing Tehran of \"slow-walking their decision\".  Russia 'giving the finger' - Zelenskyy Later, Mr Zelenskyy, in a social media post, called for more pressure on Russia to end the war, saying: \"Many have spoken with Russia at various levels. \"But none of these talks have brought a reliable peace, or even stopped the war. Unfortunately, Putin feels impunity.\" The Ukrainian leader added that \"with every new strike, with every delay of diplomacy, Russia is giving the finger to the entire world - to all those who still hesitate to increase pressure on it\". 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 It comes after Russia's foreign minister claimed that Mr Zelenskyy refused a proposal for a pause lasting two to three days to pick up the bodies of dead servicemen. Earlier this week, the Ukrainian president said the proposal was not \"a real ceasefire\". He added: \"I think they're idiots because a ceasefire is meant to prevent people from being killed.\""
    },
    {
        "title": "Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday",
        "description": "The Duchess of Sussex has shared a video of her and Prince Harry dancing before she gave birth to Lilibet - as they celebrate their daughter's fourth birthday.",
        "url": "https://news.sky.com/story/meghan-shares-video-of-her-and-harry-dancing-before-she-gave-birth-to-lilibet-as-they-celebrate-daughters-4th-birthday-13378930",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-meghan-markle-duchess-of-sussex_6934606.png?20250604175447",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-04 07:27:00",
        "Headline": "The Duchess of Sussex is seen twerking in the footage next to a hospital bed as Harry, wearing a hooded top, dances alongside her.",
        "Content": " The Duchess of Sussex has shared a video of her and Prince Harry dancing before she gave birth to Lilibet - as they celebrate their daughter's fourth birthday. Meghan is seen twerking in the footage next to a hospital bed as Harry, wearing a hooded top, dances alongside her. In a post on Instagram, the duchess said the video was recorded four years ago today, adding: \"Both of our children were a week past their due dates… so when spicy food, all that walking, and acupuncture didn't work - there was only one thing left to do!\" The couple are dancing to a song called The Baby Momma Dance. Meghan also shared a series of photos of Lilibet, writing: \"Happy birthday to our beautiful girl! \"Four years ago today, she came into our lives - and each day is brighter and better because of it. Thanks to all of those sending love and celebrating her special day!\" In one photo, Meghan and Lilibet have windswept hair with water behind them. In another, the Duchess holds her daughter - named after the late Queen, whose childhood nickname was Lilibet - as a newborn. Read more:Meghan shares new picture of son Archie on his sixth birthday Last month, Meghan spoke about the challenges of balancing being an entrepreneur and a mother. Alongside Prince Harry, the duchess stepped back from her duties as a senior working royal in 2020 - before starting a new life in the US."
    },
    {
        "title": "Manhunt for former soldier suspected of murdering his three daughters in Washington state",
        "description": "A manhunt is under way for an ex-soldier suspected of kidnapping and murdering his three daughters in Washington state.",
        "url": "https://news.sky.com/story/manhunt-for-former-soldier-suspected-of-murdering-his-three-daughters-in-washington-state-13378884",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-decker-wenatchee_6934198.jpg?20250604051143",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-04 04:00:00",
        "Headline": "The public have been warned not to approach the suspect, who has years of military experience and could be hiding out in a national forest east of Seattle.",
        "Content": "A manhunt is under way for an ex-soldier suspected of kidnapping and murdering his three daughters in Washington state. Officers said Travis Decker, 32, has \"extensive\" military training and could pose a \"significant risk\" but they aren't sure if he's armed. Police, the FBI and US marshals are all involved, with drones and aircraft deployed to scour remote forested areas. The alarm was raised on Friday when the girl's mother reported her daughters - aged nine, eight and five - missing after Decker didn't return following a planned visit of three hours. Wenatchee police began the search over the weekend, looking for the white pick-up Decker is believed to live out of. The truck was found on Monday near a campground west of Leavenworth, about 70 miles east of Seattle, with the girls' bodies found in \"relatively close proximity\", according to police. Evelyn, Paityn and Olivia Decker attended Lincoln Elementary in Wenatchee school district. Their mother told police the girls didn't return as planned at 8pm on Friday and that Travis Decker's phone went straight to voicemail. A detective for the Wenatchee force said she \"expressed concern because Decker reportedly has never done this before and... is currently experiencing some mental health issues\". Officials said Decker joined the US Army in 2013 and moved to the Washington National Guard in 2021, becoming part time in the last few years, but stopped attending drills about a year ago. Read more from Sky News:Colorado attack suspect's wife and children detainedKing Of The Hill actor shot dead in Texas The public have been warned to not approach Decker and to call 911 immediately. Questions are being asked about whether time was wasted in escalating the search after police requested an amber alert from state patrol on Friday night but it didn't meet the criteria. It wasn't until Wenatchee detectives provided extra information on Saturday that an endangered missing person alert was issued. Washington State Patrol public affairs director Chris Loftis said a parent not returning their child on time was a \"rather common occurrence and not something where you just automatically assume abduction\". \"We're people too, you know, so the loss of a child, the loss of two children, the loss of three children is... devastating,\" he said."
    },
    {
        "title": "Trump's NATO ambassador says allies must agree to 5% spend on defence and security 'starting now'",
        "description": "The United States says the UK and all other NATO allies must agree to spend at least 5% of national income on defence and security \"starting now\".",
        "url": "https://news.sky.com/story/trumps-nato-ambassador-says-allies-must-agree-to-5-spend-on-defence-and-security-starting-now-13379061",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-matthew-whitaker_6934497.jpg?20250604144505",
        "type": "US",
        "Author": "Katy Scholes, security and defence producer",
        "Date Published": "2025-06-04 12:17:00",
        "Headline": "The warning comes after Sky News revealed on Tuesday that Sir Keir Starmer would be forced to agree to lift pure defence spending to 3.5% of GDP and spend a further 1.5% on defence-related areas by the 2030s.",
        "Content": "By Katy Scholes, security and defence producer  The United States says the UK and all other NATO allies must agree to spend at least 5% of national income on defence and security \"starting now\". Matthew Whitaker, Donald Trump's ambassador to the NATO alliance, said: \"Let me cut to the core of our message: 5%\" He continued: \"Peace through strength means nothing less, and it demands it equally from all allies. This is not going to be just a pledge. This is going to be a commitment. \"Every ally must commit to investing at least 5% of GDP in defence and security, starting now.\" The warning comes after Sky News revealed on Tuesday that Sir Keir Starmer would be forced to agree to lift pure defence spending to 3.5% of GDP and spend a further 1.5% on defence-related areas by the 2030s as part of a NATO push to rearm and to keep the US on side. Yet as late as Monday, the prime minister was still talking merely about an \"ambition\" to increase investment in the UK's armed forces to 3% from 2.3% by 2034 - even as he launched a major review of defence. The position caused bemusement inside the Ministry of Defence (MoD) where officials believe it is inevitable that the UK position will change. The US ambassador was speaking to journalists ahead of two days of meetings of Defence Ministers at NATO HQ in Brussels, the last before NATO leaders meet at a summit in the Hague later this month. \"The Hague summit will be a moment to lock these commitments in,\" he said. The 5% defence spending commitment is central to US plans for the summit, with European leaders hoping also to secure support for Ukraine and a reinforced posture towards Russia in summit conclusions. Underlining the weight of expectation of the US administration, the ambassador said: \"This is not a suggestion. It's a baseline for deterrence.\" It comes as NATO secretary general Mark Rutte said that alliance nations will find themselves \"in great difficulty\" in the coming years unless they go over the current 2% of GDP spending target.  Speaking to reporters on Wednesday, Mr Rutte said: \"The expectation is that on the European side of NATO and the Canadian side of NATO, if we think that we can keep ourselves safe sticking with the 2%, forget it. \"Yes, the next three to five years, but then we are in great difficulty. And the US rightly expects us to spend much more to defend ourselves with their help, but also to equalise, which is only fair with what the US is spending on defence.\" Mr Rutte, a former Dutch prime minister, is thought to want member states to commit to spending 3.5% on the military, with a further 1.5% on defence-related measures. Read more on Sky News:Mental health 'crisis' in A&EBody found in hunt for missing manReeves' spending plans by AI New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences Defence Secretary John Healey said on Tuesday that the UK already \"makes a huge contribution to NATO\" amid speculation about what the body will call for. The UK's defence review \"has NATO at its heart\", he said, pointing out that Britain was \"the only country with a nuclear deterrent that commits it in full to other NATO nations\"."
    },
    {
        "title": "Michael J Fox appeals for help in finding lost guitar played by Marty McFly in Back To The Future",
        "description": "The scene in Back To The Future where Marty McFly grabs a guitar before bursting into a rendition of Chuck Berry's Johnny B Goode is perhaps one of the most iconic in movie history.",
        "url": "https://news.sky.com/story/michael-j-fox-appeals-for-help-in-finding-lost-guitar-played-by-marty-mcfly-in-back-to-the-future-13378936",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-michael-j-fox-back-to-the-future_6934385.jpg?20250604120542",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-04 07:52:00",
        "Headline": "Christopher Lloyd, who played whacky inventor Doc Brown, has also appealed for help finding the Cherry Red Gibson ES-345 which has been missing for 40 years.",
        "Content": "The scene in Back To The Future where Marty McFly grabs a guitar before bursting into a rendition of Chuck Berry's Johnny B Goode is perhaps one of the most iconic in movie history. However, in 2025 the guitar's creators might be wishing they had time-travelling capabilities of their own as the location of the Cherry Red Gibson ES-345 is a mystery 40 years after the film's release. Gibson, based in Nashville, Texas, is asking for helping tracking down the instrument as the company produces a new documentary about the search called Lost To The Future. Filmmakers had gone looking for the instrument while making the movie's 1989 sequel but it was nowhere to be found. In a trailer shared on X, stars from the movie including Michael J Fox, who played Marty McFly, and Christopher Lloyd who played Doc Brown, have appealed to viewers to help try to find the guitar. Lloyd, in the cadence of eccentric inventor Doc Brown, says in the video that the guitar has been \"lost to the future\". \"It's somewhere lost in the space-time continuum,\" says Fox. \"Or it's in some Teamster's garage.\" \n                  President Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US\n                 \n                  Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says\n                 \n                  Elon Musk calls Donald Trump-backed tax bill a 'disgusting abomination'\n                 Harry Waters Jr, who played Marvin Berry in the film, says the instrument was last seen in 1985. Read more entertainment news:Meghan shares photos of LilibetParks and Rec actor shot dead In the film, McFly steps in for an injured band member at a 1955 school dance before leading the band into a rendition of Johnny B Goode. The time-traveller refers to it is an \"oldie where I come from\" as the 1958 song doesn't yet exist for his audience. The students at the dance fall into an awkward silence as McFly's riffs turn increasingly wild. \"I guess you guys aren't ready for that yet,\" McFly says. \"But your kids are gonna love it.\""
    },
    {
        "title": "Chinese nationals accused of smuggling 'agroterrorism' fungus into US",
        "description": "A Chinese national has been charged with smuggling a toxic fungus into the US, the FBI has said.",
        "url": "https://news.sky.com/story/chinese-nationals-accused-of-smuggling-agroterrorism-fungus-into-us-13378959",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-yunqing-jian-zunyong-liu_6934305.jpg?20250604100106",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-04 09:01:00",
        "Headline": "The fungus called fusarium graminearum is classified as a \"potential agroterrorism weapon\" in scientific literature and its toxins cause vomiting, liver damage, and reproductive defects in humans and livestock.",
        "Content": "A Chinese national has been charged with smuggling a toxic fungus into the US, the FBI has said. Zunyong Liu, 34, flew into Detroit Metropolitan Airport in July last year with fusarium graminearum - a pathogen which can attack wheat, barley, maize and rice, and sicken livestock and people, according to court documents. According to the FBI, the fungus is classified as a \"potential agroterrorism weapon\" in scientific literature, and its toxins cause vomiting, liver damage, and reproductive defects in humans and livestock. Liu was turned away at the airport and sent back to China after changing his story during interrogation, first claiming ignorance about the samples, before admitting that he had planned to use the material for research at a University of Michigan lab where his girlfriend Yunqing Jian, 33, works as a postdoctoral fellow. The bureau said authorities found a scientific article on Liu's phone titled \"Plant-Pathogen Warfare under Changing Climate Conditions\". Investigators said that a week before Liu arrived in the US, he exchanged messages with Jian, who said: \"It's a pity that I still have to work for you,\" with her boyfriend replying: \"Once this is done, everything else will be easy.\" In February this year, FBI agents went to Jian's lab on the University of Michigan campus and asked her whether she had been assisting Liu with the pathogen at the lab, to which she said \"100% no\". \n                  President Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US\n                 \n                  Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says\n                 \n                  Elon Musk calls Donald Trump-backed tax bill a 'disgusting abomination'\n                 This came as messages between the couple from 2024 suggest that Jian was already tending to fusarium graminearum at the campus lab, where Liu previously worked, before he was caught at the Detroit airport, the FBI highlighted. The university does not have federal permits to handle it. The institution said in a statement that it \"has received no funding from the Chinese government in relation to research conducted by the accused individuals\". Jian, who expressed support for the Chinese Communist Party in a signed statement on her phone, received Chinese government funding for her work on the pathogen in China, according to the court filing. Liu, who researches the same pathogen at a Chinese university, allegedly brought it to the US \"so that he could conduct research on it at the laboratory\" where his girlfriend worked. Jian and Liu were charged with conspiracy, smuggling, making false statements and visa fraud, according to United States attorney Jerome Gorgon Jr. Mr Gorgon called the allegations against the two Chinese nationals \"of the gravest national security concerns\". Read more from Sky News:Mum accused of killing three with poisonous mushroomsMusk calls Trump-backed tax bill 'disgusting abomination' A spokesperson for the Chinese ministry of foreign affairs told our US partner network NBC that it was not aware of the case and that its government \"has always required Chinese citizens overseas to strictly abide by local laws and regulations, while also safeguarding their legitimate rights and interests in accordance with the law\". Jian, who is held in jail, is set to appear in federal court for a bond hearing on Thursday afternoon. A lawyer who was assigned only for her initial appearance declined to comment. Since Liu is in China, with which the US has no extradition treaty, his arrest is unlikely unless he returns. FBI director Kash Patel said in : \"This case is a sobering reminder that the CCP is working around the clock to deploy operatives and researchers to infiltrate American institutions and target our food supply, which would have grave consequences... putting American lives and our economy at serious risk. \"Your FBI will continue working tirelessly to be on guard against it.\""
    },
    {
        "title": "The big problem facing UK as deadline to finalise US trade deal looms",
        "description": "When push comes to shove, the question of whether British industry faces crippling tariffs on exports to the US or enjoys a unique opportunity to grow may come back to three seemingly random words: \"melted and poured\".",
        "url": "https://news.sky.com/story/the-big-problem-facing-uk-as-deadline-to-finalise-us-trade-deal-looms-13379263",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-sir-keir-starmer_6909746.jpg?20250508090259",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-06-04 19:41:00",
        "Headline": "Just when you thought Britain was in the safe zone, it stands on the edge of jeopardy all over again.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  When push comes to shove, the question of whether British industry faces crippling tariffs on exports to the US or enjoys a unique opportunity to grow may come back to three seemingly random words: \"melted and poured\". To see why, let's begin by recapping where we are at present in the soap opera of US trade policy. Donald Trump has just doubled the extra tariffs charged on imports of steel and aluminium into the US from 25% to 50%. In essence, this would turn a painfully high tariff into something closer to an insurmountable economic wall (remember during the Cold War, the Iron Curtain equated to an effective tariff rate of just under 50%). Anyway, the good news for UK steel producers is that they have been spared the 50% rate and will, for the time being, only have to pay the 25% rate. But there is a sting in the tail: that stay of execution will only last until 9 July - on the basis of President Trump's most recent pronouncements.  For anyone following these events from the corner of their eyes, this might all sound a little odd. After all, didn't Sir Keir Starmer announce only a few weeks ago that British steel and aluminium makers would be able to enjoy not 25% but 0% tariffs with America, thanks to his bold new trade agreement with the US? Well, yes. But the prime minister wasn't being entirely clear about what that meant in practice. Because the reality is that every trade agreement works more or less as follows: politicians negotiate a \"heads of terms\" agreement - a vague set of principles and red lines. There then follows a period of horse-trading and negotiation to nail down the actual details and turn it into a black and white piece of law. In this case, when the PM and president made their big announcement 28 days ago, they had only agreed on the \"heads of terms\". The small print was yet to be completed. Right now, we are still in the horse-trading phase. Negotiators from the UK and the US are meeting routinely to try and nail down the small print. And that process is taking longer than many had expected. To see why, it's worth drilling a little bit into the details. The trade deal committed to allowing some cars to pass into the US at a 10% rate and to protecting some pharmaceutical trade, as well as allowing some steel and aluminium into the US at a zero tariff rate. When it comes to cars, there are some nuances about which kind of cars the deal covers. Something similar goes for pharmaceuticals. Things get even knottier when you drill into the detail on steel.  You see, one of the things the White House is nervous about is the prospect that Britain might become a kind of assembly point for steel from other countries around the world - that you could just ship some steel to Britain, get it pressed or rolled or worked over and then sent across to the US with those 0% tariffs. So the US negotiators are insisting that only steel that is \"melted and poured\" in the UK (in other words, smelted in a furnace) is covered by the trade deal. That's fine for some producers but not for others. One of Britain's biggest steel exporters is Tata Steel, which makes a lot of steel that gets turned into tin cans you find on American supermarket shelves (not to mention piping used by the oil trade). Up until recently, that steel was indeed \"melted and poured\" from the blast furnaces at Port Talbot. But Tata shut down those blast furnaces last year, intending to replace them with cleaner electric arc furnaces. And in the intervening period, it's importing raw steel instead from the Netherlands and India and then running it through its mills. Read more:UK city that once 'clothed the world' faces existential threatHow expectation of Trump tariffs boosted UK economy Or consider the situation at British Steel. There in Scunthorpe they are melting and pouring the steel from iron made in their blast furnaces - but now ponder this. While the company has been semi-nationalised by the government, it is still technically a Chinese business, owned by Jingye. In other words, its steel might technically count as benefiting China - which is something the White House is even more sensitive about. 👉 Tap here to follow Politics at Jack and Anne's wherever you get your podcasts 👈 You see how this is all suddenly becoming a bit more complicated than it might at first have looked? This helps to explain why the negotiations are taking longer than expected. But this brings us to the big problem. The White House has indicated that Britain will only be spared that 50% tariff rate provided the trade deal is finalised by 9 July. That gives the negotiators another month and a bit. That might sound like a lot, but now consider that that would be one of the fastest announcement-to-completion rates ever achieved in any trade negotiations in modern history. There's no guarantee Britain will actually get this deal done in time for that deadline - though insiders tell me they think they could be able to finalise it in a piecemeal fashion: the cars one week, steel another, pharmaceuticals another. Either way, the heat is on. Just when you thought Britain was in the safe zone, it stands on the edge of jeopardy all over again."
    },
    {
        "title": "Ministers to unveil revamped Whitehall investment hub",
        "description": "Ministers will this week unveil a revamp of the Whitehall investment hub that they hope will secure hundreds of billions of capital flows into the UK in the coming years.",
        "url": "https://news.sky.com/story/ministers-to-unveil-revamped-whitehall-investment-hub-13379091",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-baroness-gustafsson_6934495.jpg?20250604143848",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-04 13:31:00",
        "Headline": "Baroness Gustafsson, the investment minister, will be among those addressing an event to relaunch the Office for Investment on Thursday, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ministers will this week unveil a revamp of the Whitehall investment hub that they hope will secure hundreds of billions of capital flows into the UK in the coming years. Sky News understands that Baroness Gustafsson, the investment minister, will address a private event on Thursday designed to relaunch the Office for Investment (OfI). Government sources said the revamp - in which Sir Keir Starmer's top officials and the Treasury have been closely involved - would align the UK's 'investment resources' under a single brand. The new OfI has absorbed teams from other Whitehall directorates with the objective of reducing confusion among international investors in Britain, according to the sources. Greg Jackson, the Octopus Energy chief, and Baroness Lane Fox, who chairs the British Chambers of Commerce, are expected to speak at the event in central London alongside senior government officials, according to people familiar with the agenda. Thursday's summit will come days before ministers launch the new industrial strategy, with the OfI charged with targeting investors in priority sectors such as clean energy, advanced manufacturing and life sciences. A beefed-up investment hub was among the key recommendations of the former business minister Lord Harrington's review - commissioned by then-chancellor Jeremy Hunt - in 2023. \n                  The big problem facing UK as deadline to finalise US trade deal looms\n                 \n                  Post Office weighs asset sales or borrowing to meet postmaster pay target\n                 \n                  Money blog: Two London hotels named among best in world - here's how much they'll cost you\n                 One insider said last year's International Investment Summit, at which ministers claimed to have drawn £63bn of new investment for the UK, provided a solid foundation for the revamped OfI. A further event designed to attract inward investment will be held in Birmingham later this year, the chancellor, Rachel Reeves, announced on Wednesday. The Department for Business and Trade declined to comment on Wednesday afternoon."
    },
    {
        "title": "Post Office weighs asset sales or borrowing to meet postmaster pay target",
        "description": "The Post Office is considering selling assets or taking on new borrowings to help deliver an ambition to boost sub-postmasters&#8217; pay by &#163;120m this year, its chairman has said.",
        "url": "https://news.sky.com/story/post-office-weighs-asset-sales-or-borrowing-to-meet-postmaster-pay-target-13378998",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-post-office-scandal_6642534.jpg?20240730062200",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-04 10:08:00",
        "Headline": "The state-owned company is exploring a range of financing options in order to deliver an ambition to boost sub-postmaster pay by £120m this year, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Post Office is considering selling assets or taking on new borrowings to help deliver an ambition to boost sub-postmasters’ pay by £120m this year, its chairman has said. Sky News has learnt that Nigel Railton, who was confirmed as the state-owned company's long-term chair last week, told thousands of branch managers that it had ring-fenced £86m so far to increase their remuneration. In a speech delivered in Chesterfield, Mr Railton is understood to have told sub-postmasters that the Post Office's board was redoubling its efforts to meet the target of up to £120m for pay rises. Money latest: Nearly half of landlords to raise rent ahead of reforms The company was exploring options including additional cost-savings, further asset sales, sale-and-leaseback opportunities, and borrowing options, he told them. One source said Mr Railton had said on Wednesday morning that without actions already taken by Post Office management, sub-postmasters would be left with pay increases this year of just 2%, rather than the 20% it had now secured. The progress towards its £120m target comes just three months after the Post Office chairman was forced to deliver a bleaker prognosis to thousands of sub-postmasters keen to have their faith restored in the scandal-hit company. \n                  The big problem facing UK as deadline to finalise US trade deal looms\n                 \n                  Ministers to unveil revamped Whitehall investment hub\n                 \n                  Money blog: Two London hotels named among best in world - here's how much they'll cost you\n                 In March, Mr Railton said he had yet to gain certainty from Whitehall about a £120m increase for this year.  \"Our funding discussions are positive and ongoing, but I want to be honest that we are operating in a challenging financial environment,\" he told them at the time. The Post Office is reliant on funding from the government, and last November outlined plans for an ambitious transformation of its business, which includes a substantial number of job cuts. It remains hopeful of making up the £34m shortfall to reach its £120m target, according to insiders, as it seeks to rebuild its public and internal reputation in the aftermath of the Horizon IT scandal. A Post Office spokesman confirmed Mr Railton's remarks on Wednesday."
    },
    {
        "title": "UK escapes Trump's increased 50% tariffs - but White House warns the exemption is conditional",
        "description": "The UK's exemption from a doubling of duties on most US steel and aluminium imports is dependent on the ratification of May's trade pact between the two countries, the White House has warned.",
        "url": "https://news.sky.com/story/trade-war-uk-exemption-from-50-steel-tariffs-is-conditional-trump-warns-13378892",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-steel_6931732.jpg?20250531003052",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-04 04:47:00",
        "Headline": "The clock is ticking down to 9 July, when the White House has signalled higher tariffs will apply unless the terms of the US-UK trade war truce are finalised.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's exemption from a doubling of duties on most US steel and aluminium imports is dependent on the ratification of May's trade pact between the two countries, the White House has warned. Tariffs of 50% were imposed on all shipments from early on Wednesday morning, except those arriving from UK shores, which will still be subject to the previous 25% rate. Donald Trump decided to \"provide different treatment\" to the UK as he doubled down on the rates that had been in place since March as part of his early trade war salvoes, which are designed to encourage more domestic production. Money latest: Where the most families are paying inheritance tax White House economic adviser Kevin Hassett said of the move: \"We started at 25 and then, after studying the data more, realised that it was a big help, but more help is needed, and so that is why the 50 is starting.\" The decision to spare UK products from the hike currently amounts to a reprieve of just over a month, however, as the clock ticks down to a US deadline of 9 July. That is when wider \"Liberation Day\" tariff pauses for US trading partners could be applied. Mr Trump's executive order said of the UK's situation: \"On or after 9 July, the secretary may adjust the applicable rates of duty and construct import quotas for steel and aluminium consistent with the terms of the EPD [economic prosperity deal], or he may increase the applicable rates of duty to 50 percent if he determines that the United Kingdom has not complied with relevant aspects of the EPD\". Even if the trade pact agreed with the UK was to be fully enacted by that time, quotas within that agreement could still technically mean that a higher rate will apply in future. The government of Sir Keir Starmer has said it is continuing to work with US officials to agree the terms.  Read more from Sky News:Major evacuation after unexploded WWII bombs discoveredMusk calls Trump-backed tax bill a 'disgusting abomination' A spokesperson said: \"The UK was the first country to secure a trade deal with the US earlier this month and we remain committed to protecting British business and jobs across key sectors, including steel, as part of our Plan for Change. \"We're pleased that as a result of our agreement with the US, UK steel will not be subject to these additional tariffs. We will continue to work with the US to implement our agreement, which will see the 25% US tariffs on steel removed.\" The UK steel industry was cautious in its own response, while welcoming the reprieve.  Gareth Stace, the director general of UK Steel, said: \"Continued 25% tariffs will benefit shipments already on the water that we were concerned would fall under a tax hike. \"However, uncertainty remains over timings and final tariff rates, and now US customers will be dubious over whether they should even risk making UK orders. \"The US and UK must urgently turn the May deal into reality to remove the tariffs completely.\""
    },
    {
        "title": "Spinners raises £4m to meet demand for 'competitive socialising'",
        "description": "A leisure chain which aims to capitalise on Britons&#8217; enthusiasm for 'competitive socialising' has secured a multimillion-pound funding injection to accelerate its growth.",
        "url": "https://news.sky.com/story/spinners-raises-1634m-to-meet-demand-for-8216competitive-socialising8217-13378981",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spinners-bar_6934333.jpg?20250604104057",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-04 09:41:00",
        "Headline": "The bar operator, which offers darts, crazy golf and shuffleboard, has secured backing from Gresham House Ventures to progress its aim of becoming a UK-wide chain, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A leisure chain which aims to capitalise on Britons’ enthusiasm for 'competitive socialising' has secured a multimillion-pound funding injection to accelerate its growth. Sky News understands that Spinners - which offers games such as bowling, crazy golf, darts and shuffleboard - has struck a deal with investor Gresham House Ventures to provide the new capital. Spinners, which opened its first site in Reading in 2021, now trades from three venues and says it wants to become a UK-wide chain. Money latest: Nearly half of landlords to raise rent ahead of reforms Its expansion plans reflect the growth of experiential leisure activities, with technology-led innovation in crazy golf and shuffleboard fuelling consumer spending at a time when many traditional pub and nightclub operators are experiencing significant financial pressure. Other businesses which have raised capital to fund rapid growth include F1 Arcade, the Formula One simulator chain, and Red Engine, the group behind Electric Shuffle venues. Jamie Bylett, founder and director at Spinners, said the funding would \"enable us to accelerate our growth, and we look forward to announcing the location of new Spinners venues over the next few months\". Francis Ireland, an associate at Gresham House Ventures, said: \"With demand for competitive socialising growing rapidly, Spinners has built a strong base of customers at its existing sites. \"We think the business has huge potential for continued expansion as customers seek out activity-based social experiences, so we are excited to be supporting Spinners as it continues to roll out its fantastic venues up and down the country.\" Gresham House Ventures invests on behalf of the Baronsmead and Mobeus venture capital trusts and is part of Gresham House, the specialist alternative asset management group. The valuation at which it was making its £4m investment was unclear."
    },
    {
        "title": "Schroders steps back from London Stock Exchange-led City taskforce",
        "description": "Schroders has stepped back from a key financial sector taskforce led by the London Stock Exchange, even as the asset manager's chair joins the board of the bourse's parent company.",
        "url": "https://news.sky.com/story/schroders-steps-back-from-london-stock-exchange-led-city-taskforce-13378965",
        "image_url": "https://e3.365dm.com/18/04/1920x1080/skynews-schroders-gresham-asset_4274029.jpg?20180405145243",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-04 09:09:00",
        "Headline": "The asset manager is downgrading its involvement in the LSE-chaired Capital Markets Industry Taskforce even as its chair joins the board of the exchange's parent company, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Schroders has stepped back from a key financial sector taskforce led by the London Stock Exchange, even as the asset manager's chair joins the board of the bourse's parent company. Sky News has learnt that Schroders has downgraded its involvement in the Capital Markets Industry Taskforce (CMIT), which was established in 2022, following the recent change of leadership at the company. Sources said that while former Schroders chief executive Peter Harrison remained on CMIT's board in a personal capacity, his successor, Richard Oldfield, was unconvinced that its priorities and those of CMIT were aligned. Money latest: Nearly half of landlords to raise rent ahead of reforms CMIT, which stages the latest in a series of conferences for industry stakeholders later this month, is chaired by Dame Julia Hoggett, the LSE's chief executive. The group was convened at a crucial time, amid growing concern that London's status as one of the world's leading financial centres is at risk, particularly in respect of its ability to attract high-growth international companies to list on the LSE. Last week, Sky News revealed that Dame Elizabeth Corley, the Schroders chair, was joining the London Stock Exchange Group (LSEG) board - a move which sparked surprise from senior figures because of the commercial relationships between the two companies. \n                  The big problem facing UK as deadline to finalise US trade deal looms\n                 \n                  Ministers to unveil revamped Whitehall investment hub\n                 \n                  Post Office weighs asset sales or borrowing to meet postmaster pay target\n                 Insiders believe the appointment places Dame Elizabeth in a strong position to replace Don Robert as LSEG chair in the coming years. Schroders said in a statement: \"We continue to support CMIT's aims of driving growth in the UK's capital markets. \"After leaving Schroders at the end of last year, Peter continues to be a member of CMIT in a personal capacity.\" A Schroders insider claimed the company itself had never formally been a member of the taskforce. LSEG declined to comment."
    },
    {
        "title": "The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  ",
        "description": "Next week, the chancellor will unveil the first spending review since 2021. It will set Whitehall budgets for the remainder of this parliament and it will be a big moment for a government struggling to tell a story about what it is trying to achieve to voters. &#160;&#160;",
        "url": "https://news.sky.com/story/the-big-mistake-labour-think-nigel-farage-has-made-and-how-the-chancellor-hopes-to-capitalise-13379207",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beth-rigby-rachel-reeves_6934549.jpg?20250604161725",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-04 17:51:00",
        "Headline": "Beth Rigby looks ahead to the spending review on 11 June, when Rachel Reeves will set out how much money each government department will get.",
        "Content": "\n          Political editor\n              @BethRigby\n Next week, the chancellor will unveil the first spending review since 2021. It will set Whitehall budgets for the remainder of this parliament and it will be a big moment for a government struggling to tell a story about what it is trying to achieve to voters.    Rachel Reeves, flanked by transport workers in a bus depot in Rochdale, knows it. She came to the North West armed with £15bn of funding for trains, trams and buses across the Midlands and the North. Much more will be announced next week when the chancellor sets out her capital spending plans for the remainder of the parliament, having loosened her fiscal rules in the budget for capital investment. More is coming. Next week, the chancellor is expected to announce plans to spend billions more on a new railway line between Manchester and Liverpool, as well as other transport schemes for northern towns and cities. This will be the backbone of the \"Northern Arc\" that Greater Manchester Mayor Andy Burnham has been arguing for as a northern version to the much-vaunted Oxford-Cambridge growth corridor. Labour will pour £113bn into capital investment over the course of this parliament and there is an economic and political imperative for a chancellor to talk up capital spending in rail and roads, houses, power stations. On the economic side, she is in search for growth and hopes investment in infrastructure will create jobs and fire up the economy. On the politics, Labour need to show voters in their red wall seats that it is the Starmer government and not Nigel Farage that will improve the lives of working people. Ms Reeves spent a lot of time in her speech talking about the need to invest right across the country. She is overhauling the Treasury's \"Green Book\" that assesses value for money for public projects to make sure that funding decisions don't just get concentrated in the South East but are weighted to the Midlands and the North.  She also, in reiterating her commitment to her fiscal rule to not borrow to fund day-to-day government spending (the annual budgets for our schools, councils, courts, police, hospitals), sought to draw out the \"choice\" between Labour and Reform, as Labour seeks to capitalise on Mr Farage's decision last week to promise up to £80bn worth of new spending - including scrapping the two-child benefit cap and increasing winter fuel payments - while not explaining exactly how they could be paid for. Expect to hear lots more from Labour in the coming weeks about how Mr Farage is an iteration of Liz Truss, ready to pursue \"fantasy economics\" and trash the economy. Labour are gleeful that Mr Farage has opened up this line of attack and think it was an uncharacteristic political misstep from the Reform leader. Read more:More pensioners to get winter fuel paymentWe asked AI to do Rachel Reeves' job \"Farage was a politician for vibes, now he's turned himself into a politician of policy and he didn't need to do that yet,\" observed one senior Labour figure. But if that is the sell, here is the sting. While the Chancellor has loosened her fiscal rules for capital spending, she is resolute she will not do the same when it comes to day-to-day departmental spending, and next week harsh cuts are on the way for some departments, with Yvette Cooper at the Home Office, Angela Rayner at local government, and Ed Miliband at energy still wrangling over their settlements. Ms Reeves was at pains in Rochdale to talk about the extra £190bn the government has put into day-to-day spending in this parliament in order to see off the charges of austerity as those spending cuts kick in. Her allies point to the £300bn in total Ms Reeves has poured into capital projects and public services over this parliament. \"You just can't say we aren't a tax-and-spend government,\" said one ally. But this isn't just a chancellor fighting Mr Farage, she is also battling with those in her own party, under extreme pressure to loosen her fiscal rules, or tax more, as MPs - and her prime minister - demand she spends more on welfare and on getting the UK warfare-ready. You can see it all playing out. After a local election drubbing, the chancellor U-turned on her seemingly iron-clad decision to take the winter fuel allowance away from all pensioners. Now, I'm hearing that the prime minister is pressing to lift the two-child benefit cap (no matter his chief of staff is opposed to the idea, with the cap popular with voters) and MPs are demanding a reverse to some disability cuts (one government insider said the backbench revolt is real and could even force a defeat despite Sir Keir's whopping 165-strong working majority). Meanwhile, the prime minister is under pressure from US President Donald Trump for NATO to lift defence spending to 3.5% of GDP. Spending demands and rising borrowing costs, there is no wonder that attention is already moving towards possible tax rises in the Autumn budget. Ms Rayner, the deputy prime minister, wrote to the chancellor, arguing for targeted wealth taxes. Andy Burnham, the Greater Manchester mayor, told me this week on Electoral Dysfunction that he wanted more taxes on assets and a revaluation of council tax bands so those with large, valuable homes pay more. \"We have not taxed assets and wealth properly and I'd come up with something that can be controversial but council tax has not been revalued since the early 90s so there are homes in London worth tens of millions of pounds that pay less council tax than many average properties here in Greater Manchester so I would look at reforms in that space,\" Mr Burnham told me this week. \"I would look further at land taxation and land taxation reform. If you put in new infrastructure, what I learned through Crossrail, Elizabeth Line - you lift the values of that land. \"So why don't we capture some of that uplift from that? I personally would go for a land value tax across the country. So there are things that you can do that I think can be seen to be fair, because we haven't taxed those things fairly. \"I've said, and I'll say it again, we've overtaxed people's work and we've undertaxed people's assets and wealth and that balance should be put more right.\" I asked the chancellor on Wednesday if Ms Rayner and Mr Burnham had a point, and would she level with people that taxes might have to go up again as she struggles with spending demands and self-imposed borrowing constraints - she, of course, swerved the question and said the priority for her is to growth the economy. These questions will, I suspect, only get louder and more frequent in the run-up to the budget should borrowing costs continue to go up alongside demands for spending. The chancellor, at least, has a story to tell about rewiring the economy as a means to national renewal. But with the spoils of infrastructure investment perhaps decades off, Ms Reeves will find it hard to frame this spending review as a reboot for working people rather than a kicking for already stretched public services."
    },
    {
        "title": "More pensioners to get winter fuel payments this year - but confusion remains over who will qualify",
        "description": "Rachel Reeves has confirmed more pensioners will be eligible for winter fuel payments this year - but confusion remains over how the threshold could be changed. ",
        "url": "https://news.sky.com/story/more-pensioners-to-get-winter-fuel-payments-this-year-but-confusion-remains-over-who-will-qualify-13379053",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elderly-pensioner-woman_6931053.jpg?20250530104839",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-04 12:10:00",
        "Headline": "Sir Keir Starmer avoided questions on how the eligibility will change after announcing a U-turn on the unpopular cuts to the benefit two weeks ago. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Rachel Reeves has confirmed more pensioners will be eligible for winter fuel payments this year - but confusion remains over how the threshold could be changed.  Sir Keir Starmer failed to provide clarity on what the new means-test could be during Wednesday's PMQs, which came moments after the chancellor's surprise announcement at a Q&A in Manchester. Politics Live: Starmer under fire for 'disgraceful' PMQs performance Following a speech about her upcoming spending review, Ms Reeves said details on the government's winter fuel U-turn will be fleshed out \"as soon as we possibly can\". She added: \"People should be in no doubt, the means test will increase and more people will get winter fuel payment this winter.\" However the prime minister was unable to say how many pensioners would have the benefit restored when grilled on the matter by Kemi Badenoch in the House of Commons. The Tory leader claimed the chancellor \"is rushing her plans because she just realised when winter is\". \n                  Politics latest: PM opens up about his late brother - as he hails his 'personal courage'\n                 \n                  The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  \n                 \n                  Rachel Reeves is about to make huge spending decisions - these could be the winners and losers\n                 She asked: \"On behalf of the pensioners who want to know, can the prime minister be clear with us here and now: how many of the 10 million people who lost their winter fuel payments will get it back?\" Sir Keir didn't answer the question, only saying the government will \"look again at the eligibility for winter fuel and of course we'll set out how we pay for it\".  Axing universal winter fuel payments was one of the first things Labour did in government. The payment was aimed at helping pensioners pay for higher fuel bills during the colder months, but now only those in receipt of pension credit or other benefits get it. Means-testing it meant the number of pensioners eligible was slashed from 11.4 million to 1.5 million. Labour said it was necessary because of a £22bn blackhole left behind by the Conservatives, which they claimed was larger than they were expecting when they entered government. The change was expected to save around £1.3bn in 2024/25 and £1.5bn in subsequent years. Read More:Starmer's winter fuel cut U-turn claim 'not credible'Botched partial winter fuel U-turn could have profound consequences for Starmer Ministers now say decisions taken to stabilise the economy mean the eligibility can be extended. However, the U-turn is largely seen as a response to the party's drubbing at the local elections, which Labour MPs blamed on the unpopularity of the policy on the door step.  It wasn't clear until today whether the changes would come into effect before this winter, as the funding is expected to be laid out officially in the autumn statement in November. Pensions minister Torsten Bell today confirmed to the Work and Pensions Committee that there is no prospect of returning to a universal winter fuel payment, saying \"most people agree it's not a good idea to have a system of paying a few hundred pounds to millionaires\". Last month, former Labour prime minister Gordon Brown said governments should be fair to pensioners but one solution could be excluding only those on the top rate of income tax from winter fuel payments.  Universal winter fuel payments were introduced by Mr Brown when he was chancellor in 1997, in the first year of the New Labour government."
    },
    {
        "title": "Charities welcome half a million more children being eligible for free school meals",
        "description": "Charities and school leaders have welcomed free school meals being opened up to more than half a million extra children.",
        "url": "https://news.sky.com/story/charities-welcome-half-a-million-more-children-being-eligible-for-free-school-meals-13379294",
        "image_url": "https://e3.365dm.com/20/06/1920x1080/skynews-school-meals-marcus-rashford_5015495.jpg?20200617143413",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-04 20:41:00",
        "Headline": "The government will expand free school meals' eligibility in England to all households on universal credit from September 2026.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Charities and school leaders have welcomed free school meals being opened up to more than half a million extra children. The government has announced it will make children in all households on universal credit in England eligible for free school meals from September 2026. Parents will be nearly £500 better off each year because of the change, the Department for Education said. Currently, only pupils from households with an income of less than £7,400 a year are eligible for free school meals, meaning hundreds of thousands of children living in poverty do not have access to them. The latest figures, from January 2024, show 2.1m children were eligible for free school meals - 24.6% of all pupils in England. The government has not said how it will fund another 500,000 children's school meals, which the Institute for Fiscal Studies (IFS) calculated would cost about £1 billion and benefit 1.7 million children between Year 3 and Year 11 in the long run. The Department for Education claimed the eligibility expansion would lift 100,000 children across England completely out of poverty, but did not provide details of how. \n                  What is the two-child benefit cap and will Labour scrap it?\n                 \n                  Ministers considering scrapping two-child benefit cap, education secretary says\n                 \n                  Teaching unions gear up for fight with Number 10 over AI job-loss fears\n                 However, the IFS said while it would lift 100,000 children out of poverty in the long-run, the \"costs and the benefits of this policy are likely to be much smaller... and will not see anything like 100,000 children lifted out of poverty next year\". Charities broadly welcomed the change, with The Children's Society calling it a \"practical, compassionate step that will make a real difference\". Chief executive Mark Russell said it is a move his charity has been pushing for and would lift thousands of children out of hunger and help ease the pressure on households struggling to make ends meet. The Child Poverty Action Group said it was \"fantastic news and a game-changer for children and families\". \"We hope this is a sign of what's to come in autumn's child poverty strategy, with government taking more action to meet its manifesto commitment to reduce child poverty in the UK,\" Kate Anstey, head of education policy, said. Read more:Starmer says govt 'will look at' scrapping two-child benefits limitExtra 50,000 children could be pushed into poverty over welfare changes School leaders' union NAHT welcomed the change but asked for the government to introduce \"auto-enrolment so no child entitled to a free meal misses out\". NAHT general secretary Paul Whiteman added: \"It's vital that this positive extension of free school meals is backed up by other tangible measures which help lift even more children out of poverty when the government's child poverty taskforce reports back later this year.\"  At the end of May, the government delayed publishing its child poverty strategy until the autumn over Treasury concerns about the cost implications of ending the two-child limit on universal credit, which is expected to be part of the strategy. Conservative leader Kemi Badenoch pushed Sir Keir Starmer on whether he will lift it at Prime Minister's Questions on Wednesday after the PM last week said the government \"will look at\" scrapping it, in his strongest indication yet that he will. On the free school meals announcement, Sir Keir said: \"Working parents across the country are working tirelessly to provide for their families but are being held back by cost-of-living pressures. \"My government is taking action to ease those pressures. Feeding more children every day, for free, is one of the biggest interventions we can make to put more money in parents' pockets, tackle the stain of poverty, and set children up to learn. \"This expansion is a truly historic moment for our country, helping families who need it most and delivering our Plan for Change to give every child, no matter their background, the same chance to succeed.\" Education Secretary Bridget Phillipson called it a \"giant step\" towards ending child poverty."
    },
    {
        "title": "UK 'appalled' by reports of Palestinians killed while trying to reach new Gaza aid sites",
        "description": "The government has said it is \"appalled\" by reports of Palestinians being killed while trying to access aid sites in Gaza.",
        "url": "https://news.sky.com/story/uk-appalled-by-reports-of-palestinians-killed-while-trying-to-reach-new-gaza-aid-sites-13379145",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-aid_6933981.jpg?20250603182831",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-04 17:17:00",
        "Headline": "A new aid distribution system set up by Israel and the US last week has paused operations after reports of 27 Palestinians being killed at a site.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The government has said it is \"appalled\" by reports of Palestinians being killed while trying to access aid sites in Gaza. Foreign Office minister Hamish Falconer told the Commons on Wednesday afternoon that Israel's newly introduced measures for aid delivery are \"inhumane, foster desperation and endanger civilians\". The Gaza Humanitarian Foundation (GHF), backed by Israel and the US, opened new aid centres last week in Gaza after an 11-week aid blockade, but they have been highly criticised as Palestinians have been killed and injured while waiting at the centres. The Hamas-run health ministry claimed 27 Palestinians were killed at a centre in Rafah, southern Gaza, on Tuesday and more than 90 people were injured in what it called a \"massacre\". However, the Israel Defence Forces (IDF) said accusations that the Israeli military shot at civilians were \"completely unfounded and false\". Mr Falconer said: \"We are appalled by repeated reports of mass casualty incidents in which Palestinians have been killed when trying to access aid sites in Gaza. \"Desperate civilians who have endured 20 months of war should never face the risk of death or injury to simply feed themselves and their families. We call for an immediate and independent investigation into these events for the perpetrators to be held to account.\" \n                  Hundreds of thousands in Gaza 'catastrophically food insecure', says aid chief\n                 \n                  Hamas and Israel respond to former Biden official who said Israel 'without a doubt' committed war crimes in Gaza\n                 \n                  Gaza aid centres to be closed for day - as IDF warns nearby roads will be 'considered combat zones'\n                 He said it is \"deeply disturbing\" the incidents happened near the new aid distribution sites. \"Israel's newly introduced measures for aid delivery are inhumane, foster desperation and endanger civilians,\" he said. \"Israel's unjustified block on aid into Gaza needs to end - it is inhumane. Israel must immediately allow the United Nations and aid partners to safely deliver all types of aid at scale to save lives, reduce suffering and maintain dignity.\" Read more:How the Israeli-backed aid plan in Gaza is failingCelebrities join more than 300 figures urging PM to 'end complicity' in Gaza The minister said the UN Security Council is expected to consider a resolution on Wednesday calling for an immediate ceasefire, the release of all hostages and the lifting of all restrictions on humanitarian aid. On Wednesday morning, GHF announced it was temporarily closing its three distribution sites \"for renovations, organisation, and efficiency improvements\". The IDF said \"travel is prohibited via the roads leading to the distribution centres, which are considered combat zones\". On Sunday, at least 31 people were reported to have been killed near the same aid distribution centre, according to the Hamas-run Palestinian health ministry - but the IDF said they were \"false reports\". PM: Gaza facing dark days Sir Keir Starmer, speaking as pro-Palestine protesters surrounded parliament on Wednesday, said Gaza is facing \"dark days\" and vowed to consider \"further action\" against Israel. He used Prime Minister's Questions to describe the Israeli government's conduct in Gaza as \"counter productive and intolerable\".  The government, he said, has \"strongly opposed the expansion of military operations and settler violence, and the blocking of humanitarian aid\". Sir Keir said the government \"will keep looking at further action along with our allies, including sanctions\". \"But let me be absolutely clear; we need to get back to a ceasefire,\" he said. Corbyn calls for UK involvement inquiry Later on Wednesday afternoon, former Labour leader and now-independent MP Jeremy Corbyn demanded a public inquiry into the UK's involvement in Israeli military operations in Gaza. He introduced the bill, which will get a second reading on 4 July after no MPs opposed it. The long-time supporter of Palestine had been hoping for a vote, obtained if anybody opposed it, in the hope of forcing Labour MPs to vote against the government."
    },
    {
        "title": "Billions to be spent on regional transport but government 'can't do everything it wants to', says Rachel Reeves",
        "description": "Rachel Reeves has said &#163;15.6bn will go towards regional transport projects in next week's spending review, but there are other \"good things\" she's had to say no to.",
        "url": "https://news.sky.com/story/billions-to-be-spent-on-regional-transport-but-government-cant-do-everything-it-wants-to-says-rachel-reeves-13378982",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-rachel-reeves-chancellor_6934358.jpg?20250604112118",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-04 09:23:00",
        "Headline": "The chancellor has announced billions of pounds of investment in public transport in the North and Midlands - but said other departments have not got what they asked for. \n",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Rachel Reeves has said £15.6bn will go towards regional transport projects in next week's spending review, but there are other \"good things\" she's had to say no to. The chancellor said the cash marks the \"biggest ever investment\" by a British government in transport links outside of London and the southeast, with mayors to receive the funding directly to be spent on train stations, trams, and bus routes. Politics Live: PM under fire for 'disgraceful' PMQs performance Ms Reeves was speaking in Manchester ahead of laying out her departmental spending plans for future years on 11 June, a process known as a spending review. She said that tax hikes and changes to the way borrowing for investment is accounted for meant £300bn extra is available over the coming years. But she warned: \"Does that mean that we'll be able to do everything that we want to do? No...there are good things that I've had to say no to.\" She insisted this was not because of her self-imposed \"fiscal rules\" but because \"of 14 years of Conservative maltreatment of our public services, our public realm, and of our economy\". \n                  Politics latest: PM opens up about his late brother - as he hails his 'personal courage'\n                 \n                  The big mistake Labour think Nigel Farage has made - and how the chancellor hopes to capitalise  \n                 \n                  More pensioners to get winter fuel payments this year - but confusion remains over who will qualify\n                  The fiscal rules, which include a promise to match day-to-day spending with revenues rather than borrowing, meant Ms Reeves had to make cuts in her spring statement to balance the books, and there is speculation more are to come. The chancellor did not say what departments could face a squeeze next week, but insisted spending on police will increase following concerns from police chiefs about their budgets. She said transport was being prioritised because a lack of infrastructure outside of London puts England's other cities \"at a disadvantage compared to their European counterparts\", contributing to the UK's stagnant growth. The settlements include:  • £2.5bn for Greater Manchester for projects including new tram stops in Bury, Manchester and Oldham;• £2.4bn for the West Midlands for an extension of the metro from Birmingham city centre to the new sports quarter;• £2.1bn to start building West Yorkshire Mass Transit by 2028;• £2bn for the East Midlands to design a new mass transit system between Derby and Nottingham;• £1.8bn for the North East for a metro extension linking Newcastle and Sunderland via Washington;• 1.6bn for the Liverpool City Region for new bus routes, including to the airport and football stadiums;• £1.5bn for South Yorkshire including £530m to renew the region's trams;• £1bn for Tees Valley, including £60m for the Platform 3 extension at Middlesbrough station;• £800m for the West of England, including £200m for mass transit links between Bristol, Bath, South Gloucestershire and north Somerset; Some of the projects formed part of Rishi Sunak's \"Network North\" plan, intended to compensate for the decision to scrap the HS2 line north of Birmingham. Labour put a pause on the plans when they entered government to review the funds, so it was not clear until now if the money would be made available. Shadow Treasury minister Gareth Davies accused the chancellor of \"copying and pasting\" announcements made by the Tories \"to salvage her failing economic plan\" following \"U-turn after U-turn\". He added: \"The country is not falling for their lies anymore. Britain deserves better.\" Winter fuel changes to come this year In a surprise announcement during questions from the media, Ms Reeves also said that changes to the winter fuel payment will be made this year after a backlash to the cuts made within a month of entering office last year. Read More:Partial winter fuel U-turn could have consequences for PMCan Labour's new local cash idea win over Reform voters? She denied she would be forced into another large tax raid to fund her plans, as the government is also seeking to increase defence spending.  \"We made decisions in the budget last year to increase taxes by £40bn. We have absolutely no intention of repeating a budget on that scale again,\" she said. Asked if deputy prime minister Angela Rayner is fully behind her plans, following reports she has been pushing for wealth taxes, Ms Reeves said that it is \"perfectly normal for government ministers\" to come up with their ideas. \"Angela Rayner had ideas around, I think around £3bn of tax changes, some of them in housing, which is an area that she covers. But we did raise taxes by £40bn in the budget last year, much more than £3bn.\" The Daily Telegraph reported last month that Ms Rayner, who is also the housing secretary, proposed a higher corporation tax level for the banks and reinstating the pensioners' lifetime allowance. She is said to be exasperated at having to defend the government's spending cuts amid a slump in the polls and a drumming at last month's local elections, fuelled by a rise in Reform UK's popularity. Ms Reeves took aim at her critics on Wednesday, accusing Reform leader Nigel Farage of being \"itching to repeat\" the \"fantasy economics\" of Liz Truss, whose 2022 mini-budget sent markets into turmoil and upended her time as prime minister. \"I will never take those risks. Labour will never take those risks,\" she said."
    },
    {
        "title": "Trump's NATO ambassador says allies must agree to 5% spend on defence and security 'starting now'",
        "description": "The United States says the UK and all other NATO allies must agree to spend at least 5% of national income on defence and security \"starting now\".",
        "url": "https://news.sky.com/story/trumps-nato-ambassador-says-allies-must-agree-to-5-spend-on-defence-and-security-starting-now-13379061",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-matthew-whitaker_6934497.jpg?20250604144505",
        "type": "Politics",
        "Author": "Katy Scholes, security and defence producer",
        "Date Published": "2025-06-04 12:17:00",
        "Headline": "The warning comes after Sky News revealed on Tuesday that Sir Keir Starmer would be forced to agree to lift pure defence spending to 3.5% of GDP and spend a further 1.5% on defence-related areas by the 2030s.",
        "Content": "By Katy Scholes, security and defence producer  The United States says the UK and all other NATO allies must agree to spend at least 5% of national income on defence and security \"starting now\". Matthew Whitaker, Donald Trump's ambassador to the NATO alliance, said: \"Let me cut to the core of our message: 5%\" He continued: \"Peace through strength means nothing less, and it demands it equally from all allies. This is not going to be just a pledge. This is going to be a commitment. \"Every ally must commit to investing at least 5% of GDP in defence and security, starting now.\" The warning comes after Sky News revealed on Tuesday that Sir Keir Starmer would be forced to agree to lift pure defence spending to 3.5% of GDP and spend a further 1.5% on defence-related areas by the 2030s as part of a NATO push to rearm and to keep the US on side. Yet as late as Monday, the prime minister was still talking merely about an \"ambition\" to increase investment in the UK's armed forces to 3% from 2.3% by 2034 - even as he launched a major review of defence. The position caused bemusement inside the Ministry of Defence (MoD) where officials believe it is inevitable that the UK position will change. The US ambassador was speaking to journalists ahead of two days of meetings of Defence Ministers at NATO HQ in Brussels, the last before NATO leaders meet at a summit in the Hague later this month. \"The Hague summit will be a moment to lock these commitments in,\" he said. The 5% defence spending commitment is central to US plans for the summit, with European leaders hoping also to secure support for Ukraine and a reinforced posture towards Russia in summit conclusions. Underlining the weight of expectation of the US administration, the ambassador said: \"This is not a suggestion. It's a baseline for deterrence.\" It comes as NATO secretary general Mark Rutte said that alliance nations will find themselves \"in great difficulty\" in the coming years unless they go over the current 2% of GDP spending target.  Speaking to reporters on Wednesday, Mr Rutte said: \"The expectation is that on the European side of NATO and the Canadian side of NATO, if we think that we can keep ourselves safe sticking with the 2%, forget it. \"Yes, the next three to five years, but then we are in great difficulty. And the US rightly expects us to spend much more to defend ourselves with their help, but also to equalise, which is only fair with what the US is spending on defence.\" Mr Rutte, a former Dutch prime minister, is thought to want member states to commit to spending 3.5% on the military, with a further 1.5% on defence-related measures. Read more on Sky News:Mental health 'crisis' in A&EBody found in hunt for missing manReeves' spending plans by AI New Sky News podcast launches on 10 June - The Wargame simulates an attack by Russia to test UK defences Defence Secretary John Healey said on Tuesday that the UK already \"makes a huge contribution to NATO\" amid speculation about what the body will call for. The UK's defence review \"has NATO at its heart\", he said, pointing out that Britain was \"the only country with a nuclear deterrent that commits it in full to other NATO nations\"."
    },
    {
        "title": "UK escapes Trump's increased 50% tariffs - but White House warns the exemption is conditional",
        "description": "The UK's exemption from a doubling of duties on most US steel and aluminium imports is dependent on the ratification of May's trade pact between the two countries, the White House has warned.",
        "url": "https://news.sky.com/story/trade-war-uk-exemption-from-50-steel-tariffs-is-conditional-trump-warns-13378892",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-steel_6931732.jpg?20250531003052",
        "type": "Politics",
        "Author": "James Sillars",
        "Date Published": "2025-06-04 04:47:00",
        "Headline": "The clock is ticking down to 9 July, when the White House has signalled higher tariffs will apply unless the terms of the US-UK trade war truce are finalised.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's exemption from a doubling of duties on most US steel and aluminium imports is dependent on the ratification of May's trade pact between the two countries, the White House has warned. Tariffs of 50% were imposed on all shipments from early on Wednesday morning, except those arriving from UK shores, which will still be subject to the previous 25% rate. Donald Trump decided to \"provide different treatment\" to the UK as he doubled down on the rates that had been in place since March as part of his early trade war salvoes, which are designed to encourage more domestic production. Money latest: Where the most families are paying inheritance tax White House economic adviser Kevin Hassett said of the move: \"We started at 25 and then, after studying the data more, realised that it was a big help, but more help is needed, and so that is why the 50 is starting.\" The decision to spare UK products from the hike currently amounts to a reprieve of just over a month, however, as the clock ticks down to a US deadline of 9 July. That is when wider \"Liberation Day\" tariff pauses for US trading partners could be applied. Mr Trump's executive order said of the UK's situation: \"On or after 9 July, the secretary may adjust the applicable rates of duty and construct import quotas for steel and aluminium consistent with the terms of the EPD [economic prosperity deal], or he may increase the applicable rates of duty to 50 percent if he determines that the United Kingdom has not complied with relevant aspects of the EPD\". Even if the trade pact agreed with the UK was to be fully enacted by that time, quotas within that agreement could still technically mean that a higher rate will apply in future. The government of Sir Keir Starmer has said it is continuing to work with US officials to agree the terms.  Read more from Sky News:Major evacuation after unexploded WWII bombs discoveredMusk calls Trump-backed tax bill a 'disgusting abomination' A spokesperson said: \"The UK was the first country to secure a trade deal with the US earlier this month and we remain committed to protecting British business and jobs across key sectors, including steel, as part of our Plan for Change. \"We're pleased that as a result of our agreement with the US, UK steel will not be subject to these additional tariffs. We will continue to work with the US to implement our agreement, which will see the 25% US tariffs on steel removed.\" The UK steel industry was cautious in its own response, while welcoming the reprieve.  Gareth Stace, the director general of UK Steel, said: \"Continued 25% tariffs will benefit shipments already on the water that we were concerned would fall under a tax hike. \"However, uncertainty remains over timings and final tariff rates, and now US customers will be dubious over whether they should even risk making UK orders. \"The US and UK must urgently turn the May deal into reality to remove the tariffs completely.\""
    },
    {
        "title": "Has Trump betrayed Starmer steel deal?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics At Sam And Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/has-trump-betrayed-starmer-steel-deal-13378901",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-04 05:11:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics At Sam And Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. The UK steel industry - which was on the verge of collapse just weeks ago - will no longer face the heaviest of Donald Trump's tariffs, the US announced overnight. We're the only country spared the doubling of tariffs on steel imports to the US to 50% - ours instead capped at 25%. This sounds great - until you remember last month's UK-US agreement - when the PM negotiated President Trump's 25% tariff down to zero - a deal that is yet to come into force. What's happened? And how big a win is this for Sir Keir Starmer and for Labour in any case? Is this ensuring the revival of British steel, or merely another stay of execution?"
    },
    {
        "title": "Meta found 'covertly tracking' Android users through Instagram and Facebook",
        "description": "Meta and search engine company Yandex have been \"covertly tracking\" Android users in the background of their devices, according to experts.",
        "url": "https://news.sky.com/story/meta-found-covertly-tracking-android-users-through-instagram-and-facebook-13379083",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-instagram-meta_6934485.jpg?20250604142109",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-04 13:09:00",
        "Headline": "Google says Meta and search engine company Yandex used Android capabilities \"in unintended ways that blatantly violate our security and privacy principles\".",
        "Content": "\n          Science and Technology reporter\n       Meta and search engine company Yandex have been \"covertly tracking\" Android users in the background of their devices, according to experts. Academics at the Radboud University in the Netherlands and IMDEA Networks said they discovered Meta and Yandex have been tracking Android users' browser activity without their consent and then using the data in their apps. Meta said it was looking into the issue, while Yandex denied collecting any sensitive data. Gunes Acar, assistant professor at Radboud University, said the \"covert\" data collection was spotted in January. He said he discovered Meta's apps, including Facebook and Instagram, and Yandex's apps, such as Yandex Maps, were sitting in the background of Android devices and loading a script that sent data locally back to apps on users' phones. The scripts bypassed Android's security measures and meant that Meta and Yandex could track what users were doing on web browsers, without the user consenting or even knowing, according to the expert. \"They are bridging these two worlds that we think are separate; web browsing and mobile app activities,\" Dr Acar told Sky News. \"That's very shocking.\" The apps were able to track users' browser data on all major Android browsers, even if the user was in incognito mode, the academics said. \"It's really concerning because it negates every privacy control that you have in modern browsers and also in modern mobile platforms like Android,\" said Narseo Vallina-Rodriguez, associate professor at IMDEA Networks, to Sky News. Google, which owns the Android operating system, confirmed the covert activity to Sky News. It said Meta and Yandex used Android's capabilities \"in unintended ways that blatantly violate our security and privacy principles\". What have Meta and Yandex said? Meta told Sky News it was quickly looking into the issue. \"We are in discussions with Google to address a potential miscommunication regarding the application of their policies,\" said a Meta spokesperson. \"Upon becoming aware of the concerns, we decided to pause the feature while we work with Google to resolve the issue.\" Yandex said it \"strictly complies with data protection standards\", adding: \"The feature in question does not collect any sensitive information and is solely intended to improve personalisation within our apps.\" Read more science and tech news:AI foot scanner recognises heart warning signsCoffee 'helps women age more healthily' Meta appeared to have been doing the data tracking for around eight months, while Yandex had since 2017, the academics said. \"We found that Facebook was doing it on roughly 16,000 websites when visited from the EU, [...] Yandex was doing this on 1,300 websites,\" said Tim Vlummens, a PHD student at KU Leuven who worked on the research. Google told Sky News it had already \"implemented changes to mitigate these invasive techniques and have opened our own investigation and are directly in touch with the parties\". The tech giant did not respond when asked what repercussions Meta and Yandex were facing for their conduct. Firefox, Microsoft Edge and DuckDuckGo browsers were also affected, with Firefox owner Mozilla and DuckDuckGo engineers taking action to stop any future covert tracking."
    },
    {
        "title": "A-ha frontman Morten Harket diagnosed with Parkinson's disease",
        "description": "A-ha frontman Morten Harket has revealed he has been diagnosed with Parkinson's disease.",
        "url": "https://news.sky.com/story/a-ha-frontman-morten-harket-diagnosed-with-parkinsons-disease-13379125",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-morten-harket_6934553.jpg?20250604162015",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-04 14:54:00",
        "Headline": "Harket, who sang the classic 1980s track Take On Me, said he had undergone several rounds of brain surgery and that he was managing the symptoms of the disease.",
        "Content": "A-ha frontman Morten Harket has revealed he has been diagnosed with Parkinson's disease. The 65-year-old has been lead singer of the Norwegian band since it was founded in 1982 - and sung the track \"Take On Me\" which remains one of the most popular songs of the 1980s. In a statement on the band's website, and confirmed by record label Sony Music, Harket said he had undergoneseveral rounds of brain surgery and that he was managing the symptoms of the disease. Parkinson's causes deterioration in the brain's nervous system, leading to tremors and other symptoms that can becomeprogressively worse over time. The disease can be treated with surgery and medication, but there is no cure. Harket said he underwent neurological procedures to have electrodes implanted inside his brain last year and that this had reduced the symptoms. Read more entertainment news:Jessie J diagnosed with early breast cancerMeghan shares photos of LilibetParks and Rec doctor shot dead \n                  Artwork referencing JK Rowling taken down by National Trust after being 'tampered with'\n                 \n                  Jessie J diagnosed with early breast cancer\n                 \n                  Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday\n                 Known for the wide range of his voice, Harket said he did not know if he would be able to perform again. \"I've got no problem accepting the diagnosis,\" he said, adding that it was difficult to balance medication and managingside effects of the treatment. \"I'm trying the best I can to prevent my entire system from going into decline,\" Harket said. Formed in 1982 by Harket and his friends Paul Waaktaar-Savoy and Magne Furuholmen, A-ha saw a global breakthrough in 1985 with their debut album \"Hunting High and Low\" featuring \"Take On Me\" and the hit \"The Sun Always Shines on TV\"."
    },
    {
        "title": "Artwork referencing JK Rowling taken down by National Trust after being 'tampered with'",
        "description": "The National Trust says it has taken down a piece of art featuring JK Rowling's name after it was \"tampered with by a member of the public\".",
        "url": "https://news.sky.com/story/artwork-referencing-jk-rowling-taken-down-after-being-tampered-with-13379252",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jeanhatchet-artwork_6934697.jpg?20250604192512",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-04 19:01:00",
        "Headline": "The Harry Potter author's name was \"stitched over by other participants\". Later, a feminist campaigner said she had \"corrected\" the work by taking off the stitching which was over Rowling's name.",
        "Content": "The National Trust says it has taken down a piece of art featuring JK Rowling's name after it was \"tampered with by a member of the public\". It has urged people \"not to damage or tamper with artworks\" once they are finished and on public display. Between April and November last year, visitors to Derbyshire's Hardwick Hall were invited to nominate a \"contemporary Virtuous Woman\", whose name was then sewn into the fabric, before it was put on public show in February. Until recently, the artwork, A Virtuous Woman, has continued to be on display, featuring the Harry Potter author's name, which was \"stitched over by other participants\" at an unspecified time. Feminist campaigner Jean Hatchet said on X last week that she had \"corrected\" the work by unpicking the stitching which was over Rowling's name. It comes after criticism of Rowling's views on gender issues that have seen her called transphobic by activists, which she has denied. The National Trust said the piece has been \"taken off display… to protect it from further tampering or damage\". \n                  Women's centre founded by Harry Potter author JK Rowling to host conference on internet pornography\n                 \n                  John Lithgow on JK Rowling's trans stance backlash: 'She's handled it fairly gracefully'\n                 \n                  JK Rowling calls for Sir Keir Starmer to apologise after Supreme Court ruling on women\n                 Ms Hatchet has criticised the organisation's move, saying she removed the \"stitching with the correct tool\", took \"great time and care\", and did not damage it. She told Sky News: \"Everyone involved in managing this project behaved in a cowardly fashion after a vindictive individual performed an act of woman-hating. It should have been removed immediately. Because they wouldn't, we did.\" The stitched names of British queens, artist Yoko Ono, ex-prime minister Baroness Margaret Thatcher, climate campaigner Greta Thunberg, and singer Taylor Swift among others appear not to have stitching over them on the recycled textile. The work comes from artist Layla Khoo in association with the University of Leeds and the National Trust. A spokeswoman for the trust said: \"The artwork was open to contributions for eight months and closed in November when the piece was finished and put on public display. \"During the participation phase, JK Rowling's name was stitched on to the piece seven times and in two instances it was stitched over by other participants. \"At the time the artwork was completed and subsequently hung, JK Rowling's name appeared five times without any overstitching. \"We ask people not to damage or tamper with artworks once they are finished and on public display. \"The piece has been taken off display for investigation and to protect it from further tampering or damage. We take all claims and incidents of damage to items in our care seriously and investigate each one.\""
    },
    {
        "title": "Jessie J diagnosed with early breast cancer",
        "description": "Singer Jessie J has been diagnosed with \"early breast cancer\".&#160;",
        "url": "https://news.sky.com/story/jessie-j-diagnosed-with-early-breast-cancer-13378944",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jessie-j-breast-cancer_6934291.jpg?20250604093718",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-04 08:22:00",
        "Headline": "The 37-year-old singer shared her diagnosis with a video on social media.. She said she will take a break from music in order to have surgery. ",
        "Content": " Singer Jessie J has been diagnosed with \"early breast cancer\".  The Price Tag singer, whose real name is Jessica Cornish, said in a video posted to Instagram that she has recently spent a lot of time \"in and out of tests\". She said she will \"disappear for a bit\" after performing at Capital Radio's Summertime Ball later this month to have surgery. \"I was diagnosed with early breast cancer,\" the 37-year-old said during the video. \"Cancer sucks in any form, but I'm holding on to the word 'early'. \"It's a very dramatic way to get a boob job. I am going to disappear for a bit after Summertime Ball to have my surgery, and I will come back with massive tits and more music.\" 'I need a hug' Breast cancer is the most common type of cancer in women in the UK. The singer said sharing her diagnosis publicly has helped her process the news and show solidarity with others going through a similar experience. \"I just wanted to be open and share it,\" she said. \"One, because, selfishly, I do not talk about it enough. I'm not processing it because I'm working so hard. \"I also know how much sharing in the past has helped me with other people giving me their love and support and also their own stories. I'm an open book. \"It breaks my heart that so many people are going through so much similar and worse - that's the bit that kills me.\" She continued: \"The timing of it has been mad but also beautiful and given me this incredible perspective in this time. \"But honestly I need to process it and talk about it and, I need a hug. You have loved me through all my good and hard times. And I don't want this to be any different.\" 'I'm here for you' Messages of support from celebrities flooded the comments section under the singer's post. Former Little Mix singer Leigh-Anne Pinnock wrote: \"Sending you so much love.\" Fellow singer Rita Ora said: \"You're literally my favourite person and I'm praying for you, you've got this. My mother had it and I know the surgery and any treatment on this matter is mentally tough, so I'm here for you.\" Read more from Sky News:Meghan shares photos of LilibetMusk calls Trump-backed tax bill a 'disgusting abomination' London-born singer Jessie J welcomed her son, Sky Safir Cornish Colman, in 2023, having miscarried in November 2021. She has battled with ill health throughout her life, having been diagnosed with a heart condition aged eight, suffering a minor stroke aged 18 and having briefly gone deaf in 2020."
    },
    {
        "title": "Meghan shares video of her and Harry dancing before she gave birth to Lilibet - as they celebrate daughter's 4th birthday",
        "description": "The Duchess of Sussex has shared a video of her and Prince Harry dancing before she gave birth to Lilibet - as they celebrate their daughter's fourth birthday.",
        "url": "https://news.sky.com/story/meghan-shares-video-of-her-and-harry-dancing-before-she-gave-birth-to-lilibet-as-they-celebrate-daughters-4th-birthday-13378930",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-meghan-markle-duchess-of-sussex_6934606.png?20250604175447",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-04 07:27:00",
        "Headline": "The Duchess of Sussex is seen twerking in the footage next to a hospital bed as Harry, wearing a hooded top, dances alongside her.",
        "Content": " The Duchess of Sussex has shared a video of her and Prince Harry dancing before she gave birth to Lilibet - as they celebrate their daughter's fourth birthday. Meghan is seen twerking in the footage next to a hospital bed as Harry, wearing a hooded top, dances alongside her. In a post on Instagram, the duchess said the video was recorded four years ago today, adding: \"Both of our children were a week past their due dates… so when spicy food, all that walking, and acupuncture didn't work - there was only one thing left to do!\" The couple are dancing to a song called The Baby Momma Dance. Meghan also shared a series of photos of Lilibet, writing: \"Happy birthday to our beautiful girl! \"Four years ago today, she came into our lives - and each day is brighter and better because of it. Thanks to all of those sending love and celebrating her special day!\" In one photo, Meghan and Lilibet have windswept hair with water behind them. In another, the Duchess holds her daughter - named after the late Queen, whose childhood nickname was Lilibet - as a newborn. Read more:Meghan shares new picture of son Archie on his sixth birthday Last month, Meghan spoke about the challenges of balancing being an entrepreneur and a mother. Alongside Prince Harry, the duchess stepped back from her duties as a senior working royal in 2020 - before starting a new life in the US."
    },
    {
        "title": "Michael J Fox appeals for help in finding lost guitar played by Marty McFly in Back To The Future",
        "description": "The scene in Back To The Future where Marty McFly grabs a guitar before bursting into a rendition of Chuck Berry's Johnny B Goode is perhaps one of the most iconic in movie history.",
        "url": "https://news.sky.com/story/michael-j-fox-appeals-for-help-in-finding-lost-guitar-played-by-marty-mcfly-in-back-to-the-future-13378936",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-michael-j-fox-back-to-the-future_6934385.jpg?20250604120542",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-04 07:52:00",
        "Headline": "Christopher Lloyd, who played whacky inventor Doc Brown, has also appealed for help finding the Cherry Red Gibson ES-345 which has been missing for 40 years.",
        "Content": "The scene in Back To The Future where Marty McFly grabs a guitar before bursting into a rendition of Chuck Berry's Johnny B Goode is perhaps one of the most iconic in movie history. However, in 2025 the guitar's creators might be wishing they had time-travelling capabilities of their own as the location of the Cherry Red Gibson ES-345 is a mystery 40 years after the film's release. Gibson, based in Nashville, Texas, is asking for helping tracking down the instrument as the company produces a new documentary about the search called Lost To The Future. Filmmakers had gone looking for the instrument while making the movie's 1989 sequel but it was nowhere to be found. In a trailer shared on X, stars from the movie including Michael J Fox, who played Marty McFly, and Christopher Lloyd who played Doc Brown, have appealed to viewers to help try to find the guitar. Lloyd, in the cadence of eccentric inventor Doc Brown, says in the video that the guitar has been \"lost to the future\". \"It's somewhere lost in the space-time continuum,\" says Fox. \"Or it's in some Teamster's garage.\" \n                  President Trump signs travel ban targeting 12 countries with 'hostile attitudes' to the US\n                 \n                  Putin 'very strongly' vowed revenge against Ukraine for drone strike on airbases, Donald Trump says\n                 \n                  Elon Musk calls Donald Trump-backed tax bill a 'disgusting abomination'\n                 Harry Waters Jr, who played Marvin Berry in the film, says the instrument was last seen in 1985. Read more entertainment news:Meghan shares photos of LilibetParks and Rec actor shot dead In the film, McFly steps in for an injured band member at a 1955 school dance before leading the band into a rendition of Johnny B Goode. The time-traveller refers to it is an \"oldie where I come from\" as the 1958 song doesn't yet exist for his audience. The students at the dance fall into an awkward silence as McFly's riffs turn increasingly wild. \"I guess you guys aren't ready for that yet,\" McFly says. \"But your kids are gonna love it.\""
    }
]