[
    {
        "title": "Major incident declared after gas explosion causes house collapse in Nottinghamshire",
        "description": "A major incident has been declared in Nottinghamshire after a gas explosion caused a house to collapse.",
        "url": "https://news.sky.com/story/firefighters-warn-public-to-stay-away-as-they-respond-to-significant-gas-explosion-incident-in-nottinghamshire-13347779",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-worksop-nottinghamshire_6884889.jpg?20250412225023",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-12 19:42:00",
        "Headline": "There is still a \"substantial emergency service presence\" in place after the explosion in John Street, Worksop, just after 7.30pm on Saturday.",
        "Content": " A major incident has been declared in Nottinghamshire after a gas explosion caused a house to collapse. There is still a \"substantial emergency service presence\" in place after the explosion in John Street, Worksop just after 7.30pm on Saturday. Nottinghamshire Fire and Rescue Service (NFRS) declared it a \"major incident\" and said \"multiple houses in and around John Street have been evacuated\". According to Nottinghamshire Police the property was \"partially destroyed\" in the blast, with others also suffering damage. Nearby Crown Place Community Centre has been opened as a \"place of safety\", the service said. Around 20 people have sought refuge there, with many \"frustrated\" at not being able to return to their homes, Sky News camera operator James Evans-Jones said from the scene. Videos posted on social media showed the front of a terraced house blown out with the roof collapsed, while neighbouring houses had their windows damaged. NFRS said in a statement late on Saturday: \"This has now been declared a major incident, and we are likely to be on scene throughout the night and even into Sunday morning.\" \n                  Boy, 16, killed and two injured after car crashes into tree in Nottinghamshire\n                 \n                  Police watchdog reopens probe into Nottingham killer Valdo Calocane\n                 \n                  Two more teenagers arrested after boy, 17, stabbed at Nottingham party\n                 The fire service said it was called to the scene at 7.39pm. Nottinghamshire Police's Chief Inspector Neil Humphris said officers would also remain on the scene \"throughout the night\". \"Multiple properties have been evacuated as we work with our partners to respond to this incident and understand how it happened,\" he added. One person posted on Facebook that they heard \"a terrific bang, like a very loud firework\" as they turned into Gladstone Street from Gateford Road. \"I thought the back end had blown off my car,\" they said. \"A house in John Street has had, presumably, a gas explosion!\" NFRS said it was also called to a separate incident shortly afterwards but does not believe the two are connected. Ten fire engines were sent to the scene of the industrial fire in nearby Holgate Road in The Meadows, Nottingham. \"The building has been severely damaged but there are no reports of any injuries,\" NFRS said. Having been called to the incident at 8.11pm, NFRS said at around 10.30pm that it was scaling its response down with the flames \"now under control\". NFRS's group manager Leigh Holmes said from the scene just after 11pm: \"We will begin to relax the cordon in the next hour as we continue to scale down this incident.\""
    },
    {
        "title": "Asylum system leading people to 'consider taking their own lives', says charity",
        "description": "A leading mental health charity is warning the asylum system is increasing the risk of suicide among asylum seekers and refugees.",
        "url": "https://news.sky.com/story/asylum-system-leading-people-to-consider-taking-their-own-lives-says-charity-13346666",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sami-gichki-asylum-seeker_6884935.jpg?20250413043542",
        "type": "Home",
        "Author": "Amelia Harper",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "Sky News has been told by one man about the devastating impact of waiting for a decade for an asylum decision and that suicidal thoughts left him believing he \"would be better off dead\" than in the asylum system.",
        "Content": "\n          Home news correspondent\n        A leading mental health charity is warning the asylum system is increasing the risk of suicide among asylum seekers and refugees. Content warning: this article contains references to suicide The Mental Health Foundation says the way the asylum system is set up is \"consistently undermining and damaging asylum seekers' mental health\", leading to an increased risk of suicide. The charity's chief executive, Mark Rowland, told Sky News the current system, which prevents people from working for 12 months, is creating an \"emergency situation\". He says people who get supported by his charity report that the asylum system is so traumatic that it's \"leading them to consider taking their own lives\", adding their mental health problems have \"never been worse\". In a fresh call, Mr Rowland is urging the government to start recording suicides among asylum seekers as part of official statistics. He says charities in the sector are struggling to tackle the issue from a public health perspective because of the lack of data. Sami Gichki, now 21, was 10 years old when his family fled political persecution in Pakistan and came to the UK. He came from Balochistan in the southwest of the country and told Sky News that around a dozen of his relatives had been assassinated due to their political beliefs. He spent a decade waiting for a Home Office decision on his refugee status and says he became suicidal due to his inability to work or continue studying without financial support when he finished sixth form. He says it left him without a \"sense of purpose\". He said he ended up in A&E because of his suicidal thoughts, believing he \"would be better off dead\" than in the asylum system. Read more:Plans for overseas 'migrant hubs'What do asylum stats reveal?Asylum deaths while waiting decisions Reflecting on cases like Sami's, Mr Rowland says the situation is creating a \"perfect storm\", where people who have often undergone trauma are subjected to a highly stressful asylum system. The remarks come after statistics published by the National Institute of Economic and Social Research suggest allowing asylum seekers to work after just six months could save £4.4bn in government savings, deliver £1bn in growth and raise £880m in tax revenue. When questioned about whether this would create a greater \"pull factor\" for economic migration, Mr Rowland said, \"this isn't why an asylum seeker chooses a place of safety\". A Home Office spokesperson said: \"We are determined to continue cracking down on anyone working illegally in the UK, and we certainly have no intention of creating a fast-track process so that people who come to the UK outside the established work visa rules are simply allowed to ignore them. \"We take the welfare of those in our care very seriously, but relaxing the rules on illegal working is not an acceptable solution.\" :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Emergency bill to protect British Steel becomes law",
        "description": "An emergency bill to save British Steel's Scunthorpe blast furnaces has become law.",
        "url": "https://news.sky.com/story/emergency-bill-to-protect-british-steel-becomes-law-13347106",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6883046.jpg?20250411153936",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-12 17:00:00",
        "Headline": "Ministers took the unusual step of recalling parliament from its Easter recess to sit on Saturday to pass the legislation. It is the first time this has happened in more than 40 years.",
        "Content": " An emergency bill to save British Steel's Scunthorpe blast furnaces has become law. The urgent legislation gives ministers the power to instruct British Steel to keep the plant open. A government source said late on Saturday that Business Secretary Jonathan Reynolds had already issued instructions to the company - but did not reveal what they were. The bill was rushed through the House of Commons and House of Lords in one day, with MPs and peers being recalled from recess to take part in a Saturday sitting for the first time in over 40 years. Emergency bill becomes law - follow the latest reaction here After passing through both houses of parliament, the Steel Industry (Special Measures) Bill was granted royal assent by the King. The bill gives the government the power to take control of British Steel - or any other steel asset - \"using force if necessary\", order materials for steelmaking and instruct that workers be paid. It also authorises a jail sentence of up to two years for anyone breaching this law. Sir Keir Starmer hailed the legislation for \"turning the page on a decade of decline\", adding \"all options are on the table to secure the future of the industry\".  It will mean the steel plant in Scunthorpe will continue to operate as the government decides on a long-term strategy, and steelmaking in the UK more broadly. Officials from the Department for Business and Trade arrived at the site before the bill had even passed, Sky News understands. Earlier, staff from the plant's ousted Chinese owners Jingye were denied access, with police called over a \"suspected breach of peace\" - though officers found \"no concerns\".  Ministers took the unusual step of recalling parliament from its recess to sit on Saturday after negotiations with Jingye appeared to break down. Business Secretary Jonathan Reynolds said the measures within the bill were \"proportionate and necessary\" to keep the Scunthorpe blast furnaces open and protect both the UK's primary steelmaking capacity and the 3,500 jobs involved. The emergency legislation stops short of full nationalisation of British Steel, but Mr Reynolds told MPs that public ownership remained the \"likely option\" for the future. Read more:British Steel employees express fears over plant's futureWhy the hot spring weather is sliding away During the debate, several Conservative MPs, Reform UK's deputy leader Richard Tice and the Liberal Democrats' deputy leader Daisy Cooper all spoke in favour of nationalisation. MPs had broken up for the Easter holidays on Tuesday and had not been due to return until Tuesday 22 April. The business secretary accused Jingye of failing to negotiate \"in good faith\" after it decided to stop buying enough raw materials to keep the blast furnaces at Scunthorpe going. But the Conservatives said the government should have acted sooner, with shadow leader of the house Alex Burghart accusing ministers of making \"a total pig's breakfast\" of the situation regarding British Steel. The government was also criticised for acting to save the Scunthorpe plant but not taking the same action when the Tata Steel works in Port Talbot were threatened with closure."
    },
    {
        "title": "A sticking plaster, not a solution: What next for British Steel?",
        "description": "Sir Keir Starmer was flying the flag for domestic steel production on Saturday as his government passed emergency legislation to give itself extraordinary powers to intervene in the running of the steel works in Scunthorpe and elsewhere. ",
        "url": "https://news.sky.com/story/a-sticking-plaster-not-a-solution-what-next-for-british-steel-13347691",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-british-steel-workers_6884936.jpg?20250413044144",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-04-12 18:31:00",
        "Headline": "Keeping the blast furnaces in Scunthorpe alive is far from a foregone conclusion with difficult times to come.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Sir Keir Starmer was flying the flag for domestic steel production on Saturday as his government passed emergency legislation to give itself extraordinary powers to intervene in the running of the steel works in Scunthorpe and elsewhere.  He wants voters to notice that his intervention-friendly government has stepped in to save virgin steel production which was days away from dying out for good because of what ministers call the bad faith behaviour of Chinese owners. The politics and optics of Saturday's intervention seem relatively simple. What happens next, however, is not. Follow live updates: Emergency law to keep British steel plant open  Even before the emergency bill had made its way through parliament, officials had turned up at British Steel in Scunthorpe. There's a nervousness about what happens next. As one person close to the talks told me, keeping the blast furnaces alive is far from a foregone conclusion and there are difficult times to come. \n                  Why isn't Keir Starmer saying what he really thinks?\n                 \n                  Starmer to announce more support for businesses as Trump tariffs take hold\n                 \n                  Sir Keir Starmer pledges to protect UK companies from Trump tariff 'storm'\n                  \"We're in for a very hard few days and week while government and UK management secure and ensure the vital loads of raw materials needed,\" said a source. \"You can't just do next day delivery on Amazon. Until this is in the blast furnaces keeping them going this won't be a job done.\" It stands to reason the government will pull out all the stops and the furnace for now will be kept alive, whatever the cost, because the political cost of failure at this point is too high. Future not secure  But the medium term prospects for virgin British steel are far from secure. The blast furnaces being saved only have a few years life at best - but it remains unclear who will fund a transition to the new-style electric blast furnaces. Jonathan Reynolds, the business secretary, said: \"The action I seek to take today is not a magic wand or a panacea. \"The state cannot fund the long term transformation of British Steel itself, nor would it want to do so.\" Nor would he say that steel production is an overriding national security issue, effectively guaranteeing future production. The wiggle room will be noted in Scunthorpe and beyond. The government has provided a sticking plaster not a solution. But this is about so much more than what's going on in Lincolnshire, this is about Britain's place in the world - and its resilience. Is dependence on China inevitable? Can our domestic steel industry survive if Trump continues to impose 25% tariffs on steel going from the UK to the US? Can we make our own weapons for years to come - as part of Mr Starmer's newfound commitment to spend 3% of GDP on defence - without British steel? Is the eventual dependence on Chinese steel an inevitability? Yet one of the fascinating features of Saturday's debate was the most strident attack on a Chinese entity by a minister - the toughest assault since Mr Starmer's government entered office. Mr Reynolds said: \"Over the last few days, it became clear that the intention of Jingye was to refuse to purchase sufficient raw materials to keep the blast furnaces running. \"In fact, their intention was to cancel and refuse to pay for existing orders. The company would therefore have irrevocably and unilaterally closed down primary steelmaking at British Steel. \"Their intention has been to keep the downstream mills, which colleagues will know are fundamental to our construction steel industry, and supply them from China rather than from Scunthorpe.\" This attack - at a time when ministers (most recently Ed Miliband) have been heading to Beijing to repair relations. However, the accusation that a Chinese entity has been acting in bad faith in order to effectively scupper domestic steel production is a serious charge. It also comes before we find out whether Donald Trump is going to make it harder for allies to trade with China. The government has succeeded in protecting the domestic manufacturer of virgin steel for the short term. But what happens in the long term, and where we might get it from, remains as murky today as it did before."
    },
    {
        "title": "Money and grotesque flattery: The art of doing a deal with Donald Trump is to make sure there is an 'upside' for him",
        "description": "Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure.",
        "url": "https://news.sky.com/story/money-and-grotesque-flattery-the-art-of-doing-a-deal-with-donald-trump-is-to-make-sure-there-is-an-upside-for-him-13346421",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-tariffs_6882867.png?20250413044437",
        "type": "Home",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "After destabilising the whole US economy and starting a trade war against China, just how good a deal-maker is Donald Trump?",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure. This in turn, led to him playing the boss in the TV show The Apprentice, and that became his calling card to becoming the president of the United States twice. That, at least, is the view of men who bitterly regret giving Trump his leg-ups to the top. Tony Schwartz, the author who actually wrote The Art Of The Deal, now says it should have been called 'The Sociopath'. After his Non Disclosure Agreement expired, Bill Pruitt, a producer on the first season of The Apprentice, when it was called Meet The Billionaire, confessed \"he was not, by any stretch, a successful New York real estate tycoon like we made him out to be\". John Miller, the chief marketing officer for NBC who was in charge of crafting Trump's TV image, admits \"we created a monster\". He says Trump had a string of failures and bankruptcies behind him, but \"people thought he would be a good president because I made him seem like a legitimate businessman\". Nobody can take Trump's electoral successes away from him. He has been elected president of the United States twice, most recently with a majority of the popular vote. Questions remain about the quality of his deal-making after the economic damage done around the world by his tariff plans, followed rapidly by his partial climbdown from them. He is good at playing the big man for the cameras, but just how good a deal-maker is Donald Trump? \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 And knowing what they know after the past 10 days, how should the 75 nations who Trump says are queuing up \"to kiss my ass\" negotiate with him? Trump's decision not to implement the big \"reciprocal\" tariffs he had announced against countries around the world brought relief. His closest advisors fanned out to insist that the rollercoaster ride he forced on the markets was all part of a cunning plan. The president had always planned to go into reverse, they claimed, even though he had repeatedly said he would not in the days following his big tariff reveal in the White House Rose Garden. Trump's tariff climbdown, posted on his Truth Social platform, was one in the eye for the US trade secretary Howard Lubnick, who had being telling the world \"there is no postponing, they are definitely going to stay in place for days and weeks\". Peter Navarro, the \"brains\" behind the tariff strategy, also had to eat his words but then he is a \"moron\" and \"dumber than a sack of bricks\", according to Elon Musk. Navarro laid down the law in The Financial Times hours after the original announcements. \"This is not a negotiation,\" he wrote then.  After Trump's retreat, he went on TV to bluster: \"This is one of the greatest days in American economic history we have had. I think we're going to call it the 'art of the reciprocal trade deal'. I'll tell ya, all the nervous Nellies on Wall Street who try to undermine us consistently underestimate the power of the president to negotiate.\" Flanked by an uneasy-looking treasury secretary Scott Bessent, Karoline Leavitt, the White House spokesperson, chided, \"many of you in the media clearly missed The Art Of The Deal\". She claimed the president's ploys had isolated China and left the rest of the world looking for deals with the US, \"and they need this president in the Oval Office to talk to them\". Leavitt seemed to be reaching for one of the tactics outlined in The Art Of The Deal - go over the top and ask for too much, so that when you negotiate down, you are still the winner. By this logic, really big tariffs against individual major exporters to the US have been shelved, but the across-the-board 10% tariff has been left in place. This structural shift is vital to true believers in Trump's plan to make Americans pay tax through what they buy rather than their earnings. The trouble is that Trump blinked first and seemed to suggest that tariff threats were only a means to the end of a new ideal of \"free trade\". Just as with his Ukraine plans, he made concessions in advance to the people he is negotiating against - President Putin in the case of his \"peace plan\" - without getting anything in return. The markets, especially government bond markets, have shown that this president does not have the muscle to impose his will regardless. The trading partners queuing for talks may be prepared to flatter, but they will be looking to negotiate down from the lower baseline he has conceded. For example, the UK and the European Union will be looking for lower tariffs against their cars, steel and iron, which the US needs and which the US rustbelt will be unable to replace any time soon. Trump and his supporters are now trying to save face by suggesting that his moves have all really been about confronting China. At the time of writing, tariffs against the US's only real match in terms of trade and military power have now reached an incredible 145%. The People's Republic of China (PRC) has reciprocated but kept well below the American level. Having been threatened by the US, the rest of the world is unlikely to join America in a trade war against China. It is not their problem. Trump has shown that nearby countries such as Vietnam have nothing to gain from him. Instead, he has handed China the chance to pose as the upholder of international trade rules, in spite of its oppressive and antidemocratic policies. Read more:Americans react to Trump tariffsWhat does Starmer really think? China has cut back its trade dependency on the US considerably in recent years, and its government is not accountable to voters. Donald Trump may find that the US does not have the leverage against China that it thinks it does. Ultimately, Trump is after a one-on-one big men meeting with President Xi. The danger must be that in order to pose as a deal-maker, he once again makes concessions he should not, such as selling out Taiwan. The supine, Republican-dominated US Congress has chosen not to contest Trump's unrestrained exercise of executive power, however delusional and incompetent it may be. He was only forced to reverse his main tariff moves because of market forces beyond his control. He had destabilised the whole US economy. Lots of his rich allies were losing money themselves. They will have made most of it back in the temporary stock market surge. 👉 Follow Trump 100 on your podcast app 👈  Democrats are now demanding an inquiry into possible insider trading by Trump and his associates - although they are unlikely to get very far in Trump's America. That perhaps is the key to doing a deal with Donald Trump - as the British government appear to have concluded. Normal rules of statecraft or probity do not apply. He does not care about the important matters at stake or even understand them. They are peripheral to the deal he wants to make. The art is to make sure there is an \"upside\" for him personally in any deal. Money and grotesque flattery are both acceptable forms of tribute to this president."
    },
    {
        "title": "Low-level drinkers have increased cancer and cardiovascular risk, study finds",
        "description": "Low-level drinking can increase your chances of cancer and cardiovascular disease, according to a new study.",
        "url": "https://news.sky.com/story/low-level-drinkers-have-increased-cancer-and-cardiovascular-risk-study-finds-13347134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-alcohol-pub_6883358.jpg?20250412143657",
        "type": "Home",
        "Author": "Alice Porter",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "The charity Alcohol Change UK is calling on the government to introduce health risk labelling on alcohol.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  Low-level drinking can increase your chances of cancer and cardiovascular disease, according to a new study. Research conducted by the Behavioural Insights Team, on behalf of the charity Alcohol Change UK, examined the drinking habits of more than 4,000 UK adults. It found that people who consumed alcohol within the NHS guidelines had worse health than non-drinkers. Compared to people who never consumed alcohol, rates of cardiovascular disease increased from 1% to 5%, for cancer it went from 1% to 4%. The study also found \"low-risk\" drinkers reported reduced sleep quality, worse daily functioning, and poorer dental health, compared to those who have never consumed alcohol. With over 30 million people in the UK drinking at these levels, campaigners are calling for people to rethink their drinking habits. Dr Richard Piper, chief executive of Alcohol Change UK, said: \"For decades, we've fallen prey to a binary but false idea that 'drinking problems' only affect a minority of people with alcohol dependence. \n                  Alcohol-related deaths hit record high\n                 \n                  Bargain Booze owner turns to CVA after impasse with landlords\n                 \n                  Motorists want tougher sentences and instant roadside bans for drink-driving, says RAC\n                 \"But as this research makes clear, alcohol is taking a toll on our health and wellbeing right across the drinking spectrum, even at 'low-risk' levels.\" The NHS recommends that people should not consume more than six pints of medium-strength beer or 10 small glasses of lower-strength wine a week, but scientists warn that it is the way some people consume those volumes of alcohol which can be problematic for their health. Professor David Nutt, a former government chief drugs adviser, said some view 14 units a week as a target and others binge drink. \"There are people who think, 'I've got 14 units, I can have seven drinks on a Friday, seven on a Saturday, that's okay'. \"We know that drinking the maximum allowance in one or two goes is very dangerous. That is where the data becomes quite complicated because some of the harms are undoubtedly magnified by binge drinking within that low-risk weekly level.\" Nathan Eades, 37, runs two high-end pubs in Cheltenham and used to regularly drink large quantities of alcohol but has recently changed his habits. \"Being able to cut out alcohol from having five, six pints at the end of a shift to maybe one vodka soda, two vodka sodas a week has really helped benefit us as a business and me as a person,\" he said. \"After you have probably had one too many, how do your family take it? How are your co-workers interacting with you? How are they feeling with your mood swings, brain fog and irrationality? That is the area which we all need to be a bit more mindful of.\" Alcohol Change UK is calling on the government to introduce health risk labelling on alcohol as well as marketing restrictions so that people have more information about the alcohol they are consuming and are not so regularly being encouraged to buy drinks. A Department of Health and Social Care spokesperson said: \"We recognise the need for urgent action to reverse the unacceptable levels of alcohol harm and deaths. \"As part of our Plan for Change, we are shifting our focus from sickness to prevention, prioritising early intervention and health measures to support people to live longer, healthier lives across the UK.\""
    },
    {
        "title": "Why the King and Queen's Italy tour has been seen as a great triumph",
        "description": "I'm not sure their police officers felt the same from the looks on their faces, but the King and Queen, we're told, were on a \"huge high\" after making their way through the scrum of entourage, security and locals while on walkabout in Ravenna.",
        "url": "https://news.sky.com/story/queen-says-king-wants-to-do-more-and-more-and-more-despite-health-worries-13347362",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-king-charles-emilia-romagna_6881874.jpg?20250410152819",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-04-12 15:40:00",
        "Headline": "The royals, who are both in their mid-70s, show no signs of slowing down after four-day Italy trip. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  I'm not sure their police officers felt the same from the looks on their faces, but the King and Queen, we're told, were on a \"huge high\" after making their way through the scrum of entourage, security and locals while on walkabout in Ravenna. It's no wonder then that just a few days earlier, while visiting a school in Rome, Camilla told members of the British press that we should \"dream on\" if we thought the King's health worries were going to slow him down. \"He loves his work and it keeps him going,\" she said. \"I think it's wonderful, you know, if you've been ill and you are recovering, you're getting better and now he wants to do more and more and more. \"That's the problem… that's what he's driven by. Helping others.\"  It's a sentiment shared by those who work around him. Has anyone told him to take it easy? \"We've all tried!\" was the reply from one senior palace official. Part of the problem though is apparently the amount the King reads. \"Because he reads a lot he learns a lot,\" they added. \"And in this role, as when Prince of Wales, he knows he is fortunate to be in a position to make a difference, and is determined to do just that.\"  You could see it on this four-day visit to Italy. The couple, don't forget both of them are in their mid-70s, nipped around all the key sites in Rome, posing for those obligatory tour photo opportunities, including outside the colosseum. Not 'about tourism' I know the palace weren't happy with headlines such as \"Roman holiday\", or references to them being like tourists. A palace insider remarking these visits are not \"about tourism; there is a very serious business behind them\". That was made abundantly clear in the King's speech to the Italian parliament; the significance undoubtedly heightened, with the trip coming at a time of great economic challenges and great military uncertainty with what's happening in Ukraine. The Royal Family have long been used as part of the post-Brexit charm offensive, the King couldn't have delivered his line any clearer when he stressed that we remain a European country. A senior palace source said, there's \"no accident that it should happen after the visits to France and Germany - and I think we saw from the reaction of the Italian government… with the visit to Ravenna and those huge crowds of enthusiastic Italians\". King could meet Trump this summer They added: \"All of it really showed soft power at its best - something of which the UK can be rightly proud and which delivers huge benefit for UK interests overseas.\" But a more complex meeting with another president could soon lie ahead. Remember that letter delivered by Keir Starmer to Donald Trump from the King, suggesting a more personal meeting as well as a state visit? There are rumours that sometime this summer Mr Trump could meet the King in Scotland. If those rumours are correct, I'd put my bets on either the end of June after Ascot or the beginning of July, or towards the end of August or early September, when the King is up there anyway for his summer holidays. We know that the US president hugely admires the monarch, but you wonder how they might navigate one particularly tricky topic, Canada. The King as their head of state, Mr Trump threatening to make it his 51st state.  Recent meetings between the monarch and Canada's outgoing and newly appointed prime minister's we're told were simply \"normal expressions of support\". More state visits  But a palace insider was keen to emphasise \"showing support for Canada is something he's always done and that he will continue to do\". The palace at the moment won't confirm when a meeting with Trump may take place, only guiding that we will see more inward and outward state visits this year. One thing that is guaranteed when it does happen, Number 10 will be hoping for more of what we've seen this week, the personal touch. That's partly why Italy has been seen as a great triumph, with the crowds calling out not for the King or Queen but for \"Carlo\" and \"Camilla\". \"There is something very powerful about a constitutional monarchy,\" a palace official said. \"Something very powerful about an institution where people have grown up knowing the King. \"They've known him since the day he was born, they've known him his whole life or their whole life, so when they engage with him it's as if they're engaging with someone they feel they genuinely know on a personal level.\" An asset to Number 10 This week's 20th wedding anniversary was a reminder that the King and Queen haven't always been so warmly received. But whatever you think of the royals, there is a skill in what they do. I recently saw the King next to Sir Keir Starmer on a visit to Cornwall, the prime minister holding back as the King made a beeline to make small talk with a crowd of people. As we saw in Italy, he is an asset that Number 10 know they can deploy. Of course there is a caveat at the moment, he is still having cancer treatment. I understand doctors are happy with the King's current workload, and it's said his treatment is going tremendously well. Positive news at a time when the government certainly needs him on top form, with an American president still to charm."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250412041152",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": " It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Monday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in West Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    },
    {
        "title": "Number of dead in Dominican Republic nightclub roof collapse disaster rises to 225 ",
        "description": "The number of people who have died after a nightclub roof collapsed in the capital of the Dominican Republic has risen to 225.",
        "url": "https://news.sky.com/story/number-of-dead-in-dominican-republic-nightclub-roof-collapse-disaster-rises-to-225-13347766",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dominican-republic_6880559.jpg?20250409073750",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "Politicians, athletes and a fashion designer were among those enjoying live music before the disaster in Santo Domingo on Tuesday.",
        "Content": "The number of people who have died after a nightclub roof collapsed in the capital of the Dominican Republic has risen to 225. Officials said 189 people were rescued alive from the rubble of the Jet Set club in Santo Domingo after the disaster on Tuesday, with 15 still in hospital, including five in a critical condition. Four people died overnight, raising the total number who have died to 225 by Saturday and health authorities said all of their bodies have been returned to their families. Politicians, athletes and a fashion designer were among those enjoying live music when the roof collapsed during a merengue concert. President Luis Abinader and his wife Raquel Arbaje attended the burial of the singer Rubby Perez in the city's National Theatre on Thursday. Other victims identified so far include former Major League Baseball (MLB) players Octavio Dotel and Tony Enrique Blanco Cabrera. Nelsy Cruz, the governor of the northwestern province of Montecristi, whose brother is seven-time MLB All-Star Nelson Cruz, also died. \n                  Parents of US student missing in Dominican Republic 'ask police to declare her dead'\n                 \n                  Hurricane Beryl: Monstrous' storm heads towards Jamaica after six killed\n                 \n                  Hurricane Beryl: At least four dead as 'monstrous' storm heads towards Jamaica\n                 Health minister Victor Attalah told journalists on Saturday there was a delay in identifying victims because the majority of them had to be matched using biometric data. Read more from Sky News:Smartphones and laptops excluded from Trump tariffsWhy is hot spring weather sliding away? Officials have said it is too soon to determine why the roof fell, although prosecutors visited the scene on Thursday after rescue crews began packing up and removed heavy equipment. Perez was on stage at the packed club when dust began falling from the ceiling early on Tuesday and seconds later the roof caved in. Mourners dressed in black and white attended his funeral with some in tears as a recording of him singing the national anthem played."
    },
    {
        "title": "Major incident declared after gas explosion causes house collapse in Nottinghamshire",
        "description": "A major incident has been declared in Nottinghamshire after a gas explosion caused a house to collapse.",
        "url": "https://news.sky.com/story/firefighters-warn-public-to-stay-away-as-they-respond-to-significant-gas-explosion-incident-in-nottinghamshire-13347779",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-worksop-nottinghamshire_6884889.jpg?20250412225023",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-12 19:42:00",
        "Headline": "There is still a \"substantial emergency service presence\" in place after the explosion in John Street, Worksop, just after 7.30pm on Saturday.",
        "Content": " A major incident has been declared in Nottinghamshire after a gas explosion caused a house to collapse. There is still a \"substantial emergency service presence\" in place after the explosion in John Street, Worksop just after 7.30pm on Saturday. Nottinghamshire Fire and Rescue Service (NFRS) declared it a \"major incident\" and said \"multiple houses in and around John Street have been evacuated\". According to Nottinghamshire Police the property was \"partially destroyed\" in the blast, with others also suffering damage. Nearby Crown Place Community Centre has been opened as a \"place of safety\", the service said. Around 20 people have sought refuge there, with many \"frustrated\" at not being able to return to their homes, Sky News camera operator James Evans-Jones said from the scene. Videos posted on social media showed the front of a terraced house blown out with the roof collapsed, while neighbouring houses had their windows damaged. NFRS said in a statement late on Saturday: \"This has now been declared a major incident, and we are likely to be on scene throughout the night and even into Sunday morning.\" \n                  Boy, 16, killed and two injured after car crashes into tree in Nottinghamshire\n                 \n                  Police watchdog reopens probe into Nottingham killer Valdo Calocane\n                 \n                  Two more teenagers arrested after boy, 17, stabbed at Nottingham party\n                 The fire service said it was called to the scene at 7.39pm. Nottinghamshire Police's Chief Inspector Neil Humphris said officers would also remain on the scene \"throughout the night\". \"Multiple properties have been evacuated as we work with our partners to respond to this incident and understand how it happened,\" he added. One person posted on Facebook that they heard \"a terrific bang, like a very loud firework\" as they turned into Gladstone Street from Gateford Road. \"I thought the back end had blown off my car,\" they said. \"A house in John Street has had, presumably, a gas explosion!\" NFRS said it was also called to a separate incident shortly afterwards but does not believe the two are connected. Ten fire engines were sent to the scene of the industrial fire in nearby Holgate Road in The Meadows, Nottingham. \"The building has been severely damaged but there are no reports of any injuries,\" NFRS said. Having been called to the incident at 8.11pm, NFRS said at around 10.30pm that it was scaling its response down with the flames \"now under control\". NFRS's group manager Leigh Holmes said from the scene just after 11pm: \"We will begin to relax the cordon in the next hour as we continue to scale down this incident.\""
    },
    {
        "title": "Emergency bill to protect British Steel becomes law",
        "description": "An emergency bill to save British Steel's Scunthorpe blast furnaces has become law.",
        "url": "https://news.sky.com/story/emergency-bill-to-protect-british-steel-becomes-law-13347106",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6883046.jpg?20250411153936",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-12 17:00:00",
        "Headline": "Ministers took the unusual step of recalling parliament from its Easter recess to sit on Saturday to pass the legislation. It is the first time this has happened in more than 40 years.",
        "Content": " An emergency bill to save British Steel's Scunthorpe blast furnaces has become law. The urgent legislation gives ministers the power to instruct British Steel to keep the plant open. A government source said late on Saturday that Business Secretary Jonathan Reynolds had already issued instructions to the company - but did not reveal what they were. The bill was rushed through the House of Commons and House of Lords in one day, with MPs and peers being recalled from recess to take part in a Saturday sitting for the first time in over 40 years. Emergency bill becomes law - follow the latest reaction here After passing through both houses of parliament, the Steel Industry (Special Measures) Bill was granted royal assent by the King. The bill gives the government the power to take control of British Steel - or any other steel asset - \"using force if necessary\", order materials for steelmaking and instruct that workers be paid. It also authorises a jail sentence of up to two years for anyone breaching this law. Sir Keir Starmer hailed the legislation for \"turning the page on a decade of decline\", adding \"all options are on the table to secure the future of the industry\".  It will mean the steel plant in Scunthorpe will continue to operate as the government decides on a long-term strategy, and steelmaking in the UK more broadly. Officials from the Department for Business and Trade arrived at the site before the bill had even passed, Sky News understands. Earlier, staff from the plant's ousted Chinese owners Jingye were denied access, with police called over a \"suspected breach of peace\" - though officers found \"no concerns\".  Ministers took the unusual step of recalling parliament from its recess to sit on Saturday after negotiations with Jingye appeared to break down. Business Secretary Jonathan Reynolds said the measures within the bill were \"proportionate and necessary\" to keep the Scunthorpe blast furnaces open and protect both the UK's primary steelmaking capacity and the 3,500 jobs involved. The emergency legislation stops short of full nationalisation of British Steel, but Mr Reynolds told MPs that public ownership remained the \"likely option\" for the future. Read more:British Steel employees express fears over plant's futureWhy the hot spring weather is sliding away During the debate, several Conservative MPs, Reform UK's deputy leader Richard Tice and the Liberal Democrats' deputy leader Daisy Cooper all spoke in favour of nationalisation. MPs had broken up for the Easter holidays on Tuesday and had not been due to return until Tuesday 22 April. The business secretary accused Jingye of failing to negotiate \"in good faith\" after it decided to stop buying enough raw materials to keep the blast furnaces at Scunthorpe going. But the Conservatives said the government should have acted sooner, with shadow leader of the house Alex Burghart accusing ministers of making \"a total pig's breakfast\" of the situation regarding British Steel. The government was also criticised for acting to save the Scunthorpe plant but not taking the same action when the Tata Steel works in Port Talbot were threatened with closure."
    },
    {
        "title": "A sticking plaster, not a solution: What next for British Steel?",
        "description": "Sir Keir Starmer was flying the flag for domestic steel production on Saturday as his government passed emergency legislation to give itself extraordinary powers to intervene in the running of the steel works in Scunthorpe and elsewhere. ",
        "url": "https://news.sky.com/story/a-sticking-plaster-not-a-solution-what-next-for-british-steel-13347691",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-british-steel-workers_6884936.jpg?20250413044144",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-04-12 18:31:00",
        "Headline": "Keeping the blast furnaces in Scunthorpe alive is far from a foregone conclusion with difficult times to come.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Sir Keir Starmer was flying the flag for domestic steel production on Saturday as his government passed emergency legislation to give itself extraordinary powers to intervene in the running of the steel works in Scunthorpe and elsewhere.  He wants voters to notice that his intervention-friendly government has stepped in to save virgin steel production which was days away from dying out for good because of what ministers call the bad faith behaviour of Chinese owners. The politics and optics of Saturday's intervention seem relatively simple. What happens next, however, is not. Follow live updates: Emergency law to keep British steel plant open  Even before the emergency bill had made its way through parliament, officials had turned up at British Steel in Scunthorpe. There's a nervousness about what happens next. As one person close to the talks told me, keeping the blast furnaces alive is far from a foregone conclusion and there are difficult times to come. \n                  Why isn't Keir Starmer saying what he really thinks?\n                 \n                  Starmer to announce more support for businesses as Trump tariffs take hold\n                 \n                  Sir Keir Starmer pledges to protect UK companies from Trump tariff 'storm'\n                  \"We're in for a very hard few days and week while government and UK management secure and ensure the vital loads of raw materials needed,\" said a source. \"You can't just do next day delivery on Amazon. Until this is in the blast furnaces keeping them going this won't be a job done.\" It stands to reason the government will pull out all the stops and the furnace for now will be kept alive, whatever the cost, because the political cost of failure at this point is too high. Future not secure  But the medium term prospects for virgin British steel are far from secure. The blast furnaces being saved only have a few years life at best - but it remains unclear who will fund a transition to the new-style electric blast furnaces. Jonathan Reynolds, the business secretary, said: \"The action I seek to take today is not a magic wand or a panacea. \"The state cannot fund the long term transformation of British Steel itself, nor would it want to do so.\" Nor would he say that steel production is an overriding national security issue, effectively guaranteeing future production. The wiggle room will be noted in Scunthorpe and beyond. The government has provided a sticking plaster not a solution. But this is about so much more than what's going on in Lincolnshire, this is about Britain's place in the world - and its resilience. Is dependence on China inevitable? Can our domestic steel industry survive if Trump continues to impose 25% tariffs on steel going from the UK to the US? Can we make our own weapons for years to come - as part of Mr Starmer's newfound commitment to spend 3% of GDP on defence - without British steel? Is the eventual dependence on Chinese steel an inevitability? Yet one of the fascinating features of Saturday's debate was the most strident attack on a Chinese entity by a minister - the toughest assault since Mr Starmer's government entered office. Mr Reynolds said: \"Over the last few days, it became clear that the intention of Jingye was to refuse to purchase sufficient raw materials to keep the blast furnaces running. \"In fact, their intention was to cancel and refuse to pay for existing orders. The company would therefore have irrevocably and unilaterally closed down primary steelmaking at British Steel. \"Their intention has been to keep the downstream mills, which colleagues will know are fundamental to our construction steel industry, and supply them from China rather than from Scunthorpe.\" This attack - at a time when ministers (most recently Ed Miliband) have been heading to Beijing to repair relations. However, the accusation that a Chinese entity has been acting in bad faith in order to effectively scupper domestic steel production is a serious charge. It also comes before we find out whether Donald Trump is going to make it harder for allies to trade with China. The government has succeeded in protecting the domestic manufacturer of virgin steel for the short term. But what happens in the long term, and where we might get it from, remains as murky today as it did before."
    },
    {
        "title": "Asylum system leading people to 'consider taking their own lives', says charity",
        "description": "A leading mental health charity is warning the asylum system is increasing the risk of suicide among asylum seekers and refugees.",
        "url": "https://news.sky.com/story/asylum-system-leading-people-to-consider-taking-their-own-lives-says-charity-13346666",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sami-gichki-asylum-seeker_6884935.jpg?20250413043542",
        "type": "UK",
        "Author": "Amelia Harper",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "Sky News has been told by one man about the devastating impact of waiting for a decade for an asylum decision and that suicidal thoughts left him believing he \"would be better off dead\" than in the asylum system.",
        "Content": "\n          Home news correspondent\n        A leading mental health charity is warning the asylum system is increasing the risk of suicide among asylum seekers and refugees. Content warning: this article contains references to suicide The Mental Health Foundation says the way the asylum system is set up is \"consistently undermining and damaging asylum seekers' mental health\", leading to an increased risk of suicide. The charity's chief executive, Mark Rowland, told Sky News the current system, which prevents people from working for 12 months, is creating an \"emergency situation\". He says people who get supported by his charity report that the asylum system is so traumatic that it's \"leading them to consider taking their own lives\", adding their mental health problems have \"never been worse\". In a fresh call, Mr Rowland is urging the government to start recording suicides among asylum seekers as part of official statistics. He says charities in the sector are struggling to tackle the issue from a public health perspective because of the lack of data. Sami Gichki, now 21, was 10 years old when his family fled political persecution in Pakistan and came to the UK. He came from Balochistan in the southwest of the country and told Sky News that around a dozen of his relatives had been assassinated due to their political beliefs. He spent a decade waiting for a Home Office decision on his refugee status and says he became suicidal due to his inability to work or continue studying without financial support when he finished sixth form. He says it left him without a \"sense of purpose\". He said he ended up in A&E because of his suicidal thoughts, believing he \"would be better off dead\" than in the asylum system. Read more:Plans for overseas 'migrant hubs'What do asylum stats reveal?Asylum deaths while waiting decisions Reflecting on cases like Sami's, Mr Rowland says the situation is creating a \"perfect storm\", where people who have often undergone trauma are subjected to a highly stressful asylum system. The remarks come after statistics published by the National Institute of Economic and Social Research suggest allowing asylum seekers to work after just six months could save £4.4bn in government savings, deliver £1bn in growth and raise £880m in tax revenue. When questioned about whether this would create a greater \"pull factor\" for economic migration, Mr Rowland said, \"this isn't why an asylum seeker chooses a place of safety\". A Home Office spokesperson said: \"We are determined to continue cracking down on anyone working illegally in the UK, and we certainly have no intention of creating a fast-track process so that people who come to the UK outside the established work visa rules are simply allowed to ignore them. \"We take the welfare of those in our care very seriously, but relaxing the rules on illegal working is not an acceptable solution.\" :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Low-level drinkers have increased cancer and cardiovascular risk, study finds",
        "description": "Low-level drinking can increase your chances of cancer and cardiovascular disease, according to a new study.",
        "url": "https://news.sky.com/story/low-level-drinkers-have-increased-cancer-and-cardiovascular-risk-study-finds-13347134",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-alcohol-pub_6883358.jpg?20250412143657",
        "type": "UK",
        "Author": "Alice Porter",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "The charity Alcohol Change UK is calling on the government to introduce health risk labelling on alcohol.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  Low-level drinking can increase your chances of cancer and cardiovascular disease, according to a new study. Research conducted by the Behavioural Insights Team, on behalf of the charity Alcohol Change UK, examined the drinking habits of more than 4,000 UK adults. It found that people who consumed alcohol within the NHS guidelines had worse health than non-drinkers. Compared to people who never consumed alcohol, rates of cardiovascular disease increased from 1% to 5%, for cancer it went from 1% to 4%. The study also found \"low-risk\" drinkers reported reduced sleep quality, worse daily functioning, and poorer dental health, compared to those who have never consumed alcohol. With over 30 million people in the UK drinking at these levels, campaigners are calling for people to rethink their drinking habits. Dr Richard Piper, chief executive of Alcohol Change UK, said: \"For decades, we've fallen prey to a binary but false idea that 'drinking problems' only affect a minority of people with alcohol dependence. \n                  Alcohol-related deaths hit record high\n                 \n                  Bargain Booze owner turns to CVA after impasse with landlords\n                 \n                  Motorists want tougher sentences and instant roadside bans for drink-driving, says RAC\n                 \"But as this research makes clear, alcohol is taking a toll on our health and wellbeing right across the drinking spectrum, even at 'low-risk' levels.\" The NHS recommends that people should not consume more than six pints of medium-strength beer or 10 small glasses of lower-strength wine a week, but scientists warn that it is the way some people consume those volumes of alcohol which can be problematic for their health. Professor David Nutt, a former government chief drugs adviser, said some view 14 units a week as a target and others binge drink. \"There are people who think, 'I've got 14 units, I can have seven drinks on a Friday, seven on a Saturday, that's okay'. \"We know that drinking the maximum allowance in one or two goes is very dangerous. That is where the data becomes quite complicated because some of the harms are undoubtedly magnified by binge drinking within that low-risk weekly level.\" Nathan Eades, 37, runs two high-end pubs in Cheltenham and used to regularly drink large quantities of alcohol but has recently changed his habits. \"Being able to cut out alcohol from having five, six pints at the end of a shift to maybe one vodka soda, two vodka sodas a week has really helped benefit us as a business and me as a person,\" he said. \"After you have probably had one too many, how do your family take it? How are your co-workers interacting with you? How are they feeling with your mood swings, brain fog and irrationality? That is the area which we all need to be a bit more mindful of.\" Alcohol Change UK is calling on the government to introduce health risk labelling on alcohol as well as marketing restrictions so that people have more information about the alcohol they are consuming and are not so regularly being encouraged to buy drinks. A Department of Health and Social Care spokesperson said: \"We recognise the need for urgent action to reverse the unacceptable levels of alcohol harm and deaths. \"As part of our Plan for Change, we are shifting our focus from sickness to prevention, prioritising early intervention and health measures to support people to live longer, healthier lives across the UK.\""
    },
    {
        "title": "Why the King and Queen's Italy tour has been seen as a great triumph",
        "description": "I'm not sure their police officers felt the same from the looks on their faces, but the King and Queen, we're told, were on a \"huge high\" after making their way through the scrum of entourage, security and locals while on walkabout in Ravenna.",
        "url": "https://news.sky.com/story/queen-says-king-wants-to-do-more-and-more-and-more-despite-health-worries-13347362",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-king-charles-emilia-romagna_6881874.jpg?20250410152819",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-04-12 15:40:00",
        "Headline": "The royals, who are both in their mid-70s, show no signs of slowing down after four-day Italy trip. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  I'm not sure their police officers felt the same from the looks on their faces, but the King and Queen, we're told, were on a \"huge high\" after making their way through the scrum of entourage, security and locals while on walkabout in Ravenna. It's no wonder then that just a few days earlier, while visiting a school in Rome, Camilla told members of the British press that we should \"dream on\" if we thought the King's health worries were going to slow him down. \"He loves his work and it keeps him going,\" she said. \"I think it's wonderful, you know, if you've been ill and you are recovering, you're getting better and now he wants to do more and more and more. \"That's the problem… that's what he's driven by. Helping others.\"  It's a sentiment shared by those who work around him. Has anyone told him to take it easy? \"We've all tried!\" was the reply from one senior palace official. Part of the problem though is apparently the amount the King reads. \"Because he reads a lot he learns a lot,\" they added. \"And in this role, as when Prince of Wales, he knows he is fortunate to be in a position to make a difference, and is determined to do just that.\"  You could see it on this four-day visit to Italy. The couple, don't forget both of them are in their mid-70s, nipped around all the key sites in Rome, posing for those obligatory tour photo opportunities, including outside the colosseum. Not 'about tourism' I know the palace weren't happy with headlines such as \"Roman holiday\", or references to them being like tourists. A palace insider remarking these visits are not \"about tourism; there is a very serious business behind them\". That was made abundantly clear in the King's speech to the Italian parliament; the significance undoubtedly heightened, with the trip coming at a time of great economic challenges and great military uncertainty with what's happening in Ukraine. The Royal Family have long been used as part of the post-Brexit charm offensive, the King couldn't have delivered his line any clearer when he stressed that we remain a European country. A senior palace source said, there's \"no accident that it should happen after the visits to France and Germany - and I think we saw from the reaction of the Italian government… with the visit to Ravenna and those huge crowds of enthusiastic Italians\". King could meet Trump this summer They added: \"All of it really showed soft power at its best - something of which the UK can be rightly proud and which delivers huge benefit for UK interests overseas.\" But a more complex meeting with another president could soon lie ahead. Remember that letter delivered by Keir Starmer to Donald Trump from the King, suggesting a more personal meeting as well as a state visit? There are rumours that sometime this summer Mr Trump could meet the King in Scotland. If those rumours are correct, I'd put my bets on either the end of June after Ascot or the beginning of July, or towards the end of August or early September, when the King is up there anyway for his summer holidays. We know that the US president hugely admires the monarch, but you wonder how they might navigate one particularly tricky topic, Canada. The King as their head of state, Mr Trump threatening to make it his 51st state.  Recent meetings between the monarch and Canada's outgoing and newly appointed prime minister's we're told were simply \"normal expressions of support\". More state visits  But a palace insider was keen to emphasise \"showing support for Canada is something he's always done and that he will continue to do\". The palace at the moment won't confirm when a meeting with Trump may take place, only guiding that we will see more inward and outward state visits this year. One thing that is guaranteed when it does happen, Number 10 will be hoping for more of what we've seen this week, the personal touch. That's partly why Italy has been seen as a great triumph, with the crowds calling out not for the King or Queen but for \"Carlo\" and \"Camilla\". \"There is something very powerful about a constitutional monarchy,\" a palace official said. \"Something very powerful about an institution where people have grown up knowing the King. \"They've known him since the day he was born, they've known him his whole life or their whole life, so when they engage with him it's as if they're engaging with someone they feel they genuinely know on a personal level.\" An asset to Number 10 This week's 20th wedding anniversary was a reminder that the King and Queen haven't always been so warmly received. But whatever you think of the royals, there is a skill in what they do. I recently saw the King next to Sir Keir Starmer on a visit to Cornwall, the prime minister holding back as the King made a beeline to make small talk with a crowd of people. As we saw in Italy, he is an asset that Number 10 know they can deploy. Of course there is a caveat at the moment, he is still having cancer treatment. I understand doctors are happy with the King's current workload, and it's said his treatment is going tremendously well. Positive news at a time when the government certainly needs him on top form, with an American president still to charm."
    },
    {
        "title": "Counter terror police investigating after brother of Manchester Arena bomber attacks prison officers",
        "description": "Counter terrorism police are leading the investigation into an attack on three prison officers by the brother of the Manchester Arena bomber. ",
        "url": "https://news.sky.com/story/brother-of-manchester-arena-bomber-attacks-prison-officers-union-says-13347487",
        "image_url": "https://e3.365dm.com/20/12/1920x1080/skynews-hashem-abedi-greater-manchester-police_5198655.jpg?20201207142316",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-12 16:25:00",
        "Headline": "Hashem Abedi was jailed for at least 55 years after helping to plan the 2017 atrocity in which 22 people died.",
        "Content": "Counter terrorism police are leading the investigation into an attack on three prison officers by the brother of the Manchester Arena bomber.  The Prison Officers Association (POA) said 28-year-old Hashem Abedi - the brother of Salman Abedi - threw hot cooking oil over the guards before stabbing them with homemade weapons. He was sentenced in 2020 to at least 55 years in prison after being found guilty of 22 counts of murder over the 2017 atrocity. The three officers were taken to hospital after the attack at category A Frankland prison, in County Durham, shortly before 11am on Saturday. The POA said they suffered \"life-threatening injuries\" including burns, scalds and stab wounds. A female officer is understood to have now been discharged. Counter Terrorism Policing's (CTP) acting senior national coordinator, Commander Dom Murphy, said his officers will lead the investigation \"given the nature of the incident\". Justice Secretary Shabana Mahmood said on X: \"I am appalled by the attack of three brave officers at HMP Frankland today. My thoughts are with them and their families. \"The police are now investigating. I will be pushing for the strongest possible punishment. Violence against our staff will never be tolerated.\" The POA said the attack happened in a separation centre, a small unit sometimes referred to as a \"prison within a prison\", usually used to house dangerous prisoners and those deemed a risk of radicalising other inmates. The union's national chair Mark Fairhurst called for a review of the freedoms granted to those prisoners. \"I am of the opinion that allowing access to cooking facilities and items that can threaten the lives of staff should be removed immediately,\" he said. \"These prisoners need only receive their basic entitlements and we should concentrate on control and containment instead of attempting to appease them. Things have to change.\" General secretary Steve Gillan added: \"This is a disgraceful and cowardly attack on prison officers at Frankland prison who were carrying out their duties.\" Durham police said: \"An investigation is under way following a serious assault which occurred at Frankland prison, Durham today. \"Three victims were taken to hospital to be treated where two remain with serious injuries and a third has been discharged.\" Read more from Sky News:Newcastle head coach admitted to hospitalSmartphones and laptops excluded from tariffs Hashem Abedi was previously found guilty, along with two other convicted terrorists, of attacking a prison officer at southeast London's Belmarsh prison in 2020. The officer was hit with a chair, repeatedly punched and kicked when he was set upon by Hashem Abedi, Parsons Green Tube bomber Ahmed Hassan and Muhammed Saeed, who spoke about carrying out a knife attack in London. Hashem Abedi was found guilty by a jury of 22 counts of murder, attempted murder and plotting to cause an explosion likely to endanger life over the Manchester Arena bombing. The court heard he helped source, buy, stockpile and transport the components for his brother's bomb using a number of phones, vehicles and addresses in preparation for the attack. Twenty-two people were killed when suicide bomber Salman Abedi detonated an explosive as people were leaving an Ariana Grande concert at the venue. He died in the attack, while hundreds of others were injured."
    },
    {
        "title": "Relief in Scunthorpe after emergency British Steel law passed - but the fight isn't over yet",
        "description": "As football fans filed out of Scunthorpe United's ground, the evening sun was shining down on them.",
        "url": "https://news.sky.com/story/relief-in-scunthorpe-after-emergency-british-steel-law-passed-but-the-fight-isnt-over-yet-13347624",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-lisa-dowd-scunthorpe_6884634.png?20250412191922",
        "type": "UK",
        "Author": "Lisa Dowd",
        "Date Published": "2025-04-12 17:39:00",
        "Headline": "So intertwined is the relationship between British Steel and the city that at half time workers, their families and union officials were allowed to parade banners on Scunthorpe United's pitch.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  As football fans filed out of Scunthorpe United's ground, the evening sun was shining down on them. Their team had just secured a win, and in the stands many British steel workers and their families celebrated - hoping that it would translate to further luck for their jobs. \"Save British Steel\", one man shouted at us as he wound down the window of his car, driving away from the match, gleeful. Politics latest: Emergency bill to keep British Steel plant open becomes law Everyone who lives in Scunthorpe is connected to the British Steel plant in some way. \"It works in partnership - we nearly went out of business as a football club, the steelworks came together, we all worked together- it's one big community\", explained football fan Martin. \"Many generations of my family worked there... without steelworks we wouldn't have a community\". \n                  Major incident declared after gas explosion causes house collapse in Nottinghamshire\n                 \n                  Emergency bill to protect British Steel becomes law\n                 \n                  A sticking plaster, not a solution: What next for British Steel?\n                 So intertwined is the relationship that Scunthorpe United is known as \"The Iron\", and at half time, steelworkers, their families and union officials were allowed to parade \"Save Scunthorpe Steel\" banners around the pitch, to supportive cheers from fans. A march through the town, ending at the football club, had been originally planned to put pressure on the government to intervene. Now that they have, there is a mood of hope. \"We have lots of family members who work at British Steel, I feel uplifted to have some good news today\", one woman told me as she walked through the streets on the march. \"It's a relief\", another man said. \"Six generations of my family have worked at the steelworks- it's the heart of the town.\" But they know the fight to save 3,500 jobs is far from over. Many think that only full nationalisation would secure the future of the plant. Read more from Sky News:Newcastle United head coach admitted to hospital 'due to illness'Teachers in England gearing up for potential strike action What if the plant closed? Kerensa, who was cradling her 10-month-old baby, Ottillie, told me: \"There wouldn't be a town.\" \"It would be devastating, the steelworks would be gone, all the father figures of the family, the community would be gone their jobs would be gone\"."
    },
    {
        "title": "Why the hot spring weather is sliding away - and it's not much better if you're about to holiday in southern Europe",
        "description": "It's been an unusually sunny start to spring, with parts of the UK enjoying temperatures over 20C (68F) over the past few days.",
        "url": "https://news.sky.com/story/why-the-hot-spring-weather-is-sliding-away-and-its-not-much-better-if-youre-about-to-holiday-in-southern-europe-13347136",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-boscombe-beach-dorset_6883954.jpg?20250412145958",
        "type": "UK",
        "Author": "Jo Wheeler, weather presenter",
        "Date Published": "2025-04-12 13:23:00",
        "Headline": "The UK's hot start to April is about to make way for more familiar spring temperatures. But why did it get so hot - and what can we expect moving forward?",
        "Content": "By Jo Wheeler, weather presenter  It's been an unusually sunny start to spring, with parts of the UK enjoying temperatures over 20C (68F) over the past few days. But why has it been so hot - and why is it about to come to an end? Extraordinary highs and lows The recent spell of fine weather was brought to us courtesy of high pressure. But no ordinary high pressure; a blocking high - the result of a stratospheric warming event. Ironically, it's the same weather set up that brought us the Beast from the East in 2018. This time, however, the positioning of the high pressure system brought almost cloudless skies and temperatures well above what we'd expect at this time of year. Check the weather forecast near you A blocking high pressure system, as opposed to ordinary high pressure, is one that sticks around far longer - which explains the days and days of blue skies and sunshine. It's notable though that the nights have been cold. On Thursday night, Aboyne in Scotland reached a daytime high of 22.8C (73F) from an overnight minimum of -3.2C (26.2F) - a lift of 26C night to day. And that wasn't an isolated station - many saw these huge discrepancies between night/day temperatures. That's quite extraordinary. All good things come to an end That high pressure is now sliding away to the near continent, which is opening the door to more unsettled conditions from the Atlantic. Also from the south, with the weather over Spain and Portugal having been shockingly bad. And, that again, is down to our prolonged period of fine weather. High pressure systems will block all incoming weather fronts, which have to go somewhere - either north or south around the high. So, as the beautiful spring of 2025 gives way to something more familiar, unsettled conditions spread up from the south courtesy of low pressure moving up from the Bay of Biscay. At the same time, Atlantic rain spreads in from the west introducing colder air. The two unite tonight and sweep eastward lowering our daytime temperatures by up to 10C in places. It's not all doom and gloom - but Europe's weather will be 'unsettled' That's not to say that we won't have sight of the sun until the height of summer. We'll have some bright and sunny spells, even over the next few days, despite them looking quite unsettled. But we'll also have classic British skies with cloud around to a greater or lesser degree, and temperatures more suited to our usual spring climate. Interestingly, the Azores high, which usually stabilises the southern Europe climate for which we pay expensive air fares, is not yet established. So those planning a holiday to Spain or Portugal don't have the usual reassurance of warm sunshine. Indeed, northern Italy is expecting some heavy rainfall over the next few days. There's also a fair signal that high pressure will return to the UK in the days after the Easter weekend. But as conditions remain mobile, unsettled and transient, accurate long-term forecasting becomes more difficult. Suffice to say, the next few days will be cooler, fresher and more unsettled. With the driest March on record behind us, rain will doubtless be welcome for farmers and gardeners alike."
    },
    {
        "title": "Iran says 'indirect talks' have taken place with US over nuclear programme - with more to follow",
        "description": "Iran says \"indirect talks\" over the country's rapidly advancing nuclear programme have taken place with US officials, with more to come next week.",
        "url": "https://news.sky.com/story/iran-says-indirect-talks-taking-place-with-us-over-nuclear-programme-13347051",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-oman-abbas-araghchi_6883929.jpg?20250412145101",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-12 12:15:00",
        "Headline": "The talks come after US President Donald Trump warned Iran it would be in \"great danger\" if a deal wasn't reached between the two countries.",
        "Content": " Iran says \"indirect talks\" over the country's rapidly advancing nuclear programme have taken place with US officials, with more to come next week. The discussions on Saturday took place in Muscat, Oman, with the host nation's officials mediating between representatives of Iran and the US, who were seated in separate rooms, according to Esmail Baghaei, a spokesperson for Iran's foreign ministry. After the talks concluded, Omani and Iranian officials reported that Iran and the US had agreed to hold more negotiations next week. After the meeting, Oman's foreign minister Sayyid Badr Albusaidi thanked Iran's foreign minister Abbas Araghchi and US Middle East envoy Steve Witkoff for joining the negotiations aimed at \"global peace, security and stability\", in an X post. \"We will continue to work together and put further efforts to assist in arriving at this goal,\" he added. 'Very positive' and 'constructive' Iranian state media claimed the US and Iranian officials \"briefly spoke in the presence of the Omani foreign minister\" at the end of the talks - a claim Mr Araghchi echoed in a statement on Telegram. \n                  US-Iran talks exceeded expectations - but the first round was the easy bit\n                 \n                  Day 79: Trump's tariff turmoil  \n                 \n                  Iran denies 'direct talks' with US over its nuclear programme\n                 He said the talks took place in a \"constructive atmosphere based on mutual respect\" and that they would continue next week. Speaking on board Air Force One on Saturday US President Donald Trump said the \"talks are going okay\". \"I can't tell you because nothing matters until you get it done, so I don't like talking about it, but it's going OK. The Iran situation is going pretty good, I think,\" he told reporters. Earlier the White House claimed the talks in Muscat were \"very positive and constructive,\" and that a further meeting would take place next Saturday. \"These issues are very complicated, and Special Envoy Witkoff's direct communication today was a step forward inachieving a mutually beneficial outcome,\" the White House added. Ahead of the first meeting, Mr Araghchi said there was a \"chance for initial understanding on further negotiations if the other party [US] enters the talks with an equal stance\". He told Iran's state TV: \"Our intention is to reach a fair and honourable agreement - from an equal footing. \"And if the other side has also entered from the same position, God willing, there will be a chance for an initial agreement that can lead to a path of negotiations.\" Reuters news agency said an Omani source told it the talks were focused on de-escalating regional tensions, prisoner exchanges and limited agreements to ease sanctions in exchange for controlling Iran's nuclear programme.  'Great danger' if talks fail Donald Trump has insisted Tehran cannot get nuclear weapons. He said on Monday the talks would be direct, but Tehran officials insisted it would be conducted through an intermediary. Mr Trump also warned Iran would be in \"great danger\" if negotiations fail. \"Hopefully those talks will be successful, it would be in Iran's best interests if they are successful,\" he said. \"We hope that's going to happen.\" He added Iran \"cannot have a nuclear weapon, and if the talks aren't successful, I actually think it will be a very bad day for Iran\". The comments came after Mr Trump's previous warnings of possible military action against Iran if there is no deal over its nuclear programme. Read more:Trump undergoes annual medical check-upPolish president backs Trump over Ukraine Saturday's meeting marked the first between the countries since Mr Trump's second term in the White House began. During his first term, he withdrew the US from a deal between Iran and world powers designed to curb Iran's nuclear work in exchange for sanctions relief. He also reimposed US sanctions. Iran has since far surpassed that deal's limits on uranium enrichment. Tehran insists its nuclear programme is wholly for civilian energy purposes but Western powers accuse it of having a clandestine agenda. Mr Witkoff came from talks with Russian president Vladimir Putin on Friday, as the US tries to broker an end to the war in Ukraine."
    },
    {
        "title": "US-Iran talks exceeded expectations - but the first round was the easy bit",
        "description": "The talks in Muscat lasted only two hours.",
        "url": "https://news.sky.com/story/us-iran-talks-exceeded-expectations-but-the-first-round-was-the-easy-bit-13347733",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-steve-witkoff-muscat_6884749.jpg?20250412232717",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-04-12 19:01:00",
        "Headline": "Iranian and American delegations met on Saturday in Oman for indirect talks at a new nuclear programme agreement. Sources tell Sky News the meeting exceeded expectations, and another meeting could come within a week.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n The talks in Muscat lasted only two hours. The two delegations - Iran and the US - were in separate rooms, with Oman's experienced and respected foreign minister Badr Albusaidi acting as host and go-between. The brevity shouldn't be read as a sign of failure - this should be seen as an opening act, a trust-building exercise where both sides lay out their starting positions and lay the ground for further talks. Read more: Iran says 'indirect US talks' over nuclear programme took place  I'm told by sources close to the meeting that it exceeded expectations, and while no date has been formally agreed for a second round, the expectation is for another meeting soon - maybe in a week's time. In many respects, the talks on Saturday were the easy bit - establish dialogue, build some trust and agree to meet again. Further rounds will be much more complicated and potentially disagreeable. The initially stated positions of the two sides remain incompatible - total nuclear disbandment versus an insistence on retaining a civil nuclear programme. The negotiations, if they are to be successful, will become increasingly detailed, and that will require teams of experts and time. Trump has set a short window to achieve a deal, but if he is committed to getting one, then he will need to be flexible and patient while at the same time alive to delaying tactics by Iran. I expect Oman will continue to play a crucial role, demonstrating that its long-standing policy of talking to all players is a rare commodity in an increasingly polarised world. I would caution that Iran has nothing to lose by talking up the success of this early exchange - it's not in Tehran's interest to collapse the talks at this stage. Read more:Smartphones among items excluded from tariffs, US saysPalestinian student activist can be deported from US, judge rules The Israelis, angry that these talks are even taking place, will be on the phone to the White House warning them that Iran is deliberately stringing it out. President Trump, rarely diplomatic, will no doubt comment soon - his analysis will be most revealing."
    },
    {
        "title": "Smartphones and laptops among items excluded from reciprocal tariffs, US says",
        "description": "Electronics such as smartphones and laptops will be excluded from reciprocal tariffs, the Trump administration has said.",
        "url": "https://news.sky.com/story/smartphones-and-laptops-among-items-excluded-from-reciprocal-tariffs-us-says-13347295",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-china_6884116.jpg?20250412161226",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-12 14:48:00",
        "Headline": "The exemption on laptops and smartphones could help keep prices down as they are mainly produced in countries like Taiwan and China - among the hardest hit by Donald Trump's tariffs.",
        "Content": "Electronics such as smartphones and laptops will be excluded from reciprocal tariffs, the Trump administration has said. US Customs and Border Protection listed 20 product categories in a notice to shippers, including the very broad 8471 code for all computers, laptops, disc drives and automatic data processing. It added that semiconductor devices and equipment, memory chips and flat panel displays would also be exempt. The move could help keep prices down for popular consumer items that are mainly produced in East Asian countries and China, which is the country hardest hit by Donald Trump's tariffs. In a statement to Sky's US partner network NBC News, White House deputy press secretary Kush Desai said: \"President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops. \"That's why the President has secured trillions of dollars in US investments from the largest tech companies in the world, including Apple, TSMC, and Nvidia. \"At the direction of the President, these companies are hustling to onshore their manufacturing in the United States as soon as possible.\"  Tech firms, including Apple, Samsung and Nvidia, have struggled in the stock market since the levies were first announced. Earlier this week, the head of the trading floor at Currencies 4 You told Newspage Mr Trump's tariffs on Chinese imports \"could significantly impact iPhone pricing globally\". Prem Raja said analysts suggested \"US prices might surge by up to 43% if Apple passes on the costs\" to consumers.  The US and China have been locked in an escalating trade dispute since the start of the month, as both countries ratcheted up tariffs on imports. After Mr Trump announced a 34% levy on China on \"Liberation Day\", Beijing responded by introducing tariffs of the same rate on American imports. Read more:Tariff war could be reaching stalemate, but more danger lingersPolish president tells allies 'stay calm' over tariffs The US president then added another 50% tariff atop the 34% and warned China not to retaliate. In turn, Chinese officials called the tariffs \"bullying\" and raised levies again to 84%. Mr Trump then raised levies on most Chinese goods to 145% as he paused tariffs higher than 10% for 90 days, prompting Beijing to raise their US import rates to 125%."
    },
    {
        "title": "Number of dead in Dominican Republic nightclub roof collapse disaster rises to 225 ",
        "description": "The number of people who have died after a nightclub roof collapsed in the capital of the Dominican Republic has risen to 225.",
        "url": "https://news.sky.com/story/number-of-dead-in-dominican-republic-nightclub-roof-collapse-disaster-rises-to-225-13347766",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dominican-republic_6880559.jpg?20250409073750",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "Politicians, athletes and a fashion designer were among those enjoying live music before the disaster in Santo Domingo on Tuesday.",
        "Content": "The number of people who have died after a nightclub roof collapsed in the capital of the Dominican Republic has risen to 225. Officials said 189 people were rescued alive from the rubble of the Jet Set club in Santo Domingo after the disaster on Tuesday, with 15 still in hospital, including five in a critical condition. Four people died overnight, raising the total number who have died to 225 by Saturday and health authorities said all of their bodies have been returned to their families. Politicians, athletes and a fashion designer were among those enjoying live music when the roof collapsed during a merengue concert. President Luis Abinader and his wife Raquel Arbaje attended the burial of the singer Rubby Perez in the city's National Theatre on Thursday. Other victims identified so far include former Major League Baseball (MLB) players Octavio Dotel and Tony Enrique Blanco Cabrera. Nelsy Cruz, the governor of the northwestern province of Montecristi, whose brother is seven-time MLB All-Star Nelson Cruz, also died. \n                  Parents of US student missing in Dominican Republic 'ask police to declare her dead'\n                 \n                  Hurricane Beryl: Monstrous' storm heads towards Jamaica after six killed\n                 \n                  Hurricane Beryl: At least four dead as 'monstrous' storm heads towards Jamaica\n                 Health minister Victor Attalah told journalists on Saturday there was a delay in identifying victims because the majority of them had to be matched using biometric data. Read more from Sky News:Smartphones and laptops excluded from Trump tariffsWhy is hot spring weather sliding away? Officials have said it is too soon to determine why the roof fell, although prosecutors visited the scene on Thursday after rescue crews began packing up and removed heavy equipment. Perez was on stage at the packed club when dust began falling from the ceiling early on Tuesday and seconds later the roof caved in. Mourners dressed in black and white attended his funeral with some in tears as a recording of him singing the national anthem played."
    },
    {
        "title": "Money and grotesque flattery: The art of doing a deal with Donald Trump is to make sure there is an 'upside' for him",
        "description": "Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure.",
        "url": "https://news.sky.com/story/money-and-grotesque-flattery-the-art-of-doing-a-deal-with-donald-trump-is-to-make-sure-there-is-an-upside-for-him-13346421",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-tariffs_6882867.png?20250413044437",
        "type": "World",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "After destabilising the whole US economy and starting a trade war against China, just how good a deal-maker is Donald Trump?",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure. This in turn, led to him playing the boss in the TV show The Apprentice, and that became his calling card to becoming the president of the United States twice. That, at least, is the view of men who bitterly regret giving Trump his leg-ups to the top. Tony Schwartz, the author who actually wrote The Art Of The Deal, now says it should have been called 'The Sociopath'. After his Non Disclosure Agreement expired, Bill Pruitt, a producer on the first season of The Apprentice, when it was called Meet The Billionaire, confessed \"he was not, by any stretch, a successful New York real estate tycoon like we made him out to be\". John Miller, the chief marketing officer for NBC who was in charge of crafting Trump's TV image, admits \"we created a monster\". He says Trump had a string of failures and bankruptcies behind him, but \"people thought he would be a good president because I made him seem like a legitimate businessman\". Nobody can take Trump's electoral successes away from him. He has been elected president of the United States twice, most recently with a majority of the popular vote. Questions remain about the quality of his deal-making after the economic damage done around the world by his tariff plans, followed rapidly by his partial climbdown from them. He is good at playing the big man for the cameras, but just how good a deal-maker is Donald Trump? \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 And knowing what they know after the past 10 days, how should the 75 nations who Trump says are queuing up \"to kiss my ass\" negotiate with him? Trump's decision not to implement the big \"reciprocal\" tariffs he had announced against countries around the world brought relief. His closest advisors fanned out to insist that the rollercoaster ride he forced on the markets was all part of a cunning plan. The president had always planned to go into reverse, they claimed, even though he had repeatedly said he would not in the days following his big tariff reveal in the White House Rose Garden. Trump's tariff climbdown, posted on his Truth Social platform, was one in the eye for the US trade secretary Howard Lubnick, who had being telling the world \"there is no postponing, they are definitely going to stay in place for days and weeks\". Peter Navarro, the \"brains\" behind the tariff strategy, also had to eat his words but then he is a \"moron\" and \"dumber than a sack of bricks\", according to Elon Musk. Navarro laid down the law in The Financial Times hours after the original announcements. \"This is not a negotiation,\" he wrote then.  After Trump's retreat, he went on TV to bluster: \"This is one of the greatest days in American economic history we have had. I think we're going to call it the 'art of the reciprocal trade deal'. I'll tell ya, all the nervous Nellies on Wall Street who try to undermine us consistently underestimate the power of the president to negotiate.\" Flanked by an uneasy-looking treasury secretary Scott Bessent, Karoline Leavitt, the White House spokesperson, chided, \"many of you in the media clearly missed The Art Of The Deal\". She claimed the president's ploys had isolated China and left the rest of the world looking for deals with the US, \"and they need this president in the Oval Office to talk to them\". Leavitt seemed to be reaching for one of the tactics outlined in The Art Of The Deal - go over the top and ask for too much, so that when you negotiate down, you are still the winner. By this logic, really big tariffs against individual major exporters to the US have been shelved, but the across-the-board 10% tariff has been left in place. This structural shift is vital to true believers in Trump's plan to make Americans pay tax through what they buy rather than their earnings. The trouble is that Trump blinked first and seemed to suggest that tariff threats were only a means to the end of a new ideal of \"free trade\". Just as with his Ukraine plans, he made concessions in advance to the people he is negotiating against - President Putin in the case of his \"peace plan\" - without getting anything in return. The markets, especially government bond markets, have shown that this president does not have the muscle to impose his will regardless. The trading partners queuing for talks may be prepared to flatter, but they will be looking to negotiate down from the lower baseline he has conceded. For example, the UK and the European Union will be looking for lower tariffs against their cars, steel and iron, which the US needs and which the US rustbelt will be unable to replace any time soon. Trump and his supporters are now trying to save face by suggesting that his moves have all really been about confronting China. At the time of writing, tariffs against the US's only real match in terms of trade and military power have now reached an incredible 145%. The People's Republic of China (PRC) has reciprocated but kept well below the American level. Having been threatened by the US, the rest of the world is unlikely to join America in a trade war against China. It is not their problem. Trump has shown that nearby countries such as Vietnam have nothing to gain from him. Instead, he has handed China the chance to pose as the upholder of international trade rules, in spite of its oppressive and antidemocratic policies. Read more:Americans react to Trump tariffsWhat does Starmer really think? China has cut back its trade dependency on the US considerably in recent years, and its government is not accountable to voters. Donald Trump may find that the US does not have the leverage against China that it thinks it does. Ultimately, Trump is after a one-on-one big men meeting with President Xi. The danger must be that in order to pose as a deal-maker, he once again makes concessions he should not, such as selling out Taiwan. The supine, Republican-dominated US Congress has chosen not to contest Trump's unrestrained exercise of executive power, however delusional and incompetent it may be. He was only forced to reverse his main tariff moves because of market forces beyond his control. He had destabilised the whole US economy. Lots of his rich allies were losing money themselves. They will have made most of it back in the temporary stock market surge. 👉 Follow Trump 100 on your podcast app 👈  Democrats are now demanding an inquiry into possible insider trading by Trump and his associates - although they are unlikely to get very far in Trump's America. That perhaps is the key to doing a deal with Donald Trump - as the British government appear to have concluded. Normal rules of statecraft or probity do not apply. He does not care about the important matters at stake or even understand them. They are peripheral to the deal he wants to make. The art is to make sure there is an \"upside\" for him personally in any deal. Money and grotesque flattery are both acceptable forms of tribute to this president."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250412041152",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": " It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Monday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in West Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    },
    {
        "title": "Athens: Bomb explodes outside Hellenic Train's offices amid anger over Greece's worst train disaster",
        "description": "Police in Greece are investigating after a bomb exploded outside the offices of the country's main railway company.",
        "url": "https://news.sky.com/story/athens-bomb-explodes-outside-hellenic-trains-offices-amid-anger-over-greeces-worst-train-disaster-13346911",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-athens-greece-bomb_6883583.jpg?20250412064524",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-12 05:50:00",
        "Headline": "An anonymous phone warning was reportedly made to a newspaper and a news website, saying a bomb had been left outside the railway company offices and would explode within about 40 minutes.",
        "Content": " Police in Greece are investigating after a bomb exploded outside the offices of the country's main railway company. There were no reports of injuries after the blast next to Hellenic Train's offices in central Athens on Friday evening. An anonymous phone warning was reportedly made to a newspaper and a news website, saying a bomb had been left outside the railway company offices and would go off within about 40 minutes. Police forensics experts wearing white coveralls were pictured collecting evidence at the scene following the blast on Syngrou Avenue, a major road in the Greek capital. The male caller gave a timeframe of 35 to 40 minutes and insisted it was not a joke, local media outlet efsyn said. Police cordoned off the site, keeping people away from the building in an area with several bars and restaurants. A bag, described in local media as a rucksack, containing an explosive device had been placed near the Hellenic Train building. \n                  Powerful storm brings flooding to Greek islands Paros and Mykonos\n                 \n                  Kirsty Coventry: After historic win, new IOC president must deal with Trump, Putin and transgender issue\n                 \n                  Athens protest: Greek anger at lack of change boils over, two years after country's worst rail disaster\n                 The explosion comes amid widespread public anger over the Tempe railway disaster in which 57 people, mostly university students, were killed in northern Greece. The government has been widely criticised for its handling of the aftermath of the country's deadliest rail disaster when a freight train and a passenger train heading in opposite directions were accidentally put on the same track on 28 February 2023. Unhappiness has grown over the last few weeks in the wake of the second anniversary of the tragedy. Safety deficiencies exposed The crash, which exposed severe deficiencies in Greece's railway system, including in safety systems, has triggered mass protests, led by the relatives of those killed, which have targeted the country's conservative government. Critics accuse authorities of failing to take political responsibility for the disaster or hold senior officials accountable. So far, only rail officials have been charged with any crimes. Several protests in recent weeks have turned violent, with demonstrators clashing with police. Heated debate in parliament Earlier on Friday, a heated debate on the accident in the Greek parliament saw a former cabinet minister referred to investigators for alleged failures in his handling of the immediate aftermath of the crash. Hellenic Train said it \"unreservedly condemns every form of violence and tension which are triggering a climate of toxicity that is undermining all progress\". Read more from Sky News:MPs to debate British SteelMenendez brothers to be resentencedHow to complain at restaurants Greece has a long history of politically motivated violence, with domestic extremist groups carrying out small-scale bombings which usually cause damage but rarely lead to injuries."
    },
    {
        "title": "Three brothers bid to row across Pacific Ocean in record time after conquering Atlantic",
        "description": "Three brothers are hoping to set a record time for rowing across the Pacific Ocean - having already conquered the Atlantic.",
        "url": "https://news.sky.com/story/rowing-brothers-bid-to-cross-pacific-ocean-in-record-time-after-conquering-atlantic-13346954",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-amie-lachlan-ewan-maclean_6883631.jpg?20250412094218",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-12 08:44:00",
        "Headline": "The trio will try to row non-stop and unsupported from Lima to Sydney in their custom-built carbon fibre ocean rowing boat and, in the process, aim to raise £1m to support their own clean water charity.",
        "Content": "Three brothers are hoping to set a record time for rowing across the Pacific Ocean - having already conquered the Atlantic. Ewan, Jamie, and Lachlan Maclean, from Edinburgh, start their four-month, 9,000-mile adventure on Saturday when they leave from Lima in Peru at 9pm UK time. They will attempt to row non-stop and unsupported to Sydney in Australia in their custom-built carbon fibre ocean rowing boat and in the process aim to raise £1m to support their own clean water charity. The trio are expected to spend more than 120 days at sea, covering the equivalent of 343 marathons on a journey requiring around four million oar strokes. Rowing in two-hour shifts around the clock, they will likely face extreme weather, sleep deprivation, and complete isolation on the world's largest ocean. They have already conquered the Atlantic, setting three world records in the process. After completing the 3,000-mile trip in just 35 days, they became the first three brothers to row any ocean together, the youngest trio and the fastest trio to row the journey from the Canary Islands to Antigua. \n                  Two men in court as four arrested amid major police probe into gang feud in Edinburgh\n                 \n                  Expert predicts GTA VI will cost $100 and believes gamers will snap it up without complaint\n                 \n                  Pizza Hut franchisee in Scotland accused of 'wage theft' as workers stage protest\n                 'We feel at peace at sea' Ewan, 33, said they got the idea to row across the Pacific while on their Atlantic voyage, where they realised \"how at peace we felt at sea - and also how truly lucky we are. \"We started thinking about how we could spend more time on the water and help more people - and this daft challenge was born.\" 'Getting people access to clean water is what drives us' The Rare Whisky 101 Pacific Row aims to raise more than £1m for The Maclean Foundation, a clean water charity the brothers launched with their father, Charles Maclean, following their 2020 record journey. The charity has funded boreholes, helping more than 5,000 people in Madagascar, but the brothers hope their latest voyage will boost its impact significantly. Ewan said their trips to Madagascar have shown them \"what access to clean water can do - it helps kids get an education, helps communities thrive, and saves lives. \"That's what drives us.\" The boat, which they helped design and build, is named Rose Emily in honour of their sister, who was lost during pregnancy. Read more from Sky News:Menendez brothers to be resentencedHow to complain at restaurants Their mother Sheila, a watercolour artist, hand-painted the name onto the hull. Jamie, 31, said the journey would \"honour\" the sister they never met, and \"she'll be with us every mile\". Their 500kg of freeze-dried food includes haggis, neeps, and tatties for Lachlan's 27th birthday in June. They will also bring bagpipes, a small guitar, and a miniature accordion with them on the voyage to make music when they are resting from rowing."
    },
    {
        "title": "Iran says 'indirect talks' have taken place with US over nuclear programme - with more to follow",
        "description": "Iran says \"indirect talks\" over the country's rapidly advancing nuclear programme have taken place with US officials, with more to come next week.",
        "url": "https://news.sky.com/story/iran-says-indirect-talks-taking-place-with-us-over-nuclear-programme-13347051",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iran-oman-abbas-araghchi_6883929.jpg?20250412145101",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-12 12:15:00",
        "Headline": "The talks come after US President Donald Trump warned Iran it would be in \"great danger\" if a deal wasn't reached between the two countries.",
        "Content": " Iran says \"indirect talks\" over the country's rapidly advancing nuclear programme have taken place with US officials, with more to come next week. The discussions on Saturday took place in Muscat, Oman, with the host nation's officials mediating between representatives of Iran and the US, who were seated in separate rooms, according to Esmail Baghaei, a spokesperson for Iran's foreign ministry. After the talks concluded, Omani and Iranian officials reported that Iran and the US had agreed to hold more negotiations next week. After the meeting, Oman's foreign minister Sayyid Badr Albusaidi thanked Iran's foreign minister Abbas Araghchi and US Middle East envoy Steve Witkoff for joining the negotiations aimed at \"global peace, security and stability\", in an X post. \"We will continue to work together and put further efforts to assist in arriving at this goal,\" he added. 'Very positive' and 'constructive' Iranian state media claimed the US and Iranian officials \"briefly spoke in the presence of the Omani foreign minister\" at the end of the talks - a claim Mr Araghchi echoed in a statement on Telegram. \n                  US-Iran talks exceeded expectations - but the first round was the easy bit\n                 \n                  Day 79: Trump's tariff turmoil  \n                 \n                  Iran denies 'direct talks' with US over its nuclear programme\n                 He said the talks took place in a \"constructive atmosphere based on mutual respect\" and that they would continue next week. Speaking on board Air Force One on Saturday US President Donald Trump said the \"talks are going okay\". \"I can't tell you because nothing matters until you get it done, so I don't like talking about it, but it's going OK. The Iran situation is going pretty good, I think,\" he told reporters. Earlier the White House claimed the talks in Muscat were \"very positive and constructive,\" and that a further meeting would take place next Saturday. \"These issues are very complicated, and Special Envoy Witkoff's direct communication today was a step forward inachieving a mutually beneficial outcome,\" the White House added. Ahead of the first meeting, Mr Araghchi said there was a \"chance for initial understanding on further negotiations if the other party [US] enters the talks with an equal stance\". He told Iran's state TV: \"Our intention is to reach a fair and honourable agreement - from an equal footing. \"And if the other side has also entered from the same position, God willing, there will be a chance for an initial agreement that can lead to a path of negotiations.\" Reuters news agency said an Omani source told it the talks were focused on de-escalating regional tensions, prisoner exchanges and limited agreements to ease sanctions in exchange for controlling Iran's nuclear programme.  'Great danger' if talks fail Donald Trump has insisted Tehran cannot get nuclear weapons. He said on Monday the talks would be direct, but Tehran officials insisted it would be conducted through an intermediary. Mr Trump also warned Iran would be in \"great danger\" if negotiations fail. \"Hopefully those talks will be successful, it would be in Iran's best interests if they are successful,\" he said. \"We hope that's going to happen.\" He added Iran \"cannot have a nuclear weapon, and if the talks aren't successful, I actually think it will be a very bad day for Iran\". The comments came after Mr Trump's previous warnings of possible military action against Iran if there is no deal over its nuclear programme. Read more:Trump undergoes annual medical check-upPolish president backs Trump over Ukraine Saturday's meeting marked the first between the countries since Mr Trump's second term in the White House began. During his first term, he withdrew the US from a deal between Iran and world powers designed to curb Iran's nuclear work in exchange for sanctions relief. He also reimposed US sanctions. Iran has since far surpassed that deal's limits on uranium enrichment. Tehran insists its nuclear programme is wholly for civilian energy purposes but Western powers accuse it of having a clandestine agenda. Mr Witkoff came from talks with Russian president Vladimir Putin on Friday, as the US tries to broker an end to the war in Ukraine."
    },
    {
        "title": "Money and grotesque flattery: The art of doing a deal with Donald Trump is to make sure there is an 'upside' for him",
        "description": "Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure.",
        "url": "https://news.sky.com/story/money-and-grotesque-flattery-the-art-of-doing-a-deal-with-donald-trump-is-to-make-sure-there-is-an-upside-for-him-13346421",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump-tariffs_6882867.png?20250413044437",
        "type": "US",
        "Author": "Adam Boulton",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "After destabilising the whole US economy and starting a trade war against China, just how good a deal-maker is Donald Trump?",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Donald Trump boasts that he is the king of dealmakers. His 1987 ghostwritten bestseller, The Art Of The Deal, turned the New York City nepo babe into a national figure. This in turn, led to him playing the boss in the TV show The Apprentice, and that became his calling card to becoming the president of the United States twice. That, at least, is the view of men who bitterly regret giving Trump his leg-ups to the top. Tony Schwartz, the author who actually wrote The Art Of The Deal, now says it should have been called 'The Sociopath'. After his Non Disclosure Agreement expired, Bill Pruitt, a producer on the first season of The Apprentice, when it was called Meet The Billionaire, confessed \"he was not, by any stretch, a successful New York real estate tycoon like we made him out to be\". John Miller, the chief marketing officer for NBC who was in charge of crafting Trump's TV image, admits \"we created a monster\". He says Trump had a string of failures and bankruptcies behind him, but \"people thought he would be a good president because I made him seem like a legitimate businessman\". Nobody can take Trump's electoral successes away from him. He has been elected president of the United States twice, most recently with a majority of the popular vote. Questions remain about the quality of his deal-making after the economic damage done around the world by his tariff plans, followed rapidly by his partial climbdown from them. He is good at playing the big man for the cameras, but just how good a deal-maker is Donald Trump? \n                  US envoy meets Putin for talks - as Trump urges Russia to 'get moving' on Ukraine\n                 \n                  Donald Trump undergoes annual medical check-up - but report likely to be scarce on details\n                 \n                  Fourth person in court over damage to Trump Turnberry golf resort in Scotland\n                 And knowing what they know after the past 10 days, how should the 75 nations who Trump says are queuing up \"to kiss my ass\" negotiate with him? Trump's decision not to implement the big \"reciprocal\" tariffs he had announced against countries around the world brought relief. His closest advisors fanned out to insist that the rollercoaster ride he forced on the markets was all part of a cunning plan. The president had always planned to go into reverse, they claimed, even though he had repeatedly said he would not in the days following his big tariff reveal in the White House Rose Garden. Trump's tariff climbdown, posted on his Truth Social platform, was one in the eye for the US trade secretary Howard Lubnick, who had being telling the world \"there is no postponing, they are definitely going to stay in place for days and weeks\". Peter Navarro, the \"brains\" behind the tariff strategy, also had to eat his words but then he is a \"moron\" and \"dumber than a sack of bricks\", according to Elon Musk. Navarro laid down the law in The Financial Times hours after the original announcements. \"This is not a negotiation,\" he wrote then.  After Trump's retreat, he went on TV to bluster: \"This is one of the greatest days in American economic history we have had. I think we're going to call it the 'art of the reciprocal trade deal'. I'll tell ya, all the nervous Nellies on Wall Street who try to undermine us consistently underestimate the power of the president to negotiate.\" Flanked by an uneasy-looking treasury secretary Scott Bessent, Karoline Leavitt, the White House spokesperson, chided, \"many of you in the media clearly missed The Art Of The Deal\". She claimed the president's ploys had isolated China and left the rest of the world looking for deals with the US, \"and they need this president in the Oval Office to talk to them\". Leavitt seemed to be reaching for one of the tactics outlined in The Art Of The Deal - go over the top and ask for too much, so that when you negotiate down, you are still the winner. By this logic, really big tariffs against individual major exporters to the US have been shelved, but the across-the-board 10% tariff has been left in place. This structural shift is vital to true believers in Trump's plan to make Americans pay tax through what they buy rather than their earnings. The trouble is that Trump blinked first and seemed to suggest that tariff threats were only a means to the end of a new ideal of \"free trade\". Just as with his Ukraine plans, he made concessions in advance to the people he is negotiating against - President Putin in the case of his \"peace plan\" - without getting anything in return. The markets, especially government bond markets, have shown that this president does not have the muscle to impose his will regardless. The trading partners queuing for talks may be prepared to flatter, but they will be looking to negotiate down from the lower baseline he has conceded. For example, the UK and the European Union will be looking for lower tariffs against their cars, steel and iron, which the US needs and which the US rustbelt will be unable to replace any time soon. Trump and his supporters are now trying to save face by suggesting that his moves have all really been about confronting China. At the time of writing, tariffs against the US's only real match in terms of trade and military power have now reached an incredible 145%. The People's Republic of China (PRC) has reciprocated but kept well below the American level. Having been threatened by the US, the rest of the world is unlikely to join America in a trade war against China. It is not their problem. Trump has shown that nearby countries such as Vietnam have nothing to gain from him. Instead, he has handed China the chance to pose as the upholder of international trade rules, in spite of its oppressive and antidemocratic policies. Read more:Americans react to Trump tariffsWhat does Starmer really think? China has cut back its trade dependency on the US considerably in recent years, and its government is not accountable to voters. Donald Trump may find that the US does not have the leverage against China that it thinks it does. Ultimately, Trump is after a one-on-one big men meeting with President Xi. The danger must be that in order to pose as a deal-maker, he once again makes concessions he should not, such as selling out Taiwan. The supine, Republican-dominated US Congress has chosen not to contest Trump's unrestrained exercise of executive power, however delusional and incompetent it may be. He was only forced to reverse his main tariff moves because of market forces beyond his control. He had destabilised the whole US economy. Lots of his rich allies were losing money themselves. They will have made most of it back in the temporary stock market surge. 👉 Follow Trump 100 on your podcast app 👈  Democrats are now demanding an inquiry into possible insider trading by Trump and his associates - although they are unlikely to get very far in Trump's America. That perhaps is the key to doing a deal with Donald Trump - as the British government appear to have concluded. Normal rules of statecraft or probity do not apply. He does not care about the important matters at stake or even understand them. They are peripheral to the deal he wants to make. The art is to make sure there is an \"upside\" for him personally in any deal. Money and grotesque flattery are both acceptable forms of tribute to this president."
    },
    {
        "title": "Smartphones and laptops among items excluded from reciprocal tariffs, US says",
        "description": "Electronics such as smartphones and laptops will be excluded from reciprocal tariffs, the Trump administration has said.",
        "url": "https://news.sky.com/story/smartphones-and-laptops-among-items-excluded-from-reciprocal-tariffs-us-says-13347295",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-china_6884116.jpg?20250412161226",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-12 14:48:00",
        "Headline": "The exemption on laptops and smartphones could help keep prices down as they are mainly produced in countries like Taiwan and China - among the hardest hit by Donald Trump's tariffs.",
        "Content": "Electronics such as smartphones and laptops will be excluded from reciprocal tariffs, the Trump administration has said. US Customs and Border Protection listed 20 product categories in a notice to shippers, including the very broad 8471 code for all computers, laptops, disc drives and automatic data processing. It added that semiconductor devices and equipment, memory chips and flat panel displays would also be exempt. The move could help keep prices down for popular consumer items that are mainly produced in East Asian countries and China, which is the country hardest hit by Donald Trump's tariffs. In a statement to Sky's US partner network NBC News, White House deputy press secretary Kush Desai said: \"President Trump has made it clear America cannot rely on China to manufacture critical technologies such as semiconductors, chips, smartphones, and laptops. \"That's why the President has secured trillions of dollars in US investments from the largest tech companies in the world, including Apple, TSMC, and Nvidia. \"At the direction of the President, these companies are hustling to onshore their manufacturing in the United States as soon as possible.\"  Tech firms, including Apple, Samsung and Nvidia, have struggled in the stock market since the levies were first announced. Earlier this week, the head of the trading floor at Currencies 4 You told Newspage Mr Trump's tariffs on Chinese imports \"could significantly impact iPhone pricing globally\". Prem Raja said analysts suggested \"US prices might surge by up to 43% if Apple passes on the costs\" to consumers.  The US and China have been locked in an escalating trade dispute since the start of the month, as both countries ratcheted up tariffs on imports. After Mr Trump announced a 34% levy on China on \"Liberation Day\", Beijing responded by introducing tariffs of the same rate on American imports. Read more:Tariff war could be reaching stalemate, but more danger lingersPolish president tells allies 'stay calm' over tariffs The US president then added another 50% tariff atop the 34% and warned China not to retaliate. In turn, Chinese officials called the tariffs \"bullying\" and raised levies again to 84%. Mr Trump then raised levies on most Chinese goods to 145% as he paused tariffs higher than 10% for 90 days, prompting Beijing to raise their US import rates to 125%."
    },
    {
        "title": "Mahmoud Khalil: Judge rules Palestinian student activist can be deported from US",
        "description": "Palestinian student activist Mahmoud Khalil can be deported from the US, an immigration judge has ruled.",
        "url": "https://news.sky.com/story/mahmoud-khalil-judge-rules-palestinian-student-activist-can-be-deported-from-us-13346971",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mahmoud-khalil-columbia-university_6852642.jpg?20250412125710",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-12 10:07:00",
        "Headline": "The 30-year-old Columbia University postgraduate student was detained in March after acting as a mediator between protesters and university officials during pro-Palestinian demonstrations last year.",
        "Content": " Palestinian student activist Mahmoud Khalil can be deported from the US, an immigration judge has ruled. Mr Khalil, a postgraduate student at Columbia University's school of international and public affairs, has been a prominent figure in the university's pro-Palestinian student protest movement. The 30-year-old has held a US permanent residency green card since 2024 and his wife is a US citizen. Mr Khalil was detained at his Columbia apartment building in Manhattan on 8 March, as agents from the Department of Homeland Security (DHS) told him his student visa had been revoked. It marked the first arrest in President Donald Trump's crackdown on students who joined campus protests against the war in Gaza. Mr Khalil, who acted as a mediator between protesters and university officials during pro-Palestinian demonstrations at New York's Columbia University last year, is not accused of breaking any laws. But the Trump administration says noncitizens who participate in demonstrations like he has should be expelled from the country for expressing views that the administration considers to be antisemitic and \"pro-Hamas\". \n                  Iran says 'indirect talks' have taken place with US over nuclear programme - with more to follow\n                 \n                  Money and grotesque flattery: The art of doing a deal with Donald Trump is to make sure there is an 'upside' for him\n                 \n                  Smartphones and laptops among items excluded from reciprocal tariffs, US says\n                 On Friday, immigration judge Jamee E Comans ruled that the government had the right to deport him, saying its belief that his presence posed \"potentially serious foreign policy consequences\" was enough to satisfy requirements for his deportation. He said the government had \"established by clear and convincing evidence that he is removable\". Mr Khalil's lawyers have said they plan to fight the ruling via the Board of Immigration Appeals and can also pursue an asylum case on his behalf. The judge gave them until 23 April to seek a waiver. Read more:Menendez brothers' resentencing hearing to go ahead next weekUS envoy meets Putin for talks on Ukraine war His lawyer Marc van der Hout said after the ruling: \"Today, we saw our worst fears play out: Mahmoud was subject to a charade of due process, a flagrant violation of his right to a fair hearing, and a weaponisation of immigration law to suppress dissent.\" Mr Khalil, who was born in a Palestinian refugee camp in Syria and holds Algerian citizenship, remains in the Louisiana immigration detention centre where federal authorities transferred him after his arrest.  His defence team has said it is seeking a preliminary injunction from the federal court in New Jersey, which would release him from custody and could block the Trump administration from arresting and detaining people for supporting Palestinian people in Gaza. The Trump administration has been cracking down on pro-Palestinian protesters at universities across the country. After his arrest last month, the president said: \"This is the first arrest of many to come. We know there are more students at Columbia and other universities across the country who have engaged in pro-terrorist, anti-Semitic, anti-American activity, and the Trump administration will not tolerate it.\" There have also been protests over the arrest of Mr Khalil, including by a Jewish group against the war in Gaza who stormed Trump Tower in New York last month. Local police said 98 were arrested on charges including trespassing, obstruction and resisting arrest."
    },
    {
        "title": "Starmer's search for football watchdog chair goes into extra-time",
        "description": "The appointment of the inaugural chair of English football's new watchdog has been thrown into fresh uncertainty after Whitehall officials resumed contact with applicants who did not make it onto&#160;a final shortlist.",
        "url": "https://news.sky.com/story/starmer8217s-search-for-football-watchdog-chair-goes-into-extra-time-13346934",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-manchester-united-man-united_6883615.jpg?20250412085041",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-12 07:41:00",
        "Headline": "The process to appoint a chair of the Independent Football Regulator has been cast into fresh doubt after it emerged that three shortlisted candidates were unlikely to get the job, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The appointment of the inaugural chair of English football's new watchdog has been thrown into fresh uncertainty after Whitehall officials resumed contact with applicants who did not make it onto a final shortlist. Sky News has learnt that the preferred candidate to chair the Independent Football Regulator (IFR) is now \"unlikely\" to be drawn from a group of three contenders interviewed months ago. The search process has not been officially reopened, and insiders said the £130,000-a-year post was not expected to be readvertised. They acknowledged, however, that a shortlist including former Aston Villa Football Club chief executive Christian Purslow would probably not produce the chosen candidate. Sky News revealed in recent weeks that the other contenders were Sanjay Bhandari, who chairs the anti-racism football charity Kick It Out, and Professor Sir Ian Kennedy, who chaired the new parliamentary watchdog established after the MPs expenses scandal. The delay to the appointment of the IFR's inaugural chair will do little to dampen recent speculation that Sir Keir Starmer wants to pare back the powers of the football regulator amid a broader clampdown on Britain's economic watchdogs. Both 10 Downing Street and the Department for Culture, Media and Sport (DCMS) have sought to dismiss the speculation, with insiders insisting that the IFR will be established as originally envisaged. \n                  Chelsea star Moises Caicedo's £160,000 car seized after he was stopped 'for driving without a licence'\n                 \n                  Everton FC 'strongly condemns' death threats made against James Tarkowksi after Merseyside derby tackle\n                 \n                  UK almost certain to host 2035 Women's World Cup as 'sole bidder'\n                 The establishment of the regulator, which will be based in Manchester, is among the principal elements of legislation progressing through parliament. The Football Governance Bill has just completed its journey through the House of Lords and will be introduced in the Commons shortly, according to a DCMS spokesman. The establishment of the regulator, which was conceived by the previous Conservative government in the wake of the furore over the failed European Super League project, has triggered deep unrest in English football. Steve Parish, the chairman of Premier League side Crystal Palace, told a recent sports industry conference that the watchdog \"wants to interfere in all of the things we don't need them to interfere in and help with none of the things we actually need help with\". \"We have a problem that we're constantly being told that we're not a business and [that] we're part of the fabric of communities,\" he is reported to have said. \"At the same time, we're… being treated to the nth degree like a business.\" Interviews for the chair of the football regulator took place in November, with a previous recruitment process curtailed by the calling of last year's general election. Read more from Sky News:Lecturers' pension fund seeks new tune with £90m O2 arena bidWeight loss start-up Habitual gains pounds from funding boost Lisa Nandy, the culture secretary, will sign off on the appointment of a preferred candidate, with the chosen individual expected to face a pre-appointment hearing in front of the Commons culture, media and sport select committee. It forms part of a process that represents the most fundamental shake-up in the oversight of English football in the game's history. The establishment of the body comes with the top tier of the professional game gripped by civil war, with Abu Dhabi-owned Manchester City at the centre of a number of legal cases over its financial dealings. The government has dropped a previous stipulation that the regulator should have regard to British foreign and trade policy when determining the appropriateness of a new club owner. \"We do not comment on speculation,\" the DCMS said when asked about the process to recruit a chair of the football watchdog. \"No appointment has been made and the recruitment process for [IFR] chair is ongoing.\""
    },
    {
        "title": "Emergency bill to protect British Steel becomes law",
        "description": "An emergency bill to save British Steel's Scunthorpe blast furnaces has become law.",
        "url": "https://news.sky.com/story/emergency-bill-to-protect-british-steel-becomes-law-13347106",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-british-steel-scunthorpe_6883046.jpg?20250411153936",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-12 17:00:00",
        "Headline": "Ministers took the unusual step of recalling parliament from its Easter recess to sit on Saturday to pass the legislation. It is the first time this has happened in more than 40 years.",
        "Content": " An emergency bill to save British Steel's Scunthorpe blast furnaces has become law. The urgent legislation gives ministers the power to instruct British Steel to keep the plant open. A government source said late on Saturday that Business Secretary Jonathan Reynolds had already issued instructions to the company - but did not reveal what they were. The bill was rushed through the House of Commons and House of Lords in one day, with MPs and peers being recalled from recess to take part in a Saturday sitting for the first time in over 40 years. Emergency bill becomes law - follow the latest reaction here After passing through both houses of parliament, the Steel Industry (Special Measures) Bill was granted royal assent by the King. The bill gives the government the power to take control of British Steel - or any other steel asset - \"using force if necessary\", order materials for steelmaking and instruct that workers be paid. It also authorises a jail sentence of up to two years for anyone breaching this law. Sir Keir Starmer hailed the legislation for \"turning the page on a decade of decline\", adding \"all options are on the table to secure the future of the industry\".  It will mean the steel plant in Scunthorpe will continue to operate as the government decides on a long-term strategy, and steelmaking in the UK more broadly. Officials from the Department for Business and Trade arrived at the site before the bill had even passed, Sky News understands. Earlier, staff from the plant's ousted Chinese owners Jingye were denied access, with police called over a \"suspected breach of peace\" - though officers found \"no concerns\".  Ministers took the unusual step of recalling parliament from its recess to sit on Saturday after negotiations with Jingye appeared to break down. Business Secretary Jonathan Reynolds said the measures within the bill were \"proportionate and necessary\" to keep the Scunthorpe blast furnaces open and protect both the UK's primary steelmaking capacity and the 3,500 jobs involved. The emergency legislation stops short of full nationalisation of British Steel, but Mr Reynolds told MPs that public ownership remained the \"likely option\" for the future. Read more:British Steel employees express fears over plant's futureWhy the hot spring weather is sliding away During the debate, several Conservative MPs, Reform UK's deputy leader Richard Tice and the Liberal Democrats' deputy leader Daisy Cooper all spoke in favour of nationalisation. MPs had broken up for the Easter holidays on Tuesday and had not been due to return until Tuesday 22 April. The business secretary accused Jingye of failing to negotiate \"in good faith\" after it decided to stop buying enough raw materials to keep the blast furnaces at Scunthorpe going. But the Conservatives said the government should have acted sooner, with shadow leader of the house Alex Burghart accusing ministers of making \"a total pig's breakfast\" of the situation regarding British Steel. The government was also criticised for acting to save the Scunthorpe plant but not taking the same action when the Tata Steel works in Port Talbot were threatened with closure."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250412041152",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": " It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Monday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in West Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    },
    {
        "title": "Will Katy Perry sing in space - and will the all-female Blue Origin rocket crew count as astronauts?",
        "description": "It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth.",
        "url": "https://news.sky.com/story/will-katy-perry-sing-in-space-and-will-the-all-female-blue-origin-rocket-crew-count-as-astronauts-13345042",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-space-blue-origin_6882943.png?20250412041152",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-12 23:01:00",
        "Headline": "A popstar, a journalist, a civil rights activist, rocket scientist and filmmaker are heading into space. And the mission is being led by Lauren Sanchez, an author and the fiance of Amazon's Jeff Bezos.",
        "Content": " It's been more than 60 years since a woman travelled into space without a man. And now six of them are blasting off from Earth. Popstar Katy Perry, author Lauren Sanchez, journalist and TV presenter Gayle King, civil rights activist Amanda Nguyen, former rocket scientist Aisha Bowe and filmmaker Kerianne Flynn are due to launch in Jeff Bezos' Blue Origin rocket on Monday. It will be the latest flight of the New Shepard programme, named NS-31, and is aiming to \"create a lasting impact that will inspire generations\", with the women forming the first all-female crew since Russian engineer Valentina Tereshkova's solo flight to space in 1963. The trip is only expected to last around 11 minutes, with the reusable self-driving rocket taking off from Launch Site One in West Texas, at 8.30am local time (2.30pm BST) on Monday. It will reach a maximum height of 100km (62 miles) above Earth, with the women technically entering space as the capsule crosses the Karman line, which is internationally recognised as the boundary of space. They will not, however, be classed as astronauts by the Federal Aviation Administration, NASA or US military, which all have different eligibility requirements for people to become commercial astronauts. While in space, the crew will have about four minutes of weightlessness to float around and take in the views of Earth from the capsule's large windows. The crew capsule will then descend back to Earth using three parachutes. So far, 52 people have been taken into space as part of billionaire and Amazon chief Mr Bezos's programme, including the man himself, who joined the New Shepard's maiden voyage in 2021. Star Trek actor William Shatner became the oldest person in space when he joined the mission at the age of 90. How the crew was picked Mr Bezos' fiancee is leading the mission. Sanchez told Elle magazine she chose her fellow crew members because each had \"proven their ability to inspire others\". She said all the women will be able to spread the word on what they felt like during the trip, and also expand on ideas of what the next generation of space explorers will look like. Perry, who is one of the best-selling music artists of all time, told Elle that she has been wanting to go to space for almost 20 years, so it was a no-brainer when she got the call. She said: \"Even when Blue Origin was first talking about commercial travel to space, I was like, 'Sign me up! I'm first in line'. And then they called me, and I was like, 'Really? I get an invite?'.\" For King, who is best known as the co-host of US breakfast show CBS Mornings, the decision wasn't quite so easy. \"When I got the call from Lauren and Jeff, my first reaction was a no,\" she said, adding that she still has \"a lot of trepidation\" ahead of the trip. Bowe, a former NASA rocket scientist and chief executive of technology company STEMBoard, said she feels like she has been \"training for and waiting for this moment [her] entire life\", while civil rights activist Nguyen and film producer Flynn both said the opportunity was a dream come true. \"I can't wait to touch down on Earth and share what we bring back with the world,\" Flynn said. Glammed-up astronauts? As well as making history by being the first all-female crew in space, the women may also be the first group of astronauts to have their hair and makeup done for a mission. \"Who would not get glam before the flight,\" Sanchez said, before joking that fake eyelashes would be \"flying round the capsule\".  Bowe said she had already tested out the hairstyle she plans to have on launch day - by skydiving in Dubai. \"I think it's so important for people to see us like that,\" Nguyen said. \"This dichotomy of engineer and scientist, and then beauty and fashion. We contain multitudes. Women are multitudes. I'm going to be wearing lipstick.\" Perry put it another way: \"We are going to put the 'ass' in astronaut.\" The women also shared details of what they plan to take to space, including the original flag from Apollo 12 - the second mission to the moon - a stuffed animal, shells from Malaysia, and conch chowder, the national dish of The Bahamas, which Bowe grew up eating. Read more:Is Bezos chasing down Musk in the billionaire space race?SpaceX tourists return to Earth As a singer, Perry said she feels like she should perform while floating above the Earth, which would make her the first artist to sing in space. She added that she is also taking part in the flight for her daughter Daisy Dove Bloom, who she shares with British actor Orlando Bloom, to teach her that \"any type of person can reach their dreams\"."
    }
]