[
    {
        "title": "Heathrow resumes flights amid internal review, 'urgent' govt investigation and further delays",
        "description": "Heathrow was in full operation on Saturday, having been shut over a loss of power for 16 hours on Friday - but some passengers have continued to face disruption. ",
        "url": "https://news.sky.com/story/heathrow-resumes-flights-and-hopes-for-full-day-of-service-but-passengers-face-further-delays-13333554",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport_6863719.jpg?20250322110056",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-22 03:35:00",
        "Headline": "Aftershocks were still felt by some passengers on Saturday, with flight boards regularly showing some cancellations and delays. Heathrow has announced an internal review, while the government ordered an \"urgent investigation\". ",
        "Content": " Heathrow was in full operation on Saturday, having been shut over a loss of power for 16 hours on Friday - but some passengers have continued to face disruption.  On Saturday morning, a Heathrow spokesperson said the airport was \"open and fully operational\" but warned passengers to still check with their airline before travelling. It came after a fire at a nearby electrical substation late on Thursday night triggered a \"significant power outage\" on Friday, leading to more than 1,000 flights being cancelled and disrupting the travel plans of as many as 290,000 passengers at Europe's busiest airport. Follow updates on Heathrow shutdown aftermath Aftershocks were still felt by some passengers on Saturday, with flight boards regularly showing some cancellations and delays. That was despite extra staff being drafted in and more flights added \"to facilitate an extra 10,000 passengers\".  Police have said the cause of the fire is believed to be non-suspicious, while London Fire Brigade (LFB) said its investigation was focusing on electrical distribution equipment. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected\n                 \n                  Heathrow shutdown: Cost of airport closure could be worth millions\n                 The government has ordered an \"urgent\" investigation into what happened. Energy Secretary Ed Miliband instructed the National Energy System Operator (NESO) to look into the incident \"so that it's prevented from ever happening again\". Heathrow boss Thomas Woldbye said the airport welcomed the independent investigation and would support \"every effort to understand the causes and impacts\" of the incident. \"We are committed to working closely with all stakeholders to ensure a thorough investigation to help strengthen the airport's future resilience,\" he said in a statement on Saturday afternoon.  The airport also announced it will launch an internal review led by Ruth Kelly, former transport secretary and an independent member of Heathrow's board. Its chairman Lord Paul Deighton said in a statement: \"Closing the airport yesterday had significant impacts for our passengers, our customers, our colleagues and the country. \"Heathrow regrets the disruption this caused. We hope that all those affected understand that the decision was made in order to prioritise the safety of our passengers and colleagues. \"We are committed to finding any potential learnings from this unprecedented incident.\"  Passengers still facing disruption Passengers continued to share their frustrations with Sky News on Saturday over their experiences with delays and cancellations, which were expected to go on until at least the end of the weekend. One was in a taxi bound for Heathrow when she found out the airport was closed.  Ray had been going to see family in Algeria to celebrate Ramadan and Eid and had travelled down from Manchester via train at 7am and hadn't checked the news - so arrived in London unaware of any issues. \"I noticed the underground was disrupted, so I took a taxi there,\" she told Anna Jones on Sky News Breakfast. \"As I was in the taxi, I found out the news that Heathrow was closed, so I had to stop the taxi driver in the middle of the trip. I wasn't sure what to do.\" She called her dad, who was in the process of driving for four hours to Algiers airport to pick her up. When she called the airline, \"they were not very optimistic about being able to reschedule\" as all the next flights were full, and all the direct flights to Algeria from the UK went via Heathrow. She said she was looking for an alternative way to get to Algeria via mainland Europe, but added the flights were \"very, very expensive\".  Another passenger, John Climpson, was meant to fly out to the north of Sweden from Heathrow on Friday morning before competing in a 240km husky sledding challenge in the Arctic Circle. But his flight was cancelled, meaning he had to wait to catch a flight from Heathrow to Stockholm on Saturday night, staying there overnight and then flying to Kiruna, the furthest north city in Sweden, on Sunday morning. He said he and his team would arrive two days later than planned, meaning \"all of our training time has disappeared and we are going to have to go straight into [the] 240km husky sledding challenge immediately, otherwise we won't make it in time\". He added Heathrow's Terminal 2 was \"probably the quietest\" he had ever seen it. In a statement, transport secretary Heidi Alexander warned those planning to fly over the next few days that \"some disruption\" is expected to continue as \"things get back to normal\". She urged anyone travelling to check with their airlines and plan their journeys.  British Airways says 90% of its flights went ahead British Airways - Heathrow's biggest airline - said 90% of its scheduled flights went ahead on Saturday, which was above its expectations of about 85%. In a statement on X, it said \"the vast majority of our customers were able to get to where they needed to be despite the very challenging circumstances going into the start of the day\". \"As things stand, we're anticipating being able to run a near-full schedule on Sunday and would therefore ask customers to come to the airport as normal unless we get in touch to tell them otherwise,\" it said. Read more:Heathrow shutdown is embarrassing at bestHow Heathrow closure ruined travel plans'Nightmare' Heathrow shutdown in numbersHow much could Heathrow closure cost UK economy? The airline added it was \"really grateful to our customers for bearing with us over the past couple of days, even though many of them have had their travel plans unacceptably cancelled or disrupted\" and thanked its employees for working \"so hard to support customers and help get our operation back on track\". Virgin Atlantic, another prominent airline at Heathrow, said on Saturday evening its operation had \"fully stabilised\" after a \"significant impact\" to its schedule over the past two days. \"We are still working to ensure all those impacted can complete their journeys as quickly as possible and we expect to run our full flying schedule on Sunday 23 March,\" it added. \"We're incredibly sorry for any disruption to our customers' journeys,\" the airline said in an earlier statement. Flight delayed or cancelled? What are your rights? Heathrow CEO Thomas Woldbye also apologised to passengers whose journeys had been disrupted, describing the delays \"as big as it gets for our airport\" and admitting \"we cannot guard ourselves 100%\". However, he stressed the airport would not have shut unless there were \"severe safety concerns\". He said a back-up transformer had failed, meaning systems had to be closed in line with safety procedures so power could be restructured from two remaining substations. A National Grid spokesperson said teams had been working tirelessly to get the situation back under control: \"Power supplies have been restored to all customers, including Heathrow, allowing operations to resume at Heathrow.  \"We are deeply sorry for the disruption caused and are continuing to work closely with the government, Heathrow and the police to understand the cause of the incident.\" 👉 Listen to Sky News Daily on your podcast app 👈 The disruption began late on Thursday night when fire crews were called to a blaze in Hayes, west London, at the electricity substation serving Heathrow and local properties. LFB deputy commissioner Jonathan Smith told reporters that the fire involved a transformer - a key part of the substation - with 25,000 litres of cooling oil \"fully alight\". Pictures from the scene showed large flames and plumes of thick black smoke, with around 70 firefighters and 10 engines working to extinguish the blaze. Crews evacuated 29 people from neighbouring properties but there were no casualties. In all, 67,000 households were left without power after the fire at the substation, but all supplies were restored by 2pm on Friday. You can share your story, pictures or video with us using our app, private messaging or email. \n\n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material."
    },
    {
        "title": "Pope Francis to be discharged from hospital tomorrow as doctors say he was 'in danger of losing his life'",
        "description": "Pope Francis will be discharged from hospital tomorrow after receiving treatment for double pneumonia - but doctors insist he will need at least two months of rest.",
        "url": "https://news.sky.com/story/pope-francis-due-to-appear-in-public-for-first-time-in-five-weeks-13333785",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pope-francis-vatican_6864342.jpg?20250322175352",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-22 14:25:00",
        "Headline": "The Pope will return to the Vatican on Sunday after five weeks in hospital being treated for double pneumonia. This period has marked the most serious health crisis of his 12-year papacy.",
        "Content": " Pope Francis will be discharged from hospital tomorrow after receiving treatment for double pneumonia - but doctors insist he will need at least two months of rest. The 88-year-old pontiff has been at Gemelli Hospital in Rome for more than five weeks since being admitted for a severe respiratory infection on 14 February. Dr Sergio Alfieri, the head of the team taking care of the Pope, told reporters Francis was \"in danger of losing his life\" during \"very critical episodes\" in his hospital stay. The Pope will return to Santa Marta, his residence in the Vatican, on Sunday, he said. Dr Alfieri said the pontiff was now in a \"stable clinical condition\" but he would continue taking medication \"for quite a long time\". \"It's very important that he follow a period of convalescence and rest for at least two months,\" he added.  The Vatican previously said he would appear from the window of his 10th floor hospital room on Sunday to offer a blessing - which he will do before he is discharged. A photo released by the Vatican last week showed the leader of the Catholic church celebrating Sunday mass in a hospital chapel. The Vatican said in a statement that Pope Francis wanted to come to the hospital window around noon (11am UK time) on Sunday to give a greeting and blessing. One senior cardinal said on Friday it could take time for the Pope to \"relearn to speak\" after using oxygen during his hospital stay. Dr Sergio Alfieri addressed this during Saturday's news conference, pointing out that when someone has double pneumonia \"the lungs are damaged\". \"They [lungs] have been damaged and breathing muscles have been strained. One of the first things that happens is that our voice diminishes... like when you use your voice too much.\" But he insisted that, in time, the voice would return to normal. Read more from Sky News:King and Queen due to meet PopePope records message from hospital Despite the Pope's discharge from hospital, there has been no update about his plans to meet the King and Queen when they make a state visit to the Vatican on 8 April. But doctors said on Saturday they had prescribed two months of convalescence and had advised him against taking any meetings with large groups or that require special effort. This period marks the most serious health crisis of his 12-year papacy and the longest he has been out of public view since his election as pontiff in 2013."
    },
    {
        "title": "US defence staff could face lie detector tests in probe into leaks after Musk Pentagon visit",
        "description": "US defence department workers could face lie detector tests as the Pentagon investigates alleged leaks of national security information.",
        "url": "https://news.sky.com/story/us-defence-staff-could-face-lie-detector-tests-in-probe-into-leaks-after-musk-pentagon-visit-13333870",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-elon-musk_6864240.jpg?20250322163809",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-22 16:13:00",
        "Headline": "A memo calling for an investigation into potential leaks from the Pentagon came after Donald Trump was forced to reject a report he was briefing tech billionaire Elon Musk on plans about how the US would fight a hypothetical war with China.",
        "Content": " US defence department workers could face lie detector tests as the Pentagon investigates alleged leaks of national security information. The department's intelligence and law enforcement arms are carrying out the inquiry, which is the latest by Donald Trump's administration. In a memo sent late on Friday, defence secretary Pete Hegseth's chief of staff called for an investigation into \"unauthorised disclosures of national security information\" that could include polygraph tests. Details of the alleged leaks were not included in the memo. Earlier in the day, Mr Trump was forced to reject reports that Elon Musk would be briefed on US military plans for fighting a hypothetical war with China. Mr Musk, who is head of the Department of Government Efficiency (DOGE) advisory group, visited the Pentagon on Friday to talk about \"efficiencies\" and \"innovations\", Mr Hegseth said. Ahead of the meeting, the New York Times reported the tech billionaire would be briefed on plans for how the US would plan for a potential war with China - but this was denied by both Mr Musk and the president. Mr Musk called the report \"pure propaganda\" and urged legal action against anyone leaking information. The memo calling for an investigation said if it revealed information \"identifying a party responsible for an unauthorised disclosure\", that information could be used to seek criminal prosecution. Speaking at the White House after the meeting, Mr Trump said he did not want to show US plans for a potential war with China to anybody and hinted at Mr Musk's potential conflict of interest. \"Elon has businesses in China, and he would be susceptible, perhaps, to that,\" the president said. Read more:Trump announces 'most lethal aircraft ever built'Conor McGregor says he wants to be Ireland's next president 👉 Follow Trump 100 on your podcast app 👈 A New York Times spokesperson said leak investigations are \"meant to chill communications between journalists and their sources and undermine the ability of a free press to bring out vital information that may otherwise be hidden\". Earlier this month, homeland security secretary Kristi Noem pledged to step up lie detector tests on employees in an effort to identify those who may be leaking information about operations to the media. While polygraph exams are typically not admissible in court proceedings, they are frequently used by federal law enforcement agencies and for national security clearances."
    },
    {
        "title": "Protests sweep Turkey as Istanbul mayor - key challenger to Erdogan - appears in court ",
        "description": "Widespread&#160;protests across Turkey have intensified after Istanbul's mayor - a key challenger to President Recep Tayyip Erdogan&#160;- was detained over allegations of corruption and links to terror organisations.",
        "url": "https://news.sky.com/story/fourth-night-of-protests-turkey-after-arrest-of-key-opposition-figure-and-challenger-to-president-erdogan-13333798",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-imamoglu-istanbul_6864553.jpg?20250322222813",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-22 14:50:00",
        "Headline": "Riot police used pepper spray and tear gas against protesters angry about Ekrem Imamoglu's continued arrest. More than 340 people were detained on Friday night but it has not deterred demonstrations, which continued on Saturday.",
        "Content": " Widespread protests across Turkey have intensified after Istanbul's mayor - a key challenger to President Recep Tayyip Erdogan - was detained over allegations of corruption and links to terror organisations. For a fourth night, demonstrators have clashed with police as Ekrem Imamoglu, a popular opposition figure with the Republican People's Party, faced further questioning. The mayor denies any wrongdoing. Many view his detention on Wednesday as a politically driven attempt to remove him from the next presidential race, scheduled for 2028. But government officials reject accusations that legal actions against opposition figures are politically motivated and insist that Turkey's courts operate independently. Police questioned Mr Imamoglu for around five hours on Saturday as part of a terror investigation into allegations of aiding the outlawed Kurdistan Workers' Party, or PKK, the Cumhuriyet newspaper reported. A day earlier he was questioned for four hours over the corruption accusations. He appeared in court on Saturday for the first time since his detention, denying all the allegations against him. Some 90 other people were also questioned by prosecutors. Dozens are prominent figures and include two district mayors. Earlier on Saturday, Mr Erdogan said the government would not tolerate street protests and accused the opposition party of links to corruption and extremist organisations. \"The days of going out into the streets, taking left-wing organisations, extremists, and vandals with you... are now behind us,\" he said. Interior minister Ali Yerlikaya said 343 people had been detained in protests on Friday night, adding: \"There will be no tolerance for those who seek to violate societal order, threaten the people's peace and security, and pursue chaos and provocation.\" Authorities barred access to a courthouse in Istanbul where Mr Imamoglu was being questioned after protestors gathered there, shouting: \"Rights, law, justice!\" Hundreds of police officers and more than a dozen water cannon trucks were deployed. Read more from Sky News:Death after plane crash in South AfricaIsrael strikes southern Lebanon Saturday marked the fourth night of demonstrations, which were largely peaceful. But a group of protesters, trying to break through barricades to reach Istanbul's main square, threw flares, stones and other objects at police who responded with pepper spray. Police used water cannons and tear gas on demonstrators in the capital, Ankara. Images on local TV also showed officers clashing with protestors in the Aegean coastal city of Izmir. Thousands marched in several other cities calling on the government to resign. It marks the largest wave of street demonstrations in Turkey in more than a decade. Mr Imamoglu is expected to be nominated as the Republican People's Party's presidential candidate in a primary on Sunday. The party's leader, Ozgur Ozel, said that the primary, in which around 1.5 million delegates can vote, will go ahead as planned."
    },
    {
        "title": "Pilot dies after air show plane crash in South Africa",
        "description": "A pilot has died after his plane spiralled out of control and crashed at an air show in South Africa.",
        "url": "https://news.sky.com/story/pilot-dies-after-air-show-plane-crash-in-south-africa-13334119",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-james-oconnell-pilot_6864529.jpg?20250322213233",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-22 20:56:00",
        "Headline": "Video shows the plane spinning mid-air before plummeting to the ground. The pilot was \"highly skilled and respected\" and crashed after suddenly losing altitude during the final manoeuvre.",
        "Content": " A pilot has died after his plane spiralled out of control and crashed at an air show in South Africa. The crash happened at the West Coast Air Show in Saldanha, a town about 70 miles (110 km) north of Cape Town, on Saturday. Video footage shows the plane spinning mid-air before plummeting to the ground. In a statement shared on social media, organisers of the show named the pilot as James O'Connell. \"It is with profound sadness that the organisers of the West Coast Airshow confirm a fatal accident involving James O'Connell, a highly skilled and respected test pilot from South Africa,\" the statement said. \"Mr O'Connell was performing a routine display intended to demonstrate the capabilities of the Impala Mark 1 - a beloved warbird with deep historical significance for many South Africans. It was especially a huge moment because the Impala has not been seen performing at air shows for many years. \"The manoeuvres were being executed as part of the official air show programme, witnessed by thousands of spectators. \"Eyewitness accounts report that the aircraft appeared to be under control during most of the display. However, during one of the final manoeuvres, the aircraft experienced a sudden loss of altitude and entered a steep dive before making contact with the ground.\" Organisers said there was no sign the pilot made an attempt to eject. \"Our thoughts and deepest sympathies are with James's family, loved ones, and everyone affected by this very tragic event,\" they added. No other injuries were reported. Elowayne Gouws, the director of West Coast Medical Rescue, told national news site News 24 that medics arrived at the scene within two minutes \"and found the wreckage engulfed in flames\". Read more from Sky News:Former KGB double agent diesUS defence staff could face lie detector tests in probe into leaks The South African Civil Aviation Authority (SACAA) and the South African Air Force's accident unit are investigating the incident. \"There is one confirmed fatality, a pilot on board an Impala aircraft,\" said SACCA head of communication Sisa Majola, national news site Times Live reported. The authority's accident and incident investigations division is working with event safety officers to \"collate preliminary information\", he added. Further updates will be shared when more information is available, organisers of the show said."
    },
    {
        "title": "US heavyweight boxing legend George Foreman dies age 76",
        "description": "US heavyweight boxing legend George Foreman has died age 76.",
        "url": "https://news.sky.com/story/us-boxing-legend-george-foreman-dies-age-76-13333548",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-george-foreman_6863793.jpg?20250322043623",
        "type": "Home",
        "Author": "Dan Cairns, news reporter",
        "Date Published": "2025-03-22 02:01:00",
        "Headline": "The ring icon regained his world title 20 years after a shock loss to Muhammad Ali and fought some of the biggest names of his era. He also had a colourful life away from boxing, making millions from kitchen appliances, becoming a minister and having 12 children.",
        "Content": "By Dan Cairns, news reporter   US heavyweight boxing legend George Foreman has died age 76. The two-time champion fought Muhammad Ali in one of the sport's most legendary fights, the 'Rumble in the Jungle', in the Democratic Republic of the Congo, then known as Zaire. Foreman was also known for putting his name to a popular range of electric grills. A statement on his Instagram account said he died peacefully on Friday \"surrounded by loved ones\" after an \"extraordinary life\". His family said \"our hearts are broken\". They called him \"a devout preacher, a devoted husband, a loving father, and a proud grand and great grandfather\" - and said he lived with \"unwavering faith, humility, and purpose\".  President Donald Trump posted a tribute on X, saying he had known the sportsman well. He wrote: \"George Foreman is dead. What a GREAT FIGHTER!!! He had, without question, the heaviest and biggest punch in the history of boxing. With the exception of Ali, when you got hit, you went down. He was something really Special, but above all, he was a Great Person, with a personality that was bigger than life.\"  Speaking to Sky News's Sam Washington, former heavyweight world champion David Haye called Foreman \"one of the greatest to ever do it\". Praising his \"perseverance\" as a fighter, the British star said Foreman did \"the unthinkable\" becoming the oldest champion in history in 1994, two decades after his famous Rumble in the Jungle with Muhammad Ali. Calling him a \"magnificent human being both inside and outside the ring\", Haye praised Foreman's \"thunderous right and left uppercuts\", adding: \"I would not have wanted to be behind one of George Foreman's punches\". Mike Tyson said on X that his \"contribution to boxing and beyond will never be forgotten\". Sharing a photo of Foreman in his youth alongside a similar image in his later years, another boxer, Chris Eubank Jr, wrote: \"Rest in Peace to one of my boxing heroes - The Legendary George Foreman.\" Former NBA basketball star Earvin \"Magic\" Johnson called Foreman one of his \"boxing heroes\", going on to call him \"a knockout artist in the ring,\" and that \"it was a pleasure getting to know him not only as a boxer but as a man\". Mentioning the product now so associated with his name, Johnson went on: \"After leaving the ring, he turned into an amazing businessman - I even bought one of the first George Foreman grills! Cookie and I will be praying for his family during this time.\" Foreman was considered virtually unbeatable in the famous 1974 fight in DR Congo. Ali, then 32, was trying to return to the top against his fearsome, undefeated opponent - just 25 at the time. Despite being a huge underdog, Ali's 'rope-a-dope' tactics of soaking up Foreman's attacks wore out the brutal puncher and he regained the title. Read more: Analysis - How Foreman became a cultural icon  Believed to be one of the most-watched sports events ever, a documentary about the fight, When We Were Kings, won an Oscar in 1996. Foreman was devastated by the loss, but 20 years later staged his own miraculous comeback - knocking out Michael Moorer to become the oldest-ever heavyweight champion at the age of 45. Outside the ring, his transformation from a brooding boxer to a jovial, TV-friendly personality helped make him a fortune with his range of grills in the 1990s. The boxer known to fans as 'Big George' was born in Marshall, Texas, on 10 January 1949. He and his six siblings were raised by a single mother. Foreman dropped out of school and got mixed up in street robberies, but left Texas at 16 and was encouraged to direct his energy into boxing. Just three years later, in his 25th amateur bout, he won gold at the 1968 Olympics in Mexico City. Foreman turned pro and reeled off 37 wins before demolishing the undefeated Joe Frazier in two rounds to become heavyweight champion for the first time in 1973. Crushed by his shock loss to Ali a few fights later, he took a year off before stepping inside the ring again. But after a second career defeat in 1977 - and what he described as a near-death experience in the dressing room - he stopped fighting. He became a born-again Christian and ordained minister. However, 'Big George' was back inside the ropes a decade later. Trimming down his physique along the way, he won 24 fights in a row before losing on points to Evander Holyfield in 1991. Foreman wasn't done though - and his long road back was finally complete in Las Vegas three years later. Wearing the same red shorts from the Ali fight and behind on the scorecards, he knocked out Michael Moorer, 19 years his junior, to win the IBF and WBA titles. Read more from Sky News:Trump announces 'most lethal aircraft ever'Israel says Hamas intelligence chief 'eliminated' Foreman's 20-year gap between world titles was a record - and he retired for good in 1997 with a record of 76 wins and five losses. He was married five times and had five sons - all called George - and seven daughters."
    },
    {
        "title": "Harrods proposes six-figure payouts to victims of al Fayed abuse",
        "description": "Lawyers for Harrods are proposing six-figure payouts to settle claims brought by sexual abuse victims of the London department store's former owner, Mohamed al Fayed.",
        "url": "https://news.sky.com/story/harrods-proposes-six-figure-payouts-to-victims-of-fayed-abuse-13333651",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mohamed-al-fayed-harrods_6863855.jpg?20250322073310",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-22 08:46:00",
        "Headline": "The London department store is close to finalising compensation payments potentially worth more than £300,000 to those who endured sexual abuse by its former owner, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lawyers for Harrods are proposing six-figure payouts to settle claims brought by sexual abuse victims of the London department store's former owner, Mohamed al Fayed. Sky News has learnt that MPL Legal, which is coordinating a redress scheme on behalf of the world-famous retailer, has told potential claimants that they could be eligible for general damages lump sums of up to £110,000 or £200,000, depending upon claimants' willingness to submit to a psychiatric assessment arranged by the company. A document seen by Sky News suggests that victims of Mr al Fayed who choose a \"non-medical pathway\" would be eligible for \"general damages limited to compensation for sexual assault of up to £110,000\", with \"aggravated damages [of] up to £15,000\", and \"wrongful testing fixed payment(s) up to £7,500\". Claimants who agree to an assessment by a scheme consultant psychiatrist - referred to in the document as the \"medical pathway\" - would be eligible for general damages of up to £200,000, further payments equivalent to those potentially awarded to non-medical claimants, as well as treatment costs \"past and future supported by the medical report\" and a \"work impact payment capped at £110,000\". The \"wrongful testing\" payments refer to women who were forced to undergo unnecessary and intrusive medical examinations demanded by Mr al Fayed, while the \"work impact payments\" relate to loss of earnings triggered by, for example, the unjustified termination of victims' employment at Harrods. The draft terms raise the prospect that some of the former Harrods owner's victims could receive payments of more than £300,000. However, the decision to impose a further psychiatric assessment in order to access the largest sums available under the scheme may anger claimants who have already endured years of psychological trauma after being abused by Mr al Fayed. \n                  Former Harrods employee accuses Mohamed al Fayed and his brother Salah of assaulting her in 1990s\n                 \n                  Investigation into Met Police's handling of some Mohamed al Fayed allegations\n                 \n                  Mohamed al Fayed: Police investigating 'more than five' people who may have 'enabled' alleged abuse of women and girls\n                 Those who opt to pursue the \"medical pathway\" nevertheless face a protracted wait to receive their payouts. The MLP document said it would take up to six months to produce a medical report, after which a claimant would have 21 days to submit questions relating to it. An offer of compensation would then be made within 35 days, it said, after which a claimant could accept the offer, appeal to an Independent Appeals Panel or leave the scheme and pursue an alternative form of redress. The proposed terms are understood to be preliminary and subject to ongoing consultation, and will not be concluded until the end of this month, according to sources close to the process. If the scheme is finalised along lines similar to those being consulted on, it would likely result in a total compensation bill for Harrods running to tens of millions of pounds. The final cost of compensating victims of a man now regarded as one of Britain's most notorious sex offenders will, though, be unclear until the number of claimants and their decisions about which compensation route to pursue have been determined. Responding to an enquiry from Sky News this weekend, a Harrods spokesperson said: \"It would be premature for us to comment on the nature and details of a scheme that is currently under consultation. \"We are actively inviting the valuable input from Survivors and their legal representatives to establish the final scheme that aims to be survivor-first, trauma-informed, and fair in its approach to compensation. \"Further updates will be provided once the consultation period is complete.\" Details are, however, expected to be finalised in the coming days. Read more: A timeline of al Fayed sex abuse claims According to a document published on a website set up by MPL Legal for the purposes of administering the redress scheme, \"Harrods and MPL Legal are undertaking a period of consultation regarding the compensation scheme in which we will receive detailed feedback from interested parties, including several legal firms representing survivors, leading Counsel and Dame Jasvinder [Sanghera], the Independent Survivor Advocate\". \"It is anticipated the final compensation scheme will be published and survivors will be able to access application forms from 31 March 2025.\" Mr al Fayed, who died in 2023, owned Harrods for 25 years, selling it in 2010 to Qatar Holding, one of the Gulf state's sovereign wealth funds, for £1.5bn.  His reign of terror at the Knightsbridge store is thought to have involved hundreds of predominantly young female victims, with former Fulham women's players also alleging sexual abuse by the billionaire Egyptian. Mr al Fayed also owned Fulham Football Club for a number of years. The MPL Legal document seen by Sky News said the redress scheme would \"provide options for survivors - an alternative route to the court process\", and that it would \"hopefully avoid an adversarial approach which also risks retraumatising survivors\". It added that the scheme would be \"as inclusive as possible - we want the scheme to work for as many survivors as we can\". Under the heading \"Scheme principles\", MPL said it represented \"an alternative to litigation, but a survivor can leave the scheme at any time and pursue the claim through the court system\". It said it hoped that law firms engaging with the scheme \"will ensure survivors receive 100% of the compensation\". \"The level of compensation available through the scheme has been designed to mirror the court's approach,\" it added. Read more:'I had to barricade myself in bedroom during work trip', accuser saysEx-flight attendant says she was sacked for refusing to sleep with al Fayed It also said there were \"certain classifications of cases which may not be suitable for the scheme, for example if a survivor wishes to claim a full loss of earnings\". Last October, lawyers acting for victims of Mr al Fayed said they had received more than 420 enquiries about potential claims, although it is unclear how many more have come forward in the six months since. In a section headed \"Eligibility\", MPL Legal said Harrods \"retains discretion to review eligibility on a case by case basis\".  The date of the MPL Legal document's creation was unclear on Saturday, but one legal source said it had been produced \"recently\"."
    },
    {
        "title": "Government considering sending failed asylum seekers to overseas 'migrant hubs'",
        "description": "The government is considering sending failed asylum seekers, including those arriving on small boats, to overseas 'migrant hubs', Sky News understands.",
        "url": "https://news.sky.com/story/government-considering-sending-failed-asylum-seekers-to-overseas-migrant-hubs-13333661",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-migrants-border-force_6864024.jpg?20250322135233",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-22 09:12:00",
        "Headline": "Labour's strategy to tackle small boat arrivals comes as a number of migrants were pictured arriving in Dover on Saturday.",
        "Content": "The government is considering sending failed asylum seekers, including those arriving on small boats, to overseas 'migrant hubs', Sky News understands. A Home Office source has told political correspondent Amanda Akass that the government is in the \"very early stages\" of discussions around the idea, and is keen to learn about what Italy has been doing in Albania. The right-wing Italian government has built two facilities in the Balkan country aiming to hold migrants there while processing their asylum requests. Government sources told The Times newspaper that UK ministers are planning to approach countries in the western Balkans including Albania, Serbia, Bosnia and North Macedonia. Analysis: 'Migrant hub' plan will send alarm bells clanging It comes as a number of migrants were pictured arriving in Dover, Kent, on Saturday. On Friday, 246 people made the perilous journey across the Channel from France in five boats - bringing the provisional total for the year so far to 5,271. \n                  'Migrant hub' plan will send alarm bells clanging for many Labour MPs - as Tories smell blood\n                 \n                  Why are asylum claims at the highest level in over 20 years?\n                 \n                  Migrant crossings: Why are more people crossing the Channel on the weekend?\n                 On Thursday, 341 people crossed in six boats. This is the earliest point in the year that crossings have reached the 5,000 mark since data on Channel crossings was first reported in 2018. Labour's strategy is expected to differ substantially from the previous Tory government's Rwanda plan, which aimed to deport all migrants who arrived in the UK illegally, regardless of whether or not their asylum claims would be successful. The Supreme Court ruled in 2023 that Rwanda was considered an \"unsafe\" country. Amanda Akass said the Home Office source \"won't say which countries are being considered because they don't want to pre-empt any discussions which haven't even officially begun yet\". \"But I am told that the government is closely looking at the example of Italy, which has a treaty with Albania and has built two detention centres in Albania to house asylum seekers while their claims are being processed there.\" Akass noted there have been legal challenges to that deal, adding: \"But it looks like the government are watching that to see what the outcome may be.\"  Read more from Sky News:Inside Italy's 'Guantanamo'Why are more people crossing the Channel on the weekend? Meanwhile, the European Union last week announced that it was proposing to allow member states to set up return hubs. The plan has been endorsed by the UN's International Organisation for Migration, which offered to \"advise and assist states in the design and operationalisation of innovative return policy that is both effective and in line with European and international law\". 👉 Listen to Sky News Daily on your podcast app 👈 The UK signed a \"road-map\" agreement with France earlier this month aimed at bolstering co-operation to tackle people smuggling across the Channel. The government's new Border Security, Asylum and Immigration Bill also continues through parliament with plans to introduce new criminal offences and hand counter terror-style powers to police and enforcement agencies to crack down on people smuggling gangs. Chris Philp, shadow home secretary, said: \"This is Labour admitting they made a catastrophic mistake in cancelling the Rwanda scheme before it even started. \"But the tragedy is it will take some time before this can be done and, in the meantime, tens of thousands of illegal migrants will have poured into the country, costing UK taxpayers billions and making a mockery of our border security. \"The fact they are now looking at offshore processing shows they were wrong to cancel Rwanda before it even started and shows their attempts to 'smash the gangs' have failed. \"In fact, illegal immigrants crossing the channel are up 28% since the election and this year has been the worst ever. Labour has lost control of our borders. They should urgently start the Rwanda removals scheme.\" Liberal Democrat leader Sir Ed Davey said the number of people crossing the Channel was \"really worrying\". He said: \"I'm actually glad that the government scrapped the Rwanda scheme because it wasn't working as a deterrent. \"In fact, hardly anybody went, and it was costing huge amounts of money. If they've got a better scheme that will work, we'll look at that. \"But they've also got to do quite a few other things. There's too many hotels that are being used because people aren't being processed quickly enough, and Liberal Democrats have argued for a long time that if you process people, you give them the right to work so they can actually contribute. \"That's the way you could save a lot of money, and I think taxpayers would support that.\" The government has been contacted for further comment."
    },
    {
        "title": "'Migrant hub' plan will send alarm bells clanging for many Labour MPs - as Tories smell blood",
        "description": "The very idea that the government is brainstorming proposals to deport failed asylum seekers to third countries, with its echoes of the controversial Rwanda plan, will send alarm bells clanging for many Labour MPs.&#160;",
        "url": "https://news.sky.com/story/migrant-hub-plan-will-send-alarm-bells-clanging-for-many-labour-mps-as-tories-smell-blood-13333761",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-migrants-dover-border-force_6820405.jpg?20250205151704",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-03-22 13:38:00",
        "Headline": "The government is said to be considering sending failed asylum seekers, including those arriving on small boats, to overseas 'migrant hubs'. Although very different from the Rwanda plan, the echoes will alienate the party's more liberal supporters.",
        "Content": "\n          Political correspondent\n              @amandaakass\n The very idea that the government is brainstorming proposals to deport failed asylum seekers to third countries, with its echoes of the controversial Rwanda plan, will send alarm bells clanging for many Labour MPs.  Sir Keir Starmer described the Rwanda scheme as a \"gimmick\" that didn't work - an argument which was a central plank of the party's general election campaign, a clear dividing line with Rishi Sunak's Tories. The Rwanda plan was mired in legal objections from the start, and even once the government controversially legislated their way around judicial rulings, only four volunteers were ever sent. The prime minister scrapped it on his first day in office. The idea of setting up a centre to deal with people whose asylum claims have been conclusively rejected is completely different from the Tory policy to deport anyone who arrived in the country illegally to a new life in Africa - regardless of whether they had genuine asylum cases. The Supreme Court ruled that Rwanda was \"unsafe\". By contrast, The Times newspaper, which first reported this story, suggests Labour are potentially targeting one of the Balkan countries. And they're not alone, with other European governments reportedly looking at plans of their own. But previously the very concept of overseas deportation centres would have been anathema to many in Labour. The Tories smell blood, with shadow home secretary Chris Philp claiming they're admitting cancelling the Rwanda scheme was \"a catastrophic mistake\". There is a whiff of hypocrisy to the idea - of Labour once again aping Tory approaches they disavowed in opposition.  Read more from Sky News:Inside Italy's 'Guantanamo'Why are more people crossing the Channel at weekends?  The prime minister previously argued his policy of \"smashing the gangs\" - with additional counter-terror style powers for police and border force - would be enough of a deterrent to stop the small boats. The legislation introducing those is still going through parliament. But all the while the number of people coming ashore in Kent is only increasing - and his government is under real pressure to take action. This story signals they're willing to consider all options to do so. Promising to learn from Italy's right-wing leader Giorgia Meloni, with her policy to send migrants to Albania, sends a targeted message to voters concerned about migration - even as it alienates the party's more liberal supporters. That plan is also held up in the courts; but the uncompromising message is clear."
    },
    {
        "title": "Bomb squad called in to deal with explosive chemicals in St Leonards as Hastings Half Marathon cancelled",
        "description": "The bomb squad has carried out a controlled burn of explosive chemicals found at a seafront home in Sussex.",
        "url": "https://news.sky.com/story/bomb-squad-carries-out-controlled-burn-of-explosive-chemicals-found-in-st-leonards-home-13333786",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-chemical-sussex-st_6864113.jpg?20250322142727",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-22 14:25:00",
        "Headline": "A 28-year-old man was arrested on Thursday on suspicion of producing illegal substances and making an explosive substance for an unlawful purpose and has been detained under the Mental Health Act.",
        "Content": "The bomb squad has carried out a controlled burn of explosive chemicals found at a seafront home in Sussex. A major incident was declared and 73 people evacuated from their homes after explosives and 500 canisters containing more unknown chemicals were discovered at a house in St Leonards, near Hastings. The additional 500 canisters are not thought to be explosive, although they will be tested by specialists. The Hastings Half Marathon, which was due to take place on Sunday morning, has been cancelled. A 100m cordon has been put in place and it is not known when occupants will be allowed to return home. The race organisers said on Saturday night that with no confirmed time for when the cordon will be lifted or when they could access the course, they had to call off the run. A 28-year-old man was arrested on Thursday on suspicion of producing illegal substances and making an explosive substance for an unlawful purpose. He has been detained under the Mental Health Act while inquiries continue. A spokesman for Sussex Police said \"significant progress\" had been made in making the chemicals safe. \"The Explosive Ordnance Disposal (EOD) team successfully removed the desensitised chemicals from the house and carried out a controlled burn in a skip near the sea wall on Saturday morning. \"Searches by EOD are continuing this morning for any other hazardous materials in the house, to ensure the house is clear of explosive material and the area is safe.\" Read more:Heathrow resumes flights - but passengers still face delaysBaby girl died from brain injuryPolice disciplined over woman found dead in car boot Chief Inspector James Scott said everyone was \"working hard to resolve the incident as swiftly as possible\". \"We appreciate everyone's support and ongoing patience. We know this has been incredibly disruptive,\" he added. \"Investigations are ongoing however, from evidence gathered so far, there is no indication that the 28-year-old man arrested intended to cause harm either to himself of anybody else.\""
    },
    {
        "title": "Former KGB double agent Oleg Gordievsky  whose covert passing of secrets helped avert nuclear war dies aged 86",
        "description": "One of the most important spies of the Cold War, whose covert passing of secrets to Britain helped change the course of history and avert a nuclear war, has died.&#160;",
        "url": "https://news.sky.com/story/former-kgb-double-agent-oleg-gordievsky-dies-aged-86-13333773",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-oleg-gordievsky-kgb-the-inside-story_6864099.jpg?20250322135546",
        "type": "UK",
        "Author": "Bethany Minelle, news reporter",
        "Date Published": "2025-03-22 13:58:00",
        "Headline": "Sentenced to death for treason in his homeland after covertly passing secrets to Britain, Oleg Gordievsky was appointed a Companion of the Order of St Michael and St George by the late Queen - the same honour held by James Bond.",
        "Content": "By Bethany Minelle, news reporter  One of the most important spies of the Cold War, whose covert passing of secrets to Britain helped change the course of history and avert a nuclear war, has died.  Oleg Gordievsky, a former Soviet KGB officer, was 86. He died in Godalming, having lived in England since defecting in 1985. Surrey Police said officers were called to a house in Godalming on 4 March, where an 86-year-old man was found dead. The force said while counterterrorism officers were leading the investigation, \"the death is not currently being treated as suspicious\" and \"there is nothing to suggest any increased risk to members of the public\". Gordievsky was recruited by Britain's MI6 in the early 1970s after becoming disillusioned with the USSR and was the most senior Soviet spy to defect during the Cold War. Using the code-name Hetman, for more than a decade his reports gave Britain invaluable insights into the thinking of the Soviet leadership and KGB. In the early 1980s, his warnings to the West that the Soviets feared a potential surprise NATO nuclear attack prompted then US president Ronald Reagan to dial down his anti-USSR rhetoric. His intelligence was subsequently crucial in guiding Margaret Thatcher in her early contacts with Mikhail Gorbachev, whose ascent to power helped bring the Cold War to a close. In 1985, while head of the KGB residency in London, suspicions he could be a British spy led him to be called to Moscow where he was drugged and interrogated. Realising his life was in danger, and using a long pre-arranged plan, a signal was relayed to his MI6 handlers, and a rescue mission was set into motion. The sign that a rescue was underway was a man walking past him in the street in Moscow carrying a Harrods bag and eating a Mars bar. On 2 August 1985, Raymond Asquith, great-grandson of former Liberal prime minister Herbert Asquith, and Andrew Gibbs, managed to give Soviet surveillance the slip and smuggle their man across the border into Finland hidden in the boot of a car. In his absence, Gordievsky was sentenced to death in Russia for treason. His wife and daughters were kept under 24-hour KGB surveillance for six years before being allowed to join him in England in 1991. He lived the rest of his life under UK protection in Godalming, Surrey, writing a number of books and being received by Mrs Thatcher in Chequers and Mr Reagan in the Oval Office. Read more from Sky News:How George Foreman became a cultural iconWWII veteran, 103, shares his experience as a bombardier In 2007, he was honoured by Queen Elizabeth II, being made a Companion of the Order of Saint Michael and St George (CMG) in a ceremony at Buckingham Palace. It's the same honour held by the fictional spy James Bond. The following year, Gordievsky said he had been poisoned and spent 34 hours in a coma after taking tainted sleeping pills given to him by a Russian business associate. The risks he faced were underscored in 2018 when former Russian intelligence officer Sergei Skripal and his daughter were poisoned with a Soviet-made nerve agent in the English city of Salisbury, where he had been living quietly for years."
    },
    {
        "title": "Ida Lock: Baby girl died from brain injury because midwives failed to provide basic care, coroner rules",
        "description": "A baby girl died from a serious brain injury because midwives failed to provide basic medical care, a coroner has concluded. ",
        "url": "https://news.sky.com/story/ida-lock-baby-girl-died-from-brain-injury-because-midwives-failed-to-provide-basic-care-coroner-rules-13333532",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-sarah-robinson_6863716.jpg?20250321233305",
        "type": "UK",
        "Author": "Laura Bundock, news correspondent",
        "Date Published": "2025-03-22 00:01:00",
        "Headline": "Ryan Lock and Sarah Robinson say they have had to fight for answers after a hospital trust \"put up a huge wall\" following their daughter's death.",
        "Content": "By Laura Bundock, news correspondent   A baby girl died from a serious brain injury because midwives failed to provide basic medical care, a coroner has concluded.  Ida Lock, who lived for just seven days, was born at the Royal Lancaster Infirmary in November 2019 but suffered a brain injury caused by a lack of oxygen. She was transferred to intensive care at Royal Preston Hospital's neonatal unit where she died a week later on 16 November 2019. Ever since her death, Ida's grieving parents, Ryan Lock and Sarah Robinson, have had to fight for answers. Mr Lock said the hospital's trust \"put up a huge wall\" when they tried to find out what had happened. Ms Robinson says she was made to feel like she was to blame. \"It was was awful. It was so tough. My world had shattered, and I couldn't figure out what had gone wrong, what I'd missed.\" \n                  Missing inmate found three days after motorway escape from prison van in Lancashire\n                 \n                  Abusive boyfriend whose partner Kiena Dawes blamed him for her death in suicide note jailed\n                 \n                  Murder arrests after Blackburn man hit by car in bar argument on Christmas Day\n                 An initial investigation carried out by the University Hospitals of Morecambe Bay NHS Trust found no issues with her delivery. However, in April 2020, a report from the independent Healthcare Safety Investigation Branch (HSIB) identified numerous failings in the care of Ida which contributed to her death, the hearing at County Hall, Preston, had previously heard. Ms Robinson says: \"That's the hurt, because that time that we've taken to fight and get these answers. And all along people had these answers, people knew, but they didn't give them to us them.\" Midwives had failed to identify an abnormally slow foetal heart rate after Ms Robinson attended in early labour and then following birth there was ineffective resuscitation, the HSIB concluded. This trust has faced serious criticism in the past. A review into maternity care at Morecambe Bay in 2015 found 11 babies and one mother had died due to poor care. The report's author, Dr Bill Kirkup, gave evidence at the inquest and told Sky News it is \"unforgivable\" lessons have not been learnt. He also chaired an investigation into maternity services in East Kent and found repeated and significant failings. \"These are not problems of isolated units, and it's not a particular rogue unit that we're talking about here. It's a very widespread failure of culture in maternity services,\" said Dr Kirkup. The national maternity inspection programme carried out by the healthcare regulator the Care Quality Commission (CQC) assessed over 130 units. It gave ratings for safety and found 65% rated either \"inadequate\" or \"requires improvement\". Mr Lock believes there must be a change in culture. He said: \"There needs to be more accountability. If people feel they can get away with being deceitful and covering up the truth, then they're going to continue doing that.\" Ms Robinson has since had another baby daughter but says her mental health has suffered. \"It's changed me as a person. Five years on, the anxiety, the stress, it's just constant. No one was open and honest with us. No parent should have to go through that.\" Read more from Sky News:Man 'with horror fixation' dismembered housematePrince William joins UK troops in Challenger 2 tanksTrump announces 'most lethal aircraft ever built' The family scattered Ida's ashes on Morecambe Beach, close to their home. Mr Lock says they often walk along this small stretch of sand which they call \"Ida's beach\". He said: \"She's always going to be in our hearts, and that's what's driven us to continue, to keep going. We owe it to her.\" Delivering a narrative conclusion following the inquest on Friday, HM Senior Coroner for Lancashire, Dr James Adeley, said: \"Ida was a normal child whose death was caused by a lack of oxygen during her delivery that occurred due to the gross failure of the three midwives attending her to provide basic medical care to deliver Ida urgently when it was apparent she was in distress.\" He added her death was contributed to by the lead midwife's \"wholly incompetent\" failure to provide basic neonatal resuscitation for Ida during the first three-and-half minutes of her life, which further contributed to the infant's brain damage. Dr Adeley identified eight missed opportunities by midwives to alter Ida's clinical course."
    },
    {
        "title": "Missing inmate found three days after motorway escape from prison van in Lancashire",
        "description": "An inmate who escaped from a prison van on a motorway has been found after a three-day search.",
        "url": "https://news.sky.com/story/missing-inmate-found-three-days-after-motorway-escape-from-prison-van-in-lancashire-13333942",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jamie-cooper_6861594.jpg?20250322172005",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-22 17:14:00",
        "Headline": "Jamie Cooper escaped from a prison van on the M55 near Preston on Wednesday. His three days on the run were brought to an end in Blackburn on Saturday afternoon.",
        "Content": "An inmate who escaped from a prison van on a motorway has been found after a three-day search. Jamie Cooper, 33, fled from the vehicle on the M55 motorway near Catforth, Preston, as it was travelling to Lancaster Magistrates' Court shortly before 9am on Wednesday, Lancashire Police said in a statement. He was found in Blackburn on Saturday afternoon after officers stopped a car that had travelled from Bolton, the force said. He has been arrested on suspicion of escaping from lawful custody. Read more:Govt considering sending failed asylum seekers to overseas 'hubs'Controlled burn of explosive chemicals carried out at seafront home \"Over the last few days we had asked for your help to find wanted Jamie Cooper who absconded from a prison van on the M55 near Preston,\" Lancashire Police said in a post on Facebook on Saturday afternoon. \"To update you, Cooper, 33, was found in Blackburn this afternoon after a car which had travelled from Bolton, was stopped by officers. \"He was arrested on suspicion of escaping from lawful custody and is now in custody.\" Officers thanked those who shared the appeal to find Cooper."
    },
    {
        "title": "Pope Francis to be discharged from hospital tomorrow as doctors say he was 'in danger of losing his life'",
        "description": "Pope Francis will be discharged from hospital tomorrow after receiving treatment for double pneumonia - but doctors insist he will need at least two months of rest.",
        "url": "https://news.sky.com/story/pope-francis-due-to-appear-in-public-for-first-time-in-five-weeks-13333785",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pope-francis-vatican_6864342.jpg?20250322175352",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 14:25:00",
        "Headline": "The Pope will return to the Vatican on Sunday after five weeks in hospital being treated for double pneumonia. This period has marked the most serious health crisis of his 12-year papacy.",
        "Content": " Pope Francis will be discharged from hospital tomorrow after receiving treatment for double pneumonia - but doctors insist he will need at least two months of rest. The 88-year-old pontiff has been at Gemelli Hospital in Rome for more than five weeks since being admitted for a severe respiratory infection on 14 February. Dr Sergio Alfieri, the head of the team taking care of the Pope, told reporters Francis was \"in danger of losing his life\" during \"very critical episodes\" in his hospital stay. The Pope will return to Santa Marta, his residence in the Vatican, on Sunday, he said. Dr Alfieri said the pontiff was now in a \"stable clinical condition\" but he would continue taking medication \"for quite a long time\". \"It's very important that he follow a period of convalescence and rest for at least two months,\" he added.  The Vatican previously said he would appear from the window of his 10th floor hospital room on Sunday to offer a blessing - which he will do before he is discharged. A photo released by the Vatican last week showed the leader of the Catholic church celebrating Sunday mass in a hospital chapel. The Vatican said in a statement that Pope Francis wanted to come to the hospital window around noon (11am UK time) on Sunday to give a greeting and blessing. One senior cardinal said on Friday it could take time for the Pope to \"relearn to speak\" after using oxygen during his hospital stay. Dr Sergio Alfieri addressed this during Saturday's news conference, pointing out that when someone has double pneumonia \"the lungs are damaged\". \"They [lungs] have been damaged and breathing muscles have been strained. One of the first things that happens is that our voice diminishes... like when you use your voice too much.\" But he insisted that, in time, the voice would return to normal. Read more from Sky News:King and Queen due to meet PopePope records message from hospital Despite the Pope's discharge from hospital, there has been no update about his plans to meet the King and Queen when they make a state visit to the Vatican on 8 April. But doctors said on Saturday they had prescribed two months of convalescence and had advised him against taking any meetings with large groups or that require special effort. This period marks the most serious health crisis of his 12-year papacy and the longest he has been out of public view since his election as pontiff in 2013."
    },
    {
        "title": "'At least six dead' as Israel strikes Lebanon in heaviest exchange of fire in four months",
        "description": "At least six people, including a child, have died in southern Lebanon following Israeli airstrikes, the Lebanese state news agency has reported.",
        "url": "https://news.sky.com/story/at-least-six-dead-as-israel-strikes-lebanon-in-response-to-cross-border-rocket-fire-13333709",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-lebanon-israel-taibeh_6864051.jpg?20250322115217",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 11:03:00",
        "Headline": "Saturday saw the heaviest exchange of fire since a US-brokered truce came into effect last November.",
        "Content": " At least six people, including a child, have died in southern Lebanon following Israeli airstrikes, the Lebanese state news agency has reported. Israeli Prime Minister Benjamin Netanyahu ordered strikes against dozens of \"terrorist\" targets in response to \"rocket fire\" at Israel from Lebanon on Saturday morning. It was the heaviest exchange of fire since a US-brokered truce between Israel and the Lebanese militant group Hezbollah came into effect in November. The Israeli military said it had intercepted three rockets launched from a Lebanese district about four miles north of the border towards the Israeli town of Metula. It is the second time since December that rockets were fired into Israel from Lebanon. Hezbollah denied responsibility for the attack, saying it had \"no link\" to the launches and that it remained committed to the ceasefire. No group has claimed responsibility. The fresh violence has sparked concern about whether the fragile ceasefire could hold. According to Lebanese state news agency NNA, which cited health officials, strikes in the southern village of Touline and coastal city of Tyre have killed six people, including a child, and wounded 18 others, including two children. \n                  Supporters mourn charismatic leader Hassan Nasrallah - with Hezbollah left in crisis\n                 \n                  Exclusive: Iran's warning to US and Israel \n                 \n                  Ceasefire 'victory' looks bleak as Hezbollah bodies exhumed from makeshift mass graves\n                 The Reuters news agency also reports two deaths in the municipality of Bint Jbeil. NNA reported a spate of Israeli airstrikes and artillery barrages in the country's war-battered south, including border towns and hilltops around five miles inside Lebanese territory. The strikes also came a day after Israel said it would carry out operations in Gaza \"with increasing intensity\" until Hamas frees the 59 hostages it holds - 24 of whom are believed alive. Hezbollah began launching rockets, drones and missiles into Israel the day after Hamas's 7 October 2023 attack. The Israel-Hezbollah conflict then broke out into a war last September as Israel carried out massive waves of airstrikes and killed most of the militant group's senior leaders. Read more from Sky News:Israel says Hamas intelligence chief 'eliminated'UN says teachers, doctors and nurses were among staff killed in Israeli strikes The fighting has killed more than 4,000 people in Lebanon and displaced about 60,000 Israelis. Under the ceasefire reached in November, Israeli forces agreed to withdraw from all Lebanese territory by late January. The deadline was extended to 18 February by agreement between Lebanon and Israel. However, since then, Israel has remained in five locations in Lebanon, across from communities in northern Israel, and has carried out dozens of airstrikes on southern and eastern Lebanon, saying it attacked Hezbollah. Lebanon has appealed to the UN to pressure Israel to fully withdraw from the country. Lebanon's Prime Minister Nawaf Salam has asked the Lebanese military to take all necessary measures in the south, but in a statement said the country did not want to return to war. The United Nations Interim Force in Lebanon (UNIFIL) said it was alarmed at the possible escalation of violence and urged all parties to avoid jeopardising the progress made, saying further escalation could have serious consequences for the region."
    },
    {
        "title": "Pilot dies after air show plane crash in South Africa",
        "description": "A pilot has died after his plane spiralled out of control and crashed at an air show in South Africa.",
        "url": "https://news.sky.com/story/pilot-dies-after-air-show-plane-crash-in-south-africa-13334119",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-james-oconnell-pilot_6864529.jpg?20250322213233",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 20:56:00",
        "Headline": "Video shows the plane spinning mid-air before plummeting to the ground. The pilot was \"highly skilled and respected\" and crashed after suddenly losing altitude during the final manoeuvre.",
        "Content": " A pilot has died after his plane spiralled out of control and crashed at an air show in South Africa. The crash happened at the West Coast Air Show in Saldanha, a town about 70 miles (110 km) north of Cape Town, on Saturday. Video footage shows the plane spinning mid-air before plummeting to the ground. In a statement shared on social media, organisers of the show named the pilot as James O'Connell. \"It is with profound sadness that the organisers of the West Coast Airshow confirm a fatal accident involving James O'Connell, a highly skilled and respected test pilot from South Africa,\" the statement said. \"Mr O'Connell was performing a routine display intended to demonstrate the capabilities of the Impala Mark 1 - a beloved warbird with deep historical significance for many South Africans. It was especially a huge moment because the Impala has not been seen performing at air shows for many years. \"The manoeuvres were being executed as part of the official air show programme, witnessed by thousands of spectators. \"Eyewitness accounts report that the aircraft appeared to be under control during most of the display. However, during one of the final manoeuvres, the aircraft experienced a sudden loss of altitude and entered a steep dive before making contact with the ground.\" Organisers said there was no sign the pilot made an attempt to eject. \"Our thoughts and deepest sympathies are with James's family, loved ones, and everyone affected by this very tragic event,\" they added. No other injuries were reported. Elowayne Gouws, the director of West Coast Medical Rescue, told national news site News 24 that medics arrived at the scene within two minutes \"and found the wreckage engulfed in flames\". Read more from Sky News:Former KGB double agent diesUS defence staff could face lie detector tests in probe into leaks The South African Civil Aviation Authority (SACAA) and the South African Air Force's accident unit are investigating the incident. \"There is one confirmed fatality, a pilot on board an Impala aircraft,\" said SACCA head of communication Sisa Majola, national news site Times Live reported. The authority's accident and incident investigations division is working with event safety officers to \"collate preliminary information\", he added. Further updates will be shared when more information is available, organisers of the show said."
    },
    {
        "title": "Starmer expresses 'deep concern' about lack of humanitarian aid in Gaza",
        "description": "Sir Keir Starmer has expressed concern about a lack of humanitarian aid in Gaza during a call with the King of Jordan.",
        "url": "https://news.sky.com/story/starmer-expresses-deep-concern-about-lack-of-humanitarian-aid-in-gaza-13333736",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-food_6859287.jpg?20250317071933",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 12:18:00",
        "Headline": "The prime minister raises his concerns in a phone call with the King of Jordan, Abdullah II, during which the leaders agreed they must continue to urge Israel and Hamas to return to a ceasefire.",
        "Content": "Sir Keir Starmer has expressed concern about a lack of humanitarian aid in Gaza during a call with the King of Jordan. Sir Keir spoke to the King of Jordan, Abdullah II, on Saturday morning, after which a Downing Street spokesperson said: \"The prime minister expressed his deep concern about the renewed Israeli military action in Gaza and the lack of humanitarian aid.\" Israel cut off the supply of food, fuel, and humanitarian aid to Gaza's roughly two million Palestinians, aiming to pressure Hamas to accept a new proposal ahead of a second phase of ceasefire. The proposal would require Hamas to release half its remaining hostages - the militant group's main bargaining chip - in exchange for a ceasefire extension, but makes no mention of releasing more Palestinian prisoners. Israel's decision to withhold aid was widely criticised, with Hamas accusing Israel of trying to cause famine in Gaza, and the head of the UN Palestinian relief agency (UNRWA) warning the territory will experience another hunger crisis if Israel continues with the strategy. Sir Keir also thanked Jordan's king for his country's work towards a political solution, with the leaders agreeing they must continue to urge both sides to return to a ceasefire. After two months of ceasefire, Israeli attacks have returned to Gaza, with a British doctor telling the Associated Press about his efforts to save \"child after child\". Sakib Rokafiya, a visiting British doctor, said he watched from the balcony of a hospital in Khan Younis as missiles lit up the night sky early on Tuesday. He said the Nasser Hospital - the largest hospital in southern Gaza - was running short on antibiotics and other essentials, a common plight in medical facilities in the war-torn territory. Dr Rokafiya told AP he saw multiple victims brought into the hospital after strikes resumed. He said: \"Just child after child, young patient after young patient. The vast, vast majority were women, children, the elderly.\" He said he wrote notes directly onto patients' skin and added names where he could, but many children were brought in by strangers, their parents dead, wounded or lost. For those, he wrote: \"Unknown.\"  On Friday, Israel said it had \"eliminated\" Hamas's military intelligence chief in southern Gaza. Within hours, the Israel Defence Forces said on X sirens had been activated as a result of projectiles being launched from northern Gaza. \"This is further evidence of Hamas' systematic exploitation of civilians and civilian structures for terrorist activities throughout Gaza,\" the IDF said in a post on the social media platform. Israel resumed airstrikes a few days ago after an extension to the ceasefire that had seen Israeli hostages swapped for Palestinian prisoners could not be agreed. The truce was supposed to continue as long as talks on the second phase continued, but Israeli leader Benjamin Netanyahu refused to enter substantive negotiations. More than 600 people have been killed in Gaza, with hundreds more injured, since Israel relaunched the war earlier this week, Gaza's health ministry said. The Hamas-run ministry does not differentiate between militants and civilians in its death toll. The renewed attacks on Gaza come as Israel said it would respond \"severely\" to an attack from Lebanon which saw rockets fired into northern Israel. Read more on Sky News:Sudan military retakes key buildingsFive guilty of holding French journalists hostageIsrael's hostage protests Th IDF said it \"struck dozens of Hezbollah rocket launchers and a command centre from which Hezbollah terrorists were operating in southern Lebanon a short while ago\". Two people were killed and eight others injured following Israeli airstrikes, the Lebanese health ministry was reported as saying. Meanwhile, in Israel, thousands of protesters have taken to the streets, criticising Prime Minister Benjamin Netanyahu for his handling of the hostage crisis."
    },
    {
        "title": "Protests sweep Turkey as Istanbul mayor - key challenger to Erdogan - appears in court ",
        "description": "Widespread&#160;protests across Turkey have intensified after Istanbul's mayor - a key challenger to President Recep Tayyip Erdogan&#160;- was detained over allegations of corruption and links to terror organisations.",
        "url": "https://news.sky.com/story/fourth-night-of-protests-turkey-after-arrest-of-key-opposition-figure-and-challenger-to-president-erdogan-13333798",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-imamoglu-istanbul_6864553.jpg?20250322222813",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 14:50:00",
        "Headline": "Riot police used pepper spray and tear gas against protesters angry about Ekrem Imamoglu's continued arrest. More than 340 people were detained on Friday night but it has not deterred demonstrations, which continued on Saturday.",
        "Content": " Widespread protests across Turkey have intensified after Istanbul's mayor - a key challenger to President Recep Tayyip Erdogan - was detained over allegations of corruption and links to terror organisations. For a fourth night, demonstrators have clashed with police as Ekrem Imamoglu, a popular opposition figure with the Republican People's Party, faced further questioning. The mayor denies any wrongdoing. Many view his detention on Wednesday as a politically driven attempt to remove him from the next presidential race, scheduled for 2028. But government officials reject accusations that legal actions against opposition figures are politically motivated and insist that Turkey's courts operate independently. Police questioned Mr Imamoglu for around five hours on Saturday as part of a terror investigation into allegations of aiding the outlawed Kurdistan Workers' Party, or PKK, the Cumhuriyet newspaper reported. A day earlier he was questioned for four hours over the corruption accusations. He appeared in court on Saturday for the first time since his detention, denying all the allegations against him. Some 90 other people were also questioned by prosecutors. Dozens are prominent figures and include two district mayors. Earlier on Saturday, Mr Erdogan said the government would not tolerate street protests and accused the opposition party of links to corruption and extremist organisations. \"The days of going out into the streets, taking left-wing organisations, extremists, and vandals with you... are now behind us,\" he said. Interior minister Ali Yerlikaya said 343 people had been detained in protests on Friday night, adding: \"There will be no tolerance for those who seek to violate societal order, threaten the people's peace and security, and pursue chaos and provocation.\" Authorities barred access to a courthouse in Istanbul where Mr Imamoglu was being questioned after protestors gathered there, shouting: \"Rights, law, justice!\" Hundreds of police officers and more than a dozen water cannon trucks were deployed. Read more from Sky News:Death after plane crash in South AfricaIsrael strikes southern Lebanon Saturday marked the fourth night of demonstrations, which were largely peaceful. But a group of protesters, trying to break through barricades to reach Istanbul's main square, threw flares, stones and other objects at police who responded with pepper spray. Police used water cannons and tear gas on demonstrators in the capital, Ankara. Images on local TV also showed officers clashing with protestors in the Aegean coastal city of Izmir. Thousands marched in several other cities calling on the government to resign. It marks the largest wave of street demonstrations in Turkey in more than a decade. Mr Imamoglu is expected to be nominated as the Republican People's Party's presidential candidate in a primary on Sunday. The party's leader, Ozgur Ozel, said that the primary, in which around 1.5 million delegates can vote, will go ahead as planned."
    },
    {
        "title": "Russian drone attack on Ukrainian city of Zaporizhzhia kills three family members and injures 12 people",
        "description": "A mother, father and daughter have been killed and 12 people injured in a Russian drone attack on the Ukrainian city of Zaporizhzhia, Ukrainian officials said.",
        "url": "https://news.sky.com/story/russian-drone-attack-on-ukrainian-city-of-zaporizhzhia-kills-three-family-members-and-injures-12-people-13333735",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ukraine-zaporizhzhia_6864082.jpg?20250322133016",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 12:16:00",
        "Headline": "The drone attack came after Ukraine and Russia earlier this week agreed in principle to a limited ceasefire after US President Donald Trump spoke with the countries' leaders.",
        "Content": " A mother, father and daughter have been killed and 12 people injured in a Russian drone attack on the Ukrainian city of Zaporizhzhia, Ukrainian officials said. Zaporizhzhia was hit by 12 drones on Friday night despite Ukraine and Russia agreeing in principle to a limited ceasefire earlier this week. Regional head Ivan Fedorov said buildings and cars went up in flames, with those killed from the same family. The bodies of the daughter and father were pulled out from under the rubble while doctors unsuccessfully fought for the mother's life for more than 10 hours, Mr Fedorov wrote on the Telegram messaging app. The incident comes after Ukraine and Russia agreed in principle to a limited ceasefire after US President Donald Trump spoke with the countries' leaders. However, it remains to be seen what possible targets would be off limits to attack, with the three sides appearing to hold starkly different views about what the deal covered. While the White House said \"energy and infrastructure\" would be part of the agreement, the Kremlin declared that it referred more narrowly to \"energy infrastructure\". Ukrainian President Volodymyr Zelenskyy said he would also like railways and ports to be protected. Further details are expected to be discussed with the US negotiators on Monday. The Ukrainian air force reported that Russia fired a total of 179 drones and decoys in the latest wave of attacks overnight into Saturday. It said 100 were intercepted and another 63 lost, likely having been electronically jammed. Officials in the Kyiv and Dnipropetrovsk regions also reported fires breaking out due to the falling debris from intercepted drones. Read more from Sky News:What infrastructure could be part of ceasefire deal?'Two killed and eight injured' as Israel strikes Lebanon Russia's Ministry of Defence said its own air defence systems shot down 47 Ukrainian drones. Russia and Ukraine on Friday accused each other of blowing up a Russian gas pumping station in a border area where Ukrainian troops have been retreating. On Saturday, the Russian Foreign Ministry said it reserves the right to a \"symmetrical response\" to alleged Ukrainian attacks. \"As in 2022, provocations are being used again with the aim of disrupting the negotiation process. \"We are clearly warning that if the Kyiv regime continues its destructive line, the Russian Federation reserves the right to respond, including with a symmetrical response,\" the ministry said. Meanwhile, Mr Zelenskyy has visited the Donetsk region, where he met commanders of drone units near the strategic eastern city of Pokrovsk. Ukrainian troops have for months been fending off Russian assaults around the city, where Moscow's forces have been slowly advancing in an attempt to capture the entire region. Mr Zelenskyy posted on X: \"I received a report on the defence of the Pokrovsk direction, the operational situation, and the progress of the missions. I honoured our warriors with state awards.\""
    },
    {
        "title": "Heathrow resumes flights amid internal review, 'urgent' govt investigation and further delays",
        "description": "Heathrow was in full operation on Saturday, having been shut over a loss of power for 16 hours on Friday - but some passengers have continued to face disruption. ",
        "url": "https://news.sky.com/story/heathrow-resumes-flights-and-hopes-for-full-day-of-service-but-passengers-face-further-delays-13333554",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport_6863719.jpg?20250322110056",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-22 03:35:00",
        "Headline": "Aftershocks were still felt by some passengers on Saturday, with flight boards regularly showing some cancellations and delays. Heathrow has announced an internal review, while the government ordered an \"urgent investigation\". ",
        "Content": " Heathrow was in full operation on Saturday, having been shut over a loss of power for 16 hours on Friday - but some passengers have continued to face disruption.  On Saturday morning, a Heathrow spokesperson said the airport was \"open and fully operational\" but warned passengers to still check with their airline before travelling. It came after a fire at a nearby electrical substation late on Thursday night triggered a \"significant power outage\" on Friday, leading to more than 1,000 flights being cancelled and disrupting the travel plans of as many as 290,000 passengers at Europe's busiest airport. Follow updates on Heathrow shutdown aftermath Aftershocks were still felt by some passengers on Saturday, with flight boards regularly showing some cancellations and delays. That was despite extra staff being drafted in and more flights added \"to facilitate an extra 10,000 passengers\".  Police have said the cause of the fire is believed to be non-suspicious, while London Fire Brigade (LFB) said its investigation was focusing on electrical distribution equipment. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected\n                 \n                  Heathrow shutdown: Cost of airport closure could be worth millions\n                 The government has ordered an \"urgent\" investigation into what happened. Energy Secretary Ed Miliband instructed the National Energy System Operator (NESO) to look into the incident \"so that it's prevented from ever happening again\". Heathrow boss Thomas Woldbye said the airport welcomed the independent investigation and would support \"every effort to understand the causes and impacts\" of the incident. \"We are committed to working closely with all stakeholders to ensure a thorough investigation to help strengthen the airport's future resilience,\" he said in a statement on Saturday afternoon.  The airport also announced it will launch an internal review led by Ruth Kelly, former transport secretary and an independent member of Heathrow's board. Its chairman Lord Paul Deighton said in a statement: \"Closing the airport yesterday had significant impacts for our passengers, our customers, our colleagues and the country. \"Heathrow regrets the disruption this caused. We hope that all those affected understand that the decision was made in order to prioritise the safety of our passengers and colleagues. \"We are committed to finding any potential learnings from this unprecedented incident.\"  Passengers still facing disruption Passengers continued to share their frustrations with Sky News on Saturday over their experiences with delays and cancellations, which were expected to go on until at least the end of the weekend. One was in a taxi bound for Heathrow when she found out the airport was closed.  Ray had been going to see family in Algeria to celebrate Ramadan and Eid and had travelled down from Manchester via train at 7am and hadn't checked the news - so arrived in London unaware of any issues. \"I noticed the underground was disrupted, so I took a taxi there,\" she told Anna Jones on Sky News Breakfast. \"As I was in the taxi, I found out the news that Heathrow was closed, so I had to stop the taxi driver in the middle of the trip. I wasn't sure what to do.\" She called her dad, who was in the process of driving for four hours to Algiers airport to pick her up. When she called the airline, \"they were not very optimistic about being able to reschedule\" as all the next flights were full, and all the direct flights to Algeria from the UK went via Heathrow. She said she was looking for an alternative way to get to Algeria via mainland Europe, but added the flights were \"very, very expensive\".  Another passenger, John Climpson, was meant to fly out to the north of Sweden from Heathrow on Friday morning before competing in a 240km husky sledding challenge in the Arctic Circle. But his flight was cancelled, meaning he had to wait to catch a flight from Heathrow to Stockholm on Saturday night, staying there overnight and then flying to Kiruna, the furthest north city in Sweden, on Sunday morning. He said he and his team would arrive two days later than planned, meaning \"all of our training time has disappeared and we are going to have to go straight into [the] 240km husky sledding challenge immediately, otherwise we won't make it in time\". He added Heathrow's Terminal 2 was \"probably the quietest\" he had ever seen it. In a statement, transport secretary Heidi Alexander warned those planning to fly over the next few days that \"some disruption\" is expected to continue as \"things get back to normal\". She urged anyone travelling to check with their airlines and plan their journeys.  British Airways says 90% of its flights went ahead British Airways - Heathrow's biggest airline - said 90% of its scheduled flights went ahead on Saturday, which was above its expectations of about 85%. In a statement on X, it said \"the vast majority of our customers were able to get to where they needed to be despite the very challenging circumstances going into the start of the day\". \"As things stand, we're anticipating being able to run a near-full schedule on Sunday and would therefore ask customers to come to the airport as normal unless we get in touch to tell them otherwise,\" it said. Read more:Heathrow shutdown is embarrassing at bestHow Heathrow closure ruined travel plans'Nightmare' Heathrow shutdown in numbersHow much could Heathrow closure cost UK economy? The airline added it was \"really grateful to our customers for bearing with us over the past couple of days, even though many of them have had their travel plans unacceptably cancelled or disrupted\" and thanked its employees for working \"so hard to support customers and help get our operation back on track\". Virgin Atlantic, another prominent airline at Heathrow, said on Saturday evening its operation had \"fully stabilised\" after a \"significant impact\" to its schedule over the past two days. \"We are still working to ensure all those impacted can complete their journeys as quickly as possible and we expect to run our full flying schedule on Sunday 23 March,\" it added. \"We're incredibly sorry for any disruption to our customers' journeys,\" the airline said in an earlier statement. Flight delayed or cancelled? What are your rights? Heathrow CEO Thomas Woldbye also apologised to passengers whose journeys had been disrupted, describing the delays \"as big as it gets for our airport\" and admitting \"we cannot guard ourselves 100%\". However, he stressed the airport would not have shut unless there were \"severe safety concerns\". He said a back-up transformer had failed, meaning systems had to be closed in line with safety procedures so power could be restructured from two remaining substations. A National Grid spokesperson said teams had been working tirelessly to get the situation back under control: \"Power supplies have been restored to all customers, including Heathrow, allowing operations to resume at Heathrow.  \"We are deeply sorry for the disruption caused and are continuing to work closely with the government, Heathrow and the police to understand the cause of the incident.\" 👉 Listen to Sky News Daily on your podcast app 👈 The disruption began late on Thursday night when fire crews were called to a blaze in Hayes, west London, at the electricity substation serving Heathrow and local properties. LFB deputy commissioner Jonathan Smith told reporters that the fire involved a transformer - a key part of the substation - with 25,000 litres of cooling oil \"fully alight\". Pictures from the scene showed large flames and plumes of thick black smoke, with around 70 firefighters and 10 engines working to extinguish the blaze. Crews evacuated 29 people from neighbouring properties but there were no casualties. In all, 67,000 households were left without power after the fire at the substation, but all supplies were restored by 2pm on Friday. You can share your story, pictures or video with us using our app, private messaging or email. \n\n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material."
    },
    {
        "title": "US heavyweight boxing legend George Foreman dies age 76",
        "description": "US heavyweight boxing legend George Foreman has died age 76.",
        "url": "https://news.sky.com/story/us-boxing-legend-george-foreman-dies-age-76-13333548",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-george-foreman_6863793.jpg?20250322043623",
        "type": "US",
        "Author": "Dan Cairns, news reporter",
        "Date Published": "2025-03-22 02:01:00",
        "Headline": "The ring icon regained his world title 20 years after a shock loss to Muhammad Ali and fought some of the biggest names of his era. He also had a colourful life away from boxing, making millions from kitchen appliances, becoming a minister and having 12 children.",
        "Content": "By Dan Cairns, news reporter   US heavyweight boxing legend George Foreman has died age 76. The two-time champion fought Muhammad Ali in one of the sport's most legendary fights, the 'Rumble in the Jungle', in the Democratic Republic of the Congo, then known as Zaire. Foreman was also known for putting his name to a popular range of electric grills. A statement on his Instagram account said he died peacefully on Friday \"surrounded by loved ones\" after an \"extraordinary life\". His family said \"our hearts are broken\". They called him \"a devout preacher, a devoted husband, a loving father, and a proud grand and great grandfather\" - and said he lived with \"unwavering faith, humility, and purpose\".  President Donald Trump posted a tribute on X, saying he had known the sportsman well. He wrote: \"George Foreman is dead. What a GREAT FIGHTER!!! He had, without question, the heaviest and biggest punch in the history of boxing. With the exception of Ali, when you got hit, you went down. He was something really Special, but above all, he was a Great Person, with a personality that was bigger than life.\"  Speaking to Sky News's Sam Washington, former heavyweight world champion David Haye called Foreman \"one of the greatest to ever do it\". Praising his \"perseverance\" as a fighter, the British star said Foreman did \"the unthinkable\" becoming the oldest champion in history in 1994, two decades after his famous Rumble in the Jungle with Muhammad Ali. Calling him a \"magnificent human being both inside and outside the ring\", Haye praised Foreman's \"thunderous right and left uppercuts\", adding: \"I would not have wanted to be behind one of George Foreman's punches\". Mike Tyson said on X that his \"contribution to boxing and beyond will never be forgotten\". Sharing a photo of Foreman in his youth alongside a similar image in his later years, another boxer, Chris Eubank Jr, wrote: \"Rest in Peace to one of my boxing heroes - The Legendary George Foreman.\" Former NBA basketball star Earvin \"Magic\" Johnson called Foreman one of his \"boxing heroes\", going on to call him \"a knockout artist in the ring,\" and that \"it was a pleasure getting to know him not only as a boxer but as a man\". Mentioning the product now so associated with his name, Johnson went on: \"After leaving the ring, he turned into an amazing businessman - I even bought one of the first George Foreman grills! Cookie and I will be praying for his family during this time.\" Foreman was considered virtually unbeatable in the famous 1974 fight in DR Congo. Ali, then 32, was trying to return to the top against his fearsome, undefeated opponent - just 25 at the time. Despite being a huge underdog, Ali's 'rope-a-dope' tactics of soaking up Foreman's attacks wore out the brutal puncher and he regained the title. Read more: Analysis - How Foreman became a cultural icon  Believed to be one of the most-watched sports events ever, a documentary about the fight, When We Were Kings, won an Oscar in 1996. Foreman was devastated by the loss, but 20 years later staged his own miraculous comeback - knocking out Michael Moorer to become the oldest-ever heavyweight champion at the age of 45. Outside the ring, his transformation from a brooding boxer to a jovial, TV-friendly personality helped make him a fortune with his range of grills in the 1990s. The boxer known to fans as 'Big George' was born in Marshall, Texas, on 10 January 1949. He and his six siblings were raised by a single mother. Foreman dropped out of school and got mixed up in street robberies, but left Texas at 16 and was encouraged to direct his energy into boxing. Just three years later, in his 25th amateur bout, he won gold at the 1968 Olympics in Mexico City. Foreman turned pro and reeled off 37 wins before demolishing the undefeated Joe Frazier in two rounds to become heavyweight champion for the first time in 1973. Crushed by his shock loss to Ali a few fights later, he took a year off before stepping inside the ring again. But after a second career defeat in 1977 - and what he described as a near-death experience in the dressing room - he stopped fighting. He became a born-again Christian and ordained minister. However, 'Big George' was back inside the ropes a decade later. Trimming down his physique along the way, he won 24 fights in a row before losing on points to Evander Holyfield in 1991. Foreman wasn't done though - and his long road back was finally complete in Las Vegas three years later. Wearing the same red shorts from the Ali fight and behind on the scorecards, he knocked out Michael Moorer, 19 years his junior, to win the IBF and WBA titles. Read more from Sky News:Trump announces 'most lethal aircraft ever'Israel says Hamas intelligence chief 'eliminated' Foreman's 20-year gap between world titles was a record - and he retired for good in 1997 with a record of 76 wins and five losses. He was married five times and had five sons - all called George - and seven daughters."
    },
    {
        "title": "George Foreman: From fighting in ring to fighting fat in kitchen - how boxing legend became cultural icon",
        "description": "The iconic fight that devastated and defined George Foreman became the making of his reinvention.",
        "url": "https://news.sky.com/story/george-foreman-from-fighting-in-ring-to-fighting-fat-in-kitchen-how-boxing-legend-became-cultural-icon-13333747",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-george-foreman-boxer_6863728.jpg?20250322021135",
        "type": "US",
        "Author": "Rob Harris",
        "Date Published": "2025-03-22 13:12:00",
        "Headline": "After losing to Muhammad Ali in the 1974 Rumble in the Jungle, George Foreman's resentment was eventually replaced with admiration for Ali, connected by a bout for the ages.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The iconic fight that devastated and defined George Foreman became the making of his reinvention. The Rumble in the Jungle not only saw Muhammad Ali reclaim the world heavyweight belt but diminished his previously unbeaten rival's aura of invincibility. So, synonymous with a bruising setback, there was resentment to shake off - deepened by taunts as brutal as the punches. \"Is that all you got George?\" Ali said, wearing down Foreman with rope-a-dope tactics. The withering put-downs and punching ferocity that night in Kinshasa in 1974 engrossed and connected an analogue world. But when you are the loser in one of the greatest sporting contests in history there are constant reminders of hitting the canvas for the first time. \"It was real painful to watch,\" Foreman told Sky News in 2023. \"Then I'd watch it because I started teaching other boxers about boxing techniques.\" \n                  Olympic boxer who won refugee team's first-ever medal turns pro after UK citizenship rejection\n                 \n                  Tyson Fury: What is the meaning behind boxing star's cryptic Dick Turpin retirement message?\n                 \n                  Mike Tyson reveals he 'almost died' ahead of fight with YouTuber-turned-boxer Jake Paul\n                 And the resentment and enmity was eventually replaced with admiration for Ali - connected by a bout for the ages. Their legacies intertwined. \"It became something that I had in common with the great Muhammad Ali, we became the best of friends,\" Foreman said. Read more: US boxing legend dies aged 76 It was Ali who urged Foreman to come out of a retirement that produced the first reinvention - becoming an ordained minister. \"I'm a preacher now and am not coming back,\" Foreman recalled telling Ali. The response evoked Foreman's religious awakening: \"Remember what David did to Goliath? You can come back and fight for God.\" Camaraderie grew from the rivalry, but Foreman waited until Ali's retirement to make his comeback in 1987 after a decade away. Setting a template for celebrity endorsements Inspired, at 45, to reclaim belts, Foreman in 1994 floored Michael Moorer - almost two decades his junior - to become the oldest world heavyweight champion. It was the launchpad for another reinvention as an entrepreneur by lending his name to what became a household staple - the George Foreman Grill.  For many the first reaction to his death might not be thinking of those epic bouts but the man who went from fighting in the ring to fighting fat in the kitchen. It set a template for successful and lucrative celebrity product endorsements. The grill generated more than $200m for Foreman - a fortune far eclipsing those from fighting. A fighter with self-deprecating humour A life that began in the segregated American South and took Foreman to Olympic gold in 1968 and heavyweight titles, ended with George Foreman remembered as much as a cultural icon as a boxer. The self-deprecating humour showcased in acting and adverts showed how the decades eased the agony of his Rumble in the Jungle humbling. His fun side was demonstrated in his Sky News interview in 2023, invoking - when asked about the grill - how all five of his boys are named George. He chuckled: \"How many of them do I own? You know because George doesn't like meat so he has to have his private grill but George loves hot dogs and then George loves hamburgers you got all these Georges for all of these grills, it gets out of hand.\""
    },
    {
        "title": "US defence staff could face lie detector tests in probe into leaks after Musk Pentagon visit",
        "description": "US defence department workers could face lie detector tests as the Pentagon investigates alleged leaks of national security information.",
        "url": "https://news.sky.com/story/us-defence-staff-could-face-lie-detector-tests-in-probe-into-leaks-after-musk-pentagon-visit-13333870",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-elon-musk_6864240.jpg?20250322163809",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-22 16:13:00",
        "Headline": "A memo calling for an investigation into potential leaks from the Pentagon came after Donald Trump was forced to reject a report he was briefing tech billionaire Elon Musk on plans about how the US would fight a hypothetical war with China.",
        "Content": " US defence department workers could face lie detector tests as the Pentagon investigates alleged leaks of national security information. The department's intelligence and law enforcement arms are carrying out the inquiry, which is the latest by Donald Trump's administration. In a memo sent late on Friday, defence secretary Pete Hegseth's chief of staff called for an investigation into \"unauthorised disclosures of national security information\" that could include polygraph tests. Details of the alleged leaks were not included in the memo. Earlier in the day, Mr Trump was forced to reject reports that Elon Musk would be briefed on US military plans for fighting a hypothetical war with China. Mr Musk, who is head of the Department of Government Efficiency (DOGE) advisory group, visited the Pentagon on Friday to talk about \"efficiencies\" and \"innovations\", Mr Hegseth said. Ahead of the meeting, the New York Times reported the tech billionaire would be briefed on plans for how the US would plan for a potential war with China - but this was denied by both Mr Musk and the president. Mr Musk called the report \"pure propaganda\" and urged legal action against anyone leaking information. The memo calling for an investigation said if it revealed information \"identifying a party responsible for an unauthorised disclosure\", that information could be used to seek criminal prosecution. Speaking at the White House after the meeting, Mr Trump said he did not want to show US plans for a potential war with China to anybody and hinted at Mr Musk's potential conflict of interest. \"Elon has businesses in China, and he would be susceptible, perhaps, to that,\" the president said. Read more:Trump announces 'most lethal aircraft ever built'Conor McGregor says he wants to be Ireland's next president 👉 Follow Trump 100 on your podcast app 👈 A New York Times spokesperson said leak investigations are \"meant to chill communications between journalists and their sources and undermine the ability of a free press to bring out vital information that may otherwise be hidden\". Earlier this month, homeland security secretary Kristi Noem pledged to step up lie detector tests on employees in an effort to identify those who may be leaking information about operations to the media. While polygraph exams are typically not admissible in court proceedings, they are frequently used by federal law enforcement agencies and for national security clearances."
    },
    {
        "title": "Trump 100 Day 62: Why was Elon Musk at the Pentagon?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-62-why-was-elon-musk-at-the-pentagon-13333478",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-22 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   Department of Government Efficiency head and business owner Elon Musk visited the Pentagon on Friday, which according to defence secretary Pete Hegseth was to talk about \"efficiencies\" and \"innovations\".  It was not, as President Trump insisted, to brief Musk on the US military's plan for any theoretical war that might break out with China. On day 62 of the Trump presidency, US correspondents James Matthews and Martha Kelner discuss why Musk was at the Pentagon, and if his work presents a conflict of interest for the administration. Plus, James has been to the John F Kennedy Center for the Performing Arts in Washington DC, where there's a new self-appointed chairman - Donald Trump - and the artists aren't happy. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk. Help us understand more about our listeners by taking our survey! 👉 This form 👈 should only take a few minutes to complete, and Sky anonymises the responses as much as possible. Thank you. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Man who claimed weedkiller caused cancer awarded $2.1bn by US jury",
        "description": "A man who claimed a weedkiller caused his cancer has been&#160;awarded about $2.1bn (&#163;1.6bn) in compensation and damages by a US jury.&#160;",
        "url": "https://news.sky.com/story/man-who-claimed-weedkiller-caused-cancer-gets-21bn-payout-13333847",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-roundup-bayer-glyphosate_6864269.jpg?20250322170120",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-22 15:51:00",
        "Headline": "Bayer says it disagrees with the verdict and plans to appeal. But the German pharmaceutical and biotechnology group faces more than 60,000 further cases related to the active ingredient glyphosate.",
        "Content": "A man who claimed a weedkiller caused his cancer has been awarded about $2.1bn (£1.6bn) in compensation and damages by a US jury.  The verdict is one of the largest legal settlements issued against Bayer's Roundup product. Bayer has said it will appeal the verdict. The world's largest maker of seeds and pesticides has paid about $10bn (£7.7bn) to settle disputed claims that one of its active ingredients, glyphosate, causes cancer. The company insists the chemical is safe if used properly and denies it causes cancer. The Georgia verdict includes $65m (£50m) in compensatory damages and $2bn (£1.5bn) in punitive damages, according to a statement by the plaintiff's law firms seen by the Reuters news agency. Roundup is used widely in the UK and Europe to control weeds although some consumer versions no longer contain glyphosate. Other Roundup products, designed for contractors and landscapers, often still include glyphosate. More than 60,000 further cases are pending for Bayer, which has set aside $5.9bn (£4.5bn) in legal provisions. The German pharmaceutical and biotechnology group acquired Roundup as part of its $63bn (£48bn) takeover of US agrochemical company Monsanto in 2018. Bayer said in a statement it disagreed with the jury's verdict, saying it conflicted with the overwhelming weight of scientific evidence and the consensus of regulatory bodies and their scientific assessments worldwide. \"We believe that we have strong arguments on appeal to get this verdict overturned and the excessive and unconstitutional damage awards eliminated or reduced,\" it said. It added that damages in cases that have reached final judgements have been reduced by 90% overall compared with the original jury awards. Read more from Sky News:Weedkiller found in sperm samplesBayer settles Roundup claims The question of whether glyphosate is carcinogenic is disputed within the scientific community. But environmental groups argue the chemical is harmful to other wildlife, kills beneficial organisms in the soil and some weeds have become resistant to it. The EU Commission has decided to renew glyphosate's licence for use in the EU to December 2033. The UK is also expected to extend the current licence when it expires in December 2025. This month Bayer said it welcomed a new law about to be passed in Georgia to better protect the maker of crop protection chemicals against glyphosate litigation. The company told Reuters that the law has yet to be signed by Georgia's governor and that Bayer is hoping that more US states would follow Georgia's example."
    },
    {
        "title": "Harrods proposes six-figure payouts to victims of al Fayed abuse",
        "description": "Lawyers for Harrods are proposing six-figure payouts to settle claims brought by sexual abuse victims of the London department store's former owner, Mohamed al Fayed.",
        "url": "https://news.sky.com/story/harrods-proposes-six-figure-payouts-to-victims-of-fayed-abuse-13333651",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mohamed-al-fayed-harrods_6863855.jpg?20250322073310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-22 08:46:00",
        "Headline": "The London department store is close to finalising compensation payments potentially worth more than £300,000 to those who endured sexual abuse by its former owner, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lawyers for Harrods are proposing six-figure payouts to settle claims brought by sexual abuse victims of the London department store's former owner, Mohamed al Fayed. Sky News has learnt that MPL Legal, which is coordinating a redress scheme on behalf of the world-famous retailer, has told potential claimants that they could be eligible for general damages lump sums of up to £110,000 or £200,000, depending upon claimants' willingness to submit to a psychiatric assessment arranged by the company. A document seen by Sky News suggests that victims of Mr al Fayed who choose a \"non-medical pathway\" would be eligible for \"general damages limited to compensation for sexual assault of up to £110,000\", with \"aggravated damages [of] up to £15,000\", and \"wrongful testing fixed payment(s) up to £7,500\". Claimants who agree to an assessment by a scheme consultant psychiatrist - referred to in the document as the \"medical pathway\" - would be eligible for general damages of up to £200,000, further payments equivalent to those potentially awarded to non-medical claimants, as well as treatment costs \"past and future supported by the medical report\" and a \"work impact payment capped at £110,000\". The \"wrongful testing\" payments refer to women who were forced to undergo unnecessary and intrusive medical examinations demanded by Mr al Fayed, while the \"work impact payments\" relate to loss of earnings triggered by, for example, the unjustified termination of victims' employment at Harrods. The draft terms raise the prospect that some of the former Harrods owner's victims could receive payments of more than £300,000. However, the decision to impose a further psychiatric assessment in order to access the largest sums available under the scheme may anger claimants who have already endured years of psychological trauma after being abused by Mr al Fayed. \n                  Former Harrods employee accuses Mohamed al Fayed and his brother Salah of assaulting her in 1990s\n                 \n                  Investigation into Met Police's handling of some Mohamed al Fayed allegations\n                 \n                  Mohamed al Fayed: Police investigating 'more than five' people who may have 'enabled' alleged abuse of women and girls\n                 Those who opt to pursue the \"medical pathway\" nevertheless face a protracted wait to receive their payouts. The MLP document said it would take up to six months to produce a medical report, after which a claimant would have 21 days to submit questions relating to it. An offer of compensation would then be made within 35 days, it said, after which a claimant could accept the offer, appeal to an Independent Appeals Panel or leave the scheme and pursue an alternative form of redress. The proposed terms are understood to be preliminary and subject to ongoing consultation, and will not be concluded until the end of this month, according to sources close to the process. If the scheme is finalised along lines similar to those being consulted on, it would likely result in a total compensation bill for Harrods running to tens of millions of pounds. The final cost of compensating victims of a man now regarded as one of Britain's most notorious sex offenders will, though, be unclear until the number of claimants and their decisions about which compensation route to pursue have been determined. Responding to an enquiry from Sky News this weekend, a Harrods spokesperson said: \"It would be premature for us to comment on the nature and details of a scheme that is currently under consultation. \"We are actively inviting the valuable input from Survivors and their legal representatives to establish the final scheme that aims to be survivor-first, trauma-informed, and fair in its approach to compensation. \"Further updates will be provided once the consultation period is complete.\" Details are, however, expected to be finalised in the coming days. Read more: A timeline of al Fayed sex abuse claims According to a document published on a website set up by MPL Legal for the purposes of administering the redress scheme, \"Harrods and MPL Legal are undertaking a period of consultation regarding the compensation scheme in which we will receive detailed feedback from interested parties, including several legal firms representing survivors, leading Counsel and Dame Jasvinder [Sanghera], the Independent Survivor Advocate\". \"It is anticipated the final compensation scheme will be published and survivors will be able to access application forms from 31 March 2025.\" Mr al Fayed, who died in 2023, owned Harrods for 25 years, selling it in 2010 to Qatar Holding, one of the Gulf state's sovereign wealth funds, for £1.5bn.  His reign of terror at the Knightsbridge store is thought to have involved hundreds of predominantly young female victims, with former Fulham women's players also alleging sexual abuse by the billionaire Egyptian. Mr al Fayed also owned Fulham Football Club for a number of years. The MPL Legal document seen by Sky News said the redress scheme would \"provide options for survivors - an alternative route to the court process\", and that it would \"hopefully avoid an adversarial approach which also risks retraumatising survivors\". It added that the scheme would be \"as inclusive as possible - we want the scheme to work for as many survivors as we can\". Under the heading \"Scheme principles\", MPL said it represented \"an alternative to litigation, but a survivor can leave the scheme at any time and pursue the claim through the court system\". It said it hoped that law firms engaging with the scheme \"will ensure survivors receive 100% of the compensation\". \"The level of compensation available through the scheme has been designed to mirror the court's approach,\" it added. Read more:'I had to barricade myself in bedroom during work trip', accuser saysEx-flight attendant says she was sacked for refusing to sleep with al Fayed It also said there were \"certain classifications of cases which may not be suitable for the scheme, for example if a survivor wishes to claim a full loss of earnings\". Last October, lawyers acting for victims of Mr al Fayed said they had received more than 420 enquiries about potential claims, although it is unclear how many more have come forward in the six months since. In a section headed \"Eligibility\", MPL Legal said Harrods \"retains discretion to review eligibility on a case by case basis\".  The date of the MPL Legal document's creation was unclear on Saturday, but one legal source said it had been produced \"recently\"."
    },
    {
        "title": "Heathrow resumes flights amid internal review, 'urgent' govt investigation and further delays",
        "description": "Heathrow was in full operation on Saturday, having been shut over a loss of power for 16 hours on Friday - but some passengers have continued to face disruption. ",
        "url": "https://news.sky.com/story/heathrow-resumes-flights-and-hopes-for-full-day-of-service-but-passengers-face-further-delays-13333554",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport_6863719.jpg?20250322110056",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-22 03:35:00",
        "Headline": "Aftershocks were still felt by some passengers on Saturday, with flight boards regularly showing some cancellations and delays. Heathrow has announced an internal review, while the government ordered an \"urgent investigation\". ",
        "Content": " Heathrow was in full operation on Saturday, having been shut over a loss of power for 16 hours on Friday - but some passengers have continued to face disruption.  On Saturday morning, a Heathrow spokesperson said the airport was \"open and fully operational\" but warned passengers to still check with their airline before travelling. It came after a fire at a nearby electrical substation late on Thursday night triggered a \"significant power outage\" on Friday, leading to more than 1,000 flights being cancelled and disrupting the travel plans of as many as 290,000 passengers at Europe's busiest airport. Follow updates on Heathrow shutdown aftermath Aftershocks were still felt by some passengers on Saturday, with flight boards regularly showing some cancellations and delays. That was despite extra staff being drafted in and more flights added \"to facilitate an extra 10,000 passengers\".  Police have said the cause of the fire is believed to be non-suspicious, while London Fire Brigade (LFB) said its investigation was focusing on electrical distribution equipment. \n                  Chaos in the skies: 'Nightmare' Heathrow shutdown in numbers\n                 \n                  Heathrow closure throws travel plans into chaos - as weddings, rugby tours and Arctic Circle trips affected\n                 \n                  Heathrow shutdown: Cost of airport closure could be worth millions\n                 The government has ordered an \"urgent\" investigation into what happened. Energy Secretary Ed Miliband instructed the National Energy System Operator (NESO) to look into the incident \"so that it's prevented from ever happening again\". Heathrow boss Thomas Woldbye said the airport welcomed the independent investigation and would support \"every effort to understand the causes and impacts\" of the incident. \"We are committed to working closely with all stakeholders to ensure a thorough investigation to help strengthen the airport's future resilience,\" he said in a statement on Saturday afternoon.  The airport also announced it will launch an internal review led by Ruth Kelly, former transport secretary and an independent member of Heathrow's board. Its chairman Lord Paul Deighton said in a statement: \"Closing the airport yesterday had significant impacts for our passengers, our customers, our colleagues and the country. \"Heathrow regrets the disruption this caused. We hope that all those affected understand that the decision was made in order to prioritise the safety of our passengers and colleagues. \"We are committed to finding any potential learnings from this unprecedented incident.\"  Passengers still facing disruption Passengers continued to share their frustrations with Sky News on Saturday over their experiences with delays and cancellations, which were expected to go on until at least the end of the weekend. One was in a taxi bound for Heathrow when she found out the airport was closed.  Ray had been going to see family in Algeria to celebrate Ramadan and Eid and had travelled down from Manchester via train at 7am and hadn't checked the news - so arrived in London unaware of any issues. \"I noticed the underground was disrupted, so I took a taxi there,\" she told Anna Jones on Sky News Breakfast. \"As I was in the taxi, I found out the news that Heathrow was closed, so I had to stop the taxi driver in the middle of the trip. I wasn't sure what to do.\" She called her dad, who was in the process of driving for four hours to Algiers airport to pick her up. When she called the airline, \"they were not very optimistic about being able to reschedule\" as all the next flights were full, and all the direct flights to Algeria from the UK went via Heathrow. She said she was looking for an alternative way to get to Algeria via mainland Europe, but added the flights were \"very, very expensive\".  Another passenger, John Climpson, was meant to fly out to the north of Sweden from Heathrow on Friday morning before competing in a 240km husky sledding challenge in the Arctic Circle. But his flight was cancelled, meaning he had to wait to catch a flight from Heathrow to Stockholm on Saturday night, staying there overnight and then flying to Kiruna, the furthest north city in Sweden, on Sunday morning. He said he and his team would arrive two days later than planned, meaning \"all of our training time has disappeared and we are going to have to go straight into [the] 240km husky sledding challenge immediately, otherwise we won't make it in time\". He added Heathrow's Terminal 2 was \"probably the quietest\" he had ever seen it. In a statement, transport secretary Heidi Alexander warned those planning to fly over the next few days that \"some disruption\" is expected to continue as \"things get back to normal\". She urged anyone travelling to check with their airlines and plan their journeys.  British Airways says 90% of its flights went ahead British Airways - Heathrow's biggest airline - said 90% of its scheduled flights went ahead on Saturday, which was above its expectations of about 85%. In a statement on X, it said \"the vast majority of our customers were able to get to where they needed to be despite the very challenging circumstances going into the start of the day\". \"As things stand, we're anticipating being able to run a near-full schedule on Sunday and would therefore ask customers to come to the airport as normal unless we get in touch to tell them otherwise,\" it said. Read more:Heathrow shutdown is embarrassing at bestHow Heathrow closure ruined travel plans'Nightmare' Heathrow shutdown in numbersHow much could Heathrow closure cost UK economy? The airline added it was \"really grateful to our customers for bearing with us over the past couple of days, even though many of them have had their travel plans unacceptably cancelled or disrupted\" and thanked its employees for working \"so hard to support customers and help get our operation back on track\". Virgin Atlantic, another prominent airline at Heathrow, said on Saturday evening its operation had \"fully stabilised\" after a \"significant impact\" to its schedule over the past two days. \"We are still working to ensure all those impacted can complete their journeys as quickly as possible and we expect to run our full flying schedule on Sunday 23 March,\" it added. \"We're incredibly sorry for any disruption to our customers' journeys,\" the airline said in an earlier statement. Flight delayed or cancelled? What are your rights? Heathrow CEO Thomas Woldbye also apologised to passengers whose journeys had been disrupted, describing the delays \"as big as it gets for our airport\" and admitting \"we cannot guard ourselves 100%\". However, he stressed the airport would not have shut unless there were \"severe safety concerns\". He said a back-up transformer had failed, meaning systems had to be closed in line with safety procedures so power could be restructured from two remaining substations. A National Grid spokesperson said teams had been working tirelessly to get the situation back under control: \"Power supplies have been restored to all customers, including Heathrow, allowing operations to resume at Heathrow.  \"We are deeply sorry for the disruption caused and are continuing to work closely with the government, Heathrow and the police to understand the cause of the incident.\" 👉 Listen to Sky News Daily on your podcast app 👈 The disruption began late on Thursday night when fire crews were called to a blaze in Hayes, west London, at the electricity substation serving Heathrow and local properties. LFB deputy commissioner Jonathan Smith told reporters that the fire involved a transformer - a key part of the substation - with 25,000 litres of cooling oil \"fully alight\". Pictures from the scene showed large flames and plumes of thick black smoke, with around 70 firefighters and 10 engines working to extinguish the blaze. Crews evacuated 29 people from neighbouring properties but there were no casualties. In all, 67,000 households were left without power after the fire at the substation, but all supplies were restored by 2pm on Friday. You can share your story, pictures or video with us using our app, private messaging or email. \n\n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: Your Report  on Sky News apps\n\n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n:: WhatsApp\n\n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \n::  Email\n\nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material.\n \nBy sending us your video footage/ photographs/ audio you agree we can broadcast, publish and edit the material."
    },
    {
        "title": "Government considering sending failed asylum seekers to overseas 'migrant hubs'",
        "description": "The government is considering sending failed asylum seekers, including those arriving on small boats, to overseas 'migrant hubs', Sky News understands.",
        "url": "https://news.sky.com/story/government-considering-sending-failed-asylum-seekers-to-overseas-migrant-hubs-13333661",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-migrants-border-force_6864024.jpg?20250322135233",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-22 09:12:00",
        "Headline": "Labour's strategy to tackle small boat arrivals comes as a number of migrants were pictured arriving in Dover on Saturday.",
        "Content": "The government is considering sending failed asylum seekers, including those arriving on small boats, to overseas 'migrant hubs', Sky News understands. A Home Office source has told political correspondent Amanda Akass that the government is in the \"very early stages\" of discussions around the idea, and is keen to learn about what Italy has been doing in Albania. The right-wing Italian government has built two facilities in the Balkan country aiming to hold migrants there while processing their asylum requests. Government sources told The Times newspaper that UK ministers are planning to approach countries in the western Balkans including Albania, Serbia, Bosnia and North Macedonia. Analysis: 'Migrant hub' plan will send alarm bells clanging It comes as a number of migrants were pictured arriving in Dover, Kent, on Saturday. On Friday, 246 people made the perilous journey across the Channel from France in five boats - bringing the provisional total for the year so far to 5,271. \n                  'Migrant hub' plan will send alarm bells clanging for many Labour MPs - as Tories smell blood\n                 \n                  Why are asylum claims at the highest level in over 20 years?\n                 \n                  Migrant crossings: Why are more people crossing the Channel on the weekend?\n                 On Thursday, 341 people crossed in six boats. This is the earliest point in the year that crossings have reached the 5,000 mark since data on Channel crossings was first reported in 2018. Labour's strategy is expected to differ substantially from the previous Tory government's Rwanda plan, which aimed to deport all migrants who arrived in the UK illegally, regardless of whether or not their asylum claims would be successful. The Supreme Court ruled in 2023 that Rwanda was considered an \"unsafe\" country. Amanda Akass said the Home Office source \"won't say which countries are being considered because they don't want to pre-empt any discussions which haven't even officially begun yet\". \"But I am told that the government is closely looking at the example of Italy, which has a treaty with Albania and has built two detention centres in Albania to house asylum seekers while their claims are being processed there.\" Akass noted there have been legal challenges to that deal, adding: \"But it looks like the government are watching that to see what the outcome may be.\"  Read more from Sky News:Inside Italy's 'Guantanamo'Why are more people crossing the Channel on the weekend? Meanwhile, the European Union last week announced that it was proposing to allow member states to set up return hubs. The plan has been endorsed by the UN's International Organisation for Migration, which offered to \"advise and assist states in the design and operationalisation of innovative return policy that is both effective and in line with European and international law\". 👉 Listen to Sky News Daily on your podcast app 👈 The UK signed a \"road-map\" agreement with France earlier this month aimed at bolstering co-operation to tackle people smuggling across the Channel. The government's new Border Security, Asylum and Immigration Bill also continues through parliament with plans to introduce new criminal offences and hand counter terror-style powers to police and enforcement agencies to crack down on people smuggling gangs. Chris Philp, shadow home secretary, said: \"This is Labour admitting they made a catastrophic mistake in cancelling the Rwanda scheme before it even started. \"But the tragedy is it will take some time before this can be done and, in the meantime, tens of thousands of illegal migrants will have poured into the country, costing UK taxpayers billions and making a mockery of our border security. \"The fact they are now looking at offshore processing shows they were wrong to cancel Rwanda before it even started and shows their attempts to 'smash the gangs' have failed. \"In fact, illegal immigrants crossing the channel are up 28% since the election and this year has been the worst ever. Labour has lost control of our borders. They should urgently start the Rwanda removals scheme.\" Liberal Democrat leader Sir Ed Davey said the number of people crossing the Channel was \"really worrying\". He said: \"I'm actually glad that the government scrapped the Rwanda scheme because it wasn't working as a deterrent. \"In fact, hardly anybody went, and it was costing huge amounts of money. If they've got a better scheme that will work, we'll look at that. \"But they've also got to do quite a few other things. There's too many hotels that are being used because people aren't being processed quickly enough, and Liberal Democrats have argued for a long time that if you process people, you give them the right to work so they can actually contribute. \"That's the way you could save a lot of money, and I think taxpayers would support that.\" The government has been contacted for further comment."
    },
    {
        "title": "Trump 100 Day 62: Why was Elon Musk at the Pentagon?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-62-why-was-elon-musk-at-the-pentagon-13333478",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-22 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   Department of Government Efficiency head and business owner Elon Musk visited the Pentagon on Friday, which according to defence secretary Pete Hegseth was to talk about \"efficiencies\" and \"innovations\".  It was not, as President Trump insisted, to brief Musk on the US military's plan for any theoretical war that might break out with China. On day 62 of the Trump presidency, US correspondents James Matthews and Martha Kelner discuss why Musk was at the Pentagon, and if his work presents a conflict of interest for the administration. Plus, James has been to the John F Kennedy Center for the Performing Arts in Washington DC, where there's a new self-appointed chairman - Donald Trump - and the artists aren't happy. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk. Help us understand more about our listeners by taking our survey! 👉 This form 👈 should only take a few minutes to complete, and Sky anonymises the responses as much as possible. Thank you. Don't forget, you can also watch all episodes on our YouTube channel."
    }
]