[
    {
        "title": "Ukrainians are appalled at Trump's naive and cack-handed diplomacy",
        "description": "For Ukrainians, the spectacle of Vladimir Putin and Donald Trump meeting in Alaska will be repugnant.",
        "url": "https://news.sky.com/story/ukrainians-are-appalled-at-trumps-naive-and-cack-handed-diplomacy-13411865",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russia-ukraine_6991101.jpg?20250814214145",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-14 20:20:00",
        "Headline": "Putin is sending a team of foreign affairs heavyweights to Alaska, adept at getting the better of opponents in negotiations. Trump is relying on Steve Witkoff, a real estate lawyer and foreign policy novice.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  For Ukrainians, the spectacle of Vladimir Putin and Donald Trump meeting in Alaska will be repugnant. The man behind an unprovoked invasion of their country is being honoured with a return to the world stage by the leader of a country that was meant to be their ally. And they feel let down. Follow latest updates from Ukraine war President Trump had threatened severe sanctions on Russia within 50 days if Russia didn't agree to a deal. He had seemed close to imposing them before letting Putin wriggle off the hook yet again. But they are not surprised. At every stage, Trump has either sided with Russia or at least given them the benefit of the doubt. It is clear that Putin has some kind of hold over this American president, in their minds and many others. \n                  Past US-Russia summits required detailed preparation - but will Trump surprise us all?\n                 \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 Ukraine wants three things out of these talks. A ceasefire, security guarantees and reparations. It is not clear at this stage that they will get any of them. Ukrainians and their European allies are appalled at the naive and cack-handed diplomacy that has preceded this meeting. Vladimir Putin is sending a team of foreign affairs heavyweights, adept at getting the better of opponents in negotiations. There are, the Financial Times reported this week, no Russia specialists left at the Trump White House. Instead, Trump is relying on Steve Witkoff, a real estate lawyer and foreign policy novice, who has demonstrated a haphazard mastery of his brief and breathtaking credulity with the Russians.  Former British spy chief Sir Alex Younger described him today as totally out of his depth. Trump, he says, is being played like a fiddle by Putin. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summit There is a fundamental misunderstanding of the conflict at the heart of the Trump administration's handling of it. Witkoff and the president see it in terms of real estate. But it has never been about territory. Vladimir Putin has made it abundantly clear that Ukraine's existence as a sovereign democratic entity cannot be tolerated. He has made no pretence that his views on that have changed. Ukrainians know that and fear any deal cooked up in Alaska will be used by Putin on the path towards that ultimate goal"
    },
    {
        "title": "Child sexual exploitation victims 'not in scope' of violence against women and girls strategy",
        "description": "Victims of child sexual exploitation are \"not explicitly within the scope\" of the Violence Against Women and Girls (VAWG) strategy being drafted by the government, Sky News can reveal.",
        "url": "https://news.sky.com/story/child-sexual-exploitation-victims-not-in-scope-of-violence-against-women-and-girls-strategy-13411617",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-malone-vawg_6990587.jpg?20250814124105",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-08-14 23:01:00",
        "Headline": "The government calls the issues \"complex\" and overlapping but says it's taking \"concerted action\" to tackle child sexual abuse, such as announcing an inquiry into grooming gangs.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Victims of child sexual exploitation are \"not explicitly within the scope\" of the Violence Against Women and Girls (VAWG) strategy being drafted by the government, Sky News can reveal. Child Sexual Abuse and Exploitation (CSEA) is a form of child abuse, described by police as a \"critical threat\" to women and girls. It includes crimes such as grooming, and can involve both physical contact, such as rape, or non-physical - like forcing children to look at sexual images. Sky News has been shown an internal Home Office document presented to various stakeholders in the sector. It's titled \"Scope of the Strategy... Our draft definition of VAWG\", and says that while it recognises \"links\" between VAWG and child sexual exploitation, it is not \"explicitly within the scope of the strategy\". \"VAWG is Violence Against Women and Girls. If you take child sexual abuse out of it, where are the girls?\" Poppy Eyre told Sky News. Poppy was sexually abused and raped by her grandfather when she was four. \n                  King to warn that sacrifices of VJ Day veterans should 'never be forgotten'\n                 \n                  British veteran, 100, recalls witnessing Japan's Second World War surrender on USS Missouri\n                 \n                  Oasis fan dies in hotel room hours before show in Edinburgh\n                 It wasn't until she was 11, after a PHSE lesson on abuse at school, that she understood the enormity of what had happened. \"I remember very vividly when the police came round and told me… this is what we're charging him with,\" said Poppy. \"We're charging him with sexual abuse and rape. And I remember being like, I had no idea that's what it was, but I know that's really bad.\" Poppy's grandfather was convicted and died in prison. She questions how authorities would police crime if child sexual abuse is excluded from an umbrella strategy to tackle violence against women and girls. \"Are they holding child sexual abuse at the same level of importance as they are with violence against women? You'd hope so, but potentially not, because it doesn't need to be in the figures\", she said. The government has pledged to halve VAWG within a decade, by 2035. \"If the government are measuring themselves against halving violence against women and girls - if they're not looking at the scale of child sexual abuse and child sexual exploitation within that - that will mean we are failing many young victims of abuse,\" said Andrea Simon, director of campaign group End Violence Against Women. The Centre of Expertise on Child Sexual Abuse, which is funded by the Home Office, estimates 500,000 children in England and Wales are sexually abused every year. 'Danger' of having separate plan Rape Crisis told Sky News that \"for any strategy to be effective\" it \"must include all forms of gender-based violence against all women and girls\", suggesting there is a \"danger\" in having a separate plan for child sexual abuse. Its chief executive, Ciara Bergman, said it could create a \"problematic and potentially very unhelpful\" distinction between victims of domestic abuse, expected to be covered by the strategy, and child sexual abuse. \"Some perpetrators of domestic abuse also sexually abuse their children,\" she told Sky News. The government insists the strategy will include action to tackle child sexual abuse, but says it also plans to create a distinctive programme to address its specific crimes. \"Sexual abuse is violence against a child,\" said Poppy's mother, Miranda Eyre, who now works as a counsellor specialising in trauma. \"It is violence against girls… and you can't separate it out,\" she said. \"I'm speechless to be honest… it does make me quite angry.\" Read more from Sky News:Family hail inquest into death of boy sent home from A&EFourteen injured after kids' rollercoaster 'derails' A Home Office spokesperson told Sky News it is \"working tirelessly to tackle the scourges of violence against women and girls and child sexual abuse\". \"These issues are complex and run deep within the fabric of society,\" they added. \"The government wholly recognises that they overlap. But it also recognises that concerted action is needed to tackle child sexual abuse which is why we have set out a range of actions… and why we are launching a national inquiry into grooming gangs.\""
    },
    {
        "title": "Israeli minister announces plans for new West Bank settlement to 'bury' idea of Palestinian state",
        "description": "Israel's far-right finance minister has announced plans to build a new settlement in the Israeli-occupied West Bank, which he said would \"bury\" the idea of a Palestinian state.",
        "url": "https://news.sky.com/story/israeli-minister-announces-plans-for-new-west-bank-settlement-to-bury-idea-of-palestinian-state-13411680",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-west-bank-smotrich_6990708.jpg?20250814143841",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-14 13:26:00",
        "Headline": "Palestinians and rights groups said the settlement would effectively cut the West Bank into two separate parts and rob them of any chance to build a Palestinian state.",
        "Content": " Israel's far-right finance minister has announced plans to build a new settlement in the Israeli-occupied West Bank, which he said would \"bury\" the idea of a Palestinian state. Palestinians and rights groups said the settlement would effectively cut the West Bank into two separate parts and rob them of any chance to build a Palestinian state. This comes as several countries, including the UK, said they would recognise a Palestinian state in September, unless Israel meets several conditions, including agreeing to a ceasefire in Gaza. \"This reality finally buries the idea of a Palestinian state, because there is nothing to recognise and no one to recognise,\" finance minister Bezalel Smotrich said as he announced the construction plans. \"Anyone in the world who tries today to recognise a Palestinian state will receive an answer from us on the ground.\" The settlement is planned to be built in E1, an open tract of land east of Jerusalem, and includes around 3,500 apartments to expand the existing settlement of Maale Adumim, Mr Smotrich said. E1 has been eyed for Israeli development for more than two decades, but plans were halted due to pressure from the US during previous administrations. \n                  Inside settler violence in the West Bank\n                 \n                  West Bank: The city locked down by armed troops - where what was law now has no place in reality\n                 \n                  Settlers and segregation: Inside the conflict forcing Palestinians from their homes\n                 Read more:Inside the conflict forcing Palestinians from their homesThe city where what was law now has no place in reality Now-US President Donald Trump and the US ambassador to Israel, Mike Huckabee, were praised on Thursday by Mr Smotrich as \"true friends of Israel as we have never had before\". Mr Smotrich, himself a Jewish settler, told Sky News' international correspondent Diana Magnay that Israeli Prime Minister Benjamin Netanyahu and Mr Trump had agreed to the revival of the E1 scheme. There was no confirmation of this claim from either leader. The E1 plan has not yet received its final approval, which is expected next week. Foreign Secretary David Lammy has said the UK strongly opposes the plan, calling it a \"flagrant breach of international law and must be stopped now\".  Construction of homes 'within a year' Peace Now, which tracks settlement activity in the West Bank, said some bureaucratic steps remain before construction could begin, including the approval of Israel's high planning council. But if the process moves quickly, infrastructure work could start in the next few months, with the construction of homes to follow in about a year. \"The E1 plan is deadly for the future of Israel and for any chance of achieving a peaceful two-state solution. We are standing at the edge of an abyss, and the government is driving us forward at full speed,\" Peace Now said in a statement. It added that the plan was \"guaranteeing many more years of bloodshed\". Mr Smotrich was also criticised by an Israeli rights group established by former Israel Defence Forces (IDF) soldiers, who accused the far-right politician of encouraging West Bank settlement activity while the world's attention was on the Gaza war. As well as official, government-approved settlements, there are also Israeli outposts, which are established without government approval and are considered illegal by Israeli authorities. But reports suggest the government often turns a blind eye to their creation. In May, Mr Netanyahu's government approved 22 new settlements, including the legalisation of outposts that had previously been built without authorisation. Since the Hamas-led attacks on 7 October 2023 and Israel's subsequent military bombardment of Gaza, more than 100 Israeli outposts have been established, according to Peace Now. Settler violence against Palestinians has also increased, according to the UN, with an average of 118 incidents each month - up from 108 in 2023, which was already a record year. International correspondent Bezalel Smotrich is pumped. His dreams of resettlement and annexation of the West Bank have never been closer to fruition.  The E1 settlement plan, which would cut the West Bank from East Jerusalem, was first conceived back in 1995 by then prime minister Yitzhak Rabin. Thirty years later, the extremist settler contingent within the government seems to be on the verge of making it a reality. The prime minister's office has yet to confirm Benjamin Netanyahu's backing, but according to Smotrich, both he and President Trump are on board. E1 (or T1 as they say they will call it, in honour of Donald Trump) would be another symbolic blow to the very notion of Palestinian statehood, as is every settlement and piece of related infrastructure which Israel builds in the occupied West Bank. At a time when the UK, France and others all say they will recognise a Palestinian state unless Israel pushes for a ceasefire in Gaza, Netanyahu's government is doubling down.  Per Smotrich, their response will come through roads, buildings, neighbourhoods, the spread of Jewish life across Palestinian lands in the West Bank - the creation of facts on the ground.  The UK, France and many others in the international community may not like it, but the real power-broker here, certainly as far as Netanyahu is concerned, is Donald Trump.  He is the president who moved the US embassy to Jerusalem; his ambassador has said there is no such thing as the West Bank.  For the likes of Smotrich, that is all the encouragement they need. Plans criticised as 'extension of genocide' The Palestinian foreign ministry called the settlement plan an extension of the crimes of genocide, displacement and annexation. Israel has long disputed accusations of genocide and rights abuses, saying it is acting in self-defence. Nabil Abu Rudeineh, the Palestinian president's spokesperson, called on the US to pressure Israel to stop the building of settlements. Hamas said the plan was part of Israel's \"colonial, extremist\" policies and called on Palestinians to confront it. Qatar, which has been acting as a mediator between Hamas and Israel in a bid to secure a ceasefire in Gaza, said the move was a flagrant violation of international law. \"The EU rejects any territorial change that is not part of a political agreement between involved parties. So annexation of territory is illegal under international law,\" European Commission spokesperson Anitta Hipper said. Today, an estimated 700,000 Israeli settlers live in the West Bank and East Jerusalem. There is also a growing movement of Israelis wanting to build settlements in Gaza. Settlers make up around 5% of Israel's population and 15% of the West Bank's population, according to data from Peace Now. Settlements are illegal under international law and have been condemned by the UN. They are, however, authorised by the Israeli government. According to the Israel Policy Forum, the settlement programme is intended to protect Israel's security, with settlers acting as the first line of defence \"against an invasion\". Mr Smotrich's settlement announcement comes after the UK, Canada, Australia and New Zealand on Mr Smotrich and his fellow far-right cabinet member, Itamar Ben-Gvir, for \"repeated incitements of violence against Palestinian civilians\" in the West Bank.  Foreign Secretary David Lammy said in June that the ministers had been \"encouraging egregious abuses of human rights\" for \"months\". Last year, Mr Smotrich, whose National Religious Party largely draws its support from settlers, ordered preparations for the annexation of the West Bank. His popularity has fallen in recent months, with polls showing that his party would not win a single seat in parliament in elections were held today."
    },
    {
        "title": "King to warn that sacrifices of VJ Day veterans should 'never be forgotten'",
        "description": "The King will issue a warning that the sacrifices of the VJ Day veterans should \"never be forgotten\" as they \"gave us more than freedom; they left us the example of how it can and must be protected\".  ",
        "url": "https://news.sky.com/story/king-to-warn-that-sacrifices-of-vj-day-veterans-should-never-be-forgotten-13411689",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6990626.jpg?20250814131316",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-14 13:49:00",
        "Headline": "King Charles and Queen Camilla will also publicly mark the 80th anniversary of the end of the Second World War in the Far East by attending a national service of remembrance at the National Memorial Arboretum in Staffordshire.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The King will issue a warning that the sacrifices of the VJ Day veterans should \"never be forgotten\" as they \"gave us more than freedom; they left us the example of how it can and must be protected\".   In an audio message, due to be released on Friday morning to mark 80 years since the end of the Second World War in the Far East, King Charles will describe how the heroic actions of those sent to fight there and the brutal treatment of civilians \"reminds us that war's true cost extends beyond battlefields, touching every aspect of life\". In what could be interpreted as him alluding to current world events and conflicts, he will emphasise the importance of international collaboration, saying that victory in 1945 demonstrated that \"in times of war and in times of peace, the greatest weapons of all are not the arms you bear but the arms you link\". The six-minute audio message to the Nation, Realms and Commonwealth to mark VJ Day, echoes the audio broadcast made by his grandfather, King George VI, which the King will reference. He recorded it in the Morning Room at Clarence House earlier this month. Victory over Japan (VJ Day) was declared on 15 August 1945, following Imperial Japan's surrender to Allied Forces. With Victory in Europe (VE Day) declared in May 1945, some have felt that historically VJ Day has been overlooked, undervaluing the sacrifices of those who continued to fight on for another three months. \n                  Palace confirms date of Trump's state visit - with King and Queen to host him at Windsor Castle\n                 \n                  Senior aides to King and Prince Harry pictured meeting in London\n                 \n                  King Charles asks RNLI crew whether they 'get a lot?' while discussing small boat crossings\n                 In his message, the King will say that the service and sacrifice of those who fought and died in the Pacific and Far East \"shall never be forgotten\". He will also refer to the experience endured by prisoners of war and to the innocent civilians of occupied lands in the region. Read more:UK veteran, 100, recalls witnessing Japan's Second World War surrenderSurvivors' relatives pledge to make Nagasaki last ever atomic bomb siteMy grandmother survived world's deadliest air raid King Charles and Queen Camilla will also publicly mark the anniversary by attending a national service of remembrance at the National Memorial Arboretum in Staffordshire. The service, run in partnership with the Royal British Legion, will be attended by Burma Star recipients, a veteran of the British Indian Army and those involved in the Battles of Kohima and Imphal. Prisoners of war held across the region and veterans stationed in the UK or Commonwealth countries who contributed to the war effort will also attend. A two-minute national silence will be held at midday."
    },
    {
        "title": "Oasis fan dies in hotel room hours before show in Edinburgh",
        "description": "An Italian fan of Oasis died in his hotel room just hours before he was due to see the band in Edinburgh last week.",
        "url": "https://news.sky.com/story/oasis-fan-dies-in-hotel-room-hours-before-show-in-edinburgh-13411861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-croce-alessandro_6991128.jpg?20250814221313",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-14 20:02:00",
        "Headline": "Alessandro Croce, 30, from Teramo, Italy, died after collapsing at his hotel on 9 August. He was reportedly getting ready to attend the Oasis concert at Murrayfield Stadium when he suddenly took ill.",
        "Content": "An Italian fan of Oasis died in his hotel room just hours before he was due to see the band in Edinburgh last week. Alessandro Croce, 30, from Teramo in central Italy, died after collapsing at his hotel on 9 August. He was reportedly getting ready to attend the event at Murrayfield Stadium when he suddenly took ill. His friends tried to resuscitate him as they waited for the emergency services to arrive. Paramedics also tried to save him, but all efforts were unsuccessful. Initial reports indicated Mr Croce suffered a cardiac arrest, Sky News Italia said. Tributes poured in for the dentist and amateur basketball player. Mayor of Teramo Gianguido D'Alberto said in a statement on social media that \"our city is profoundly shaken by the passing of Alessandro Croce\". He sent his condolences to the 30-year-old's family, including his parents and his sister, Giulia. Basketball Teramo said they were \"literally devastated\" and their community felt \"deep pain\" at the \"sudden and premature\" passing of their player. \"Alessandro was not only a pillar of our team, but an integral part of our history and of the heart of our association,\" a statement on social media reads. \"His memory and smile will remain forever alive in every match.\""
    },
    {
        "title": "Boy, 16, arrested on suspicion of rape and murder after 13-year-old girl's 'unexplained' death",
        "description": "A 16-year-old boy has been arrested on suspicion of rape and murder after the \"unexplained\" death of a 13-year-old girl.",
        "url": "https://news.sky.com/story/investigation-into-unexplained-death-of-13-year-old-girl-in-huddersfield-under-way-13411811",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-huddersfield-sheepridge_6991008.jpg?20250814191701",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-14 17:50:00",
        "Headline": "Police were called to a flat at around 11:36pm on Monday night following a report a girl was unresponsive.",
        "Content": "A 16-year-old boy has been arrested on suspicion of rape and murder after the \"unexplained\" death of a 13-year-old girl. West Yorkshire Police said a post-mortem examination \"was not able to determine\" how the girl died and that officers were continuing to investigate. Police said they were called to a flat in Sheepridge Road in Huddersfield at around 11:36pm on Monday night following a report a girl was unresponsive. She died in hospital in the early hours of Tuesday morning, West Yorkshire Police said. The 16-year-old boy remains in custody. Read more from Sky News:Fourteen injured after children's rollercoaster 'derails'Travellers warned after rise in chikungunya infections Detective Chief Inspector Stacey Atkinson said: \"We are continuing to conduct a number of inquiries today following the death of a 13-year-old girl.\" She added: \"A post mortem was not able to determine how she died, and we continue to treat her death as unexplained at this time, pending more inquiries. \"Those inquiries are complex and are likely to be lengthy as we work to fully understand the circumstances of the girl's death. \"Specially trained officers are supporting her family at this time.\" The force said the 16-year-old boy was arrested on suspicion of another offence of rape relating to a 16-year-old girl from a separate incident elsewhere in the Kirklees district."
    },
    {
        "title": "British veteran, 100, recalls witnessing Japan's Second World War surrender on USS Missouri",
        "description": "A British veteran has spoken about how he witnessed Japan's wartime surrender up close as a 20-year-old sailor.",
        "url": "https://news.sky.com/story/british-veteran-100-recalls-witnessing-japans-second-world-war-surrender-on-uss-missouri-13411695",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-reg-draper-elton-vj_6990781.jpg?20250814153949",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-14 23:01:00",
        "Headline": "As a young sailor, Reg Draper had a privileged view of the moment Japan surrendered and the Second World War was over for good.",
        "Content": "A British veteran has spoken about how he witnessed Japan's wartime surrender up close as a 20-year-old sailor. Reg Draper was off Japan's coast on the HMS Duke of York when the captain announced the war was ending. Recalling that moment - 80 years ago today - he said cheers went up from the battleship's crew.  Mr Draper saw the Japanese sign the agreement on USS Missouri when he went on board to help his friend, who was the ship's photographer. \"All the ships mustered in Tokyo Bay with the USS Missouri, which was the American ship, and it was on the Missouri where they signed the peace treaty,\" the 100-year-old recalled. \"Then we all came back down to Australia and we went and celebrated - we went down to Tasmania and everybody had four days leave in Hobart. \"Everybody wanted to take us to their home and there were a couple of dances in the dance hall.\" \n                  King to warn that sacrifices of VJ Day veterans should 'never be forgotten'\n                 \n                  Dunkirk anniversary: 85 years on from historic rescue of Allied troops, little ships recreate Operation Dynamo\n                 \n                  King and Queen attend VE Day 80th anniversary service at Westminster Abbey\n                 Mr Draper, who grew up in Leeds, was a stores assistant on the Duke of York after volunteering on his 18th birthday. His duties included rationing out the rum so all the sailors could get their 11am hit. He said senior crew got theirs neat while everyone else had theirs watered down. He also recalled being clattered by Prince Philip after the Queen's future husband, who was on a destroyer escorting his ship, came aboard. \"We used to have deck hockey on the quarter deck and it was murder playing deck hockey,\" said Mr Draper. \"He [Philip] knocked me over once and then the next time he came round he hit me, there's still a mark there, he gave me a clout with his hockey stick. \"He came to see me just to see how I was. They just put a stitch in and it was alright.\" The pair met again in 1972 when Mr Draper was training sea cadets for the Duke of Edinburgh awards. He said Philip noticed his medals and recalled escorting the ship - but didn't mention the hockey game.  Mr Draper's time on the Duke of York included Arctic convoys to deliver supplies to Russia and sailing to Sydney, Australia, in 1945 before joining the East Indies Fleet. \"We started going up to the islands, kicking the Japanese out of the islands as we went,\" he recalled. Japan surrendered after the US dropped two nuclear bombs on Hiroshima and Nagasaki, on 6 and 9 August. Read more:Hiroshima survivor has stark warning for us allMy grandmother survived world's deadliest air raid Mr Draper turned 21 on the trip back to Europe and said 2,000 people were on board as they had picked up prisoners of war. He went on to become an insurance salesman and said he's planning to watch today's 80th anniversary commemorations from his home in Elton, Cheshire. The King released an audio message in which he said the sacrifices of VJ Day veterans should \"never be forgotten\". He described how the heroic actions of those sent to fight in the Far East, as well as the brutal treatment of civilians, \"reminds us that war's true cost extends beyond battlefields, touching every aspect of life\"."
    },
    {
        "title": "Past US-Russia summits required detailed preparation - but will Trump surprise us all?",
        "description": "History-making summits between the US and the Soviet Union are strewn through the decades, dripping with mutual suspicion but significantly shaping the course of events after the Cold War.",
        "url": "https://news.sky.com/story/past-us-russia-summits-required-detailed-preparation-but-will-trump-surprise-us-all-13411906",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin-helsinki_6991167.jpg?20250814231055",
        "type": "Home",
        "Author": "Mark Austin",
        "Date Published": "2025-08-14 23:01:00",
        "Headline": "Hurriedly arranged and without much idea about what will emerge, Donald Trump takes a very different approach to the latest US-Russia summit.",
        "Content": "\n          Chief presenter\n       History-making summits between the US and the Soviet Union are strewn through the decades, dripping with mutual suspicion but significantly shaping the course of events after the Cold War. Think Nixon-Brezhnev in Moscow in 1972 when they signed a landmark arms treaty. Think Reagan-Gorbachev in Geneva and Reykjavik and others, which ended in limiting short and intermediate-range ballistic missiles. All these summits required huge planning and detailed preparation. Follow latest updates from Ukraine war Donald Trump's summits are different, at least this one is. Hurriedly arranged and without much idea about what will emerge. The US president is on record as saying there is a 25% chance it won't be a success. \n                  Ukrainians are appalled at Trump's naive and cack-handed diplomacy\n                 \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                  The circumstances are very different. This time, it is about Vladimir Putin's invasion of a sovereign country and how to bring the fighting to an end. The fear is that Trump will once again give Putin the benefit of the doubt. I was in Helsinki in 2018 when there were sharp intakes of breath as Trump literally sided with the Russian president over his own intelligence chiefs. Not privately, but in the news conference that followed. It was all about Russian interference in the 2016 election. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summit Trump said: \"My people came to me and they all said they think it's Russia. I have President Putin here and he says it wasn't Russia and I have to say this, I don't see any reason why it would be.\" It was a pretty bad look, an American president undermining the work of the country's intelligence agencies. Former Trump foreign policy advisor Fiona Hill remembers it well. She was there and was horrified. She said afterwards that it literally crossed her mind to fake some kind of medical emergency to bring the whole thing to an end. Here in Alaska, the plan is, once again, for Trump and Putin to have talks alone, other than translators.  Their negotiating teams will eventually join them but Ukraine and Volodymyr Zelenskyy are desperately worried that Trump will be outmanoeuvred. The experienced, ruthless ex-KGB man is nothing if not a survivor and his aim is to buy time and continue the war. This time, Trump has European leaders in his ear like never before. Will he listen and, more importantly, will he surprise us all?"
    },
    {
        "title": "Men jailed after kidnapping pregnant mum and threatening to cut her fingers off",
        "description": "Three men have been jailed after kidnapping a pregnant mother from outside her north London home and threatening to cut her fingers off, police have said.",
        "url": "https://news.sky.com/story/men-jailed-after-kidnapping-pregnant-mum-and-threatening-to-cut-her-fingers-off-13411794",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-audi-johnson-ahmad-ghiasi_6990891.jpg?20250814170643",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-14 17:04:00",
        "Headline": "The 36-year-old victim was bundled into the back of a white Ford Transit van before being blindfolded and bound at the wrist with cable ties by the gang as they sped away.",
        "Content": "Three men have been jailed after kidnapping a pregnant mother from outside her north London home and threatening to cut her fingers off, police have said. Audi Johnson, 35, Ahmad Ghiasi, 26, and Nicholas Mitchell, 55, were members of a London-based gang that was contracted to carry out the abduction in Enfield on the morning of 10 May last year, the force added. The 36-year-old victim, who has not been named, was bundled into the back of a white Ford Transit van before being blindfolded and bound at the wrist with cable ties by the gang as they sped away.   They then fired questions at her about her partner where one of them threatened: \"If you lie to me I'm gonna kick the baby out your stomach.\" The men later made a series of phone calls to her partner as they threatened to cut off her fingers if he did not quickly carry out their demands for money and valuable jewellery, the Metropolitan Police said. Johnson, Ghiasi and Mitchell were found guilty of conspiracy to kidnap last month after a six-week trial at Kingston Crown Court. Mother will 'never be the same again' The victim said she has not been able to go home since the traumatic ordeal and spent the rest of her pregnancy sleeping on her sister's couch. In her impact statement, she told the court: \"The incident ruined my life. I will never be the same person again. I am having to start my life all over again. \"I will forever have fear and paranoia as part of my life now. I didn't deserve to be a victim of what happened to me. And to top it off, it was all made so much worse by being pregnant. \"This will always be something that will be part of my pregnancy, which is meant to be a happy experience, and will always be something that is a part of my daughter.\" The victim was kidnapped as she waited for a cab to take her to a personal training session with her mother and sister. She was walking along the curb close to her home when she was suddenly grabbed and thrown into the back of the van. Read more from Sky News:Fourteen injured after children's rollercoaster 'derails'Travellers warned after rise in chikungunya infectionsPhotos of 'zombie rabbits' go viral - yes, they're real Despite being blindfolded and bound at the wrist, when the woman was left alone in the van she managed to escape before flagging down a cab and travelling to the safety of her mother's house. A police spokesman said the Met's Flying Squad responded to the crime immediately. They tracked the van using CCTV and located the vehicle the same night the woman managed to escape. DNA evidence, fingerprint impressions and mobile phone data were used to identify the suspects. The police said Johnson, of Cranberry Close, Northolt, had pleaded guilty to conspiracy to kidnap and was sentenced to five years and four months. Ghiasi, of Fourth Avenue, Luton, was sentenced to seven years for conspiracy to kidnap. Mitchell, of Mannock Close, Barnet, was sentenced to nine years for conspiracy to kidnap."
    },
    {
        "title": "Mounjaro manufacturer to hike UK price of weight loss drug by up to 170%",
        "description": "The UK cost of weight loss drug Mounjaro will increase by up to 170%, its US manufacturer has said, as the White House pushes for a price hike abroad so costs can be cut for Americans.",
        "url": "https://news.sky.com/story/mounjaro-manufacturer-to-hike-uk-price-of-weight-loss-drug-by-up-to-170-13411815",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-14 18:05:00",
        "Headline": "The price for a month's supply of the highest dose of the medicine will increase from £122 to £330, Lilly said, adding the adjustment will be made by next month.",
        "Content": "The UK cost of weight loss drug Mounjaro will increase by up to 170%, its US manufacturer has said, as the White House pushes for a price hike abroad so costs can be cut for Americans. The new price, announced by manufacturer Eli Lilly on Thursday, also applies to Lilly's type 2 diabetes medicine that has the same name. The price for a month's supply of the highest dose of the medicine will increase from £122 to £330, Lilly said, adding the adjustment will be made next month. The higher price will not affect those prescribed the medicine through the NHS, which has a separate deal, a Lilly spokesperson said. The US drugmaker said that when it launched Mounjaro in the UK it agreed to a list price \"significantly below\" that in its three other European markets to prevent delays in availability through the NHS. \"We are now aligning the list price more consistently,\" Lilly said. Lilly did not say what price it has agreed with the NHS, but said it was working with private UK healthcare providers who can set their own prices, such as online pharmacies, to ensure the medicines remain available. \n                  Causes, symptoms and how to prevent chikungunya - as cases rise in the UK\n                 \n                  Cancer survival rates rise substantially but 'longer waits' hit progress for more deadly types of the disease, say researchers\n                 \n                  Calling all learner drivers - new theory test questions on the way\n                 It follows Sky News earlier this month revealing only eight of 42 NHS Integrated Care Boards in England were providing the weight loss treatment to patients, and many of the rest were unable to guarantee when it would be available.  Lilly's decision comes as US President Donald Trump is pushing for lower domestic prices while encouraging price hikes overseas. The US pays more for prescription drugs than any other country, often nearly three times as much as other developednations. Mr Trump says he wants to narrow this gap to stop Americans from being \"ripped off\". Read more: Why the wait for Mounjaro on the NHS?How weight loss injections work The company issued a statement online saying: \"Lilly supports the administration's goal of keeping the United States the world's leading destination for biopharmaceutical research and manufacturing, and the objective of more fairly sharing the costs of breakthrough medical research across developed countries. \"This rebalancing may be difficult, but it means the prices for medicines paid by governments and health systems need to increase in other developed markets like Europe in order to make them lower in the US.\""
    },
    {
        "title": "Child sexual exploitation victims 'not in scope' of violence against women and girls strategy",
        "description": "Victims of child sexual exploitation are \"not explicitly within the scope\" of the Violence Against Women and Girls (VAWG) strategy being drafted by the government, Sky News can reveal.",
        "url": "https://news.sky.com/story/child-sexual-exploitation-victims-not-in-scope-of-violence-against-women-and-girls-strategy-13411617",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-malone-vawg_6990587.jpg?20250814124105",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-08-14 23:01:00",
        "Headline": "The government calls the issues \"complex\" and overlapping but says it's taking \"concerted action\" to tackle child sexual abuse, such as announcing an inquiry into grooming gangs.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Victims of child sexual exploitation are \"not explicitly within the scope\" of the Violence Against Women and Girls (VAWG) strategy being drafted by the government, Sky News can reveal. Child Sexual Abuse and Exploitation (CSEA) is a form of child abuse, described by police as a \"critical threat\" to women and girls. It includes crimes such as grooming, and can involve both physical contact, such as rape, or non-physical - like forcing children to look at sexual images. Sky News has been shown an internal Home Office document presented to various stakeholders in the sector. It's titled \"Scope of the Strategy... Our draft definition of VAWG\", and says that while it recognises \"links\" between VAWG and child sexual exploitation, it is not \"explicitly within the scope of the strategy\". \"VAWG is Violence Against Women and Girls. If you take child sexual abuse out of it, where are the girls?\" Poppy Eyre told Sky News. Poppy was sexually abused and raped by her grandfather when she was four. \n                  King to warn that sacrifices of VJ Day veterans should 'never be forgotten'\n                 \n                  British veteran, 100, recalls witnessing Japan's Second World War surrender on USS Missouri\n                 \n                  Oasis fan dies in hotel room hours before show in Edinburgh\n                 It wasn't until she was 11, after a PHSE lesson on abuse at school, that she understood the enormity of what had happened. \"I remember very vividly when the police came round and told me… this is what we're charging him with,\" said Poppy. \"We're charging him with sexual abuse and rape. And I remember being like, I had no idea that's what it was, but I know that's really bad.\" Poppy's grandfather was convicted and died in prison. She questions how authorities would police crime if child sexual abuse is excluded from an umbrella strategy to tackle violence against women and girls. \"Are they holding child sexual abuse at the same level of importance as they are with violence against women? You'd hope so, but potentially not, because it doesn't need to be in the figures\", she said. The government has pledged to halve VAWG within a decade, by 2035. \"If the government are measuring themselves against halving violence against women and girls - if they're not looking at the scale of child sexual abuse and child sexual exploitation within that - that will mean we are failing many young victims of abuse,\" said Andrea Simon, director of campaign group End Violence Against Women. The Centre of Expertise on Child Sexual Abuse, which is funded by the Home Office, estimates 500,000 children in England and Wales are sexually abused every year. 'Danger' of having separate plan Rape Crisis told Sky News that \"for any strategy to be effective\" it \"must include all forms of gender-based violence against all women and girls\", suggesting there is a \"danger\" in having a separate plan for child sexual abuse. Its chief executive, Ciara Bergman, said it could create a \"problematic and potentially very unhelpful\" distinction between victims of domestic abuse, expected to be covered by the strategy, and child sexual abuse. \"Some perpetrators of domestic abuse also sexually abuse their children,\" she told Sky News. The government insists the strategy will include action to tackle child sexual abuse, but says it also plans to create a distinctive programme to address its specific crimes. \"Sexual abuse is violence against a child,\" said Poppy's mother, Miranda Eyre, who now works as a counsellor specialising in trauma. \"It is violence against girls… and you can't separate it out,\" she said. \"I'm speechless to be honest… it does make me quite angry.\" Read more from Sky News:Family hail inquest into death of boy sent home from A&EFourteen injured after kids' rollercoaster 'derails' A Home Office spokesperson told Sky News it is \"working tirelessly to tackle the scourges of violence against women and girls and child sexual abuse\". \"These issues are complex and run deep within the fabric of society,\" they added. \"The government wholly recognises that they overlap. But it also recognises that concerted action is needed to tackle child sexual abuse which is why we have set out a range of actions… and why we are launching a national inquiry into grooming gangs.\""
    },
    {
        "title": "King to warn that sacrifices of VJ Day veterans should 'never be forgotten'",
        "description": "The King will issue a warning that the sacrifices of the VJ Day veterans should \"never be forgotten\" as they \"gave us more than freedom; they left us the example of how it can and must be protected\".  ",
        "url": "https://news.sky.com/story/king-to-warn-that-sacrifices-of-vj-day-veterans-should-never-be-forgotten-13411689",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6990626.jpg?20250814131316",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-14 13:49:00",
        "Headline": "King Charles and Queen Camilla will also publicly mark the 80th anniversary of the end of the Second World War in the Far East by attending a national service of remembrance at the National Memorial Arboretum in Staffordshire.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The King will issue a warning that the sacrifices of the VJ Day veterans should \"never be forgotten\" as they \"gave us more than freedom; they left us the example of how it can and must be protected\".   In an audio message, due to be released on Friday morning to mark 80 years since the end of the Second World War in the Far East, King Charles will describe how the heroic actions of those sent to fight there and the brutal treatment of civilians \"reminds us that war's true cost extends beyond battlefields, touching every aspect of life\". In what could be interpreted as him alluding to current world events and conflicts, he will emphasise the importance of international collaboration, saying that victory in 1945 demonstrated that \"in times of war and in times of peace, the greatest weapons of all are not the arms you bear but the arms you link\". The six-minute audio message to the Nation, Realms and Commonwealth to mark VJ Day, echoes the audio broadcast made by his grandfather, King George VI, which the King will reference. He recorded it in the Morning Room at Clarence House earlier this month. Victory over Japan (VJ Day) was declared on 15 August 1945, following Imperial Japan's surrender to Allied Forces. With Victory in Europe (VE Day) declared in May 1945, some have felt that historically VJ Day has been overlooked, undervaluing the sacrifices of those who continued to fight on for another three months. \n                  Palace confirms date of Trump's state visit - with King and Queen to host him at Windsor Castle\n                 \n                  Senior aides to King and Prince Harry pictured meeting in London\n                 \n                  King Charles asks RNLI crew whether they 'get a lot?' while discussing small boat crossings\n                 In his message, the King will say that the service and sacrifice of those who fought and died in the Pacific and Far East \"shall never be forgotten\". He will also refer to the experience endured by prisoners of war and to the innocent civilians of occupied lands in the region. Read more:UK veteran, 100, recalls witnessing Japan's Second World War surrenderSurvivors' relatives pledge to make Nagasaki last ever atomic bomb siteMy grandmother survived world's deadliest air raid King Charles and Queen Camilla will also publicly mark the anniversary by attending a national service of remembrance at the National Memorial Arboretum in Staffordshire. The service, run in partnership with the Royal British Legion, will be attended by Burma Star recipients, a veteran of the British Indian Army and those involved in the Battles of Kohima and Imphal. Prisoners of war held across the region and veterans stationed in the UK or Commonwealth countries who contributed to the war effort will also attend. A two-minute national silence will be held at midday."
    },
    {
        "title": "British veteran, 100, recalls witnessing Japan's Second World War surrender on USS Missouri",
        "description": "A British veteran has spoken about how he witnessed Japan's wartime surrender up close as a 20-year-old sailor.",
        "url": "https://news.sky.com/story/british-veteran-100-recalls-witnessing-japans-second-world-war-surrender-on-uss-missouri-13411695",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-reg-draper-elton-vj_6990781.jpg?20250814153949",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-14 23:01:00",
        "Headline": "As a young sailor, Reg Draper had a privileged view of the moment Japan surrendered and the Second World War was over for good.",
        "Content": "A British veteran has spoken about how he witnessed Japan's wartime surrender up close as a 20-year-old sailor. Reg Draper was off Japan's coast on the HMS Duke of York when the captain announced the war was ending. Recalling that moment - 80 years ago today - he said cheers went up from the battleship's crew.  Mr Draper saw the Japanese sign the agreement on USS Missouri when he went on board to help his friend, who was the ship's photographer. \"All the ships mustered in Tokyo Bay with the USS Missouri, which was the American ship, and it was on the Missouri where they signed the peace treaty,\" the 100-year-old recalled. \"Then we all came back down to Australia and we went and celebrated - we went down to Tasmania and everybody had four days leave in Hobart. \"Everybody wanted to take us to their home and there were a couple of dances in the dance hall.\" \n                  King to warn that sacrifices of VJ Day veterans should 'never be forgotten'\n                 \n                  Dunkirk anniversary: 85 years on from historic rescue of Allied troops, little ships recreate Operation Dynamo\n                 \n                  King and Queen attend VE Day 80th anniversary service at Westminster Abbey\n                 Mr Draper, who grew up in Leeds, was a stores assistant on the Duke of York after volunteering on his 18th birthday. His duties included rationing out the rum so all the sailors could get their 11am hit. He said senior crew got theirs neat while everyone else had theirs watered down. He also recalled being clattered by Prince Philip after the Queen's future husband, who was on a destroyer escorting his ship, came aboard. \"We used to have deck hockey on the quarter deck and it was murder playing deck hockey,\" said Mr Draper. \"He [Philip] knocked me over once and then the next time he came round he hit me, there's still a mark there, he gave me a clout with his hockey stick. \"He came to see me just to see how I was. They just put a stitch in and it was alright.\" The pair met again in 1972 when Mr Draper was training sea cadets for the Duke of Edinburgh awards. He said Philip noticed his medals and recalled escorting the ship - but didn't mention the hockey game.  Mr Draper's time on the Duke of York included Arctic convoys to deliver supplies to Russia and sailing to Sydney, Australia, in 1945 before joining the East Indies Fleet. \"We started going up to the islands, kicking the Japanese out of the islands as we went,\" he recalled. Japan surrendered after the US dropped two nuclear bombs on Hiroshima and Nagasaki, on 6 and 9 August. Read more:Hiroshima survivor has stark warning for us allMy grandmother survived world's deadliest air raid Mr Draper turned 21 on the trip back to Europe and said 2,000 people were on board as they had picked up prisoners of war. He went on to become an insurance salesman and said he's planning to watch today's 80th anniversary commemorations from his home in Elton, Cheshire. The King released an audio message in which he said the sacrifices of VJ Day veterans should \"never be forgotten\". He described how the heroic actions of those sent to fight in the Far East, as well as the brutal treatment of civilians, \"reminds us that war's true cost extends beyond battlefields, touching every aspect of life\"."
    },
    {
        "title": "Oasis fan dies in hotel room hours before show in Edinburgh",
        "description": "An Italian fan of Oasis died in his hotel room just hours before he was due to see the band in Edinburgh last week.",
        "url": "https://news.sky.com/story/oasis-fan-dies-in-hotel-room-hours-before-show-in-edinburgh-13411861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-croce-alessandro_6991128.jpg?20250814221313",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-14 20:02:00",
        "Headline": "Alessandro Croce, 30, from Teramo, Italy, died after collapsing at his hotel on 9 August. He was reportedly getting ready to attend the Oasis concert at Murrayfield Stadium when he suddenly took ill.",
        "Content": "An Italian fan of Oasis died in his hotel room just hours before he was due to see the band in Edinburgh last week. Alessandro Croce, 30, from Teramo in central Italy, died after collapsing at his hotel on 9 August. He was reportedly getting ready to attend the event at Murrayfield Stadium when he suddenly took ill. His friends tried to resuscitate him as they waited for the emergency services to arrive. Paramedics also tried to save him, but all efforts were unsuccessful. Initial reports indicated Mr Croce suffered a cardiac arrest, Sky News Italia said. Tributes poured in for the dentist and amateur basketball player. Mayor of Teramo Gianguido D'Alberto said in a statement on social media that \"our city is profoundly shaken by the passing of Alessandro Croce\". He sent his condolences to the 30-year-old's family, including his parents and his sister, Giulia. Basketball Teramo said they were \"literally devastated\" and their community felt \"deep pain\" at the \"sudden and premature\" passing of their player. \"Alessandro was not only a pillar of our team, but an integral part of our history and of the heart of our association,\" a statement on social media reads. \"His memory and smile will remain forever alive in every match.\""
    },
    {
        "title": "Mounjaro manufacturer to hike UK price of weight loss drug by up to 170%",
        "description": "The UK cost of weight loss drug Mounjaro will increase by up to 170%, its US manufacturer has said, as the White House pushes for a price hike abroad so costs can be cut for Americans.",
        "url": "https://news.sky.com/story/mounjaro-manufacturer-to-hike-uk-price-of-weight-loss-drug-by-up-to-170-13411815",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mounjaro-weight-loss_6948297.jpg?20250623033923",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-14 18:05:00",
        "Headline": "The price for a month's supply of the highest dose of the medicine will increase from £122 to £330, Lilly said, adding the adjustment will be made by next month.",
        "Content": "The UK cost of weight loss drug Mounjaro will increase by up to 170%, its US manufacturer has said, as the White House pushes for a price hike abroad so costs can be cut for Americans. The new price, announced by manufacturer Eli Lilly on Thursday, also applies to Lilly's type 2 diabetes medicine that has the same name. The price for a month's supply of the highest dose of the medicine will increase from £122 to £330, Lilly said, adding the adjustment will be made next month. The higher price will not affect those prescribed the medicine through the NHS, which has a separate deal, a Lilly spokesperson said. The US drugmaker said that when it launched Mounjaro in the UK it agreed to a list price \"significantly below\" that in its three other European markets to prevent delays in availability through the NHS. \"We are now aligning the list price more consistently,\" Lilly said. Lilly did not say what price it has agreed with the NHS, but said it was working with private UK healthcare providers who can set their own prices, such as online pharmacies, to ensure the medicines remain available. \n                  Causes, symptoms and how to prevent chikungunya - as cases rise in the UK\n                 \n                  Cancer survival rates rise substantially but 'longer waits' hit progress for more deadly types of the disease, say researchers\n                 \n                  Calling all learner drivers - new theory test questions on the way\n                 It follows Sky News earlier this month revealing only eight of 42 NHS Integrated Care Boards in England were providing the weight loss treatment to patients, and many of the rest were unable to guarantee when it would be available.  Lilly's decision comes as US President Donald Trump is pushing for lower domestic prices while encouraging price hikes overseas. The US pays more for prescription drugs than any other country, often nearly three times as much as other developednations. Mr Trump says he wants to narrow this gap to stop Americans from being \"ripped off\". Read more: Why the wait for Mounjaro on the NHS?How weight loss injections work The company issued a statement online saying: \"Lilly supports the administration's goal of keeping the United States the world's leading destination for biopharmaceutical research and manufacturing, and the objective of more fairly sharing the costs of breakthrough medical research across developed countries. \"This rebalancing may be difficult, but it means the prices for medicines paid by governments and health systems need to increase in other developed markets like Europe in order to make them lower in the US.\""
    },
    {
        "title": "Boy, 16, arrested on suspicion of rape and murder after 13-year-old girl's 'unexplained' death",
        "description": "A 16-year-old boy has been arrested on suspicion of rape and murder after the \"unexplained\" death of a 13-year-old girl.",
        "url": "https://news.sky.com/story/investigation-into-unexplained-death-of-13-year-old-girl-in-huddersfield-under-way-13411811",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-huddersfield-sheepridge_6991008.jpg?20250814191701",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-14 17:50:00",
        "Headline": "Police were called to a flat at around 11:36pm on Monday night following a report a girl was unresponsive.",
        "Content": "A 16-year-old boy has been arrested on suspicion of rape and murder after the \"unexplained\" death of a 13-year-old girl. West Yorkshire Police said a post-mortem examination \"was not able to determine\" how the girl died and that officers were continuing to investigate. Police said they were called to a flat in Sheepridge Road in Huddersfield at around 11:36pm on Monday night following a report a girl was unresponsive. She died in hospital in the early hours of Tuesday morning, West Yorkshire Police said. The 16-year-old boy remains in custody. Read more from Sky News:Fourteen injured after children's rollercoaster 'derails'Travellers warned after rise in chikungunya infections Detective Chief Inspector Stacey Atkinson said: \"We are continuing to conduct a number of inquiries today following the death of a 13-year-old girl.\" She added: \"A post mortem was not able to determine how she died, and we continue to treat her death as unexplained at this time, pending more inquiries. \"Those inquiries are complex and are likely to be lengthy as we work to fully understand the circumstances of the girl's death. \"Specially trained officers are supporting her family at this time.\" The force said the 16-year-old boy was arrested on suspicion of another offence of rape relating to a 16-year-old girl from a separate incident elsewhere in the Kirklees district."
    },
    {
        "title": "Vivergo: How US-UK trade deal could bring about collapse of huge renewable energy plant in Hull",
        "description": "The smell of yeast still hangs in the air at the Vivergo plant in Hull but the machines have fallen quiet.&#160;",
        "url": "https://news.sky.com/story/vivergo-how-us-uk-trade-deal-could-bring-about-collapse-of-huge-renewable-energy-plant-in-hull-13411833",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vivergo-hull-plant_6991078.png?20250814210458",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-14 18:58:00",
        "Headline": "Vivergo was already being annihilated by US rivals before the trade deal allowed 1.4 billion litres of American ethanol to be imported into the UK tariff-free.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n The smell of yeast still hangs in the air at the Vivergo plant in Hull but the machines have fallen quiet.  More than 100 lorries usually pass through here each day, carrying 3,000 tonnes of wheat. It is milled, fermented and distilled. The final product is bioethanol, a renewable fuel that is then blended into E10 petrol. This is a vast operation. It took several years to build, with considerable investment, but it is on the verge of closing down. Management and staff are holding out for a last-minute reprieve from the government but time is running out. It's been a turbulent journey. The plant was already being annihilated by US rivals, losing about £3m a month. Vivergo and Ensus, based in Teesside, blamed regulations that enable US companies to earn double subsidies. They were pushing for regulatory change but then a killer blow: The US-UK trade deal, which allows 1.4 billion litres of American ethanol into the UK tariff-free (down from 19%). \"We've effectively given the whole of the UK market to the US producers,\" said Ben Hackett, managing director at Vivergo. \"If we were to have the same support that the US industry has, if we could use genetically modified crops, we wouldn't need that tariff. We would be able to compete. If we had the same energy costs. We wouldn't need those tariffs.\" \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 \n                  UK quarterly GDP slows as economy feels effect of higher business costs\n                 \n                  Something for everyone in UK's latest GDP data\n                 The government has the weekend to come up with a plan that could keep the business running. If it fails, Vivergo will begin issuing redundancy notices to its 160 staff. It's a devastating prospect for workers, many of them live in Hull and are nervous about alternative opportunities in the area. Mike Walsh, a logistics manager who has been working at the plant for 14 years, said: \"It's not a great place to be at the moment. It's a very well paid, very high-skilled role and they've (Vivergo) given everybody an opportunity in an area that doesn't pay that well…. The jobs market isn't as good as what people would like. So it does impact the local economy.\" He called on the government to \"help us, save us, give this industry a future\". His colleague Claire Wood, lead productions engineer, said: \"I moved here after a career in oil and gas for 10 years, partly because I want to be part of the transition to renewable fuels. I can see so much potential here and it's absolutely devastating to know that this place might be closed very, very shortly and that all that potential just goes away.\" Thousands more could be affected. Haulage companies may have to lay off truck drivers and farmers could also suffer a blow. Vivergo makes bioethanol using wheat. That wheat is bought from farms from Yorkshire and Lincolnshire. The National Farmers Union has sounded the alarm, saying: \"Biofuels are extremely important for the crops sector, and their domestic demand of up to two million tonnes can be very important to balance supply and demand and to produce up to one million tonnes of animal feed as a by-product.\" Another bioproduct is carbon dioxide. The gas can be captured and used to put the fizz in drinks or injected into packaging to preserve food. If Vivergo and Ensus were to go, Britain would lose as much as 80% of its output of carbon dioxide. Supplies are already tight across Europe, meaning this decision could compound shortages across a range of sectors, from meat-packing to healthcare. The industry is calling on the government to help. Vivergo says it needs temporary financial support but that the government must create a regulatory and commercial environment in which it can thrive. It says rules that award double subsidies to companies that use waste product in their bioethanol must be changed. At present, these rules are being used by US companies that make ethanol from Uldr - a by-product of processing corn. They argue this is not a genuine waste product. Read more money news:Something for everyone in latest economic dataClaire's falls into administrationLola's Cupcakes bakes £30m takeover by Finsbury Food Another option is to grow the market. Industry leaders are calling on ministers to increase the mandated renewable fuel content in petrol from 10% to 15% and for an expansion into aviation fuels. That would allow British companies to carve out a space. The government has been locked in talks with the company since June. It said: \"We will continue to take proactive steps to address the long-standing challenges it faces and remain committed to a way forward that protects supply chains, jobs and livelihoods.\" However, the time for talking is almost over. Mr Hackett said he had no idea how the government would respond but he was firm with his stance, saying: \"In times of global uncertainty, losing that energy certainty and supply from the UK is a problem. \"I think what they're missing out on is the future growth agenda. We're the foundation on which the green industrial strategy can be built. We make bioethanol that today decarbonises transport. Tomorrow it will decarbonise marine. It will decarbonise aviation.\""
    },
    {
        "title": "Man accused of driving into crowds at Liverpool victory parade faces further 24 charges",
        "description": "A man accused of driving into crowds at Liverpool FC's title parade faces 24 new charges.",
        "url": "https://news.sky.com/story/man-accused-of-driving-into-crowds-at-liverpool-victory-parade-faces-further-24-charges-13411401",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-doyle-liverpool_6930591.jpg?20250529173146",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-14 09:41:00",
        "Headline": "Six of the new alleged offences relate to children, including one six-month-old and one seven-month-old. More than 130 people were injured during the 26 May incident as hordes of fans celebrated Liverpool FC's title win.",
        "Content": "A man accused of driving into crowds at Liverpool FC's title parade faces 24 new charges. More than 130 people, including children, were injured when Paul Doyle allegedly drove his Ford Galaxy vehicle into hordes of fans at the celebrations on 26 May. The 53-year-old, of Croxteth, Liverpool, was originally charged with two counts of wounding with intent, two counts of causing grievous bodily harm with intent, two counts of attempted grievous bodily harm with intent, and one count of dangerous driving. Six of the new alleged offences relate to babies, including one six-month-old and one seven-month-old, proceedings at Liverpool Crown Court heard on Thursday. The new indictment, which was not read out in court, now has 31 counts relating to 29 victims, aged between six months and 77 years old. Doyle now faces 18 counts of attempting to cause grievous bodily harm, nine counts of causing grievous bodily harm with intent, two counts of wounding with intent, one count of dangerous driving and one count of affray. He appeared in court via video link from prison and was in tears. Read more from Sky News:Fourteen injured after children's rollercoaster 'derails'Travellers warned after rise in chikungunya infectionsPhotos of 'zombie rabbits' go viral - yes, they're real He did not enter any pleas during the hearing, which lasted around 20 minutes. The case was adjourned until 4 September, when Doyle is expected to enter pleas."
    },
    {
        "title": "A-level results show deepening inequality despite vows to tackle attainment gaps",
        "description": "With results for Level 3 qualifications released today, a Sky News Data & Forensics unit analysis shows growing regional attainment gaps in A-levels that experts say ultimately tie to deprivation.",
        "url": "https://news.sky.com/story/a-level-results-show-deepening-inequality-despite-vows-to-tackle-attainment-gaps-13411676",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-alevels-results-day_6990836.jpg?20250814161816",
        "type": "UK",
        "Author": "Kate Schneider, data journalist",
        "Date Published": "2025-08-14 13:18:00",
        "Headline": "The gap between the percentage of A-level students receiving top grades in top-performing regions compared with lower performing ones has widened since last year.",
        "Content": "By Kate Schneider, data journalist  With results for Level 3 qualifications released today, a Sky News Data & Forensics unit analysis shows growing regional attainment gaps in A-levels that experts say ultimately tie to deprivation. Across the country, the proportion of students receiving top grades, counted as A or A*, grew to 28.3%, the highest since 2002 excluding pandemic years. Nonetheless, some regions failed to keep pace with the rest of the country. The North East of England, which ranked last in this year's results, saw the proportion of its students achieving top grades drop by a percentage point. Schools North East, which represents over 1,150 schools, said these results show \"the North East's educational challenge is not about standards in our schools, but about structural inequalities that hold back students' opportunities\". Meanwhile, London remained the top-ranked region this year. The proportion of its students with top grades increased by 0.7 percentage points.   \n                  A-level top grades rise again, but regional inequalities 'getting worse'\n                 \n                  Is a degree worth it?\n                 \n                  Can universities make their sums work?\n                 Chris Paterson, co-chief executive of the educational charity Education Endowment Foundation, said: \"The gap in outcomes between regions driven by relative levels of affluence and deprivation remains striking and, looks from the data today, to actually have widened.\" Education Secretary Bridget Phillipson earlier this week decried the \"scandal\" of relatively poor achievement rates recorded among white working class children and announced a government white paper this autumn to address the issue. \"Put simply, these children have been betrayed,\" said Ms Phillipson. Top grades more likely at private schools Significant gaps also exist between students at state-funded versus fee-paying schools. Nearly half of A-level students at private schools earned top grades compared with 25.4% of students at state-funded schools. Mr Paterson explained that generally more affluent students at private schools can mean access to enhanced opportunities such as tutoring. Private schools also tend to have better teacher retention and recruitment rates than their state-funded counterparts. Within-region breakdown shows stark inequalities While high-level data has shown growing achievement gaps between regions of England, a breakdown by county reveals even further disparities. Among all English counties, Rutland recorded the highest percentage, or 40%, of students receiving A or A*.  This is despite its region, the East Midlands, overall ranking second lowest for proportion of students achieving top grades. The Isle of Wight recorded the lowest percentage of high achievers at 15.8%. Yet, its region, the South East, was overall second-best for top grades, with 31.2% of its students receiving A or A* - nearly twice as much. These differences are not \"about ability between different children in those different regions\", Mr Paterson said. \"It's about relative access to opportunity more fundamentally than anything else.\" University acceptances reach record high Despite these challenges, there is still much to celebrate on Results Day, with a record number of undergraduate acceptances issued this year. As well, the number of 18-year-olds accepted from the most deprived areas in England, Wales, and Northern Ireland increased this year by 6.4%, according to UCAS. A-level grades are just one factor among many considered by universities, explained Joanna Burton, head of policy, higher education, for the Russell Group. \"The people that work in admissions teams are very experienced in taking into consideration lots of different factors about an applicant. So, yes, of course their grades are really important,\" said Ms Burton. \"But there's all these other factors which might have had an impact on that student reaching their potential.\" That being said, \"it would be very important to reiterate that a university would never accept a student on if they didn't believe them to be fully capable of making the most of the course and to succeed on the course\", added Ms Burton. Subject choice shows gender differences STEM (science, technology, engineering, and mathematics) subjects are growing in popularity among A-level students. For many years running, mathematics remained the most popular subject, with nearly a third of students sitting its exam. Three other STEM subjects and history rounded out the top five. Since 2019, history has fallen in popularity by 18% while subjects like business studies and economics have surged. In overall results, boys were more likely than girls to receive A*s. However, about the same proportion of boys and girls were likely to receive A or A*. And, when looking at the proportion of students receiving grades ranging from B to A*, girls outperformed boys by several percentage points. Nonetheless, differences by gender emerge when looking at subject choices. Boys were significantly more likely to choose subjects like computing, physics, accounting, and further mathematics, while girls made up more than 90% of the students taking health and social care (double) and performing/expressive arts. T-levels growing in popularity but many students drop out Uptake on T-levels has grown by 61.4% on last year but remains low compared with A-levels. Results for 814,335 A-level students were released on Thursday in contrast with 11,909 T-level students. T-levels are two-year courses taken post-GCSE that combine in-class learning with hands-on job experience. They were first introduced in 2020 by former prime minister Boris Johnson and are intended to replace myriad other post-GCSE technical paths such as BTECs with a standardised vocational qualification. Yet, since their introduction, T-levels have struggled with poor enrolment, high failure rates, and low retention. The Department for Education's initial estimate of how many students would be starting T-levels in the 2024-25 school year was 102,500. The actual number of students starting this past year was 25,508. \"People are just not aware of T-levels,\" said Robbie Maris, a researcher with the Education Policy Institute, an educational research charity. More than a quarter of T-level entrants are also quitting their courses before reaching completion. This poor retention rate can be tied to a mismatch between students' expectations upon starting their T-levels and their actual experiences, said Mr Maris. \"One of the biggest issues has been in that first year, there was just far too much content. It was way more difficult than students had expected,\" he said. Overall, said Mr Maris, many of the T-levels pathways are still in their \"teething\" stage. 👉 Listen to Sky News Daily on your podcast app 👈 Despite these challenges, he pointed to several successes of the programme so far. Namely, students who successfully complete their T-levels are significantly more likely to progress on to higher technical study and advanced apprenticeships than students on all other academic or vocational paths, according Education Policy Institute research released on Thursday. \"Students who do successfully stay on a T-level and complete do go on to achieve good outcomes,\" said Mr Maris. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Men jailed after kidnapping pregnant mum and threatening to cut her fingers off",
        "description": "Three men have been jailed after kidnapping a pregnant mother from outside her north London home and threatening to cut her fingers off, police have said.",
        "url": "https://news.sky.com/story/men-jailed-after-kidnapping-pregnant-mum-and-threatening-to-cut-her-fingers-off-13411794",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-audi-johnson-ahmad-ghiasi_6990891.jpg?20250814170643",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-14 17:04:00",
        "Headline": "The 36-year-old victim was bundled into the back of a white Ford Transit van before being blindfolded and bound at the wrist with cable ties by the gang as they sped away.",
        "Content": "Three men have been jailed after kidnapping a pregnant mother from outside her north London home and threatening to cut her fingers off, police have said. Audi Johnson, 35, Ahmad Ghiasi, 26, and Nicholas Mitchell, 55, were members of a London-based gang that was contracted to carry out the abduction in Enfield on the morning of 10 May last year, the force added. The 36-year-old victim, who has not been named, was bundled into the back of a white Ford Transit van before being blindfolded and bound at the wrist with cable ties by the gang as they sped away.   They then fired questions at her about her partner where one of them threatened: \"If you lie to me I'm gonna kick the baby out your stomach.\" The men later made a series of phone calls to her partner as they threatened to cut off her fingers if he did not quickly carry out their demands for money and valuable jewellery, the Metropolitan Police said. Johnson, Ghiasi and Mitchell were found guilty of conspiracy to kidnap last month after a six-week trial at Kingston Crown Court. Mother will 'never be the same again' The victim said she has not been able to go home since the traumatic ordeal and spent the rest of her pregnancy sleeping on her sister's couch. In her impact statement, she told the court: \"The incident ruined my life. I will never be the same person again. I am having to start my life all over again. \"I will forever have fear and paranoia as part of my life now. I didn't deserve to be a victim of what happened to me. And to top it off, it was all made so much worse by being pregnant. \"This will always be something that will be part of my pregnancy, which is meant to be a happy experience, and will always be something that is a part of my daughter.\" The victim was kidnapped as she waited for a cab to take her to a personal training session with her mother and sister. She was walking along the curb close to her home when she was suddenly grabbed and thrown into the back of the van. Read more from Sky News:Fourteen injured after children's rollercoaster 'derails'Travellers warned after rise in chikungunya infectionsPhotos of 'zombie rabbits' go viral - yes, they're real Despite being blindfolded and bound at the wrist, when the woman was left alone in the van she managed to escape before flagging down a cab and travelling to the safety of her mother's house. A police spokesman said the Met's Flying Squad responded to the crime immediately. They tracked the van using CCTV and located the vehicle the same night the woman managed to escape. DNA evidence, fingerprint impressions and mobile phone data were used to identify the suspects. The police said Johnson, of Cranberry Close, Northolt, had pleaded guilty to conspiracy to kidnap and was sentenced to five years and four months. Ghiasi, of Fourth Avenue, Luton, was sentenced to seven years for conspiracy to kidnap. Mitchell, of Mannock Close, Barnet, was sentenced to nine years for conspiracy to kidnap."
    },
    {
        "title": "Ukrainians are appalled at Trump's naive and cack-handed diplomacy",
        "description": "For Ukrainians, the spectacle of Vladimir Putin and Donald Trump meeting in Alaska will be repugnant.",
        "url": "https://news.sky.com/story/ukrainians-are-appalled-at-trumps-naive-and-cack-handed-diplomacy-13411865",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russia-ukraine_6991101.jpg?20250814214145",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-14 20:20:00",
        "Headline": "Putin is sending a team of foreign affairs heavyweights to Alaska, adept at getting the better of opponents in negotiations. Trump is relying on Steve Witkoff, a real estate lawyer and foreign policy novice.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  For Ukrainians, the spectacle of Vladimir Putin and Donald Trump meeting in Alaska will be repugnant. The man behind an unprovoked invasion of their country is being honoured with a return to the world stage by the leader of a country that was meant to be their ally. And they feel let down. Follow latest updates from Ukraine war President Trump had threatened severe sanctions on Russia within 50 days if Russia didn't agree to a deal. He had seemed close to imposing them before letting Putin wriggle off the hook yet again. But they are not surprised. At every stage, Trump has either sided with Russia or at least given them the benefit of the doubt. It is clear that Putin has some kind of hold over this American president, in their minds and many others. \n                  Past US-Russia summits required detailed preparation - but will Trump surprise us all?\n                 \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 Ukraine wants three things out of these talks. A ceasefire, security guarantees and reparations. It is not clear at this stage that they will get any of them. Ukrainians and their European allies are appalled at the naive and cack-handed diplomacy that has preceded this meeting. Vladimir Putin is sending a team of foreign affairs heavyweights, adept at getting the better of opponents in negotiations. There are, the Financial Times reported this week, no Russia specialists left at the Trump White House. Instead, Trump is relying on Steve Witkoff, a real estate lawyer and foreign policy novice, who has demonstrated a haphazard mastery of his brief and breathtaking credulity with the Russians.  Former British spy chief Sir Alex Younger described him today as totally out of his depth. Trump, he says, is being played like a fiddle by Putin. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summit There is a fundamental misunderstanding of the conflict at the heart of the Trump administration's handling of it. Witkoff and the president see it in terms of real estate. But it has never been about territory. Vladimir Putin has made it abundantly clear that Ukraine's existence as a sovereign democratic entity cannot be tolerated. He has made no pretence that his views on that have changed. Ukrainians know that and fear any deal cooked up in Alaska will be used by Putin on the path towards that ultimate goal"
    },
    {
        "title": "At least 56 dead and dozens missing after flash flooding in Indian Himalayas",
        "description": "At least 56 people have been killed after flash flooding hit a remote, mountainous village in Indian-controlled Kashmir.",
        "url": "https://news.sky.com/story/at-least-44-dead-and-dozens-missing-after-flash-flooding-in-indian-himalayas-13411661",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chositi-kashmir-india_6990619.jpg?20250814134520",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-14 12:44:00",
        "Headline": "Floods, triggered by torrential rains, hit a village used as a stopover by Hindu pilgrims visiting a mountainous shrine in Jammu and Kashmir. ",
        "Content": "At least 56 people have been killed after flash flooding hit a remote, mountainous village in Indian-controlled Kashmir. Estimates suggest at least 80 people are still missing in the devastated Himalayan village of Chasoti, in the Jammu and Kashmir region, according to local officials. Rescue teams have brought 300 people to safety, they added. Chasoti, around 85 miles (136km) northeast of Jammu, is the last village accessible to vehicles on the route of an annual Hindu pilgrimage to a mountainous shrine, the Machail Mata temple. The devastating floods swept away the main community kitchen, where more than 200 pilgrims were gathered, as well as dozens of vehicles and motorbikes, officials said. Abdul Majeed Bichoo, a local resident from a neighbouring village, said he witnessed the bodies of eight people being pulled out from under the mud. The 75-year-old said Chasoti had become a \"sight of complete devastation from all sides\". \n                  India flash floods: Race to find survivors after at least four killed as homes and hotels destroyed\n                 \n                  Actor Dhanush criticises AI-altered ending for re-release of hit film Raanjhanaa\n                 \n                  India hints it will keep buying Russian oil - despite Trump threats\n                 \"It was heartbreaking and an unbearable sight,\" he continued. \"I have not seen this kind of destruction of life and property in my life.\" India's deputy minister for science and technology, Jitendra Singh, said the floods were triggered by torrential rains. Sudden, intense downpours over small areas - known as cloudbursts - are increasingly common in India's Himalayan regions, which are prone to flash floods and landslides. Last week, floodwater crashed through an entire Himalayan village in India's Uttarakhand state.  Television footage showed pilgrims in Chasoti crying in fear as water flooded the village. At least 50 of the rescued people were badly injured and were being treated in local hospitals, local official Susheel Kumar Sharma said. Officials said the Hindu pilgrimage, which began in July and was scheduled to end on 5 September, has been suspended. More rescue teams were on the way to the area, they added. Read more from Sky News:Rescue after Uttarkashi floodsWhat to expect from Ukraine summitBaby Shark copyright case Ramesh Kumar, the divisional commissioner of Kishtwar district, told news agency ANI that local police and disaster response officials had reached the scene. \"Army, air force teams have also been activated. Search and rescue operations are underway,\" Mr Kumar said. Indian Prime Minister Narendra Modi said \"the situation is being monitored closely\" and offered his prayers to \"all those affected by the cloudburst and flooding.\" Cloudbursts can cause intense flooding and landslides, and have increased in recent years, partly due to climate change. Damage from the storms has also been exacerbated by unplanned development in mountain regions."
    },
    {
        "title": "Israeli minister announces plans for new West Bank settlement to 'bury' idea of Palestinian state",
        "description": "Israel's far-right finance minister has announced plans to build a new settlement in the Israeli-occupied West Bank, which he said would \"bury\" the idea of a Palestinian state.",
        "url": "https://news.sky.com/story/israeli-minister-announces-plans-for-new-west-bank-settlement-to-bury-idea-of-palestinian-state-13411680",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-west-bank-smotrich_6990708.jpg?20250814143841",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-14 13:26:00",
        "Headline": "Palestinians and rights groups said the settlement would effectively cut the West Bank into two separate parts and rob them of any chance to build a Palestinian state.",
        "Content": " Israel's far-right finance minister has announced plans to build a new settlement in the Israeli-occupied West Bank, which he said would \"bury\" the idea of a Palestinian state. Palestinians and rights groups said the settlement would effectively cut the West Bank into two separate parts and rob them of any chance to build a Palestinian state. This comes as several countries, including the UK, said they would recognise a Palestinian state in September, unless Israel meets several conditions, including agreeing to a ceasefire in Gaza. \"This reality finally buries the idea of a Palestinian state, because there is nothing to recognise and no one to recognise,\" finance minister Bezalel Smotrich said as he announced the construction plans. \"Anyone in the world who tries today to recognise a Palestinian state will receive an answer from us on the ground.\" The settlement is planned to be built in E1, an open tract of land east of Jerusalem, and includes around 3,500 apartments to expand the existing settlement of Maale Adumim, Mr Smotrich said. E1 has been eyed for Israeli development for more than two decades, but plans were halted due to pressure from the US during previous administrations. \n                  Inside settler violence in the West Bank\n                 \n                  West Bank: The city locked down by armed troops - where what was law now has no place in reality\n                 \n                  Settlers and segregation: Inside the conflict forcing Palestinians from their homes\n                 Read more:Inside the conflict forcing Palestinians from their homesThe city where what was law now has no place in reality Now-US President Donald Trump and the US ambassador to Israel, Mike Huckabee, were praised on Thursday by Mr Smotrich as \"true friends of Israel as we have never had before\". Mr Smotrich, himself a Jewish settler, told Sky News' international correspondent Diana Magnay that Israeli Prime Minister Benjamin Netanyahu and Mr Trump had agreed to the revival of the E1 scheme. There was no confirmation of this claim from either leader. The E1 plan has not yet received its final approval, which is expected next week. Foreign Secretary David Lammy has said the UK strongly opposes the plan, calling it a \"flagrant breach of international law and must be stopped now\".  Construction of homes 'within a year' Peace Now, which tracks settlement activity in the West Bank, said some bureaucratic steps remain before construction could begin, including the approval of Israel's high planning council. But if the process moves quickly, infrastructure work could start in the next few months, with the construction of homes to follow in about a year. \"The E1 plan is deadly for the future of Israel and for any chance of achieving a peaceful two-state solution. We are standing at the edge of an abyss, and the government is driving us forward at full speed,\" Peace Now said in a statement. It added that the plan was \"guaranteeing many more years of bloodshed\". Mr Smotrich was also criticised by an Israeli rights group established by former Israel Defence Forces (IDF) soldiers, who accused the far-right politician of encouraging West Bank settlement activity while the world's attention was on the Gaza war. As well as official, government-approved settlements, there are also Israeli outposts, which are established without government approval and are considered illegal by Israeli authorities. But reports suggest the government often turns a blind eye to their creation. In May, Mr Netanyahu's government approved 22 new settlements, including the legalisation of outposts that had previously been built without authorisation. Since the Hamas-led attacks on 7 October 2023 and Israel's subsequent military bombardment of Gaza, more than 100 Israeli outposts have been established, according to Peace Now. Settler violence against Palestinians has also increased, according to the UN, with an average of 118 incidents each month - up from 108 in 2023, which was already a record year. International correspondent Bezalel Smotrich is pumped. His dreams of resettlement and annexation of the West Bank have never been closer to fruition.  The E1 settlement plan, which would cut the West Bank from East Jerusalem, was first conceived back in 1995 by then prime minister Yitzhak Rabin. Thirty years later, the extremist settler contingent within the government seems to be on the verge of making it a reality. The prime minister's office has yet to confirm Benjamin Netanyahu's backing, but according to Smotrich, both he and President Trump are on board. E1 (or T1 as they say they will call it, in honour of Donald Trump) would be another symbolic blow to the very notion of Palestinian statehood, as is every settlement and piece of related infrastructure which Israel builds in the occupied West Bank. At a time when the UK, France and others all say they will recognise a Palestinian state unless Israel pushes for a ceasefire in Gaza, Netanyahu's government is doubling down.  Per Smotrich, their response will come through roads, buildings, neighbourhoods, the spread of Jewish life across Palestinian lands in the West Bank - the creation of facts on the ground.  The UK, France and many others in the international community may not like it, but the real power-broker here, certainly as far as Netanyahu is concerned, is Donald Trump.  He is the president who moved the US embassy to Jerusalem; his ambassador has said there is no such thing as the West Bank.  For the likes of Smotrich, that is all the encouragement they need. Plans criticised as 'extension of genocide' The Palestinian foreign ministry called the settlement plan an extension of the crimes of genocide, displacement and annexation. Israel has long disputed accusations of genocide and rights abuses, saying it is acting in self-defence. Nabil Abu Rudeineh, the Palestinian president's spokesperson, called on the US to pressure Israel to stop the building of settlements. Hamas said the plan was part of Israel's \"colonial, extremist\" policies and called on Palestinians to confront it. Qatar, which has been acting as a mediator between Hamas and Israel in a bid to secure a ceasefire in Gaza, said the move was a flagrant violation of international law. \"The EU rejects any territorial change that is not part of a political agreement between involved parties. So annexation of territory is illegal under international law,\" European Commission spokesperson Anitta Hipper said. Today, an estimated 700,000 Israeli settlers live in the West Bank and East Jerusalem. There is also a growing movement of Israelis wanting to build settlements in Gaza. Settlers make up around 5% of Israel's population and 15% of the West Bank's population, according to data from Peace Now. Settlements are illegal under international law and have been condemned by the UN. They are, however, authorised by the Israeli government. According to the Israel Policy Forum, the settlement programme is intended to protect Israel's security, with settlers acting as the first line of defence \"against an invasion\". Mr Smotrich's settlement announcement comes after the UK, Canada, Australia and New Zealand on Mr Smotrich and his fellow far-right cabinet member, Itamar Ben-Gvir, for \"repeated incitements of violence against Palestinian civilians\" in the West Bank.  Foreign Secretary David Lammy said in June that the ministers had been \"encouraging egregious abuses of human rights\" for \"months\". Last year, Mr Smotrich, whose National Religious Party largely draws its support from settlers, ordered preparations for the annexation of the West Bank. His popularity has fallen in recent months, with polls showing that his party would not win a single seat in parliament in elections were held today."
    },
    {
        "title": "Baby Shark plagiarism case rejected by South Korean court",
        "description": "South Korea's courts have rejected a plagiarism claim from a US composer who argued that Baby Shark, the catchy children's tune which became a global phenomenon, had copied his track.",
        "url": "https://news.sky.com/story/baby-shark-plagiarism-case-rejected-by-south-korean-court-13411472",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-baby-shark-nickelodeon_6990400.jpg?20250814095425",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-14 10:10:00",
        "Headline": "A New York-based composer had argued that the earworm copied elements of his tune's bass line and rhythm.",
        "Content": "South Korea's courts have rejected a plagiarism claim from a US composer who argued that Baby Shark, the catchy children's tune which became a global phenomenon, had copied his track. Jonathan Wright launched his case in the South Korean courts in 2021, arguing that Baby Shark had copied his song's bass line and rhythm, infringing on the copyright of a track he had released four years earlier. However, South Korea's top court ruled against him on Thursday, noting that both tunes were based on a classic melody played at children's summer camps in the US. The Supreme Court found Wright's tune did not vary enough from the original to qualify for copyright protection, and that Baby Shark also had clear differences as a song. Pinkfong, the South Korean children's content firm which released the earworm in 2015, welcomed the ruling, which upheld those made by the country's lower courts. Wright had twice appealed against judgments in 2021 and 2023. The ruling concludes the New York-based composer's six-year fight in the South Korean courts. His lawyer called the outcome \"a little disappointing\", Reuters reported. 'Pop culture icon' worth millions Pinkfong said the court's judgment confirmed that Baby Shark was based on a \"traditional singalong chant\" in the public domain. The firm said it had boosted the tune and given it \"a fresh twist to the chant by adding an upbeat rhythm and catchy melody, turning it into the pop culture icon it is today\". Read more:Protesters sing BabyShark to calm toddlerBabyShark bath toys recalled The firm released the track in 2015 on YouTube with a Baby Shark Dance video, which went viral. It has received more than 16 billion views since then, making it one of the most popular YouTube videos on record. The song and its associated products - including TV shows, movies and touring musicals based around the family of Baby Shark characters remain a key earner for Pinkfong, which reported $32.6m (£24m) in revenue for the first half of 2025. Wright had launched a damages claim asking for compensation of $21,700."
    },
    {
        "title": "Oasis fan dies in hotel room hours before show in Edinburgh",
        "description": "An Italian fan of Oasis died in his hotel room just hours before he was due to see the band in Edinburgh last week.",
        "url": "https://news.sky.com/story/oasis-fan-dies-in-hotel-room-hours-before-show-in-edinburgh-13411861",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-croce-alessandro_6991128.jpg?20250814221313",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-14 20:02:00",
        "Headline": "Alessandro Croce, 30, from Teramo, Italy, died after collapsing at his hotel on 9 August. He was reportedly getting ready to attend the Oasis concert at Murrayfield Stadium when he suddenly took ill.",
        "Content": "An Italian fan of Oasis died in his hotel room just hours before he was due to see the band in Edinburgh last week. Alessandro Croce, 30, from Teramo in central Italy, died after collapsing at his hotel on 9 August. He was reportedly getting ready to attend the event at Murrayfield Stadium when he suddenly took ill. His friends tried to resuscitate him as they waited for the emergency services to arrive. Paramedics also tried to save him, but all efforts were unsuccessful. Initial reports indicated Mr Croce suffered a cardiac arrest, Sky News Italia said. Tributes poured in for the dentist and amateur basketball player. Mayor of Teramo Gianguido D'Alberto said in a statement on social media that \"our city is profoundly shaken by the passing of Alessandro Croce\". He sent his condolences to the 30-year-old's family, including his parents and his sister, Giulia. Basketball Teramo said they were \"literally devastated\" and their community felt \"deep pain\" at the \"sudden and premature\" passing of their player. \"Alessandro was not only a pillar of our team, but an integral part of our history and of the heart of our association,\" a statement on social media reads. \"His memory and smile will remain forever alive in every match.\""
    },
    {
        "title": "King to warn that sacrifices of VJ Day veterans should 'never be forgotten'",
        "description": "The King will issue a warning that the sacrifices of the VJ Day veterans should \"never be forgotten\" as they \"gave us more than freedom; they left us the example of how it can and must be protected\".  ",
        "url": "https://news.sky.com/story/king-to-warn-that-sacrifices-of-vj-day-veterans-should-never-be-forgotten-13411689",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-king-charles-vj-day_6990626.jpg?20250814131316",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-14 13:49:00",
        "Headline": "King Charles and Queen Camilla will also publicly mark the 80th anniversary of the end of the Second World War in the Far East by attending a national service of remembrance at the National Memorial Arboretum in Staffordshire.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The King will issue a warning that the sacrifices of the VJ Day veterans should \"never be forgotten\" as they \"gave us more than freedom; they left us the example of how it can and must be protected\".   In an audio message, due to be released on Friday morning to mark 80 years since the end of the Second World War in the Far East, King Charles will describe how the heroic actions of those sent to fight there and the brutal treatment of civilians \"reminds us that war's true cost extends beyond battlefields, touching every aspect of life\". In what could be interpreted as him alluding to current world events and conflicts, he will emphasise the importance of international collaboration, saying that victory in 1945 demonstrated that \"in times of war and in times of peace, the greatest weapons of all are not the arms you bear but the arms you link\". The six-minute audio message to the Nation, Realms and Commonwealth to mark VJ Day, echoes the audio broadcast made by his grandfather, King George VI, which the King will reference. He recorded it in the Morning Room at Clarence House earlier this month. Victory over Japan (VJ Day) was declared on 15 August 1945, following Imperial Japan's surrender to Allied Forces. With Victory in Europe (VE Day) declared in May 1945, some have felt that historically VJ Day has been overlooked, undervaluing the sacrifices of those who continued to fight on for another three months. \n                  Palace confirms date of Trump's state visit - with King and Queen to host him at Windsor Castle\n                 \n                  Senior aides to King and Prince Harry pictured meeting in London\n                 \n                  King Charles asks RNLI crew whether they 'get a lot?' while discussing small boat crossings\n                 In his message, the King will say that the service and sacrifice of those who fought and died in the Pacific and Far East \"shall never be forgotten\". He will also refer to the experience endured by prisoners of war and to the innocent civilians of occupied lands in the region. Read more:UK veteran, 100, recalls witnessing Japan's Second World War surrenderSurvivors' relatives pledge to make Nagasaki last ever atomic bomb siteMy grandmother survived world's deadliest air raid King Charles and Queen Camilla will also publicly mark the anniversary by attending a national service of remembrance at the National Memorial Arboretum in Staffordshire. The service, run in partnership with the Royal British Legion, will be attended by Burma Star recipients, a veteran of the British Indian Army and those involved in the Battles of Kohima and Imphal. Prisoners of war held across the region and veterans stationed in the UK or Commonwealth countries who contributed to the war effort will also attend. A two-minute national silence will be held at midday."
    },
    {
        "title": "Ukrainians are appalled at Trump's naive and cack-handed diplomacy",
        "description": "For Ukrainians, the spectacle of Vladimir Putin and Donald Trump meeting in Alaska will be repugnant.",
        "url": "https://news.sky.com/story/ukrainians-are-appalled-at-trumps-naive-and-cack-handed-diplomacy-13411865",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russia-ukraine_6991101.jpg?20250814214145",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-14 20:20:00",
        "Headline": "Putin is sending a team of foreign affairs heavyweights to Alaska, adept at getting the better of opponents in negotiations. Trump is relying on Steve Witkoff, a real estate lawyer and foreign policy novice.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  For Ukrainians, the spectacle of Vladimir Putin and Donald Trump meeting in Alaska will be repugnant. The man behind an unprovoked invasion of their country is being honoured with a return to the world stage by the leader of a country that was meant to be their ally. And they feel let down. Follow latest updates from Ukraine war President Trump had threatened severe sanctions on Russia within 50 days if Russia didn't agree to a deal. He had seemed close to imposing them before letting Putin wriggle off the hook yet again. But they are not surprised. At every stage, Trump has either sided with Russia or at least given them the benefit of the doubt. It is clear that Putin has some kind of hold over this American president, in their minds and many others. \n                  Past US-Russia summits required detailed preparation - but will Trump surprise us all?\n                 \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                 Ukraine wants three things out of these talks. A ceasefire, security guarantees and reparations. It is not clear at this stage that they will get any of them. Ukrainians and their European allies are appalled at the naive and cack-handed diplomacy that has preceded this meeting. Vladimir Putin is sending a team of foreign affairs heavyweights, adept at getting the better of opponents in negotiations. There are, the Financial Times reported this week, no Russia specialists left at the Trump White House. Instead, Trump is relying on Steve Witkoff, a real estate lawyer and foreign policy novice, who has demonstrated a haphazard mastery of his brief and breathtaking credulity with the Russians.  Former British spy chief Sir Alex Younger described him today as totally out of his depth. Trump, he says, is being played like a fiddle by Putin. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summit There is a fundamental misunderstanding of the conflict at the heart of the Trump administration's handling of it. Witkoff and the president see it in terms of real estate. But it has never been about territory. Vladimir Putin has made it abundantly clear that Ukraine's existence as a sovereign democratic entity cannot be tolerated. He has made no pretence that his views on that have changed. Ukrainians know that and fear any deal cooked up in Alaska will be used by Putin on the path towards that ultimate goal"
    },
    {
        "title": "Melania Trump threatens to sue Hunter Biden for $1bn over Epstein comments",
        "description": "Melania Trump has threatened to sue Hunter Biden for more than $1bn (&#163;736.5m) in damages if he does not retract comments linking her to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/melania-trump-threatens-to-sue-hunter-biden-for-1bn-over-epstein-comments-13411509",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-melania-melania-trump_6990383.jpg?20250814094418",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-14 08:44:00",
        "Headline": "Mr Biden, who is the son of former US president Joe Biden, alleged in an interview this month that sex trafficker Epstein introduced the first lady to President Donald Trump.",
        "Content": "Melania Trump has threatened to sue Hunter Biden for more than $1bn (£736.5m) in damages if he does not retract comments linking her to Jeffrey Epstein. Mr Biden, who is the son of former US president Joe Biden, alleged in an interview this month that sex trafficker Epstein introduced the first lady to President Donald Trump. \"Epstein introduced Melania to Trump. The connections are, like, so wide and deep,\" he claimed. Ms Trump's lawyer labelled the comments false, defamatory and \"extremely salacious\" in a letter to Mr Biden.  Her lawyer wrote that the first lady suffered \"overwhelming financial and reputational harm\" as the claims were widely discussed on social media and reported by media around the world. The president and first lady previously said they were introduced by modelling agent Paolo Zampolli at a New York Fashion Week party in 1998. Mr Biden attributed the claim that Epstein introduced the couple to author Michael Wolff, who was accused by Mr Trump of making up stories to sell books in June and was dubbed a \"third-rate reporter\" by the president. The former president's son doubled down on his remarks in a follow-up interview with the same YouTube outlet, Channel 5 with Andrew Callaghan, that was given the title \"Hunter Biden Apology\". Asked if he would apologise to the first lady, Mr Biden responded: \"F*** that - that's not going to happen.\" He added: \"I don't think these threats of lawsuits add up to anything other than designed distraction.\" Ms Trump's threat to sue Mr Biden echoes a strategy employed by her husband, who has aggressively used legal action to go after critics. Public figures like the Trumps must meet a high bar to succeed in a defamation suit like the one that could be brought by the first lady if she follows through with her threat. In his initial interview, Mr Biden also hit out at \"elites\" and others in the Democratic Party, who he claims undermined his father before he dropped out of last year's race for president. Read more from Sky News:What to expect from Trump-Putin summitNational Guard on streets of Washington DC The letter threatening legal action against Mr Biden is dated 6 August and was first reported by Fox News Digital. It was addressed to Abbe Lowell, a lawyer who has represented Mr Biden in his criminal cases. Mr Lowell has not yet commented on the letter.  Read more: What you need to know about Trump, Epstein and the MAGA controversy This comes as pressure on the White House to release the Epstein files has been mounting for weeks, after Mr Trump made a complete U-turn on his administration's promise to release more information publicly. The US Justice Department, which confirmed in July that it would not be releasing the files, said a review of the Epstein case had found \"no incriminating 'client list'\" and \"no credible evidence\" the jailed financier - who killed himself in prison in 2019 - had blackmailed famous men."
    },
    {
        "title": "Past US-Russia summits required detailed preparation - but will Trump surprise us all?",
        "description": "History-making summits between the US and the Soviet Union are strewn through the decades, dripping with mutual suspicion but significantly shaping the course of events after the Cold War.",
        "url": "https://news.sky.com/story/past-us-russia-summits-required-detailed-preparation-but-will-trump-surprise-us-all-13411906",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-putin-helsinki_6991167.jpg?20250814231055",
        "type": "US",
        "Author": "Mark Austin",
        "Date Published": "2025-08-14 23:01:00",
        "Headline": "Hurriedly arranged and without much idea about what will emerge, Donald Trump takes a very different approach to the latest US-Russia summit.",
        "Content": "\n          Chief presenter\n       History-making summits between the US and the Soviet Union are strewn through the decades, dripping with mutual suspicion but significantly shaping the course of events after the Cold War. Think Nixon-Brezhnev in Moscow in 1972 when they signed a landmark arms treaty. Think Reagan-Gorbachev in Geneva and Reykjavik and others, which ended in limiting short and intermediate-range ballistic missiles. All these summits required huge planning and detailed preparation. Follow latest updates from Ukraine war Donald Trump's summits are different, at least this one is. Hurriedly arranged and without much idea about what will emerge. The US president is on record as saying there is a 25% chance it won't be a success. \n                  Ukrainians are appalled at Trump's naive and cack-handed diplomacy\n                 \n                  If Trump sticks to the script at Putin summit there may be a ceasefire in Ukraine\n                 \n                  Trump's pride vs Putin's legacy: What to expect from pivotal Ukraine summit\n                  The circumstances are very different. This time, it is about Vladimir Putin's invasion of a sovereign country and how to bring the fighting to an end. The fear is that Trump will once again give Putin the benefit of the doubt. I was in Helsinki in 2018 when there were sharp intakes of breath as Trump literally sided with the Russian president over his own intelligence chiefs. Not privately, but in the news conference that followed. It was all about Russian interference in the 2016 election. Read more:What could Ukraine be asked to give up?What to expect from pivotal Ukraine summit Trump said: \"My people came to me and they all said they think it's Russia. I have President Putin here and he says it wasn't Russia and I have to say this, I don't see any reason why it would be.\" It was a pretty bad look, an American president undermining the work of the country's intelligence agencies. Former Trump foreign policy advisor Fiona Hill remembers it well. She was there and was horrified. She said afterwards that it literally crossed her mind to fake some kind of medical emergency to bring the whole thing to an end. Here in Alaska, the plan is, once again, for Trump and Putin to have talks alone, other than translators.  Their negotiating teams will eventually join them but Ukraine and Volodymyr Zelenskyy are desperately worried that Trump will be outmanoeuvred. The experienced, ruthless ex-KGB man is nothing if not a survivor and his aim is to buy time and continue the war. This time, Trump has European leaders in his ear like never before. Will he listen and, more importantly, will he surprise us all?"
    },
    {
        "title": "Nicholas Rossi found guilty of rape charge",
        "description": "Nicholas Rossi, an American man who faked his death and fled to the UK to escape rape charges, has been found guilty of one of them at a court in Utah.",
        "url": "https://news.sky.com/story/nicholas-rossi-found-guilty-of-rape-charge-13411386",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nicholas-rossi-arthur-knight_6988551.jpg?20250812035959",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-14 03:22:00",
        "Headline": "Earlier this week, the court heard from Rossi's victim who said he raped her after becoming controlling and \"mean\".",
        "Content": "Nicholas Rossi, an American man who faked his death and fled to the UK to escape rape charges, has been found guilty of one of them at a court in Utah. The 38-year-old was accused of sexually assaulting two women in the state in 2008 - one in Salt Lake County, the other in Utah County. He denied the charges. Prosecutors are trying the cases separately. Read more: My experience interviewing Nicholas Rossi The Salt Lake County court heard from his accuser and her parents during the three-day trial. Rossi declined to testify on his own behalf. His accuser said Rossi held her down and \"forced me to have sex with him\". The court heard that she began a relationship with Rossi while recovering from a traumatic brain injury in 2008. The woman, who can't be named for legal reasons, said she responded to a personal ad Rossi had placed on Craigslist and the pair were engaged within about two weeks. But the relationship soured and Rossi became \"controlling and saying mean things to me\", the court heard.  She described an incident on the day she was raped in which Rossi pounded on her car and used his body to block her from pulling out of a garage. When she eventually went into the house with him, he pushed her onto his bed, held her down and \"forced me to have sex with him\", she testified. Rossi appeared in court in a wheelchair, wearing a suit and tie and using an oxygen tank. Despite prosecutors saying he had used at least a dozen aliases over the years, his victim identified Rossi from the witness stand, saying he's \"a little bit heavier, a little bit older\" but mostly looks the same. Rossi's lawyers sought to convince the jury that her motivation in accusing him of rape was resentment over their relationship. He will face sentencing on 20 October for this case, and is set to stand trial in September for the other rape charge in Utah County. 👉 Listen to Sky News Daily on your podcast app 👈 In 2020, Rossi faked his own death and fled to the UK to avoid criminal charges. After marrying Miranda Knight in Bristol, the pair moved to Glasgow, where he was ultimately caught by police while he was in hospital being treated for COVID. Medical staff at the Queen Elizabeth University Hospital recognised him from his tattoos, images of which had been circulated on an Interpol red notice."
    },
    {
        "title": "Pictures of 'zombie-rabbits' with twisting black horns go viral - so are they real?",
        "description": "Photos of rabbits in Colorado with black, horn-like growths around their faces have gone viral, with some describing the animals as \"Frankenstein-\", \"zombie-\" and \"demon-rabbits\".",
        "url": "https://news.sky.com/story/pictures-of-zombie-rabbits-with-twisting-black-horns-go-viral-so-are-they-real-13411379",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rabbit-cotton-tail_6990221.jpg?20250814015240",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-08-14 00:33:00",
        "Headline": "The horn-like growths are harmless to the bunnies, unless they grow on sensitive areas like the eyes or mouth, or interfere with eating.",
        "Content": "\n          Science and technology reporter\n       Photos of rabbits in Colorado with black, horn-like growths around their faces have gone viral, with some describing the animals as \"Frankenstein-\", \"zombie-\" and \"demon-rabbits\". Warning: This article contains images of infected rabbits, which some readers may find disturbing. Residents in Fort Collins near Denver recently began posting pictures of the cottontail bunnies, causing a stir online. \"This is how the zombie virus starts,\" posted one Instagram user on a post showing the rabbits. \"We've got freaking zombie rabbits now?!\" posted another on YouTube. So what's going on? Firstly, the pictures are real - despite some wishing they weren't. \"One time I need this to be AI,\" wrote one Instagram user on a post showing the horned bunnies. The rabbits are suffering from a relatively harmless disease called Shope Papilloma Virus, according to Colorado Parks and Wildlife. Although the wildlife agency is getting calls from people spotting the infected rabbits in Fort Collins, they're not an unusual sight, according to spokesperson Kara Van Hoose. The disease is mainly found in America's Midwest, according to the University of Missouri, and is more noticeable in the summer, when the fleas and ticks that spread the virus are most active. The virus can also spread through rabbit-to-rabbit contact but not to other species like humans or dogs and cats, according to Ms Van Hoose. People are being warned not to touch the infected rabbits, however. Read more like this:The real 'zombie fungus' behind The Last Of Us Do the growths hurt the rabbits? The horn-like growths, or papillomas, are harmless to the bunnies, unless they grow on sensitive areas like the eyes or mouth or interfere with eating. Once the rabbits' immune systems have fought the virus, the growths will disappear. Although infected wild rabbits usually don't need treatment, it can be dangerous to pet rabbits, so officials recommend getting pet bunnies treated by a vet. The mythical jackalope It's not a new illness, and is even thought to have inspired the centuries-old myth of the \"jackalope\", a rabbit with antelope antlers. Although hunters had long known about the disease, it was first scientifically reported in 1931 by Richard E Shope - hence the name. Since then, the rabbits' warts and horns have contributed to life-saving scientific understanding, including how viruses can be linked to cancer, like the HPV virus to cervical cancer."
    },
    {
        "title": "Vivergo: How US-UK trade deal could bring about collapse of huge renewable energy plant in Hull",
        "description": "The smell of yeast still hangs in the air at the Vivergo plant in Hull but the machines have fallen quiet.&#160;",
        "url": "https://news.sky.com/story/vivergo-how-us-uk-trade-deal-could-bring-about-collapse-of-huge-renewable-energy-plant-in-hull-13411833",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vivergo-hull-plant_6991078.png?20250814210458",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-14 18:58:00",
        "Headline": "Vivergo was already being annihilated by US rivals before the trade deal allowed 1.4 billion litres of American ethanol to be imported into the UK tariff-free.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n The smell of yeast still hangs in the air at the Vivergo plant in Hull but the machines have fallen quiet.  More than 100 lorries usually pass through here each day, carrying 3,000 tonnes of wheat. It is milled, fermented and distilled. The final product is bioethanol, a renewable fuel that is then blended into E10 petrol. This is a vast operation. It took several years to build, with considerable investment, but it is on the verge of closing down. Management and staff are holding out for a last-minute reprieve from the government but time is running out. It's been a turbulent journey. The plant was already being annihilated by US rivals, losing about £3m a month. Vivergo and Ensus, based in Teesside, blamed regulations that enable US companies to earn double subsidies. They were pushing for regulatory change but then a killer blow: The US-UK trade deal, which allows 1.4 billion litres of American ethanol into the UK tariff-free (down from 19%). \"We've effectively given the whole of the UK market to the US producers,\" said Ben Hackett, managing director at Vivergo. \"If we were to have the same support that the US industry has, if we could use genetically modified crops, we wouldn't need that tariff. We would be able to compete. If we had the same energy costs. We wouldn't need those tariffs.\" \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 \n                  UK quarterly GDP slows as economy feels effect of higher business costs\n                 \n                  Something for everyone in UK's latest GDP data\n                 The government has the weekend to come up with a plan that could keep the business running. If it fails, Vivergo will begin issuing redundancy notices to its 160 staff. It's a devastating prospect for workers, many of them live in Hull and are nervous about alternative opportunities in the area. Mike Walsh, a logistics manager who has been working at the plant for 14 years, said: \"It's not a great place to be at the moment. It's a very well paid, very high-skilled role and they've (Vivergo) given everybody an opportunity in an area that doesn't pay that well…. The jobs market isn't as good as what people would like. So it does impact the local economy.\" He called on the government to \"help us, save us, give this industry a future\". His colleague Claire Wood, lead productions engineer, said: \"I moved here after a career in oil and gas for 10 years, partly because I want to be part of the transition to renewable fuels. I can see so much potential here and it's absolutely devastating to know that this place might be closed very, very shortly and that all that potential just goes away.\" Thousands more could be affected. Haulage companies may have to lay off truck drivers and farmers could also suffer a blow. Vivergo makes bioethanol using wheat. That wheat is bought from farms from Yorkshire and Lincolnshire. The National Farmers Union has sounded the alarm, saying: \"Biofuels are extremely important for the crops sector, and their domestic demand of up to two million tonnes can be very important to balance supply and demand and to produce up to one million tonnes of animal feed as a by-product.\" Another bioproduct is carbon dioxide. The gas can be captured and used to put the fizz in drinks or injected into packaging to preserve food. If Vivergo and Ensus were to go, Britain would lose as much as 80% of its output of carbon dioxide. Supplies are already tight across Europe, meaning this decision could compound shortages across a range of sectors, from meat-packing to healthcare. The industry is calling on the government to help. Vivergo says it needs temporary financial support but that the government must create a regulatory and commercial environment in which it can thrive. It says rules that award double subsidies to companies that use waste product in their bioethanol must be changed. At present, these rules are being used by US companies that make ethanol from Uldr - a by-product of processing corn. They argue this is not a genuine waste product. Read more money news:Something for everyone in latest economic dataClaire's falls into administrationLola's Cupcakes bakes £30m takeover by Finsbury Food Another option is to grow the market. Industry leaders are calling on ministers to increase the mandated renewable fuel content in petrol from 10% to 15% and for an expansion into aviation fuels. That would allow British companies to carve out a space. The government has been locked in talks with the company since June. It said: \"We will continue to take proactive steps to address the long-standing challenges it faces and remain committed to a way forward that protects supply chains, jobs and livelihoods.\" However, the time for talking is almost over. Mr Hackett said he had no idea how the government would respond but he was firm with his stance, saying: \"In times of global uncertainty, losing that energy certainty and supply from the UK is a problem. \"I think what they're missing out on is the future growth agenda. We're the foundation on which the green industrial strategy can be built. We make bioethanol that today decarbonises transport. Tomorrow it will decarbonise marine. It will decarbonise aviation.\""
    },
    {
        "title": "Lola's Cupcakes bakes £30m takeover by Finsbury Food",
        "description": "Lola's Cupcakes, the bakery chain which has become a familiar presence at commuter rail stations and in major shopping centres, is in advanced talks about a sale valuing it at more than &#163;25m.",
        "url": "https://news.sky.com/story/lola8217s-cupcakes-bakes-16330m-takeover-by-finsbury-food-13411626",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lolas-cupcakes-lolas_6990585.jpg?20250814123910",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-14 11:42:00",
        "Headline": "A deal for the DBAY Advisors-owned cake manufacturer to buy the chain of outlets producing handcrafted cupcakes is expected to be signed within days, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lola's Cupcakes, the bakery chain which has become a familiar presence at commuter rail stations and in major shopping centres, is in advanced talks about a sale valuing it at more than £25m. Sky News has learnt that Finsbury Food, the speciality bakery business which was listed on the London Stock Exchange until being taken over in 2023, is within days of signing a deal to buy Lola's. City sources said on Thursday that Finsbury Food was expected to acquire a 70% stake in the cupcake chain, which trades from scores of outlets and vending machines. Lola's Cupcakes was founded in 2006 by Victoria Jossel and Romy Lewis, who opened concessions in Selfridges and Topshop as well as a flagship store in London's Mayfair. Money latest: Follow live updates The brand has grown significantly in recent years, and now has a presence in rail stations such as Waterloo and King's Cross. The company employs more than 400 people and has a franchise operation in Japan. \n                  Vivergo: How US-UK trade deal could bring about collapse of huge renewable energy plant in Hull\n                 \n                  UK quarterly GDP slows as economy feels effect of higher business costs\n                 \n                  Something for everyone in UK's latest GDP data\n                 Read more money newsSomething for everyone in latest economic dataClaire's falls into administration  Lola's is part-owned by Sir Harry Solomon, the Premier Foods founder, and Asher Budwig, who is now the cupcake chain's managing director. The deal will be the most prominent acquisition made by Finsbury Food since it delisted from the London market nearly two years ago. Finsbury is now owned by DBAY Advisors, an investment firm. A spokesperson for Finsbury Food declined to comment."
    },
    {
        "title": "UK quarterly GDP slows as economy feels effect of higher business costs",
        "description": "UK economic growth slowed as US President Donald Trump's tariffs hit and businesses grappled with higher costs, official figures show.",
        "url": "https://news.sky.com/story/uk-growth-slows-as-economy-feels-effect-of-higher-business-costs-13411399",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-primark-oxford-street_6973127.jpg?20250725065151",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-14 06:00:00",
        "Headline": "While the figure represents a slowing, it's surprisingly better than expected, representing good news for Chancellor Rachel Reeves and a government prioritising growth. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n UK economic growth slowed as US President Donald Trump's tariffs hit and businesses grappled with higher costs, official figures show. A measure of everything produced in the economy, gross domestic product (GDP), expanded just 0.3% in the three months to June, according to the Office for National Statistics (ONS). It's a slowdown from the first three months of the year when businesses rushed to prepare for Mr Trump's taxes on imports, and GDP rose 0.7%. But it's also a stronger showing than expected and relatively welcome news for Chancellor Rachel Reeves, whose government has staked its success on growing the economy. Economists polled by Reuters and the Bank of England had only anticipated GDP expansion of 0.1% across April to June. Money latest: Fortnum and Mason's pastry guru reveals supermarket dessert he loves The figure was better than anticipated after a strong June. Across the month, GDP rose 0.4%, surprising observers. \n                  Something for everyone in UK's latest GDP data\n                 \n                  Wage rises slow as retail and hospitality jobs continue to fall\n                 \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 It could mean the UK has the strongest-performing economy of the G7 club of wealthy nations for the first half of 2025, a title it held in the first three months of the year. Member state Japan has yet to report its GDP data. What happened? Caution from customers and higher costs for employers, however, led to the lower growth reading up to June rather than the previous quarter. Employers were hit with higher costs in the form of more expensive national insurance contributions and increased minimum wages. Economic activity in April and May, in particular, was weak as purchases were brought forward to early in the year ahead of the stamp duty change and tariff changes. Costs rose for households in April as energy, water and council tax bills rose, leading to higher inflation overall. Growth came from services, the largest sector of the economy, with computer programming, health and vehicle leasing performing well, the ONS's director of economic statistics, Liz McKeown, said. Scientific research and development, engineering and car sales all had a strong month in June, as did production of electronics, she added. The biggest increase in expenditure came from government spending, which was up due to higher spending on health, especially vaccinations, and public administration and defence.  Another way of measuring things When looked at on a per-person basis - which strips out the economic benefits from a larger population - GDP grew 0.7% over the past year. This metric, known as GDP per capita, better tracks living standards. Politics latest: Rachel Reeves won't rule out tightening inheritance tax rules The living standards thinktank, the Resolution Foundation, pointed out it is weaker than the 2010s average of 1.3%, and a \"far cry\" from the 2.5% growth in the pre-financial crisis period from 1993 to 2008. Political reaction Ms Reeves described the figures as \"positive with a strong start to the year and continued growth in the second quarter\". \"But there is more to do to deliver an economy that works for working people,\" she added. \"I know that the British economy has the key ingredients for success but has felt stuck for too long. \"That is why we're investing to rebuild our national infrastructure, cutting back on red tape to get Britain building again and boosting the national minimum wage to make work pay. There's more to do\". Shadow chancellor Mel Stride said the government is \"taxing the living daylights out of businesses\"."
    },
    {
        "title": "Something for everyone in UK's latest GDP data",
        "description": "Growth figures for the second quarter of the year have something for everyone.",
        "url": "https://news.sky.com/story/something-for-everyone-in-uks-latest-gdp-data-13411567",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves_6983883.jpg?20250806080017",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-14 09:55:00",
        "Headline": "Arguments over nuances in the numbers often say more about the political issue of the day and the failings of economic forecasters than the reality for households and businesses.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Growth figures for the second quarter of the year have something for everyone. A better-than-expected outturn of 0.3% over three months, helped by a healthy 0.4% bounce in June, put a little spring in the chancellor's step on the long road to the autumn budget. For her critics, meanwhile, any slowdown from the 0.7% recorded in the first three months of the year would be cast as failure, even if the figure was much improved on the 0.1% consensus forecast among economists. Politics latest: Reeves won't rule out change to inheritance tax rules Arguments over nuances in the numbers often say more about the politics of the day and the failings of economic forecasters than the reality for households and businesses.For Rachel Reeves, facing darkening forecasts for inflation, unemployment and the size of the hole in the public finances, there is qualified good news here. The economy is undoubtedly growing, albeit more slowly in the past three months than in the first quarter, and taken together, growth of 1% is the strongest in the G7 in the first half of this year. More awkwardly for a government that made growth its priority on taking office, the slowdown in the second quarter coincides with the hike in employment taxes in April that was the centrepiece of the last budget. \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 Money blog: Restaurant owner fumes over pretty much everythingThe underlying figures also show that public spending was the largest driver of growth, but it is the private sector that needs to thrive to meaningfully change the equation when Ms Reeves comes to balance the books and meet her own fiscal rules. More important to most is the reality of an economy in which food and fuel inflation has become entrenched and forecast to rise further before the year is out. Interest rates have been cut further to 4%, the lowest level since March 2023, but with unemployment ticking up as the labour market tightens, the timing of further cuts remains unclear. And while wages continue to rise above inflation, increasing real-terms income, for many, it simply does not feel like it."
    },
    {
        "title": "Searchlight strikes Chord with $400m deal for ZZ Top music-owner",
        "description": "The owner of song catalogues produced by artists such as ZZ Top and Ellie Goulding is raising hundreds of millions of dollars in a deal with the private equity firm Searchlight Capital.",
        "url": "https://news.sky.com/story/searchlight-strikes-chord-with-400m-deal-for-zz-top-music-owner-13411590",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-fashion-awards_6764867.jpg?20241203013019",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-14 10:25:00",
        "Headline": "The private equity firm is injecting the funds into Chord Music Partners, which also owns songs produced by Ellie Goulding and David Guetta, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of song catalogues produced by artists such as ZZ Top and Ellie Goulding is raising hundreds of millions of dollars in a deal with the private equity firm Searchlight Capital. Sky News has learnt that Chord Music Partners has struck an agreement for Searchlight to invest $400m in the company, which is backed by Universal Music Group (UMG), the world's leading record label. Industry sources said the deal was likely to be announced this week. Chord, which also owns the rights to songs made by Lorde, The Weeknd and John Legend, recently bought a stake in the catalogue of Morgan Wellen. The company is jointly owned by Dundee Partners, a family office, and UMG, with KKR, the private equity giant, having been a shareholder until last year. The sale of KKR's stake took place at a valuation of $1.85bn. It is the latest in a glut of deals involving prominent music rights, with a land grab for valuable entertainment content continuing to drive prices higher. \n                  Vivergo: How US-UK trade deal could bring about collapse of huge renewable energy plant in Hull\n                 \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 \n                  UK quarterly GDP slows as economy feels effect of higher business costs\n                 Chord was formed in 2021 and is expected to announce further catalogue acquisitions in the coming months. Sir Lucian Grainge, chairman and chief executive of UMG, said at the time of its Chord stake purchase: \"Finding partners who share our passion for identifying iconic songs and recordings that will stand the test of time and deliver long-term growth is essential. \"We look forward to creating maximum commercial and creative value for the songwriters and artists in Chord and building for the future.\" UMG declined to comment, while neither Chord nor Searchlight could be reached for comment."
    },
    {
        "title": "Cheap Eats: Fortnum and Mason's pastry guru reveals supermarket dessert he loves",
        "description": "Every week, our Money team interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more. ",
        "url": "https://news.sky.com/story/cheap-eats-fortnum-and-masons-pastry-guru-reveals-supermarket-dessert-he-loves-13411627",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-roger-pizey-cheap-eats_6990228.jpg?20250814053639",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-14 11:41:00",
        "Headline": "The Sky News Money blog team interviews chefs every week for our regular Cheap Eats feature. Today, Roger Pizey, head pastry chef at Fortnum and Mason, shares his thoughts on his favourite supermarket dessert, his favourite cheap meal, and his dinner party bugbear.",
        "Content": "Every week, our Money team interviews top chefs from around the UK, hearing about their cheap food hacks, views on the industry and more.  Today, they speak to Roger Pizey, head pastry chef at Fortnum and Mason... A supermarket takeaway dessert I love is... Tesco's finest meringue nests. I suppose in themselves they're not really a takeaway dessert, but sometimes I whip something up quickly at home, a DIY Eton mess of sorts. If you add a few punnets of English raspberries and a tub of thick double cream to your shop, you can add a tiny bit of vanilla, break up the meringue and crush the raspberries. Voila! For a cheap meal out I love...Volare in Bounds Green. It's a pizza restaurant run by two Spanish sisters inspired by the love and passion of their Neapolitan great-grandfather, who opened his own pizzeria in Argentina in the 1920s. I would order the Prima Vera, which costs £14.95, so you can't really go wrong there. Fior di latte mozzarella, wild rocket and some Bresaola on a tomato base - none of that white pizza nonsense! There's nothing worse than bringing a nice bottle with you to a dinner party... and then the hosts keep it for another occasion. It's really tough at the moment... There are lots of restaurants that are going to go under - especially with the rise in national insurance and minimum wage going up, as well as the new tronc system (changes to how tips are handled). The cost of ingredients has also wildly gone up. The quality of staff we have is not as good as it used to be, and from Brexit we lost lots of talent. But I feel optimistic about the 17-year-olds and the younger generation who seem to have a bit of zest and have a real interest in working hard, which is refreshing. The toughest moment of my career was... When I started at Le Gavroche it was a three-star Michelin restaurant. Albert Roux was still at the helm, and there's no doubting it was a military operation. If you didn't shave, you were given a razor. If you were in dirty whites, you were sent home. It would be so busy at Christmas time that you'd have to sleep in the restaurant sometimes - that certainly can't happen anymore. The country that makes the best desserts is... Japan is definitely up there. We've come on leaps and bounds in the UK, especially with the rise of international influences in our cuisine, and we've always had a global perspective on food with so many diverse cultures and nationalities living in the UK. We've taken on the French, who I think have been sitting on their laurels recently, and now we're outshining them! People's appetite for sugar is changing... When I started out, Frederic Bau was a big influence. He's really changed the mindsets of pastry chefs recently, by recreating his classics - but with less fat and sugar. It's something we can't ignore, but people's appetites for sugar is changing - his philosophy was to create the same mouth feel, textures and flavours but with 30% less sugar. The best place to eat outside of the UK... One year in Spain, I did the Camino de Santiago walk for 30km and for some reason the only thing I wanted to eat was a Chinese meal. When I finished the walk, I went looking for my Chinese meal and instead stumbled across all these amazing local restaurants and was totally blown away. Eating hake and beans, beautiful octopus, fresh seafood, it was glorious. More Cheap Eats:Top chef on how you should complain'Celebrity chefs are worst thing in industry''We charge diners £225 for our tasting menu' One less common ingredient that I couldn't live without is... Fresh Madagascan vanilla from Zazou Emporium. It's the crown jewels of what we do in pastry. It's just stunning, you can put it in anything - you can even add it to your coffee. It just gives everything this lift and sparkle that's very subtle, but you can't go without it. Good quality stuff and fresh too - that's where it's at. One Fortnum and Mason item I think it's worth splashing out for... is the black garlic and miso paste from our new range on the third floor of the shop. We have a beautiful new range of infused oils, sauces and nut pastes, which are full of umami flavour and depth, not to mention our shiny new branding too, which looks pretty sharpish. If I'm using it at home, I might deglaze my pan from cooking a pork chop with some wine and the paste to make a good sauce, or it actually goes incredibly well with vanilla ice cream."
    },
    {
        "title": "MoD urged to reveal details of nuclear incident at Faslane",
        "description": "The Ministry of Defence is being urged to reveal details of a nuclear incident that took place at Faslane naval base earlier this year.",
        "url": "https://news.sky.com/story/mod-urged-to-reveal-details-of-serious-nuclear-incident-at-faslane-13411531",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nuclear-submarines_6848069.jpg?20250814102635",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-14 09:18:00",
        "Headline": "Figures show a Category A event occurred at HMNB Clyde - home to the UK's nuclear submarines - between 1 January and 22 April 2025.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Ministry of Defence is being urged to reveal details of a nuclear incident that took place at Faslane naval base earlier this year. Figures show that a Category A event occurred at HMNB Clyde between 1 January and 22 April. The Ministry of Defence (MoD) defines Category A as the most serious - however, it has claimed the incident was categorised as of \"low safety significance\" and did not pose a risk to the public or result in any radiological impact to the environment. HMNB Clyde is based on the banks of Gare Loch at Faslane in Argyll and Bute. It is the Royal Navy's headquarters in Scotland and is home to Britain's nuclear submarines, which includes the Vanguard vessels armed with Trident missiles. Nuclear Site Event Reports (NSERs) detail incidents at nuclear facilities and are classified based on their safety significance and impact. Responding to a written question earlier this year by SNP MP Dave Doogan, Maria Eagle, minister for defence procurement and industry, confirmed dozens of incidents at Faslane and nearby RNAD Coulport - the storage and loading facility for the Trident programme. \n                  Victims of Afghan data leak receive scam emails offering tens of thousands in compensation, Sky News can reveal\n                 \n                  Spies and special forces among more than 100 Britons whose details were included in Afghan data leak\n                 \n                  'My family is finished': Afghan man in UK military data breach says he feels betrayed\n                 Nuclear site events (22 April 2024 to 22 April 2025): • Coulport: 13 Category C and 34 Category D• Faslane: 1 Category A, 5 Category B, 29 Category C, and 71 Category D Ms Eagle said she could not provide specific details of the Category A or B incidents \"as disclosure would, or would be likely to, prejudice the capability, effectiveness or security of any relevant forces\". She assured Mr Doogan that \"none of the events caused harm to the health of any member of staff or to any member of the public and none have resulted in any radiological impact to the environment\". In a letter to Mr Doogan, UK Defence Secretary John Healey said: \"I can confirm that all reported events were categorised as of low safety significance. \"In accordance with the International Nuclear and Radiological Event Scale (lNES) significant safety incidents are categorised at the lowest level - level one of seven. \"Incidents that might fall into this category include equipment failures, human error, procedural failings or near misses where no harm [was] caused to the health of any member of naval base staff, any member of the public, or any resultant radiological impact to the environment.\" Read more from Sky News:Inside the Glasgow factory shaping the next generation of warfare In the past week, concerns have been reignited over the environmental and public health impact of the UK's nuclear weapons programme. It comes following an investigation by The Guardian and The Ferret, which uncovered radioactive water from RNAD Coulport had leaked into Loch Long due to faulty old pipes back in 2019. The secrecy battle went on for six years. The Scottish Environment Protection Agency (SEPA) reported the discharges were \"of no regulatory concern\", while the MoD said there had been \"no unsafe releases of radioactive material\" into the environment. In response to the \"catalogue of failures\", the SNP's deputy leader is calling for an \"urgent explanation\" from the UK government as to what actually happened at Faslane. MSP Keith Brown said: \"Nuclear weapons are an ever-present danger and this new information is deeply worrying. \"With repeated reports of serious incidents at Faslane and now confirmed radioactive contamination in Loch Long, it's clear these weapons are not only poorly maintained but are a direct threat to our environment, our communities, and our safety. \"Worse still, the Labour government is refusing to provide any details about the Category A incident.\" The MoD said it was unable to disclose the details of the incidents reported for \"national security reasons\", but stressed all were categorised as of \"low safety significance\". A spokesperson for the MoD said: \"We place the upmost importance on handling radioactive substances safely and securely. \"Nuclear Site Event Reports demonstrate our robust safety culture and commitment to learn from experience. \"The incidents posed no risk to the public and did not result in any radiological impact to the environment. It is factually incorrect to suggest otherwise. \"Our government backs our nuclear deterrent as the ultimate guarantor of our national security.\""
    },
    {
        "title": "UK quarterly GDP slows as economy feels effect of higher business costs",
        "description": "UK economic growth slowed as US President Donald Trump's tariffs hit and businesses grappled with higher costs, official figures show.",
        "url": "https://news.sky.com/story/uk-growth-slows-as-economy-feels-effect-of-higher-business-costs-13411399",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-primark-oxford-street_6973127.jpg?20250725065151",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-14 06:00:00",
        "Headline": "While the figure represents a slowing, it's surprisingly better than expected, representing good news for Chancellor Rachel Reeves and a government prioritising growth. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n UK economic growth slowed as US President Donald Trump's tariffs hit and businesses grappled with higher costs, official figures show. A measure of everything produced in the economy, gross domestic product (GDP), expanded just 0.3% in the three months to June, according to the Office for National Statistics (ONS). It's a slowdown from the first three months of the year when businesses rushed to prepare for Mr Trump's taxes on imports, and GDP rose 0.7%. But it's also a stronger showing than expected and relatively welcome news for Chancellor Rachel Reeves, whose government has staked its success on growing the economy. Economists polled by Reuters and the Bank of England had only anticipated GDP expansion of 0.1% across April to June. Money latest: Fortnum and Mason's pastry guru reveals supermarket dessert he loves The figure was better than anticipated after a strong June. Across the month, GDP rose 0.4%, surprising observers. \n                  Something for everyone in UK's latest GDP data\n                 \n                  Wage rises slow as retail and hospitality jobs continue to fall\n                 \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 It could mean the UK has the strongest-performing economy of the G7 club of wealthy nations for the first half of 2025, a title it held in the first three months of the year. Member state Japan has yet to report its GDP data. What happened? Caution from customers and higher costs for employers, however, led to the lower growth reading up to June rather than the previous quarter. Employers were hit with higher costs in the form of more expensive national insurance contributions and increased minimum wages. Economic activity in April and May, in particular, was weak as purchases were brought forward to early in the year ahead of the stamp duty change and tariff changes. Costs rose for households in April as energy, water and council tax bills rose, leading to higher inflation overall. Growth came from services, the largest sector of the economy, with computer programming, health and vehicle leasing performing well, the ONS's director of economic statistics, Liz McKeown, said. Scientific research and development, engineering and car sales all had a strong month in June, as did production of electronics, she added. The biggest increase in expenditure came from government spending, which was up due to higher spending on health, especially vaccinations, and public administration and defence.  Another way of measuring things When looked at on a per-person basis - which strips out the economic benefits from a larger population - GDP grew 0.7% over the past year. This metric, known as GDP per capita, better tracks living standards. Politics latest: Rachel Reeves won't rule out tightening inheritance tax rules The living standards thinktank, the Resolution Foundation, pointed out it is weaker than the 2010s average of 1.3%, and a \"far cry\" from the 2.5% growth in the pre-financial crisis period from 1993 to 2008. Political reaction Ms Reeves described the figures as \"positive with a strong start to the year and continued growth in the second quarter\". \"But there is more to do to deliver an economy that works for working people,\" she added. \"I know that the British economy has the key ingredients for success but has felt stuck for too long. \"That is why we're investing to rebuild our national infrastructure, cutting back on red tape to get Britain building again and boosting the national minimum wage to make work pay. There's more to do\". Shadow chancellor Mel Stride said the government is \"taxing the living daylights out of businesses\"."
    },
    {
        "title": "Something for everyone in UK's latest GDP data",
        "description": "Growth figures for the second quarter of the year have something for everyone.",
        "url": "https://news.sky.com/story/something-for-everyone-in-uks-latest-gdp-data-13411567",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves_6983883.jpg?20250806080017",
        "type": "Politics",
        "Author": "Paul Kelso",
        "Date Published": "2025-08-14 09:55:00",
        "Headline": "Arguments over nuances in the numbers often say more about the political issue of the day and the failings of economic forecasters than the reality for households and businesses.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Growth figures for the second quarter of the year have something for everyone. A better-than-expected outturn of 0.3% over three months, helped by a healthy 0.4% bounce in June, put a little spring in the chancellor's step on the long road to the autumn budget. For her critics, meanwhile, any slowdown from the 0.7% recorded in the first three months of the year would be cast as failure, even if the figure was much improved on the 0.1% consensus forecast among economists. Politics latest: Reeves won't rule out change to inheritance tax rules Arguments over nuances in the numbers often say more about the politics of the day and the failings of economic forecasters than the reality for households and businesses.For Rachel Reeves, facing darkening forecasts for inflation, unemployment and the size of the hole in the public finances, there is qualified good news here. The economy is undoubtedly growing, albeit more slowly in the past three months than in the first quarter, and taken together, growth of 1% is the strongest in the G7 in the first half of this year. More awkwardly for a government that made growth its priority on taking office, the slowdown in the second quarter coincides with the hike in employment taxes in April that was the centrepiece of the last budget. \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \n                  Chancellor warned 'substantial tax rises' needed - as she faces 'impossible trilemma'\n                 Money blog: Restaurant owner fumes over pretty much everythingThe underlying figures also show that public spending was the largest driver of growth, but it is the private sector that needs to thrive to meaningfully change the equation when Ms Reeves comes to balance the books and meet her own fiscal rules. More important to most is the reality of an economy in which food and fuel inflation has become entrenched and forecast to rise further before the year is out. Interest rates have been cut further to 4%, the lowest level since March 2023, but with unemployment ticking up as the labour market tightens, the timing of further cuts remains unclear. And while wages continue to rise above inflation, increasing real-terms income, for many, it simply does not feel like it."
    },
    {
        "title": "Pictures of 'zombie-rabbits' with twisting black horns go viral - so are they real?",
        "description": "Photos of rabbits in Colorado with black, horn-like growths around their faces have gone viral, with some describing the animals as \"Frankenstein-\", \"zombie-\" and \"demon-rabbits\".",
        "url": "https://news.sky.com/story/pictures-of-zombie-rabbits-with-twisting-black-horns-go-viral-so-are-they-real-13411379",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rabbit-cotton-tail_6990221.jpg?20250814015240",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-08-14 00:33:00",
        "Headline": "The horn-like growths are harmless to the bunnies, unless they grow on sensitive areas like the eyes or mouth, or interfere with eating.",
        "Content": "\n          Science and technology reporter\n       Photos of rabbits in Colorado with black, horn-like growths around their faces have gone viral, with some describing the animals as \"Frankenstein-\", \"zombie-\" and \"demon-rabbits\". Warning: This article contains images of infected rabbits, which some readers may find disturbing. Residents in Fort Collins near Denver recently began posting pictures of the cottontail bunnies, causing a stir online. \"This is how the zombie virus starts,\" posted one Instagram user on a post showing the rabbits. \"We've got freaking zombie rabbits now?!\" posted another on YouTube. So what's going on? Firstly, the pictures are real - despite some wishing they weren't. \"One time I need this to be AI,\" wrote one Instagram user on a post showing the horned bunnies. The rabbits are suffering from a relatively harmless disease called Shope Papilloma Virus, according to Colorado Parks and Wildlife. Although the wildlife agency is getting calls from people spotting the infected rabbits in Fort Collins, they're not an unusual sight, according to spokesperson Kara Van Hoose. The disease is mainly found in America's Midwest, according to the University of Missouri, and is more noticeable in the summer, when the fleas and ticks that spread the virus are most active. The virus can also spread through rabbit-to-rabbit contact but not to other species like humans or dogs and cats, according to Ms Van Hoose. People are being warned not to touch the infected rabbits, however. Read more like this:The real 'zombie fungus' behind The Last Of Us Do the growths hurt the rabbits? The horn-like growths, or papillomas, are harmless to the bunnies, unless they grow on sensitive areas like the eyes or mouth or interfere with eating. Once the rabbits' immune systems have fought the virus, the growths will disappear. Although infected wild rabbits usually don't need treatment, it can be dangerous to pet rabbits, so officials recommend getting pet bunnies treated by a vet. The mythical jackalope It's not a new illness, and is even thought to have inspired the centuries-old myth of the \"jackalope\", a rabbit with antelope antlers. Although hunters had long known about the disease, it was first scientifically reported in 1931 by Richard E Shope - hence the name. Since then, the rabbits' warts and horns have contributed to life-saving scientific understanding, including how viruses can be linked to cancer, like the HPV virus to cervical cancer."
    },
    {
        "title": "Causes, symptoms and how to prevent chikungunya - as cases rise in the UK",
        "description": "Health authorities have warned of a \"worrying increase\" in cases of a mosquito-borne infection in people returning to the UK from abroad.",
        "url": "https://news.sky.com/story/causes-symptoms-and-how-to-prevent-chikungunya-as-cases-rise-in-the-uk-13411444",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-mosquito-uk_6990581.jpg?20250814123801",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-14 06:59:00",
        "Headline": "Cases of chikungunya in travellers returning to the UK have more than doubled compared to last year. For the first time, cases of the oropouche virus have also been reported in the country. Here is all you need to know.",
        "Content": "Health authorities have warned of a \"worrying increase\" in cases of a mosquito-borne infection in people returning to the UK from abroad. A total of 73 cases of chikungunya were reported between January and June 2025 - more than double the 27 cases reported in the same period last year, the UK Health Agency (UKHSA) said. Data released by the agency also revealed three cases of oropouche virus, marking the first time the virus has been reported in the UK. Here is everything you need to know about both viruses, from symptoms to prevention and what could be behind the surge in cases. What is chikungunya? Chikungunya is a disease caused by a virus of the same name. It was first identified following an outbreak in Tanzania in 1952. The name is derived from a word in the Tanzanian language Makonde, and means \"that which bends up\", owing to the joint pain it can cause. It is spread by mosquito bites, specifically from yellow fever and tiger mosquitoes, in tropical and subtropical regions. What are the symptoms? Typical symptoms include fever, muscle pain, nausea, fatigue and a rash. The UKHSA says joint pain can persist for months or even years, with up to 12% of people still experiencing discomfort three years after infection. The majority of people who become infected recover within one to two weeks without needing medical attention. Serious complications are uncommon, and only very rare cases are fatal. Babies or elderly people with other underlying illnesses are the most vulnerable. The two mosquitoes known to transmit the disease, yellow fever and tiger, are not currently found in the UK. How does oropouche virus differ? Oropouche virus is spread predominantly by midge bites rather than mosquito bites. While bites from both insects can cause red itchy lumps on the skin, mosquito bites are generally larger and more painful, while midge bites are smaller and may last longer. Symptoms can be similar to chikungunya, and include joint paint, headache, chills, nausea and high fever. The UKHSA says anyone who becomes unwell with these symptoms after travelling should seek \"urgent medical advice\". Where can you catch the viruses? Regular outbreaks of chikungunya occur in Africa, Asia and the Americas, with occasional smaller instances in Europe. The UKHSA said the majority of the 73 reported cases from the first six months of this year reported travelling to Sri Lanka, India and Mauritius. The cases were linked to local outbreaks in the Indian Ocean region. As of last month, there have been about 240,000 cases of chikungunya - and 90 deaths - in 16 countries, according to the European Centres for Disease Prevention and Control (ECDC). Meanwhile, all the UK cases of oropouche virus were associated with travel to Brazil. Last year, 44 cases were reported in several European countries including Spain, Italy, France, Germany, Austria, Sweden and the Netherlands, according to the ECDC. China is currently experiencing the biggest chikungunya outbreak ever documented in the country, according to Cesar Lopez-Camacho of the University of Oxford. More than 7,000 cases have been reported since June, with 90% of those concentrated in Guangdong province, which borders Hong Kong. How to prepare before travelling Dr Philip Veal, a consultant in public health at UKHSA said it is \"essential\" for people to take precautions against mosquito bites when travelling. \"Simple steps, such as using insect repellent, covering up your skin and sleeping under insecticide-treated bed nets can greatly reduce the risk,\" he said. Checking the latest health advice on your destination before you travel is also recommended. The LSHTM added that people can do the following to reduce exposure to mosquito and midge bites:• Fit screens to windows and doors;• Avoid peak activity during dusk and dawn;• Get rid of any standing water where mosquitoes breed. There are also two vaccines for chikungunya approved for use in the UK: IXCHIQ, for people aged 18 to 59 and Vimkunya, for individuals 12 years and older. Both are available to buy privately from travel clinics after an assessment by a healthcare professional. Read more from Sky News:What are 'zombie rabbits'?Baby Shark plagiarism case rejected What's behind the increase in cases? The number of outbreaks of chikungunya has increased since 2000, Robert Jones, an assistant professor at the London School of Hygiene and Tropical Medicine (LSHTM) said. Mr Jones put this boom partly down to climate change and urban expansion. Dr Yang Liu, another professor at LSHTM, said the outbreak in China is not totally unexpected, but highlights the manifestation of a known risk, as yellow fever and tiger mosquitoes have been present in the area for many years."
    },
    {
        "title": "Taylor Swift reveals release date for new album",
        "description": "Taylor Swift has revealed the release date for her new album, The Life Of A Showgirl.",
        "url": "https://news.sky.com/story/taylor-swift-reveals-release-date-for-new-album-13411382",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-taylor-swift-showgirl_6990225.jpg?20250814035944",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-14 02:46:00",
        "Headline": "The album follows last year's The Tortured Poets Department, which was released during the Eras tour.",
        "Content": " Taylor Swift has revealed the release date for her new album, The Life Of A Showgirl. The pop megastar announced her 12th studio album earlier this week but didn't give many details. Now, in social media posts and an appearance on boyfriend Travis Kelce's sports podcast, Swift revealed just what fans can expect from the new album. The Life of Showgirl, written during the European leg of her record-breaking Eras tour, will be released on 3 October. It consists of 12 songs, including the title track that features pop star Sabrina Carpenter. The full track list is: 1. The Fate Of Ophelia2. Elizabeth Taylor3. Opalite4. Father Figure5. Eldest Daughter6. Ruin The Friendship7. Actually Romantic8. Wi$h Li$t9. Wood10. Cancelled!11. Honey12. The Life Of A Showgirl (featuring Sabrina Carpenter) Long-time collaborators Max Martin and Shellback, two Swedish producers who worked with Swift on some of her biggest hits, joined the pop star for this album. Within four hours of posting the full podcast episode on YouTube, it had already gathered 4.7m views. 'The hardest-working star in pop' The album follows last year's The Tortured Poets Department, which was released during the Eras tour. That tour, with shows on five continents and in 51 cities, raked in more than $2.2bn (£1.62bn) and was the highest-grossing tour of all time. Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record \"This album is about what was going on behind the scenes in my inner life during this tour, which was so exuberant and electric and vibrant,\" Swift said during her podcast appearance. Sky News culture and entertainment reporter Gemma Peplow said after her globe-trotting tour and a swathe of re-releases over recent years, the new album cemented Swift's reputation \"as the hardest-working star in pop\"."
    },
    {
        "title": "George Gilbey: Police conclude investigation into death of Gogglebox star",
        "description": "Police have concluded their investigation into the death of Gogglebox star George Gilbey.",
        "url": "https://news.sky.com/story/george-gilbey-police-conclude-investigation-into-death-of-gogglebox-star-13411464",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-george-gilbey-gogglebox_6502819.jpg?20250814084410",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-14 08:50:00",
        "Headline": "Mr Gilbey sustained traumatic injuries to his head and torso and died in Shoeburyness, Essex, on 27  March last year.",
        "Content": "Police have concluded their investigation into the death of Gogglebox star George Gilbey. Mr Gilbey sustained traumatic injuries to his head and torso and died in Shoeburyness, Essex, on 27 March last year. Coroner's officer Deborah Frost told a previous inquest hearing that the 40-year-old had been \"working on a roof when he fell through a plastic skylight, landing on the ground below\". Two men who were arrested on suspicion of gross negligence manslaughter in relation to Mr Gilbey's death will face no further police action, Essex Police said in a statement on Wednesday. \"Essex Police have confirmed their investigation into the death of George Gilbey last year has concluded,\" the force said. Police said the criminal investigation remains open and will be led by the Health and Safety Executive (HSE). HSE inspector Natalie Prince said the agency \"will continue to thoroughly investigate George's tragic death\" and \"aim to establish if there have been any breaches of health and safety law\". She added: \"We are in regular contact with George's family and our thoughts remain with them at this time.\" Mr Gilbey was best known for appearing on the Channel 4 series Gogglebox - on which participants watch and comment on TV shows from the previous week. Read more from Sky News:Travellers warned of chikungunya infectionsYellow heat health alert extended across UK He starred alongside his mother, Linda McGarry and stepfather Pete McGarry, who died aged 71 in 2021. The family first appeared on the second series of Gogglebox in 2013 but were dropped the following year when the reality star signed up for the 14th series of Celebrity Big Brother in 2014, reaching the final."
    },
    {
        "title": "Baby Shark plagiarism case rejected by South Korean court",
        "description": "South Korea's courts have rejected a plagiarism claim from a US composer who argued that Baby Shark, the catchy children's tune which became a global phenomenon, had copied his track.",
        "url": "https://news.sky.com/story/baby-shark-plagiarism-case-rejected-by-south-korean-court-13411472",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-baby-shark-nickelodeon_6990400.jpg?20250814095425",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-14 10:10:00",
        "Headline": "A New York-based composer had argued that the earworm copied elements of his tune's bass line and rhythm.",
        "Content": "South Korea's courts have rejected a plagiarism claim from a US composer who argued that Baby Shark, the catchy children's tune which became a global phenomenon, had copied his track. Jonathan Wright launched his case in the South Korean courts in 2021, arguing that Baby Shark had copied his song's bass line and rhythm, infringing on the copyright of a track he had released four years earlier. However, South Korea's top court ruled against him on Thursday, noting that both tunes were based on a classic melody played at children's summer camps in the US. The Supreme Court found Wright's tune did not vary enough from the original to qualify for copyright protection, and that Baby Shark also had clear differences as a song. Pinkfong, the South Korean children's content firm which released the earworm in 2015, welcomed the ruling, which upheld those made by the country's lower courts. Wright had twice appealed against judgments in 2021 and 2023. The ruling concludes the New York-based composer's six-year fight in the South Korean courts. His lawyer called the outcome \"a little disappointing\", Reuters reported. 'Pop culture icon' worth millions Pinkfong said the court's judgment confirmed that Baby Shark was based on a \"traditional singalong chant\" in the public domain. The firm said it had boosted the tune and given it \"a fresh twist to the chant by adding an upbeat rhythm and catchy melody, turning it into the pop culture icon it is today\". Read more:Protesters sing BabyShark to calm toddlerBabyShark bath toys recalled The firm released the track in 2015 on YouTube with a Baby Shark Dance video, which went viral. It has received more than 16 billion views since then, making it one of the most popular YouTube videos on record. The song and its associated products - including TV shows, movies and touring musicals based around the family of Baby Shark characters remain a key earner for Pinkfong, which reported $32.6m (£24m) in revenue for the first half of 2025. Wright had launched a damages claim asking for compensation of $21,700."
    },
    {
        "title": "Searchlight strikes Chord with $400m deal for ZZ Top music-owner",
        "description": "The owner of song catalogues produced by artists such as ZZ Top and Ellie Goulding is raising hundreds of millions of dollars in a deal with the private equity firm Searchlight Capital.",
        "url": "https://news.sky.com/story/searchlight-strikes-chord-with-400m-deal-for-zz-top-music-owner-13411590",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-fashion-awards_6764867.jpg?20241203013019",
        "type": "Entertainment",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-14 10:25:00",
        "Headline": "The private equity firm is injecting the funds into Chord Music Partners, which also owns songs produced by Ellie Goulding and David Guetta, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of song catalogues produced by artists such as ZZ Top and Ellie Goulding is raising hundreds of millions of dollars in a deal with the private equity firm Searchlight Capital. Sky News has learnt that Chord Music Partners has struck an agreement for Searchlight to invest $400m in the company, which is backed by Universal Music Group (UMG), the world's leading record label. Industry sources said the deal was likely to be announced this week. Chord, which also owns the rights to songs made by Lorde, The Weeknd and John Legend, recently bought a stake in the catalogue of Morgan Wellen. The company is jointly owned by Dundee Partners, a family office, and UMG, with KKR, the private equity giant, having been a shareholder until last year. The sale of KKR's stake took place at a valuation of $1.85bn. It is the latest in a glut of deals involving prominent music rights, with a land grab for valuable entertainment content continuing to drive prices higher. \n                  Vivergo: How US-UK trade deal could bring about collapse of huge renewable energy plant in Hull\n                 \n                  Lola's Cupcakes bakes £30m takeover by Finsbury Food\n                 \n                  UK quarterly GDP slows as economy feels effect of higher business costs\n                 Chord was formed in 2021 and is expected to announce further catalogue acquisitions in the coming months. Sir Lucian Grainge, chairman and chief executive of UMG, said at the time of its Chord stake purchase: \"Finding partners who share our passion for identifying iconic songs and recordings that will stand the test of time and deliver long-term growth is essential. \"We look forward to creating maximum commercial and creative value for the songwriters and artists in Chord and building for the future.\" UMG declined to comment, while neither Chord nor Searchlight could be reached for comment."
    }
]